{
  "AuthorID": "Catarina",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=306158&p=19913",
  "Posts": [
    {
      "AuthorID": "Catarina",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=306158&p=19913",
      "Content": " Hi Everyone:\n \n ",
      "MessageIndex": 8,
      "PostDate": "19/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=306158",
      "Title": "Breast Cyst?"
    },
    {
      "AuthorID": "Catarina",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=306158&p=19913",
      "Content": " Hi everyone:\nI'm new to the Forum and have a general question for everyone. I had a mammogram done a few weeks ago which stated I had a solid, sharply defined, 1 cm. nodule in my right breast that appeared benign in nature. They recommended that I have a spot compression and an ultrasound done. The mammo just confirmed what they originally thought; the ultrasound stated that the nodule was a combination of a cyst and some solid material, with multiple internal echoes. They also said the shape was lobulated. I am scheduled for a core biopsy this Friday. They recommended the biopsy because of the solid component of the nodule.\nMy question is: Does anyone know if this is what is known as a complex cyst, because of its combined nature? Is it common for complex cysts to be cancerous? I am very nervous about\n this and was hoping someone could provide me with their opinion on this. Thanks! ",
      "MessageIndex": 0,
      "PostDate": "17/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=306158",
      "Title": "Breast Cyst?"
    },
    {
      "AuthorID": "Catarina",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=306158&p=19913",
      "Content": " Thanks, JUJU. I did some research and found that in general, complex cysts have a pretty low rate of malignancy. Coupled with the fact that the initial mammogram seems to indicate it's benign, it probably IS benign, but I won't feel completely better until I know for sure. It's so nice to know that there are people out there who care! I'll let you know when I get the results, which should be early next week.\nCatarina ",
      "MessageIndex": 1,
      "PostDate": "18/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=306158",
      "Title": "Breast Cyst?"
    },
    {
      "AuthorID": "Catarina",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=306158&p=19913",
      "Content": " Hi everyone:\nI just wanted to share my good news with all of you. My biopsy results came back negative; the doctor just said the nodule was due to fibrocystic changes. Since I have very dense breasts, he wants to do another ultrasound in 3 months just to monitor the fibrocystic changes and make sure it doesn't turn into something else. Thanks again to all of you for your concern and support! I feel like a huge weight has been lifted off my shoulders.\nLove Catarina ",
      "MessageIndex": 9,
      "PostDate": "22/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=306158",
      "Title": "Breast Cyst?"
    }
  ]
}