{
  "AuthorID": "Chuckee54",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2700872&p=175181",
  "Posts": [
    {
      "AuthorID": "Chuckee54",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2700872&p=175181",
      "Content": " Thankyou for that, will let you know how I get on. Keeping my chins up! \n ",
      "MessageIndex": 6,
      "PostDate": "22/07/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2700872",
      "Title": "clustered microcalcifications"
    },
    {
      "AuthorID": "Chuckee54",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2700872&p=175181",
      "Content": " Hi, I'm new to this site but interested to hear about\n other's experiences. I had a recall last week from my routine mammogram (the first ever recall), although I have previously had 2 breast cysts drained in the left breast. However, they have found 2 clusters of micro calcifications in my right breast. I had a magnified mammogram, then an ultrasound, and after a short wait, a vacuum assisted biopsy, which I wasn't expecting. Unfortunately they hit a blood vessel and had trouble stopping the bleeding, so after an anxious week I have been told today that they didn't get any results because of this. I have another appointment next week for a needle biopsy which I hope will bring results. Although my consultant says I should not worry if it doesn't, as they will arrange for a mammogram next year just to keep an eye on it. \nI am trying not to worry too much about\n it but can't rest until I have a conclusive result. But like a lot of people on here, it's the waiting that gets to you. ",
      "MessageIndex": 4,
      "PostDate": "15/07/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2700872",
      "Title": "clustered microcalcifications"
    },
    {
      "AuthorID": "Chuckee54",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2700872&p=175181",
      "Content": " Hi Eastender, thanks for replying. I'm surprised that you also had the same problem with bleeding, as my consultant said it was very rare for that to happen. And yes, I also have a very bruised breast which is why I have to wait till next week for another biopsy. I don't know whether I've done the right thing by researching this condition or not, because on the one hand I'm very grateful to the hospital for being so vigilant, but then on the other, I'm now also aware of what lies ahead if there is anything suspicious there, and that frightens me. Just to think that only a few weeks ago I had never even heard of micro calcifications - now I feel that I know too much! Anyway thanks for the best wishes and good luck to you too in November. ",
      "MessageIndex": 5,
      "PostDate": "16/07/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2700872",
      "Title": "clustered microcalcifications"
    },
    {
      "AuthorID": "Chuckee54",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2700872&p=175181",
      "Content": " Thankyou Eastender, wishing you all the very best for November, keep positive and take care x x ",
      "MessageIndex": 8,
      "PostDate": "03/08/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2700872",
      "Title": "clustered microcalcifications"
    },
    {
      "AuthorID": "Chuckee54",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2700872&p=175181",
      "Content": " Hi Eastender, just want to report that after 2 biopsies, and what seemed like a lifetime waiting, my results have come back as normal and I will just need to have my regular mammogram in 3 years time. Pheww! :) I have to say that after a lot of research into micro calcifications, I was convinced that I would have to have surgery at the very least. So I would like to say to anyone in the same position, that everyone's case is different and although it's hard not to think the worse, as I did, that it doesn't always have to be the case. The main thing to focus on, is that if there is anything wrong then it will be caught early, which can only be a good thing.\nGood luck and best wishes to everyone on this forum xx ",
      "MessageIndex": 7,
      "PostDate": "02/08/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2700872",
      "Title": "clustered microcalcifications"
    }
  ]
}