{
  "AuthorID": "Gabii",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2701980&p=168437",
  "Posts": [{
    "AuthorID": "Gabii",
    "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2701980&p=168437",
    "Content": " I need your help. \nMy dad was diagnosed with stage 4 breast cancer a year and half ago, got it removed, but it spread into his lymphatic system. The hospital gave him three months to live, so we pulled him out of the hospital and wanted to find a cure. He did slight chemo with a vitamin C drip for a few months, but it didn't seem to help his overall health. Although the cancer might have gotten killed, he had begun to develop many different infections in his body. His legs would always swell up to twice the size because of blood clots. \nIn November, he began having really sharp pains in his right rib, feeling like it was bruised or even broken.. but he had never fallen or anything. In December, he began getting red-purple bumps that looked like burst blood vessels under his skin around his breast. They began to spread all over his chest, and little lumps began appearing below the skin surface. It is extremely itchy for him, and he can barely sleep through a night without having to wake up and be in pain. \nThe other breast now (the nipple) looks like it's infected with something inside, has a little lumps around. \nWe have no insurance and no money to go to an expensive hospital and get different types of scans. We have been keeping him on the healthiest diet, trying to give him herbal supplements like Tumeric, Ginger, Oregano, Cayenne Pepper, Nattokainaise (for the blood clots), Vitamin C, Selenium, Germanium, Zinc, Collodial Gold, and he has been heating his chest/breast with an Infrared lamp because it helps ease the pain. \nPlease provide any input, we are trying to find a cure for him. We don't have any cancer past in our family, or any other types of diseases. \nThank you, God Bless. ",
    "MessageIndex": 0,
    "PostDate": "14/04/2013",
    "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2701980",
    "Title": "Former Breast Cancer patient - red purple bruising / bumps"
  }]
}