{
  "AuthorID": "Homecare",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1929347&p=234654",
  "Posts": [
    {
      "AuthorID": "Homecare",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1929347&p=234654",
      "Content": " I, too, had a benign calcification biopsy but that was 2 years ago and here I am again going thru another biopsy because calcifications were found in the same breast only in a different spot. I am terrified of this biopsy because the 1st one was NOT pleasant in any way. The past 3 years have been bad - early 2014 I had the first biopsy and then my spouse ended up in the hospital 7 times since then and I don't need to add to the burden of me now being sick. My spouse just got out of the hospital last week. What are my chances of this being cancer? ",
      "MessageIndex": 4,
      "PostDate": "27/01/2016",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1929347",
      "Title": "Small cluster of microcalcification"
    },
    {
      "AuthorID": "Homecare",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3575275&p=234654",
      "Content": " I was called for the 2nd time in 2 years that microcalcifications were found in my left breast. I had a diagnostic mammogram done and it remains suspicious enough that I am going in for another biopsy. The first one came back benign. What are my chances of having early stage breast cancer. I am scared about\n going thru another biopsy as the first one was less than desirable. My spouse has been hospitalized 8 times in the past 25 months and this is the last thing that I need is to find out that I have cancer. ",
      "MessageIndex": 0,
      "PostDate": "27/01/2016",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3575275",
      "Title": "Microcalcifications and breast cancer"
    },
    {
      "AuthorID": "Homecare",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3575275&p=234654",
      "Content": " I don't know anything about\n a blood test being able to tell. I had my biopsy done last Friday and found out yesterday that it is benign and called fibrocystic changes. Not sure what that means but I need to have a repeat mammogram in 6 months. This is all very confusing to me after reading some of the information on line as to what causes calcifications. Some articles state that it could be residue from powders, deodorants and some lotions and when I asked the Radiologist/MD that did the biopsy about\n this he told me that none of those matter. Some articles talk that it comes from aging. I hope to be able to find some answers out to my questions. ",
      "MessageIndex": 1,
      "PostDate": "04/02/2016",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3575275",
      "Title": "Microcalcifications and breast cancer"
    },
    {
      "AuthorID": "Homecare",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3575275&p=234654",
      "Content": " I didn't have any symptoms. I went for my yearly mammogram and was called by my Ob/Gyn that I needed a follow-up mammogram and possible ultrasound because issues were found in both breasts. The one breast they found cysts and the other one there were micro calcifications (listed as suspicious) found in an area different than the 1st one 2 years ago. I went thru the biopsy and was told that they are benign due to fibrocystic changes and to return for a follow-up mammogram in 6 months. ",
      "MessageIndex": 2,
      "PostDate": "07/02/2016",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3575275",
      "Title": "Microcalcifications and breast cancer"
    }
  ]
}