{
  "AuthorID": "ICURN",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=20199",
  "Posts": [
    {
      "AuthorID": "ICURN",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=20199",
      "Content": " I read where one MALE oncology doc felt that everything should be done to preserve the breast. He did allow for a large tumor and small breast. We should have the results of the MRIs tomorrow or Monday with surgery tentatively scheduled for next Friday. Otherwise, I am perfectly comfortable with the decision for mastectomy. I don't do bathing suits (2 times in 20 years). I love the outdoors, just prefer other things: work in the garden, hot air ballooning and hiking. Could care less about\n getting half naked and laying around in the hot sun. I have often said that I am peace with my creator and not afraid to die. The reality is that although I am at peace, I do not WANT to die, still have things I want to do. Plus, there is most likely no one who would love my dog and be as good to her as I am. \nI have learned, this evening that my sister will not be able to come to Oklahoma City for the surgery. She is bipolar and is having trouble with her meds...has gone into mania despite the meds. My mother is not well and my sister is on Social Security disability. Her shrink didn't feel she was stable enough on meds to adequately care for herself, much less take care of me, at this time. She is my heart and I really wanted her here, but I did my best to let her off the hook. I have a cousin and several good friends here, so I should be able to get a ride home from the hospital. I think my Mom and sister are having a harder time with this diagnosis than I am. I have pretty much quit crying. Mostly anger now (stages of grief). I wonder if I am unusual in that although I do not consider breasts an expendable part, I am not too upset about\n their loss. I don't feel it will make me or break me as my self concept has never centered around my femanine attributes. I have always considered most of the issues a \"hassle\". Periods (back when I had them). Fibrocystic breast disease has left them sore and tender a lot, guess that won't be an issue after next week.\nI do have a couple of questions: realistically, how long do you feel really bad after mastectomy? How long do you have to haul around the JP drains? When you get chemo, how many days do you just feel like crap? Is it unrealistic to think I can take myself to chem? I could probably get a friend to do this with me, but I really don't want to have to ask them unless there is no other way. I will have to get someone to pick me up after the surgery as I doubt they will release me to myself. Plus, I don't want to be driving around high on Lortab or whatever they give me for the pain. The doctor says the underarm hurts the most and the chest almost not at all. Has this been the experience of others here? Is it unrealistic to think I can care for myself at home with the drains and all? That is the main reason I wanted my sis here and she seemed logical as she is not currently working. But she is pretty delusional and started crying believing that my Mom might fall or have a serious problem with her heart disease and no one would be there for her. My Mom's health is not the best. They were really wanting me to come to Atlanta for the surgery, but I don't know anyone there but them anymore and I don't have a license to practice nursing in Georgia. Arranging dog care and work around all of this doctor stuff is getting to be a bit taxing. I have no clue how I am going to fit in counseling and all the other stuff the doc says I have to do. Getting to chemo once every 2-3 weeks shouldn't pose too much of a problem unless I have to have someone to drive me around. I think I would rather do a cab than impose that much on my friends. They all work and have their own lives, health issues, jobs and families.\nMy nurse friend says that she has two nurses working for here in NM going through chem right now. One has Stage IV with mets and the other had a mastectomy with Stage II. Both are managing to do chem and work without any significant difficulties. But they are supervisory nurses. My friend has offered to hire me for an \nopen supervisory job, post op, if I want it. Plus I have the half time teaching job.\nPlease tell me if I am being too unrealistic about\n working and doing what I have to do to get through this Cancer treatment. I will go post my info on the info part.\nThank you all.\nCathy ",
      "MessageIndex": 2,
      "PostDate": "26/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311393",
      "Title": "New Diagnosis of Infiltrating Lobular Breast Cancer Here"
    },
    {
      "AuthorID": "ICURN",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=20199",
      "Content": " I have been reading some of the posts and can identify with the emotional roller coaster.  I cry awhile and then I get up and take the dog out for a little while to play.  I am a nurse, so I have been doing my research about\n this cancer.  I am also a Medical Laboratory Technologist and Paramedic, so I know too much for my own good (at times).  I am 3 weeks from noticing that the fibrocystic lump was bigger and harder than normal and the nipple went to an \"inny\".  I knew something was not right.\n \n \n \n \n \n \n \n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "25/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311393",
      "Title": "New Diagnosis of Infiltrating Lobular Breast Cancer Here"
    },
    {
      "AuthorID": "ICURN",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=20199",
      "Content": " \n \n \n \n \n \n \n \n \n ",
      "MessageIndex": 5,
      "PostDate": "27/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311393",
      "Title": "New Diagnosis of Infiltrating Lobular Breast Cancer Here"
    },
    {
      "AuthorID": "ICURN",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=20199",
      "Content": " Okay, so if I get double mastectomy to effect a better \"cure\" rate, the insurance will pay for it. My surgeon will not do/allow immediate reconstruction. If I lose both breasts will they pay to reconstruct at a later date? (usually) Or is no breasts considered symmetry? I think my other breast is affected with the B/C as well. Does this make a difference is whether there can be reconstruction at a later date? Maybe I need to talk with the insurance company before I do anything?\nThank you.\n ",
      "MessageIndex": 16,
      "PostDate": "30/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311393",
      "Title": "New Diagnosis of Infiltrating Lobular Breast Cancer Here"
    },
    {
      "AuthorID": "ICURN",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=20199",
      "Content": " \n \n \n \n ",
      "MessageIndex": 8,
      "PostDate": "30/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311393",
      "Title": "New Diagnosis of Infiltrating Lobular Breast Cancer Here"
    },
    {
      "AuthorID": "ICURN",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=20199",
      "Content": " Well, Heard back about\n the mammogram the breasts: right, as we know, has the lobular B/C 2.5 cm. On the left they are suggesting \"further studies\" and are suggesting ultrasound. I told the doc's office person that I didn't want to mess around with this anymore, that I had decided on double mastectomy, explaining that I have no palpable lump on the left, but that there is an area of \"thickening\" that I can feel. That both breasts are the same size and both have been finally \"growing\" since I started on \"natural\" replacement hormones this time last year. I told her I didn't want to mess around with any more tests giving this cancer more time to spread, I want it OUT of me. That I am only going through this ONCE, assuming I have a choice. That he said (last week) he wanted to do surgery this week and I was hoping we could do it and get it over with this Friday (Friday is his surgery day). She said she would relay the message. Waiting to hear back from the surgeon's office.\n ",
      "MessageIndex": 9,
      "PostDate": "30/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311393",
      "Title": "New Diagnosis of Infiltrating Lobular Breast Cancer Here"
    },
    {
      "AuthorID": "ICURN",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=110474&p=20199",
      "Content": " Cathy from Edmond, Oklahoma.  52 years young.  Single/divorced (28 years).  No kids, one little dog:  Sheila half Australian Shepherd, half Blue Heeler and a wild child. Travel nurse, half time Adjunct Professor of Nursing.  Into photography, Ebay, build websites and am working on getting my own site with a little store up and running.  I also love and collect orchids.  Was in the process of planning a greenhouse when I learned of this diagnosis.  Now, working on conseving funds until I know better how this is going to turn out and what my down time really is going to be.  Work with a hot air ballon crew in Colorado, when I am there and with the same crew at the Albuquerque Festival during the Octobers I can get there during fiesta.  \n \n \n \n ",
      "MessageIndex": 83,
      "PostDate": "26/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=110474",
      "Title": "ROLL CALL name, age, state and any other info to share"
    }
  ]
}