{
  "AuthorID": "jmc",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1175332&p=65788",
  "Posts": [
    {
      "AuthorID": "jmc",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1175332&p=65788",
      "Content": " Hi -- I was wondering why you say to get a \"surgical\" biopsy -- does that mean you recommend using a breast surgeon over a radiologist?  ",
      "MessageIndex": 1,
      "PostDate": "10/07/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1175332",
      "Title": "Reoccuring Microcalcification Question wait or removal?"
    },
    {
      "AuthorID": "jmc",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1178853&p=65788",
      "Content": " Hi everybody -- I'm wondering if anyone has any thoughts on my current situation.  I'm 36 years old and have 3 children (ages 2 - 8), each of whom I breastfed 18 months.  I had my 1st mammo last week (a \"baseline\") and have been called back in for a second (tomorrow morning).  From what I understand, I have a cluster of 20 microcalcifications in my left breast.  This also happens to be the same spot where I have been feeling tenderness.  In addition, I have been feeling \"twinges\" in my left armpit.  One more thought I have is that I took a few rounds of Accutane (strong acne med) when I was younger.  I know I'll be getting more info tomorrow, but I'd love to know what your thoughts are on this scenario.  Any advice on questions I should ask the radiologist?  Should I insist on a biopsy and copies of my records?\n ",
      "MessageIndex": 0,
      "PostDate": "10/07/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1178853",
      "Title": "cluster of 20 microcalcifications"
    },
    {
      "AuthorID": "jmc",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1178853&p=65788",
      "Content": " Hi! Thank you so much for replying. I had the second mammo done today and the radiologist recommended a needle biopsy. Although the microcalcs are \"predominantly punctate\" (benign), some are not, so they need to check it out. Although she told me 80 - 85% are benign in this situation, she said if they are malignant, due to my age, it would most likely be fast growing. Anyone on the board in their mid 30's ? Any thoughts on needle vs surgical biopsies in this scenario? ",
      "MessageIndex": 1,
      "PostDate": "11/07/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1178853",
      "Title": "cluster of 20 microcalcifications"
    },
    {
      "AuthorID": "jmc",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1178853&p=65788",
      "Content": " Thank you all so much for replying!  I was out of town last week away from a computer and I was hoping to come back to some responses.  Such a relief that you all are out there.  I'm signed up for a stereotactic needle bio this Wed with the radiologist -- I hope this isn't a stupid move.  I'll certainly keep you all posted... \n ",
      "MessageIndex": 3,
      "PostDate": "20/07/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1178853",
      "Title": "cluster of 20 microcalcifications"
    }
  ]
}