{
  "AuthorID": "joavila92",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3340254&p=149622",
  "Posts": [
    {
      "AuthorID": "joavila92",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3340254&p=149622",
      "Content": " I'm just worried. Last time it was begnin but it sucks to do this again. It's still scary. ",
      "MessageIndex": 1,
      "PostDate": "26/02/2015",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3340254",
      "Title": "Doctor call back after mammogram.help"
    },
    {
      "AuthorID": "joavila92",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3358891&p=149622",
      "Content": " This is the second year I've had an abnormal mammogram. Last year i had a biopsy taken from my left breast showing calcification. It turned out to be b9. I didn't even ask what it was since the doctor called my house and said no cancer so i was just relieved and didn't ask anything else. Anyway this year i go for my mammogram and something shows up in my other breast. I already went to get the diagnostic mammogram n ultrasound. But they didn't giv me my result there they sai my doctor would call me. I called today since its been a week since i did that and they said they called last week so i can come in. I told the nurse if i could speak to the doctor over the phone regarding my results but she said no that i had to come in cz he wants to explain them to me. Now I'm scared. I know last year i went through the same thing but things can be different. I'm going tomorrow to see what he says. I'm doubting it's anything good since they just didn't tell me over the phone instead of making me come in...\nHelp I'm scared ",
      "MessageIndex": 0,
      "PostDate": "17/03/2015",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3358891",
      "Title": "diagnostic mammogram call back....What to do"
    },
    {
      "AuthorID": "joavila92",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3358891&p=149622",
      "Content": " Thanks girl. Well I'm fresh out the doctor. I got my report and it says on the impressions linear hypoechic area seen in the left axilla just beneath the skin which may represent either a small fluid collection or edema and be related to inflammation. Clinical correlation is needed.. Biras score is 2. I'm a little confused. My doctor reverted me to a surgeon her didn't say biopsy but does that mean it can be cancer still. Category does say b9 finding but why I'm a being referred to surgeon ",
      "MessageIndex": 4,
      "PostDate": "18/03/2015",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3358891",
      "Title": "diagnostic mammogram call back....What to do"
    },
    {
      "AuthorID": "joavila92",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3351110&p=149622",
      "Content": " Hi. \nI'm a.m. 48 years old about\n a year ago i had a biopsy done on my left breast due to a.m. abnormal mammogram that showed micro calcification s..i had a biopsy done on it and It was begnin.. This year i went to get my regular mammogram and it was abnormal aswell doctor did a breast exam and no sign off lump but it does. Shows a shadow on mammogram. I have had a burning sensation in my left breast. Does that mean cancer. I a.m. scheduled to get a diagnostic mammogram soon aswell. But i am worried again. Going through this2years in a row sucks. If it is cancer could it have develop fast or is there a better chance it's in it first stages ",
      "MessageIndex": 0,
      "PostDate": "08/03/2015",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3351110",
      "Title": "burning sensation on left breast and abnormal mammograph"
    },
    {
      "AuthorID": "joavila92",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3340254&p=149622",
      "Content": " I'm 48 years old. Last year i had abnormal mammogram. Then additional mam. Then finally a biopsy of the left Breast. I believe my test said They where poly something classifications but They were begnin. Anyway i just did my yearly mamm. And it came back abnormal again. Doctor says need another mammogram because it shows aa shadow on my left breast. Same side as Last year. I am worried. have to go through the waiting again. Could cancer develop cz of biopsy. Doctor says He doesn't feel a bump ",
      "MessageIndex": 0,
      "PostDate": "24/02/2015",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3340254",
      "Title": "Doctor call back after mammogram.help"
    },
    {
      "AuthorID": "joavila92",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2657232&p=149622",
      "Content": " My mom had a irregular mammogram. Then they asked for another mammograM and ultra sound. Yesterday I took her to the doctor to get her results. He said he had to touch her breast and see if he could feel the lump. He said he couldn't feel it. But the report said she had a spot or shadow show in the retort they gave her. He then said he wants to get a biopsy. What does that mean. I know what the procedure is. But is there a high chance of her having cancer. Couldn't they just tell if the spot was a cyst or something in the ultra sound. What does that spot mean even if there no lump. I'm really worried ",
      "MessageIndex": 0,
      "PostDate": "26/02/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2657232",
      "Title": "breast biopsy"
    },
    {
      "AuthorID": "joavila92",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2657232&p=149622",
      "Content": " Thanks for your response, I am just really worried. So good was a shadow to on the mammogram. She doesn't have a lump. Or so the doctor said he couldn't find it. ",
      "MessageIndex": 1,
      "PostDate": "27/02/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2657232",
      "Title": "breast biopsy"
    }
  ]
}