{
  "AuthorID": "kasey56",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=851439&p=47679",
  "Posts": [
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=851439&p=47679",
      "Content": " Oh my God...unless I am going totally nuts - I'm sure what I have is Inflammatory Breast Cancer rather than an infection following the biopsy. I have a 2\" incision from the excision biopsy that we all thought was just infected but with my researching on the internet I'm sure it is IBC! Breathe....as I was told before. I have an area about\n 3\" diam. including the incision that is red/purple/brown, leathery and hard underneath, hot and I feel burning under my armpit and in my chest above the breast and even in the wrist of that hand. The biopsy showed \"massive widespread lymphatic invasion\". I'm sure....and it's Saturday of a long weekend here in Canada! \nI guess there is really nothing to do until Tuesday...OMG am I scared!\nKathyV ",
      "MessageIndex": 3,
      "PostDate": "30/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=851439",
      "Title": "New Dx today...."
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=804640&p=47679",
      "Content": " \n \n \n ",
      "MessageIndex": 12,
      "PostDate": "22/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=804640",
      "Title": "advice in retrospect?"
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=804640&p=47679",
      "Content": " Hi! This is as you know difficult for someone to join a group like this - because it means you might have cancer. But I also am going crazy and need some subjective opinions from some people that will understand. Thanks. 6 weeks ago my screening mammo showed suspicion for DCIS, went the next week for a diagnostic mammo that could not rule it out and they suggested an excision biopsy for ?DCIS. Went to the surgeon suggested in the smaller town north of here (because my GP figured the waitlist would be shorter) which of course took 2 more weeks and he says he would rather do an ultrasound-guided biopsy so that if it IS positive for DCIS he can then do surgery including a sentinel lymph node biopsy. Have now been waiting more than a week to hear when they will do the biopsy and I'm going crazy bouncing between \"relax and be patient\" and \"scream and shout until someone gets moving on this\"! \n \n \n \n \n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "07/05/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=804640",
      "Title": "advice in retrospect?"
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=804640&p=47679",
      "Content": " Thanks you guys - started a new post with my Dx.\nBut just was wondering and hoping sincerely that Hazeleyez got her results back and they were clear.\nHugs,\nKasey ",
      "MessageIndex": 13,
      "PostDate": "29/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=804640",
      "Title": "advice in retrospect?"
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=851439&p=47679",
      "Content": " Hi! Sorry to say that I guess I just learned that I have the prerequisites to join your club. My GPs office phoned this morning (surgeon is out of town for this week) and I went down and got the goods. So it says invasive ductal carcinoma that spans at least 2.5 cm. The invasive is intermediate to high grade with grade 2 architectural features, nuclei grade 2-3 and mitoses focally quite high. Intermixed with the invasive ca and present in virtually all slides are foci of grade 1 and 2 micropapillary DCIS. Lymphatic tumor emboli are seen as numerous foci in virtually all of the the slides. Lymphatic tumor emboli and foci of DCIS extend to multiple nondesignated biopsy margins and focally invasive ca extends to nondesignated biopsy margin in block \"E\". Block \"L\" shows a somewhat unusual atypical fibroadenomatous lesion that only measures about\n 1.0 cm.\n \n \n \n \n \n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "29/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=851439",
      "Title": "New Dx today...."
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=851439&p=47679",
      "Content": " I know...I just panicked when I read that. I am not going to read anything more at this point about\n BC period - wait until I have expert opinions and I have to make decisions! I was so stressed yesterday that I don't know what I was feeling. the incision started oozing blood and serous (?purulent..not sure) drainage yesterday afternoon and I think maybe the best thing is just to keep it dressed and try to ignore it as best I can through the weekend. If I do get too worried I can go back to the walk-in clinic or the emerg but I don't think anyone is going to know what to do here for now...I'll see my GP again Tuesday morning and see what she thinks of the oozing and try to get in to see the surgeon ASAP and see what he thinks of the whole situation. Amazing eh? At this moment all I want is to have uncomplicated invasive BC! Amazing how our sights change, eh?\nThanks!\nKathyV ",
      "MessageIndex": 4,
      "PostDate": "01/07/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=851439",
      "Title": "New Dx today...."
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=851439&p=47679",
      "Content": " Thanks Bev,\nI think I'm sort of in shock still - I guess we all expect it to be negative after all, don't we? Like you say....ALL of life is a crap-shoot. I just have to remember that this is just a big speed-bump, I know I've got this minute to live and that's all anyone has but we take it for granted and think that we're guaranteed 80 - 90 years! \nStarted a second antibiotic today and hopefully I'll start feeling a little better and be able to enjoy the fact that nothing will be happening on a long weekend!!\nHugs to you too!\nKathyV ",
      "MessageIndex": 6,
      "PostDate": "29/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=851439",
      "Title": "New Dx today...."
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=849828&p=47679",
      "Content": " Hi jko,\nDiagnosed this morning with the same...invasive ductal ca and here I am welcoming someone already? Oh well - welcome! What caught me was that you were diagnosed with the same type and 3 days before your birthday....I turn 51 in 7 days! I haven't seen my surgeon or the Cancer Clinic yet but I imagine mastectomy will be next on my calendar as well. Did you have reconstruction as well or no? Did they do a sentinel lymph node biopsy or remove more nodes than that? How long to recuperate? Well, great way to welcome someone with 500 questions, eh? Wishing you less pain in your life!\nKathyV ",
      "MessageIndex": 5,
      "PostDate": "29/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=849828",
      "Title": "Introduction"
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=804640&p=47679",
      "Content": " Thankyou for all your support! My computer hard drive quit on me so had to buy a new computer and then couldn't remember where I found this site! But I found you all again! Thanks!\n \n \n \n ",
      "MessageIndex": 4,
      "PostDate": "13/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=804640",
      "Title": "advice in retrospect?"
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=851439&p=47679",
      "Content": " Hi Kitt,\nYes, our children are always our worry, aren't they? I know - telling my son (22) and my daughter (25) today was one of the hardest things I've ever done. But I told them I won't keep anything from them - that they are in this with me! One of the worries I have today though is that my dx automatically increases my daughter's chance of having it down the road. We are always the parent, aren't we? Thank you for your prayers!\nKathyV ",
      "MessageIndex": 7,
      "PostDate": "29/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=851439",
      "Title": "New Dx today...."
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=849828&p=47679",
      "Content": " Thanks jko,\nI think I will feel better after I see the surgeon and/or oncologist this week or so and have a plan down. Right now I am bouncing from hitting the bottom to reasonable to hitting the bottom. Very scared....I think this will be better once the fight starts too. I like your signature on your first post here - I was out for supper at a good friends house last evening with another couple that I just told about\n the cancer and I've spent the last two days slowly telling people who matter (my children, my sisters and good friends) about\n the cancer. I find this so hard because you can see the pain it causes in their eyes to hear this. I haven't done bad at not breaking down crying (I do that more when I'm alone! ;) but I sure would like to find the strength and grace to reassure them. I guess maybe it's too early for that? It's helping me just talking about\n it with you - I guess I have to get some strength and grace inside towards myself first and then I can share it. Meanwhile, if you've read my posts - I either have a really bad infection (on two antibiotics and yesterday the incision starting oozing blood and seroous fluid) or I am really afraid maybe IBC. So I am having to be dressing the wound and need to go down and buy some more dressings today and worrying about\n what to do about\n that. A doctor at the walk-in clinic gave the the first antibiotic and my GP gave me the second so both doctors have looked at it...well I'm going to try and forget it about\n it as much as I can through the weekend and then push for some answers. Thanks for being here and that is the most important - having no regrets!\nKathyV ",
      "MessageIndex": 8,
      "PostDate": "01/07/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=849828",
      "Title": "Introduction"
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=849277&p=47679",
      "Content": " Hi Cyndy,\nI'm about\n as fresh a newbie as they come - just got my Dx of invasive ductal ca this morning - and I have to say that far from scaring me you do give me well-needed hope! My path report is not good from what I can tell but yours wasn't either and look at you! All I want is to see some of those milestones too if I can...if you can smile amidst the fight then so can I so please keep us informed....and blessed by your visits!\nHugs,\nKathyV ",
      "MessageIndex": 9,
      "PostDate": "29/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=849277",
      "Title": "oldie checking in"
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=804640&p=47679",
      "Content": " Thanks to everyone for your advice and support - I know I will refer back to it on bad days! I know I am totally stressing - couldn't fall asleep last night so got up and had a glass of wine and also a good cry! It doesn't help that there are a half dozen other major stresses in my life right now too - but that's probably just how life goes, isn't it? I don't think it would be so bad if they would just call and give me a date or even an approximate date for the biopsy instead of just silence for the past two weeks! Makes you wonder if they forgot you - that's the main reason I keep phoning them - just to remind myself that they haven't! But I was also thinking that's why we are called \"patients\" to the medical profession, right? I am a nurse (but working in a longterm care home)...but never realized the cold humor in that word... lol ...it looks rather different from the other side! I feel rather guilty too when I know that you all are or have been fighting battles with cancer and I'm falling apart when it's just suggested that I might have it. Anyway, I live in BC, Canada and my name is Kathy but I see there is a Kathy already so will stick with Kasey...that was my nickname when I was a child anyway! Thanks again and I wish you all the best in your own battles!\nKasey ",
      "MessageIndex": 9,
      "PostDate": "09/05/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=804640",
      "Title": "advice in retrospect?"
    },
    {
      "AuthorID": "kasey56",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=851439&p=47679",
      "Content": " \n \n ",
      "MessageIndex": 5,
      "PostDate": "29/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=851439",
      "Title": "New Dx today...."
    }
  ]
}