{
  "AuthorID": "Kat09",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1977462&p=111244",
  "EmotionInfo": {
    "EmotionKeywords": [
      "satisfied",
      "satisfied",
      "discouraged",
      "lost",
      "vulnerable",
      "pained",
      "pained",
      "peaceful",
      "blessed",
      "okay",
      "thoughtful",
      "challenged",
      "hopeful",
      "willing",
      "fearful",
      "pained",
      "pained",
      "pleased",
      "close",
      "proactive",
      "insistent",
      "willing",
      "suspicious",
      "scared",
      "pained",
      "pained",
      "understanding",
      "great",
      "glad",
      "wonderful",
      "pleased",
      "okay",
      "decisive",
      "suspicious",
      "reassured",
      "hopeful",
      "willing",
      "pained",
      "pained"
    ],
    "Emotions": {
      "AFRAID": "0.8",
      "ALIVE": "0.2",
      "ANGRY": "0",
      "CONFUSED": "0.2",
      "DEPRESSED": "0.2",
      "GOOD": "1.4",
      "HAPPY": "0.6",
      "HELPLESS": "0.2",
      "HURT": "0.8",
      "INDIFFERENT": "0",
      "INTERESTED": "0.2",
      "LOVE": "0.2",
      "OPEN": "0.4",
      "POSITIVE": "1.6",
      "SAD": "0.8",
      "STRONG": "0.2"
    }
  },
  "GleasonInfo": {},
  "NExperiencePosts": 5,
  "NPosts": 7,
  "PSAInfo": {},
  "PostTypeInfo": {
    "-1 Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 1,
      "NTotal": 1,
      "PAdvice": 0,
      "PExperience": 1
    },
    "-2 Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "-3 Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "10th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "11th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "12th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "13th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "18th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "1st Month PostTypeInfo": {
      "NAdvice": 2,
      "NExperience": 3,
      "NTotal": 5,
      "PAdvice": 0.4,
      "PExperience": 0.6
    },
    "24th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "2nd Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 1,
      "NTotal": 1,
      "PAdvice": 0,
      "PExperience": 1
    },
    "3rd Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "4th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "5th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "6th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "7th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "8th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    },
    "9th Month PostTypeInfo": {
      "NAdvice": 0,
      "NExperience": 0,
      "NTotal": 0,
      "PAdvice": 0,
      "PExperience": 0
    }
  },
  "Posts": [
    {
      "AuthorID": "Kat09",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1977462&p=111244",
      "Content": " Following bilateral mastectomy 12 years ago, I immediately underwent TRAM flap reconstruction, and I too was told just before surgery that whenI awoke I would feel like I had been hit by a MAC truck - and yes, I did. The morphine pump only took the edge off the pain. I think I had about\n 10 pillows propped around my body. They did get me up the next day and sit me in a chair, but had to immediately give me Phenergan in my I.V. before I made it out of bed - the nausea set in and the last thing they wanted was for me to start vomiting. I was up walking a little by the 2nd post-op day. After a 5 day stay, I came home, but most of my time was spent in a recliner. I was able to sleep in bed, by myself, with pillows all around me and could only lay in one position all night. It took a while to walk upright without being stooped over, and the pain did last for quite some time. However, I had to begin chemo 3 weeks later, so the wretching and vomiting didn't make things any easier. I survived, but some pain lingered over the next 1-2 years, but I was able to go about\n my daily routine following the end of the chemo. I chose the TRAM, as I had been told 2 years prior that I had Lupus. As it turned out, I did not have Lupus. The year leading up to my cancer diagnosis, I lost a lot of weight and had no tummy fat to speak of, but my plastic surgeon used what I had as well as my rectus muscles. It was more or less a waste of time, pain and money. A few months after chemo, I had saline implants placed and was much more satisfied. If any one is thin, as I was, I would never recommend a TRAM. For me, the benefits were not worth it, but I know everyone is different. I'm in no way trying to discourage you; just do a lot of research. As for me, I would certainly have gone with tissue expanders and implants, however, my plastic surgeon strongly suggested the TRAM and I was at a very vulnerable place at the time. Best of luck to you. ",
      "Demographics": {
        "AgeInfo": [],
        "GenderInfo": {
          "MedicalTermBasedGender": {
            "FemaleMedicalTerms": [],
            "MaleMedicalTerms": []
          },
          "NounBasedGender": {
            "MainSubject": "I",
            "NarrationType": "first-person",
            "NarratorGender": "unknown",
            "PatientGender": "unknown"
          }
        }
      },
      "MessageIndex": 3,
      "PostDate": "06/01/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1977462",
      "Title": "Settled on type of reconstruction"
    },
    {
      "AuthorID": "Kat09",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1965610&p=111244",
      "Content": " I never had true cervical herniated discs, but did have a disc bulge at one level and a disc protrusion at another. I underwent physical theray several times and my last MRI showed complete resolution. I hope the epidurals will help you. This past year I underwent trigger point injections and then facet injections, which seemed to help. I was a medical transcript\nionist for years, which I believe brought on my cervical problems. As long as I don't spend too much time typing, I seem to be alright. I know the pain can be debilitating.\nI'm just so happy for you as far as the breast situation. Each time I hear of another lady facing breast cancer or at least the fear of it, my heart goes out to each and every one. My fear of recurrence is always in the back of my mind, even though I was told by my doctors at the time of my surgery that I \"was cured.\" Once you've faced a dx of cancer, no one can ever assure you that you're cured, but I've just taken it one day at a time for 12 years, and yes, I feel I'm gonna be okay. Of course, with the recent passing of Elizabeth Edwards; stories like this always bring thoughts creeping back into my mind. However, I've learned to live with it. I pray you will never face this challenge. \nWishing you a blessed and peaceful Christmas and New Year.\nKat ",
      "Demographics": {
        "AgeInfo": [],
        "GenderInfo": {
          "MedicalTermBasedGender": {
            "FemaleMedicalTerms": ["breast"],
            "MaleMedicalTerms": []
          },
          "NounBasedGender": {
            "MainSubject": "I",
            "NarrationType": "first-person",
            "NarratorGender": "unknown",
            "PatientGender": "unknown"
          }
        }
      },
      "MessageIndex": 12,
      "PostDate": "10/12/2010",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1965610",
      "Title": "Called Back for a Diagnostic Mammo"
    },
    {
      "AuthorID": "Kat09",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1971137&p=111244",
      "Content": " Do not want to scare you at all, since all is benign with your wife.  However, 12 years ago I had a \"lump\", not found on mammogram or ultrasound, but I felt it.  Over a year, it grew larger and my docs kept telling me it was just thickened breast tissue.  Finally, I told my surgeon it had enlarged and 3 months later she did an ultrasound herself, which looked somewhat suspicious.  Core biopsy one week later revealed some atypical cells and excisional biopsy 2 weeks later revealed 2 cm. invasive ductal carcinoma.  Since the biopsy was done as an out-patient under twilight sleep, I began to awaken in the O.R. and overheard my doctor and nurses discussing it.  The only thing I remembered hearing was the word \"cystic.\"  After I was taken back to my room, my surgeon came in and I was smiling and told her I heard someone in the O.R. say it was cystic.  She took me by the hand and said \"yes, there was a cyst\", however, \"there was also cancer beneath it.\"  I'm only sharing this with you so your wife will know to keep a close watch on herself and if at anytime she feels something isn't right, tell her to insist on having it checked out. I tell every woman I meet who has any breast issues to please be proactive, and check, check and double check each month for anything that feels different.  \n \nCurrent Meds: Hydrocorisone Suppositories, Librax, Toprol (BP), Cymbalta, Lortab prn.\nMed Hx: UP dx. 11-2010, Diverticular Disease dx. 2009, Hypertension, Chronic Pain (Fibromyalgia & Pelvic Pain due to adhesions), Multinodular Goiter, GERD, Sjogren's Syndrome (autoimmune), Breast Cancer 12 yrs. ago ",
      "Demographics": {
        "AgeInfo": [],
        "GenderInfo": {
          "MedicalTermBasedGender": {
            "FemaleMedicalTerms": [
              "mammogram",
              "breast"
            ],
            "MaleMedicalTerms": []
          },
          "NounBasedGender": {
            "MainSubject": "I",
            "NarrationType": "first-person",
            "NarratorGender": "unknown",
            "PatientGender": "unknown"
          }
        }
      },
      "MessageIndex": 7,
      "PostDate": "10/12/2010",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1971137",
      "Title": "Complex Breast Cyst"
    },
    {
      "AuthorID": "Kat09",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1965610&p=111244",
      "Content": " Congratulations Sue!!!!  What a wonderful Christmas present.  Peace of mind is the best ever.  So happy for you.\n ",
      "Demographics": {
        "AgeInfo": [],
        "GenderInfo": {
          "MedicalTermBasedGender": {
            "FemaleMedicalTerms": [],
            "MaleMedicalTerms": []
          },
          "NounBasedGender": {
            "MainSubject": "You",
            "NarrationType": "advice"
          }
        }
      },
      "MessageIndex": 23,
      "PostDate": "09/12/2010",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1965610",
      "Title": "Called Back for a Diagnostic Mammo"
    },
    {
      "AuthorID": "Kat09",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1965610&p=111244",
      "Content": " Sue - if your repeat mammo shows clustered calcifications, they may suggest a needle localization biopsy. That is, under x-ray guidance they find the area of calcification and remove it. Since they are just calcifications, and no mass can be felt, they have to use x-ray (just like mammogram) to find the exact area to biopsy. This is what my mother underwent 23 years ago (benign). If it should be malignant, it is in very early stages and it's my understanding that a lumpectomy is usually performed (usually followed by radiation treatment). My tumor was 2 cm., palpable and invasive. I was 42 and had a 4 year old daughter. I chose bilateral mastectomy with immediate reconstruction (TRAM Flap), and underwent 4 rounds of chemotherapy. Lymph nodes were removed on the right (cancer side), and all were negative. 1-1/2 years earlier, I had 2 benign fibroadenomas removed from the left breast. The tumor which turned out to be malignant, was discovered by me. I was having mammograms once a year, along with ultrasound due to very dense breasts, and for 2 years prior to CA diagnosis, they were doing mammograms on the right side every 6 months because of scattered calcifications. Neither the mammo or ultrasound revealed the tumor and after I discovered it, was told by my GYN and surgeon for a year that is was \"probably just thickened breast tissue\". After a year, I realized it was bigger and returned to my surgeon. She told me to come back in 3 months and she would do an ultrasound herself. The US looked a little suspicious and I returned a week later for a core biopsy in the office. It revealed possible atypical cells, so I then returned the next week for an excisional biopsy and the diagnosis was made immediately, as my surgeon had a pathologist in the O.R. to do a frozen section. Two weeks later I underwent mastectomy. My surgeon suggested that I have both breasts removed, and ultimately I made the decision to do so. I'm glad I did - I didn't want to spend the rest of my life wondering if or when it would occur on the other side. It's been 12 years, and I'm still okay.\nFrom my experience and what I've learned, I believe the calcifications are something they just feel should be watched. My younger sister has had multiple benign fibroadenomas removed over the past 20 years, to the point that her surgeon now just \"watches\" her. She has mammos, US and MRI to watch for any changes in existing tumors, as she has had so many biopsies that she doesn't have a lot of breast tissue left. My family history is from my father. His mother (my grandmother), my great aunt and aunt all had it. My grandmother's wasn't discovered until she was in her 90's and in a nursing home. My great aunt (grandmother's sister) underwent mastectomy in her 40's and lived to be 91. My aunt (dad's sister) is 80 and underwent a lumpectomy and radiation 5 years ago. Treatment has really advanced in the past several years.\nI know it can be difficult, but try to remain positive and please let us here know how everything is. ",
      "Demographics": {
        "AgeInfo": [
          {
            "Confidence": 1,
            "Phrase": "<Z> <Z> <Z> I was 42 and had a 4 year",
            "Relation": "unknown",
            "Tense": "past",
            "Value": 42
          },
          {
            "Confidence": 1,
            "Phrase": "was 42 and had a 4 year old daughter <Z> <Z>",
            "Relation": "unknown",
            "Tense": "past",
            "Value": 4
          },
          {
            "Confidence": 1,
            "Phrase": "My aunt  dad's sister  is 80 and underwent a lumpectomy and",
            "Relation": "unknown",
            "Tense": "present",
            "Value": 80
          }
        ],
        "GenderInfo": {
          "MedicalTermBasedGender": {
            "FemaleMedicalTerms": [
              "mammogram",
              "breast",
              "breasts"
            ],
            "MaleMedicalTerms": []
          },
          "NounBasedGender": {
            "MainSubject": "I",
            "NarrationType": "first-person",
            "NarratorGender": "unknown",
            "PatientGender": "unknown"
          }
        }
      },
      "MessageIndex": 5,
      "PostDate": "04/12/2010",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1965610",
      "Title": "Called Back for a Diagnostic Mammo"
    },
    {
      "AuthorID": "Kat09",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1965610&p=111244",
      "Content": " Thinking about\n you this morning, Sue. Hoping diagnosis will be benign.  \n ",
      "Demographics": {
        "AgeInfo": [],
        "GenderInfo": {
          "MedicalTermBasedGender": {
            "FemaleMedicalTerms": [],
            "MaleMedicalTerms": []
          },
          "NounBasedGender": {
            "MainSubject": "You",
            "NarrationType": "advice"
          }
        }
      },
      "MessageIndex": 9,
      "PostDate": "08/12/2010",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1965610",
      "Title": "Called Back for a Diagnostic Mammo"
    },
    {
      "AuthorID": "Kat09",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1965610&p=111244",
      "Content": " Hi Sue - I've just read some of your posts and hope I can reassure you a bit. I'm a 12 year breast cancer survivor. Twenty+ years ago, I worked for general surgeons who performed a lot of breast surgery and I learned a lot about\n breast tumors, calcifications, etc. They usually look to see if the calcifications are clustered, which can be a sign of malignancy, but not always. If they are scattered, they usually just watch a little closer with mammogram. Many years ago, my mother had an area of clustered calification and underwent a biopsy and all was benign, so even if they are clustered, it's not necessarily malignant. I pray everything will be alright for you. In reading your med history, it seems we have a few things in common. I have mutinodular goiter, GERD, diverticulosis (with 2 hospitalizations in past year for diverticulitis), now have ulcerative proctitis, chronic pain due to pelvic adhesions from hysterectomy, anxiety, high cholesterol, mitral valve regurgitation (heart), and hypertension. \nOnce again, praying all will be benign. ",
      "Demographics": {
        "AgeInfo": [],
        "GenderInfo": {
          "MedicalTermBasedGender": {
            "FemaleMedicalTerms": [
              "hysterectomy",
              "mammogram",
              "breast"
            ],
            "MaleMedicalTerms": []
          },
          "NounBasedGender": {
            "MainSubject": "I",
            "NarrationType": "first-person",
            "NarratorGender": "unknown",
            "PatientGender": "unknown"
          }
        }
      },
      "MessageIndex": 3,
      "PostDate": "03/12/2010",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1965610",
      "Title": "Called Back for a Diagnostic Mammo"
    }
  ],
  "ProfileDemographics": {
    "Age": {
      "Confidence": 1,
      "Phrase": "My aunt  dad's sister  is 80 and underwent a lumpectomy and",
      "Relation": "unknown",
      "Tense": "present",
      "Value": 80
    },
    "Gender": {
      "Confidence": 1,
      "Gender": "female",
      "NarrationType": "first-person"
    }
  },
  "SideEffectTypeInfo": {
    "SideEffectType": [
      "Hernia",
      "Rectal irritation/bleeding",
      "Clot"
    ],
    "SideEffectTypeKeywords": [
      "bulge",
      "hypertension",
      "proctitis",
      "lump"
    ]
  },
  "TreatmentDecision": {
    "DoctorRecommended": {
      "Age": 0,
      "Best Cancer Control": 0,
      "Bowel Symptoms": 0,
      "Doctor Skill": 0,
      "Erectile dysfunction": 0,
      "Financial": 0,
      "GP Mentioned": 0,
      "Less Invasive": 0,
      "Medical Indication": 0,
      "Nerve": 0,
      "Radiologist": 0,
      "Recovery Time": 0,
      "Source": 0,
      "Surgeon": 0,
      "Urinary incontinence": 0,
      "Value": 0
    },
    "PatientDecided": {
      "Age": 0,
      "Best Cancer Control": 0,
      "Bowel Symptoms": 0,
      "Doctor Skill": 0,
      "Erectile dysfunction": 0,
      "Financial": 0,
      "GP Mentioned": 0,
      "Less Invasive": 0,
      "Medical Indication": 0,
      "Nerve": 0,
      "Radiologist": 0,
      "Recovery Time": 0,
      "Source": 0,
      "Surgeon": 0,
      "Urinary incontinence": 0,
      "Value": 0
    }
  },
  "TreatmentTimelineInfo": {
    "-1 Month Emotions": {
      "EmotionKeywords": [
        "reassured",
        "hopeful",
        "willing",
        "pained",
        "pained"
      ],
      "Emotions": {
        "AFRAID": "0",
        "ALIVE": "0",
        "ANGRY": "0",
        "CONFUSED": "0",
        "DEPRESSED": "0",
        "GOOD": "1",
        "HAPPY": "0",
        "HELPLESS": "0",
        "HURT": "1",
        "INDIFFERENT": "0",
        "INTERESTED": "0",
        "LOVE": "0",
        "OPEN": "0",
        "POSITIVE": "2",
        "SAD": "1",
        "STRONG": "0"
      }
    },
    "-1 Month SideEffects": {
      "SideEffectType": [
        "Rectal irritation/bleeding",
        "Clot"
      ],
      "SideEffectTypeKeywords": [
        "hypertension",
        "proctitis"
      ]
    },
    "-2 Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "-2 Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "-3 Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "-3 Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "10th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "10th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "11th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "11th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "12th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "12th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "13th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "13th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "18th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "18th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "1st Month Emotions": {
      "EmotionKeywords": [
        "understanding",
        "great",
        "glad",
        "wonderful",
        "pleased",
        "okay",
        "decisive",
        "suspicious",
        "hopeful",
        "willing",
        "wonderful",
        "peaceful",
        "peaceful",
        "blessed",
        "okay",
        "thoughtful",
        "challenged",
        "hopeful",
        "willing",
        "fearful",
        "pained",
        "pained",
        "pleased",
        "close",
        "proactive",
        "insistent",
        "willing",
        "suspicious",
        "scared",
        "pained",
        "pained"
      ],
      "Emotions": {
        "AFRAID": "0.8",
        "ALIVE": "0.4",
        "ANGRY": "0",
        "CONFUSED": "0",
        "DEPRESSED": "0",
        "GOOD": "1.4",
        "HAPPY": "0.4",
        "HELPLESS": "0",
        "HURT": "0.4",
        "INDIFFERENT": "0",
        "INTERESTED": "0.2",
        "LOVE": "0.2",
        "OPEN": "0.2",
        "POSITIVE": "1.6",
        "SAD": "0.4",
        "STRONG": "0.2"
      }
    },
    "1st Month SideEffects": {
      "SideEffectType": [
        "Hernia",
        "Clot"
      ],
      "SideEffectTypeKeywords": [
        "bulge",
        "hypertension",
        "lump"
      ]
    },
    "24th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "24th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "2nd Month Emotions": {
      "EmotionKeywords": [
        "satisfied",
        "satisfied",
        "discouraged",
        "lost",
        "vulnerable",
        "pained",
        "pained"
      ],
      "Emotions": {
        "AFRAID": "0",
        "ALIVE": "0",
        "ANGRY": "0",
        "CONFUSED": "1",
        "DEPRESSED": "1",
        "GOOD": "0",
        "HAPPY": "1",
        "HELPLESS": "1",
        "HURT": "1",
        "INDIFFERENT": "0",
        "INTERESTED": "0",
        "LOVE": "0",
        "OPEN": "1",
        "POSITIVE": "0",
        "SAD": "1",
        "STRONG": "0"
      }
    },
    "2nd Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "3rd Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "3rd Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "4th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "4th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "5th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "5th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "6th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "6th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "7th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "7th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "8th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "8th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "9th Month Emotions": {
      "EmotionKeywords": [],
      "Emotions": {
        "AFRAID": 0,
        "ALIVE": 0,
        "ANGRY": 0,
        "CONFUSED": 0,
        "DEPRESSED": 0,
        "GOOD": 0,
        "HAPPY": 0,
        "HELPLESS": 0,
        "HURT": 0,
        "INDIFFERENT": 0,
        "INTERESTED": 0,
        "LOVE": 0,
        "OPEN": 0,
        "POSITIVE": 0,
        "SAD": 0,
        "STRONG": 0
      }
    },
    "9th Month SideEffects": {
      "SideEffectType": [],
      "SideEffectTypeKeywords": []
    },
    "DateOfTreatment": "04/12/2010",
    "TreatmentType": "Radiation",
    "Verified": 1
  },
  "TreatmentTypeInfo": {
    "TreatmentMentions": [
      "Surgery",
      "Radiation"
    ],
    "TreatmentType": "Surgery",
    "TreatmentTypeKeywords": [
      "radiation",
      "surgery"
    ]
  },
  "WordCount": 1703
}