{
  "AuthorID": "LIFEBEAR",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2213692&p=131404",
  "Posts": [
    {
      "AuthorID": "LIFEBEAR",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2213692&p=131404",
      "Content": " lol thank you, I can't stop thinking about\n it. My minds a blur. How will i function at work or think of other stuff. I really don't wanna do chemo or anything i prefer to remove them. I think the knowledge of knowing what i can do makes me stronger. I was near my mother when she go BC and it was such a horrible time in our lives. She was in her 60ies but now I fear the worst. I always said to my self if it is... i would remove them and get implants. I was to concerned that i would get it again...and so on. Now I am faced with this possibility and its stressing me out because i don't know as much as i bought i did. Anyone who has advice or gone through this....anything will be nice even just information. If the cancer is caught early, is there a chance i can just remove it and proceed to place implants in. I would like to just avoid having to suffer with chemo and possibly having cancer return....if its in the family already.\nI know I sound insane but I am trying to cope and move on...in case. Im very afraid.. ",
      "MessageIndex": 8,
      "PostDate": "17/09/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2213692",
      "Title": "IM 33 YEARS OLD. ULTRASOUND AND MAMMO NOW REFERRED TO A GENERAL SURGEON-CONCERNED HELP!"
    },
    {
      "AuthorID": "LIFEBEAR",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2213692&p=131404",
      "Content": " Oh thank you so much... I was referred to one and am awaiting my appointment, its all the way in November...:( What will the possible outcomes be? what is an obscured mass? They want me to do another mamo in 6 mths but my dr referred me to a general surgeon. The mamo report said they wanted another mamo to assess stability of this obscured mass? Whats does that mean, really? Previous mamo didn't say that?\ntk u so much for any.....advice or personal experience. Thank you. ",
      "MessageIndex": 9,
      "PostDate": "18/09/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2213692",
      "Title": "IM 33 YEARS OLD. ULTRASOUND AND MAMMO NOW REFERRED TO A GENERAL SURGEON-CONCERNED HELP!"
    },
    {
      "AuthorID": "LIFEBEAR",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2213692&p=131404",
      "Content": " GIven my background and risk will having my breasts removed and placing implants in avoid a any risk of breast cancer? I guess i am wondering if it will lower the risk or even prevent it?\nlife bear ",
      "MessageIndex": 3,
      "PostDate": "18/09/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2213692",
      "Title": "IM 33 YEARS OLD. ULTRASOUND AND MAMMO NOW REFERRED TO A GENERAL SURGEON-CONCERNED HELP!"
    },
    {
      "AuthorID": "LIFEBEAR",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2213692&p=131404",
      "Content": " GOOD DAY, I AM A 33 YEAR OLD GIRL AND MY MOTHER AND GRANDMOTHER BOTH HAD BREAST CANCER. I DID MY FIRST MAMAO AT THE AGE OF 30 AND HAVE DONE FOLLOW UP ULTRASOUNDS SINCE. JUNE 2010 I WAS ASKED TO GO FOR A FOLLOW UP MAMMO & ULTRASOUND AND THEY FOUND AN OBSCURED MASS IN MY LEFT BREAST. I DONT KNOW ...APPARENTLY I HAVE CYSTS BUT THIS \"MASS\" OBVIOUSLY HAS THEM WORRIED, I RECEIVED A BIO RAD NUMBER 3. ANYONE CAN SHARE THERE EXPERIENCE OR ANY ADVICE. I AM WORRIED.....WHAT HAPPENS IF IT IS CANCER? DO I HAVE TO DO CHEMO? SAY I ELECT TO REMOVE MY BREASTS AND THEN HAVE IMPLANTS PUT IN. I AM TO AFRAID ...\nHELP!\nLIFE BEAR ",
      "MessageIndex": 0,
      "PostDate": "16/09/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2213692",
      "Title": "IM 33 YEARS OLD. ULTRASOUND AND MAMMO NOW REFERRED TO A GENERAL SURGEON-CONCERNED HELP!"
    }
  ]
}