{
  "AuthorID": "Loujay",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3816517&p=236619",
  "Posts": [
    {
      "AuthorID": "Loujay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3816517&p=236619",
      "Content": " Hi all. Just seeking some advice.\nMid last year, I noticed a lump behind a nipple. This nipple has always been inverted (whereas the other one has always been normal). This year, I decided to get it check out as it had grown and the nipple is now permanently stuck inverted because of the lump behind it. My doctor didn't do an exam but sent me for a mammogram +/- ultrasound, but because I'm a few months shy of 35, they said they would only do the ultrasound unless they saw a need to do a mammogram on the ultrasound. No problem.\nThe results were that it looks like normal dense breast tissue. She showed me on the screen, the lumpy breast compared to the non-lumpy, and she (and the radiologist) were satisfied it was all normal and no need to do a mammogram as there is no family history of breast cancer. I was happy with this. \nIssue is that this lump behind my nipple hurts lately. In the shower just before I accidentally bumped it and the pain was unbearable. The nipple also gets itchy from time to time. Is this normal for dense breast tissue? The lump is a little smaller than a ping pong ball and is directly behind the nipple. This just doesn't feel normal, but at the same time the sonographer and radiologist were happy with the appearance and if anything, ultrasounds should show up any area of concern...right?!?\nI'm 34, have no regular cycle as I have a Mirena IUD, and the other breast doesn't hurt at all, no tenderness. Appreciate any advice! ",
      "MessageIndex": 0,
      "PostDate": "24/03/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3816517",
      "Title": "Dense breast tissue - but really painful"
    },
    {
      "AuthorID": "Loujay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3816517&p=236619",
      "Content": " Some updates. I got in to see the surgeon earlier because he had a cancellation. He said the lump is unusual and he's not sure what it is. Referred me for another ultrasound and mammogram. The reports indicated that it may be thickened skin, but he's still not convinced - neither am I because the lump swells, shrinks, swells again, is tender. Doesn't seem normal for just skin and it has totally changed the appearance of the nipple which is now misshapen from what it was originally. He's booked me for an \nopen biopsy in hospital in a couple of weeks, he didn't think a punch biopsy would be a sufficient enough sample. ",
      "MessageIndex": 8,
      "PostDate": "13/04/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3816517",
      "Title": "Dense breast tissue - but really painful"
    },
    {
      "AuthorID": "Loujay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3816517&p=236619",
      "Content": " Thanks straydog, I have an appointment tomorrow morning.It definitely feels wrong. It may just be a cyst but I think the doctor needs to take a look, if for reassurance than anything else. ",
      "MessageIndex": 1,
      "PostDate": "27/03/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3816517",
      "Title": "Dense breast tissue - but really painful"
    },
    {
      "AuthorID": "Loujay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3816517&p=236619",
      "Content": " The biopsy has been done a couple of days ago - they took an oval shaped piece with part of the thickened skin of the areola as well as some breast tissue. What they didn't expect to find in there when they made the incision was an infection, lots of pus. They cleaned it all out so there's no need for me to be on antibiotics and have left a soft drain poking out through the stitches. I was too scared to look the first day - I expected a hard tube! But it's nothing like that. The incision is about\n an inch long - so bigger than I expected but the pain has been surprisingly minimal - more of an occasional sting than actual pain. There has been a little bit of drainage. Doesn't hurt to touch. I go back next week for results and removal of the stitches (which were going to be dissolvable until the surgeon discovered the infection) and the drain. I was able to comfortably wear a bra yesterday which made me happy! I go back to work next week and I wanted to be able to wear a bra \n ",
      "MessageIndex": 9,
      "PostDate": "10/05/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3816517",
      "Title": "Dense breast tissue - but really painful"
    },
    {
      "AuthorID": "Loujay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3816517&p=236619",
      "Content": " Hi Susie, my recollection is a little bit foggy, but I don't think they mentioned the cause of the infection. The lump is still there though so I'm not sure it will all resolve via the drain. I have had a little bit of pain above where the drain is so I'm not sure if something is draining from higher up. The funny thing is that I went through all this because of the lump under the areola, but there was areola thickening as well. Maybe because of the lump which caught my attention they will find the cause of the thickening.I don't have any other symptoms of Paget's besides that so I'm hopeful that it is not anything serious. I always tend to worry and think worse case scenario but not this time. I feel I don't know what I don't know and will just have to (patiently!) wait to find out a cause. Thank you for your reply \n ",
      "MessageIndex": 10,
      "PostDate": "11/05/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3816517",
      "Title": "Dense breast tissue - but really painful"
    },
    {
      "AuthorID": "Loujay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3816517&p=236619",
      "Content": " Hi Susie, GP didn't do an exam because he felt it wouldn't add anything further but referred me straight to a breast surgeon. GP suspects duct ectasia. He gave me a script\n fo antibiotics just in case it suddenly gets worse, red, more swollen and painful - grateful to have that just in case rather than have to make an appt and go back for it! The surgeon appointment is in 3 weeks but they said they would call if they had any cancellations. I actually thought 3 weeks was pretty good! GP said he may do a biopsy or just remove the lump altogether. ",
      "MessageIndex": 2,
      "PostDate": "29/03/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3816517",
      "Title": "Dense breast tissue - but really painful"
    },
    {
      "AuthorID": "Loujay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3816517&p=236619",
      "Content": " The results are in: plasma cell mastitis. Rare, incurable, untreatable. Benign and not a precursor to cancer so that is good. The only known option to relieve the abscess is surgically, but this is not a cure and it could constantly recur, as well as run the risk of developing fistulas. The biopsy and sample of the abscess they took did not grow bugs, so it's not an infection that can be treated with antibiotics. There is very little information about\n it.\nThe surgeon did say the wound may not heal, and could re\nopen. I am trying to keep it closed with butterfly strips. He will review the healing next week.\nIt was a bit of a rollercoaster of a day - relief it's not anything fatal yet despair at it being something that can't be cured. I just have to hope that it won't continue to cause problems. ",
      "MessageIndex": 5,
      "PostDate": "17/05/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3816517",
      "Title": "Dense breast tissue - but really painful"
    }
  ]
}