{
  "AuthorID": "lucky111",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3134872&p=202501",
  "Posts": [
    {
      "AuthorID": "lucky111",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3134872&p=202501",
      "Content": " Hi!\nSo glad you are holding up well and have each other to lean on. From my experience they stage you after you're biopsy and then it could change after the surgery. If you look on your biopsy report you should find some reference to the stage. The fact that it is invasive I would guess stage 2 but after the surgery they will test the tissue and nodes. Again they are doing much more with a lot less harsh drugs treatment. You should ask all these questions, write them down so you have a list because when you are with the doctor you tend to get distracted by what he is saying and forget to ask your questions. Ask how many nodes (if any) will they remove and test. They will prob take the central node at least. Ask the doctor to explain it to you. Not understanding causes needless fear and frustration. This is also where group comes in handy because they were my rock just on the amount of knowledge and experience. \nSending positive thoughts…. ",
      "MessageIndex": 2,
      "PostDate": "19/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3134872",
      "Title": "Wife just diagnosed with IDC"
    },
    {
      "AuthorID": "lucky111",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3134872&p=202501",
      "Content": " Hi Pat,\nSorry to hear about\n your wife and your battle with cancer. I was 48 when diagnosed with DCIS one side and LCIS on the other and I also have a mix of cells???? Considering what it could have been I was lucky but I still live with the fear waiting for the shoe to drop. What helped me the most was I found a great group that meets once a month and I learned so much. That was in 2008 and I still go to group and we are all so very close. Some groups are very clinical but our group is a great mix of serious and laughter. We talk cry and most of all help the new people manage when they start down their road. Your wife is lucky that you are supportive so right there she is ahead of the game. But there will be things you can't help her with and she might benefit from a group that understands because collectively they have been through it all. From what you say she has IDC and depending on the stage she might not even need chemo. They are using chemo less now. I wish you luck and will say a prayer : ) ",
      "MessageIndex": 3,
      "PostDate": "18/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3134872",
      "Title": "Wife just diagnosed with IDC"
    }
  ]
}