{
  "AuthorID": "Luna7246",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=391186&p=148135",
  "Posts": [
    {
      "AuthorID": "Luna7246",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=391186&p=148135",
      "Content": " My damaged tissue was found through the mammograms... ",
      "MessageIndex": 16,
      "PostDate": "12/06/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=391186",
      "Title": "lump in breast"
    },
    {
      "AuthorID": "Luna7246",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=391186&p=148135",
      "Content": " Hello everyone! I'm new to this forum and found it very interesting and helpful for my concerns. I am 33 years old. Just yesterday had a mammogram done on me upon my Doctor's request. It was my very first one ever so was not sure at all of what to expect there. After my first images were taken, I was called in again for a second set, then a third set of images were requested. I started to freak out towards the end of the third set because I just thought this is just way too much in a day! So yes, Doctor at the radiology center had found something abnormal. I was then waiting to finalize my visit with an ultrasound in which the ultrasound tech called the doctor to let him proceed with the ultrasound himself. Doctor was there talking to me about\n some damaged tissue on my left breast, and a 5mm lump on same breast which was detected through ultrasound. I don't know what all this means now. He just told me that I have to previous test records to compare my new results with, and that I will need to go back in 6 months for a new test. I truly need some advice, if anybody could help will be greatly appreciate it! I'm thinking if wouldn't it be better if they check if is malignant first, instead of waiting 6 long months?\nThanks so much from the bottom of my heart!\nWill be anxiously waiting for some of your Replies :) ",
      "MessageIndex": 7,
      "PostDate": "12/06/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=391186",
      "Title": "lump in breast"
    }
  ]
}