{
  "AuthorID": "marius14",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3124834&p=201665",
  "Posts": [
    {
      "AuthorID": "marius14",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3124834&p=201665",
      "Content": " I have experience from my uncle about\n vitamin B17 which helped him a lot with cancer. You can´t get it in common but you can get some from apricot seeds, but carefully with it they includes a little portion of kyanid (best if you make plan for consumption, he using 21 per day). So i wanted to share my experience, i hope its help you could try it with your current therapy and maybe its help you (remember for security only 9 per day)....\nhttps://www.youtube.com/watch?v=CyvSmhrlJwE Sandy beat cancer with B17. 2 minutes video\n ",
      "MessageIndex": 0,
      "PostDate": "06/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3124834",
      "Title": "B17 vitamin"
    },
    {
      "AuthorID": "marius14",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3124834&p=201665",
      "Content": " And at the end one recommandation from web:\nARE ALL APRICOT KERNELS THE SAME?\nNO! What a lot of people do not consider when choosing an apricot kernel supplier is that apricot kernels (like all oil seeds) are very susceptible to moulds if not immediately dried to reduce the moisture levels that will inhibit mould growth.\nOne very dangerous mould that apricot kernels are susceptible to is aflatoxin. Aflatoxin is a fungus, a mycotoxin that is very toxic and carcinogenic to humans. It is known that chronic exposure will lead to a high chance of developing liver cancer. (ref: wikipedia)\nIt is not often easy to spot as the kernel husk (skin) can conceal the mouldy flesh underneath. The best way to avoid ingesting this toxic fungus is to not purchase kernels that are not assured that they have been dried immediately to a moisture level of under 7% within 48 hours of removal from the fruit and then stored in weatherproof conditions to keep moisture levels safe. So please take care when looking to purchase any fruit kernel.\n ",
      "MessageIndex": 2,
      "PostDate": "12/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3124834",
      "Title": "B17 vitamin"
    }
  ]
}