{
  "AuthorID": "memaw12",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=166177",
  "Posts": [
    {
      "AuthorID": "memaw12",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=166177",
      "Content": " I'm sorry to hear you're going through this. I have something going on with my left breast. Three weeks ago I started having pain and swelling. There was a little lump under the nipple area. It was sore, hot, and vey red.\nI went online and read about\n mastitis. This seemed to be the symptoms that I was having but it also mentioned a fast growing type of breast cancer, inflammatory breast cancer.\nI started taking antibiotics right away because I really thought it was mastitis. It has gotten better a little every couple of days and now all the swelling, redness and soreness are gone.\nI still have a little heavy feeling and some pain in my left arm and back of the neck area but I also have arthritis and fibromyalgia so I think that's what's going on there. I had an appnt. last week with my gyn. but they had to cancel due to snow and icy conditions. I'm going on Thurs. am. however. I am hoping to get good news, that it was only mastitis, but I'm still quite nervous about\n it.\nI read that this type grows fast, in a matter of weeks. This is scaring me. It's not like the kind with a lump and no pain that grows slowly. I had never heard of this before. I am praying that you and I both get really good news. I know exactly how you are feeling.\nChronic Fatigue Syndrome, Fibromyalgia, OA, Hypothyroidism, Diabetes Type 2, IBS, Neuropathy, Ocular Migraines. ",
      "MessageIndex": 4,
      "PostDate": "19/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2989043",
      "Title": "Found a lump in my breast.. Doctor is blowing me off"
    },
    {
      "AuthorID": "memaw12",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=166177",
      "Content": " I had some antibiotics left from a tooth infection so I've been taking them till I can get to the doctor. It's Erythromycin and it's one that's used for mastitis.\nIt started to get better in a few days and gradually improved in two weeks. This is the third week and its' mostly gone. My appnt. is tomorrow. Weather problems cancelled my last one.\nChronic Fatigue Syndrome, Fibromyalgia, OA, Hypothyroidism, Diabetes Type 2, IBS, Neuropathy, Ocular Migraines.\n ",
      "MessageIndex": 5,
      "PostDate": "19/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2989043",
      "Title": "Found a lump in my breast.. Doctor is blowing me off"
    }
  ]
}