{
  "AuthorID": "Miney",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=657464&p=40066",
  "Posts": [
    {
      "AuthorID": "Miney",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=657464&p=40066",
      "Content": " Jule, \n Yes I have made the an appoitment for Dec. 8th at a Breast center near where I live. I picked up all the films that were taken last week. \n Right now I am taking a break from preparing Thanksgiving dinner. It will be at my house. I am looking forward to it and seeing everyone and getting my mind off of my breast. \n Well I hope you have a very nice Thanksgiving. I will be back on Friday. Take Care Lisa ",
      "MessageIndex": 8,
      "PostDate": "22/11/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=657464",
      "Title": "Chemo and radiation"
    },
    {
      "AuthorID": "Miney",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=656226&p=40066",
      "Content": " \n ",
      "MessageIndex": 0,
      "PostDate": "20/11/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=656226",
      "Title": "Abnormal Mammogram Question"
    },
    {
      "AuthorID": "Miney",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=656226&p=40066",
      "Content": " Jule, Gail, Laure, Jo Ann & Tavish, \n You guys have been a big help and very compasionate and I just want to thank you for being here. My husband is trying to understand and being there for me, but it's hard for someone to know how you feel unless you have been there. I have made an Appointment for Dec. 8th. I picked up all the films that were taken. I tried to look at them and of course I don't know what I'm looking at. I had only 2 mammograms done in my life and I did notice I went from BiRads 1 to BiRads 2. I understand the Bi Rads thing. And I'm not going to sit around till next year to wait to see if I go to a 3. You guys have no idea what strength you have given me by your replies. Screw these doctors. They are not god and they do not have eyes to see abnormal cells in a human body. I'm taken over my body and doing what I feel is best. To them I'm nothing but a chart. But to my family I'm a person they love and need. So once again THANK YOU \n and I hope everyone is doing well themselves. And I am here for you guys as well. I hope everyone has a Happy Thanksgiving Day!!! Hugs Lisa ",
      "MessageIndex": 4,
      "PostDate": "22/11/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=656226",
      "Title": "Abnormal Mammogram Question"
    },
    {
      "AuthorID": "Miney",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=657464&p=40066",
      "Content": " Hi Jule, \n I wish I could help you like you have helped me, but I'm afreaid I don't know much about\n that stage. But I'm here for you and I hope everything goes well. I hope you have a Happy Thanksgiving Hugs Lisa (Miney) ",
      "MessageIndex": 7,
      "PostDate": "22/11/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=657464",
      "Title": "Chemo and radiation"
    },
    {
      "AuthorID": "Miney",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=656226&p=40066",
      "Content": " Dear Jule and Gail..... Thank you for responding and advising me in a direction I was not sure about\n. I have made an appointment for a second opinion. I go on Dec. 8th to a breast center near me. I also found out this morning that my prolactin levels were normal, but I still have clear discharge coming out. I forgot to mention that when I posted the question the first time. I told my doctor and the radiologist that I had a discharge on both breast. It doesn't come out when they are pressed or squeezed nor do I feel it happening. But I see it in my bra's. I'm getting tired of buying bra's \n This has been going on for about\n 8 months. They also don't seem to be concerned about\n that. I am only 41 years old. I am so scared I have no idea what is going on. Did you guys have nipple discharge? \nThanx for all your support and hugs, Lisa ",
      "MessageIndex": 6,
      "PostDate": "21/11/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=656226",
      "Title": "Abnormal Mammogram Question"
    },
    {
      "AuthorID": "Miney",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=660167&p=40066",
      "Content": " Hi Jule, \n I have been reading some of your posts. How did you make out on the internet. Did you find anything that helped? Lisa ",
      "MessageIndex": 6,
      "PostDate": "27/11/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=660167",
      "Title": "Ok Ive been reading again!!!!!"
    }
  ]
}