{
  "AuthorID": "Moira88",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3681365&p=254211",
  "Posts": [
    {
      "AuthorID": "Moira88",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3681365&p=254211",
      "Content": " Exqualls, I am also one of the many people following your posts in this forum...sending healing thoughts and prayers your way for a speedy recovery. Although your treatment for cancer may be on hold for months, I somehow believe that the treatments you have done so far have eliminated the cancer from your body. In your first post, when you described your history of going to the GYN and doctors, you could have been writing about\n my medical history as well. After finally going for a mammogram and having totally normal results, I realize how important these tests are, not only for one's physical health, but for their mental health as well. Thank you for your wonderful strength and for sharing all that you're going through...whether you realize it or not, you're helping a lot of people. ",
      "MessageIndex": 111,
      "PostDate": "14/04/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3681365",
      "Title": "new to forum, diagnostic mammo and ultrasound found large lumps"
    },
    {
      "AuthorID": "Moira88",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3681365&p=254211",
      "Content": " Hi Exqualis, so sorry to hear of your further complications, but I'm glad your feeling better now. Unfortunately, I had a \"light\" case of Guillain-Barre' syndrome about\n five years ago after a flu shot...it was a misery, and I can remember feeling like I had a 50 pound weight wrapped around each leg when I wanted to walk. From your descript\nion, it sounds like you had a worse case than I did, but with time I'm sure yours will go away completely. I had other health issues going on at time, but from what I remember, it took about\n two or three months for me to start feeling better. I had no permanent after effects from the GB, but it was really frightening at the time because I didn't know what was wrong with me. My medical nightmares have been orthopedic in nature with neurological complications from surgeries, but eventually everything healed even although my doctors were doubtful about\n how I would land up. At the time I just decided to calm down, tune out the negativity, and try to enjoy my healing process. That's sounds crazy, doesn't it, but it made things easier to enjoy the help of friends and family, to savor all of the delicious food brought into the house, and to take great joy from very small things like a visit from a good friend. Keep getting better, and I'm sending you prayers and positive healing thoughts... ",
      "MessageIndex": 125,
      "PostDate": "15/04/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3681365",
      "Title": "new to forum, diagnostic mammo and ultrasound found large lumps"
    },
    {
      "AuthorID": "Moira88",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3681365&p=254211",
      "Content": " Exqualls, I had many a sob fest too and my so-called \"better attitude\" only came many months after a really really bad attitude and when I started to feel better...after a nasty bout of GB that thankfully only affected my legs, and two major orthopedic surgeries, which had me in a hospital for one month and an extended care facility for another month. I was so happy to be on the other side of this ordeal and to be surrounded by my own four walls that I started to lighten up. Please don't be too hard on yourself, and remember that you are allowed to cry. There does come a point with illness, whether it be cancer or some other serious sickness, that you just hit a wall and have enough. \nI think we're just starting to understand the genetics of cancer, but we still have very far to go. I have a very heavy family history of breast cancer, but so far it seems that I take after another side of the family with orthopedic and weird heart problems. Tomorrow will be a better day and in the meantime, I'm sending you prayers and positive healing thoughts... ",
      "MessageIndex": 139,
      "PostDate": "18/04/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3681365",
      "Title": "new to forum, diagnostic mammo and ultrasound found large lumps"
    },
    {
      "AuthorID": "Moira88",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3681365&p=254211",
      "Content": " Hi Exqualls...bet you thought I left the planet...really serious computer problems here, and my passwords and IDs got so messed up, I couldn't even log into my accounts anymore. I needed a new cable to the motherboard in my laptop, and I'm so glad that's over. I've been reading your posts today, and it does seem that your finally making progress. My bout with GB was very mild next to yours, and I never did have any involvement of the arms or hands. Listening to you describe your symptoms, I feel that I really didn't have GB at all...\nI really don't know anything about\n Taxol and GB, but I can pass on a anecdote about\n chemo affecting leg function...a work aquaintance from a sister company was in the process of having chemo for colorectal cancer. I asked her how she was doing, and she told me that the chemo had brought on peripheral neuropathy in her legs and feet and that this that was affecting her ability to walk and drive...she was going to move near her family in Florida. We lost contact after that, so I don't know if these matters ever resolved, but perhaps this would be another avenue for you to research. \nSending you prayers and positive healing thoughts...\n ",
      "MessageIndex": 143,
      "PostDate": "03/05/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3681365",
      "Title": "new to forum, diagnostic mammo and ultrasound found large lumps"
    },
    {
      "AuthorID": "Moira88",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3681365&p=254211",
      "Content": " Exqualls, Hope all is well and that you get good news from your neurologist...it's been a horrible few days for me. Over the weekend I received the sad news that my sister in Arizona has passed away from a heart attack. She had some heart issues, but this comes as a total shock to the family... I'll be heading out to the airport later today and plan to stay at least a month to settle her affairs. I just want you to know that I wish you the very best outcome with your GBS and chemo and that I'm sending you prayers and positive healing thoughts. ",
      "MessageIndex": 132,
      "PostDate": "09/05/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3681365",
      "Title": "new to forum, diagnostic mammo and ultrasound found large lumps"
    },
    {
      "AuthorID": "Moira88",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3681365&p=254211",
      "Content": " Hi... I don't know whether you realize it or not, but your posts are becoming longer and longer, so you must be making some improvement where your fingers and hands are concerned. As for my bout with GB, it was a light one, but I had so many other health issues going on at the time that it was the last thing on earth that I needed. I guess you must really know what that feels like. Although I didn't have any involvement of my fingers, hands, or arms , my legs and feet were affected with a lot of weakness and an inability to balance. Although symptoms subsided in about\n three months, I had other orthopedic problems that still prevented me from walking, but here I am, I'm on my feet and I'm glad it's over... and I really hope that you get to that point too. \nI'm just wondering if your doctors advised you to take any B vitamins while you're in the recovery of your GB? Vitamin B is supposed to help with nerve issues, so you may want to ask your neurologist about\n that. I didn't ask anybody, but I did start taking vitamin B6 and B 12 and can't really say if it helped or not or if I was imagining it. I'm so happy to hear that your legs improving so much, and I hope your fingers and hands are the next to follow.\n Sending you prayers and positive healing thoughts ... ",
      "MessageIndex": 144,
      "PostDate": "05/05/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3681365",
      "Title": "new to forum, diagnostic mammo and ultrasound found large lumps"
    }
  ]
}