{
  "AuthorID": "Ms Green",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1006293&p=58287",
  "Posts": [
    {
      "AuthorID": "Ms Green",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1006293&p=58287",
      "Content": " I've been smoke free for almost a year. I've tried everything you can name to stop smoking...from cold turkey to hypnosis...nothing worked, especially if something emotional came up, which always happened whenever I tried to stop... I heard about\n Chantix and decided to give it a try...well after being on Chantix for 2 weeks, my mother was admitted to the hospital for amputation...I started smoking like a chimney again... I was a nervous wreck... It appeared as if everything went downhill from there. I lost my mother in January 2007 and my father in April 2007. I was very depressed and really didn't care about\n anything...and I was still smoking...well, something told me I needed to try to stop smoking before I joined my parents... I got a prescript\nion for Chantix and started the program again in April...I haven't had a cigarette between my lips since... Chantix took away the desires, cravings and the bad attitude...didn't stop the weight gain though... Every now and then I get this thought about\n cigarettes, but before I can blink an eye, it's gone... Don't give up on Chantix... I'm a no will power person, so if I can do it, anyone can! ",
      "MessageIndex": 4,
      "PostDate": "19/02/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1006293",
      "Title": "Neuropathy"
    },
    {
      "AuthorID": "Ms Green",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1012067&p=58287",
      "Content": " Hello, I'm new at all this. I was diagnosed with non-invasive pre-cancerous cells in my right breast. I finished my 33rd (last) radiation therapy in November and 30 days ago started Tamoxifen for 5 years. I was told by my radiation doctor that the radiation would cause me to feel tire. Well after around the 10th treatment, I begin to feel tire...less energy than usual. I'm a always on the go kind of person, but now I had to slow down and do just the necessities...nothing extra. I expected my energy level to more or less go back up to normal...I'm sure it's a slow process and is also looking forward to returning to the \"old me\"... My energy level appears to be trying to go up somewhat. I think I'm pushing me so I'm still getting exhausted quickly after climbing the stairs a few times (going from my basement's washroom to the upstair bedrooms - 2nd floor). I am also looking forward to starting up my exercise program to lose weight or try to maintain and to get my body back into skiing condition. Please say next year this time, I'll be sliding down mountains with skis attached to my feet... ",
      "MessageIndex": 2,
      "PostDate": "14/01/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1012067",
      "Title": "Fatigue After Breast Cancer"
    },
    {
      "AuthorID": "Ms Green",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=110474&p=58287",
      "Content": " MarG, 57, New York, pre-cancerous cells in right breast, lumpectomy, 33 radiation treatments, started Tamoxifen 30 days ago. ",
      "MessageIndex": 141,
      "PostDate": "14/01/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=110474",
      "Title": "ROLL CALL name, age, state and any other info to share"
    }
  ]
}