{
  "AuthorID": "Phillsgirl",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1186208&p=55265",
  "Posts": [
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1186208&p=55265",
      "Content": " \n ",
      "MessageIndex": 0,
      "PostDate": "18/07/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1186208",
      "Title": "arimidex"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1186208&p=55265",
      "Content": " Thanks Ladies,\n Just never read about\n anyone else with the same problems. Going to call the oncologist tomorrow to see if I can get off it,\nCarol from rochester ",
      "MessageIndex": 4,
      "PostDate": "20/07/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1186208",
      "Title": "arimidex"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=952397&p=55265",
      "Content": " Thanks for the info, and THANKS for just replying I feel so alone sometimes\ndiagnose 9/07\nlumpectomy 10/10/07\n1 node positve\nmargins clear\nstage IIA\nchemo and rad to follow ",
      "MessageIndex": 1,
      "PostDate": "28/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=952397",
      "Title": "Two weeks after lumpectomy, still very sore is this normal"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=953194&p=55265",
      "Content": " I don't know if this is normal, but I can't stop thinking that I have cancer. I had a lumpectomy 2 1/2 weeks ago and the doc says right now the cancer is out but I am soo afraid it is somewhere else. I'm afraid to think it is gone so as to not be disappointed if it isn't. I still have all the treatments to do and that scares the hell out of me. I try to joke about\n being bald and drawing on my eyebrows but, inside it is killing me. I know that sounds vane but I don't go to the corner store without makeup and now I am facing no hair, eyebrows, or eyelashes. I know I am glad that there are good treatments to make me survive and I guess this is showing me what is really important in life, but I am still so scared. Family and friends just don't get it. I'm so glad I can sound off when I feel this way. Just being able to share with others who know makes such a difference. ",
      "MessageIndex": 0,
      "PostDate": "28/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=953194",
      "Title": "First thing when i wake up is think about CANCER"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=986658&p=55265",
      "Content": " Thanks Lori,\nYesterday I went to the docs because my head hurt so bad and I was so off balance so they drew blood. from the port. Didn't feel a thing so the next session of chemo should be a breeze. They put me on atttivan an anti axiety drug. I thought I was handling it pretty good but guess not. It really helps and lets me sleep which I never do. Now I think my body can fight this if I can rest. All my blood counts were great so far. If it's the same every time I CAN get through this like a trooper. More relieved now Thanks Carol ",
      "MessageIndex": 1,
      "PostDate": "06/12/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=986658",
      "Title": "First Chemo"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=986658&p=55265",
      "Content": " Ellen, \n I know exactly how that thrush is. I got it 7 years ago when I had major back surgery and everytime I get an antibiotic I get it so watch out. I have the mouth sores now but I got a prescript\nion for some swish and swallow stuff and it helps. Same thing they gave me for thrush years ago. Today was a great day. No symptoms of any kind. Feel like my old self. Went Christmas shopping. Just when I feel good I'll have to get another treatment. Sucks. But, it will all be over January 28th. Counting down the days. Will still have to do 6 weeks of radiation but that I think I can handle. Well I have no choice. Hope you have a great holiday.\nCarol from Rochester NY ",
      "MessageIndex": 5,
      "PostDate": "07/12/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=986658",
      "Title": "First Chemo"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=981069&p=55265",
      "Content": " Hi everyone,\nI started chemo on Monday, They had a hard time getting in the port but once they did everything went well. I have been feeling pretty good up until this morning. Pretty sick to my stomach. Today even my coffee tastes really bad and I do love my coffee. I feel for all of you who have gone through this. The hair lose is something that I'm looking forward to. I always had long hair and I got it cut last week short. Love it I probably will never go back to long. Short hair is so easy to manage. No hair will probably be even easier (LOL) I find it very comforting to read the comments that you all have for anyone with a problem. I try to do the same but am quite new at this, so I don't have alot of experience with all the procedures yet, I'm sure someday I will. Not an accomplishment I ever wanted but someday if I can help someone else, I will be glad I can. Thanks to all of you.\nCarol from Rochester NY\nDiagnosed 10/3/07\nInvasive ductal carsinoma\nLumpectomy and node removal 10/10/07\nstage II\n1 node positive\nport 11/19/07\n1st chemo 11/26/07 ",
      "MessageIndex": 0,
      "PostDate": "28/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=981069",
      "Title": "Started Chemo"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=981069&p=55265",
      "Content": " Thanks for the prayers ladies. Started to feel better yesterday. Had no chose. My mom who is 83years old and sister got in a car accident..Sister ok Mom has 4 broken ribs, broken wrist, broken foot and small bleed in her head, She will be ok they say so I had no time to feel bad about\n myself yesterday. Distractions sure but things into its proper place. Family is everything. Thanks again.\n Carol ",
      "MessageIndex": 4,
      "PostDate": "30/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=981069",
      "Title": "Started Chemo"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1138409&p=55265",
      "Content": " I started Tamoxifen before my rads. Didn't bother me while doiing it. It did cause hot flashes but I,m not sure that is from the menapause alone or a combination of both. Other than that all went well. Good luck to you. ",
      "MessageIndex": 5,
      "PostDate": "06/11/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1138409",
      "Title": "when to start tomaxafen"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1071476&p=55265",
      "Content": " \n \n \n ",
      "MessageIndex": 4,
      "PostDate": "17/03/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1071476",
      "Title": "? about radiation"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1071476&p=55265",
      "Content": " Thanks Kathy,\nI feel much better after talking with you ladies. Just can't wait until this is all over and life goes back to normal. Just in time for spring. A new beginning in all senses of the word.\nCarol ",
      "MessageIndex": 5,
      "PostDate": "18/03/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1071476",
      "Title": "? about radiation"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=993309&p=55265",
      "Content": " Hi ladies,\nI'm about\n to get my second treatment and I am hoping the symptoms for me are the same as they were last time. Can anyone let me know. I'm getting all nervous again. I'd appreciate any input. Thanks\nCarol from NY ",
      "MessageIndex": 0,
      "PostDate": "14/12/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=993309",
      "Title": "Are chemo symptoms the same every time?"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=952397&p=55265",
      "Content": " Hi everyone, I'm 44 and just had a lumpectomy with lymph nodes taken out. Still in a lot of pain in the arm. Is this a normal thing? Can't wait to feel normal again, if you can call having cancer normal but I know everyone must feel this way. How long does it take? Any help? ",
      "MessageIndex": 0,
      "PostDate": "27/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=952397",
      "Title": "Two weeks after lumpectomy, still very sore is this normal"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=953182&p=55265",
      "Content": " Thanks for replying. It is already getting better. Halloween was here and I had a great time. I;m also not in much pain so I can forget for a time and everything is normal. Someday. I'll write again. ",
      "MessageIndex": 2,
      "PostDate": "02/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=953182",
      "Title": "I just can't think of anything but Cancer"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=953182&p=55265",
      "Content": " Thanks for asking, My name is carol and i'm from rochester, ny I start chemo on nov. 26 and im more nervous the closer it gets but I can do it. ",
      "MessageIndex": 7,
      "PostDate": "16/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=953182",
      "Title": "I just can't think of anything but Cancer"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1071476&p=55265",
      "Content": " Hi ladies,\n ",
      "MessageIndex": 0,
      "PostDate": "16/03/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1071476",
      "Title": "? about radiation"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=980876&p=55265",
      "Content": " Litteanne,\nI had a biopsy and it was almost painless. They numbed up the area and all I felt was a little pinch. Don't be to afraid. I worried myself sick and it went ok. Good luck and let us know how it turns out.\nCarol from Rochester, NY ",
      "MessageIndex": 2,
      "PostDate": "28/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=980876",
      "Title": "Complex Breast Lump"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=978983&p=55265",
      "Content": " It is so great that you are so concerned and \nopen about\n it. Most men at your age I don't think would talk about\n it especially to a bunch of strangers. I can see you are a loving son and that is all that matters. just be there for your mother and hug her for no reason at all except that she needs it. That will get her through this. knowing you are there for her. Good luck for you and your mom and many hugs are sent to both of you. Carol for NY ",
      "MessageIndex": 1,
      "PostDate": "27/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=978983",
      "Title": "Support From A Son"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=972422&p=55265",
      "Content": " Ang, \nI'm glad they took it out but I'm sorry you went through so much pain. I love the way they say it shouldn't hurt. Unless they have had it, they just don't know. Scars heal and you should be ok. When you are healed good try some mederma on it to make it look better. It takes time but I hear it really works. I started using on my new scars. good luck and keep in touch.\nCarol ",
      "MessageIndex": 6,
      "PostDate": "28/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=972422",
      "Title": "Does anyone here have an implanted Port??"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=993309&p=55265",
      "Content": " Thanks Lori,\n I have heard that it's basically the same but wasn't sure. I was nauseous day three and four but really didn't have too many other symptoms. And the meds worked pretty good with the nausea. Hope it works the same with Christmas and all. I get it on the 18th. Thanks again and have a great holiday\nCarol ",
      "MessageIndex": 1,
      "PostDate": "14/12/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=993309",
      "Title": "Are chemo symptoms the same every time?"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=972422&p=55265",
      "Content": " Ang, Just read about\n your trouble with the port. I too have a port. It was just put in 8 days ago. Everything went ok with that but yesterday I had my first session with chemo. It took 3 peope to try and get the needle in. All that poking and probing. I was crying like a baby. They said it shouldn't hurt like that, but what else could they say. I dread going back but I have to. As for scars, I had back surgery 7 years ago and they cut me 7 inches on my stomach and my back. The back scar is great but my stomach scar is an inch wide and 7 inches long. Now I have a large scar on my left breast and under my are from a lumpectomy. not to mention the scar on my right chest from the port. I look like I was hit by a truck. As long as I can live until my children and grandchild grows up it will all be worth it. I am only 44 years old and I have alot of living to do. My youngest is 15 years old. I hope everything goes better for you. Just keep on fighting someday you will be able to put this all behind you. Lots of hugs.\n Carol from Rochester, NY ",
      "MessageIndex": 5,
      "PostDate": "27/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=972422",
      "Title": "Does anyone here have an implanted Port??"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=986658&p=55265",
      "Content": " Well, the first chemo was pretty scary. Did't know what to expect. Went well though. Got nauseous a couple days later but it was bearable. I had some strange head aches and dizziness, like I was going to faint. Went to the docs. They put me on attivan for stress. It seams to be working. Any suggestions how to get through the stress of it all? Carol from NY ",
      "MessageIndex": 0,
      "PostDate": "05/12/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=986658",
      "Title": "First Chemo"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=953194&p=55265",
      "Content": " Thanks so much. Sometimes a hug is all I need. \n ",
      "MessageIndex": 1,
      "PostDate": "29/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=953194",
      "Title": "First thing when i wake up is think about CANCER"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=953194&p=55265",
      "Content": " Thanks, sorry it so much time for me to reply but you know how it is doctors doctors doctors so busy trying to get ready. yuk chemo starts on nov 26, thanksgiving meal is sure gonna taste good this year. lol but its all worth it. I'll write back soon. carol from rochester, ny ",
      "MessageIndex": 2,
      "PostDate": "16/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=953194",
      "Title": "First thing when i wake up is think about CANCER"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=952397&p=55265",
      "Content": " Thanks for the info. I am exercising but the underside of my arm burns like the worst sunburn you could get. Everything else seems to be healing amazingly well. By the way my surgeon made my lumpectomy breast look twenty years younger than my old breast. Who would of thought. ",
      "MessageIndex": 2,
      "PostDate": "29/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=952397",
      "Title": "Two weeks after lumpectomy, still very sore is this normal"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=953182&p=55265",
      "Content": " I have known for about\n a month that I have or should I say HAD breast cancer, had a lumpectomy 2 1/2 weeks ago. All I do is think about\n cancer and try to read and understand everything about\n it. Sometimes it takes over and I find that it all I've done all day. I'm sooo scared and cry alot. I sread the treatments and getting sick and losing my hair and everything. Family and friends just can't understand. Thanks for all you who can understand ",
      "MessageIndex": 0,
      "PostDate": "28/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=953182",
      "Title": "I just can't think of anything but Cancer"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=985388&p=55265",
      "Content": " Hi,\nI started my chemo on Nov. 26th. Had no idea what was going to be like. Heard all these horror stories. And I'm sorry if some women go through it but I went thru it fairly good. I did get nauseous on days 3 and 4 but the meds helped alot. No throwing up. Days 5 and 6 started with dizziness and head pain. Went to the docs, they said it was stress, no kidding!!! My mom got in a real bad car accident on that day and I was worried sick. She's 83 and had 4 broken ribs, broken wrist, small bleed in her head and possible both her feet are fractured or something, they still don't know because they want her to stand on them to get better x-rays. She can't, too painful. I guess that was enough stress to handle on top of the chemo. I am taking ativan for that and I feel great now. Back to my old self again. Hope you get thru This as I did. Let us know. My prayers are with you.\nCarol from Rochester, NY ",
      "MessageIndex": 4,
      "PostDate": "08/12/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=985388",
      "Title": "Red Devil Chemo"
    },
    {
      "AuthorID": "Phillsgirl",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=110474&p=55265",
      "Content": " Chicken 44 from Rochester, NY Three children 27, 25, 15 Lumpectomy 2 weeks ago. Cancer in 1 lyph node Dreading treatments Radiation and probably chemo\nRight in time for the holidays. Feeling like I should be celebrating. Could be worse. ",
      "MessageIndex": 128,
      "PostDate": "27/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=110474",
      "Title": "ROLL CALL name, age, state and any other info to share"
    }
  ]
}