{
  "AuthorID": "Pratoman",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3790554&p=158351",
  "Posts": [
    {
      "AuthorID": "Pratoman",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3790554&p=158351",
      "Content": " Christine, if you are looking for a very robust forum for ovarian cancer, go here....\n ",
      "MessageIndex": 3,
      "PostDate": "17/02/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3790554",
      "Title": "Don't know where else to post."
    },
    {
      "AuthorID": "Pratoman",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2661079&p=158351",
      "Content": " I posted on this earlier in the week, but got no responses, after 125 views, wondering if maybe its because my post was too long. So one more, shortened, attempt.....\nWife had BrC 23 years ago, after a few years, her follow up visits/marker tests where stretched out to once a year\nabout\n 4 years ago, CA 15-3 rose to mid thirties, and bounced around between mid 30's and low 40's. This has lasted a full 4 years, and she has been told to come in for follow up every six months which she has been doing, instead of every year.\nThe last two readings, 6 months ago, and last week, were both 33, with normal range being 32, I'm told.\nSeems to me, after 23 years disease free, and markers showing no real trend up over the 4 years, and no symptoms, she should be back to one year follow ups. But Doc says, even though he feels this is just her \"new normal\", he would like to see her every six months \"for the forseeable future\".\nAny thoughts, comments, experience with this? ",
      "MessageIndex": 0,
      "PostDate": "03/03/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2661079",
      "Title": "Follow up Protocol"
    },
    {
      "AuthorID": "Pratoman",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2659074&p=158351",
      "Content": " I have an issue i hope someone can shed some light on.\nWife had BrC in late 80's (age 37) and again in 1991. Two separate cancers, diff pathology. Same breast. First time lumpectomy and rad, second time mastectomy.\nShe has been disease free ever since. \nAt first her follow up visits were every 3 months, then every six months, then at 5 years once a year.\nTill about\n 5 years ago. Her CA 15-3 which had always been in the 20's, jumped (actually i think trended) into the 30's, and bounced around between 35 and 40 for about\n 4 years. After 2 years of no real trend up, he moved the visits to every 6 months, because he felt that it was nothing, just her new normal.\n The last two readings, which were 6 months ago, and this week, were both the same, at 33. \nIt has now been 4-5 years since this all started. Still no symptoms, and no sign of a rising trend. But the Onco, wants her to continue to come in every six months. \nI just wonder about\n this. It seems to me if this were something that needed to be watched, we would have seen something more after 4-5 years. But i am not a Dr so we just follow his instructions. BTW the original Dr that she was seeing who moved it to one year visits, has since retired and the one she is seeing now is his son. Seems very competent. We trust him, and my wife doesnt want to change because she knows him. I just wonder why at this point we dont move back to one year. When i ask, he just says, to be careful, leave it at 6 months for the forseeable future. These visits and tests are so stressful for her, I;m sure i dont have to explain that to anyone here. Thats why i wish he would move it to 1 year.\nI have done a lot of reading, i know that CA 15-3 is controversial as to its value, and i know that some drs do not use it. But her Doc does, so we go with i.\nAny experience, or thoughts on this? ",
      "MessageIndex": 0,
      "PostDate": "28/02/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2659074",
      "Title": "question about follow up and markers - long post"
    },
    {
      "AuthorID": "Pratoman",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2661079&p=158351",
      "Content": " Thanks, appreciate the acknowledgement of the thread. \nSurprised that nobody has had experience with fluctuating marker followup with multiple years of no symptoms, after long disease free period ",
      "MessageIndex": 1,
      "PostDate": "03/03/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2661079",
      "Title": "Follow up Protocol"
    }
  ]
}