{
  "AuthorID": "Skky",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311115&p=14156",
  "Posts": [
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311115&p=14156",
      "Content": " Molly,\n I don't have an answer for you. I just want to send positive vibes for b-9 results. \nBest wishes\nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "25/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311115",
      "Title": "Pleomorphic calcifications"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=686937&p=14156",
      "Content": " Thanks!! Had to take a break from the breast cancer persona I was creating for myself. Did that happen to anyone else after diagnosis? Anyways , feeling more like myself everyday. Hope everyone is well. Missed this board and will be stopping in more often. \n \n \n ",
      "MessageIndex": 3,
      "PostDate": "04/01/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=686937",
      "Title": "HAPPY NEW YEARS!!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=698137&p=14156",
      "Content": " Hi,\n I was diagnosed 2 yrs. ago when my daughter was 14 ,and my son was a little over a yr. We told my daughter before I went for surgery. We explained my diagnosis as truthfully , and honestly with her as we could. We also involved her in some of the Dr. appts. It was my belief that honesty was the best policy with her at her age, and I will admit it was a difficult and scary time for her. One of her concerns were if her chances now higher. I tried to talk to her as often as possible so she could express her concerns with me.There is no perfect answer your children are as unique as the next and your instincts will let you know what they can handle. Of course, because of the young age of my son, nephews, and neices we simply told them I was getting medicine to make me better. Recently my son looked at a pic of me in my bandana pointed to my head and said mommys hair is all better now? Your son may not be able to deal with total honesty at his age, and in my opinion I would just tell him your medicinces will cause side effects and thats how you will know they are working. Your children NEED TO KNOW there is much HOPE in your treatment. You do not need to go into the details and what ifs , only your diagnosis and treatment at this stage. Take each step as it comes, and talk to your children often. I hope this helps some, and I want you to know how much amazingly closer this may allow you to become with your children. Your daughter may not be able to talk to you when she needs to - so keep that door \nopen by starting the conversation yourself. \nHang in there,\nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "13/01/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=698137",
      "Title": "I'm New and seeking insight, please read..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=686937&p=14156",
      "Content": " \n \n \n \n \n \n \n \n \n \n \n \n \n MICHELLE \n   \n ",
      "MessageIndex": 0,
      "PostDate": "30/12/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=686937",
      "Title": "HAPPY NEW YEARS!!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=288645&p=14156",
      "Content": " Hi Traci,\n Im fairly new to this site too, and still under going treatment.Im also from your neck of the woods here in Michigan.I wish I had some advice to give you, but more importantly just wanted to send you well wishes.It sounds like you have traveled a long road, and I can feel the strength in your words.I hope some of the other ladies can give you the advice you need.\nBest wishes\nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "22/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=288645",
      "Title": "thanks for the invite, Lori, I'll introduce myself..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=479465&p=14156",
      "Content": " Blondy,\n I have'nt been to this board in a couple of months, but seen your post and wanted to give you some encouragement. When I was dxed last yr.(her2+++ also) I felt just like you. All the information on her2 was dim and scary. By the time I finished AC, herceptin had become available to those of us who were early stage. March 28th marked my one yr. anniversary. I have 6 more herceptin tx to go. While AC and taxol were no trip to the grocery store- herceptin has just been an inconveinence (going to the appt's) for me. There is a board her2support.org that has alot of information on her2+++ breast cancer. There are some scary topic's on that board , but there are also women who are NED for many yrs. now. Studies are now coming out that say with herceptin her2's actually have a better prognosis. BTW- I have made it this far without a port. I have to admit I was definately a coward when I was diagnosed, but with time I have gained an inner strength I did not know I had. I had to tell myself I can beat this over and over. Life is uncertain no matter what road we take-make the decision that's best for you. \n((hugs))\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "29/04/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=479465",
      "Title": "HER2 Positive"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=382970&p=14156",
      "Content": " \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "20/12/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=382970",
      "Title": "Happy Holidays!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=316871&p=14156",
      "Content": " Katt,\nMy hair started to grow back during my taxol treatments. I finished Aug. 4. I used to have long hair, so I still feel funny to go out with it short. Also, it came in blonde(my color prior to chemo) at the end of AC and fell out again. It came back in pitch black, and is now brown with golden highlights. It is so strange to see myself brunette. It's not real curly, but out of control wavy. I have people tellling me to ditch the wig now, but I still see it in my future for a couple more months as my hair is only 1 1/2 inches and is going every which way.I did not lose my eyelashes until 2 wks after I finished taxol, and they came back super fast. I never really did look at myself when bald, but wish I had taken a picture now. Your head will start to itch when it come back in. Hope it will be soon for all of you.\nHugs,\nMichelle\n ",
      "MessageIndex": 91,
      "PostDate": "29/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=316871",
      "Title": "Hair loss"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=382844&p=14156",
      "Content": " Vicky,\n I will be praying that radiation is the answer and will give you relief soon. Like Ellen said take it easy and let those boys take care of you. \nHugs-\nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "20/12/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=382844",
      "Title": "Update - Why I've been MIA"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=366543&p=14156",
      "Content": " I was supposed to start tamoxifen this past Sat., but still can not bring myself to it. My onc. has already let me wait three extra weeks, because I'm also on herceptin.I really don't know why I really don't want to take it. Can those of you who have taken it let me know how it was? Are the hot flashes, weight gain, etc. really bad? I know I need to start as Aunt Flo has never skipped a beat , but once between AC-taxol. In fact I believe she's even more evil now. \n \n ",
      "MessageIndex": 0,
      "PostDate": "21/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=366543",
      "Title": "Starting tamoxifen"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=359580&p=14156",
      "Content": " Okay, I was feeling kind of mean calling him Diablo(aka devil) , but he really is one. I loved the name Chaos(now why didn't I think of that?). In the end we'll just keep his name . My two yr. old says it so cute-blah blos. I really did forget what it meant to have a kitten. I was expecting full grown cat behavior. I have a parrot and last night he climbed into the pan beneath Pickles cage and was reaching through. He's jumped from the second floor, got on the kitchen counters, tables, etc. He also, takes clothes, and toys and drags them off. I think someone put a firecracker in his butt and lit it up. He's non-stop action, but hes so funny.\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "11/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=359580",
      "Title": "(off subject)Pet therapy"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=366543&p=14156",
      "Content": " Thanks ladies- I did start the tamoxifen yesterday. I knew I needed to take it, but just kept stalling. Deb, your right its the whole starting a new tx thing. When your first dxed your waiting for the end of treatment, but now I realize there really is no end. I have done every treatment, and even went a step further with my chemo. That's why I could'nt understand why I was having such a problem with not wanting to take the tamoxifen. The weight gain really does worry me. I started this whole mess at 118, and now weigh a healthy 147. I know that pales in comparison in the big scheme of things, but geez- I just want to be normal again. I truly am greatful to have this drug, just having issue'd-LOL. Hope everyone has a great Thanksgiving, and enjoy's shopping Friday.\nMichelle\n ",
      "MessageIndex": 8,
      "PostDate": "22/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=366543",
      "Title": "Starting tamoxifen"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=366022&p=14156",
      "Content": " Vicky,\n Sorry to hear your going through this again. Lets hope this pain is partly due to stress. Praying for good mri results, and that this chemo will do the trick.\nHugs, \nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "21/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=366022",
      "Title": "Need Good Vibes - Chemo Change"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=359580&p=14156",
      "Content": " \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "09/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=359580",
      "Title": "(off subject)Pet therapy"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=357261&p=14156",
      "Content": " Ladies,\n I just finished taxol in July. I did have a slight problem, but not much. Always use gloves when cleaning, and keep your lotion on your hands and feet. You can lose nails up to 3 months after taxol( not trying to upset anyone). I thought I was going to lose the one on my big toe, but it's doing fine now. My nails are short, and don't seem to be growing very fast but for the most part they look good now. I did get some neuropathy in my hands and feet, but it's also resolved itself now. Best wishes to all of you.\nMichelle\n ",
      "MessageIndex": 3,
      "PostDate": "11/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=357261",
      "Title": "fingernail changes with Taxol"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=344425&p=14156",
      "Content": " Tammy,\n I'am almost 3 months out, and still have chemo brain too. Its very frustrating, and anyone who knows me will tell you I could hold it all together before. During chemo it got so bad I would go grocery shopping and put the ice-cream in the cabinet. My poor husband was dumbfounded that I could do such a thing. I was hopeing it would get better little by little. Sometimes I feel like a scatter brain.\nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "16/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=344425",
      "Title": "chemo brain"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=363543&p=14156",
      "Content": " Brnadebt,\n My thoughts are a little late, but hope your hubbys feeling a little better. Remember not to do too much, believe me it will be there waiting again tommorrow.\nBest wishes\nMichelle\n ",
      "MessageIndex": 6,
      "PostDate": "21/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=363543",
      "Title": "Prayers Please"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=357058&p=14156",
      "Content": " Grace,\n Welcome to the boards. Although I hope you get a B-9 result.\nBest wishes\nMichelle\n ",
      "MessageIndex": 14,
      "PostDate": "09/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=357058",
      "Title": "I am new here and have been reading your posts...."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=316871&p=14156",
      "Content": " Bernadette,\n I also waited to shave my head, but you will get to a point where it actually kind of hurts. After you shave it that will go away in about\n 24 hrs. I found it much easier to face once it was actually gone. You will proably never love your wig, but will come to tolerate it. I'am one month post chemo, and the hair is slowly coming in. I can actually joke about\n it now. Last week after herceptin I was riding in my best friends convertilble, and we were joking about\n my wig flying onto someone's windshield. Can you imagine? \nBest wishes,\nMichelle\n ",
      "MessageIndex": 15,
      "PostDate": "04/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=316871",
      "Title": "Hair loss"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=359871&p=14156",
      "Content": " Jackie,\n Sorry to hear your going through this again. Would you like some new dew rags? I always sew double when I do them, and have some xtra's . Email me if your interested.\n((Hugs))Michelle\n ",
      "MessageIndex": 2,
      "PostDate": "11/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=359871",
      "Title": "Impending 5th Hair Loss - God does not intend for me to have hair!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=382268&p=14156",
      "Content": " Cathi-\n I'am so sorry to hear about\n your cat. My Gizmo went to kitty heaven in July as I was going through chemo. Poor thing had breast cancer too. I swore I would never get another, but ending up adopting a little boy last month. He will never take her place, but I'am beginning to love him just as much. He must have had a good life, I can see you cared about\n him very much. \nHugs-\nMichelle\n ",
      "MessageIndex": 11,
      "PostDate": "19/12/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=382268",
      "Title": "I am so sad..I had to put my cat Cody to sleep this morning....."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=359168&p=14156",
      "Content": " Susie,\n Sometime's I wonder if these doctors know how stressful the wait can be. Go ahead and vent many of us have been in the same situation. Maybe if you keep calling they will eventually squeeze you in.\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "09/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=359168",
      "Title": "Still Waiting.. argh..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=342642&p=14156",
      "Content": " Tammy,\n I got the blonde fuzzies too. I've heard that they will disappear in time. Lets hope so. \nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "13/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=342642",
      "Title": "facial hair"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=341257&p=14156",
      "Content": " Carol,\n The other ladies have given you great advice. Im sorry you had to come here, but it does get better. I was terrified when I started chemo in April, but found it to be so much easier than I anticipated. I finished 2 months ago, and have 2 more radiation treatments to go. The road will seem long , but you will get through it in no time. I would reccomend keeping colace, senokot, immodium, and tums on hand -just in case. I did very well during chemo, and only had one bad tx where I ended up constipated(I know tmi). This one may have been my imagination- but drinking lots of water really helped me .\nHang in there-\nBest wishes \nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "11/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=341257",
      "Title": "Newbie to BC, and this board"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=350416&p=14156",
      "Content": " Lori-\n Hope all went well with your showing- and positive thoughts on a great weekend get a way.\nMichelle\n ",
      "MessageIndex": 5,
      "PostDate": "26/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=350416",
      "Title": "Clutter: Need positive vibes, everyone!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=355859&p=14156",
      "Content": " Gail ,\n Praying all is well with Jacob. Asthma can be such a scary thing. Let us know how he's doing.\nMichelle\n ",
      "MessageIndex": 11,
      "PostDate": "11/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=355859",
      "Title": "Prayers please!!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=341650&p=14156",
      "Content": "    Literally, my breast is on fire. So , why am I smiling??? Two more boosts, and Im done with rads.Woo-hoo! \n  Hope everyone is well,\n \n ",
      "MessageIndex": 0,
      "PostDate": "11/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=341650",
      "Title": "Im burning up!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=349529&p=14156",
      "Content": " Kathy,\n Wonderful! Can't wait for my first yr. anniversary. Hope you had big plans , and enjoyed the day.\nBest wishes\nMichelle\n ",
      "MessageIndex": 7,
      "PostDate": "26/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=349529",
      "Title": "One year anniversary......."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=357209&p=14156",
      "Content": " Jaylow,\n Sorry to hear of your dx. , but wanted to welcome you to the group. My son was a yr. old when I was diagnosed in March of this yr. so I can not really help with the side effects of cytoxan while pg. I do see several pg. women recieving chemo when I go for infusion. There are also studies saying pg. women do better during chemo as far as naseau. I just ran across a study the other day about\n pg. and chemo, and wish I could remember where. Anyways, the results seemed favorable for the baby. There is a thread at the top of the page where you can introduce yourself, and read about\n the rest of us if you like. Is this your first child? \nBest wishes \nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "05/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=357209",
      "Title": "pregnancy problems"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=343492&p=14156",
      "Content": "      I know this is off topic, but I have a decision to make and wonder what the rest of you think. I have recently decided to apply to be licensed for in home daycare. I just finished rads yesterday. Everytime I tell anyone of this decision they want to know if Im \"well enough\"? Well, apparently I thought so, but my husbands family seems to think Im nuts. With the medical bills coming in, and the economy being what it is I have to return to some kind of work. I thought this would be the best decision since I already have a two yr. old of my own.\n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "14/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=343492",
      "Title": "off topic: career choices"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=355638&p=14156",
      "Content": " Kathy,\n Let's pray that they are just being extra precautious because of the family history. I worry about\n my sisters now , and I know my baby sister is terrified. Judy ((hugs)) hope all is well now. Prayers for your sis.\nMichelle\n ",
      "MessageIndex": 17,
      "PostDate": "11/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=355638",
      "Title": "prayers please........"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=315416&p=14156",
      "Content": " Just want to wish both of you well.I'll be asking questions soon-so take notes-LOL. \nBest wishes,\nMichelle\n ",
      "MessageIndex": 13,
      "PostDate": "02/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=315416",
      "Title": "I start tamoxifan tomorrow"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360384&p=14156",
      "Content": " Luci,\n Sorry you have to have another procedure, but glad to hear you found a good surgeon. Im finding it so true that BC is the gift that keeps on giving.I have decided its not for the sissy's-LOL. Praying all goes well for you.\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "11/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=360384",
      "Title": "The dr. visits are all over...."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=302391&p=14156",
      "Content": " I go next Monday for U. S. guided biopsy. The surgeon says it s the best idea because after radiation, my surgery choices would be limited. Im praying and reassuring myself this will be scar tissue. Im trying not to let panic take over, and so far I'am doing well. Spent the day with the kids at the beach, and had a great time.Hope everyone is enjoying the weather.\nMichelle\n ",
      "MessageIndex": 14,
      "PostDate": "17/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=302391",
      "Title": "lump in scar tissue?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=310879&p=14156",
      "Content": " Bev-\n Congradulations! When do you move in?Hope your hubby feels better soon.\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "25/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=310879",
      "Title": "signed papers on our nest today..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=331512&p=14156",
      "Content": " Skeeter,\n First of all I want to commend you on having the courage to go without your wig. My hair is just under an inch, and Im preparing myself for the same. I have not been out in public even once without it, unless I was at infusion. I guess I see my wig as a security blanket. I have no doubt the better you look , generally the better your treated. I also know the hair will grow, and my scars will fade. Still, it is hard to feel different. Over the weekend I seen a woman in Walmart looking at breast cancer shirts(That is the only reason she caught my eye) with hair just as short as mine. She looked great, and it made me feel good to see her out without any head covering.Now, maybe she seen me looking, and I hope she did not think I was being rude. I hope your next trip out will be a positive one. At any rate-hold your head high-and demand the respect you deserve. \nDeb-Lol! I love the way you handled that situation.\nHugs\nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "26/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=331512",
      "Title": "short hair"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=316505&p=14156",
      "Content": " Katy,\n Congradulations on taking the first step. You will have a great advantage over others in the field.\nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "04/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=316505",
      "Title": "Started back to school"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=313776&p=14156",
      "Content": " Mk-\n Glad to hear your report went so well! Now make DH take you out for some fun.\nBest wishes \nMichelle\n ",
      "MessageIndex": 6,
      "PostDate": "31/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=313776",
      "Title": "Pork Chop Bone!!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311945&p=14156",
      "Content": " Thanks ladies-\n I guess I should explain the hour and a half is round trip, but I Hate going to the doctors now.It sounds like everyone did well during rads, so I hope to also.\nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "27/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311945",
      "Title": "B-9 results"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311945&p=14156",
      "Content": "      Big sigh of relief- the new lump was benign. The path report reads fatty necrosis macrophages(white blood cells) and granular mitosis inflamation.So, now I can finally start rads.Yay! Im getting to closer to having a break from all of these hospital\n \n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "26/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311945",
      "Title": "B-9 results"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=304457&p=14156",
      "Content": " Mia-\n Hopeing to hear all is well.\nMichelle\n ",
      "MessageIndex": 3,
      "PostDate": "16/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=304457",
      "Title": "Help, could I have mastitis?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=304457&p=14156",
      "Content": " Mia-\n I think if you call your surgeon , and tell him your symptoms he will get you in right away.Lets hope its just something minor.\nMichelle\n ",
      "MessageIndex": 8,
      "PostDate": "15/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=304457",
      "Title": "Help, could I have mastitis?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=316511&p=14156",
      "Content": " happy B-day Jo-Ann. Looks like I missed cake so I'll go eat a brownie. Hope today was extra special.\nBest Wishes\nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "04/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=316511",
      "Title": "Happy Birthday to Jo-Ann!!!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=292722&p=14156",
      "Content": " Bev,\n How exciting! Its funny how things just fall into place when they are meant too. The two of you will surely keep in shape on those five acres during your golden yrs. Best of luck to you.\nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "29/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=292722",
      "Title": "I think we've bought our retirement nest..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=305878&p=14156",
      "Content": " Angela,\nI will be praying for Francis today.\nMichelle\n ",
      "MessageIndex": 6,
      "PostDate": "17/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=305878",
      "Title": "Hi Girls, Needing your special prayers..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=302391&p=14156",
      "Content": " Thanks ladies-tried to post yesterday, but could'nt. I finally got a hold of my onc. nurse yesterday, and she told me she is confident this is scar tissue. I explained to her while that was what I wanted to hear I knew I would still have much anxiety over the next few weeks. They moved my appt up one week. She must have thought it over though, because a couple of hours later the surgeons office called to say they would squeeze me in Tues, if I would go for ultrasound Mon.So, I get to drive over an hour today for MRI-an hour on Mon. for ultrasoudnd, and two hrs back to radiologist-only to get up tues and drive another hour to see the surgeon. The good news is I will have squeezed all my appts in on those days, and will get a small break before radiation begins.\nI do have a team of dr.'s, but because of child care I decided to see a radiologist closer to my mom.My lumpectomy was done in March, and I just completed chemo Thursday, Aug. 4. This is why my nurse feels it is proably scar tissue.Peace of mind is what I'm looking for-keep your fingers crossed ladies. \nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "13/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=302391",
      "Title": "lump in scar tissue?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=290843&p=14156",
      "Content": " Juju- Im pretty new to this (diagnosed in March). I just wanted to let you know I also had two different path opinions.One hospital said her2+++, and after surgery the other said her2-.Both results were from the standard IHC test.Anyways, I insisted on the fish test which came back at a 3(positive).The only explanation I was given is that is was different parts of the tumor which tested differently.My er/pr status also differed.\nMy oncologist has explained to me that with herceptin the odds of reoccurance between her2+ and - have actually evened out. Now maybe he is trying to ease my mind, but I sure hope it to be true.At any rate if you have any question about\n your her2 status I would definately ask to be tested one more time.If you are her2+ I would not want to miss the oppurtunity to take herceptin.\nBest wishes\nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "24/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=290843",
      "Title": "HER2 NEU 3+ TEST RESULTS"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=306393&p=14156",
      "Content": " Brnadbt, The other ladies gave you some good advice.Do not skip meals, but eat light.I prefer to wear my wig in public. Like Lori said I want to feel as normal as possible. At home and in the yard I wear hats, scarves, etc.Bring your self something to keep you occupied, but you will proably find some friendly faces.I just finished less than two weeks ago-it will be over before you know it.Think of each treatment as be one step closer to finished.\nBest wishes\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "17/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=306393",
      "Title": "First chemo"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=293143&p=14156",
      "Content": " Hi Beth,My name is Michelle.I'm 35, and was diagnosed in March of this year also.So far we have had a similar treatment plan, and I'am almost finished too. I've had 4 AC-3taxol/herceptin-and one more to go.My taxol was given dose dense.I will stay on herceptin for a year, and also have rads to do.This group has been a great help to me. I hope you find it to be just as helpful(I know you will)\nMichelle\n ",
      "MessageIndex": 3,
      "PostDate": "28/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=293143",
      "Title": "Hello and welcome Beth K."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=283593&p=14156",
      "Content": " just bumping this back up.\n ",
      "MessageIndex": 1,
      "PostDate": "25/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=283593",
      "Title": "Snuffles mom"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=315122&p=14156",
      "Content": "      Ok, before I race to conclusions-I would like to know what you ladies think. I had an MRI done two weeks ago on my spine. I have waited patiently for the results. So , yesterday I finally called. Now I know I clearly stated  I wanted the results for that particular test. Anyways, the nurse practioner calls back with results from my breat biopsy.So, I call again-no return call. Finally I called again this evening, and she tells me the results are not clear.What???? She does'nt quite understand the terminology the radiologist has used, but it does not clearly say lesion or metasis. She is on her cell phone and does not know the exact words, but it diffuse something.She says she has sent an email to the onc. asking him to call radiologist, or read the films himself.Would'nt you think he had already seen the report? It's been two weeks.Also, rads will not be finished on time so I asked yesterday if I should reschedule my check-up with my onc. and the nurse said no-absolutely keep your appt.Would they wait tha long if something was there- 5 wks? I'm trying to hold myself together, but should I brace myself ladies? I do have a previous back injury, but thats what this MRI was compared to- the previous MRI. \n \n ",
      "MessageIndex": 0,
      "PostDate": "31/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=315122",
      "Title": "MRI report"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=307008&p=14156",
      "Content": " Congratulations! Can't wait to find out if its a boy or girl. Sarah must be so excited!\nBest wishes\nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "19/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=307008",
      "Title": "Going to be a grandma again!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=14156",
      "Content": " ICU RN\n Wanted to welcome you, but sorry you have to be here.I was diagnosed with IDC 6 months ago. Emotionally I was a train wreck, but somehow managed to move toward the light at the end of the tunnel. Allow yourself to grieve , but keep planning your treatment. It sounds like you have a wonderful support system. I'm glad you found this site, the women here are wonderful. \nMichelle\n ",
      "MessageIndex": 11,
      "PostDate": "25/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311393",
      "Title": "New Diagnosis of Infiltrating Lobular Breast Cancer Here"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=293584&p=14156",
      "Content": " Bernadette,\n I found the injection for the SNB extremely painful.Mine was done the day before surgery, and I was told it would feel like a bee sting. Let me tell you they must have meant killer bee's-LOL.The day of my surgery I finally broke down and really cried. So far that , and my first day of chemo have really been about\n it.We all function on different emotional levels, and maybe you are still in shock.I know that is how I coped at first, it was sort of self protecting.Lets pray for clean nodes-\nMichelle\n ",
      "MessageIndex": 7,
      "PostDate": "29/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=293584",
      "Title": "Hi Bernadette...how are you feeling?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=289436&p=14156",
      "Content": " Hi Berandette-\n I was diagnosed with invasive ductal in Mar of this year. My tumor was 1.9cm, and my surgeon suggested lumpectomy. Cosmetically I'am happy with the outcome. My surgeon explained there wasn't much diff in mast or lump-I think it was around 2%. I found out afterwards that Iam her2+, and that may have made me go for bilateral-but no looking back now. \n Losing my hair was not as bad as I thought it would be. In fact I'am more bothered now as I only have one chemo left.I have recently really begun to miss it. I had long hair, and found it easier to cut shorter a little at a time.Try to wig shop before you need it ,and find one you really like.\n Every step I seem to be copeing with this better. Keep your head up.\nBest wishes\nMichelle\n ",
      "MessageIndex": 5,
      "PostDate": "22/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=289436",
      "Title": "Welcome, Brnadebt!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=302391&p=14156",
      "Content": "     Today was my first appt. with the radiologist onc., finished chemo last Thursday.For two months I have questioned my onc. about\n  a lump at my lumpectomy site, and he has told me it is proably scar tissue.I admit I did feel somewhat nervous that it was not checked.Anyways, now the radiologist onc. seems to be concerned with this, and is sending me back to the surgeon.This is a definate lump.My question is how many of you had this, and did it turn out to be scar tissue? I now have to wait three more weeks to even get in with the surgeon-does'nt that seem a little ridiculous-or am I to impatient?Im glad thier checking this out now, but why did'nt they just do it from the get go.I guess Im really getting aggravated will all of this.\n \n ",
      "MessageIndex": 0,
      "PostDate": "11/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=302391",
      "Title": "lump in scar tissue?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=302391&p=14156",
      "Content": " Lori-\nIm doing radiation at Novi Providence. Its a little closer than U of M for me, and my mom can watch my two yr. old.Its still a 30 min drive from where I'am though. I also have to add on another 20 minutes for dropping my son off. The added bonus is I get to do radiation when I just bought a new gas guzzling truck, and gas out here is 2.69 a gallon. Hubby says its 20 cents less out near his work. I forgot to mention that it was not me in AA.I have not yet gotten the nerve up to go out in my scarves yet.I have fuzz now , so maybe soon.\nMichelle\n ",
      "MessageIndex": 5,
      "PostDate": "13/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=302391",
      "Title": "lump in scar tissue?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=300880&p=14156",
      "Content": " Lori-\n Hope you celebrated big today!! Here's to the first of many five year anniversary's.Poor Tavish, he may not always be the baby.LOL\nMichelle\n ",
      "MessageIndex": 11,
      "PostDate": "09/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=300880",
      "Title": "\"See ya next year,\" said the oncologist....."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=311393&p=14156",
      "Content": " Cathy,\n Everyone truly does respond to chemo differently. I was not able to drive myself during AC-but did very well on taxol/herceptin. I felt pretty fatigued the first couple of days after AC, and was constipated once. During taxol I had bone pain, but don't know if it was from the nulasta.All in all I believe I did well. I was able to take care of my two kids, and the small petting farm we've acquired over the years.Chemo will proably not be as bad as you think.\n I did not have a masectomy, but I do believe you will need some help after the surgery. I stayed with my mom, as I could not llift my two year old son. Friends truly do want to help you so don't be afraid to ask. Most women have a hard time with asking for help, but most women are happy to help to do it.\nBest wishes\nMichelle\n ",
      "MessageIndex": 13,
      "PostDate": "26/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=311393",
      "Title": "New Diagnosis of Infiltrating Lobular Breast Cancer Here"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=304138&p=14156",
      "Content": " Annette,\n It seems like my daughter was just six last year, but she is already 15. I can truly tell you from ages 3-8 are some of the sweetest memories.They are suddenly becoming thier own person.Enjoy.\nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "15/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=304138",
      "Title": "Jordan turned SIX this past Friday......"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=316127&p=14156",
      "Content": " Darla,\n What does this test do? Does it monitor whether or not herceptin is working?\nThanks,\nMichelle\n ",
      "MessageIndex": 3,
      "PostDate": "02/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=316127",
      "Title": "HER-2/neu"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=302855&p=14156",
      "Content": " Vicky,\nSorry to hear about\n this setback, but sounds like your onc. is really on top of things.Praying that the taxol will do its job even better than before.\nhugs,\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "13/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=302855",
      "Title": "Onc. Visit"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=290408&p=14156",
      "Content": " Lori\n I guess I should have replied to this thread earlier. I have already had the pleasure of emailing traci.We have found out we are actually fairly close neighbors.Funny, we all go to U of M-but none of us have the same onc.Thank you Lori for putting us in touch with each other-I can already tell Traci is a great person.Hope all of you Michigan girls are enjoying this heat and humidity.\nSweating under my wig-\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "25/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=290408",
      "Title": "Hi Michelle from Michigan..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=290408&p=14156",
      "Content": " Right now I'am seeing Dr. Blayney on Thursdays. My last taxol will be Aug 4, and Then I will start doing my herceptin on Tuesdays.I want to wish both of you well on your next visits. Lori that your check ups are further apart-and Traci well maybe you will get an even longer chemo break.I would love to meet with the two of you. Let me know what you decide.\nMichelle\n ",
      "MessageIndex": 7,
      "PostDate": "27/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=290408",
      "Title": "Hi Michelle from Michigan..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=291440&p=14156",
      "Content": " Ellen- if you come back to work looking so great they may not believe you had surgery. LOL Glad to hear your feeling better.\nbest wishes \nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "25/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=291440",
      "Title": "hopefully my last recovery!!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=293546&p=14156",
      "Content": " Beth,\nI have two wigs. They are both synthetic.I chose them because they are easy to care for, and I dont have to style them.Also, they are monofiliament so you can see your scalp on top.this also allows the scalp to breathe some.I have had people actually tell me how beautiful my hair is.Juju is right-definately try your style ,and color out first.You do not have to spend a fortune to find a decent wig.There are some decent ones for around 400.00.You can tell alot just by touching the wig too.\nBest wishes, \nMichelle\n ",
      "MessageIndex": 8,
      "PostDate": "28/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=293546",
      "Title": "wigs"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=290843&p=14156",
      "Content": " Juju-\n I can see why you don't care for your medical team. I second Lori's advice -I would definately be getting a second opinion.Statistics can be scary, but you are not a statistic.Noone can tell anyone of us how it will all go.It sounds to me that your chance's of cure are more than twice that of a reoccurance. I like to belive the glass is half full rather than half empty. If your onc. does not see it this way so early in the game you need a new one.I hope you are feeling better soon.\nHugs,\nMichelle\n ",
      "MessageIndex": 3,
      "PostDate": "26/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=290843",
      "Title": "HER2 NEU 3+ TEST RESULTS"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=293629&p=14156",
      "Content": " Ladies this may be a strange question.2 days ago I developed a strange lump on my elbow.It really hurts! I did'nt bump it any where I can remember. Should I be worried about\n this?Also, I have never had scans of any kind.I have had x-rays.Last week I had one of my spine. The last two vertebrae in my back are dead from an injury in my 20's.According to my onc the xray looks really good except for some arthritis in the lower back.\n \n \n ",
      "MessageIndex": 0,
      "PostDate": "28/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=293629",
      "Title": "Lumpy elbow and other ???"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=270647&p=14156",
      "Content": " Debbie-its funny you mention the teeth. Grandma has been known to slide hers out in the past, and I remember thinking how neat it was when I was small. She would love to recieve cards.Thank you ladies for being so nice. Feel free to email me at teddy.holmes@sbcgobal.net.\nBest wishes\nMichelle\n ",
      "MessageIndex": 9,
      "PostDate": "17/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=270647",
      "Title": "Grandmother's(clutter)"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=293629&p=14156",
      "Content": " Thank you ladies. I guess I should have mentioned this is the opposite elbow.Skeeter, that is good information to know as I already have bad cording on the lumpectomy side.I called the nurse she said she doubts the lump has anything to do with my breast cancer,but will do an MRI next week.For those of you a little farther out from treatment- will I ever get a little less phobic?\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "29/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=293629",
      "Title": "Lumpy elbow and other ???"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=283598&p=14156",
      "Content": "     Just wondering how many of us exercise? Did most of you start during chemo or wait till after.I have always been is such good shape, but am so tired now I can hardly function some days.Not to complain but I'am really feeling weak here.I'am pushing myself to walk with the baby in the morning, and ride the bike with him in the evening.Mind you I quit doing these things over a month ago, and just recently started again. I get depressed when I feel like I can't pedal anymore. Is it normal to feel this weak????\n ",
      "MessageIndex": 0,
      "PostDate": "11/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=283598",
      "Title": "Exercise"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=290843&p=14156",
      "Content": " Juju-I'am sorry you are going through all of this.Do you have a human resources rep. through your employer? Perhaps he/she can help you deal with the ins. co.If that does not work -try speaking with your dr. directly. Physicans like to be paid , and will more than likely help you find the person who will set this straight.I had the same thing happen to me before my surgery.I know how stressful this can be.\nI have to ask if you have someone who is supporting you through this process? Please do not take this the wrong way. It sounds like you could use an advocate(family, friend)to help you . This will take some of the pressure off of you. If I had to deal with your physicans I would be stressed and depressed too.You sound like you have carried enough of this alone.Don't be afraid to ask someone else for help, believe me we can all use it during these times.\nI'am concerned that you have cancelled your appts. Are you changing Dr's, or do you have other plans?Maybe, you can just relax for the rest of today, and start fresh tommorrow.\nHugs,\nMichelle\n ",
      "MessageIndex": 18,
      "PostDate": "27/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=290843",
      "Title": "HER2 NEU 3+ TEST RESULTS"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=277656&p=14156",
      "Content": "      Last thursday I had my first taxol/herceptin treatment.I was told it would be an hour and half infusion. Boy, was I dissappointed to find out it would actually be 6 1/2 hrs. Needless to say I was sent packing thursday only to return to spend another wonderful day at the hospital friday. I'am happy to say overall this has been easier than AC so far.The only problem is I seem to be having sharp pains down my right hip and extending into the top portion of my leg. When this happens I can't put pressure on that leg. The pain is not constant it comes and goes.I know joint pain is common on taxol, but to what extent? My other joints are sore, but not like that.I'am so worried that each new pain is something else. Does this sound normal , or should I have it checked out?\n \n \n ",
      "MessageIndex": 0,
      "PostDate": "29/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=277656",
      "Title": "? re:pain and taxol"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=277656&p=14156",
      "Content": " Debbi- Im getting dose dense taxol every 2 wks for 4 cycles. I'm not sure why my onc chose that route over the 12 wks.I was told at the infusion center that both infusions take longer the first two time's so they can monitor for reactions.I should have gotten a medal for sitting still that long!(LOL)Im very high strung and it was almost not doable for me.I complained and whined to make up for it.I honestly just could not help myself.I guess I worry because the only test I had besides the snb were a chest x-ray.I think I would feel more at ease if they had done more test, but then again I'm extremely apprehensive about\n that too.Can I ask how long you've been on Herceptin? I guess I'll try some of those bath salts-and jump in the jacuzzi.Wonder if I can have a glass of wine???\nthank you\nMichelle\n ",
      "MessageIndex": 1,
      "PostDate": "29/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=277656",
      "Title": "? re:pain and taxol"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=283593&p=14156",
      "Content": " Randi-I was just wondering how your chemo was going? I was dx her2++ just a few weeks before you, and haven't seen you post in a while.Hope no news is good news.\n \n \n ",
      "MessageIndex": 0,
      "PostDate": "11/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=283593",
      "Title": "Snuffles mom"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=283593&p=14156",
      "Content": " Bernadette,Nurse Mikki may be the person you met.I was just diagnosed in March of this year.How are you feeling from your surgery?Hope all is well.\nBest wishes \nMichelle\n ",
      "MessageIndex": 3,
      "PostDate": "28/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=283593",
      "Title": "Snuffles mom"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=283484&p=14156",
      "Content": " Frayda-sorry to hear your going through this.I will keep you in my thoughts.\nMichelle\n ",
      "MessageIndex": 2,
      "PostDate": "11/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=283484",
      "Title": "Update on lung biopsy..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=278382&p=14156",
      "Content": " Hi Katt-Im sorry you had to join us.I know the fear your feeling right now, as it has only been a little over three months since my diagnosis. I had no family history, and have never know anyone with breast cancer. The women on this board gave me the strength to move forward in those first few weeks. This a great place for information,and support.\nI have had 4 AC-and just started to do 4 rounds of taxol. This will have taken four months. I pretty much lost most of my hair(just left with some fuzz.)I bought a nice wig, and I promise noone can tell.Everyone responds to chemo differently. I found it exhausting, but tolerable.The fear of the unknowns has been worse than the actual treatments so far. I cried on the day of surgery, and then the first day of chemo.After they were done -I just felt so relieved that they were not as bad as I expected.\nTry to write your questions down on paper as they come to you. My mind just shut down after diagnosis, and I would have been lost without my tape recorder.I would come home and listen to those tapes when I was emoitionally ready too.\nThis a great place to ask questions. I have gotten great advice and ansewers from these women.\nHugs,\nMichelle\n ",
      "MessageIndex": 15,
      "PostDate": "01/07/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=278382",
      "Title": "Newbie here"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=270598&p=14156",
      "Content": " Thinking good results-good luck steph.\nMichelle\n ",
      "MessageIndex": 6,
      "PostDate": "16/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=270598",
      "Title": "PCE needed for Steph this morning, are we all aboard?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=276880&p=14156",
      "Content": " Mia-how wonderful you were able to participate in the relay this year. I have never personally done so, but am looking forward to it next year.I know what you mean about\n having feelings of doom and gloom. I have done reasonably well during tx so far, but seem to be waiting for the other shoe to drop.I also have moments of extreme positivity.Im sure all of this is normal for us.Good luck on friday, and enjoy your vacation.\nBest wishes\nMichelle\n ",
      "MessageIndex": 5,
      "PostDate": "28/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=276880",
      "Title": "My 1st Relay for Life as a survivor"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=277067&p=14156",
      "Content": " Grandma recieved some of your cards this week. It really made her day.She made her way to the mail box on the first day, and was surprised to see mail from New Jersey.She called my mom to tell her right away.She has since recieved several more cards ,and is happy to get them.Thank you ladies for being so wonderful.\n \n ",
      "MessageIndex": 0,
      "PostDate": "28/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=277067",
      "Title": "Thank you ladies"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=267537&p=14156",
      "Content": " Ellen-\nI just want to say I hope all is better soon.\nBest wishes\nmichlle\n ",
      "MessageIndex": 3,
      "PostDate": "12/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=267537",
      "Title": "leftover trauma"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=259041&p=14156",
      "Content": " \n \n \n \n ",
      "MessageIndex": 1,
      "PostDate": "27/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=259041",
      "Title": "Chemo Cocktail"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=270647&p=14156",
      "Content": " \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "16/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=270647",
      "Title": "Grandmother's(clutter)"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=268503&p=14156",
      "Content": " Lori-\nHow great you must feel!!! The end is in sight. Hope you celebrate BIG!\nMichelle\n ",
      "MessageIndex": 4,
      "PostDate": "12/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=268503",
      "Title": "8, 7, 6, 5, ......"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=253646&p=14156",
      "Content": " Mia-\nI know how much you were looking forward to this-Congratulations!!\nBest Wishes\nMichelle ",
      "MessageIndex": 8,
      "PostDate": "20/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=253646",
      "Title": "I'm a GRADUATE, got my diploma in the mail!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=268067&p=14156",
      "Content": " Mia-big sigh of relief on the pet scan. I've been trying to check in here and there and knew you were concerned.Im thinking positive thoughts that you will be able to enjoy the rest of your summer.Hope you, and the family have some wonderful adventures.\nBest wishes\nMichelle\np.s.(be careful being a kid on the trampoline-I learned last year we dont bend as easy after 30-LOL)\n ",
      "MessageIndex": 2,
      "PostDate": "12/06/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=268067",
      "Title": "Bone Scan Results"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=248071&p=14156",
      "Content": " Grammy-\nI'am just now on my second AC treatment, and have been told I will be receiving the herceptin after the chemo every three weeks.Can I ask what kind of chemo you had?My pathology reports differed, and I just got clear ansewers so Im wondering what else may change as far as my chemo tx.I'am also her2+++.\nBest wishes\nMichelle ",
      "MessageIndex": 14,
      "PostDate": "12/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=248071",
      "Title": "herceptin"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=261000&p=14156",
      "Content": " Frayda-\nCongratulations!!!!!Hope you have something nice planned today.May you have 50 more!\nMichelle ",
      "MessageIndex": 1,
      "PostDate": "31/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=261000",
      "Title": "5 YEARS! YEAH!!!!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=252382&p=14156",
      "Content": " Jo-Ann,I can imagine how proud you must feel.Congratulations to both of you on a job well done!!!May the years bring all of you much more celebration , and joy.\nMichelle ",
      "MessageIndex": 7,
      "PostDate": "16/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=252382",
      "Title": "Finally............"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=248702&p=14156",
      "Content": " Lori-\nI ended up at U of M.I started chemo on April 27th, and I go back this Thursday.I didn't do to well the first week, but I'm feeling fine now.I'm still waiting to get the correct path report, and should find out Thursday.I have to admit I was so scared the first day of chemo, I cried. I think I'm keeping myself in denial until the moment everything happens.I have to say it really does work great until that moment.\nThe hair is another issue , its hard to ignore when its every where.Mine is rubbing out in the shower now, and its long.I have to say it does not taste too great!LOL-I hope everyone is well\nMichelle ",
      "MessageIndex": 1,
      "PostDate": "10/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=248702",
      "Title": "Hair loss and razors"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=248702&p=14156",
      "Content": " Lori-\nLida is my nurse, and she is truly wonderful. I have to say I really really like her.Dr. Blayney is my onc.He has all the credentials, but Dr. Wicha is the one I would have chose had I been given a choice. He seems to have the best credentials on the paper they sent me.As for the stool softeners - I went from one extreme to the other. Had that not been a problem, I could have worked through the fatigue!!LOL\nAre you graduating from the Tomoxifen in Aug?Yearly visits-wont that be nice.Thanks for the advice-now I just need the courage to do the inevitable.\nMichelle ",
      "MessageIndex": 2,
      "PostDate": "10/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=248702",
      "Title": "Hair loss and razors"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=250343&p=14156",
      "Content": " Lori-\nThank you for asking~~~I got the final results of my path report yesterday at my second chemo appt. St Joes did have the correct results-grade III, invasive ductal,er-pr highly positive,her2+++.The nurse was telling me its now good to be her2 because of the herceptin, but I don't really know.Im definately glad to be a canidate for the Tomoxifen.My onc was out of town so I don't know how this will effect the rest of my AC tx.I didn't know herceptin is given through the vein.So, now they want me to get a port( which I'm afraid of).\nJust knowing the pathology reports have been rechecked has really made me a lot more comfortable.\nBest wishes\nMichelle ",
      "MessageIndex": 2,
      "PostDate": "13/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=250343",
      "Title": "Skky, did you get your path report?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=250896&p=14156",
      "Content": " Hi! I'm sorry you had to find this board, but this is a great place to come for support. I know how traumatic it is to find you have to wait to see the breast surgeon. I was diagnosed a little over two months ago.I had the same problem. Fortunately I was able to see a general surgeon that had done breast biopsy's.I got in with her in less than 4 day's.Once I had my diagnosis the breast surgeon got me in within a week.I don't know if this helps any, but I hope so.There are other women on this board that may be in your area that can be more help. There is a roll call at the top of the page where you can add your information, and read about everyone else. \nI've heard 80% of breast lumps are benign.I'll be praying that's the case for you.\nBest Wishes\nMichelle ",
      "MessageIndex": 7,
      "PostDate": "14/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=250896",
      "Title": "Having Trouble Finding a Breast Surgeon - HELP!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=248828&p=14156",
      "Content": " Hi Lois-\nThis is a great site!I'm new to the game ( diagnosed a couple of months ago).It's nice to hear your doing so well.There are a lot of great ladies here. Theres a roll call at the top of the page where you can read about everyone, and tell us about yourself.\nBest wishes\nMichelle ",
      "MessageIndex": 3,
      "PostDate": "10/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=248828",
      "Title": "Memories!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=250475&p=14156",
      "Content": " Thank you for the information.I have been told I can choose the arm or chest. The two of you have convinced me to choose the chest. I'm wondering if I will do rads with the herceptin.It seems like everytime I see the onc. , I'm hit with something else.I keep forgetting to ask If Im stage I or II, because of all the info they hit me with.The only ansewer they have given me is TI, No, Mo.Now, I know you proably think by the second chemo i should know, but I swear I just get brain freeze.The onc. has told me I'm high risk for reoccurance, but im not sure why.\nThank You\nMichelle ",
      "MessageIndex": 4,
      "PostDate": "13/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=250475",
      "Title": "DEBBIER question about ports"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=259041&p=14156",
      "Content": " Randi, \nI won't be haveing my muga until June 9-My last AC(I love to hear those words).Deb, do mind if I ask how they do the muga?\nMichelle ",
      "MessageIndex": 8,
      "PostDate": "27/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=259041",
      "Title": "Chemo Cocktail"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=257634&p=14156",
      "Content": " \n \n \n ",
      "MessageIndex": 13,
      "PostDate": "31/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=257634",
      "Title": "Help Smoking"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=238326&p=14156",
      "Content": " Gail,\nI don't know if this helps, but sometimes if your uterus is tipped they have a hard time with the scopes. I hope thats all it is. I went through secondary infertility myself. My children are now 14 , and 21 months.Laproscopy , and hysterscopy are really not that bad. They can gain alot of information from those test. I know this is an emotional time for your daughter, and will be praying for her.\nMichelle ",
      "MessageIndex": 1,
      "PostDate": "22/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=238326",
      "Title": "Prayers please..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=245251&p=14156",
      "Content": " Judy,\nI started dose dense a little over a week ago.I only have to give myself an injection 24 hrs. after the initial chemo. I don't know if that will change. I was pretty sick from day 2 to day 7. I know I could not have worked. Im hoping the next round will be better. It was not terrible, but it was not fun.Today is day 8, and I feel pretty good. I've heard everyone responds differently. A positive attitude really does take you far. Best wishes-Michelle ",
      "MessageIndex": 16,
      "PostDate": "05/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=245251",
      "Title": "dose dense chemo"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=251916&p=14156",
      "Content": " Randi-\nI just had my second chemo this past Thursday.I've found I tend to get tired between days 3 and 6.They give you naseau meds. that seems to work quite well for me.I did have some issues with constipation, and then the other extreme the first time.Happy to report not a problem this time.I'm doing dose dense(every 2 wks.) AC.I finally had to shave my head yesterday-it was really coming out.My scalp is a bit tender, and I believe that will go away when the stubble falls out.Not too much fun so far, but it really has been doable for me.\nI know everyone responds differently, and I\"ll be praying you do well.\nBest Wishes\nMichelle ",
      "MessageIndex": 5,
      "PostDate": "16/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=251916",
      "Title": "Your Experience with Chemo"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=250802&p=14156",
      "Content": " I think if your close to the bride, you'll want to send a gift to her home. To have a shower without a bride is just plain GREEDY!!!Addressing your own thank you's is a way to personalize, and show your greatfullness to each guest for thier time and thought.I think I would be more upset with the first situation though.\nMichelle ",
      "MessageIndex": 3,
      "PostDate": "14/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=250802",
      "Title": "Bridal shower...bride absent"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=250916&p=14156",
      "Content": " emmeria,\nCongradulations!!! Im right behind you.As of thursday I also have two left, but then I move onto herceptin every 3 wks. for a yr.(YUCK!!!!)Hopefully, I'll do rads at the same time.I'll keep my fingers crossed for a great mammo, and biopsy report for you.\nBest Wishes\nMichelle ",
      "MessageIndex": 5,
      "PostDate": "14/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=250916",
      "Title": "light at end of tunnel"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=237762&p=14156",
      "Content": " Cyndy,\nI eill be praying for Kelly and her family.\nHugs-Michelle ",
      "MessageIndex": 5,
      "PostDate": "22/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=237762",
      "Title": "need some info and some prayers"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=241504&p=14156",
      "Content": " \n \n ",
      "MessageIndex": 3,
      "PostDate": "28/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=241504",
      "Title": "Asking for some hand holding from the PCE"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=235624&p=14156",
      "Content": "  Hi Ladies,\n \n ",
      "MessageIndex": 0,
      "PostDate": "18/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=235624",
      "Title": "Two different path reports???"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=248596&p=14156",
      "Content": " Stacy-\nKeeping my fingers crossed for a benign report!\nBest Wishes\nMichelle ",
      "MessageIndex": 3,
      "PostDate": "10/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=248596",
      "Title": "need the PEC this thursday in nj!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=248702&p=14156",
      "Content": " Hi ladies-\n \n ",
      "MessageIndex": 0,
      "PostDate": "10/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=248702",
      "Title": "Hair loss and razors"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=247986&p=14156",
      "Content": " Mia,\nIm late also, but I wanted to say Congratulations!!!!I can't imagine how good you must feel to be done.I'll be haveing my second chemo this Thursday, and I'm already wanting this over.Hope all goes well June1st.\nMichelle ",
      "MessageIndex": 7,
      "PostDate": "10/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=247986",
      "Title": "Rads done, done, DONE! YIPPEE!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=238601&p=14156",
      "Content": " Gail,\nGlad to hear everything went well.Hopeing you add a new addition to your family soon.\nMichelle ",
      "MessageIndex": 4,
      "PostDate": "23/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=238601",
      "Title": "Daughter's test went well!! Thank you!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=250475&p=14156",
      "Content": " \n  \n \n ",
      "MessageIndex": 0,
      "PostDate": "13/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=250475",
      "Title": "DEBBIER question about ports"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=250766&p=14156",
      "Content": " Ellen-\nI'll be wearing the big pink hat with the feathered rim , bald is cold!!! I'll be praying for good results.\nBest Wishes \nMichelle ",
      "MessageIndex": 1,
      "PostDate": "13/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=250766",
      "Title": "PCE request"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=251194&p=14156",
      "Content": " Lauri-\nGreat news!!!I can't even imagine going for the next one. Here's to the all clear everytime.\nHugs\nMichelle ",
      "MessageIndex": 3,
      "PostDate": "14/05/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=251194",
      "Title": "Mammogram all clear"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=222842&p=14156",
      "Content": " Ellen-\nI hope your feeling better soon. Let's hope these new meds help, and you'll be home during the summer. It really is hard to stay out of the garden in the spring. I don't know about anyone else, but it's the first thing I think of when the weather breaks.\nIf you have to be home sooner- why not enlist a friend to help garden while you watch? That way you can help some, and not overdo it. I hope you can enjoy the rest of your week off.\nMichelle ",
      "MessageIndex": 5,
      "PostDate": "31/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=222842",
      "Title": "not healing great"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=222822&p=14156",
      "Content": " Thanks for the link. I have been on the fence trying to decide between lumpectomy vs. masectomy. My surgeon keeps saying go with the lump,but the final decision is mine. I can't help but feel the masectomy may be the better route.\nKitty- if you get the seed radiation do you still go for tx. everyday?\nMichelle ",
      "MessageIndex": 1,
      "PostDate": "31/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=222822",
      "Title": "Interesting info on Chemo, Rads & Mastectomy..."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=238435&p=14156",
      "Content": " \n \n ",
      "MessageIndex": 0,
      "PostDate": "22/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=238435",
      "Title": "Wigs"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=235624&p=14156",
      "Content": " Thanks for your replys ladies.It has taken me a some work, but I believe I finally got them to reread my original slides from the first hospital. They want me to accept the fact that they are a cancer hospital , and thier testing is superior to that of the first hospital. This has really made me uncomfortable about the tx. Im going to get.I get the feeling they believe I should just accept thier explanation, and move on. Anyways I hope this will now set my mind at ease.\nMichelle ",
      "MessageIndex": 2,
      "PostDate": "22/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=235624",
      "Title": "Two different path reports???"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=235901&p=14156",
      "Content": " \n \n \n ",
      "MessageIndex": 7,
      "PostDate": "19/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=235901",
      "Title": "PCE boarding to be with Snufflesmom (Randi)...."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=235058&p=14156",
      "Content": " Janis,\nI had the SNB done two weeks ago tommorrow. It took me about a week before it felt better. I was out and about that weekend though.I have to agree if you can take time off, treat yourself well and take it easy.Great news on the nodes.I will be starting chemo in one more week, I don't know if they wait longer for radiation.Hope you feel better soon.\nMichelle ",
      "MessageIndex": 2,
      "PostDate": "19/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=235058",
      "Title": "I'm back from surgery."
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=241647&p=14156",
      "Content": " Deb,\nHas your temp gone down now?Lets just pray its one of those things.Hope you hear from your onc. soon.\nhugs,\nMichelle ",
      "MessageIndex": 3,
      "PostDate": "28/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=241647",
      "Title": "Prayers please"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=238435&p=14156",
      "Content": " Thanks ladies,\nI decided to make an appt. with Susans specialty needs in Ferndale. The lady is also a nurse, and 12 yr. breast cancer survivor.She seemed exceptionally helpful on the phone, and I will be seeing her on Monday.Im also going to order an extra online(so I can have one long, and one short.)My husband is trying to pick out the sexy wigs.I keep haveing to remind him Im going through chemo, not evolving into a sex kitten.\nThanks,\nMichelle ",
      "MessageIndex": 5,
      "PostDate": "23/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=238435",
      "Title": "Wigs"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=241649&p=14156",
      "Content": " Watching Montel Williams this week The head of Pharmacuetical development gave this number for free meds(1-888-4PPA-NOW).  They also gave an email link- \n think they said there are 150 companies participating in the US.I hope this can be of use to someone, even if it's for some other medical  condition. You have to complete a form, and have your doc sign it to see if you qualify.If any of you can use this , let us know how it works.\n ",
      "MessageIndex": 0,
      "PostDate": "28/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=241649",
      "Title": "Free meds"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=222455&p=14156",
      "Content": " Lori-\nToday was great, I spent the better part of the day outside with my son. He's 21 months so bringing him back in was not so great.I've been trying to walk him in the wagon everyday for exercise. I've heard it really helps with the healing.\nI'm having my surgery at U of M. They use both dyes too. Im having the dye for the SNB put in the day before(mon.), and they wont be doing the scan until the next morning before my surgery.\nMy son weighs 31lbs. so I'll be staying with my mom for a few days. Do you think I'll be able to lift him in a week?\nI' ve been much more positive this week. I can't say I was doing too well at first. This community board has been a lifesaver for me.\nBy the way, did you have chemo? If so, did you opt for wigs or hats? ",
      "MessageIndex": 1,
      "PostDate": "30/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=222455",
      "Title": "questions re; upcoming surgery"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=238086&p=14156",
      "Content": " Mia,\nI dont have any advice-just want to say hope you feel better soon.\nHugs,\nMichelle ",
      "MessageIndex": 5,
      "PostDate": "22/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=238086",
      "Title": "How many of you had your rads extended?"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=225770&p=14156",
      "Content": " I was 11, and my daughter 13.\nMichelle ",
      "MessageIndex": 8,
      "PostDate": "04/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=225770",
      "Title": "age at onset of menses"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=220536&p=14156",
      "Content": " \n \n ",
      "MessageIndex": 15,
      "PostDate": "29/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=220536",
      "Title": "20 years for Cupycake!!!!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=213930&p=14156",
      "Content": "   First I want to say Thank you to everyone who replied to my previous post. Your kind words, and support have truly helped. Unforunately, the news was not good. I was diagnosed with Invasive ductile carcinoma- grade III.The mass appears to be between 1.5 and 2cm. Are there any other members who were diagnosed with grade III? I know this means aggressive. I would just like some insight as to what tx I might expect, and would love to hear from survivors.                 \n ",
      "MessageIndex": 0,
      "PostDate": "17/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=213930",
      "Title": "diagnosis update"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=217582&p=14156",
      "Content": " Lori-\nI will be having a lumpectomy and sent. node done at U of M.They also want me to do genetic testing, and I will have to wait for those results while I do chemo. The surgeon says if they find cancer in the nodes they will proably go ahead with a mast. I had an auxillary ultrasound and they didn't see any swollen nodes.The surgeon said that is good,but not 100% positive.I'am so hopeing!Didn't you say you had the lumpectomy?So, do you think I will be staged after these results?They gave me a Nurse by the name of Michele-maybe i'll wait one more day and email her.\nMichelle ",
      "MessageIndex": 8,
      "PostDate": "23/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=217582",
      "Title": "This message is for SKKY"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=229653&p=14156",
      "Content": " \n \n ",
      "MessageIndex": 0,
      "PostDate": "10/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=229653",
      "Title": "this message for wackygal"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=222455&p=14156",
      "Content": " Hi ladies-\n \n ",
      "MessageIndex": 0,
      "PostDate": "30/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=222455",
      "Title": "questions re; upcoming surgery"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=225806&p=14156",
      "Content": " hi ladies,\n \n ",
      "MessageIndex": 0,
      "PostDate": "04/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=225806",
      "Title": "her2+"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=213190&p=14156",
      "Content": " Hi everyone- a few things about me. I have been married 16 years. Have two beautiful children( a fourteen year old girl and a 20 month old boy). I live in the Howell/brighton area of Michigan. I have not noticed the roll call yet, but will fill in my information. Off the subject ,is there anyone receiving tx at U of M or Beaumont? ",
      "MessageIndex": 6,
      "PostDate": "16/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=213190",
      "Title": "waiting for biopsy results"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=225735&p=14156",
      "Content": " Jean,\nI just want to send well wishes your way. I'll be thinking of you on Wedsnesday.\nMichelle ",
      "MessageIndex": 7,
      "PostDate": "04/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=225735",
      "Title": "Starting Radiation Wednesday"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=214952&p=14156",
      "Content": " janismarie-\nI'am also newly diagnosed, and just want to say we can do this. I will be praying for you\nMichelle ",
      "MessageIndex": 21,
      "PostDate": "22/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=214952",
      "Title": "Just Diagnosed 03-17-05"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=215776&p=14156",
      "Content": " Mia,\nI have no expierience with any of this yet, but just wish to say good luck.\nMichelle ",
      "MessageIndex": 8,
      "PostDate": "20/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=215776",
      "Title": "First radiation treatment tomorrow morning"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=217582&p=14156",
      "Content": " Hi Lori- Just wondering if you did chest x-rays,bloodwork, etc. at U of M.If so, how long did it take for you to get results? I'm waiting for the surgeon to call back to set up the surgery. \nMichelle ",
      "MessageIndex": 7,
      "PostDate": "23/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=217582",
      "Title": "This message is for SKKY"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=213930&p=14156",
      "Content": " Lori I can see that you are a great source of support and inspiration to the other women on this board. I have noticed your recent post, and I'am extremely greatful for them. I hope to be in your position soon! How did you feel about U of M? Im having a hard time deciding on where to have my tx. Providence in Novi would accept more of my ins. and be closer, as I will now be staying in Oakland county with my parents.I have heard such great things about U of M ,and am looking for the best care.\n I have already secured an appt. for U of M on monday. Please feel free to reply to this post, or you can email me if you would like. If any members can suggest any breast centers I should consider please let me know.\n Michelle ",
      "MessageIndex": 1,
      "PostDate": "17/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=213930",
      "Title": "diagnosis update"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=222455&p=14156",
      "Content": " Thanks for being honest ladies. I really did try to be strong, but that last poke made me moan out. I hope nobody heard me. I was lucky enough to have my husband with me, and I think that helps. Well, it's onto surgery tommorrow.Emmeria, aren't you also newly diagnosed? I hope all is well with you. \nMichelle ",
      "MessageIndex": 4,
      "PostDate": "04/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=222455",
      "Title": "questions re; upcoming surgery"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=223013&p=14156",
      "Content": " \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "31/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=223013",
      "Title": "Lmmackey"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=213190&p=14156",
      "Content": "       \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "16/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=213190",
      "Title": "waiting for biopsy results"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=217663&p=14156",
      "Content": " Mia-Hope they call you this afternoon.If you have to wait until tommorrow I think Deb has an excellent suggestion.\nMichelle ",
      "MessageIndex": 6,
      "PostDate": "23/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=217663",
      "Title": "2 treatments done and the machine is broken?!"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=217855&p=14156",
      "Content": " \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "23/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=217855",
      "Title": "Micwest gal"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=217582&p=14156",
      "Content": " Hi Elizabeth I have the support of my mother and husband.I've been lurking on this board, as it seems to be a great source of support/information. I have a small son so during my surgery I will be staying with my mom in Oakland county.I'am hoping that I feel well enough during chemo to be home.I appreciate any information you have that might help. My best friend also set me up with a woman from her work that has been calling me. I have never met her personally, but I can tell she is a beautiful person.I'am amazed at how wonderful the survivors of this disease are. ",
      "MessageIndex": 6,
      "PostDate": "23/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=217582",
      "Title": "This message is for SKKY"
    },
    {
      "AuthorID": "Skky",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=110474&p=14156",
      "Content": " Michelle 34 Howell, MI\ndx 3-17-05, 2cm-grade III invasive ductal carcinoma.Surgery to be scheduled first week in April(lumpectomy).genetics testing-chemo-more poss. surgery, and rads. I have a wonderful husband of 16 yrs., and two beautiful children(14 and 20 mnths.). ",
      "MessageIndex": 70,
      "PostDate": "22/03/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=110474",
      "Title": "ROLL CALL name, age, state and any other info to share"
    }
  ]
}