{
  "AuthorID": "starrnr",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=751656&p=24542",
  "Posts": [
    {
      "AuthorID": "starrnr",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=751656&p=24542",
      "Content": " Thanks so much for your comments. What I did notice is that my breasts change dramatically when I'm ready to have my period (the new \"somethings\"). I wonder if those are just hormonal thingys and that's why they hurt. I mention this since I did my exam last night in the shower and started my period this morning and since I've been working out a lot lately, I didn't get my normal \"warning\" cramps. I scheduled the mammogram about\n 3 days before my annual pap test. That way the doc has time to look at the report and we can talk about\n anything at my pap. If I need to go in sooner, I can.\nBrnadebt -- I'm not sure how to explain the changes, I just know they look different on the outside. Granted, I'm sure gravity (and age) may have a hand in this, but it's not those exact things. Wish I could draw a picture!\nBy the way, with regards to my age and having periods -- according to my doctor, my hormone levels are well within the normal range (which really irritated the heck out of me) and as long as my estrogen is above 50, I'm going to be regular as clockwork (which I am). It's absolutely amazing to me that I'm still regular - at my age!\nI think I will call Monday to move up the date of the mammogram. I'm a bit more concerned now. \nThanks again ladies, I'll keep you posted.\nSherree\n\"My \"Trifecta\" - CD, AS & RA...\n ",
      "MessageIndex": 2,
      "PostDate": "10/03/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=751656",
      "Title": "A couple of questions"
    },
    {
      "AuthorID": "starrnr",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=751656&p=24542",
      "Content": " This is my first time in this forum, hope you don't mind. I normally post in the Crohns, UC & Arthritis forums.\nIn any case, I have a couple of questions and thought perhaps I'd ask here first before totally freaking out!\nFirst, I have always had pretty \"lumpy\" breasts, but could always tell what was supposed to be there. The past few months I've noticed that something isn't quite right. I've come across a few rather large \"somethings\" in both breasts. I noticed tonight in the shower (where I always do my exams) that the \"somethings\" are pretty noticeable. They're not squishy nor are they rock hard, but they sure hurt. I haven't panicked yet since I was under the impression that lumps that 'hurt' aren't things to worry about\n. \nSecond, (and this is going to sound really dumb), do your breasts change as you get older? I'm 51 and haven't even started peri-menopause, let alone menopause. I have regular periods and I've noticed that my breasts seem to change every month right before my period. Lately, I've noticed external as well as 'internal' changes. Is this normal or something I need to discuss immediatley with my doctor.\nI have a mammogram scheduled for May 1 (I am horribly overdue) -- do I need to change that to something sooner? I apologize if my questions are dumb but I'm kind of concerned and really appreciate your input. \nThanks so much for your time. You have a wonderful forum here.\n\"My \"Trifecta\" - CD, AS & RA...\n ",
      "MessageIndex": 0,
      "PostDate": "09/03/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=751656",
      "Title": "A couple of questions"
    }
  ]
}