{
  "AuthorID": "SusanRoseville",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1649831&p=164428",
  "Posts": [{
    "AuthorID": "SusanRoseville",
    "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1649831&p=164428",
    "Content": " I am new to this site so hope I am doing this right. I am very interested in this topic. As I too suffer from pain. I had my left breast removed Dec 26, 2008. And my right breast removed March 2009. I had my right shoulder operated on right before my initial diagnosis. And since there was no cancer in my right breast, I opted for a later surgery. I have the pain that is described on this site, and have had since my initial surgery. My surgeon tried everything and eventually sent me to a Pain Management Doctor. I will not tell someone to not try this, but it was not for me. They put me on a narcotic pain pill. Which meant monthly visits to get a hand written script\n for my pharmacy. And even with the strong pain pill, it only took the edge off the pain. I was never pain free. I am in the process now of going off of the pain pills. And I must say it is not any easy thing to do. I gradually decreased my dose and am happy to say in one week I will be off this med. Granted my pain has increased. But I guess my plastic surgeon was right when she said \"This is your new normal\". I always hated that saying, but she was right. I must add that I had reconstruction that I probably would not have knowing what I know now. My surgeon said 20% of his patients suffer the pain that I described. And the pain that I read about\n on this site. I also tried the physical therapy with no luck. At this point I am willing to try anything but a pain pill. I have a clearer head now and want to keep it that way. If anyone has any suggestions, please reply. I didn't see this as my life, but I can say I Am A Survivor!! ",
    "MessageIndex": 43,
    "PostDate": "16/02/2013",
    "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1649831",
    "Title": "Post mastectomy pain syndrome"
  }]
}