{
  "AuthorID": "thebury78",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2542214&p=124802",
  "Posts": [
    {
      "AuthorID": "thebury78",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2542214&p=124802",
      "Content": " Well, a year later, and I have returned. After my initial scare last year, I decided to get a second opinion from a very well versed comprehensive breast center. I was placed on an every 3 month mammogram time frame.\nFirst set went ok. Something was found on the first mammo and compression mammo, but could not be located via ultrasound. I was sent on my merry way.\nMy 3 month follow up. I was offered the new tomosynthesis mammo. It found something right away. As did the compression mammo and ultrasound. SAME area my large cyst resided nearly a year ago. I saw the ultrasound. I noticed staff behavior. It looked like invasive breast cancer. I had this appt on a friday. I was asked to come in the following monday for a core needle biopsy. For 8 agonizing days I waited for results.\nEarlier this week, I finally got the call. Thinking the worst, I was pleasantly confused when the nurse calling says \"Right now, you do NOT have cancer. What you have is a radial scar with atypia cells, borderline Atypical hyperplasia is also present. The doctor is suggesting a surgical excision\"\nNow, finding info on both radial scars and atypia has been challenging. So many varying opinions. My surgical consult is 10/30. Unsure when the actual excision will take place. \nSo, I guess I am wondering what are the odds I will have this surgery and nothing malignant is found? Also, will this affect the cosmetic appearance of my breast (yes, that is vain, but I want to prepare mentally if there will be an indentation)\nAny information is welcomed!\n ",
      "MessageIndex": 0,
      "PostDate": "19/10/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2542214",
      "Title": "I'm Back :-/"
    },
    {
      "AuthorID": "thebury78",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2137943&p=124802",
      "Content": " Thank you for the response :)\nI had a hysterectomy due to stage III endometriosis. It was on my ovaries, cul-de-sac and bowels. I also suffered from baseball sized ovarian \"chocolate\" cysts. There is no plan for duration, since I was 29 at the time...looks like I'll be on it a while.\nOk, on to my appointment today. It was a whirlwind, so I'm still not quite satisfied with what little I do know.\nI arrived for my appointment and was taken back to wait on the doctor. He came in and had me raise my arms up. He asked where the pain was located. Before I could answer, he was already touching the area. His initial reply was, \"Oh my God. Oh, no. This is bad.\" At that point, I'm freaking out inside. He immediately lays the examining table down and gets out the u/s machine. When he rolls over my breast, it was like swiss cheese. Black voids everywhere. He breathes a sigh of relief and says \"Ah, thank you, cysts!\" The cysts were stacked on top of each other and also extended out in a rainbow shape.\nBefore I could blink, he was covering my breast in alcohol and standing over me with a very large needle telling me to watch the u/s screen. Next thing I know, the cyst deflates (it was 2 inches in diameter) and he shows me 7cc or so of pus filled cloudy/yellow fluid. He said \"Ew, pus\". Then sticks me again (keep in mind, I was NOT numbed) and drained another cyst. This time, the fluid was cloudy and yellow, around 5cc's. Third stick...he had to dig a little. This time, the fluid was bloody and yellow, 4-5cc's. Fourth stick was deep and at an angle. This one really really hurt. I almost passed out. He pulled back to aspirate, but all I could hear was a gurgle. He kept trying. Over and over. New angles. Nothing. Then he said \"Complex cysts. But this is bad. I can't get anything.\" He hands the nurse the needle and says \"I tried, I can't get it. Schedule her for a mammogram.\" He looks at me and says \"No worries. Ok, don't worry. No cancer. I want you to watch the one I had to leave behind closely for changes. Any more pain or swelling, come straight to me, I will drain.\"\nSo, I have to see him for a followup in September, and that is also when I have my first mammogram. I have no idea if the fluid he drained will be tested? I assume it will be. It would be rather odd to take something out of a pt and not send it to patho.\nI had zero bloodwork, no medications prescribed. I am in a lot of pain tonight, but so very thankful things are okay for now. My mother has fibrocystic breast disease, so I guess I'm going to follow in her footsteps.\nI'm considering scheduling a mammogram earlier than September. I'm honestly not comfortable waiting 3 months with a cyst he could not aspirate. You know?\nOh, it simply amazed me that I lost almost a full cup size on my drive home. I'm so happy to have my breasts near the same size again. I still have swelling/hardness, but that will subside. I'll continue to update as needed.\nThis scare has really made me appreciate my body. In an instant things can change. ",
      "MessageIndex": 1,
      "PostDate": "17/06/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2137943",
      "Title": "Found a large lump"
    },
    {
      "AuthorID": "thebury78",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2137943&p=124802",
      "Content": " After sleeping on it, I have come to the conclusion that I am NOT comfortable with a. 3 month wait. Funny, my mom called me up to tell me the same today. In fact, she is soo adament that I go to a breast center, she is taking me and paying for my hotel room. The complex cyst is a concern for us both.\nIt was today I found out my maternal Grandmother's sister passed away from breast cancer a few years ago. She had cysts, one complex. It was left behind..she was told to wait several months for a mammogram. She passed away less than a year later from the spreading cancer.\nI know the likelihood of this being nothing. But, my gut feeling is telling me to get a second opinion. I'd rather be safe than sorry. So, I'm calling my GP Mondaay and having her refer me to a breast center 3 hours away. I hope my gut feeling is just an overreaction.\nThank you once again for taking time to reply. I'll update as I can. ",
      "MessageIndex": 2,
      "PostDate": "19/06/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2137943",
      "Title": "Found a large lump"
    },
    {
      "AuthorID": "thebury78",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2211218&p=124802",
      "Content": " I had a mammogram (the dr didn't like the results of it), compression mammogram (dr didn't like this one either) and ultrasound last week. The next day, I contacted the Dr's office and the nurse said it was fibrocystic breast disease and b9...I was told to keep my followup appointment with the oncologist this week.\nFast forward to today, I had a call from the breast center at the hospital. I was told I have to be there at 9am for a second ultrasound. I had NO prior notification to this. I am a bit concerned. What happened to my appointment for followup with the doctor? Why am I being sent to the breast center?\nIs it normal to be called back a week later after an initial diagnosis of fibrocystic breasts? Could something have been found?\nI'll admit this time, I'm very concerned. I will update after the appointment tomorrow, but any input would be wonderful. ",
      "MessageIndex": 0,
      "PostDate": "13/09/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2211218",
      "Title": "Callback for a second ultrasound?"
    },
    {
      "AuthorID": "thebury78",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2137943&p=124802",
      "Content": " I'm a 32 year old in nursing school, so I have a background in medical issues, which is keeping me relatively calm. Here's my story:\nI woke up Tuesday morning and rolled over. I had extreme pain in my left breast. Up until that day, nothing was going on. It almost felt like engorgement (I have breastfed all 3 of my kids), but it was only on one side. I thought that was a little strange, so I got out of bed. I ran my hand down my breast and felt a lump. I could feel it through my nightclothes. I laid back down and did a SBE. The lump was the size of a golfball and the tissue around it sore, but not discolored.\nI called my ob/gyn who immediately referred me to an oncologist surgeon (that's standard, apparently). So, I called the O.S. and he wants to see me tomorrow (June 17). Yesterday, the lump became larger and the skin on my breast is reddened. The lump isn't circular, it's elongated. It is also hard and rather fixated. It moves slightly, but not much. I noticed last night that my skin was smooth, almost shiny over the lump area.\nI'm trying my best to be rational and consider that it could be an infection or something of that nature, but there's part of me that wonders \"what if\". \nA little bit of a backstory. Two years ago, I was having my annual pap..when my ob/gyn felt a lump in the SAME area. He panicked and felt the other breast. Back and forth several times, he came to the conclusion that it was a normal finding and I was ok. I've always felt something in that spot, but it was always grape sized. Now it's taking up nearly half of my breast. I'm a full cup size larger on my left side, and have been for a year or so. I had resorted to wearing padding on the right to compensate, due to it being so noticeable. Even with padding, you could still tell the left side was much larger than the right. Sizewise, I'm barely a D on the right, and DD (probably more than that since I spill out) on the left. \nI am post hysterectomy (2007) and on HRT.\nSo, any advice is welcome. I know no one can diagnose me, but if my story sounds familiar, I'd love to hear from you. I will do my best to update after my appointment tomorrow evening. Until then, I worry.\n*EDIT*\nI also would like to know what kind of testing I am facing? What is normally the first step?\n ",
      "MessageIndex": 0,
      "PostDate": "16/06/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2137943",
      "Title": "Found a large lump"
    },
    {
      "AuthorID": "thebury78",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2137943&p=124802",
      "Content": " Today was the day for the mammogram.\nMy appointment was at 10am. I go to the breast center, and everyone is all cheery, smiling and joking around. I have my very first mammogram. Wasn't bad at all (at least, not like the horror stories I had heard). I made light conversation with the tech and she said \"I will be back in just a minute, gotta run these to the doctor.\" Twenty minutes later, I'm still sitting there waiting for her to return. This is around the time I start to worry. \"what's going on? did she forget about\n me? did I move and mess them up?\"\nShe returns. This time, she isn't smiling. There's a notable difference in her demeanor. \"The doctor wants me to do another set of pictures.\" I said \"Uh, ok..\" and this time, it's a compression mammogram on the left breast only. She again tells me she will be right back. This time, she is gone for around 10 minutes and returns even more solemn. \"We need to do another test. I will have you go into the waiting area for a minute and get the ultrasound room ready for you, ok?\"\nBy this point, I'm thinking \"great, something is going on, and I'm here by myself..FANTASTIC!\"\nI go into the room, lay down and the ultrasound scans my right breast. To my surprise, a small cyst was present, but only one. It was around .5cm x .5cm..perfectly round and void-looking.\nShe then makes her way to the left breast. Several large cysts were scanned. Each between 5 and 6cm, round and once again a barren nothingness of black..One in particular she scanned, I felt some pain. That was the culprit from a few months ago that could not be aspirated. It was oblong-ish and I thought I could see flecks of white here and there. It was mostly black, but on occasion, it appeared to have floaty bits in in near one edge. It sorta reminded me of a squash. Round on one end, narrow-ish at the other. She concentrated on this for a while. My arms actually went numb, I had them above my head for so long. \nAnyways, she told me to clean up and have a seat in the waiting area. She returned 10 minutes later and said \"You can go now\"\nThat was it. Everyone's demeanor has me concerned. To go from cheerful to solemn/worried...worries me. My oncologist should have gotten the results today, so I'm calling tomorrow afternoon to find out what is going on. I'm 97% sure it's nothing and I'm most likely facing another aspiration. However, there is 3% doubt/worry/OMG-I-AM-FREAKING-OUT happening in the back of my head.\n \n ",
      "MessageIndex": 10,
      "PostDate": "06/09/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2137943",
      "Title": "Found a large lump"
    },
    {
      "AuthorID": "thebury78",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2137943&p=124802",
      "Content": " Quick update:\nI called the doctor today. The interpretation of my testing is : \nB9!!!\nHowever, I did receive the diagnosis of fibrocystic breast disease. I have to go see the oncologist next week and go from there. ",
      "MessageIndex": 11,
      "PostDate": "07/09/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2137943",
      "Title": "Found a large lump"
    }
  ]
}