{
  "AuthorID": "tilda",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3141690&p=203015",
  "Posts": [
    {
      "AuthorID": "tilda",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3141690&p=203015",
      "Content": " Lanie, I received a reply to my email from Peter and he gave me the permission to post the survey. Thank you guys for this opportunity! ",
      "MessageIndex": 1,
      "PostDate": "29/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3141690",
      "Title": "[Approved] We are designing a software product that could be helpful for breast cancer patients."
    },
    {
      "AuthorID": "tilda",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3141690&p=203015",
      "Content": " I want to mention right away that I resolved the issue with the moderators and Peter gave me the permission to post the survey here. Thanks to everyone who will consider participating.\nWe are a group of graduate students at Santa Clara University. We have been assigned with a project to create a software product for increasing happiness quotient of people dealing with serious illnesses. Being an all-woman team, breast cancer is really close to our hearts and we have chosen it for our project.\n \nWe wish to conduct a short survey/personal interview with you to know your view on what features we can include in our product that can make you happy. The survey/interview will be anonymous, and your results/replies will be shared only with our professors and classmates at Santa Clara University as a part of our project report. We would be happy to share the report with you as well if you wish to view it.\n \nWe understand your time is valuable and will be grateful if you could share your views with us and give us a chance to come up with a product that may ease your fight with cancer.\nLooking forward to hearing from you.\nSurvey link: \nPlease share your thoughts with us in the comments as well.\n ",
      "MessageIndex": 0,
      "PostDate": "26/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3141690",
      "Title": "[Approved] We are designing a software product that could be helpful for breast cancer patients."
    },
    {
      "AuthorID": "tilda",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3141690&p=203015",
      "Content": " Susantoo, we resoled the issue with the moderators, you can go ahead and participate in our survey!!!\nThanks in advance :) ",
      "MessageIndex": 3,
      "PostDate": "29/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3141690",
      "Title": "[Approved] We are designing a software product that could be helpful for breast cancer patients."
    }
  ]
}