{
  "AuthorID": "TTT",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3152770&p=203979",
  "Posts": [
    {
      "AuthorID": "TTT",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3152770&p=203979",
      "Content": " I had a core biopsy 1 week ago. Turned out to be PASH. The breast is sore - sort of a light burn and tender. I don't think there is a hematoma as all I feel is the PASH lump (I think). For those who have had a core biopsy, did you have pain a week later? I am icing and talking Tylenol. Thanks for any help. There isn't a site like this that is active for PASH, so I am checking any breasts sites I can find. ",
      "MessageIndex": 2,
      "PostDate": "11/08/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3152770",
      "Title": "9 months after sterotactic biopsy"
    },
    {
      "AuthorID": "TTT",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3152770&p=203979",
      "Content": " Thanks. I was warned about\n hematoma, so I will give it a few more days before I call. The way the Dr talked, I figured this was like an injection - needles went in and out, all set to go. It didn't bother me much the first 2 days when I didn't do anything. The I started moving stuff around the house, lifting, etc. perhaps too soon. Bra shopping tomorrow! ",
      "MessageIndex": 4,
      "PostDate": "11/08/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3152770",
      "Title": "9 months after sterotactic biopsy"
    },
    {
      "AuthorID": "TTT",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3152770&p=203979",
      "Content": " Pseudoangiomatous stromal hyperplasia (PASH) - it can be an incidental finding in other rumors, or be its own tumor (that is my situation). It is a well defined rubbery nodule. \nBiopsy sight and other areas radiating from it hurt a week out. Not MAJOR pain, but uncomfortable. ",
      "MessageIndex": 3,
      "PostDate": "11/08/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3152770",
      "Title": "9 months after sterotactic biopsy"
    },
    {
      "AuthorID": "TTT",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3152770&p=203979",
      "Content": " I wish I had been given a bit more info. Like, wearing a sports bra will REALLY help - I didn't wear one at all over the weekend, because the surface of my skin is bugging me. I ended up at GP today because breast clinic is closed and I have a red, warm spot that burns a bit to touch under the needle poke area. She just said to call if it gets bigger and then I can have meds... ",
      "MessageIndex": 5,
      "PostDate": "12/08/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3152770",
      "Title": "9 months after sterotactic biopsy"
    }
  ]
}