{
  "AuthorID": "turnip45",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2349824&p=140866",
  "Posts": [
    {
      "AuthorID": "turnip45",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2349824&p=140866",
      "Content": " Hi: I just find out today I have a few \"dots\" that the radiologist would like to do a biopsy on. They are actually microcalifications he said. He told me there was an 80% chance mine are benign, but in reading these posts, I am wondering if that is a \"standard\" statement to \"sooth\" our anxiety? I was under the impression he meant MINE.\nI think these little dots were there a year ago, but they have grown - said about\n 1/16\". Of course I am anxious (truthfully scared to death) of a needle. He said he'd numb the area and then put in a needle and suck out the suspicious little guys.\nWhat is the pain level involved here - how long does it take - what are the risks - and what's the 80% thing?\nAny advice will be greatly appreciated.\n ",
      "MessageIndex": 0,
      "PostDate": "21/02/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2349824",
      "Title": "That 80% Benign Estimate"
    },
    {
      "AuthorID": "turnip45",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2349824&p=140866",
      "Content": " Thanks, Bev. My appointment is for next Tuesday the 28th at 1:00. It is to be a stereostatic biopsy which they say will take 1-1/2 hours. I'm a little less anxious now, and hope to be so on Tuesday. \nIt helped to hear you say the 80% is pretty accurate and I am holding to that for myself. Thanks again, and God bless. ",
      "MessageIndex": 1,
      "PostDate": "24/02/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2349824",
      "Title": "That 80% Benign Estimate"
    },
    {
      "AuthorID": "turnip45",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2349824&p=140866",
      "Content": " Thanks, Bev. I am definitely holding positive thoughts. I know who will be holding my hand. I will let you know as soon as I do.\nSue ",
      "MessageIndex": 2,
      "PostDate": "27/02/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2349824",
      "Title": "That 80% Benign Estimate"
    },
    {
      "AuthorID": "turnip45",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2349824&p=140866",
      "Content": " I am so sorry to have been so slow in letting you know, but the results of the biopsy were negative. It was nothing more than fibrous tissue and they didn't even recommend more frequent mammograms. I feel very thankful and so appreciated your encouragement.\nAs far as the actual procedure, I was very happy with the way it was all explained to me BEFOREHAND, had an amazing technician helping the doctor and they listened to my concerns before they started. It was not a big deal afterall!\nThanks again for your encouragement and kind words.\nGod's blessings to you all!\nSue ",
      "MessageIndex": 5,
      "PostDate": "22/03/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2349824",
      "Title": "That 80% Benign Estimate"
    }
  ]
}