{
  "AuthorID": "vickie1mom",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=365552&p=21540",
  "Posts": [
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=365552&p=21540",
      "Content": " Luci, I am so sorry to hear about\n your tram flap. I can totally relate. Mind deconstructed after just 3 years. First it started with like a stitch in my lower left side then it kept getting worse until I couldn't stand it anymore. So I made an appointment with my dr. and come to find out the mess that they put in after the surgery to hold everything in, broke loose from the clips and the stitches and was rolling in toward the middle. Well before they could get me in for surgery the upper right side gave way and that one put me in the hospital even sooner. I ended up having the entire mess removed, all the tissue and muscle under it had to be sewn together to hold and a whole new tummy tuck from it. Now I can no longer lift anything over 5 pounds and four months later I am still very sore, and swollen. But my tummy looks great again. After this surgury my doctor said absolutely no more surgery unless it is to save my life. This last surgery was another 10 hours and now I have heart and thyroid problems from all the surgeries and being under for long hours over the past 3 years for the BC. This last surgery put my thyroid off the charts. It is hyperactive and I am under going tests for Graves. Just another gift.\nHope you have a happy thanksgiving.\nHugs and prayers\nVickie ",
      "MessageIndex": 3,
      "PostDate": "19/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=365552",
      "Title": "Tramflap gone awry...."
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=341692&p=21540",
      "Content": " Hi Turbulent. My bc was found on my mamo. The dr. who read the mamo told me that he saw something that looked like calcifications and that it could possibly wait six months. He said he would send the results to my dr. I got home that afternoon and my dr called and rushed me to have a biophy of the area. I went to the surgeon and she told me not to worry that is most likely was calcification. The next day I went in for the biophy and the evening the results were positive for interductal breast cancer. My gut told me the day of the mamo I had breast cancer and I was not going to wait six months. I explained this to my dr. when he called and never questioned me after that. GO WITH YOUR GUT FEELING!!!! \nI'll keep you in my prayers and please let us know the results.\nBig hugs to you\nvickie ",
      "MessageIndex": 1,
      "PostDate": "11/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=341692",
      "Title": "abnormal mammogram"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=355654&p=21540",
      "Content": " Kathy, My surgeon was from UCI and also taught the procedure around the world. He just never told me about\n the problems I might have down the road. He just recently had to remove the mess holding my insides in and resew all of my tissue back together as the original surgery (Tram Flap) did not hold. Now I am limited to what I can do the rest of my life. No lifting over 5 pounds so I will never be able to pick up my grandkids or my pets. Make sure you go over everything with your surgeon before doing it.\nI do however love my new breasts. They did turn out great. I am just waiting to see another surgeon to see if any thing can be done to fix my abdomen.\nIf you have any questions about\n this, let me know.\nIn Christ\nVickie ",
      "MessageIndex": 1,
      "PostDate": "03/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=355654",
      "Title": "Tram flap procedure"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=333644&p=21540",
      "Content": " Thank you for all of your replys. I am hanging in there and I pray for all of us going through breast cancer of any form and the after live of it. I lost my Mom to this horrible disease before she turned 60 and never thought I would come down with it. I was only 46 and had everything going for me. My two older sisters couldnt believe it either as they are both fine. Anyways I have beaten the cancer and life will go on and get better. I will keep in touch with you all and hope I can help someone here on this forum as well\nThank you! ",
      "MessageIndex": 4,
      "PostDate": "29/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=333644",
      "Title": "Welcome Vicki1Mom"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=324576&p=21540",
      "Content": " postal2, I am new to this forum. I had a bilateral tram flap reconstruction surgery three years ago. I love my new breasts, the tummy tuck I got from it but hate the prombles that came with it. I am a small petite girl and never had much of a tummy. When they did the surgery they put a mesh in me to help prevent buldges and hernias. I was never told I should never lift anything over 5-7 pounds again. This year while putting a case of gatorade on my shopping cart I felt the mess pull and tear. This happened twice. The pain was horrible. I am now at home healing from a surgery I had three months ago to completely remove the mess, stiches the muscles and tissue back together and at the same time have my ovaries removed because of a high risk for cancer. My tummy will never be the same. I hate it now. I need help getting up, I can't even push a vacuum or lift my cat. \nPlease discuss all the pros and cons of this surgery with your dr. before doing it. I wish I could have had the inplants but I have a disease that the dr. wouldnt let me have them\nGood Luck and God Bless ",
      "MessageIndex": 3,
      "PostDate": "28/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=324576",
      "Title": "Breast reconstruction operation"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=337845&p=21540",
      "Content": " Does any one of you ever use the chat room here? If so what time of day is everyone on? ",
      "MessageIndex": 0,
      "PostDate": "05/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=337845",
      "Title": "Chat room"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=337103&p=21540",
      "Content": " Hi everyone. I just slept about\n 12 hours after yesterday. My doctor is saying the reason I am not healing is because the fluid from the swelling in the adbomen isn't being absorbed normally thru the lymph system because of all the abdomen surgery that was done. I go back in two weeks and if the swelling is still bad she will consider \nopening the abdomen up and putting a temporary drain back in. She is also running complete blood test on me to check my thyroid, hormones ect. Thank you for letting me vent, I just was very disappointed yesterday with the news. I am still in slow motion at home and th only time I get out is for my sons football games. I already missed a year of them playing three years ago and I wont miss another year. They are growing up to fast and will be on there way to college soon. They keep me going. Their great kids and so is there father. He has the patience of a saint. (Well at least most of the time.)\nThank you all again and I will keep you posted.\nHugs to all!!\\\nVickie ",
      "MessageIndex": 6,
      "PostDate": "05/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=337103",
      "Title": "screaming!!!!!!"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=333949&p=21540",
      "Content": " Chanty, I had was dx very early with my bc. My mammo found it and because my mother died so young from bc I elected to have a bilateral with the tram reconstruction because I could not have implants. I love new breasts but wish I did not have the complications I am having now. I am told that my complications is very rare and that this surgery is very commom. It is something only you can decide only after you have discussed all the various reconstruction plans with your dr. Educate yourself on all reconstruction surgeries before you discuss them with your dr. That way you know what questions to ask. \nTake care and hugs to you. If you have any questions regarding my surgery I would be happy to answer them.\nIn Christ\nVickie ",
      "MessageIndex": 4,
      "PostDate": "29/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=333949",
      "Title": "Types of reconstruction???"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=335611&p=21540",
      "Content": " I saw the commercial yesterday. It made me reflect on my life and what I am going thru now. I own a company, am a total football mom of two high school players, wife, grandmother, and alot more. It just shows bc can effect anyone.\nvickie ",
      "MessageIndex": 1,
      "PostDate": "03/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=335611",
      "Title": "Anyone see the commercial"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=337103&p=21540",
      "Content": " I HATE DRS.!!!! Just came back from my gyn. office for my 4 month check from the surgery I had to fix the tram flap and the surgery to remove my ovaries. I am still not healing. I am miserable and just need to vent besides venting to my husband. SORRY!\nVickie ",
      "MessageIndex": 0,
      "PostDate": "04/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=337103",
      "Title": "screaming!!!!!!"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=337845&p=21540",
      "Content": " Good morning everyone.\nIf we could set up a chat time around 9:00am pacific time which is noon on the east coast that would be great. Anyday except fridays.\nLets get together.\nvickie ",
      "MessageIndex": 2,
      "PostDate": "06/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=337845",
      "Title": "Chat room"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=342008&p=21540",
      "Content": " Good morning or afternoon depending where you are at. I went back to the drs. yesterday and my thyroid is completely out of wack. With my thyroid running slow it is partly causing the fluid build up in the abdomen, irregular heart beat and extreme hot flashes. She referred me over to a specialist who I will see next week. I am also going to see a dr. who specializes in natural cures. I really do not want to take alot more of different medicines in my body. I think it is already screaming for what I have done to it. Time to get it back to the way it used to be. HEALTHY!!!!\nAll of you take care and I send my prayers and hugs to all.\nVickie ",
      "MessageIndex": 2,
      "PostDate": "12/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=342008",
      "Title": "Hey Vicky, did you get the results?"
    },
    {
      "AuthorID": "vickie1mom",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=337794&p=21540",
      "Content": " Good luck with the move.\nI do am right handed and had bc on the left but had a double mastectomy. Weird. My mom was right handed and got it on the left but no double. What does this really say?????????\nvickie ",
      "MessageIndex": 1,
      "PostDate": "05/10/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=337794",
      "Title": "big move is finally happening tomorrow..."
    }
  ]
}