{
  "AuthorID": "Vita 1",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2596991&p=160813",
  "Posts": [
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2596991&p=160813",
      "Content": " Greetings, happy New year! how are you feeling since your results? my biopsy is one week from tomorrow! some days I get through well;others I feel pretty rough. how did you manage your anxiety while waiting? My physician does not think it will be anything but the radiologist who read my film scared the neck out of me. she said the microcalcificaton in my left breast is \"indeterminate\". My doctor says that I will be ok. I have a few friends to lean on but I am anxious and concerned that this might be bad news. appreciate hearing about\n how you managed! gratefully, Vita 1 ",
      "MessageIndex": 1,
      "PostDate": "31/12/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2596991",
      "Title": "need some advice"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2601214&p=160813",
      "Content": " Three weeks ago I was called back for a second mammogram.  The radiologist, who was lacking in any bedside manner, said that she could not tell whether the new, tiny microcalcification in my left breast was benign or not.  She issued me to get a stereotactic biopsy.  Her report says \"indeterminate\".  My doctor has been supportive and says that most of these things turn out to be benign.  My biopsy is scheduled for Jan. 8.  I have never had one before and my mother died of breast cancer at age 58 years ago.  I have had yearly mammograms since age 32.  The holidays have been very hard to deal with.  I have really no family support to rely on and have a few friends I feel that I can share confidences with.  I am anxious and sleep is hard to come by.  I am scared though I have tried to reassure myself that the outcome may be positive.  I pray, I research, I try to keep busy.  I have not yet told my 19 year old daughter about\n the upcoming biopsy because I don't want her concerned and upset.  Appreciate anyone's suggestions for dealing with the long week ahead until my biopsy and the long wait for results.  Thank you and God bless! ",
      "MessageIndex": 0,
      "PostDate": "01/01/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2601214",
      "Title": "Biopsy Anxiety--How to Deal with It?"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2601214&p=160813",
      "Content": " Dear Britania: I am sorry to hear about\n your situation. How did you learn that you needed these surgeries? I have been advised to see a breast surgeon to discuss removal (lumpectomy?) of schlerosing papilloma in my left breast. Although not cancer exactly, it appears that the standard treatment is removal. I am very frustrated by the process as I do not feel that I have a part in my treatment. I hope that you are feeling okay. My prayers are with you! Hugs, Vita1 ",
      "MessageIndex": 3,
      "PostDate": "26/01/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2601214",
      "Title": "Biopsy Anxiety--How to Deal with It?"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2572339&p=160813",
      "Content": " Dear Mfsonly1: I am sorry to learn of your diagnosis and I hope that you are dealing with things okay. Please let us know how you are doing. My prayers are with you! ",
      "MessageIndex": 3,
      "PostDate": "29/12/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2572339",
      "Title": "Biopsy next week...feeling quite anxious"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2601214&p=160813",
      "Content": " Dear Concerned Mother of 2: Ask your doc for some low dose Atavan or Xanax to help with anxiety. Also, keep busy with things--clean, cook, see a movie. Call friends, talk with your doctor. The vast majority of microcalcifications are benign. Keep us posted! ",
      "MessageIndex": 5,
      "PostDate": "31/01/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2601214",
      "Title": "Biopsy Anxiety--How to Deal with It?"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2593133&p=160813",
      "Content": " Dear Woogie: I am going to keep busy today so my thoughts do not wonder toward the morbid. Today, I thought of how much time I have wasted worrying about\n people, places and things that are not in my control. I thought about\n how much I like to plan things and perhaps not always enjoy the present moment. While faith has never come easily to me, I realize that it is faith in somethng greater than ourselves that gives life real meaning. Thank you for being so supportive to me, a stranger! Your kindness means a lot. ",
      "MessageIndex": 3,
      "PostDate": "29/12/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2593133",
      "Title": "Safe to wait a month to biopsy suspiscous spot?"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2593133&p=160813",
      "Content": " Dear Woogie:  Thank you for your encouraging note!  I have confided my worst fears to God and to my best friend.  I have spared my 19 year-old daughter because I did not want to ruin her Christmas too.  I am nervous about\n the upcoming biopsy--not only because of possible bad news--but because I get nervous about\n all medical appointments!  I have never had a biopsy (stereotactic or otherwise) and the strangeness of it is also making me anxious.  While I am taking each day before my exam on 1/8 as it comes, I am also preparing myself for both good and bad news.  My doctor is very supportive and I have found that keeping busy helps me from going places in my mind that I should not go! LOL!  I will hope to use this forum and all the brave women here as additional support!  Thank you again for sharing your story with me!  Merry Christmas and wishing you a happy, healthy new year! \n ",
      "MessageIndex": 5,
      "PostDate": "28/12/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2593133",
      "Title": "Safe to wait a month to biopsy suspiscous spot?"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2593133&p=160813",
      "Content": " Dear Mimi57: I, like you, also had the dreaded callback for a second mammogram on Dec. 14. I am 55 and in good health, but with a family history (Mother, died age 58) of breast cancer. The radiologist called the small microcalification (less than 2 cm) \"indeterminate\" and prescribed a stereotactic biopsy of the spot. Needless to say, it has been a very different holiday! I am scheduled for Jan. 8. I confess that I am concerned and scared and anxious. I read a lot about\n these things, which says that 80% come back as benign. I keep trying to tell myself that. Know that there are other women like you and please write if it helps to reassure you that all will be well. Look forward to more posts from women who have been down this road and can share some positive stories! Happy healthy New Year to all! ",
      "MessageIndex": 4,
      "PostDate": "27/12/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2593133",
      "Title": "Safe to wait a month to biopsy suspiscous spot?"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2601214&p=160813",
      "Content": " Dear Concerned Mother of 2: Ask your doc for some low dose Atavan or Xanax to help with anxiety. Also, keep busy with things--clean, cook, see a movie. Call friends, talk with your doctor. The vast majority of microcalcifications are benign. Keep us posted! ",
      "MessageIndex": 4,
      "PostDate": "28/01/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2601214",
      "Title": "Biopsy Anxiety--How to Deal with It?"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2601214&p=160813",
      "Content": " Happy New Year! I had my biopsy done on Tuesday! Although the procedure took a bit longer, it was done and it was uncomfortable but uneventful. My results came back benign! I will do some follow up 're a possible papilloma which may have been removed during my biopsy. Honestly, the waiting was the worst part! I hope that you enjoyed your holidays & want to tell you what a special person you are to have kept me-- a stranger-- in your thoughts! it is wonderful to know that there are people like you and the other women here who support & encourage one another! I wish you a happy, healthy New year! ",
      "MessageIndex": 9,
      "PostDate": "11/01/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2601214",
      "Title": "Biopsy Anxiety--How to Deal with It?"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2631225&p=160813",
      "Content": " Would appreciate information from anyone who underwent a lumpectomy following a needle biopsy. My pathology said no cancer in microcalcifications but found neoplasm with fragments of probable sclerosing papilloma. Met with a surgeon today. They want to remove the tissue to check for any cancer not found in the biopsy. The alternative is to wait & keep checking the spot. I certainly don't want to have misdiagnosed cancer but not sure if I should seek a second opinion or see,a,second surgeon for comparison. Also what is the recovery like? My primary says a day or two. Thank you for sharing your experience. ",
      "MessageIndex": 0,
      "PostDate": "30/01/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2631225",
      "Title": "Lumpectomy for neoplasm with probable sclerosing papilloma"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2628247&p=160813",
      "Content": " So, following a sterotactic biopsy on Jan. 8 for a new tiny microcalcification found on a routine screening,the pathology report was not cancer but fragments of \"probable sclerosing papilloma\" and some atypical cells.  The doctors recommend lumpectomy.  The doctors also said that the papilloma may have a 1 to 3 % chance of being cancer or DCIS and that is why they want to remove everything around the marker left by the biopsy.  I am 55 years old and in otherwise good health, no surgeries or symptoms.  I feel I am being rushed into this.  Is lumpectomy standard for papillomas?  First, they had me nearly losing my mind over worry about\n microcalfications, now this!  If surgery is standard, how do I find a great breast surgeon?  I am really feeling overwhelmed by all of this and appreciate feedback.  Thank you! ",
      "MessageIndex": 0,
      "PostDate": "28/01/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2628247",
      "Title": "Standard Treatment for Probable Sclerosing Papilloma"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2631086&p=160813",
      "Content": " I understand your feelings. The best thing to give your mother right now is your love & support. That will mean keeping your fears from her. Help her get through her tests & to find information to make any treatment decisions. Keep her mind off death by getting out & living! Treatments today are better than they were when my mother he breast cancer 25 years ago. Keep positive, be \nopen to possibilities, and keep strong. I will be praying for you & your mom. God bless! ",
      "MessageIndex": 3,
      "PostDate": "30/01/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2631086",
      "Title": "My Mother has Microcalcification 10yrs ago had same thing but with tumor NEED HELP"
    },
    {
      "AuthorID": "Vita 1",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2593133&p=160813",
      "Content": " Thank you! Today was a good day! Iwill be back here! God bless! ",
      "MessageIndex": 6,
      "PostDate": "28/12/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2593133",
      "Title": "Safe to wait a month to biopsy suspiscous spot?"
    }
  ]
}