{
  "AuthorID": "11marie11",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/11marie11",
  "Posts": [
    {
      "AuthorID": "11marie11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/11marie11",
      "Content": "Hello, Two weeks ago, I found a lump in my neck and then had ultrasound on thyroid which found a lump there. The lump in the neck went away. I had a really really bad viral infection that cause sinus infection and I guess the lump in neck. Anyway, it was right before my menstrual cycle so I know I should not have checked my breasts then, but I was so paranoid about all these lumps popping up, I did. I found a lump right before period and my breasts were really sore due to getting my period. I showed my endcrinologist, who was checking my thyroid issue. And she sent me for an ultrasound. The ultrasound happenned after my period and by then my breasts were no longer sore and I was not sure I could feel the lump or not. Sometimes, I think I can feel it if I push down really hard but then I am not sure. Maybe it is a gland? It is below my breast right where the milk ducts are supposed to be. Well, I had the ultrasound and they did not find anything there. They said it was all normal. But they did it really quick because I said I was not sure I could feel it anymore. I did not get a mammogram nor have I ever had one yet. I might have to have radiation if I have thyroid cancer and wanted to hold off on the mammogram for now. I am 36. Should I still worry if ultrasound says clear? Should I have someone else check it because I can not tell if it is a lump or not?",
      "MessageIndex": 0,
      "PostDate": "07/01/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/460260-thought-lump-now-not-sure-who-do-i-see.html",
      "Title": "Thought it was a lump, now not sure? Who do I see?"
    },
    {
      "AuthorID": "11marie11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/11marie11",
      "Content": "Hello, Last month right before I had my period, I had a tender lump. At that time I was diagnosed with Thryoid Cancer. I had my endo check my breast lump and she sent me for an ultrasound. That was five days later. By that time, my period was over and the ultrasound found nothing but normal tissue. Well, now here I am a couple of days before my period and the tender lump is back. I already have one cancer diagnosis and can not handle another. I went to my OB/GYN and she felt it and now is sending me to a breast surgeon. What do they do?????? I almost want to wait and see if after this period ends if it disapears again before putting myself through the stress of going to a breast surgeon. I have to have surgery for thyroid removal in three weeks and that is stressing me out enough. What do you think? Could it be breast cancer? It is round, firm, tender and somewhat movable, i think",
      "MessageIndex": 0,
      "PostDate": "03/02/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/468559-tender-lump-comes-goes-period.html",
      "Title": "Tender lump that comes and goes with Period"
    }
  ]
}