{
  "AuthorID": "1sunny1",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/1sunny1",
  "Posts": [
    {
      "AuthorID": "1sunny1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/1sunny1",
      "Content": "Sophie, keep God in your heart, he is your bright side. We are all still here praying for you. My friend that just got diagnosed with lukiemia, just got good news, the chemo is working and she may get to go home, she has a 2 year old little girl that misses her terribly. Stay positive, that plays a very important role. Like I said, we are all still here for you. Sunny",
      "MessageIndex": 5,
      "PostDate": "10/04/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/743646-death-stage-iii-cancer.html",
      "Title": "Death from stage III cancer"
    },
    {
      "AuthorID": "1sunny1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/1sunny1",
      "Content": "Hello Bellamay, You definitely have my prayers. I too chose silicone although I never had cancer, just wanted to make those saggy breast look normal again. No one ever told me they could rupture. In the shower one morning I felt a huge lump under both arms, scared me a lot. Had a sonogram done and found that the implants had ruptured. I had them replaced with saline, but when they took the silicone out, they also had to scrape precious tissue out of me to get it. They also said that the silicone had gone everywhere and probably did not get it all. Well, since then I have had nothing but strange symptons and painfull symptons everywhere. That was in 1996. They have now diagnosed me with Fibromyalgia. The FDA has finally said it is a real diagnosis. I cannot begin to tell you of all the painful things I go thru. And although every doctor I go to has said they believe it is all from the silicone leaking into my body that has caused this, they will not say that it is the cause in writing. There is not a doctor in the world that will say this. Anyway Bellamay, my thoughts and prayers are with you, we may have turned to implants for very different reasons, the the ending result is the same. I too hope every woman out there that is thinking of implants for any reason, will not choose silicone. I was never sick before they ruptured, now I have a life time sickness to deal with. Good luck Bellamay, please keep in touch and let us know how you are, stay positive. Sunny",
      "MessageIndex": 2,
      "PostDate": "10/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/551635-breast-cancer-1991-implant-issues.html",
      "Title": "Breast Cancer in 1991 & Implant Issues"
    }
  ]
}