{
  "AuthorID": "ABGIRL",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ABGIRL",
  "Posts": [
    {
      "AuthorID": "ABGIRL",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ABGIRL",
      "Content": "I had a biopsy on my breast Tuesday. The bark is much bigger than the bite. The only thing that is a little painful is the needle for the local anathesia, And that doesnt even hurt that bad. Just a little pinch. It will be over before you know it. It might bleed (maybe a little, but in my case a lot) so dont let that freak you out, My doctor told me that was normal. I have a very small threshold to pain, so if I was okay, you will be too",
      "MessageIndex": 5,
      "PostDate": "07/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "ABGIRL",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ABGIRL",
      "Content": "To make a very long story short...I have had some sort of sore on my breast for about 2 or 3 months now. At first I thought it was weird that I had a \"zit\" on my breast, so I just ignored it. After a few weeks it didnt go away, then I noticed that the sore started scabbing over and itched like CRAZY....I thought..okay this is definatley strange. I called one of my friends (since she is a nurse AND that's just what we girls do) and asked her what in the heck it could be...She told me I should see a doctor soon to be sure its not Pagets Disease. I thought to myself...okay whatever- It can't be that bad. I basically put it off for a while. I know I know....what was I thinking???? So I finally made a doctors appointment and I saw him yesterday afternoon. I have really been fine up until this point. The doctor was really great, but I was really thinking/hoping that he would tell me it was nothing and to go home and not worry about it. then make a quick stop to Target and invest in some zit creme or maybe even that Proactive zit crap that Jessica Simpson keeps raving about. Instead I was laying in a very cold room with crunchy tissue paper under me with JUST pants and NO shirt, freezing to death while he performed a biopsy. Oh yeah, I have to get a Mammogram and an Ultrasound in a few weeks as well. I know this is all a good thing and he is being thourough, but the part that scares me to death is that he is ordering all those tests and he didnt really tell me any good news but not any bad new either. It just seems like doctors are quick to tell you when nothing is wrong, but they clam up with something is. Does anyone out there relate to what I'm saying? or has Pagets Disease?? Bascially, Every symtom listed for Paget's..I have. Thanks Just trying to shed some light on this- I really don't mean to ramble....like I said just trying to vent I guess...",
      "MessageIndex": 0,
      "PostDate": "06/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452486-pagets-disease.html",
      "Title": "Paget's Disease"
    },
    {
      "AuthorID": "ABGIRL",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ABGIRL",
      "Content": "Yeah, It is very scary...I'm not sure what to think. For whatever reason my doctor said it was going to take 7 to 10 days for the results to come back. And on top of that my doctor wants to wait until I have my mammogram and ultrasound to talk about what the results are. So needless to say I'm really nervous. I read up a little on what the the internet had to say about Pagets. I dont care how invasive it is or isnt...It scares the crap out of me to think that I might have cancer!! You are absolutely right...I am very lucky to have a doctor who is not taking any chances...Maybe he has seen it before?? Who knows?? In either case I'm really happy to be getting some answers. I was amazed how much I bled when I got my biopsy, but my doctor said it was normal to bleed a bit. I guess time will tell. I hope all goes well with you Let me know what the biopsy results are. thanks I would like to keep in touch too",
      "MessageIndex": 2,
      "PostDate": "07/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452486-pagets-disease.html",
      "Title": "Paget's Disease"
    }
  ]
}