{
  "AuthorID": "aem22192",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aem22192",
  "Posts": [
    {
      "AuthorID": "aem22192",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aem22192",
      "Content": "I am not sure yet what the treatment will be but I just had a positive biopsy, looks like Paget's disease of the nipple. I have a surgeon chosen and I will meet with him in another week or so but what other professionals should I engauge and when??? I was considering an oncologist but Kalie brought up another possibility of a plastic surgeon! What questions should I be asking any of these doctors? I am 38 and if I do need the full mastectomy I am not sure if I should ask for reconstructive surgery. I am afraid of implants because I have known people who had to remove them because of auto-immune responses where the body rejected them. I am also afraid of not having reconstruction.",
      "MessageIndex": 8,
      "PostDate": "12/06/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/180585-mammogram-mandatory-get-biopsy.html",
      "Title": "Is a Mammogram Mandatory to get a Biopsy??"
    },
    {
      "AuthorID": "aem22192",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aem22192",
      "Content": "I am 38 years old and have never had a mammogram. I never felt any lumps but had a persistant skin irritation which I thought was an infection on one nipple which my OB-Gyn's nurse dismissed as no big deal, that was over a year ago. I finally felt like something was really wrong and went to another doctor this year. He tried one course of treatment and when it didn't respond at all he referred me to the dermatologist. When my dermatologist saw it he was very concerned and did a biopsy right there on the spot, which the results showed I may have a form of breast cancer, and I am now scheduled for further evaluation by a surgeon in less than 2 weeks. Apparently there is a less common type of breast cancer called Paget's disease and it isn't even always accompanied by lumps in the breast so a mammogram couldn't have helped with this diagnosis anyway. Go figure, I hadn't even heard of such a thing! The doctor may still order a mammogram just to rule out any additional carcinoma in the breast because Paget's of the nipple is often accomanied by other cancer in the breast tissue itself. I will gladly consent to any dignostic testing to obtain the best treatment possible.",
      "MessageIndex": 7,
      "PostDate": "12/06/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/180585-mammogram-mandatory-get-biopsy.html",
      "Title": "Is a Mammogram Mandatory to get a Biopsy??"
    },
    {
      "AuthorID": "aem22192",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aem22192",
      "Content": "Like the other person said, with your family history make sure you are seeing a gyn-oncologist and NOT a regular OB-gyn! And it never hurts to get a second opinion!",
      "MessageIndex": 3,
      "PostDate": "12/06/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/178118-need-help-extremely-worried-about-biopsy.html",
      "Title": "need help extremely worried about biopsy"
    },
    {
      "AuthorID": "aem22192",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aem22192",
      "Content": "I had a persistant crusty looking irritation on one nipple which my OB/GYN's office dismissed as nothing over a year ago. A few months ago I went to my primary care physician for another opinion and treatment because something just didn't seem right. He was cautiously optimistic but after it didn't respond to treatment he referred me to a dermatologist who was quite alarmed and performed a biopsy on the spot. Now the biopsy indicates that it is probably Paget's disease so he referred me to a surgeon for further evaluation and treatment. The doctor didn't find any detectable lumps but I have not had a mammogram yet. I will be seeing the surgeon in a couple of weeks but should I try to schedule an appointment with an oncologist or any other medical professionals as well? What are the treatment options and prognosis? I am 38 years old with 2 kids under the age of 5 yrs old. thanks for any insight!",
      "MessageIndex": 5,
      "PostDate": "12/06/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/180552-nipple-discharge-worried.html",
      "Title": "nipple discharge....Worried!"
    }
  ]
}