{
  "AuthorID": "akahoneypotqt",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/akahoneypotqt",
  "Posts": [
    {
      "AuthorID": "akahoneypotqt",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/akahoneypotqt",
      "Content": "I am posting here, as I have in the bowel board. I have had a pain in my lower L ab area for the last 6 months. It is about 3 inches to the left and then 3 inches down from my bellybutton. It is not intense, just irritating. My bowels are fine, no problems that I am aware of. No history of female problems. Periods are normal, and regular. No cramping, swelling, bloating. This pain is like a little hot poker. My pap was normal. My ultrasound for the pelvic area was normal. My old doc said \"I just don't know\". My new doc thinks IBS (irritable bowel syndrome) except I don't meet any criteria for anything that I can find to read on. It pokes me like someones finger, real quick and hot and then gone!. It happens when I move, when i sit still, when I drink something or for no good reason. I have had a c section in 7-90 and one in 1-94. A spinal fusion in 9-02. I don't think it's diverticulosis/diverticulitis. Possible endrometriosis? colon cancer? ovarian cancer? I need help people...... Thanks.........Mary",
      "MessageIndex": 0,
      "PostDate": "08/02/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/148453-pain-lower-left-abdomen.html",
      "Title": "Pain in Lower Left Abdomen"
    },
    {
      "AuthorID": "akahoneypotqt",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/akahoneypotqt",
      "Content": "GRAY DISCHARGE, PAINFUL BREASTS?? I ALSO WANTED TO POST IN THE WOMENS FORUM BECAUSE I FIGURED THERE HAS TO BE OTHER WOMEN WHO HAVE HAD THIS EXPERIENCE. I HAVE HAD DISCHARGE OUT OF MY LEFT BREASTS FOR OVER A YEAR NOW. MY DR. DOESN'T SEEM TO THINK THAT THIS IS AN ISSUE,AND I HAVE HAD A MAMMOGRAM AND AN ULTRASOUND. I PIERCED MY NIPPLES IN MARCH/APRIL OF 2004. IT'S BEEN ALMOST A YEAR AND YESTERDAY I TOOK THEM OUT. MY LEFT NIPPLS KEPT BOTHERING ME, AND I KEPT HAVING PAINS IN MY LEFT BREASTS. I REALIZE SOME PEOPLE HAVE ISSUES WITH PIERCING, BUT THAT IS'NT THE PROBLEM HERE. MY QUESTION IS THIS. \"IF\" ANYBODY HAS HAD A PIERCING THAT DIDIN'T TAKE, DID YOU HAVE PAINS IN THAT BREASTS BESIDES THE NIPPLE? THE OTHER QUESTION IS HAS ANYBODY HAS PAINFUL SPOTS ON THEIR BREASTS WITH GRAYISH COLORED DISCHARGE? I THINK I JUST IRRIATED THE BREASTS WITH THE RINGS I HAD IN, AND HOPEFULLY IN A FEW DAYS WITH MOTRIN 800 THAT THIS WILL GO AWAY. MY LEFT BREAST HAS ALWAYS BEEN MY \"PAINFUL\" BREAST, WITH HORMONES AND PERIODS, EVERY MONTH ITS THE ONE THAT FLAIRS UP AND HURTS MORE THAN THE OTHER ONE. I WANT TO MAKE SURE THAT I AM NOT UNSUAL, AND THAT THERE ARE OTHERS WHO HAVE EXPERIENCED SOMETHING SIMILAR TO THIS. I WILL, OF COURSE, CALL MY GYN TODAY AND MAKE AN APPOINTMENT, JUST TO MAKE SURE. BUT.. I DID HAVE A CBC DONE LAST WEEK WHEN I HAD A BAD UPPER RESPITORY INFECTION AND MY WHITE BLOOD COUNT WAS ELEVATED. I'M THINKING IT WAS MY PIERCINGS THAT WERE STILL RESISTING MY BODY EVEN AFTER ALMOST A YEAR. ANY IDEAS? POSTED THIS IN THE WOMENS HEALTH FORUM, ANY IDEAS ?",
      "MessageIndex": 0,
      "PostDate": "02/02/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/248950-gray-discharge-painful-breasts.html",
      "Title": "Gray Discharge, Painful Breasts???"
    }
  ]
}