{
  "AuthorID": "andia",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/andia",
  "Posts": [
    {
      "AuthorID": "andia",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/andia",
      "Content": "I am 46 and believe I am in perimenopause as I have been having changes to my cycles. I have had a 3Dmammogram and u/s 6 months ago and have many cysts and extremely dense breasts. I also have always had breast pain before period, but it seems the pain is worse, especially on the right side and doesn't go away completely after my period. I feel pain more on the upper outer area and towards the armpit and feel some pain under the arm as well, but more on the outside of the armpit on the chest close to the armpit and up higher towards my collar bone and shoulder. It feels like an aching tender pain not sharp. I don't feel any big lumps, although my breasts are lumpy anyways, so it's hard to tell. Could this be fibrocystic breast changes causing the pain? I am due for a follow up u/s in a few weeks to check my cysts so I will ask them to check the right side auxilary area, but wanted to ask if anyone has had this pain and it is just fibrocystic? Thank you, it's hard not to worry!",
      "MessageIndex": 0,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1037950-fibrocystic-breast-pain.html",
      "Title": "Is this fibrocystic breast pain?"
    },
    {
      "AuthorID": "andia",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/andia",
      "Content": "Thanks for responding. I really appreciate it. I feel like my hormones are out of whack due to perimenopause. I have cut back on caffeine, but may have to try cutting it out all together I do notice the pain isn't as bad after my period, but still there. I find it worse on the right side (the side where I have many cysts) lately. I also did not realize that it could go so high up the chest and feel aching below my collar bone and sometimes shoulder and arm on that side ache. I do wonder if it's my lymph nodes under the collar bone as it feels tender when I poke around there. Hopefully it's just fibrocystic changes, but I will get them to look around on my u/s. Thank you again",
      "MessageIndex": 2,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1037950-fibrocystic-breast-pain.html",
      "Title": "Is this fibrocystic breast pain?"
    }
  ]
}