{
  "AuthorID": "AngieBaby77",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/AngieBaby77",
  "Posts": [
    {
      "AuthorID": "AngieBaby77",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/AngieBaby77",
      "Content": "I have already posted about what the doctor called fibrocystic breast tissue and a painful underarm lump which I was told could be an infected lymph node. Well, today I felt a lump in my breast about a half inch from the nipple. It feels like buckshot. It is on the same side as my swollen lymph node. When you pull the skin taut you can see it. I wonder if the lump is cancer that spread to the lymph node? Or if the two things being on the same side is just a coincidence? It doesn't hurt, but the underarm node does. I also feel sore, achy and tired all over. I freaked out and went to the hospital when I found the lump. All the doctor did was confirmed the lump, said it felt \"shotty\" and told me to see my regular doctor or OB-GYN for a mammogram. I am only 29 and I have had quite a bit radiation exposure over the past few years. Chest CT, Brain CT, sinus xray, back xray, several chest xrays with the most recent being two days ago. I am scared about getting a mammogram because of the radiation but I don't want to let something cancerous linger. I don't know what to do. I heard too much radiation can cause cancer. Does this sound like an infection? A cyst? Cancer? Nothing at all? I still need to schedule the appointment with the doc or OB and I'm wondering about how long is safe to wait. I can't always get in right away. I don't want to worry myself sick, but I cannot help it. I am desperate for input or advice! Thanks, Angela",
      "MessageIndex": 0,
      "PostDate": "26/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/519849-breast-lump-found-might-need-mammogram-have-questions.html",
      "Title": "Breast Lump Found...Might Need Mammogram, have Questions"
    },
    {
      "AuthorID": "AngieBaby77",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/AngieBaby77",
      "Content": "Hi everyone. I am 29 years old and my doctor said I have fibrocystic breast tissue. My breasts are sore especially when touched. And there is a swollen, very painful under the skin lump under my armpit. Went back to the doc yesterday and he said it is an infected lymph node. I feel sore all over. It almost feels like the other armpit node is sore too. I am scared it is a cancer sign but the doctor is very dismissive. I don't want to let soemthing serious go untreated. It's like my whole torso is sore with the most painful area being the left armpit/breast. Doc gave me Zithromax and sent me home. He didn't seem to think any further investigation was necessary. I am still in great discomfort and don't know what to do. I am scared it could be cancer. Breast cancer, lung cancer, lymphoma, my mind is worrying about all these different possibilities.",
      "MessageIndex": 0,
      "PostDate": "24/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/519001-fibrocystic-breast-tissue-swollen-painful-armpit-lump-hurt-all-over-i-am-scared.html",
      "Title": "Fibrocystic breast tissue, swollen painful armpit lump, hurt all over -- I am scared!"
    }
  ]
}