{
  "AuthorID": "aswhynacht",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
  "Posts": [
    {
      "AuthorID": "aswhynacht",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
      "Content": "Hi there! It must be torture waiting to call tomorrow. I just wanted to suggest that you do something fun today to try to take your mind off of it. I hope you are able to pass the day quickly (for your sanity's sake). Keep us posted.",
      "MessageIndex": 4,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/761314-lump-armpit.html",
      "Title": "Lump in Armpit"
    },
    {
      "AuthorID": "aswhynacht",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
      "Content": "I should start out saying that I am 32 years old with no family history of breast cancer. I have two very young daughters and I am a bit scared. A few weeks ago I told my family dr. that I felt a ridge of lumps in both of my breasts. She ordered an ultrasound to be safe but after her clinical exam she was quite confident that it was just something called fibrocystic disease or something like that. I wasn't concerned at all about it anymore. I went to the ultrasound (u/s) and had that done just to be on the safe side but didn't expect to hear much back. My family doctor actually called me (on a holiday) a few days later and told me that she had the results of my u/s and she was referring me to a specialist because there was a cyst in a different part of my breast that looked different than the others and just to be safe she thought I should see a specialist. The specialists office called me a few days later and wanted to see me later that same week. I went in thinking she would just want to do a follow up u/s in 6 months because that is what my dr. told me is what would likely happen but she came in the room and right away said that she wants to surgically remove the cyst because there appears to be blood flowing through it on the u/s so she wasn't going to take any chances. She said that she wanted to remove the lump within 2 weeks and I now have a surgery date for this Wednesday. I have no idea how scared I should be. I really was a bit taken aback by her insistence on actually removing the lump and also about removing it so soon. I haven't had any needle aspirations and all the info I looked at seems to indicate that is the first step, not full removal so I am a bit confused and worried. I know I am rambling and I apologize. Writing it all out seems to be helping because I can see how irrational I am being, hahaha... If anyone has any comments, advice, etc. for me I would greatly appreciate it. I can't seem to find much on the internet about an u/s showing blood in a cyst and what the info on that it...anyway, thanks in advance for all of your help!!",
      "MessageIndex": 0,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/764578-ultrasound-showed-blood-breast-cyst.html",
      "Title": "Ultrasound Showed Blood in Breast Cyst"
    },
    {
      "AuthorID": "aswhynacht",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
      "Content": "I should also mention that the cyst is only about 4 mm long and the specialist stated that it is quite small but said several times that she is glad we caught this early. Her statement may have been intended to make me feel better but actually it just scared me more. Also, my mother is a nurse in the day surgery unit that I will have my surgery in and she says that 99 times out of 100 these cysts are nothing. Is this roughly an accurate statistic? I can't seem to find out any stats about it. I know I am obsessing, I am just a person who needs to know all the facts / stats / etc. ahead of time. I don't like surprises!",
      "MessageIndex": 1,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/764578-ultrasound-showed-blood-breast-cyst.html",
      "Title": "Ultrasound Showed Blood in Breast Cyst"
    },
    {
      "AuthorID": "aswhynacht",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
      "Content": "I am a bit sad that I haven't received a single reply with so many views. Hasn't anyone else been in a similar situation? I know that none of you can tell me what the cyst is or isn't, that is not what I am looking for. I was just hoping for some advice, comments, suggestions, kind words, etc. Thank you anyway.",
      "MessageIndex": 2,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/764578-ultrasound-showed-blood-breast-cyst.html",
      "Title": "Ultrasound Showed Blood in Breast Cyst"
    },
    {
      "AuthorID": "aswhynacht",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
      "Content": "Thank you for your reply Carm. I really appreciate it . I will ask the surgeon`s opinion now, thank you. I didn`t realize I would be able to. I will let you know what happens tomorrow. Thank you so much again...",
      "MessageIndex": 4,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/764578-ultrasound-showed-blood-breast-cyst.html",
      "Title": "Ultrasound Showed Blood in Breast Cyst"
    },
    {
      "AuthorID": "aswhynacht",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
      "Content": "Carm & Brenda: I just wanted to check back in with you two to say hi. I know you have your MRI tomorrow Brenda, good luck with that. I will be thinking about you as well. I had my cyst removed yesterday. They did the u/s before and I was hoping it would be gone but they found it immediately and showed me how they see the blood pumping through it. They stuck the wire in and I sat like that for 2.5 hours but it didn't hurt at all. After the surgery I asked the doctor if it was benign but she said she didn't cut into it so she doesn't know. She sent it off to a lab and won't have the results back for a week or so. I was a bit dissapointed not to have an answer but the week will go pretty fast I think. Also, I actually had my tubes tied as well yesterday since I was going to be in surgery anyway. i was booked to have them tied on September 30th but I got the docs to work around their schedules so I didn't have to go through another recovery next month. I am pretty sore because I now have 3 incisions but I'm doing good. Anyway, I just wanted to update you on what was happening. I will let you know more when I hear back in a week or so. Brenda: Let me know how your MRI goes please. Again, I will keep you in my thoughts tomorrow. Carm: Take care and I will talk to you soon. Sarah",
      "MessageIndex": 6,
      "PostDate": "26/08/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/764578-ultrasound-showed-blood-breast-cyst.html",
      "Title": "Ultrasound Showed Blood in Breast Cyst"
    },
    {
      "AuthorID": "aswhynacht",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
      "Content": "Carm & Brenda: I just wanted to check in to tell you both that I am STILL waiting to get the results of my biopsy. It was 2 full weeks yesterday since they removed the \"cyst\" and still no results. I called the Dr.'s office today and the receptionist said that it can take a few weeks to get the results. Before the surgery I asked the Dr. how long it would take and she told me it is usually a week or so. It is very stressful waiting. I know that the chance of it actually being cancer is very remote but it would just be nice to hear that it is nothing so I can stop thinking about it!!! Anyway, just wanted to vent. I hope all is great with the two of you. Keep in touch please! Sarah",
      "MessageIndex": 8,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/764578-ultrasound-showed-blood-breast-cyst.html",
      "Title": "Ultrasound Showed Blood in Breast Cyst"
    },
    {
      "AuthorID": "aswhynacht",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/aswhynacht",
      "Content": "Hi Carm, Brenda and \"Jollygirl\": I finally got a call yesterday from the Dr. (after 3 weeks of waiting, ugh) and she said that my biopsy was fine!!! I was so happy. I assumed that it would be fine but it was really nice to hear it. I want to thank you guys so much for being a comforting shoulder to lean on through all that stress for me. I hope all goes well for you in your jouney's. I'm not really aware of your \"stories\" and why you are on here but if you ever feel like talking about it, I am here. Again, I really truly appreciate all of your support and comforting words. You can never know how much it meant to me. Thank you. Please keep in touch. Sarah",
      "MessageIndex": 12,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/764578-ultrasound-showed-blood-breast-cyst.html",
      "Title": "Ultrasound Showed Blood in Breast Cyst"
    }
  ]
}