{
  "AuthorID": "azlisa60",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/azlisa60",
  "Posts": [
    {
      "AuthorID": "azlisa60",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/azlisa60",
      "Content": "I recently had 2 biopsies both Stereotactic biopsy and Fine needle aspiration for some calficatins and two cysts. The cysts turned out fine and were liquid and popped when they went to drain them. On the califications they took samples. I just got the report and now I am scheduled for a (Open) Excisional biopsy. The report states: Sections show needle core biopsies of fibrofatty breast tissue. There are areas of sclerosing adenosis. There are some dilated ducts present/small cysts. Intraluminal microcalification is noted. There is coumnar cell alteration present. There is a small focus of atypical ductual hyperplasia present. Is this something for me to be worried about? Does this put me at a higher risk level for breast cancer? I know I am probably overanalyzing this but it is very bothersome. I am scheduled for the (Open) Excisional biopsy next month.",
      "MessageIndex": 0,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/949769-atypical-cells.html",
      "Title": "atypical cells"
    },
    {
      "AuthorID": "azlisa60",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/azlisa60",
      "Content": "Hi everyone. I currently have been given a option of either mastectomy or go on tamoxafin and have mamo's every 6 months and MRI's every year. I have been diagnosed with ADH, ALH and LCIS in both breasts. On the first run of it they the doctor did a sterotactic biopsy and core biospy on my left breast for calcifcations and a couple of cysts. The cysts turned out to be nothing. The calcifications report states: Sections show needle core biopsies of fibrofatty breast tissue. There are areas of sclerosing adenosis. There are some dilated ducts present/small cysts. Intraluminal microcalification is noted. There is columnar cell alteration present.There is a small focus of atypical ductual hyperplasia present. So then after this I had an open incisional biopsy and this was the findings: Diagnosis- Left breast, re-excision- Lobular neoplasia, ranging from atypical lobular hyperplasia to lobular carcinoma in situ. Proliferative fibrocystic changes with intraluminal microcalcification and atypical ductual hyperplasia. Small fibroadenoma prior biopsy site changes present small ductual papilloma, sclerotic Then doctor thought maybe we should have an MRI to rule out anything else, so in July I had 2 MRI's and the findings were: BC MR Breast W!+W/O Contrast Bilateral 7191 010 91134 AM MST Reason for exam: TECHNICAL CALL BACK MALIGNANT NEOPLASM OF FEMALE BREAST Report: \u0095*AMERICAN COLLEGE OF RADIOLOGY ACCREDITED FACILITY** HISTORY: surgical excisional biopsy superior left breast 6/13/2013 with histology of lobular neoplasia, atypical ductal hyperplasia, fibroadenoma and papilloma. No family history of breast cancer. COMPARISON: Left breast needle localization images and surgical specimen 6/13/2013, left breast stereotactic biopsy and postprocedure mammogram 4130/2013, mammograms from SimonMed Imaging 4/15/2013 and 4/10/2013. TECHNIQUE: VIBRANT dynamic technique was employed with and without gadolinium contrast using a dedicated breast coil. Additional 3D multiplanar reformatted images, subtraction images, MIP image, and kinetic analysis curves were generated and reconstructed on a separate workstation. MRI FINDINGS: The breast parenchyma is composed of heterogeneously dense parenchyma and fat There is moderate bilateral background parenchymal enhancement. Numerous bilateral scattered enhancing foci and areas of fibrocystic changes are noted. Right Breast: Within the right upper outer quadrant at a middle depth, there is a 1 cm x 1 cm well-circumscribed mass with lobulated margins. This Demonstrates moderate uptake of contrast with progressive type kinetics. This is labeled as finding #1. MRI guided needle core biopsy is recommended. Within the remainder of the right breast, there are no other enhancing masses are non-mass like enhancement suspicious for malignancy. BC MR Breast W/+W/O Contrast Bilateral Left Breast: Postsurgical changes and postsurgical seroma in the upper central left breast, seroma measures 3.5 x 2 cm There is a thin rim of enhancement surrounding the surgical site which is within normal limits. However, along the superior and lateral margin of the surgical site there is a focal masslike enhancement measuring 2 cm. This demonstrates moderate uptake of contrast with progressive type kinetics. This is labeled as finding #2. MRI guided needle core biopsy recommended. Within the remainder of the left breast. there are no additional areas of non-masslike enhancement or enhancing masses suspicious for malignancy. The bilateral visualized axillary lymph nodes appear unremarkable. IMPRESSION: 1. Right upper outer quadrant at a middle depth, there is a 1 cm x 1 cm smoothly marginated mass with lobul9ted margins. This finding is indeterminate. MRI guided needle core biopsy is recommended. This is labeled as finding #1. 1.Along the superior and lateral margin of the surgical bed, there is a focal masslike enhancement measuring 2 cm. This finding is indeterminate. MRI guided needle core biopsy is recommended. This is labeled a.s finding #2. 1.BIRADS: 4 - Suspicious abnormality, biopsy should be considered. So I had now a MRI needle guided biopsy and they found ALH and LCIS in both. I am going to see an oncologist on Friday and then second opinion on Monday. Everyone is trying to push me towards a mastectomy but I feel that is too drastic. Am I thinking at this all wrong?? Any thoughts or words of wisdom greatly appreciate. Thanks, Liss",
      "MessageIndex": 0,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/965114-mastectomy-tamoxifin.html",
      "Title": "Mastectomy or Tamoxifin"
    }
  ]
}