{
  "AuthorID": "BabsB8",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BabsB8",
  "Posts": [
    {
      "AuthorID": "BabsB8",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BabsB8",
      "Content": "Here's my issue. I'm 32 and 9 years ago when I was pregnant with my first child I became concerned about a small lump near my right armpit. My OBGYN felt of it and said \"It's just normal breast tissue.\" Over the years the lump has remained. It is NOT a lymph node for sure, but I always assumed it was just a fibroid type lump because it gets more painful around my period and when I drink caffeine. By the way, I have large, dense breasts, so painful lumpiness around my period is nothing new to me. But this lump in my right armpit has always especially bothered me. Maybe because it's not actually IN my boob. It's in the area between my breast and my armpit. That area has always always seemed to be fatty as compared to my left armpit. Bear with me...I'm trying to draw a picture for you here... My left armpit has NO lumps. Looks completely like a NORMAL armpit. Can see tendon when I flex, no pain, etc. The right armpit area surrounding my lump is what I refer to as my 3rd boob. It is like a little pocket of fat surrounds that lump. I read online that it could be what is referred to as \"auxillary breast tissue.\" But I have had some weird changes lately. Around Christmas of 2010 I became really sick with the flu and a secondary sinus infection. I started an antibiotic, Levaquin, which a major risk of taking it was tendon injury. A week after I started taking the Levaquin I noticed my right elbow hurt really bad the day after I vacuumed. I initially thought the Levaquin caused the elbow pain and I stopped taking it. The right elbow pain has persisted and changed over the last 4 months. Not only is my elbow painful when I use it, and weak. But now I also have nerve pain in my right arm that shoots from my shoulder to my hand. I also frequently wake up at night with my entire right arm completely numb. In addition to this arm/elbow pain, I have also noticed that my lump in my right armpit is getting lumpier. The tissue around the lump itself is very thick and THE LUMP feels more like a pebble! The area has become more 'puffy fat' looking and the area always seems vary in some degree of soreness. Instead of just the cyclical pain. I am scared. What else can I say? I seriously think that the arm pain has something to do with the lump in the armpit. Maybe it's working its way into my nerve!? I am going to make an appointment with my GYN, but do I also need to make an appt with a bone & joint specialist for my arm? I am thinking that my GYN will be able to suggest where to go from there once he assesses my situation. He BETTER NOT say that it is 'normal breast tissue'. I refuse to leave without an ultrasound or appt for a biopsy (I don't think a mammo is going to get a pic of my armpit very well). My grandmother had a breast removed due to a tumor. My mom has to have mammos every six months because of abnormal lumps due to scar tissue from breast reduction. My sister recently had a cyst removed that gave us all the breast cancer scare. I guess what I'm getting at...has anyone ever experienced symptoms similar to mine and what was the outcome? Thanks for hearing me out. I wanted to start a thread because I will be back to update as soon as I have my appt with my doc. I have procrastinated my appt because I tried to convince myself everything is 'normal' but I can't ignore how much lumpier the lump is and this arm pain is not getting any better.",
      "MessageIndex": 0,
      "PostDate": "22/04/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/846135-right-armpit-lump-right-arm-pain.html",
      "Title": "Right armpit lump + right arm pain"
    },
    {
      "AuthorID": "BabsB8",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BabsB8",
      "Content": "U/S was today. The tech did the routine of both breasts and also searched around in the lumpy armpit area, but she didn't make a note of anything out of the ordinary there. She only showed me where the 'vessels' (blood vessels) are located that could be having some pressure at night while I sleep, causing the numbness. She did note that I had lots dense fibrous tissue, but then she also went back to my right breast and showed me a dark spot! It was a very symmetrical circle shape that she said was probably a fluid filled cyst. She asked if I had any discharge. I told her about a month or so ago that one of my montgomery glands had been infected, and there was ***** discharge from that gland, but it was not from the nipple itself. I just thought that was probably a normal 'pimple' like occurrence. Waiting to hear back from the doc now which will take several days. Keeping my fingers crossed all is normal!",
      "MessageIndex": 1,
      "PostDate": "28/10/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/875502-ultrasound-tomorrow-nervous.html",
      "Title": "Ultrasound tomorrow! Nervous!"
    },
    {
      "AuthorID": "BabsB8",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BabsB8",
      "Content": "Hello! I've posted here before, but without much response. I am 32 and for the past 9 yrs (since I was pregnant with #1) I've had a lump in my right armpit. My OB at the time said it was 'normal' breast tissue. It is very cyclical in nature. It gets sore and swollen when I am on PMS or due to caffeine, and sometimes hurts so much that it is uncomfortable to put my arm completely down at my side. The armpit area is abnormally fatty and puffy, whereas my other armpit looks normal and you can even see my tendon in that arm. Today I had my yearly GYN visit and finally discussed with my doctor that this lump needs some attention. For the past year I have been frequently awakened at night because my entire arm is painfully numb! And I explained to him how the lump has increased in size, and how the pain and the numbness and the fattiness is very frustrating. I told him that it would be fine with me to just have it removed, but he informed me that surgery in that area is tricky and can actually cause damage (lymph &/or nerve damage) and that he doesn't recommend surgery if it is just normal tissue. However he scheduled me to have an ultrasound to rule out any abnormalities. At this point, the knot is still believed to be axillary breast tissue, but the u/s tomorrow will determine if this is something more. Of course I tend to worry about it being cancer. Has anyone else here experienced something similar? Whether it was cancer or just axillary tissue?",
      "MessageIndex": 0,
      "PostDate": "27/10/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/875502-ultrasound-tomorrow-nervous.html",
      "Title": "Ultrasound tomorrow! Nervous!"
    }
  ]
}