{
  "AuthorID": "Beardsteph",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Beardsteph",
  "Posts": [
    {
      "AuthorID": "Beardsteph",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Beardsteph",
      "Content": "Did the radiologist and Doctors act like it was not necessary to do the biopsy since there had been no change? I called today to go ahead and schedule the biopsy for my own peace of mind and they are acting like there is no reason, so they are having the doctor call me back. It is frustrating because now I feel like maybe I should wait but in my line of work, summer is a better time of year to take a day or two off and IF it were something that needed dealt with further, I would have the time. Not t mention that my deductibe is paid for the year and 6 months will be December. UGH!",
      "MessageIndex": 2,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/853414-biopsy-wait-6-months.html",
      "Title": "BIOPSY or WAIT 6 MONTHS??"
    },
    {
      "AuthorID": "Beardsteph",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Beardsteph",
      "Content": "I am 36 y/o and recently had my baseline screening mammogram with no palpable mass or lump. As I walked out of the room I noticed an area on the film that was still on the screen that I felt looked abnormal so I halfway expected to get called about it. The following week I WAS called to have a diagnosic mammo & U/S. Side note: I did have a small palpable lump in '99 in which the U/S showed nonhomogeneous echo pattern seen throughout the same breast in question. I forgot to mention this previous U/S to my current doctor. The only family history of breast cancer I have is my mother's grandmother. She died at 63 because her breast cancer had already metastasized to her lungs. The results of spot compression films show :focal asymmetric density has become less defined than the density seen on films 2wks ago. U/S states that there is no evidence of any solid mass or abnormal cystic elements, become less defines and the radiologist, after asking if I was a worrier (to which I quickly but inaccurately replied \"no\", recommends waiting 6 months and redoing the mammogram. Not sure why I said no, it just came out when in fact, I am. I am thinking that if I had said \"yes\" she may have asked if I wanted to do a biopsy now, to which I KNOW I'd have said \"YES\" (even though I HATE needles) because I'd rather know now. So should I wait based on the results and avoid an unnecessary biopsy at this point or ease my mind and just do it? Just looking for opinions. Thanks!",
      "MessageIndex": 0,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/853414-biopsy-wait-6-months.html",
      "Title": "BIOPSY or WAIT 6 MONTHS??"
    }
  ]
}