{
  "AuthorID": "bekky",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bekky",
  "Posts": [
    {
      "AuthorID": "bekky",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bekky",
      "Content": "Hello Im 34 yr old, with 2 young daughters. Ive recently (about 4 weeks ago), found a lump in my breast, just behind the nipple, its not round, but rather more long and extends from just above the areola and downwards. Its easily felt when I touch the area. My GP is aware of this and confirmed the thickening 3 weeks ago, and asked me to wait for my period and if it the lump is still there then he will refer me straight away. However im getting increasingly worried because my period seems to be never coming, im about 4 days late, and feel this is delaying me having further investigations. I am not pregnant as ive been sterilised so the breast change cannot be for that reason. Do anyone think I should go back to my GP and ask him to refer me even though ive not had my period or do you think I should have more patience for cycle to start?? I cannot help being so worried as my mum had breast cancer when she was 39yr old and she died because of it, and I also have 2 other relatives who also suffered with breast cancer. I know I may be jumping the gun, but im so scared now and am losing sleep over this. I have had 2 scares in the past, first time I was told it was a dilated duct, and the second time I was told it was lumpy tissue. Had no problems for a long time until this again now. Would be so glad for anybodys advice or opinions on what you think I should do. Thanks in advance Bekky x",
      "MessageIndex": 0,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/761732-breast-lump-very-anxious-about-family-history.html",
      "Title": "Breast lump and very anxious about family history!"
    },
    {
      "AuthorID": "bekky",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bekky",
      "Content": "Somebody please help me out, im desperatly worried now, cant get it out of my head today",
      "MessageIndex": 1,
      "PostDate": "04/08/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/761732-breast-lump-very-anxious-about-family-history.html",
      "Title": "Breast lump and very anxious about family history!"
    }
  ]
}