{
  "AuthorID": "BioAdoptMom3",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
  "Posts": [
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "What kind of biopsy are you having? I just had one done a few weeks ago and it all started with the same type of letter you originally received. Even though I am sure you are worried, I wanted to reassure you by telling you first that mine was NOT cancerous and that the radiolgist told me that 95% of patients who have what you and I have on that first mammogram do NOT have cancer. I am interested in the type of biopsy you are having though since I just recently had mine. It was called a stereotactic core biopsy. Nancy",
      "MessageIndex": 14,
      "PostDate": "18/08/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/176393-ambiguous-mammogram-results.html",
      "Title": "Ambiguous Mammogram Results 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I feel your pain. I too when the procedure drew near was more fearful of that than I was of the possible diagnosis. If they handle it as they did for me, there will be a tech there just to help you through it. I had a great one who held my hand and talked to me the whole time. It really was not nearly as bad as I had feared. I wish I could relieve your mind even more but I just didn't have that type of biospy, though I think the stereo core one is somewhat similar. I had helpful advice from two friends though the night before the procedure. One of them reminded me that though it obvoiusly was not going to be pleasant, if it were going to be unbearable they would at least have to give me some sedation and the other one said something which took a lot of pressure off of me. She said, remember that though we're adults, if its painful its OK to express it in whatever way you want because the people there understand! Good luck and let us know how it goes. I don't know if you are a praying person, but I am praying for you now and believe very strongly in the power of prayer. Just as a side note here, I had a lot of folks praying for me also. When the radiologist came into the room the first thing he did was place his hand on mine, tell me he liked to pray with all of his patients and asked me if I would like that. It calmed me down tremendously. I think even if I were not a praying person it would have still been reassuring as it told me he was concerned about me as a whole person. Talk to you soon! We are here with you! Nancy",
      "MessageIndex": 16,
      "PostDate": "18/08/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/176393-ambiguous-mammogram-results.html",
      "Title": "Ambiguous Mammogram Results 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Are they going to do any type of biopsy? I would ask about that just to relieve your mind. Chances are you are FINE, but I think for your own peace of mind you need clarification. I had the same type of thing happen to me this summer so let us know what they decide to do and how you are doing. Nancy",
      "MessageIndex": 2,
      "PostDate": "29/03/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/268411-inconclusive-mammogram-ultrasound.html",
      "Title": "Inconclusive Mammogram & Ultrasound"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I agree with the others, but also feel that we are much more diligent about mammograms, self-exams, etc. than we used to be, so it is just being detected more often. I also believe there is much more emphasis on it so there may not necessarily a big rise in the amount of cases, just that we are hearing about more of them. Nancy",
      "MessageIndex": 3,
      "PostDate": "24/10/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/330791-why-there-so-much-breast-cancer.html",
      "Title": "Why is there so much breast cancer??"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "It is very common. The exact same thing ended up happening to me. I ended up having to have a biopsy, but all was fine. I remember the radiologist putting his arm around me and telling me very calmly that fewer than 5% of all call backs involve some type of malignancy. It is best to go ahead with the ultrasound, but very rarely is it anything serious. Let us know what they say. Nancy",
      "MessageIndex": 4,
      "PostDate": "28/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/502638-first-mammogram-results-need-some-advice.html",
      "Title": "First Mammogram Results (need some advice) 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I have had the stereotactic one and the ultrasound guided and I really didn't think the st. was too bad. The worst part to me was having to lie in that position on my stomach for almost an hour. Since you are compressed during the procedure (but not quite as tightly as you are for a mammo) you really don't feel much but pressure. Even when they numb you it is not that painful and I am a wimp. I am surprised they let you in with your sister. They would not allow DH in with me. I went somewhere else for the ultrasound one and a friend/co-worker offered to go with me because she said she had gone in with her sister and a with a friend for theirs, but they wouldn't let DH or her in with me either. At any rate, I didn't think either one was all that bad and I actually would prefer the stereotactic procedure over the other one. I am so sorry about your sister. Nancy",
      "MessageIndex": 1,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/579634-stereotactic-breast-biopsy-needle.html",
      "Title": "Stereotactic Breast Biopsy-needle"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Hi, I am older than you are (45) and just recently had a lump found on a routine mammogram (my first mam). I was told right then and there by the radiologist that most are not cancerous (like 95%)! Those are pretty good odds. I think you are very wise to have it checked out. Chances are also that IF it is cancerous, since you just noticed it a few weeks ago you would be in the very early stages of it. What they will probably do is a mammogram and ultrasound. Usually an ultrasound can tell them if its just a fluid filled cyst, which is very likely. If so, then most likely nothing else will need to be done. If its not, then you will have a biopsy. I just had one called a sterotactic core biopsy. It really wasn't that bad. If you have more specific questions as time goes by, feel free to post them here those of us who have been through similar things will try to help. Good luck and you are in my prayers! Nancy",
      "MessageIndex": 3,
      "PostDate": "17/08/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/198815-i-have-lump-my-breast-should-i-worried.html",
      "Title": "I have a lump in my breast: should I be worried?"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "The same thing happened to me this past summer (after my first routine mammogram) and I was terrified, but it turns out its really very common! When I went back for the repeat and the ultrasound it indicated that I needed a biopsy, which ended up not being nearly as bad as I thought it would be. Anyway, my point here is that according my radioogist, chances of a report like this turing out to be cancer are not even 5%! Actually they also said only 10 to 20% of patients need any type of biopsy after the repeat mammogram and ultrasound. Doctors just can't take any chances now so they have to do everything they can to make sure you are fine. The chances of a GOOD report are heavily in your favor! Let me know what happens. Nancy",
      "MessageIndex": 1,
      "PostDate": "24/03/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/266826-mammogram-abnormal.html",
      "Title": "Mammogram abnormal"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Shirley, I am so sorry about your diagnosis and the death of your husband. I cannot offer advice as I have only had the biopsies, but never been diagnosed with cancer. The only thing I can do is encourage you by telling you that my MIL had breast cancer as well as one of my best friends about a year ago. My MIL had to have a mastectomy and 4 months of chemo, but did fine through it. Her nausea was really not severe and her hair grew back very quickly. She never had a reoccurance. My friend had a lumpectomy and radiation for several weeks. It made her tired for awhile, but no other side effects. She is doing fine now as well. Please let us know how they decide to treat you. You are in my prayers as we speak. Nancy",
      "MessageIndex": 17,
      "PostDate": "08/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/552470-stereotactic-breast-biopsy.html",
      "Title": "Stereotactic Breast Biopsy 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I just recently had the same type of thing. This is very common. When I called my doctor and talked with his nurse after receiving the news she told me that close to 50% of all mammograms need to be re-done and have ultrasounds. Usually its just dense tissue or could be fluid filled or other types of cysts. The radiologist confirmed all those stats when I went back to have it done. I did end up having to have a biopsy (much easier than I thought it would be) and the results were good. I was told that only 10% of those who need repeat mams need to have biopsies and only 10% of those are cancer! I know the fear, believe me, but the statistics are way in your favor for a good report! Hang in there and let us know tomorrow. You have my prayers. Nancy",
      "MessageIndex": 1,
      "PostDate": "13/09/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/207452-diag-mamo-ultrasound-tomorrow.html",
      "Title": "Diag. mamo and ultrasound tomorrow"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "It means that they have reason to believe you do NOT have cancer, hooray! but that you should follow up with it in six months just to be sure there is still no cause for concern. Something that should really encourage you is that whenever they are in doubt they will do a biopsy, so the fact that you just have to have another one in six months is a very encouraging sign! Nancy",
      "MessageIndex": 4,
      "PostDate": "05/04/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/266826-mammogram-abnormal.html",
      "Title": "Mammogram abnormal"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "What kind of biopsy are you having? Its great that you were able to schedule it so soon so you don't have to worry for too long. I can't remember what my doctor called the area that was found, but it was something benign as he said MOST are! Try not to worry too much. It is extremely rare for things like this to be cancerous! Let me know what you are having though. Mine was called a stereotactic core biopsy. Nancy",
      "MessageIndex": 3,
      "PostDate": "14/09/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/207452-diag-mamo-ultrasound-tomorrow.html",
      "Title": "Diag. mamo and ultrasound tomorrow"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Did the nurse call? I remember being very sore for a few days afterwards, but do not remember having actual pain after about the first 24 hours. I hope you got some answers and are feeling better by now. Nancy",
      "MessageIndex": 7,
      "PostDate": "20/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/552470-stereotactic-breast-biopsy.html",
      "Title": "Stereotactic Breast Biopsy 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "My experience was about the same as the PP's. I actually didn't even feel the numbing much because the breast is compressed and that helps to eliminate a lot of any pain you may feel. My radiologist did tell me afterwards that it looked like it probably wasn't cancer, but it took two days to get the results from my GYN. Good luck and let us know your results. Nancy",
      "MessageIndex": 2,
      "PostDate": "18/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/552470-stereotactic-breast-biopsy.html",
      "Title": "Stereotactic Breast Biopsy 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Are you taking the Tylenol before you are feeling pain? Be sure to take it about every three to three and a half hours or so before you have a chance to feel pain. It should be tons better tomorrow. If its not, I would call and let them know. Nancy",
      "MessageIndex": 5,
      "PostDate": "19/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/552470-stereotactic-breast-biopsy.html",
      "Title": "Stereotactic Breast Biopsy 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I am glad its done and hope that the results will be in sooner rather than later so you don't have to have this hanging over you! It sounds very similar to what I had. Were you face down on a table with your breast compressed? If so, its the same type of thing. Be sure to post your results. I am praying for good ones for you. Nancy",
      "MessageIndex": 5,
      "PostDate": "16/09/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/207452-diag-mamo-ultrasound-tomorrow.html",
      "Title": "Diag. mamo and ultrasound tomorrow"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "This is very common. I had to go back after my second routine one about two and a half years ago and I was terrified. The first thing they told me was that it happens about half the time. Let us know what happens and try not to worry too much. Nancy",
      "MessageIndex": 3,
      "PostDate": "01/02/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/467930-mammogram-needs-retaking-please-help.html",
      "Title": "Mammogram needs retaking, please help!"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "The node being negative is great news! You are both in my prayers. Please update us when you can. Nancy",
      "MessageIndex": 6,
      "PostDate": "18/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Basically it is done the same way the other one is done. They just may hone in on certain areas that may be suspicious and the radiologist will read it right away. They will let you know what is going on before you leave the center or office as opposed to waiting for a call or letter. Nancy",
      "MessageIndex": 1,
      "PostDate": "27/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/563974-diagnostic-mammogram.html",
      "Title": "diagnostic mammogram"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I guess it wasn't exactly the same, but it sounds similar. You probably had the ultrasound one. I had the one where they use the mammogram type machine. Anyway, yes, I did have drainage for a little over a week, so its normal. I actually called the hospital because it was still bleeding slightly after a week and they had me come in to have a radiologist look at it. He said it seemed to be healing fine and that sometimes it can take up to two weeks to stop draining completely. Hang in there! I am sooooooooooooo happy for your good report!!!!! I know its a relief! Nancy",
      "MessageIndex": 7,
      "PostDate": "19/09/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/207452-diag-mamo-ultrasound-tomorrow.html",
      "Title": "Diag. mamo and ultrasound tomorrow"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I think you are wise to keep an eye on it. Probably they will do an ultrasound if the antibiotics don't work. Let us know. Nancy",
      "MessageIndex": 2,
      "PostDate": "03/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/520769-ibc-mammogram-mri-questions.html",
      "Title": "IBC, Mammogram and MRI questions"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I am just a year older than you and have been called back twice for ultrasounds when no actual lumps have been felt. I did end up having to have biopsies and both times the radiologist told me going into it that anytime you have suspicous areas on mammograms your chances of it actually being cancer no greater than about 10%. Hang in there and try not to worry too much. Nancy",
      "MessageIndex": 4,
      "PostDate": "30/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/564482-focal-asymmetry-right-breast.html",
      "Title": "Focal Asymmetry Right Breast"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I agree. It is very, very common and almost always nothing to worry about, though I know it is scary as I have been there too. Let us know what they say. Nancy",
      "MessageIndex": 3,
      "PostDate": "09/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488600-call-back-1st-mammo-38yrs-old.html",
      "Title": "Call Back on 1st mammo 38yrs old"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "The PP poster is right. The only time they usually read it right away and let you know the results is when it is a diagnostic one (means you had a questionable one and are back for a repeat or are having it done after a biopsy, etc.) rather than a sceening mammogram. Nancy",
      "MessageIndex": 2,
      "PostDate": "20/06/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/296570-mammograms-read-right-away.html",
      "Title": "Are Mammograms read right away?"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I know its scary (I went though something discovered on a mammogram a few months ago which in the end turned out to be nothing to worry about, but still, I know whats going through your mind!)! In most cases a lump is nothing to worry about. The soreness could be an indication of a lymph gland infection. Are you nursing by any chance? It could also be related to that. At any rate, I would call the doctor and have it checked out, but try not to worry because most likely its nothing serious. Let us know what you find out! Nancy",
      "MessageIndex": 1,
      "PostDate": "10/10/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/215315-found-lump-am-scared.html",
      "Title": "Found a lump and am scared"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I can understand your concern because I just went through the same thing in July. However in my case I did need the ultrasound, then a biopsy (thank God everything was OK). One of the questions I asked the day I had the repeat mammo and ultrasound (which also said IF indicated) was should I be worried if I did indeed need the sono? She explained that in almost all cases even if the sono was necessary that nothing serious was discovered and they just wanted a better view. She also told me that the radiologist would read it immediately and she would let me know, or he would talk with me. If the doctor sent the tech out to talk with you and you didn't need the sono I would take that as definately a very good sign that you are fine. Almost always its just dense breast tissue. Only if it appears to be a mass do they do the sono. So, I think I would just try to relax, talk with your doctor and get his feeling on this and go from there. You are in my prayers. Nancy",
      "MessageIndex": 1,
      "PostDate": "05/10/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/213895-question-about-mammogram-retesting.html",
      "Title": "question about mammogram and retesting"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I would have it checked out just to be on the safe side, but when there is more than one and its painful its almost always a cyst. Let us know what they say! Nancy",
      "MessageIndex": 1,
      "PostDate": "14/10/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/216307-needing-info-breast-cancer.html",
      "Title": "needing info on breast cancer"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I am not sure what type of biopsy you had, but I had a sterotactic one about four years ago and remember having a little blood for about five days afterwards. Hope its better soon, but I wouldn't worry too much yet. I go tomorrow for an ultrasound biospy so I am glad you reminded me of the possibility of several days of bleeding so I will be prepared. Nancy",
      "MessageIndex": 1,
      "PostDate": "09/10/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/541604-bleeding-after-biopsy.html",
      "Title": "Bleeding After Biopsy"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "There are different types of core biopsies. What type are you having? I had one (sterotactic) two years ago and I do remember the radiologist telling me that these types of things were very rarely cancerous, but they have to make sure. Let me know what type you are having and I will tell you more about the procedure if I can. Nancy",
      "MessageIndex": 1,
      "PostDate": "26/01/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/466132-core-biopsy.html",
      "Title": "Core biopsy 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I am so glad its over for you. Let us know what they tell you. I know it will be a long five days, but try to keep in mind that your chances of NOT having cancer are at least 80%! Nancy",
      "MessageIndex": 14,
      "PostDate": "01/02/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/466132-core-biopsy.html",
      "Title": "Core biopsy 1 2"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Hi, I know the fear because though I didn't find a lump one was found in my first routine mammogram a couple of months ago. I was freaked! All kinds of horrible things were going through my mind! I went back for the second mam and ultrasound and one thing they told me was that the radiologist always reads those right away, so don't let that part scare you. He (radiologist) also told me that more than 90% of all lumps are NOT cancerous (he met with me right after). I did end up having to have a core biopsy, which was not nearly as bad as I thought it might be and the results were FINE, as most are. Keep in mind too that you seem to have found this very early, so in the event that it is cancersous, you have an excellent chance for a complete cure. Please post when you know something and let us know what they are going to do, if anything at all (most of the time nothing more is necessary). Nancy",
      "MessageIndex": 1,
      "PostDate": "09/09/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/206183-nervous-about-mammogram-ultrasound.html",
      "Title": "Nervous about mammogram and ultrasound"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "That is GREAT news! I had been hoping you would post soon and let us know. Do be sure to ask your doctor what he thinks it was. It likely was a fluid filled cyst or something like that. I would be curious to know after you meet with him if you want to post about it. Nancy",
      "MessageIndex": 4,
      "PostDate": "11/09/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/206183-nervous-about-mammogram-ultrasound.html",
      "Title": "Nervous about mammogram and ultrasound"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I totally understand and am feeling the relief with you! Nancy",
      "MessageIndex": 11,
      "PostDate": "23/11/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/342817-bi-rad-3-biopsy-surgery.html",
      "Title": "Bi-Rad 3 Biopsy and/or surgery?????? 1 2 3 4"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I too am having to go back for a repeat and an ultrasound this coming Friday. I am about the same age as you are and this is my second time and I have to admit, I am a bit nervous about it too. The first time I did end up having to have a biopsy, but at that time was told, even having to return for the additional procedure, that my chances of it being cancer were not even 10%! Obviously it is best to have it checked out, but the chances of either one of us having anything more serious are slim! Let us know how it goes. Nancy",
      "MessageIndex": 1,
      "PostDate": "15/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/534142-worried-being-called-back-2nd-mammogram.html",
      "Title": "Worried. Being called back for 2nd mammogram..."
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "It sounds like she just has dense breast tissue, which is common in younger women. Recently when I had my first routine mammogram I had to go back for a repeat, then a biopsy. The radiologist at the repeat apponitment told me that about 10% of women with diagnosed breast density need a biopsy and only 2 to 5% of those women have cancer. So, the statistics are on her side! Let us know what happens. Nancy",
      "MessageIndex": 1,
      "PostDate": "07/11/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/222774-going-spot-magnification-breast-density-question-please.html",
      "Title": "Going in for spot magnification of breast density.. question please?"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I am so sorry you have to wait again. The waiting is the worst! You are in my prayers too. Nancy",
      "MessageIndex": 26,
      "PostDate": "08/12/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/342817-bi-rad-3-biopsy-surgery.html",
      "Title": "Bi-Rad 3 Biopsy and/or surgery?????? 1 2 3 4"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "The stereotactic core biopsy is done if the lump is not easily accessible and cannot be felt with the human hand. It takes about an hour. When I went they had me lie on a table on my stomach with my breast in question hanging through a hole. They were very compassionate, both the radiologist and the techs and I have heard similar stories from other women. They compressed it like they do in a regular mammogram which actually is a blessing because the compression stops the blood from circulating as well so you feel less pain. When they numbed it all I felt was pressure and I am not exaggerating at all. When they first went in I felt a pinch bad enough to make me say ouch. They apologized and said they would give it a minute or two longer. They did and I never felt anything other than pressure again. When they were done the tech had to compress it with a gauze pad for about 10 minutes, then they bandaged it and I was free to go. If I did not take extra strength tylenol around the clock for those first 24 hours I would start having pain, but by the next day I didn't even need that. The results came in within two days. I am 46 and may be in peri, but no doctor has told me that and I have had no hot flashes, so probably not. Good luck and let us know what they decide to do.",
      "MessageIndex": 7,
      "PostDate": "22/11/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/342817-bi-rad-3-biopsy-surgery.html",
      "Title": "Bi-Rad 3 Biopsy and/or surgery?????? 1 2 3 4"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "OK, I just had my second annual, routine mammogram last week and today I got a letter stating that I needed to call my doctor to have something suspicious further investigated. It did state that cancer is not likely in cases like these, but it does warrent further examination. I will call the doctor in the morning. I am worried. I guess I shouldn't be yet, but can't help but be a bit concerned. I am 45 years old. I have never dealt with anything like this before. I guess my questions are: Has anyone else on here gotten a letter like this? If so, what was the outcome? Does anyone have any idea what the next step might be? TIA! Nancy",
      "MessageIndex": 0,
      "PostDate": "08/07/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/188554-help-letter-about-mammogram.html",
      "Title": "Help! Letter about Mammogram!"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "My prayers support both of you! Nancy",
      "MessageIndex": 41,
      "PostDate": "26/12/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/342817-bi-rad-3-biopsy-surgery.html",
      "Title": "Bi-Rad 3 Biopsy and/or surgery?????? 1 2 3 4"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Thanks for relieving my mind ladies! I am feeling a little better about it now. They are mailing me an order for an ultrasound and a diagnostic mammogram, so I guess I'll have more info soon. She used the word \"mass\" in my breast today and that kind of threw me for a loop, but she calmed me by telling me its quite common for this to happen. Again, thanks to both of you! Nancy",
      "MessageIndex": 3,
      "PostDate": "09/07/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/188554-help-letter-about-mammogram.html",
      "Title": "Help! Letter about Mammogram!"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I agree that if for no other reason than for peace of mind, I would at least ask about the biopsy. I am not sure what my reading was, but a year and a half ago I had something suspicious turn up on my mammogram. The ultrasound did not resolve the issue. Even though the radiologist said my chances of cancer were less than 1 in 10, they recommended a biopsy as did my gyn. I went ahead and had it and it was not nearly as bad as I had feared it would be. I also had the results (negative as expected thank God) in two days, which was sooner than I expected. I had what is called a stereotactic core biopsy. Let us know what you decide to do. Nancy",
      "MessageIndex": 3,
      "PostDate": "21/11/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/342817-bi-rad-3-biopsy-surgery.html",
      "Title": "Bi-Rad 3 Biopsy and/or surgery?????? 1 2 3 4"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "Great news! Cannalee, I hope all is OK with you and your husband! Nancy",
      "MessageIndex": 44,
      "PostDate": "28/12/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/342817-bi-rad-3-biopsy-surgery.html",
      "Title": "Bi-Rad 3 Biopsy and/or surgery?????? 1 2 3 4"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I just got back on after several days. I will be thinking of you and praying for you. The stereotactic is not really bad at all and your chances of cancer are low. Even if it is cancer, it sounds like it is being caught very, very early! Let us know. Nancy",
      "MessageIndex": 20,
      "PostDate": "01/12/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/342817-bi-rad-3-biopsy-surgery.html",
      "Title": "Bi-Rad 3 Biopsy and/or surgery?????? 1 2 3 4"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "I am praying for you now that it is NOT cancer. I know this is a scary thing. I can totally relate. The day I called the doctor for the results I could hardly breathe while I waited for them to come back to the phone. Please do not worry about the procedure. I was terrified too. I was up until 3:30 A.M. the night before the procedure and called at least five different friends because I was so nervous. If I had known what I know now I would never have been so concerned. I would not want to repeat it, but it really wasn't bad at all. They compress you as if you are in a mammogram and that is a blessing. You barely even feel the numbing shot. I am not exaggerating at all. The people in these departments also tend to be very compassionate and will make sure you are totally comfortable throughout the procedure. Please try not to worry. It truly is not worth it! Good luck! Nancy",
      "MessageIndex": 22,
      "PostDate": "03/12/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/342817-bi-rad-3-biopsy-surgery.html",
      "Title": "Bi-Rad 3 Biopsy and/or surgery?????? 1 2 3 4"
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "You could get a second opinion if it would make you feel better, but I think that nowadays the way medical professionals need to cover themsevles, that if it were something they were very suspicioius of, they would insist on a repeat mammogram and possibly even an ultrasound now, not in six months. Most of these cases are not cancer (I had a very similar result with mine last summer and ended up having to have a biopsy which was clear and more than 9 out of 10 are), but with your family history it might make sense to get another opinion. You certainly don't need additional stress on top of everything else and that is what you will probably have if you don't get an answer soon. Or, it might be helpful to set up an appointment with your GYN and have a conference with him so that he can explain everything in detail concerning your recent mammogram and why they feel its OK to wait six months. Take care and let us know what you decide to do. Nancy",
      "MessageIndex": 1,
      "PostDate": "24/07/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/307016-mammogram-results-have-me-concerned.html",
      "Title": "Mammogram results have me concerned."
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "You're welcome! Having gone through a scare myself I know how you feel! Let me know what your doctor says. Nancy",
      "MessageIndex": 3,
      "PostDate": "24/07/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/307016-mammogram-results-have-me-concerned.html",
      "Title": "Mammogram results have me concerned."
    },
    {
      "AuthorID": "BioAdoptMom3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BioAdoptMom3",
      "Content": "It sounds like they are quite confident and I am sure it makes you feel better to hear that. I will keep you in my prayers. Nancy",
      "MessageIndex": 5,
      "PostDate": "28/07/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/307016-mammogram-results-have-me-concerned.html",
      "Title": "Mammogram results have me concerned."
    }
  ]
}