{
  "AuthorID": "BlueLemonade",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BlueLemonade",
  "Posts": [{
    "AuthorID": "BlueLemonade",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/BlueLemonade",
    "Content": "About a month ago, I figured out, through a strange series of events, that I was iodine deficient. I started taking a multivitamin plus extra iodine and it's been nothing short of a miracle what's happened since. Shockingly, my ever growing breast lumps that I've had the past two years have nearly completely disappeared! So here I am to share my story, in case it could help someone else: Two years ago, I went to see my OB because I noticed a marble like lump in my right breast. While I was there, I mentioned that I also had completely lost my sex drive. Also my periods had changed over the past year. Instead of 30 days apart they were only 25 days apart, which I found to be quite annoying! And also, I was dry as a bone down there. I was nearing my 40th birthday, and I asked her if she thought I was peri-menopausal? She didn't pay much attention because she was feeling the lump and looking very concerned about that. Who cares about sex drive when you might have cancer? She told me I needed a mammogram and an ultrasound. The mammogram and ultrasound ultimately led to me needing a biopsy of the lump in my breast. I was pretty terrified. The procedure went much better than expected. I felt no pain at all. It went better than most of my trips to the dentist for filling replacements. And the people were so nice. I had to wait a week before getting the news that it was a fibroadenoma. Phew, I thought I was in the clear, and would move on with my life. Maybe I'd finally get my OB to talk to me about my periods, lack of sex drive, and lack of lubrication. Instead though, at my 6 month follow up, there was another lump. Another ultrasound, and they wanted another biopsy. The original lump had come back and was even bigger. I felt like my boobs were taking over my life. My doctor didn't care about anything else. I could now see my future of having biopsy after biopsy, and scare after scare. I couldn't figure out why these lumps were happening. I'd always had \"fibrous breast tissue\". Once when I was in my early twenties I had a large lump but it went away by itself. I hoped that in time these two lumps would also go away on their own. But six months later, now one year after the original biopsy, I had THREE lumps. At that visit, I saw a new radiologist who didn't share the same doom and gloom \"biopsy everything just in case\" view as the other radiologists I'd seen in the past. He said it's likely these are all fibroadenomas and we can just watch them for another six months. That was about 9 months ago. I ignored the 6 month ultrasound reminder letter for a while, distracted instead by my worsening allergies. This past Spring, my allergies and specifically, sinus congestion and a daily constant headache were worse than they had ever been before. My allergist suggested it could be thyroid related. I scoffed at that idea. I had none of the symptoms of a thyroid issue - no fatigue, no weight gain. I had cold feet, and that was about it. I had my TSH checked by my OB and it was normal, but my cholesterol was high and so was my bilirubin. Well, it turned out that I WAS hypothyroid. VERY hypothyroid. I didn't have fatigue because I was taking pseudophedrine all the time for sinus congestion. Incidentally, this also affects your appetite and was probably why I didn't gain weight. And my TSH was artificially normal because I drank tea. Yep, that's right. Tea. Green tea, black tea, or white tea all contain fluoride, which your body thinks is iodine and tries to use that for thyroid hormone synthesis. It makes your TSH normal, BUT your body can't actually use that hormone that is made with fluoride. So you are very hypothyroid but the TSH is normal. I stopped drinking tea without knowing any of this, and for completely unrelated reasons. Within three months my period was back to a more normal 30 days. That's when I made the connection and started research tea. When I read more about tea and fluoride, I realized I probably needed to take iodine. I added a multivitamin and iodine a month ago, and after only a few weeks, everything started getting better. My sinus congestion is gone, my sex drive is back, and I'm not dry as a desert down there anymore. Yay, it's not early menopause! It's only been about 5 weeks on iodine, which I have slowly increased to 12.5mg a day, and my breast lumps are undetectable to the touch now. They were as big as nickels and quarters before. It was so bad I could feel one of them by just brushing my arm against it. There is a lot more information about this out there if you search for it. Breast Cancer Choices is a good place to start. We owe it to each other to spread the word about this stuff. I hope this helps someone else. It makes me so sad that my OB didn't recognize what was happening with me despite all of the signs: high cholesterol, period changes, and low sex drive are all characteristic of a low thyroid. And more people need to know about tea. It's advertised as such a health drink, because of the phytonutrients, but it also contains high levels of aluminum fluoride, much more than most people think. Old studies relied on an electrode to measure fluoride in tea, but weren't able to account for the fluoride compounds like aluminum fluoride. That means tea contains much more fluoride than previously thought. And the longer you steep the tea bags the more aluminum and fluoride you get in your tea. And iodine. Many articles online suggest iodine deficiency is a thing of the past. But in the 80's bread makers stopped using iodine as a preservative, and we are all getting much less iodine in our diets than previous generations did. Japan regularly consumes 15mg of iodine a day due to seaweed consumption and they have the lowest rates of breast cancer in the world. Take a look at your diet and make sure you're getting your iodine from somewhere. I just had my cholesterol rechecked and it has dropped 60 points since stopping the tea and taking iodine. Also my liver bilirubin improved 50%! Please, don't drink tea, at least not every day, and make sure you are getting iodine. If you have cold feet, get your thyroid checked, and don't let them stop with only the TSH test. The thyroid affects everything from your heart to your vision, your digestion and your fertility, and more. Thanks for reading and best wishes to you, Blue Lemonade",
    "MessageIndex": 0,
    "PostDate": "03/09/2015",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1008872-success-my-breast-lumps-shrinking.html",
    "Title": "Success: my breast lumps are shrinking"
  }]
}