{
  "AuthorID": "breakerfall",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/breakerfall",
  "Posts": [{
    "AuthorID": "breakerfall",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/breakerfall",
    "Content": "I'm 29 years old and have been suffering from upper abdominal pain, nausea, and fatigue for the last 6 months. I've had every single gastro test done (and blood tests), and all has come back normal. However last week I had an abdominal CT scan (a sort of last resort) and my gastroenterologist made mention that the only thing they did find was that my (para)aortic lymph nodes were enlarged, but still in \"normal\" range. He says it has to do with my immune system and kinda left it at that. It almost sounded like he didn't know what to make of it, but felt it was significant enough to mention it. Also that I shouldn't be alarmed because they are still in \"normal\" range, tho close to being \"abnormal\". I started doing some research as to what could cause them to become enlarged and if there is a link to all of my abdominal problems. But all I can find is that it is a typical symptom of gynecological, pancreatic, or lymphatic cancer. My last pelvic exam was in January and that came back normal (abdominal symptoms began in June). I don't have excruciating periods, altho I'm on the pill which probably helps. I do get the diarrhea episodes during my cycles as someone else posted about earlier. I would like to investigate these findings further just to rule out any possibility of early stages of cancer, as well as hopefully putting a name on my illness. But I'm really not sure where to turn, and if my doctor will be willing to refer me to someone to investigate it when it apparently isn't something \"signficant\". Obviously something isn't right in my body if they are enlarged - regardless if it's still in \"normal\" range. How long do I wait to be retested to see if theyre \"abnormal\". My question is: Has anyone here who has been diagnosed with a form of gynecological cancer had abdominal problems as well as enlarged aortic lymph nodes? Also what is the procedure for diagnosing? Thanks in advance - Amy",
    "MessageIndex": 0,
    "PostDate": "25/10/2002",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24743-enlarged-aorta-lymph-nodes-cancer-link.html",
    "Title": "enlarged aorta lymph nodes - cancer link?"
  }]
}