{
  "AuthorID": "bstmama",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bstmama",
  "Posts": [
    {
      "AuthorID": "bstmama",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bstmama",
      "Content": "Ok so for going on 3 weeks I have been going through test after test. First a mammogram, which came back abnormal, so I am going in for round 2 on that, along with a ultra-sound. Then I had blood work, and a urinalysis. Today they call and say I have extremely low white blood count and need to have another blood test, and then see my Dr. Should I be worried?",
      "MessageIndex": 0,
      "PostDate": "10/04/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/685893-low-white-blood-count.html",
      "Title": "low white blood count"
    },
    {
      "AuthorID": "bstmama",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bstmama",
      "Content": "shisslak- thank you for your kind words. I appreciate that a lot. Went for my other mamogram, and for the ultra sound. I have 3 lumps, 2 small, 1 rather large one, that is up close to my armpit(they are very sore). They didn't determine what they are if they are benign or not. They want to see me in 3 months to see if they have grown. Seems kind of odd to me that they would wait another 3 months, but they said this was normal???? Also, white blood count is still low, have to have that re-checked in another 7 days. I am getting rather frustrated with all the lab work, as it is tough to get blood out of me- my arms are soooooo bruised from them poking around only to be disappointed and having to try another spot!! Getting blood takes longer than the mamogram!! I also have been loosing my hair. The docs told me to take pre-natal vitamins. Seems easy enough. Has anyone had luck doing this, for hair loss? Maybe it will help my skin and nails too?",
      "MessageIndex": 2,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/685893-low-white-blood-count.html",
      "Title": "low white blood count"
    }
  ]
}