{
  "AuthorID": "bull379",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bull379",
  "Posts": [
    {
      "AuthorID": "bull379",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bull379",
      "Content": "The left breast is actually better but I can't tell any difference in the right. It is still extremely hard behind the nipple. Hopefully, the antibiotics are working. Just finished them. I have an appointment with my doctor on 2/5. If not better then maybe he can figure something else out.",
      "MessageIndex": 4,
      "PostDate": "22/01/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/464201-green-discharge.html",
      "Title": "Green discharge"
    },
    {
      "AuthorID": "bull379",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bull379",
      "Content": "Surgery went ok. Sore as heck. I freaked out a little bit when I finally removed the bandages. It's strange to see your breast cut open. They didn't stitch it closed. I have to let it heal from the inside out. Doctor said that this was the hardest of the types of breast infections to get rid of but thought maybe it won't come back.",
      "MessageIndex": 9,
      "PostDate": "08/02/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/464201-green-discharge.html",
      "Title": "Green discharge"
    },
    {
      "AuthorID": "bull379",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bull379",
      "Content": "I have been having a green discharge from my left breast. Now both of my nipples are hard and sore. It feels like the size of a marble behind the nipple. I went to the doctor who examined me and said it may be the beginning of mastitis. He didn't seem too concerned. Everything I look up on mastitis talks about breast feeding. I'm 43 and had my last child 12 years ago. This is not the first time I've had this. I had mastitis in my left breast a little over a year ago. I have a mammogram scheduled for 2/22. I'm just worried that this is something more than mastitis since it keeps happening and is now in both breasts.",
      "MessageIndex": 0,
      "PostDate": "20/01/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/464201-green-discharge.html",
      "Title": "Green discharge"
    },
    {
      "AuthorID": "bull379",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bull379",
      "Content": "OK. The antibiotics cleared up my left breast but not the right. No discharge in right breast but now my nipple is huge. NO pain but very annoying. Called doctor and he gave me another round of antibiotics. They had told my it was possibly mastitis. Now I'm beginning to wonder if it's not an abcess. I have an appointment with the doctor on Monday. I had mastitis before and this is nothing like it. Before I had a fever, my skin was streaked red and then it blistered and peeled. Have had none of that. I have to watch what I wear because it is very noticeable if I wear anything that is very fitting. Trying not to worry but the antibiotics should have cleared it up if it was an infection.",
      "MessageIndex": 5,
      "PostDate": "30/01/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/464201-green-discharge.html",
      "Title": "Green discharge"
    },
    {
      "AuthorID": "bull379",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/bull379",
      "Content": "I went to my OB-GYN yesterday. Right breast still not better. He did another breast exam and referred my to a general surgeon. Yesterday afternoon my breast was itching so I gently scratched the nipple and it starting oozing out nasty looking stuff. Not really yellow but a little darker with a lot of blood. Called my doctor back and said to just keep appointment with surgeon. Went to the surgeon today and he did the exam and said it was definitely an abcess. He said I needed surgery to remove it or else I would continue to have problems. That each time it came back it could be worse. I have surgery tomorrow to drain the abcess and he is going to remove the ducts under the aerola. Hopefully, this will take care of it.",
      "MessageIndex": 7,
      "PostDate": "06/02/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/464201-green-discharge.html",
      "Title": "Green discharge"
    }
  ]
}