{
  "AuthorID": "busymommy",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/busymommy",
  "Posts": [
    {
      "AuthorID": "busymommy",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/busymommy",
      "Content": "So how did everything turn out, MissyJoy? Fine, I bet!",
      "MessageIndex": 9,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/708331-help-mammogram-tech-scared-me.html",
      "Title": "HELP - mammogram tech scared me!"
    },
    {
      "AuthorID": "busymommy",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/busymommy",
      "Content": "Hi, all Thank you for your replies. I underwent a CT scan of my pelvis and abdomen last week. Not much fun, but the results came back negative! I'm 45 years old and have been going through perimenopause for about a year. I'm starting to believe all the changes occurring with me (feeling like I'm falling apart!), are due to this time in my life. Of course, I'm having everything checked out by my doctor, but when all is said and done, I'm going to bet nothing horrible is going to be found. I still have a ways to go with more testing, though. Nicole, how are you doing now? What a terrible ordeal you went through! Take care.",
      "MessageIndex": 5,
      "PostDate": "24/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/172966-excessive-gas-lower-back-pains-fatigue.html",
      "Title": "Excessive Gas, Lower Back Pains, Fatigue"
    },
    {
      "AuthorID": "busymommy",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/busymommy",
      "Content": "Hi, Sharon Who cares more about us than us? I say make the doctors work for you. If we don't feel well, have them run tests. Don't take the passive role. Of course, it can borderline on being kind of obsessive, but that's the way I am. I don't want to be a story of \"ignoring symptoms for years\" and then, bang! Take good care and keep us posted. busymommy",
      "MessageIndex": 2,
      "PostDate": "13/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/172966-excessive-gas-lower-back-pains-fatigue.html",
      "Title": "Excessive Gas, Lower Back Pains, Fatigue"
    },
    {
      "AuthorID": "busymommy",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/busymommy",
      "Content": "I have been diagnosed with ovarian cysts. They are the functional type, dissolve and then they come back again. I have so many symptoms I'm going crazy. The latest are excessive gas (must take an anti-gas pill almost daily), lower back pains and excessive fatigue. I've been to my primary and also a gyno. No one seems to think there's anything else wrong! I'm not convinced of this and don't know what other tests to ask for. Of course, I'm worried about ovarian cancer, but the cysts that show up are functional, not solid and no one (but me) seems to be worried. Any of you out there with the same symptoms? What have you been told? Are these ovarian cysts going to play havoc with my system forever? I feel lousy! Thanks for any input.",
      "MessageIndex": 0,
      "PostDate": "10/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/172966-excessive-gas-lower-back-pains-fatigue.html",
      "Title": "Excessive Gas, Lower Back Pains, Fatigue"
    }
  ]
}