{
  "AuthorID": "byrdleg",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/byrdleg",
  "Posts": [
    {
      "AuthorID": "byrdleg",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/byrdleg",
      "Content": "What would Disorders mean?? We are at a loss as to what to do for her. Her doctor is just guessing and trying steriods for the pain....... Thanks BYRDLEG",
      "MessageIndex": 2,
      "PostDate": "26/04/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/168358-arimidex-dangers-please-read.html",
      "Title": "Arimidex Dangers Please Read!"
    },
    {
      "AuthorID": "byrdleg",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/byrdleg",
      "Content": "Hello ALL! My mother was diagnosed last june with Ductal Carcinoma in Stiu and one infiltrating tumor. They were removed via lumpectomies. She went on ARIMIDEX for apporximately 3-4 months. She had to stop the drug as her hips and joints began hurting. She has been off the drug for 2.5 months and has gotten WORSE. SHe can barley walk or bend her fingers and she is a very young 62. Her Doctors are all baffled but told her they hate this drug and have 3 other patiens with the same thing. Women who have lost their quality of life and live in constant pain and stuggle to walk or use thier hands due to a DRUG that is being marketed as SAFE! GOtta love the drug companies for wanting to make there top dollars reguardless of the damages to the lives of the patients. Her Oncologist has suggested she contact an Attorney as they know there are many people out there with the same issues. If their practice has 3 imagine how many people nation wide may be dealing with the same thing. They have told her they do not know how to treat it or if it will be permenant. It is so odd that it would continue to progress instead of improve after stopping it and that is why the Doctors say it may be permenant! Has ANYONE out there had anthing similiar? Would love to hear from you and to those of you thinking of taking it ..............REALLY weigh your PROS and CONS!! TAKE CARE BYRDLEG",
      "MessageIndex": 0,
      "PostDate": "24/04/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/168358-arimidex-dangers-please-read.html",
      "Title": "Arimidex Dangers Please Read!"
    },
    {
      "AuthorID": "byrdleg",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/byrdleg",
      "Content": "Quote: Originally Posted by Gemi ps...Ask them which one is best absorbed, dosage. Look into osteoporosis, bc treatment and calcium supplamentation. She had a bone density done last week and it was perfect and they have her on Calcium and Magnesium. They put her on a stong dose of prednisone and it seems to be helping with the pain. Today was her last dose of that so we shall see and hope it work. Even the Doctors say it is a nasty drug that we do not know enough about! SCARY! THANKS BYRDLEG",
      "MessageIndex": 7,
      "PostDate": "29/04/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/168358-arimidex-dangers-please-read.html",
      "Title": "Arimidex Dangers Please Read!"
    },
    {
      "AuthorID": "byrdleg",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/byrdleg",
      "Content": "What would the stripes mean and what is AMYGDAKIN??",
      "MessageIndex": 4,
      "PostDate": "28/04/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/168358-arimidex-dangers-please-read.html",
      "Title": "Arimidex Dangers Please Read!"
    }
  ]
}