{
  "AuthorID": "calode",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/calode",
  "Posts": [{
    "AuthorID": "calode",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/calode",
    "Content": "Hello, I am 27 years old, no history of breast cancer in my family. I had a baby 2 months ago and have been nursing her. While pumping last week I felt a grape size lump on my left breast, 3:00/clock, closer to my nipple. It literally came overnight (I obviously have been feeling my breasts for a few months now due to feeding and never felt it before). It is about the size of a grape, feels like it is in the glandular, fatty part of my breast and is somewhat hard. It is pretty near the skin of my breast and I can feel it quite well. It does not hurt and seems to be moveable. I thought at first it was a blocked milk duct but it is not inflamed and has been there for about 2 weeks now. My family doctor was not worried and told me it is probably fibroadenoma so we had an ultrasound done. The results came back inconclusive (not sure why and how?). I had a mammogram yesterday and the lump did not show up at all on it (the technician showed me the screen and it wasn't there). I emptied my milk prior to the mammogram but I am also young so I know my breasts are pretty dense. I am getting really worried. Cysts run in my family. I got them while pregnant all in my groin and armpit area. I want to believe that's what it is but it doesn't hurt like a cyst does and seems more hard then squishy. Anyone else have this or no any information on what this could be. I am praying it is nothing serious but now I am starting to feel sick over this with worry as they can't figure it out from an ultrasound and now the mammogram.",
    "MessageIndex": 0,
    "PostDate": "09/08/2012",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/913478-27yrs-old-grape-size-lump-breastfeeding.html",
    "Title": "27yrs old: grape size lump: breastfeeding"
  }]
}