{
  "AuthorID": "CaringMom",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/CaringMom",
  "Posts": [
    {
      "AuthorID": "CaringMom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/CaringMom",
      "Content": "Thank you bbird. Sounds like you went through the same thing MIL did. That's over and now she said she started hormone treatment at a cancer clinic closer to home. Initially she was to go Monday for a consultation to begin chemo which her doctor said she would have to do. She said the doctor at this new clinic told her she wouldn't have to have chemo and started her on hormones; I believe it's oral from talking with my SIL today. Basically, it seems my MIL is like a child. We understand she is overwhelmed with this news but unless we are there asking questions...she hasn't a clue as to what is going on!!! Why would her doctor say chemo, and then a new one say no? Guess we're going to have to step in, again.",
      "MessageIndex": 2,
      "PostDate": "17/12/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/654131-mri-radiation-question.html",
      "Title": "MRI with radiation question"
    },
    {
      "AuthorID": "CaringMom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/CaringMom",
      "Content": "My MIL is about 3 hours away with my FIL beginning radiation for breast cancer. She is doing the 1 week of radiation 2x a day. This started yesterday and last night she said she will have an MRI before radiation; that's twice a day. What is the purpose of this? She has no idea and apparently isn't asking questions. They also did an MRI before and after they put the stint in. She'll have 12 total before it's over. Then she starts chemo. Why so many MRI's? Any ideas? Thanks...",
      "MessageIndex": 0,
      "PostDate": "04/12/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/654131-mri-radiation-question.html",
      "Title": "MRI with radiation question"
    },
    {
      "AuthorID": "CaringMom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/CaringMom",
      "Content": "Thanks to everyone who responded. Now these are beginning to become a little clearer. When we ask my MIL questions, she either doesn't know or refuses to discuss things. We belive she should get a third opinion but she almost ignores what is going on. If we bring the subject up; \"she has to go\". We think she doesn't want chemo and therefore is going with this second doctor. We'll see what happens when she goes back to the first for her checkup! Thanks again!",
      "MessageIndex": 7,
      "PostDate": "22/12/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/654131-mri-radiation-question.html",
      "Title": "MRI with radiation question"
    }
  ]
}