{
  "AuthorID": "carlads",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
  "Posts": [
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "I have a similar situation. I have my yearly mammograms. Just scheduled mine about 3 weeks ago for the end of October. In the meantime I found a soft lump in my left breast. Went to the Dr yesterday he tried to aspirate but couldn't get anything. Said he wanted me to see a surgeon, sent me down for a diagnostic mammogram. They told me if they needed to do an ultrasound they could do it that afternoon so I waited and had it done. Before I even had the ultrasound my Dr called and said he got the results from the mammogram and couldn't say for sure if it is cancer. He had already called the surgeon so I made an appt for Monday. The thing that has me scared is the way the techs acted after the mammo was read. This is a long weekend for me I am trying not to panic! Nobody ever told me exactly what the find was. My worry is catching it in time. Hopefully we will both have answers soon. Please let me know your outcome!! Hugs, Carla",
      "MessageIndex": 1,
      "PostDate": "20/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Dee, My news not so good. He is 50% sure it is cancer. But good news is he is almost certain it is localized. He said no need for an MRI he is going to do a needle core biospy within the week just to be 100%. I actually feel better now that there is a plan! So glad yours turned out well. I will keep you in my prayers and please keep me updated!",
      "MessageIndex": 6,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "New news. Waiting for the Dr to call and let me know when the core needle biospy would be. I hadn't heard anything so I called today and his office said they were waiting for the Radiologist to call them. She did call back and said the Radiologist may need more pictures in order to do the core biospy. Still waiting and getting worried! Any insight on this issue? Carla",
      "MessageIndex": 15,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Quote: Originally Posted by MammaDee Carla, is there any way you can get your report from them? I don't know if they'll tell you over the phone about the results so far. Mine wouldn't. I have done some research on calcifications the last couple of weeks, but without knowing what they found, it's hard to even speculate. I do know that most suspicious calcifications are benign. AND......I got my call last night. Mine are BENIGN! So I can breath again. I am sorry you are having to wait all this time for something to be done. The fact that they want more pictures isn't to me a bad thing. If they were certain everything looked suspicious, they would go straight to the biopsy, I would think. Keep us posted!",
      "MessageIndex": 17,
      "PostDate": "26/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Pat, Thank so much for the infor. They did call yesterday and I go Friday for the core needle. I am still in shock. Like I said I go every year for my mammo and when I found this I really thought it was nothing. It isn't a hard lump feels like scare tissue. My Dr did say if would have shown in my mammo this month. So I have to look at if like I am two weeks ahead of the game. No one has said what type it could be or calsifcations. He seemed very sure if was contained it it is malignant, which with all indications it is. My surgeons office has been great its the radiologist I bad to wait on. I shouldn't complain I know some woman have to wait longer. Thank you so much for the info and a thank you in advance for sharing more if you have more.. Carla",
      "MessageIndex": 20,
      "PostDate": "27/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Quote: Originally Posted by MammaDee Actually I haven't done it yet....I couldn't sleep, so I just got up to wait. Thanks for the info. : ) Carla, I'm sorry your progonosis was 50/50. Did they say what type of cancer it usually is, should it come back malignant? And it could still very well be benign, too! I know 50/50 is scary......but the odds could have been worse, too, kwim? Take it one step at a time. I agree that knowledge is power. I want to know what I'm dealing with, might possibly be dealing with and what the plan is. The worst thing my surgeon said was it could come back in the middle. Not benign, but not 100 percent sure of malignancy. No thank you to that! I'll let you guys know how it goes today. For right now, I just wish I could have some coffee and a dounut! Dee",
      "MessageIndex": 11,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Dee, I will be thinking about you and saying many prayers as well. I have done so much re-search this weekend my head is spinning. I will post as soon as I know more. Prayers! Carla",
      "MessageIndex": 3,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Dee, Sorry they never really told me calcifications. I was just commenting on the fact the neither of us knew for sure what they were seeing. They haven't told me what exact type of cancer just that they thought it is contained and I have no signs of it spreading anywhere. Still waiting to hear about my biospy. How did it go today? I think I told you they are going to do a needle core biospy. Keep us posted!! Hugs Prayers, Carla",
      "MessageIndex": 10,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Dee, We didn't hear from you yesterday. Hope all went well. I am still waiting on a call from my surgeons office to schedule the core biospy. Been thinking about you! Prayers, Carla",
      "MessageIndex": 12,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Good I am glad you are doing well, keep us informed and if I don't get a date today I will call tomorrow... Take it easy and rest. Prayers, Carla",
      "MessageIndex": 14,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Dee, I am so happy for you!! I know you must be relieved. I will call again today. I can't go through another weekend like last weekend. My body is in knots and every little ache and pain that I have had for years scares the heck out of me.. I will keep you posted. Have a wonderful weekend, Carla",
      "MessageIndex": 18,
      "PostDate": "26/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    },
    {
      "AuthorID": "carlads",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carlads",
      "Content": "Dee, Thank you so much! Carla",
      "MessageIndex": 22,
      "PostDate": "02/11/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/923713-suspicious-breast-calcifications.html",
      "Title": "Suspicious breast calcifications 1 2"
    }
  ]
}