{
  "AuthorID": "carole27",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carole27",
  "Posts": [
    {
      "AuthorID": "carole27",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carole27",
      "Content": "Thank U So Much For Responding To My Medi Port Question. I Can Only Thank God That I Don't Think I'm Doing As Bad As You Have Been. My Left Side Is Already Starting To Feel Alot Better Except For The Sensation From My Elbow To My Under Arm. As For The Port I Wish My Oncologist Had Better Explained It To Me & Had Also Taken Into Consideration The Size Of My Remaining Breast (dd). I Think That This Is Where Most Of My Discomfort Is Coming From. Also, I Was Told The Port Would Be Under The Skin. Well It Is Under The Skin But Bumped Out. I Believe I Would Have Preferred To Be Pricked On Easch Vist Rather Then To Have The Discomfort Of The Port. Aren't We All In Enough Discomfort Without Having To Endure Something That Is Really Not Necessary. I Wish All Of Our Drs Would Better Infor Us. Again Thanks & God Bless. Carole",
      "MessageIndex": 7,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/545190-pain-medi-port.html",
      "Title": "pain from the medi port"
    },
    {
      "AuthorID": "carole27",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carole27",
      "Content": "thank u for ur response to my medi port question. i'm just surpirsed that the dr said i would be in pain for a \"few days\" & here it is 5 days later & i can hardly move my arm away from my side. good luck to u also. carole27",
      "MessageIndex": 2,
      "PostDate": "23/10/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/545190-pain-medi-port.html",
      "Title": "pain from the medi port"
    },
    {
      "AuthorID": "carole27",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carole27",
      "Content": "Thanks So Much For Responding To My Medi Port Question. I Think If I Had Known Better I Would Have Turned Down The Port. It Is Extreamly Uncomfortable All Day & Night. In The Day The Pain Is From My Large Remaining Breast Pulling On It & In The Night It Is Partly The Same Plus Positioning To Try & Get Some Sleep. Good Luck To U & God Bless. Carole",
      "MessageIndex": 6,
      "PostDate": "25/10/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/545190-pain-medi-port.html",
      "Title": "pain from the medi port"
    },
    {
      "AuthorID": "carole27",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/carole27",
      "Content": "4 weeks ago i had my left breast removed along with 23 nodes. the area is still very swollen. does any one think this is normal? this past thursday i also has a medi port inserted on the right side just below the collar bone. today is sunday & the area is still very sore & it is difficult to move my arm properly. (such as raising it to wash my hair in the shower or fed myself) (i have a feeling this may be because the right breast is so large (dd) that the site can not handle the weight). has any one else experienced this problem? if so what do you think the long term pain will be or do you think the posr should be removed? one last question. is it very painful to take chemo treatment without a port? thank you all for your advise & GOD bless all of us. carole27",
      "MessageIndex": 0,
      "PostDate": "21/10/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/545190-pain-medi-port.html",
      "Title": "pain from the medi port"
    }
  ]
}