{
  "AuthorID": "chis",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/chis",
  "Posts": [
    {
      "AuthorID": "chis",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/chis",
      "Content": "I am 51 and radiologist found a change in my calcifications with this years mammo. They were many, clustered, pleomorphic and slightly rounded. Report said possible papillary lesions. So I went on to have the stereotactic and was called on my cell phone when I was shopping from the Dr. who did the stereotactic biopsy that it was BENIGN but atypical cells. I just jotted down the name of the surgeons she recommended and wasn't able to ask any questions being in the store. My gyno wasn't in that day and I don't know what the report said. Is it very good that the tissue they biopsied was benign and maybe when they go to take more tissue it will also be benign but just atypical. She said I think that there were two area. Will my breasts be deformed afterwards. Im still recovering from the stereo with big black n blue marks. Since I don't have a \"lump\" how much tissue do they know to take? I'm just so confused and scared. Mostly I'm scared that even though I always got my yearly mammo that they will find it was the type that spread and I'll have to have all different tests on my lungs etc. Can someone please calm me down and explain these things I don't understand. Thank you all so much for any info .",
      "MessageIndex": 0,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/722560-stereotactic-now-excisional-biopsy-question-please.html",
      "Title": "stereotactic now excisional biopsy question please 1 2"
    },
    {
      "AuthorID": "chis",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/chis",
      "Content": "Thank you for writing. I'm glad everything turned out well after all of this. I can't even believe it got to this point for me. Thought I'd just go in for 2nd mammo call back and that would be it. I'm 51 and going through perimenopause. Wondering if the change in hormones might of been the cause for the changing microcalcifications. I'm wondering if there is a difference between and incisional and excisional biopsy. I only have my appt. with the surgeon next Tuesday and in the dark about everything. I will be picking up my pathology report at my gyno's tomorrow and hopefully he will call that day also to explain all my questions. Like I said the Dr. called me on my cell phone when out shopping and I was too shocked to ask her any questions. Also I'm wondering if any other treatment is necessary after this biopsy and it is benign or just more atypical cells will be found. What happens if next year I have the same thing on mammo? I will be asking all these questions also when I see surgeon but I hate this wait again. Thank you so much again for writing.",
      "MessageIndex": 2,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/722560-stereotactic-now-excisional-biopsy-question-please.html",
      "Title": "stereotactic now excisional biopsy question please 1 2"
    }
  ]
}