{
  "AuthorID": "cjammom",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
  "Posts": [
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Dear Lady..so sorry to hear of your diagnosis of breast cancer. I am a 4yr survivor..I had a mastectomy and 8rounds of chemotherapy..no radiation for me..I was stage IIb grade 3, Invasive ductual cancer with one positive lymph node..I have not had any evidence of disease since the original diagnosis..I have taken hormonal therapy and will continue that until I have a total of 5yrs on those. You have a very tough decision to make...have you gotten all of the information from your doctor as far as length of time..recovery..and side effects..How long do you have to make this decision? I wish you well on your upcoming surgery..when is that? Please come back and post Lady, let us know how you are doing, Okay? Bless you, hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "27/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/537578-trying-decide-radiation.html",
      "Title": "Trying to decide on Radiation"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi JOJO, I too have had bc..a 4yr survivor..Just wanted to say hi.. Sorry that you had to go through that..I had a mast. also..its a tough thing. Are you starting any kind of treatment? chemo or rads? I did just chemo, then took tamoxifen and am now on arimidex. I havent had any recurrances, and count my blessings every day.. Hope your feeling well Keep in touch if you can, cj",
      "MessageIndex": 9,
      "PostDate": "18/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488748-armpit.html",
      "Title": "Armpit"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Phyl, No matter what, you just keep on fighting!! I have heard the same said about my bc., cant let that get you down..We are all different, everyone responds differently to treatments.. We just hope and pray that all these drugs will rid us of this beast of a disease.. Hang in there, hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "06/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/505773-her2-positive.html",
      "Title": "her2 positive"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "thats it phyl..You just keep thinkin postive!! way to go!! lots of hugs, cj.",
      "MessageIndex": 4,
      "PostDate": "07/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/505773-her2-positive.html",
      "Title": "her2 positive"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Sarah, so sorry to hear about your mums cancer..I am a 4+years breast cancer survivor myself but of a different kind. The best advice I can offer you is to search around the internet..there are sites out there where women with IBC support one another and their families..I know from my own experience, that someone who has already been where you find yourself now..can offer alot of good info, support and kindness.Both you and your mum could greatly benefit from that. Its an awfully scary journey for you both..my heart goes out to you. hugs, cj.",
      "MessageIndex": 4,
      "PostDate": "18/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/533331-ibc-inflammatory-breast-cancer.html",
      "Title": "IBC-Inflammatory Breast Cancer"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "OOPs sorry Bernice..I dont really have anything else to add..Just glad that you are getting it checked out! Keep up the routine mammo's and the self exams, they are important for early detection!! Please keep us posted, cj",
      "MessageIndex": 10,
      "PostDate": "18/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488748-armpit.html",
      "Title": "Armpit"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Sorry JOJO, I hadnt seen your reply here. You must have really just had the surgery then..make sure you do those exercises that the surgeon gave you ..they are so important to gain back the movement in your arm.. Can you tell me about your diagnosis? I had IDC estrogen only slightly positive, pr-,her2-, 33 nodes removed with one positive. I did ACT, adriamycin, cytoxin and taxotere, 8 rounds. I was then on tamoxifen ( given to premenopausal women who are estrogen +) for 2 and a half years..I was then switched to an AI (aromatose inhibitor) aromasin for one year, but because of undesirable side effects I have switched to another one of the AI's arimidex...have been on it for about a month and so far feeling better than when I was on aromasin..I will continue with this until I have completed a total treatment of 5yrs. and then see what is available at that time...there have been so many advances in breast cancer, survival rates are much better than they ever were..I plan on living a wonderful, long life! jojo, 4YRS have past, and I still cant believe that I have been through all of this..but there is life after cancer treatments..and I have so slowed myself down..and take time to smell each rose along the path..in that way, I feel very lucky.. You sound like your at a good place..good for you! hugs.. take good care of yourself, stay in touch cj",
      "MessageIndex": 13,
      "PostDate": "20/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488748-armpit.html",
      "Title": "Armpit"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Great that you took the time to post that important information!! I dont think many women know that a rash can signify suspicion of Inflammatory breast cancer..Its always better to be armed and educated with information!! Im so sorry for your mom..I too have had bc, almost 5yrs ago..Its not an easy journey and to have a recurrance is something we all dread. And how are you doing..must be had on you too. Im saying a prayer for your Mom. Come post from time to time and let us know how you both are doing.. Thanks so much for posting hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "12/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/533331-ibc-inflammatory-breast-cancer.html",
      "Title": "IBC-Inflammatory Breast Cancer"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Red..been there done that myself..I am a 4yr survivor. I tried effexor, prescribed for me because of terrible hot flashes..it did work!, but I didnt care for the way it made me feel..very,very tired..but everyone is different..it may work better for you! I presently take elavil, its a mild antidepressant, I take it because I have alot of leg pain, most probably caused by chemo. It also helps with sleep...it had been working beautifully, until recently..as soon as summer is over I plan on going back to the rheumie who prescribed it and figure out what to do next! I hate taking medications also, so I know how you feel..but spending even part of the day, weepy and depressed isnt fair either! Do you, and can you exercise regularly? I make sure I get to the gym almost everyday, and it really helps! the endorphins your body makes while exercising really helps fight off depression..I feel much better after a good workout! Maybe if you dont already do it, you can start with some walking.. I wish you the best! stop in whenever you can and let us know how youre doing..okay? hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "28/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/527814-ssris-effexor-depression-w-tamoxifen.html",
      "Title": "ssri'S - EFFEXOR, FOR DEPRESSION W/ TAMOXIFEN"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Carole..I dont want to frighten you..but I had a terrible problem with my port..and it only happens rarely..but it needed to be removed..it is called superior vena cava syndrome..the port actually collapsed the vein leading to the heart, so the blood pumped up to my head, but had no place to go..it needs immediate attention..the symptoms for me were: red face, swollen face, shortness of breath, heavy chest feeling..my port was never comfortable from day one..if you still have pain with it..insist on an xray-it can detect what I had.. hope its nothing...just normal healing..but do look into it if your still in pain. hugs, cj.",
      "MessageIndex": 8,
      "PostDate": "30/10/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/545190-pain-medi-port.html",
      "Title": "pain from the medi port"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Red..so sorry that you are going through all this, and with a new marriage too. Yes, I do get many of the same symptoms that you have..and then some more too! It wouldnt be right for me to tell you what you should do, so I wont, I will only tell you what I would do for myself. I would also go to therapy, which I have, and that made me feel better about many things that were bothering me..and as much as I hate taking any meds..I would have to give it a try..I have done that twice since my diagnosis..both times I felt that what I was feeling directly influenced my moods and behavior..and at that time I felt that my relationships suffered..with my hubby and kids..for me that was the right decision.. Only you can make that decison..do whats right for you..maybe speak to your therapist about that.. I wish you well...It isnt an easy decision for anyone.. hugs to you, cj.",
      "MessageIndex": 3,
      "PostDate": "29/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/527814-ssris-effexor-depression-w-tamoxifen.html",
      "Title": "ssri'S - EFFEXOR, FOR DEPRESSION W/ TAMOXIFEN"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Red...you sure do have alot of stress going on..I have a 20yr old daughter, and I can only imagine what it would be like to watch her go through all that..it must really hurt you. I am so sorry that this disease has invaded the both of you..Cancer really stinks!! Please Red..try not to be so hard on yourself..okay? You have, and contine to go through so much..the weight you carry on your shoulders right now is tremendous..but trust me, things do get better..as time goes on it does become easier to put some of it behind..I can actually have days go by now that I forget about having had cancer..and I pat myself on the back for getting through it all..So Red, give yourself a pat..youve done well!! hugs to you both, cj.",
      "MessageIndex": 7,
      "PostDate": "01/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/527814-ssris-effexor-depression-w-tamoxifen.html",
      "Title": "ssri'S - EFFEXOR, FOR DEPRESSION W/ TAMOXIFEN"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hey now thats the spirit Red!! We only have one life, live it to the fullest!! Wishing you peace Red..for you and your family.. Keep in touch!! hugs, cj.",
      "MessageIndex": 9,
      "PostDate": "03/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/527814-ssris-effexor-depression-w-tamoxifen.html",
      "Title": "ssri'S - EFFEXOR, FOR DEPRESSION W/ TAMOXIFEN"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Dear Sister..just my two cents but for me..NO WAY,NO HOW will I stop from getting my yearly mammo's. I first started at the age of 35 because I had cystic breasts and a slight family history of the disease..Had it not been for my mammo in 2003..well, I dont even want to consider that! I was diagnosed with breast cancer that year..stage II, I didnt feel a lump, nor was one felt by my gyn..picked up only by mammo. So I will continue, every year to have my mammo..and will insist that my 20 yr old daughter have one early on as well.. In my opinion everything has a potential risk..its just up to you to decide if the risk is worth the benefit! wishing you the best, cj.",
      "MessageIndex": 1,
      "PostDate": "16/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/499762-mammogram-risk-radiation.html",
      "Title": "Mammogram Risk of Radiation"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi sister..everyday its something new..one day something is good for you, and the next its not. It would be interesting to hear what it is that they suggest instead for breast cancer detection without the risks..I wonder if there is even an answer. So happy to hear about your friend, another survivor..always a joy to hear that!! have a great weekend cj.",
      "MessageIndex": 3,
      "PostDate": "17/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/499762-mammogram-risk-radiation.html",
      "Title": "Mammogram Risk of Radiation"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Red..I know how hard things are..and its really tough being positive all the time! sometimes, as much as we try...we feel that way, and I know of many women who have gone through this breast cancer journey who feel the same, and for some medication seems to be the answer. I would suggest that if you do start an anti-depressant..ask that you start with the lowest possible dosage..especially given the fact that you have had some problems in the past. Red, vaginal dryness is a common side effect.. I have spoken to my gyn, and onc about it and KY lubricant was suggested..I prefer the warming gel.. It is sold over the counter, so you can pick it up without a prescription..but do speak to you doctor about it just to make sure its right for you. hugs, cj.",
      "MessageIndex": 5,
      "PostDate": "31/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/527814-ssris-effexor-depression-w-tamoxifen.html",
      "Title": "ssri'S - EFFEXOR, FOR DEPRESSION W/ TAMOXIFEN"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Beepie, Ive been there! Its been 4yrs since my diagnosis..I have IDC (infiltrating, invasive ductal carcinoma) I am er5%pr-her2-, one positive node. Sorry that youve been diagnosed with this beast of a disease..but Beepie, they have come along way with treatments..many no longer get sick like they used to with chemo..many people even continue to work..I had some leg pains, mouth sores (which they have a wash to treat) and fatigue. I chose to have a mastectomy, but was told that I would do just as well with a lumpectomy..I didnt want to have radiation, which I would have had with a lumpectomy, and that is what I based my decision on..but everyone is different and there are no right or wrongs here..I say..just follow your gut..If your spiritual at all, a few prayers help too!! It took 6weeks to heal from the mast., at that time I chose not to have reconstruction, but did so 2yrs later when I had expanders put in which were later exchanged for an implant..if you choose a mast, and recon right away, they will perform a skin sparring surgery for you. Beepie, If you have any other questions, feel free to post, or if you just need to vent..you can do that too!! We all understand, weve at some point experienced those feeling too.. The ladies I have met on this site are absolutely kind and supportive. Good luck with your appt on Wednesday..Oh, bring a notebook and pen, take notes..there is just so much info to grasp, and your brain wont be able to remember it all, with so much to think about.. Let us know how it goes, Bless you, hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "25/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/511174-ductile-carcinoma.html",
      "Title": "Ductile Carcinoma 1 2 3"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "sure Beepie, Mine was 1.5cm, but according to my path report there was also another area, which apparently the mammo had not detected..after surgery my doc said \"its a good thing you choose a mast, because there was other cancer elsewhere\". Thats just my experience, everyone has their own, but just thought I should share that info with you.. I have read recently that women should have an mri following sugery, again this wasnt offered to me, but I can now understand what a positive that would be. Being that your cancer is hormone positive, which means that estrogen fed the tumor, allowing it to grow, they probably will put you on tamoxifen or one of the ai's, aromasin, arimidex or femara, all depending on whether you are pre or post menopausal at that time..some women talk an injection to shut ovarian production, and others like myself choose a hysterectomy. I stopped menstuating for over a year after chemo, thats why I started on tamoxifen, and after 2yrs had the surgery and switched over to aromasin, after having some issues with side effects, I then switched to arimidex which, for me, doesnt seem as bad. My sister in law, who takes femara has been on it for 7yrs and is still continuing...my onc told me that I will have a total of 5yrs hormonal therapy(I have one year to go) and unless further studies indicate benefits of continuing..he will take me off after the full total 5yrs. Beepie, I know its all confusing..but your doing a great job!! You are taking charge, investigating and learning so you can make the best decision for you.. and you are arming yourself with info that will help you! Anything at all that you want to ask is fine...there really arent any limits..I came here and continue to come so that I can offer help from my experiences..I didnt seek out that kind of help,but recently, Ive found many sites on the internet, for getting good info, kindness and places where I can express my feelings and concerns, and other women would know exactly how I felt..and that is an awesome feeling!! I am only sorry that I didnt look around earlier on..like you from the beginning.. Thinking of you Beepie!! hugs, cj.",
      "MessageIndex": 6,
      "PostDate": "26/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/511174-ductile-carcinoma.html",
      "Title": "Ductile Carcinoma 1 2 3"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Beth, I just hate when docs do that..my daughter who is 20 needed to have a biopsy recently of a node found in her thyroid, I had done the same thing you are doing now..gotten lots of info from this board and other sites which I read from the internet....so when I spoke with that doc, I asked questions and he wanted to know where I got my info from..I told him, wow did he look down on me!! even my daughter said as we left that she couldnt believe how he treated me!! Needless to say, I will never, ever go back to him again!! oh ps. the nodule is being watched..so far, everything is good. You just keep on asserting yourself..Its your body!! Your life!! I used to be a pushover in the doctors office, not me, not anymore!! So, good for you Beth!! I have heard of mammosite, but cant offer any info on that, sorry. Let me know what you find out, I would be interested in hearing about it. Sounds like your cancer was probably found early..YIPEEEEEE..as far as tamox or other drugs they may have mentioned, those stop estrogen from reaching the breast..that will be your decision, whether to take them or not..lots of good info out there..but rememeber when you read about the side effects-everyone is so different..you may have no ill effects at all. Like I said Beth this is the toughest part..I too went for counselling following my diagnosis, and it was a huge help!! It helped to say the words, feeling these feelings are tough, but saying them is sometimes even harder...but once they are out..for me...it was such a weight off my shoulders, lots of tears..so bring tissue.. Beth, coming here has been very helpful to me too! and Im keeping my promise to the man upstairs...GOD, that I would try to help others going through this..and be as supportive as I could. There is such a strong bond felt with others battling this disease...we are all part of a group that we never wanted to join, but I have found them to be some of the kindest, sweetest, and loving people that I have ever met!! Keep posting, let me know how everything is going! cj.",
      "MessageIndex": 8,
      "PostDate": "27/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/511174-ductile-carcinoma.html",
      "Title": "Ductile Carcinoma 1 2 3"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Beepie, I understand your emotions, this is a very tough time..things will seem better for you once you start treatment, mostly because it makes us feel like we are doing something to rid our bodies of the beast! Beepie, I will share with you my thoughts on lump vs mast, but remember everyone is different, whats right for me may not be for you.. I felt that removing my breast would bring me closer to all removal of any possibilites of having any cancer left behind and maybe having to go back in again as they sometimes have to with a lumpectomy..I am aware that cancer may even return in the area where the breast has been removed, but for me that chance seemed less likely to occur. There are things you need to be concerned about with having a mast..like lymphedema, I had 33 nodes removed (my surgeon did not give me the option of having the SNB, you can check that out on the internet) so I have a high risk of developing that now or anytime in the future, there are precautions...and I am careful. My hubby and parents were in favor of me having the mast., they felt more secure in feeling that the cancer would be removed that way..we were all in agreement. I have children, and would do anything I had to do in order to be here for them. I did not want to have rads, I have read about radiation recall, and women who had alot of skin, and organ problems after. In my mind, if the cancer had returned I think I would regret not having a mast...this weighed very heavy on my mind. My cancer was only very slightly estrogen postive, and progesterone neg..this means that hormone treatment like tamoxifen, and the aromatose inhibitors have less of a chance of keeping the cancer from returning.I had One postive lymph node, which can indicate that the cancer spread, or was on the move, and that knowlege (along with other information from the path report) will help to determine the course of treatment. It must be a very difficult decision for you, whether to tell your parents or not..I can understand how sensitive an issue this is..Im not sure what I would do in your postion.. I delayed my last mammo too, and have kicked myself many a time, but we have to let that go..you have so much right now to deal with..who knows maybe if we had gone when we should have there wouldnt have been any cancer visable, and waiting another year from then would have given the cancer all that time to grow..well never know, we have to be really gently on ourselves especially when there are so many issues to deal with. But Beepie, there are so many emotions with this disease..I buried my head in the sand for a very long time..but somewhere down the line, Ive realized that I hoped I could survive, I can be a survivor, and I will be a survivor!, each time I was knocked down..yeah I cried, had bad days, was scared, but I managed to pick myself back up and get back into my life again!! the other option wasnt very appealing to me! Beepie, I pray for you, for all others battling cancer..I hate this disease! but believe that there is hope, and that you will survive!! One step at a time! sending prayers and hugs your way, cj. Let me know how things go tommorrow",
      "MessageIndex": 3,
      "PostDate": "26/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/511174-ductile-carcinoma.html",
      "Title": "Ductile Carcinoma 1 2 3"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Phyl..how are you??? I havent been on hercepton, but have gained some weight on every other med that I seem to have taken during my bc journey..and Im not liking it very much!! Im presently on elavil for fibro..and my onc tells me that he prescribes that to people who lost too much weight during chemo..YIKES that certainly wasnt the case with me..but it is a drug that is supposed to help with the fibro pains.. Hope someone out there who is on hercepton will chime in here and let you know how they are making out!! take care PHYL, nice seeing you on, hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "31/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/529297-weight-gain-herceptin.html",
      "Title": "Weight gain and Herceptin"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Elena, You are very welcome!, and thank you for such kind words. Come back and pop in, let us know how you are doing..okay? best wishes, cj",
      "MessageIndex": 3,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/491979-stromal-fibrosis-but-cant-feel.html",
      "Title": "stromal fibrosis but can't feel it?"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Oh Hoppy, thanks so much for coming back and posting that good news!! I'm HAPPY for HOPPY!! You just keep checkin your ta..ta's! best of everything to ya, cj.",
      "MessageIndex": 8,
      "PostDate": "18/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/498179-fibroadenoma-other-breast-issues-need-encouragement.html",
      "Title": "Fibroadenoma and other breast issues - need encouragement!"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "thanks Jewels..I appreciate that!! Its a tough journey, and it never does seem to end..always a worry, no matter what body part hurts..the fear that it could be cancer mets. is always there. I do know women who are afraid to find out..or afraid that it will hurt, and will not get checked out...it breaks my heart I wish you the best.. cj.",
      "MessageIndex": 4,
      "PostDate": "11/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/498179-fibroadenoma-other-breast-issues-need-encouragement.html",
      "Title": "Fibroadenoma and other breast issues - need encouragement!"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Dear Hoppy, I wish there was some magical way that right now..at this moment we can stop cancer in its tracks..all kinds of cancers..those that touch women, men, and children! Your welcome! From the day I considered myself a survivor..my wish was to help someone else in the same situation I found myself in..it was kinda a promise that I made..so here I am. I wish you well too Hoppy...and peace I hope that your exams will go easier and that your mind will be put at ease. best wishes, cj.",
      "MessageIndex": 6,
      "PostDate": "12/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/498179-fibroadenoma-other-breast-issues-need-encouragement.html",
      "Title": "Fibroadenoma and other breast issues - need encouragement!"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "To Hoppy and Jewels..I dont say this in a mean way, so please dont take it wrong..i have been in your shoes before too..BUT having the diagnosis of breast cancer is far worse than any test could ever be..I know about the fear, the inconvenience..but in the long run, its all worth it..I am a 4yr survivor, my cancer was found by a mammo..who knows by the time I would have felt it..I would have been in much worse shape..Its all about early detection!! the earlier it is found, the better your chances for successful treatment. Hoppy, you should ask your dr. for an MRI they seem to work better on dense breasts. Do you have a strong history of breast cancer in your family? So I think that even though it causes alot of stress..you still have to do it..you owe it to yourself. I too got called back for a few years, but I was also told that the rad tech was also very picky about what he saw on the films that he would call back for every little thing..heck, I would rather that then have it be missed! Hope things go smoother for you both..and I hope that the fear and anxiety doesnt stop you from performing self breast exams, and having routine mammos.. best wishes, cj.",
      "MessageIndex": 2,
      "PostDate": "11/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/498179-fibroadenoma-other-breast-issues-need-encouragement.html",
      "Title": "Fibroadenoma and other breast issues - need encouragement!"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Elena, I am all for going for second opinions on all outcomes..regardless..especially if it would help to ease your mind. However, it looks as though from the testing that you have had that they have done a thorough investigation of that mass.. I am a 4yr bc.cancer survivor..I had fibrocystic breasts..I could feel the lumps..but I never could feel the cancer growth..I was lifting some weights at the time, and all I could feel was a tingley feeling every once and a while..but I never dreamed that was cancer..it was picked up on my mammo. I do not mean to scare you at all, but I dont think that all masses whether malignant or benign can be felt.. Its all a scary thing...I know that all too well myself.. Best wishes to you.. there are plenty of women on these boards who are here anytime you need to vent! cj. always keep up with your yearly mammo's and self breast exams!!",
      "MessageIndex": 1,
      "PostDate": "19/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/491979-stromal-fibrosis-but-cant-feel.html",
      "Title": "stromal fibrosis but can't feel it?"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi breathe..interesting..Ive never heard nor has any doctor or surgeon that I have spoken to mentioned this at all..wondering what the connection is..hormones I would imagine. I will have to check into that one..thanks for sharing that info. hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "05/02/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/576370-biopsy-surgery-timing-menstrual-cycle.html",
      "Title": "biopsy/surgery timing and menstrual cycle"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Guess what? I stopped aromasin because of.....leg pains!! I have been on arimidex for about 2months and the last three days...my legs are really hurting me again, especially in the evening..Can I ask you, what time of the day you take your femara? I was taking the aromasin in the evening but then the insomnia was really bad, so when I switched I have been taking arimidex in the morning, I was doing ok with that until the leg pains started again..thinking now I should go back to the evenings.. I just dont know what to do anymore..I really think that I will just have to learn to live with it..do you exercise? I go to the gym 6days a week, I think if I didnt I would feel as though I was 100 yrs old!! hope you have a good night! cj.",
      "MessageIndex": 8,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "ooops I wanted to ask you how the dizziness was now? I have had a few dizzy spells too, one the other day..I couldnt focus my eyes at all, everything was spinning..but it doesnt happen that often.. Hope yours has gotten better! cj.",
      "MessageIndex": 9,
      "PostDate": "02/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Elga, seems we have alot in common with these side effects. My sister in law has taken femara now for 7yrs and no problems at all!! I cant understand, why they seem to bother me so much..For me the aromasins side effects were worse,so far anyway, than arimidex. From what I understand aromasin is the only one that acts steroidal..look it up, I think that may be why my body couldnt tolerate it. I wont even bother to try the femara..I think I would probably have the same results..I believe that the pain is accumulative..for me seems to get worse the longer I am on it..at first I thought that the arimidex would be side effect free for me...until after a few weeks, then I noticed slowly the pains starting to come back. I have forgotten if I asked you this already but, do you exercise at all? I think that because I do, it is the only reason that I can still function at all..as it is now if I sit too long I get so stiff...somedays I feel like I am a very old lady!! I too am very envious of those who dont have to deal with this pain...my legs, my feet, somewhat low back, and terrible pain in the wrists..very stiff fingers..thats me!! hope to hear more from you...comparing notes!! I love Canada!! went there many times as a child, gentle hugs to you, cj.",
      "MessageIndex": 12,
      "PostDate": "03/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Elga, I go to a rheumatologist because my onc. does not believe that there are any side effects from these drugs (Yeah right)!!, but the rheumie says that the pains sound like fibromyalgia..or pains that are mimicking that disorder..anyway, she has me on elivil, which is an antidepressant that they also use for the pains of fibro...and it does help some, when I ran out of it a few weeks ago, I realized then how bad these pains really are..so I quickly got a hold of my pharmacy and they filled a new prescription..so maybe that one would work on you too..its worth a try especially since you are going to switch anyway! The reason that I dont seek out anymore help is because I just dont want to add any more meds!! all they seem to want to do is add something else..that may or may not help..and then what....more side effects!!! I am really so tired of all this!! I wish you well too! I love N.Y. too but have been here all of my life, and its getting too crowded here!! I just need more peace, quiet and space!! Keep in touch!! cj.",
      "MessageIndex": 14,
      "PostDate": "06/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Dear Greenacres, you didn't mention what type of mammo you had..you might get better readings with a digital mammo, or you can ask for an MRI, which is a good option for a woman with dense breasts. If it were me, I would ask for one of the above. Keep doing your self exams and having your yearly mammos..so important for early detection. Best wishes to ya!",
      "MessageIndex": 1,
      "PostDate": "03/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/486970-here-r-my-mammo-us-results-thoughts-please.html",
      "Title": "Here R my Mammo and US Results, Thoughts Please??"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Bernice, there are lymph nodes under your armpit which swell if there is an infection present..could be that..glad your getting a second opionion from a specialist..maybe they could do an ultrasound or MRI to help ease your mind.. best wishes, cj.",
      "MessageIndex": 1,
      "PostDate": "24/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/502047-lump-under-arm.html",
      "Title": "Lump under arm"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "MamaLisa, I am glad you are going to see another Dr. Personally, a manual exam..when there is pain/lump, wouldnt be enough for me to rule out cancer, or any other problem for that matter! I would insist on a mammo, and ultrasound to put your mind at ease. Best wishes with your doc today, come back, let us know how you are doing okay? cj",
      "MessageIndex": 1,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/496267-sore-left-breast.html",
      "Title": "Sore on left breast?"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "hey marmar..the waiting is the worst..I just wouldnt want to wait that long..honeslty I would be making a big stink about putting it off that long. I would call the docs office back, let them know how long that you have to wait and see if there is something that they could do to help move up that appointment..or maybe they could get you in earlier for an ultrasound..at least that might help to ease your mind a bit. I certainly understand how your feeling, hope you get in soon..and all tests come out neg. for cancer! hugs, cj.",
      "MessageIndex": 2,
      "PostDate": "18/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/553743-true-cancerous-lumps-not-painful.html",
      "Title": "Is it true that cancerous lumps are not painful??"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "ok marmar..let us know how things go.. Be Strong!!!,Be persistent!! cj.",
      "MessageIndex": 4,
      "PostDate": "18/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/553743-true-cancerous-lumps-not-painful.html",
      "Title": "Is it true that cancerous lumps are not painful??"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "EBCC, So sorry that youve had to go through all this! Waiting..its a horrible, emotional time.. Just wanted to say Hi, and I do hope that all turns out well for you, and that you get the word..benign!! Whatever the case..there are people on these boards that can help you along the way..if treatment is necessary.. I went through this at 43..and youre right it makes you feel much older.. Heres praying for the best possible outcome for you! hugs, cj.",
      "MessageIndex": 5,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/489411-biopsy-what-expect.html",
      "Title": "Biopsy: What to Expect?"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "hi elga,I have switched from aromasin to arimidex...and for the last few nights, the leg pain is awful..can you explain what yours felt like? cj.",
      "MessageIndex": 4,
      "PostDate": "31/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "mjuk..your welcome..hope she finds some relief..Im counting down to the day I can stop taking my cancer drug..it is another 10months for me..I hope I can hang on.. She just may feel better on one of the other two AI\"s..I hope you can get her to try..tell her, so,so,so many women have switched..and some find relief being on one of the others.. best wishes, to you both.. come back and chat, let us know how things are going, okay? cj",
      "MessageIndex": 3,
      "PostDate": "07/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/527971-ibs-like-effects-arimidex.html",
      "Title": "IBS Like Effects from Arimidex??"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "WOW Elga, thats exactly what I have...from the knee to the ankle even my feet hurt! Sometimes I wonder if this is all worth it!! I sure hope my body can adjust once I am off this med! wishing you well too, cj.",
      "MessageIndex": 6,
      "PostDate": "01/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Jillery, Ive been away on vacation and have just found your post..how are you making out on the tamoxifen? Out of all the meds that I have been on, I seemed to have the least side effects on the tamoxifen. Hope its all working out for you!! hugs, cj.",
      "MessageIndex": 21,
      "PostDate": "20/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Elga, I take arimidex, and I did have some dizziness at first..but not that bad..you should let your onc. know about that..maybe it is one of your other meds.. take care, cj.",
      "MessageIndex": 1,
      "PostDate": "24/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Jillery and Elga! Jill- I too am er+ only by 5%..its a tough call..whether to take the AIs or not..I was on aromasin..stopped because the pain was too bad, I take arimidex now which I seem to be handling better..oh, the pain is still there, only not as bad..You should speak to your onc. about trying one of the others, maybe one will not have such bad effects as the arimidex.. I have learned so much from breast cancer boards..it is nice to know that we are not alone..there is always another \"sister\" out there that has been through what we are going through!!, and everyone I have met is so very kind and generous..sharing their experiences!! Elga..let me know if you get to try the elavil..it does seem to help the pain somewhat, I continue to use it..afraid to have the leg pain come back as bad as it was before..lots of luck with it.. hugs to you both cj.",
      "MessageIndex": 19,
      "PostDate": "16/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi MJUK, You should do a search on the internet for Arimidex, you can find a listing of the side effects from that drug..I take arimidex too, and have suffered from all the things that your aunt does..but she should definately speak to her oncologist about them because there are other medications that can help with those problems..there are also 2 other cancer drugs in the same family as the arimidex(aromatose inhibitors) they are aromasin and femara..I have already taken the aromasin, and chose to try arimidex and hope for less complications. My muscles seem to hurt me the most...muscles and joints in my legs the most. Sleep? Ive almost forgotten what that feels like!! I havent had much success with any other meds for that that I have tried..She may want to ask her onc about melatonin. Many bc women take it..it is sold over the counter, its produced by your body naturally to cause sleep, but the extra seems to help some women. Youre so sweet for wanting to help your Aunt, and trying to make things easier for her..if she wont call her onc., maybe she will let you speak to him for her..Please tell her she isnt alone!! you will find many other women on this and other websites with many of the same problems. best wishes to you and your Aunt, hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "28/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/527971-ibs-like-effects-arimidex.html",
      "Title": "IBS Like Effects from Arimidex??"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Gee RedSands..I am so sorry to hear about all this..you truly have some dilemma here! I can understand your endo's concern as I have read about women having bone density problems with these drugs..I guess that for me..I would have to say that quality of life would be most important in my mind in deciding..as a matter of fact, I have decided that after my 5yrs is up..because of side effects that I experience..I will not take any other medications for breast cancer..Im done..The meds are taking their toll on my body, and I am very worried about long term effects.. This is a tough journey we take! I can understand how confused and worried you must be feeling about all of this..I will pray for you, for peace, in your heart and in your mind.. these decisions are just so tough! many hugs to you, cj.",
      "MessageIndex": 1,
      "PostDate": "22/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/535961-tamoxifen-arimidex-conflict.html",
      "Title": "Tamoxifen And Arimidex Conflict"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Red, how ya doin?? I am on arimidex..switched over from tamoxifen (after two years and a half)..I had become surgically menopausal so I began aromasin..just recently I had to take a 6week break from that because the side effects were very painful and unbearable..after the break I began arimidex..I am looking to complete my 5yr total plan so I have about 9 more months to go.I was estrogen + by only 5% and progesterone-,her2-. So I really feel as though its such a shot in the dark whether any of these hormonal treatments are working at all..but Im trying to hang in there..per my Oncologists request to make the 5 yr. mark, and then Im done..will not continue any further with those meds..no matter what!! You are right..tough road..and my journey never seems to end..was just dx with cardiomyopathy..maybe caused by chemo..so Im adding 2 more meds to my list!! UGH! Have you tried any meds to help you deal with those side effects? We gotta hang tough though, no matter what!! keep in touch, Ill be here!! hugs, cj.",
      "MessageIndex": 3,
      "PostDate": "25/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/535961-tamoxifen-arimidex-conflict.html",
      "Title": "Tamoxifen And Arimidex Conflict"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Elga, yes elavil might just help you with the leg pain..I do still have it, but as I said it seems better on this drug. This week it is supposed to be in the upper 70's not bad!! and how is it in Quebec? we have just about the same temperatures, right? Let me know what your doc says about giving the elavil a try! Nice talking with you, cj.",
      "MessageIndex": 16,
      "PostDate": "11/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/501774-femara-dizziness.html",
      "Title": "Femara and dizziness 1 2"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "just want to add to Elga..I also take Elavil..it was prescribed for me for my fibromyalgia , which affects sleep patterns and causes sometimes severe muscle pain..It does seem to help somewhat with sleep, and has helped me with leg pain..I just cant take too high of a dose, otherwise I get restless arms and legs..so I keep to a very low dose. Hi Elga,have we met? cj.",
      "MessageIndex": 5,
      "PostDate": "22/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/527971-ibs-like-effects-arimidex.html",
      "Title": "IBS Like Effects from Arimidex??"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Kathy, I am a 4yr survivor myself..I never did feel any lump, it was found on my routine mammo. I can imagine how difficult this decision must be for you. I can only offer you opinions from my own experience..I had a mast. with no reconstruction..my personal opinion was that I felt my body should heal itself first..I waited 2yrs, and then I decided to go for the reconstruction. I was having a difficult time with my own body image..my wonderful husband was not. I didnt even want to look at myself in the mirror. I decided on what I believed to be the safest way to get back what I had lost to cancer..and that was to have a saline implant..It was not without pain...however with meds it was okay. I have never regretted that decision. It is not my old breast..It does not have feeling, but it is a breast! I had a lift and reduction on the other side to make them look symmetrical..and they do..I went down to a C cup.. Kathy, this is such a personal decision..if you choose not to do it now, you can do it later..its only that you will then have to have an additional surgery. Please keep in touch, I have received so much support from others when I have gone through this..I only hope that I can \"pay it forward\"! hugs.. cj",
      "MessageIndex": 5,
      "PostDate": "17/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/471381-prophalatic-double-mastectomy.html",
      "Title": "Prophalatic Double Mastectomy"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi anxiety..so sorry that your mom is going through all of this.. Muga scans are usually done before chemo and after chemo to check on the heart (or at other times if a problem arises). If her muga scan fell under a certain range they may feel that the chemo could be causing the weakness..and change the meds..sometimes another drug, even though it does the same to fight against the cancer..is better tolerated by the heart..We are in a very different world today..we have so many more drugs to fight this disease..and other meds to help with the side effects.. I can truly understand how worried you must be..try to stay strong for her..I am sure having your love and concern means the workd to her. hugs to you cj.",
      "MessageIndex": 1,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/574058-metastatic-breast-cancer-muga-results.html",
      "Title": "Metastatic breast cancer and MUGA results"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "hey phyl, did you let your surgeon know of this heavy feeling? do you have any fever? I think its best you call your doc., let them know how you feel..I did not have a lump. I had a mast., so I cant offer you any info from personal experience. take care, let me know how its going, cj.",
      "MessageIndex": 1,
      "PostDate": "19/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/509565-heaviness-breast-after-lumpectomy-treatment.html",
      "Title": "Heaviness in breast after lumpectomy and treatment"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "your so right vallegrl, everyone responds differently..and have varying degrees of pain threshold.. Did you get all the info about your type of cancer..and treatment plan..? Hope you had a good day today! hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "01/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/548678-lumpectomy-sentinel-node-yesterday.html",
      "Title": "Lumpectomy/sentinel node yesterday"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Kc, sorry for your the loss of your Mom, I lost my grandmother 3yrs ago, she was 92, and she was very special to me.., like you have said, the soul of my life, I miss her so. I am a 4ry bc. survivor, but I am sorry I cannot answer questions about a lumpectomy as I had a mastectomy. I just want to say, that if you have someone to come with you on your appointments it will help you greatly..there is so much information that you will be getting...and its tough to take it all in..sometimes you just dont even hear half of whats being said. I also had chemo..and just to let you know, its much easier than it used to be, I wasnt sick at all..and many women have that same experience..There are many different drugs that they will give you for any nausea that you experience..I did get very tired, and also had mouth sores, but they gave me some meds for the sores and they felt better. Im sure someone else will see your post and respond to you about the lump. This is a really great board, with many lovely ladies,who are here to lend support any way they can. Please continue to post whenever you can throughout your treatment, we will be here for you, Bless you, cj.",
      "MessageIndex": 1,
      "PostDate": "10/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/506878-mammogram-ultrasound-what-next.html",
      "Title": "Mammogram/ultrasound/ What Next ?"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Ladies!!I went to a vitamin store today and saw the red rice stuff..but I held back because I want to speak with my doc about if first, but linda, really great info..thanks..I have to say that I am really glad Linda, that you are going to go for the counseling first..I think that is a good decision..why not find out all the reprocussions first..will give you plenty to think about, I am sure! Teresa..so happy that you are moving about!! and walking too!! YOu go girl!!! Just know that even though your cholesterol may be high now..it doesnt take long to get it back down..you keep workin at it okay?? cj",
      "MessageIndex": 44,
      "PostDate": "20/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hey Hi!! Linda, glad you have found us! I was dx in 2003, and NED ever since. Let me see if I can answer some of your questions.. I definately have muscular problems..yes in my hip also..(but also just dx with fibro, which I question)alot of spasms in my calves, which I believe have added to a dx of plantar fasciitis..because the muscles have been tightening all over my legs.PT. is helping but the pain is not gone..but better. Yes, arimidex, according to the manufacturer can increase risk of osteo in patients who already have it..i think that is what has happened to my knees! That was very interesting info on the lung nodule..I just looked it up on the internet..funny but I was in New Mexico and Arizona..just twice in my life, but it was during the summer season..thankx for mentioning that..I will bring that up to my dr. and ask for a test..they can do a sputum or blood test. I am also an ex-smoker which is a consideration..Both of my drs. poo-pooed my concern..they tell me many people have them...I dont know, I worried alot when it was first found, but havent really given it a second thought lately..but I will make sure that they investigate it further, its very tiny right now. Why are you having your other breast removed? Is it the fear of recurrance? I often think about that myself..kinda think I should have done that at the same time..and not have to go through that whole thing again..but cant turn back time..just deal with what today has to offer. It is wonderful to have other women to swap stories with..Its like a sisterhood, part of a group..one that we never wanted to join!! but because we have, we can offer alot of support and encouragement to others. Teresa..Ditto..the arthritic pain..but I am 47, and dont believe I should be having it this bad..I have been active most of my life..I exercise and used to even run..Ive replaced that with long walks now..lol..yes, I believe that you have to finish your full course of treatment regardless of whether you have the breast or not. Breast cancer can even grow where there is no breast..on the chest wall..however I do not believe that it is very common. cj.",
      "MessageIndex": 18,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hey ladies..Linda, no dont drink poo-poo tea..lol, but honestly look into green tea, I have read its a great antioxidant. Tell me more about the red yeast rice, just had my cholesterol taken and its too high for my liking..I want to add omega fish oil..just because its said that it is very healthy especially if you dont eat enough fish..I do eat fish alot but I still think it would help. COQ10 is good for the heart..and I just found out that I have leaky valves..never had it before but wonder if it could be a side effect from chemo. Yea for the Gila monster spit!! Its amazing the things they can do today! T-I eat organic too! I do not eat red meat at all, and chicken only occasionally. We eat fruit, vegies, nuts, beans and grains..my son says that is why he will never ever invite a friend over for dinner!!!lol my sister inlaw buys into a farm share during the summer and get beautiful fruits and vegies..I dont do it because it is way too much food for us and would have to throw too much of it out. Can you tell me the name of the vitamin that has both in it..I would be very interested in that. My bad habit is coffee..I drink decaf only, with no sweetener, but I really dont think 3 cups a day is really too good for you..but I cant help it!! and I dont do or eat anything else bad so I give myself that one. Even with my pain..I exercise everyday..I have to for my body and mind! I take elavil for fibro but its also an anti-depressant, and it so makes me feel better. I really think that PT will help you..because you sound like youre experiencing some of the same pains I am..and it is helping. I really hope you can get to one! We just have to keep in touch so you can tell me when you go..and then one day youll say you feel better..that would be so good!! I have also been on the anti-inflammatories..my mom gave me a paper a while back on the possible side effects..and it scared the heck out of me..thats when I decided I needed to do something to take care of the problem without meds..and Pt. sounded like something I wanted to try..I am behind you 100% when you say that you are gonna change and get active again Yahoo!! If you need a little encouragement, I am here for ya! hugs, cj.",
      "MessageIndex": 33,
      "PostDate": "17/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "gonna try that out..gotta get to the store soon!! yes we have a footlocker here.. thanx cj",
      "MessageIndex": 61,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Teresa..how sweet..I love my lady too!! actually they dont remove the muscle..they tunnell it up through the abdomen and use it to construct the breast..I would have liked to get rid of my stomach fat too..but you can gain it back too..I know someone who it happened to! That aquarium sounds awesome! and the whales have to be one of my favorites too..Youll have such a good time no matter where you are visiting your daughter! nitey nite cj.",
      "MessageIndex": 54,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Teresa, I am surprised that your dr. said to have a mammo every six months, although I would like to have them that often myself..I go once a year.. I asked my onc. last week if I could go for an MRI as there has been alot in the news lately about the added benefits..he said the insurance companies wont pay for it! I was very upset about that..I had a mast. and always worry about the cancer returning in the other breast...dumb insurance companies!! What other side effects are you feeling? and how are you dealing with them.. I was dx with plantar fasciitis, fibromyalgia, carpal tunnel, osteo in the knees, hips, shoulders and spine...before cancer...I hardly even get a cold..so feeling this way is really tough on me..but luckily I can see the light at the end of the tunnell..only 1yr and 2mths left of treatment!! good luck with appt. friday! cj.",
      "MessageIndex": 8,
      "PostDate": "11/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Silly Doctors..Seriously Teresa, try physical therapy!! I have been going now for about a month..and I swear the muscle pain is so much better..not gone, but better..the joint pain, thats another story..going for synvisc injections as soon as my doc. sets up the appointment..then hopefully I'll feel my age again and not like a 90yr old arthritic woman. I take a very small dose of Elavil for the fibro...I just ran out and am waiting for them to be sent in the mail...for the last few days muscles have been spasmig again, and I am not sleeping at all...cant wait till it comes in the mail!! About Pets..sorry cant reply on that one..I have none!! lol be well cj",
      "MessageIndex": 12,
      "PostDate": "14/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "hey linda..how did you print in bold..just curious!! lol",
      "MessageIndex": 19,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "here I am trying again, i dont think its working..I'll continue and check after I post. Teresa, do you drink green tea or take green tea extract? do you also know about turmeric..its a spice..can use it on rice dishes, check it out! I think I need to beef up my supplements..what do you both take? I take a multi,calcium,super b,magnesium,folic acid, vitE, and aspirin..There are so many more to add but becomes very expensive..i would like to start omega fish oil, and coQ10 next time i go to the vitamin shop. We are drenched in the nor-easter here..water everywhere so i gotta run.. Love turning on the ole-comp, knowing you ladies are here!! talk soon, cj.. ps..hope this worked!!!",
      "MessageIndex": 30,
      "PostDate": "16/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "JOJO, thats really great that you are going for PT for that arm..wish I had done the same..it wasnt offered to me! The pain will get better! I promise you that! It will feel kinda funny but you will get used to it. Use the arm..just dont lift anything too heavy or do the same motion, over and over...like cleaning windows all day!! Just take it easy..and remember dont overstretch..ouch that hurts! And sorry for being the bearer of the menopause news..but at least you will know when the time comes..Let your onc know about all your menstrual changes it is important. What a beautiful day...AGAIN weve been blessed with lots of sunshine after the floods!! YEAH cj.",
      "MessageIndex": 66,
      "PostDate": "24/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Linda..it was alot of fun..She was just so sweet and kind..and really very funny. I know what you mean about the pills..and the cost too! I take a baby aspirin everyday..had blood clots when my port collapsed..thats a whole big story itself..Yes on the memory!! I CANT remember a thing..its so horrrible, you know the other day, I was driving here where I live, and I suddenly couldnt remember where I was or where I was going to..it was scary for a few minutes..I have heard about your brain that you either use it or lose it!! My grandmother died at the age of 92 and seriously, she was as quick as can be..she told me that she always prayed to God to allow her to keep her mind as her body grew old....and man she remembered everything!! I loved her so! You must be so relieved getting such great news...NO fractures Oh my, your poor friend, that doesnt sound to good..will say a prayer for her tonite! Teresa-You have got a great attitude!! Your right, if your gonna be in pain anyway, it might as well be because your up and about and working on getting some exercise!! YippeY!! Your mood does improve..its those endorphins kickin in!, that is one of the main reasons I am at the gym everyday..I love the way it makes me feel..strong and confident! AAAh, give your dog a kiss for me!! thats so sweet.. Just got back from college touring with my son..up to University of Rhode Island..nice school..long, long trip! hugs to all, cj",
      "MessageIndex": 47,
      "PostDate": "21/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi gals ..Ok..the only thing I have to add about that procedure is do some investigating first..read about the procedure from many different sources before you make that decision..I have seen the breasts of 3 different women who had it done, and all three were just beautiful..the incision on the tummy is extensive..accross the belly..as far as I know one of the more common side effects are problems with the mesh put into the belly, and hernias, also necrosis of the skin. I recently asked a friend who had that done about sensation in her breast..she said there is none..same as well with an implant. The areola and nipple from both surgeries look about the same..I havent seen anyone with a nipple that projects much longer after the surgery..they dont seem to be able to do them so they last..The surgery, and recupperation time are much longer for that procedure as well. Also ask to see some of the pictures from your plastic surgeon of all the different types of reconstruction..and if possible for the phone number of one of the patients that you can contact and speak to. Linda your vacation sounds awesome.. have you ever attended a relay for life? You will be amazed at the outpouring of support and love you will receive. Bring lots of tissues..the ending ceremony is beautiful. Its very special especially, to do it for someone you love!! Teresa, where does your second daughter live..my daughter will be home from college around the third week in May..oh I miss her..I am the only girl in the house while she is gone..to much progesterone in here for me!!!! lol take care, hugs cj",
      "MessageIndex": 52,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Wow you both are going great!! Walking..its just about one of the best things you can do for yourself.. Linda, thats really a great idea..see how many houses you pass..excellent!! what seems to bother you the most when you are up and about? I have alot of trigger points in my muscles..hard knots! I ordered and had delivered the same stick that my PT uses on me..I am so excited to start doing it at home myself..I think that it might just be what I need!! T-did you tell your onc. about the swelling..it is listed as a side effect, but I know my onc. is always checking my ankles, does yours? Make sure you elavate them when you rest! How about some ice, have you tried that? going to get something started for dinner.. hope you had a nice day! cj",
      "MessageIndex": 76,
      "PostDate": "26/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hey ladies.. Just thought I would add JOJO..you will probably go through chemo induced menopause..it started right away for me, I believe it happens to most women..so you will begin to get the hot flashes too..those may not come on right away..If it is severes..which it ended up being for me..your dr. can prescribe effexor..its also an anti-depressant..and really helps with the sweats..believe it or not my period actually came back a year after chemo..and that is how I ended up having a hysterectomy...that was a year ago..so yup, Im going through menopause once again!! I am on elavil..my rheumatologis thinks that I have fibro...dont know if I agree but..she had me try the elavil at a very small dose (also anti-depressant)..and it seems to be helping with alot of my symptoms..sweats..anxiety..sleeplessness ..so I am going to stay on it as long as I have to take the A.I. JOJO..my advice, just take whatever makes you feel better and helps you to rest..your body will need to be rested and calm for your treatments..I personally didnt have any problem getting off them..I did not take them everyday..but did as needed.. Having a sweat as we speak...so they are not completely gone! gotta go get me a tall glass of ice water.. Ill be checkin in later hugs, cj",
      "MessageIndex": 64,
      "PostDate": "24/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "HI Teresa..I want to say no that my ankles dont swell, but every once and a while I do think that they are swollen..but only slightly! Youll never believe this but...I did walk when I took ambien..walked into the kitchen looking for food...it was really funny..i remember I would eat banannas..I dont think I knew it while I was doing it, but I would remember when I woke up in the morning. I used to wonder why I was gaining weight!! I had to stop!!! lol take care cj",
      "MessageIndex": 71,
      "PostDate": "25/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi teresa, Yes my feet are really in bad shape..went to PT today..he said I have alot of trigger points..which are muscles..that get really tight like a knot.He tries working them out...and some are better, but I take that [emailprotected] medicine and my whole body starts hurting all over again..maybe my dr.was right, I probably do have fibro...like she said. working that long would be much to much for me and I am 4yrs from dx. The fatigue can really wear ya down..I hope something works of for you..and soon. JOJO- the most healthiest nuts are walnuts and dry roasted almonds..but beware..they are very fattening..so only have about 10 a day. And yes..salmon is good..just make sure that you get the wild kind.. I do use flax..I buy it already ground with dried blueberries..but I understand that you should buy the seeds and grind them yourself...supposed to be healthier that way...No soy!, and no one told me that either..I had to find out that on my own..I have learned alot on my own..I want to eat healthy and I have to find out the right things to eat..so I do alot of research! So glad the melatonin worked for you..Your right just a little bit will help..I have also read that they believe melatonin may help fight bc..so I know some women take it strictly for that reason..I have taken up to 9mg.one night..really bad night..but I usually take 3mg. remember to shut off the lights!! I think I may need to take one myself tonight!! Just took a pain killer..waiting for it to start working.. cj.",
      "MessageIndex": 68,
      "PostDate": "24/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hey Tee-my hubby is out back building one now!! more rain forcasted for tommorrow! maybe its just the right time for all of us to be in that mood..Ive been having a bit of it myself lately ..but summer is on its way.. I love summer and feeling the sunshine on my achin body! hugs Tee! cj.",
      "MessageIndex": 83,
      "PostDate": "30/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hey JOJO,, I remember feeling tired, and cold..my legs seemed to always be cold from the very first day..if you are having adriamycin..youll be peeing red..dont worry its normal..we called that the red devil!! but I think, emotionally you might feel better..most people do, once treatment starts we are taking action against the cancer beast..and that is usually gives us a sense of somewhat being in control..I hope it does for you! From reading your posts..I think you are ready for the fight..You give it hell!! Your in my thoughts, and will be tommorrow as well.. only the best for you JOJO, cj.",
      "MessageIndex": 91,
      "PostDate": "10/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "yeah, I bet I hate aromasin and arimdex just as much!!! Same pains here...I actually had synvisc injections in my knees because the pain got unbearable while on aromasin..switched to arimidex and joint and muscle pain seem to have gotten a little better, but now suffering from sever stomach pain..have been in the hospital twice this month for it! I have about 7months to go before I finish my total 5yr treatment..am so looking forward to that day!!! Kinda feel like we are stuck...after having a recent scare and thinking I had brain mets..I know Ive got to stick it out and finish with the treatment. This all stinks, doesn't it!? hugs to you, cj.",
      "MessageIndex": 1,
      "PostDate": "02/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/549469-i-hate-femara-how-about-you.html",
      "Title": "I hate Femara, How about you?"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Oh wow..I came to the right place..YOUR ALL HERE!!!! JOJO, sorry about your upset stomach..just let your doc know there are so many different drugs that they can try..ONE DOWN!! yipppeee!!! Remember JOJO, most people start to loose their hair after the second round..youll know it is going to start when you feel some pain in your scalp..it usually starts falling out in handfulls..just be prepared..Some women choose to shave their heads first..kinda feels like they are taking charge. I bought my wig after my first round..wanted to be prepared. Soft cotton hats worked good for the nighttime..my head was cold!! Hope you feel better JOJO do you have 3weeks in between..i thought you said only 2. HORRAYYYY LInda..wow great news..couldnt have said anything better!! Yeah, I wonder who told TE, that she could just leave us here all alone!! Te-you must have had a wonderful visit with your daughter, mine is coming home from college next week..i miss her so! but very glad you came back to us!!! Well girls..have a Great Big Happy Mothers Day, Will be thinkin about my friends here.. JOJO, ill be saying a prayer for you! hugs, cj",
      "MessageIndex": 98,
      "PostDate": "12/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi SBEACH, sorry about your cancer diagnosi..I know how very scary this all is for you..I was diagnosed 4yrs ago..I had stage 2B cancer with a positve node..I chose to have a mast..followed by 6mths..8rounds of chemotherapy. I had ACT, which is adriamycin,cytoxin and taxotere..I did well during chemo, no sickness, only nauseaousness, fatigue, leg pain and some mouth sores..all of these side effects were treated with diffferent meds..and I did just fine!! I have been NED, no evidence of disease since my original diagnosis. It will be 5yrs in January!! Your fears are real fears, and many of us have felt the same at some point during our breast cancer journey..only you can decide what is right for you..You will have to live with the decisions you make..as for me, I know in my heart, I did what was right for me.. I wish you well, Sbeaches.. come back, and keep posting, let us know how youre doing..okay? hugs, cj.",
      "MessageIndex": 1,
      "PostDate": "31/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/530192-chemo-taxotere-cytoxan.html",
      "Title": "Chemo with Taxotere and Cytoxan"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "[Bhere goes giving it a try][/now off but i dont think its workingB] i do quick reply so this screen doesnt even show up!! thanks..now I have to see if it works! NED- NO EVIDENCE OF DISEASE,it takes awhile but you learn the lingo after a bit. cj",
      "MessageIndex": 22,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "I do know what you mean..even though I have an implant, I do still feel as though my body weight is not even..but I dont know that it ever really was. I think that your whole body accomadates for the lack of/ or change in size, weight,shape of your breasts. I have develped pains in my shoulder and upper back, I believe from this whole surgery.. You mention your spine, what have they found? Probably arthritis, mine is being watched because in one year, there is noticable difference in the body scan..more so on the left of the hip.. Did you say what kind of cancer you had? Mine was IDC with a post.node. er.only slightly positive.pr and her2-..so I am not even sure that any hormonal treatment is working for me..but so far...ALL GOOD! be well, cj",
      "MessageIndex": 24,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "hi Teresa..I have just switched from aromasin because I was miserable..its been about a month and a half now on arimidex..and I know exactly how you feel! Some days I feel like I am 90! I have alot of muscle and joint pain..have tried my other meds to help with the pains..I am going for pt. because I now have plantar fasciitis and it seems to help with alot of the muscle pain..I do the exercises that they give me, on both legs..I am also taking elavil and relefen, which is an anti-inflammatory..My biggest concern is while I have to take all these other drugs to countact the pains that I have..what other side effects will I have..it isnt easy..I am 4 yrs from diagnosis, and once I finish my 5 yr drug therapy..I honestly think that I will not do any more, no matter what they come up with! I hope you can or do exercise, I believe that you will feel even stiffer if you dont. Have you tried any of the other AI's, you know each of them are made a little different, you might just have some success on one of the others..aromasin or femara.",
      "MessageIndex": 1,
      "PostDate": "07/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Teresa..I also have neuropathy in my feet..I get pins and needles in my toes.It's funny..but I think we must have the same oncologist!!Mine will not acknowledge that I have these pains..I think he thinks its all in my head, he told me the other day that\"there are women who never get over the diagnosis of breast cancer\"..well, he doesnt even know me well enough to make that conclusion about me. My husband was with me..and thankfully he told him that he is all wrong..that I am in pain!! Can you tell me what Wortons neuropathy is, I have never heard of that? I went out to a party last night, and danced like there was no tommorrow..had a blast!, but oh am I paying for it today, I swear that today I must be 100 yrs old..I am going to get a cortisone shot in my knee tommorrow, I hope it works!! How much longer do you have? Is your onc. planning on 5 yrs, or more? I have looked around on various sites..and believe me, we arent the only ones having problems!!!",
      "MessageIndex": 4,
      "PostDate": "08/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "No Teresa, you can vent all you want..I too am very happy to be alive, I try to just alleviate the pain any way I can without having to take too much medicine..I had the cortisone shot in my knee today..it feels a little better. Next week my rheumie will inject something different, cant remember the name of it, but it is supposed to replace some of the fluid that goes away with osteo...so I figured I would give it a try..having an injection once a week for three weeks. I am so sorry to hear about your mom. They surely have come along way with treatment and survival these days! My prayer is that they will one day prevent it, and/or cure it!! all the best to you cj.",
      "MessageIndex": 6,
      "PostDate": "09/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Sitting here sipping on my decaf green tea as we speak..and oh, dont forget the cinnimon stick..good for preventing cancer. The red yeast rice sounds great..so why does your dr.want you to stop..you would think that he would be telling you to continue because you have had such great results. Arimidex does cause increase in cholesterol level and LDL levels..thats is what I believe may have happened to me..Mine was fine up until this last checkup..so I have even gone from 1% milk down to skim..and I dont even drink it..just for cereal and coffee. Ive got to cut out everything that can cause it to elevate..I refuse to go on any more meds!!! Its 230, so I'll check it out in 3mths..gotta be lower, gotta be lower, gotta be lower!! CIAO ladies! cj",
      "MessageIndex": 38,
      "PostDate": "18/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi Teresa, No I am not taking anything..I dont know if someone...fogot to tell me too or what..I will ask at my next appt..thanks for reminding me of that. Let's see I was diagnosed 4yrs ago in january and have had 2 full body bone scans. I have no idea what protocol is on that one. I dont even know if they would have sent me for this past one, 2 months ago, but I was really complaining about all the pain, bone and muscle, that I was feeling..but luckily it was all clear..just the arthritis stuff..i have had 2 scares, a spot on my liver that seems to come and go..I have no idea, what thats all about..I guess different techs see different stuff..but the last had nothing! they also said that I have a lung nodule..that really sent me over the edge when they first told me..its small, so there isnt anything that they will do about it now..just wait and check on it in about 6months.. Have you ever had the full body bone scan? You should ask about it if you havent had one yet..I cant remember if you said whether you had any positive nodes? I did, that could be the reason for the bone scans..looking for mets. there. Did you get diagnosed with fibro after the cancer!! Its amazing to me how many women out there seem to be afflicted with all the same issues! Its always nice to talk to someone in the same boat!! My friends really dont understand..and frankly, they probably dont want to hear about any of it! Everyone's got there own problems!!! cj.",
      "MessageIndex": 10,
      "PostDate": "12/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hey Teresa..I never thought about that..maybe it contains something that effects the hormones? could be! I was totally shocked when he told me my cholesterol level..I have been having it tested with my normal 3mths visits..and wow..its so high..but I also think that I have high HDL..good cholesterol..which can be adding to the whole number and might be why my onc wasnt freaking out about it..I have been exercising everyday..almost..sometimes will take off on a sat.or sund.its been for 4yrs now..and when I was in my 30's I was a gym fanatic! My skinny,minny, mother his high cholesterol..so it is also genetic. I am so glad to hear you're moving..I feel the pain too..but I think if I was less active..I would be in even more pain..much stiffer! so a round of applause for you..you're on the right track!! Exercise is so important for us bc ladies!! (and everyone else out there)! cj",
      "MessageIndex": 40,
      "PostDate": "19/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "I cant keep up with you guys!! so many posts to read JOJO, that was my feeling exactly..thats why I had a saline implant..less to have to worry about.. You dont get normal sensation either way..so you learn to live with it..You sound like me with not wanting to take pills..I was on ambien for a while..man was it ever difficult to get off them! Can I suggest something to you that came from my onc..check out melatonin..do a search, read what you can..it is what the body makes normally..adding a few mg. helps you to doze off.. I take up to 3mg. You need to be in a very dark room in order for it to work..and no tv...ready to fall asleep..youll feel it working in about 30 minutes..in the morning, open the shades and let in the sunshine, to help you to wake without the groggyness. Yes, it seems that many of us bc survivors have a difficult time with insomnia..it is probably a side effect of our meds. PT will help you so much..I wish someone had suggested it to me after my mast. I think youll be happy your going..youll see improvement probably after the first visit. Hi Teresa! WOW its not easy for two to raise a family, Kudos to you for doing it alone!!I think i am starting to reach that point too.. my youngest is 15, hell be going away to college in 2yrs..then me and hubby will be all alone!!! yikes, what the heck will we do then?? Linda-that must have been such a terrible experience for you knowing that your daughter was left alone!! I know that taking care of a handicapped person is not always easy..a friend of mines daughter is handicapped and she talks to me sometimes about her frustrations!! I feel for you both. Did we mention to JOJO that she should try her best to use her arm normally..just dont hyper extend to reach something too far away..I did that a few times over the years..its really painful the next day! Good for you trying to walk that half mile..awesome girl!! I feel much better when I am active..those endorphins help out alot with mind and body! Well ladies..my plantar fasciitis is killing me!! I think I have done some damage to it..I was a real numb nut this weekend..I walked around a college open house, my foot got really sore, when I got into the car I saw and old golfball...(your supposed to use a tennis ball, or frozen water bottle) and rolled it around under my foot..Now all I can feel is like a block of hardness in my arch!! Oh man...whats next?? TTYL! cj",
      "MessageIndex": 60,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "T-it was really quite something.. I would find lots of bananna peels in the kitchen in the morning and when I really thought about it I could remember doing it!! HAHAHA! When I heard about people eating like uncooked meats and stuff thats when I said.. uh no, better stop this..it was HARD getting off them though.. I didnt sleep for about a month! You keep them tootsie wootsies elevated!! cj.",
      "MessageIndex": 73,
      "PostDate": "25/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hey LINDA..glad your back!!! Just know that its not just you..I am going to be approaching 5yrs in Jan. and am starting to have thoughts about removing my other breast..I dont think that all of our fears and concerns go away..but just like you said..you feel sorry for yourself for a while, then you pick yourself back up and go on with your life!, but linda, you are dealing with alot right now..Did you not get a prosthesis? I swam with mine..stuck it right inside my suit..102 degrees! Oh my, uniboob or not, you get right into that pool!! lol, You could do some water aerobics in your own pool!! About the dry mouth..I havent been on it that long and I take elavil for fibro, and that really makes you feel like you have cotton in your mouth, so I cant tell..but if you had it while having rads..it might be radiation recall..you should talk to your onc about that..I only know that it exists but not much other details..UMMM yes on the abdomen..but I think mine has gotten big because I went through surgical menopause last year..and its catching up to me..I have heard other women complain that they have alot of gas on the AI's I know I do! Golden Years! Heck NO..Im not going there yet!! I dont know how old you are..I am 47..somedays going on 90! but I am a fighter,like you, I'll go down kickin and screamin!!Had PT today, foot is better!!! He wants me to keep coming though so he can give me some relief in my leg muscles..I get my gel shots in my knees next week..please wish me luck,I hear it hurts real bad! About the career change..I am all about doin what makes you happy!! No one knows when your life will be over..so I think we gotta go for it while we have the chance!! I stop and smell every flower along the path now, and have slowed my life down..it like it better this way!! Hugs back at ya, cj",
      "MessageIndex": 81,
      "PostDate": "30/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Hi JOJO, Wanted to stop by and wish you lots of luck on Friday with your first chemo..Will be thinking of you!! The first time is the worst..all the unknowns, relax, breathe,drink lots of water, or maybe even take a nap. When you feel up to it, drop us a post here and there let us know how you are okay? keeping you in my prayers, cj.",
      "MessageIndex": 89,
      "PostDate": "09/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "good for you sbeach!! you do all the research first!! educate yourself, it will make the decision process easier for you!! Thank you for your kind words, yes they surely have come along way in treating breast cancer patients..Thank God! will be looking for your posts, hugs, cj.",
      "MessageIndex": 3,
      "PostDate": "04/09/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/530192-chemo-taxotere-cytoxan.html",
      "Title": "Chemo with Taxotere and Cytoxan"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Oh Willo, so sorry you are going through all this! But..they found something there and now you are taking action!thats a positive! good thing you called them back..From what I have learned, you must be proactive where your health is concerned, and always ask questions..if you dont get an answer that you can understand, keep asking until you do! Will pray for you...that you have good news! Keep posting here and let us know how things are going for you okay? I wish you well! cj.",
      "MessageIndex": 2,
      "PostDate": "03/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/495582-diagnostic-mammo-report.html",
      "Title": "Diagnostic mammo report"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Dear Bellamay..you sure have my prayers..what an awful thing to have happened to you! I have implants as well, but chose saline because I feared something like this would happen to me...Ive always been the one who has had things go wrong...things that happen one in a million! You have really been through so much..between the dx, treatment and illnesses you have. There have been things which I have done..decisions I have made, without fully understanding the potential pitfalls...I ask more questions now..and re-ask if I dont understand..I always bring someone with me to my appt.s, cant seem to grasp all of what is being said (chemo brain?)...and I always ask for test results in writing. But as you know, everything happens so fast..its really difficult. I hope that you can find someone to help you with your current health problems. Thanks for taking the time to tell your story..I think when other women..or men for that matter, read this..it will make us stop and think about making sure we educate ourselves about what is happening with our bodies..so thanks for that.. Im praying for you, and wishing you well gentle hugs to you, cj.",
      "MessageIndex": 1,
      "PostDate": "10/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/551635-breast-cancer-1991-implant-issues.html",
      "Title": "Breast Cancer in 1991 & Implant Issues"
    },
    {
      "AuthorID": "cjammom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cjammom",
      "Content": "Oh Linda..I am so sorry to hear about the back problems..Oh try not to let it get you down..its easier said than done..But you sound like such a nice lady, youve got so much to offer people! My motto is..if you cant fix it, find the best way to live with it! What can you do to make some changes to feel better..did they give you any suggestions? Here I go again..but did you try PT for it? sorry if youve already mentioned that..I have such an awful memory! How about maybe water aerobics? I go every now and then to night classes at the YMCA, but when its too cold outside my muscles tense up bad so I will only go on warm days..but maybe you could look into doing that..it really doesnt put much stress on the body. I will say a prayer for you..that the cortisone shot helps your hip and legs! I did get some relief for my knees. you have a great weekend too...we are back to having alot of rain again!! cant wait for loads of sunshine.. sorry your feeling down..wish I could send you some happy face balloons to cheer you up..okay so just pretend I did!! cj.",
      "MessageIndex": 79,
      "PostDate": "27/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    }
  ]
}