{
  "AuthorID": "cls1",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cls1",
  "Posts": [
    {
      "AuthorID": "cls1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cls1",
      "Content": "I received A \"benign\" report from the Mammogram & US...BUT this is what it says. \"Exaggerated view shows bulge from pectoralis in the deep central breast but no specific mass or calcifications. if pain or lump persists unexplained, MRI is more sensitive for occult leision or chest wall leision. \" Where should I go from here? If it's benign, I don't need further testing correct? I still have pain, but it could be anything! I feel stupid asking for an MRI if it's not needed. WHAT WOULD YOU DO? Help.",
      "MessageIndex": 0,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/960625-hellp-results-im-confused.html",
      "Title": "Hellp! Results... I'm confused."
    },
    {
      "AuthorID": "cls1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cls1",
      "Content": "Wednesday is MRI. Crossing fingers.",
      "MessageIndex": 2,
      "PostDate": "26/08/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/960625-hellp-results-im-confused.html",
      "Title": "Hellp! Results... I'm confused."
    },
    {
      "AuthorID": "cls1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cls1",
      "Content": "Hello. My name is Christi. 38yrs old. I went to the doctor for my regular checkup and also had some discomfort (bruised feeling) along my bra line. I figured it was my rib from a poor fitting bra or something? She sent me in for a Mammy & Ultrasound & xray of the ribcage. They did the Mammy & then called me back for 5 additional pictures to try and get closer to the chest wall (very uncomfortable) they used different sorts of trays (if that makes sense to anyone). There was a spot that needed to be looked at closer apparently. Also when the tech was taking the pictures, she kept putting an arrow towards the breast wall on the bottom.... Next I went to the ultrasound room where they did all of 45 seconds (not exaggerating) and only looked at the base of my breast (nowhere else?) I am assuming this is good news? The us tech didn't seemed concerned, however no one gave me definative answers. In previous Mammy/Ultrasounds, They have always said everything looks good. Now of course, I'm worried. I can't feel a lump or anything. AND I've heard in most cases breast cancer is Not painful. Now I have to wait and see I suppose. I'm not sure why I decided to post other than I am very antsy, and would love to hear other stories that might be similar (or not) to mine. HELP! Thanks for listening..... Christi",
      "MessageIndex": 0,
      "PostDate": "20/08/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/960505-help-please-scared-after-mammo.html",
      "Title": "Help please. Scared after Mammo"
    }
  ]
}