{
  "AuthorID": "connie21",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/connie21",
  "Posts": [
    {
      "AuthorID": "connie21",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/connie21",
      "Content": "My thoughts are with you too. Please keep us posted. When I had the needle wire biopsies I was pretty emotional about it and no localization was used, but I was anesthesized for the biopsy part and all in all it was okay and just about a 1 1\\2\" incision w/ stitches covered by dressing. Tylenol for pain was fine and I just had to watch activities while I healed. I was in hospital initially for a hysty and while on the table had the LB biopsy. Two weeks later came back into hospital for MRM of LB for stage 1 in-situ comedo carcinoma. Two years later back in for simple mastectomy for multiple calcifications and lobular hyperplasia in which enlarged lymphs found. I'm still here after 16 years and doing fine. Ya'll hang in there. Take each day, one foot after the other. Sometimes you think you're sailing along fine, and out from behind a wall you'll get hit with a brick and emotions get you going Its normal. This is a lot to handle. As women we tend to put ourselves last behind caring for everyone else. This is a time for YOU. And as nurses (I'm an RN) we care for others before ourselves too. We have to remember if we dont' take care of ourselves, we can't take care of others. Love and hugs.",
      "MessageIndex": 23,
      "PostDate": "18/03/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "connie21",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/connie21",
      "Content": "They're going in to take a look, see where the margins of the tumor are, if it is contained (in situ), or outside the margins. Its in your best interest. I know its scary. They'll do a path on it and see what kind of breast cancer it is (there are several types and each one has a \"personality\" and likes to do different things). You'll need to know what kind you have so you can learn about it and make good decisions in your treatment. Its key in survival. I'll be 16 years out this July and am doing fine. A loss of breast tissue - life. Reconstruction can be done with good results. Keep us posted please. Prayers for you.",
      "MessageIndex": 22,
      "PostDate": "18/03/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    }
  ]
}