{
  "AuthorID": "cuddlekat1",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cuddlekat1",
  "Posts": [
    {
      "AuthorID": "cuddlekat1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cuddlekat1",
      "Content": "Hi I wrote about a small hard bump right next to my aerola. I went t o the doctors and he said it was a sabaceous cyst and gave me some antibiotics. He said if it didnt go away in 2 weeks he would have a surgeon remove it. He said its caused by oil glands. Has anyone else every had one of these? I also went for a mamagram today I wonder if this will show on that. This is my 1rst mamagram in 3 years and I just turned 40 in March does that seem accurate? Kim",
      "MessageIndex": 0,
      "PostDate": "04/11/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/221994-sebaceous-cyst.html",
      "Title": "Sebaceous cyst"
    },
    {
      "AuthorID": "cuddlekat1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cuddlekat1",
      "Content": "Dee thanks for the reply I just finished my antibiotics and it did not make it go away. So I did what my gynagoligist said and called his office back. Now he is kinda scaring me he wants me to see a surgeon and see if they want to byopsi it or leave it alone or remove it. Im really confused cause when I seen him 2 weeks ago he said dont worry about cancer it is a sabacous cyst and if the antibiotics dont make it go away we would just remove it. I had a mamagram and it came back fine. He says this is on the skin so that was good. Although I really worry about everything and I had thought my mind was relieved. Now Im not sure what to think. I did read that they usually give antibiotics if they are inflamed which mine wasnt, so Im not sure why he gave me them in the first place. Yours wasnt on the aerola, have you ever heard of one there? Thanks. Kim",
      "MessageIndex": 2,
      "PostDate": "16/11/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/221994-sebaceous-cyst.html",
      "Title": "Sebaceous cyst"
    },
    {
      "AuthorID": "cuddlekat1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cuddlekat1",
      "Content": "I have had those on mine also. The nurse practioner called it something but was nothing to worry about. I always refered to them as milk bumps. I have one now that is larger then any Ive had before and its right next to my nipple. I was really wondering about it kinda scary. Mine is also the size of a pea. Wish someone else would reply would like to kknow more.",
      "MessageIndex": 1,
      "PostDate": "26/10/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/216830-small-hard-bump-areola.html",
      "Title": "small hard bump on areola"
    },
    {
      "AuthorID": "cuddlekat1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cuddlekat1",
      "Content": "Lisa thanks for your reply, it does make me feel better. I just had a hystarectomy 6 weeks ago and feel so stupid that I didnt have it checked out then. I really hope everything goes as well as it did for you. Did they do out patient surgery to remove the cyst? Kim",
      "MessageIndex": 4,
      "PostDate": "01/11/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/219930-scared-small-hard-bump-next-nipple.html",
      "Title": "scared small hard bump next to nipple"
    },
    {
      "AuthorID": "cuddlekat1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cuddlekat1",
      "Content": "Please if anyone can help. For the last 3-4 months I have had this smalll bump on my aeroa area right next to my nipple to feel it its hard and doesnt hurt its also prutruding. Ive had something like this before but smaller and was told it was nothing to worry about. I am always fearing the worse about everything. Has anyone else experienced this, I was wondering if maybe its a boil or cyst but thought that would hurt. As usual Im scared to death Im 40 yrs. old. thanks ahead of time for any reply.",
      "MessageIndex": 0,
      "PostDate": "27/10/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/219930-scared-small-hard-bump-next-nipple.html",
      "Title": "scared small hard bump next to nipple"
    },
    {
      "AuthorID": "cuddlekat1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/cuddlekat1",
      "Content": "I have a appointment for a mamogram next Thurs. wouldnt a boil or cyst hurt?",
      "MessageIndex": 2,
      "PostDate": "27/10/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/219930-scared-small-hard-bump-next-nipple.html",
      "Title": "scared small hard bump next to nipple"
    }
  ]
}