{
  "AuthorID": "daughter issues",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/daughter issues",
  "Posts": [
    {
      "AuthorID": "daughter issues",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/daughter issues",
      "Content": "I called BC medical and talked to them. I'm 100% covered with the exception of prescriptions. The only exception to that is for prescriptions for cancer. I was advised to see an oncologist, but I'm going with what's been advised here and looking to be able to go to a GP instead. I'm really hoping it's stress related and not cancer. I've had a tremendous amount of stress in the last month. Thank you for the advice, and I will definitely let you know what's going on",
      "MessageIndex": 4,
      "PostDate": "23/09/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/636267-what-else-can-cause-lumps.html",
      "Title": "what else can cause \"lumps\"?"
    },
    {
      "AuthorID": "daughter issues",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/daughter issues",
      "Content": "I did a breast exam and found a couple lumps which were never there before. I'm 32 and I'm scared. I've never had a mammogram, but I'm not afraid of that. What's got me terrified is that I lost my Mom a year and a half ago to lung cancer and my father is battling colorectal cancer again (and apparently not doing good). My fiance is just finishing his battle with thyroid cancer (just waiting to see if the doctors managed to get all his thyroid). I also just moved from my \"home\" province and haven't got coverage in my new province yet so I have to rely on my medical from where I moved from. My coverage in my new province won't kick in until November 1st, but I know that I can't wait that long to do anything about this. I can't do anything about this yet until I talk to medical from BC (where I moved from) to find out what they will pay for. I've been healthy, so this comes as quite a surprise. Besides cancer, is there anything else that could possibly cause these lumps? They're not very big, but I know that doesn't really mean much other than I'd have hopefully caught it sooner rather than later. I guess I'm looking for reassurances because I can't help but think of the worst, which would put my 3 year old daughter in her abusive father's house. I don't care about doing the chemo, radiation, losing my hair etc.",
      "MessageIndex": 0,
      "PostDate": "22/09/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/636267-what-else-can-cause-lumps.html",
      "Title": "what else can cause \"lumps\"?"
    }
  ]
}