{
  "AuthorID": "DeborahA",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/DeborahA",
  "Posts": [{
    "AuthorID": "DeborahA",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/DeborahA",
    "Content": "I have quite a similar spot on my breast. We had some kind of itchcy, awful dermatitis, were seeing dermatologists on a monthly basis, I have scars on my body and so does my husband from the episode. We were treated for scabies, for non-specific dermatitis, you name it. I spent $1.500. in the first six months of 2002 on prescriptions and OTC meds, mostly steroid creams and antibiotics. It finally stopped, spontaneously, when my husband changed jobs, I knew others in his workplace were complaining of strange rashes as well. I had it much worse than my husband did, I couldn't wear street clothng and actually had to quit my job, I couldn't bear anything around my waist. I'm lucky I had freelance connections to fall back on. I don't know if it was a chemical or a parasite or whatever in his workplace, but we are all clear, thank goodness. My skin cleared up everwhere 6 months ago, everywhere except this one tiny patch just on the the areole of my left breast. This grew larger and more irritated and in spite of Bactroban, etc., it's not improving. It hurts, too much to press on and feel around to see if there is a lump underneath or around. On reading on the net, it fits the parameters for Paget's. It stays raw, gets a little crusty, itches, doesn't ooze, but doesn't ever heal, never gets smaller. I've never gone back to bras though I am in regular clothes agiain after the dermatitis. Bras just hurt too much, kind of scraping the area. It's about the size of a cigarette burn, maybe a little larger, red, raw, hurts way too much to be touched even quite gently through the top of my nightie during sex. It makes me not want sex at all, I draw back, afraid I'll bump it, scrape it. This is beginning to be a real problem, the lack of intercourse and normal sex, though I take care of my husband, I just have no desire for regular, mutual sex because of fear of being hurt. My right breast is fine. I've blown off my last couple of mammaograms, I'm 48, in full peri-menopause. I was kind of hoping it would finally heal like the others (though they looked different, smaller, more like pimples) until my best friend stopped by today and I showed her and she got quite upset. She's a cancer survivor, so her fear is infective. I am calling the gyn first thng Tuesday morning, in the meantime, should I even be fretting? Pagets is only 1% of breast cancer cases, is that, along with my weird circumstances, enough to disqualify me from further worry? Any advice? Anything to try to apply to the lesion to cut down on the topical pain, something that might heal it? I have Bactroban from my dermatologist days, nothing to stop topical pain. Should I not add anything to the Bactroban until I see my gyn? It doesn't seem to be helping. I just started taking antibiotics from the dentist, I have an infected tooth, I'm wondering if they will help, though antibiotics didn't do a thing for the original dermatitis, whatever that was. Thanks for letting me get the questions and explanations out, also thanks for letting me vent. Worry is a terrible thing, I can feel my hair get grayer. [This message has been edited by DeborahA (edited 08-31-2003).]",
    "MessageIndex": 8,
    "PostDate": "30/08/2003",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25043-sore-breast.html",
    "Title": "sore on breast"
  }]
}