{
  "AuthorID": "Denise7676",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Denise7676",
  "Posts": [
    {
      "AuthorID": "Denise7676",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Denise7676",
      "Content": "Good Day, Everyone! I'm a 34 yr old recently enrolled in Nursing Assistant classes, and as part of the enrollment process I had to have a complete physical done. During the physical, my dr found a lump on my left breast. She referred me to an OBGYN (I went with my own) and during that exam my OB found not 1 lump, but 2. She was certain that one of the lumps was a cyst, however she said the second one had a different feel to it, and wanted me to have a Bilateral breast sonogram. I go tomorrow afternoon for the sonogram. My question is why would they skip right over the Mammogram and go for a breast sonogram? Curiosity is getting the best of me, and causing panic. I have never had a mammogram, or any other breast related exams, and tomorrow will be a first for me. Also, will I be able to see the screen that shows the lumps, and would I have to wait until I speak with my doctor when she recieves the results? My doctor will be out of town until the first week in December, and I am really in a frenzie here. Anyone with any kind of feedback please, let me know. Thank you so much. . .",
      "MessageIndex": 0,
      "PostDate": "17/11/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/823983-going-breast-sonogram.html",
      "Title": "Going for Breast Sonogram?"
    },
    {
      "AuthorID": "Denise7676",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Denise7676",
      "Content": "I went for the the sonogram..... I was able to watch the screen while she did her work.. She I saw the two on the left breast, and they are very different from each other. One is a black kidney shaped mass, and the other is a white spot. Now, I didnt know I had one on my right breast. She took pictures of something there, and went over the same spot a few times. I didnt get to see the right side because I was turned away from the screen. In all she took a total of 48 pictures. I saw them at the bottom of the screen. When she was done she told me to get dressed and she would come back in because she wanted to ask me a few questions. When she came back in she had a white piece of paper with two circles on them one labled \"right\" and the other \"left\" and I was able to see the marks on them. She asked me these questions: 1- Is there a history of breas cancer in your family 2- have you ever had any type of breast surgery 3- have you ever been pregnant What did she ask these questions for? Also, is there a difference in how a breast cancer would look on the sonogram? I have an appointment with my doctor on Monday, and it just seems tooo far away. I am a nervous wreck and Im really scared.",
      "MessageIndex": 1,
      "PostDate": "18/11/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/823983-going-breast-sonogram.html",
      "Title": "Going for Breast Sonogram?"
    }
  ]
}