{
  "AuthorID": "dizzyblond",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
  "Posts": [
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Hi Christy, It is hard for me to think of all that you are dealing with right now. Please post and let us know how the mammogram was - we are pulling for you, and quite agree, dealing with one cancer at a time is ENOUGH!!!! Sending prayers, Robin",
      "MessageIndex": 1,
      "PostDate": "06/04/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/375585-hello-all-question-here-dense-breasts.html",
      "Title": "Hello All-Question Here-Dense Breasts"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Hi Judy! Glad you've had no \"after effects\" from the \"clamp-down\" x-rays! :-)) How precious life is when you've had to seriously take a look at cancer. Like you, how thankful I am that right now I don't have to deal with it. But, as I mentioned, my mom and sister both had post-men. BC, and I know my odds are higher. My husband was SO relieved when we met for the surgical consult to get the results of the biopsy, as was I, but I told him, it's not over. Every year I have the very real potential of going through this, of actually having to face the news no one wants to get. Every day is a gift, and how we realize this with much more clarity when we look at the possibility of having a very serious condition! I am fighting another health battle (uncompensated vestibular neuronitis) that has plagued me for 1 1/2 yrs. (The balance nerve in my R inner ear was damaged by a virus - the results have been unbelievably disabling, and I am just now beginning to feel able to get back into a sense of \"regular\" life, thanks to, among other things, a special form of physical therapy and the tincture of time.) One thing is for sure - when our bodies are healthy and we are able to function and live life, it is a HUGE reason to be thankful!!!! I am so ready for some grandbabies - our youngest son will be getting married this Nov., and I think he and his precious fiancee will be the first ones to provide us with some babies to cuddle and spoil!!!!!!! How wonderful that you've already been blessed with some!!!!! Hopefully your grass is now mowed - squish, squish..... but I bet all that rain keeps everything so beautiful and green! We're on the edge of the desert, so I'm trying to soak in all the green now, before it turns to brown!!!!! Have a lovely Sunday!!!! XOX ~ Robin",
      "MessageIndex": 9,
      "PostDate": "21/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/392880-neo-density.html",
      "Title": "Neo Density?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Thinking of you today, and praying that that diagnostic compression mammogram will rule out the need for any further investigation - sounds like you have a VERY full calendar, and I'm praying that you won't have to deal with a biopsy in the midst of it all. Do fill us in on all the questions you ask them today and what they have to say!!",
      "MessageIndex": 3,
      "PostDate": "19/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/392880-neo-density.html",
      "Title": "Neo Density?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "I wasn't sure what the ABBI procedure actually was, so I looked it up. The machine looks exactly like the one that I had my biopsy on. In fact, the procedure sounds exactly like the one I had done according to what I read on the website. With the mammogram reading right then and there while the radiologist was doing the procedure, they were able to get the entire area of density that was pinpointed in the diagnostic mammogram - it ended up being fibrocystic tissue, nothing more. Since my mother, my sister and my sister-in-law all were diagnosed with early stage breast cancers and are doing so well, I was certain that even if the biopsy came back with news I didn't want to hear, it would be OK. If your dr. is telling you it doesn't look alarming I would say that's good. (We know nothing is for certain till they get in there, but I think a comment like that counts for something!!!) Just another step in taking care of yourself.... and by next week you'll have this all behind you. Let us know how it goes tomorrow!!",
      "MessageIndex": 1,
      "PostDate": "18/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/392880-neo-density.html",
      "Title": "Neo Density?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Hurray!!!!!! The news is great!! As horrible as it is to have to go through such an ordeal, we DO know that we'd much rather have the radiologists and techs be as thorough as they can!!! (I know when I was having all those extra twisting, super-compression diagnostic views, the tech kept apologizing, and I kept telling her, \"You do what you need to do to get the pics you need to get!\" I'd so much rather be safe than sorry!!!!) Interesting about you needing to note the difference between the boiopsy incision and the ABBI procedure. Did you have an actual 2\" incision on the outside of your breast? I had a very small incision - it's been about a month now, and the scar is about 1/4\" long. I had a titanuim marker placed internally at the site of the tissue excision for future reference. Sigh.... I guess we just take these things year by year. One thing's for sure - life becomes more and more precious as we deal with potentially life-changing health issues! I treasure everyone and everything even more than I ever did - we know that it can all be taken away so quickly! So happy you can go and have a fantastic couple of weeks of so many fun celebrations!!!!!!! XOXOX ~ Robin",
      "MessageIndex": 5,
      "PostDate": "19/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/392880-neo-density.html",
      "Title": "Neo Density?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Cancer free for 19 years - excellent!!! I know exactly what you mean, though. (I have a long list of \"do's and don'ts regarding breast cancer, as well, cuz of family history.) While I was waiting for my biopsy, and then awaiting the results of the biopsy, I spent hours on the internet, as I'm sure you do, too. I happened to come across a website that gives you an opportunity to address specific questions like this to a specialist in breast care. Though I know I can't give the website address here, you might try doing a search for \"Breast cancer questions\" or something like that - you might feel better getting someone who is an expert to address your concerns. Or what about your own doctor?",
      "MessageIndex": 3,
      "PostDate": "01/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/387353-alcohol-breast-cancer.html",
      "Title": "alcohol and breast cancer"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Sorry for the lack of response, KD - my guess is that most of us here don't feel qualified enough to say, \"Don't worry about it, chances are it's nothing other than normal tissue that you're feeling.\" It probably is nothing more than something that's always been there but you've just noticed.... HOWEVER, the only thing to do here for peace of mind's sake is get yourself in for an appointment. Once it's checked out and you don't have to wonder about what it is, you'll feel 1000 times better and you can get this behind you!!!!! If you haven't already, call and make the appt. to be seen!!!!! I sure it's nothing - but once you hear that from a professional who can better explain what it is you're feeling, you feel so much better. Take care!",
      "MessageIndex": 4,
      "PostDate": "20/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/393129-male-breast-cancer.html",
      "Title": "Male Breast Cancer?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "I bet you are truly enjoying your weekend! (Somehow, the experience of going through a cancer scare makes every other \"color\" in your life so vivid and beautiful!!!!!) (And now I'm sure you'll be reminding the tech at your next screening - \"PLEASE NOTE MY SCAR!!!!\" ) How funny that you say you'd like to be in CA right about now.... I think I would actually like a little rain!!!! It's been hot this past week here in Southern California - in the high 80's, and I am NOT ready for summer quite just yet! Again, so glad you are now able to pour your undivided attention into the festivities at hand - hope they are all great!!!! XOXo ~ Robin",
      "MessageIndex": 7,
      "PostDate": "20/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/392880-neo-density.html",
      "Title": "Neo Density?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Hi Kalie, Although I don't have anything pertinent to add to this post, I just had to drop in to say that as I've been reading the little bits of your story here on this board - and as I have, you have been in my heart and in my thoughts. You sound like a fighter, and I just wanted you to know that someone on the west coast has been greatly touched by your current situation and will continue to be praying for you as you fight this cancer. I know your life is an inspiration to the many that are reading here, as well as those you are coming in contact with in real life! Take care and fight strong!!!!! Robin",
      "MessageIndex": 9,
      "PostDate": "30/06/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/397121-living-cancer-second-time-around.html",
      "Title": "Living with cancer the second time around"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Interesting question, Juby - my \"unscientific\" guess would be that the absorbtion of a small dabbing of rubbing alcohol through the skin would be much less than that of alcohol that is ingested and then dispersed through the bloodstream. Different chemical make-up, as well. I wonder if you're comparing apples to oranges?",
      "MessageIndex": 1,
      "PostDate": "30/04/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/387353-alcohol-breast-cancer.html",
      "Title": "alcohol and breast cancer"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "This may just be the policy and the way things are handled with your particular health care provider. Try not to jump to conclusions quite yet, as hard as that is. The waiting is hardest.... please post and let us know as soon as you can. Our thoughts will be with you!!!",
      "MessageIndex": 3,
      "PostDate": "07/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/389365-palpable-finding-prominent-ducts.html",
      "Title": "Palpable finding with prominent ducts?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Try your very best to relax and don't try to deal with what you don't know yet. (We KNOW from experience how hard this is!!!!) I would guess that what you read at the bottom of your records is probably nothing more than a note indicating that you are being referred for biopsy, which, at least in my HMO, always means a consult with the surgeon to follow, regardless of what the results are. You will know more tomorrow (you can check about the breast specialist them), so until then, try to keep busy and occupy your mind with other things. It is so easy to be totally consumed with all the \"what ifs\" - but just try to deal with this one step at a time. All you know at this point is that there is something they want to check further - and statistics show that for many, if not most, that concern ends up being nothing serious. Our thoughts and prayers are with you!!!!",
      "MessageIndex": 1,
      "PostDate": "07/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/389365-palpable-finding-prominent-ducts.html",
      "Title": "Palpable finding with prominent ducts?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "So glad that your biopsies will be done this week - you will soon have a better handle on just what's going on.... and it may be nothing serious. Even if the results are not what you are hoping and praying for, breast cancer is VERY treatable. Be sure to let us know how Thursday goes!!!! XXXXOO~",
      "MessageIndex": 5,
      "PostDate": "09/05/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/389365-palpable-finding-prominent-ducts.html",
      "Title": "Palpable finding with prominent ducts?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Wow!!! What an ordeal you have been through!!!!!!!!!!!!!!! Though the good news is that you have been checked out in every way possible and everything looks clean, I am amazed at the post-biopsy reaction you have had to endure!!! I have noticed some tenderness at my biopsy site (had it in April) - mostly deep inside), but it is absolutely nothing like yours. Is there a possibility that you can have this continuing pain evaluated by another dr.? What a nightmare you have had to endure.... and maybe the residual pain you are experiencing now is simply taking time to resolve - those poor breasts have been through A LOT!!!!!!! Does taking OTC pain reliever (part. an anti-inflammatory) help at all? Best of luck to you as you fight though this - hopefully the worst part is over and you are on your way to healing!!!!",
      "MessageIndex": 1,
      "PostDate": "01/07/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/406084-please-help-me-long-term-pain-after-biopsy.html",
      "Title": "Please help me...long term pain after biopsy"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Dear Elga, I have never heard of this type of procedure, but my experience is so limited; my mother's breast cancer surgery was many years ago, and my sister's breast cancer was recent - but neither one of them were question-askers at all throughout their ordeals. I am hoping that someone here knows exactly what you're referring to and will ease your mind by posting. It sounds as if your dr. is being throrough in checking everything - sent. nodes, etc. Could you call his office and perhaps talk to a nurse who could give you further clarification on what will be going on during your surgery? Thoughts and prayers are with you.. so sorry this has had to take so long! ~ Robin",
      "MessageIndex": 1,
      "PostDate": "25/06/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/404367-harpoon.html",
      "Title": "Harpoon?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Elga, So glad you were able to get some information!! It does indeed sound like you are in good hands, and no doubt that will ease your mind (at least a little bit!) as you now wait for your surgery. Will keep up the prayers and thoughts on your behalf - do post when you're up to it!!!! XOXOX ~ R",
      "MessageIndex": 3,
      "PostDate": "27/06/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/404367-harpoon.html",
      "Title": "Harpoon?"
    },
    {
      "AuthorID": "dizzyblond",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dizzyblond",
      "Content": "Hi Emily, Though you've already heard my story, thought I'd start your post off with my info. I had my stereotactic biopsy on the 6th of this month, just barely 3 weeks ago. The clip is tiny, and is routinely placed for future reference. I absolutley cannot feel it, and have had no problems. In fact, I left for a long-planned vacation about a week after the biopsy and had no problems at all. It will be fine.... try to relax and remember that this is a common procedure which rarely produces the issues you've been concerned with. Our love and prayers are with you. XOXXO ~ Robin",
      "MessageIndex": 1,
      "PostDate": "25/04/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/385856-titanium-clips-they-use-during-breast-biopsies.html",
      "Title": "titanium clips they use during breast biopsies"
    }
  ]
}