{
  "AuthorID": "DKScully",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/DKScully",
  "Posts": [{
    "AuthorID": "DKScully",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/DKScully",
    "Content": "Yesterday, I went in for a routine annual exam. My gyno was checking my breasts and rather quickly grabbed my hand and said \"do you feel that?\" and I did. I'm 30 years old... Never been pregnant. Always have had abnormal periods, despite being on the pill. My mom had a cyst removed from one of her breasts when she was in her late 20s, and there's no history of breast cancer in our family. But I'm still quite worried. There are no exterior signs of anything being wrong. I'm feeling a bit of soreness, but that might be all in my head. It's not severe, but it's there. It hurts in my underarm area (which I started worrying about - thinking lymph nodes - but I read somewhere else on here that that could be from the fact that I'm constantly trying to find the lump and such with that arm and I'm stretching funny... hopefully that's the case). The lump is big... probably chicken nugget sized and seems to be attached to what I think is my milk duct. I can put my hand around it and move it, but but it seems attached to the structure in my breast that I think is the milk duct. My doctor recommended that I see a mammography specialist/surgeon but didn't tell me much other than the fact that \"this happens to a lot of women and don't worry.\" But I'm worrying. I'm not sure what I expect from all of you, but I just had to tell someone. My mom and boyfriend know but I just feel like I need more of a sounding board... that's how I deal with things. Any advice or insight would be great. Thanks so much!",
    "MessageIndex": 0,
    "PostDate": "05/03/2011",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/838702-gynecologist-found-lump-im-scared.html",
    "Title": "Gynecologist found a lump... and I'm scared."
  }]
}