{
  "AuthorID": "dnksmom32",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dnksmom32",
  "Posts": [
    {
      "AuthorID": "dnksmom32",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dnksmom32",
      "Content": "I'm so sorry that your results turned out to be cancer. I don't really know what to say except I will be praying for you. Was the cancer contained?",
      "MessageIndex": 10,
      "PostDate": "15/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "dnksmom32",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dnksmom32",
      "Content": "I just had one yesterday but to my nipple. I'm really impressed with how well I handled it. I'll be honest, I was scared to death. The local was the worst thing of the entire process. It stung throughout my breast but nothing at all that I couldn't handle and breathe through. After that was over the only thing I felt was a little uncomfortable pressure. The longest part of the entire process was applying pressure to stop the bleeding. They gave me a bunch of gauze and an ice pack and sent me on my way. NOW, I will tell you I was uncomfortable once the numbness wore off. I don't know if it was because my biopsy was done directly to my nipple or what but I could not move without some discomfort. This morning when I woke up I felt great!! I'm still bleeding a little bit but there is NO discomfort at all! I wish you the very best of luck and hope I didn't scare you at all. Just know the local is the worst part (much like a cavity being filled) but not horrible. It just is so weird for them to be putting a shot into your breast period. I really hope I helped. Good luck.",
      "MessageIndex": 3,
      "PostDate": "07/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "dnksmom32",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dnksmom32",
      "Content": "I'm looking for some insight. I'm on the countdown until I have to have a nipple biopsy and am looking for some answers. About 5-6 weeks ago, I noticed my nipple was EXTREMELY itchy and had horrible dry skin. I started using creams but didn't worry since my annual was coming up within a few weeks. She took one look and scheduled a Mammogram. A week ago I went to the Breast Imaging Center and they did a Mammogram and an Ultrasound. She didn't see anything but said if it were early Paget's wouldn't show up except in a biopsy. So, she sent me home with some cream to use for two weeks. If in that two weeks it clears up - I don't go back. If not....I have to have a nipple biopsy to check for Paget's Disease of the Breast. Now, everything I can find tells me if it were eczema it would be on BOTH nipples - not just one....or would start on the aerola not the nipple. I'm confused and worried and scared. It's scary to have anyone say it might be underlying breast cancer but we're going to wait two weeks and see if this cream clears it up. I am scheduled for the biopsy on the 6th. It's still not clearing up. It's red, sore, irritated and itchy and so far has not spread to my aereola. Has anyone had anything similar? Does anyone have any suggestions? Any positive feedback? Thanks.",
      "MessageIndex": 0,
      "PostDate": "27/11/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/449851-pagets-disease-eczema.html",
      "Title": "Paget's Disease/Eczema"
    },
    {
      "AuthorID": "dnksmom32",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dnksmom32",
      "Content": "I'm right there with you. I posted but no one answered - a little freaked out and SO good to talk to someone who's going through the same thing. Ijust had a nipple biopsy done yesterday to rule out Paget's disease. I should know the results by the end of the day. It's crazy and scary - huh? I already had the mammogram and ultrasound but they couldn't tell much - except there was a little bit of change behind my nipple and a small cyst. BE HAPPY - you have a proactive doctor. Everything I've read says this is the number 1 misdiagnosed disease because so many people put it off to thinking it's eczema and then it spreads...so at least you'll know for sure. So was your biopsy on your nipple? Mine is still bleeding. Not sure why that is. Good luck and I'd really like to chat more.",
      "MessageIndex": 1,
      "PostDate": "07/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452486-pagets-disease.html",
      "Title": "Paget's Disease"
    },
    {
      "AuthorID": "dnksmom32",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dnksmom32",
      "Content": "I got my results - it is benign - THANK GOD! I'm hoping you get the same exact results. I do have to go on to another doctor because there is something in the tissue but it's not cancerous. I honestly couldn't repeat what the doctor said. Lots of big words and I was just panicing in my head, Ok, she said benign. Is that good or bad???? My brain was overloaded. I'm not opting out of the thread just because mine came back good. I want to hear how your results turn out. Good luck and I'll be thinking about you.",
      "MessageIndex": 3,
      "PostDate": "08/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452486-pagets-disease.html",
      "Title": "Paget's Disease"
    }
  ]
}