{
  "AuthorID": "donnamae",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/donnamae",
  "Posts": [
    {
      "AuthorID": "donnamae",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/donnamae",
      "Content": "Hi Kathryn, I too have been to see my obgyn last week as well and she found a bb size lump in my left breast also about the same place as you were saying yours is. I know how you are feeling cos I am having the same feelings right now. There is breast cancer in my family--my mom is a survivor. I am only 42 for god sake and I am saying why me and why now? I went for the mamgram and ultrasound on friday and I am waiting for the results this week. My prayers are with you and its nice to talk to others that have been through this to help in coping with it. I have had this scare once before about 7 - 10 years ago and it turned out to be nothing but you wonder when that nothing is going to turn out to be something. I am scared to death of the chemo treatments-getting sick, losing the hair and so forth. When will you know what your results are?",
      "MessageIndex": 3,
      "PostDate": "22/06/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/699283-dr-found-pea-sized-lump-my-breast-today.html",
      "Title": "Dr. found a pea sized lump in my breast today...??"
    },
    {
      "AuthorID": "donnamae",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/donnamae",
      "Content": "Wow Kathryn Im being sent for an MRI also this Friday. I got a letter toaday from the hospital that I had the test done at and it said that the Mamogram and ultrasound demonstrated a finding whch requires a MRI study in order to complete the evaluation. So that is kinda scarey! Did you get your results of the MRI yet? Best wishes to you for good results. And thanks luvdgs for your kind words and support. That is great that your sister-in-law doesn't have to have any treatment. My mom had a lumpectomy done 10 years ago and I think a few nodes removed but she had to have both. Do you know why she doesn't have to have the treatments?",
      "MessageIndex": 6,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/699283-dr-found-pea-sized-lump-my-breast-today.html",
      "Title": "Dr. found a pea sized lump in my breast today...??"
    }
  ]
}