{
  "AuthorID": "dorri",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dorri",
  "Posts": [
    {
      "AuthorID": "dorri",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dorri",
      "Content": "Today my mother in law got the results of her mammogram. The doctor said they think it's cancer. She is being sent for an ultra sound on March 2nd, and the doctor said there's a possibility they'll do a biopsy at the same time. Please say a prayer that she'll be given peace and patience as she waits..I feel numb about this, and I'm still hopeing and praying for a miracle that it's not cancer....",
      "MessageIndex": 3,
      "PostDate": "21/02/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/362384-mil-has-elongated-thickening-breast.html",
      "Title": "MIL has elongated thickening in breast"
    },
    {
      "AuthorID": "dorri",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dorri",
      "Content": "Thank you for the encouragement. I pray that my MIL's thickening is also harmless.",
      "MessageIndex": 2,
      "PostDate": "03/02/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/362384-mil-has-elongated-thickening-breast.html",
      "Title": "MIL has elongated thickening in breast"
    },
    {
      "AuthorID": "dorri",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dorri",
      "Content": "My mother in law has an elongated thickening in her breast about the length of a small finger. She is big breasted. Her doctor booked her for a mamogram on the 15th. She is scared and we are worried. I know she has to wait for her mamogram results, but could these long thickenings be anything other than cancer?",
      "MessageIndex": 0,
      "PostDate": "01/02/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/362384-mil-has-elongated-thickening-breast.html",
      "Title": "MIL has elongated thickening in breast"
    },
    {
      "AuthorID": "dorri",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dorri",
      "Content": "Thank you so much for your response. My mother is also a 11 year breast cancer survivor. I am worried about my mother in law. Thanks for sharing the encouragement. I feel for her so much that I'm having regular anxiety attacks, I can only imagine what she is going through. My prayers and wishes are with you also, that the biopsy of your lump will come back okay. It's good that you are keeping an eye on yourself. All the best... (((((( hugs )))))))",
      "MessageIndex": 5,
      "PostDate": "21/02/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/362384-mil-has-elongated-thickening-breast.html",
      "Title": "MIL has elongated thickening in breast"
    },
    {
      "AuthorID": "dorri",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dorri",
      "Content": "CAT welcome, and thank you. I appreciate your prayers so much. My MIL is doing fine, but is still waiting to get a call about her surgery date. Maybe they will call this coming week to set it up. She's very anxious to have this removed as soon as possible.",
      "MessageIndex": 7,
      "PostDate": "12/03/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/362384-mil-has-elongated-thickening-breast.html",
      "Title": "MIL has elongated thickening in breast"
    },
    {
      "AuthorID": "dorri",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/dorri",
      "Content": "My mother in law is 78 years old. Aprox 5 years ago, she had her breast removed because she had cancer. This year she was diagnosed with cancer in the remaining breast. On October 19th she had a mastectomy. She is not one to complain but she is complaining about being unusually tired and since the surgery she seems to have lost her appetite? She says she eats because she has to, not because she wants to. She does go for her follow up in a couple of weeks. She was given antibiotics a couple of weeks ago, but she finished a week ago, and still she has a very low grade temp and no appetite. Is any of this normal to have a month later. I know surgery can affect one's energy levels but appetite??",
      "MessageIndex": 0,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/928558-normal-after-breast-surgery.html",
      "Title": "Is this normal after breast surgery?"
    }
  ]
}