{
  "AuthorID": "Ekris3",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Ekris3",
  "Posts": [
    {
      "AuthorID": "Ekris3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Ekris3",
      "Content": "Hi. Sorry to hear you've had such trouble. Hope this one works for you. Was wondering if one your previous meds was Xeloda. My Mom is now on that but it doesn't seem to be working. I keep wondering what might be next.",
      "MessageIndex": 2,
      "PostDate": "11/04/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/272699-metastatic-breast-cancer-anyone-abraxane.html",
      "Title": "Metastatic Breast Cancer -- anyone on Abraxane?"
    },
    {
      "AuthorID": "Ekris3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Ekris3",
      "Content": "Hi Kalie...sorry so long to get back on here. My Mom was first diagnosed in 1996..had mastectomy, chemo and radiation. Was on tomoxifen for the 5 years and then nothing after that. She was cancer free (or so they say) until Jan '03 when they determined she had mets to the bones. Dr's put her on Arimidex and that worked for awhile. Then when that was no longer working they switched her to Xeloda. But she had bad reaction at that time so they put her on Taxotere. About 6 months of that and she was not responding so they've tried the Xeloda again but at a slightly lower dose than the first time. She did pretty well for a few months and now her cancer markers are back up and increase in the bone mets. In one of the routine CT scans they found problems with her kidney. She's having a stent put in tomorrow to see if they can open up her kidney. There are also suspicious problems with her lung and liver. It's so confusing to read the test reports what the radiologist finds and then get the Oncologists take on everything. Often times it's not the same. And my Mom is not always willing to try all the drugs...depends on what the side effects are. They mentioned the navilbene at one time but opted for taxotere. All this was going on at the same time my father was fighting prostate cancer. He passed away this past August. I have read and read all about both diseases and feel like I know just only enough to be dangerous.",
      "MessageIndex": 5,
      "PostDate": "20/04/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/272699-metastatic-breast-cancer-anyone-abraxane.html",
      "Title": "Metastatic Breast Cancer -- anyone on Abraxane?"
    },
    {
      "AuthorID": "Ekris3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Ekris3",
      "Content": "My Mom didn't survive her 2nd round of cancer either. She was cancer free for 6 years and then it returned to the bones. She lived almost 3 years from that diagnosis. She was on first one drug, then another, etc. The treatments would work for awhile and then the cancer would become resistant to it. Before it was over it spread to her liver. Sorry I don't have a positive story for you but your Mom may respond better to the treatments. There were alot of different drugs out there and it seemed there were still more to try with my Mom but she became too weak for the treatments. Hope things go well for you. Enjoy the time you have with your Mom.",
      "MessageIndex": 4,
      "PostDate": "15/06/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/397121-living-cancer-second-time-around.html",
      "Title": "Living with cancer the second time around"
    },
    {
      "AuthorID": "Ekris3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Ekris3",
      "Content": "Wondering if anyone else out there with Breast Cancer was on the chemo drug Xeloda. My Mom has had cancer for nearly 9 years now and has been taking this drug for several months. She started with Arimidex on this latest round. That worked for awhile but then stopped so she was on Taxotere for several months. That worked for awhile and then they went to this Xeloda. She was doing well but now her counts are back up and she's in for another round of countless tests. Dr told us that this drug usually works for extended period of time but she's only been on it since about Oct '04. I'm very concerned..my father passed away in Aug '04 from Prostate Cancer w/mets to bones, liver and brain. I see my Mom now showing some of the same signs as my Dad. We know hers is in her bones and there have been suspicious places on her liver. I'm very afraid we're headed down that same road again. Anybody with any experience with this drug? And what drug would be next? Sorry so long but we don't go back to Dr until Mar 25. Thanks...",
      "MessageIndex": 0,
      "PostDate": "17/03/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/264063-breast-cancer-xeloda.html",
      "Title": "Breast Cancer and Xeloda"
    },
    {
      "AuthorID": "Ekris3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Ekris3",
      "Content": "Sorry nobody has answered your post. My Mom took the Faslodex injections but her case is probably not a fair judge of the drug. That was the last drug she was put on before she passed away so her cancer was pretty far gone by the time they started Faslodex. They would try one drug until it stopped working and then go to another. I don't think there was any particular order to them either because several times she had her choice. I do remember the Doctor saying that it takes awhile for it to start working though. Sorry not much help, but I did have a little exerience with the drug. Oh yeah, you really have to have a nurse that knows how to give that injection...they were training a new one once with my Mom and she really did a number on her....bruised for a long time.",
      "MessageIndex": 2,
      "PostDate": "09/02/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/362376-faslodex-how-long-till-works.html",
      "Title": "Faslodex: How long till it works?"
    }
  ]
}