{
  "AuthorID": "Elena1",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Elena1",
  "Posts": [
    {
      "AuthorID": "Elena1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Elena1",
      "Content": "Hello all. Was wondering if anyone has experienced this. I'm probably just being paranoid. In reading this and other breast health message boards, I haven't once heard someone say that they had a mass or a cyst that they didn't even know about, couldn't feel or didn't have any pain or other symptoms...except the people who say they ended up having cancer. I guess what I'm saying is how can someone have a fibrocystic breast and never feel anything? I was told (after a biopsy of a mass) that it was simply fibrocystic changes/stromal fibrosis. The thing that bothers me is I couldn't feel a lump, didn't have any history of lumps or any breast issues at all. I went in for my first baseline mammogram and that's when the mass was spotted. I had an ultrasound, another mammogram, an MRI, and a biopsy. All for something I couldn't feel and the doctor couldn't feel. It seems to me that if that were the correct diagnosis, I'd feel some pain or something. Any comments would be appreciated. I'm wondering if I should have a second opinion. Have you ever heard of someone having a second opinion for a good outcome? lol. Thanks for listening!",
      "MessageIndex": 0,
      "PostDate": "19/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/491979-stromal-fibrosis-but-cant-feel.html",
      "Title": "stromal fibrosis but can't feel it?"
    },
    {
      "AuthorID": "Elena1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Elena1",
      "Content": "Hi CJ. Just wanted to thank you for your reply and words of reassurance. I'm going to work on getting a second opinion so that I don't keep driving myself crazy. I've been reading some of the other posts, yours and others, and can I just say that you guys are really strong & beautiful people! Thanks for being here! Elena",
      "MessageIndex": 2,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/491979-stromal-fibrosis-but-cant-feel.html",
      "Title": "stromal fibrosis but can't feel it?"
    }
  ]
}