{
  "AuthorID": "ellemae11",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
  "Posts": [
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Nipple discharge can be caused by several things. Infection, benign intraductal papilloma, or possibly cancer. Green discharge is a good sign as that indicates an infection. It is common to have a mammogram first for discharge. The discharge can also be expressed and sent to cytology.",
      "MessageIndex": 1,
      "PostDate": "04/09/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/631228-diagnostic-mammogram-nipple-discharge.html",
      "Title": "diagnostic mammogram for nipple discharge???"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Shirley, Reading mammograms is a complicated science. All radiologists are not the same and very few would contradict another. I would suspect the Radiologist that was going to perform the stereo has more experience with reading mammograms. If you do wait and repeat the mammogram is 6 months I would go back to the facility that was to do the stereo and have my mammo done there. However calcifications usually do not change much in 3-6 month time period unless there is a very aggressive cancer involved.",
      "MessageIndex": 4,
      "PostDate": "19/07/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/618340-do-i-need-do-surgical-biopsy-see-another-doctor.html",
      "Title": "Do I need to do a surgical biopsy or see another doctor?"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Heterogeneously Dense Fibroglandular Tissue is normal for someone your age. I would think the doctor wants to check further on the lymph node. prominent left axillary lymph node means the lymph node looks different meaning it could be enlarged or show up more dense on the mammogram. This could mean a serious problem or a simple infection.",
      "MessageIndex": 1,
      "PostDate": "08/04/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/594367-mammogram-results-heterogeneously-dense-fibroglandular-tissue.html",
      "Title": "Mammogram Results: Heterogeneously Dense Fibroglandular Tissue"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "The surgical procedure is called a needle localization. Because you/surgeon cannot feel a lump the surgeon must have a way for to find the calcifications . In that procedure you must sit for a series of films. Most radiologists will numb the area but some don't. You will be kept in compression while a needle is inserted into the area of the calcifications. Films will be taken to make sure it is in the right area. Then some radiologists will inject a blue dye (some don't) and insert a wire through the needle. The needle is then removed leaving the wire. You are then taken to surgery and the surgeon follows the wire down and removes the area. The surgical removes more tissue than the stereotactic and is a more drawn out procedure. Usually there are stitches. The breast is bruised and sore. The stereo is done in the mammogram facility/area and the patient goes home afterwards. There are no stitches. The breast is bruised and sore. It does require you to lay on your stomach. I would call the radiologist that ordered this and tell him/her your concerns. See what he/she suggests.",
      "MessageIndex": 5,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/602834-what-linear-calcifications-your-breast.html",
      "Title": "What are Linear Calcifications in your Breast?"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Most of the time the breast are mirror images of each other. Sometimes an area will look different from one breast to the other. That area is Asymmetric. It can be perfectly normal. Sometimes having a mammo done near the time of a period can cause the breast to change, a bruise, a new cyst, or a change in the postion of the breast during the mammo. Don't get worried just yet.",
      "MessageIndex": 1,
      "PostDate": "30/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/564482-focal-asymmetry-right-breast.html",
      "Title": "Focal Asymmetry Right Breast"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Suggi, Calcifications do not show well on ultrasound. Calcifications are created by the cancer but that does not mean the cancer is only in the area of the calcs. Many times the cancer has already moved on. While MRI is not good at finding calcifications it is excellent at finding small lesions. Perhaps you could talk to your doctor about a MRI in the future. You should have had one before the initial surgery. Are you allergic to the isotopes used by Nuc Med?",
      "MessageIndex": 4,
      "PostDate": "25/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/553230-breast-calcification-age-44-a.html",
      "Title": "Breast calcification - age 44"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Stereotactic Core Biopsy is not done surgically. You will lay on an x-ray table with your breast through a hole in the table. The breast will be compressed and pictures taken for coordanance. You should be well numbed as they do not want you to move. If that happens they must do more pictures to realign you. When the radiologist and tech are ready they will fire the needle. Is is VERY quick. This is done several times. It takes our a small amount if tissue each time and this is taken to pathology. It depends on the lab as to how soon you will hear. Ask the radiologist. Sometimes they are the ones to call you. It depends on the facility. Breast cancer is a primary cancer meaning it starts with breast. However some cancers can show up in lymph nodes in the breast. Uterine/ovarian is one. Those however usually do not show up as linear calcifications tracking through the breast. It is very common to see these type of calcifications after a trauma to the breast. An accident (seat belt injury),surgery, falling and hitting the breast, etc. In that scenario they are benign. So this is not a positive cancer thing yet! When cancer grows through the ducts it cast off waste. This is what shows up as calcifications. It is difficult for the radiologist to tell which process is happening without a biopsy. Good luck on the test and I hope you don't have to wait to long for the test.",
      "MessageIndex": 3,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/602834-what-linear-calcifications-your-breast.html",
      "Title": "What are Linear Calcifications in your Breast?"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "you might want to ask the doctor about lymphoma or Hodgkin's",
      "MessageIndex": 2,
      "PostDate": "29/06/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/612172-lump-under-clavicle.html",
      "Title": "Lump under clavicle"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Linear calcifications means they are in a line. They can show up from a previous breast surgery, injury, or they can mean there is cancer in a duct(DCIS). I am sure doing the spot compression the technologist will do a magnified image. This will allow the radiologist to see the shape and direction these are going. Ultrasound will not show these tiny calcifications.",
      "MessageIndex": 1,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/602834-what-linear-calcifications-your-breast.html",
      "Title": "What are Linear Calcifications in your Breast?"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Digital mammography is higher in radiation than regular mammography. If you have a half lead apron on around the waist the baby is not going to be injured.",
      "MessageIndex": 3,
      "PostDate": "20/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/561338-what-risk-having-mammogram-if-you-may-pregnant.html",
      "Title": "what is the risk of having a mammogram if you may be pregnant"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "menapause and no hormone replacement therapy. A fibrocystic breast is due to the bodys reaction to hormones.",
      "MessageIndex": 2,
      "PostDate": "24/10/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/644044-fibroglandular-disease.html",
      "Title": "Fibroglandular Disease"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Tell the technologist. She can put a half lead apron on you and if you sre pregnant the baby will not receive any radiation. You and baby will be fine.",
      "MessageIndex": 1,
      "PostDate": "16/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/561338-what-risk-having-mammogram-if-you-may-pregnant.html",
      "Title": "what is the risk of having a mammogram if you may be pregnant"
    },
    {
      "AuthorID": "ellemae11",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ellemae11",
      "Content": "Baby, I bet you will find the lumps you are feeling are cysts. All breasts contain fibroglandular tissue. It consists of lobules, ducts, and surrounding fibrosis (fibrous connective tissue and scarring). The description of fibroglandular tissue is a common part of a normal mammogram report. The younger the woman especially if she has not had children the more fibroglandular the tissue. That's why in general it is more difficult to read mammograms on younger women. If you are feeling painful lumps it would indicate fibrocystic breast. You might want to discuss the terminology with your doc. While some doctors refer this terminology as a disease it is not.",
      "MessageIndex": 6,
      "PostDate": "25/10/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/644044-fibroglandular-disease.html",
      "Title": "Fibroglandular Disease"
    }
  ]
}