{
  "AuthorID": "granny0",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/granny0",
  "Posts": [
    {
      "AuthorID": "granny0",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/granny0",
      "Content": "Hi there. I had breast cancer in the right breast in 2011 that was found by a routine mamogram. I had a partial masectomy and had 3 lymph nodes removed in my armpit. Prior to the surgery, they injected a dye in my nipple (OMG that hurt) and then more dye during the surgery. The dye went right to the 3 lymph nodes so that is why they were removed. They sent a sample of the cancer to a lab in California that rates the chances of it coming back from 0 - 100. I was in the lower third, so that determined that I didn't need chemo. I had 6 weeks of every weekday radiation and have been taking those nasty hormone blocking meds since then. My cancer was stage 2. I had 2 types of cancer, one invasive and one non-invasive. Well, it's 3 yrs later and recently I've been having pain in the breast. I noticed it when sleeping on my right side or stomach. My annual mamo was scheduled for 8/28/14 and I called the surgeons office and got it moved up to the earliest date available - 7/17/14. She also ordered a sonogram of the right breast. I saw my primary care doc about major stomach issues I'm having and she pushed hard on the breast and it hurt bad. I'm afraid it's back and my be in my stomach also or a new cancer in the stomach. I had an endoskopy done late March for stomach pain and the diagnosis was gastritis. She sent me for a CT scan and the result is \"there is thickening on the stomach wall\". Of course I googled that and everything that popped up was stomach cancer. I'm going to post on that board about the stomach. Has anyone had breast cancer return and if so, was it noticed by pain in the breast? I'm really afraid I'm on my way out. I appreciate anyone's time to read this and reply. I can deal with any answer that comes my way because I am thinking the worst. Thank you. JB",
      "MessageIndex": 0,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/984896-i-think-my-cancer-back.html",
      "Title": "I think my cancer is back"
    },
    {
      "AuthorID": "granny0",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/granny0",
      "Content": "Hi there. If they saw anything that was concerning, they would have scheduled a biopsy immediately. So, no worries :-)",
      "MessageIndex": 1,
      "PostDate": "13/07/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/985337-5-millimeter-density.html",
      "Title": "5 millimeter density?"
    }
  ]
}