{
  "AuthorID": "happylittlefami",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/happylittlefami",
  "Posts": [
    {
      "AuthorID": "happylittlefami",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/happylittlefami",
      "Content": "Well, I just got off the phone with my gynecologist and his office said that they definitely agree that the MRI needs to be done. They are awaiting the detailed results of my mammogram and ultrasound from yesterday and will call as soon as they get them. Hopefully it will be today or else it will be Tuesday due to the holiday on Monday. Half of me is in tears and the other half is incredibly irritated. I just wish I knew 'what' it is that is such a red flag. I'm sure we can all agree that the unknown is an absolute beast! Hugs",
      "MessageIndex": 3,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/902300-abnormal-mammo-sched-breast-mri-rule-out-lobular-cancer-help.html",
      "Title": "Abnormal mammo, sched. breast MRI to rule out lobular cancer?? Help!"
    },
    {
      "AuthorID": "happylittlefami",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/happylittlefami",
      "Content": "Thank you, JESUS! I just got a call from my doctor that the mri was negative and that I just have to do follow up care and then routine mammograms. I am beyond relieved, especially being a mom of 4 young kiddos. OMG I'm so relieved!",
      "MessageIndex": 11,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/902300-abnormal-mammo-sched-breast-mri-rule-out-lobular-cancer-help.html",
      "Title": "Abnormal mammo, sched. breast MRI to rule out lobular cancer?? Help!"
    },
    {
      "AuthorID": "happylittlefami",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/happylittlefami",
      "Content": "I had a mammogram yesterday. I'm 33 years old, have had 4 babies, 6 pregnancies, and I had a total hysterectomy with ovaries removed 6 months ago. About 2 months ago, I noticed a heavy feeling in my right breast upper quadrant. I thought it could be my bras or maybe working out at the gym. I felt a lump, but I have large breasts and finding a lump isn't uncommon given my lumpy breasts. I started noticing the area where I felt the lump was aching and I would feel like I was lactating on and off. The area was becoming more noticable and I still could feel the lump. I saw my primary doctor 3 weeks ago and he recommended antibiotics before getting it checked because I had a sinus and ear infection, so it was possible it was related. I finished the round of antibiotics and my breast has continued to be sore and achy in that area and I noticed an area that kind of caved in also. I decided to see my gynecologist and after his exam, he said to have a mammogram done to be safe but he expected it to show nothing. I went yesterday for my mammogram and they told me they needed me to come back a couple hours later to have a breast ultrasound done. I was a little concerned, but also assumed they were just trying to be safe. When I went for the ultrasound, the tech said she wasn't finding what the mammogram picked up. So the radiologist came in and tried also doing the ultrasound. She said there was an area on my mammogram that came back abnormal, but it's not a clear lump. The ultrasound was showing slightly abnormal tissue as well, but no obvious lump. Combined with the dimpling on my breast, she talked to me about lobular cancer. She wants me to have a breast MRI done next week to get a better image because apparently that type of cancer isn't picked up well on mammogram and ultrasound. Here's my dilemma. We have a huge deductible, so the MRI will be out of pocket. I am sure the MRI will be between $1000-$2000 and I really would rather not incur that expense if this is more for exploritory reasons. She said a surgeon would need to take like a quarter of my breast to biopsy because there is not direct location, it's an area that is abnormal. The last child I nursed was almost 6 years ago. I had yeast in my milk ducts the entire time I nursed and it was quite a horrendous experience. Could this white area they are finding just be from damage caused by having gone through that? Part of me wants the MRI just to get a better image, but another part of me says it's a waste of money. And even if they do find an abnormal reading on the MRI, then what? Will they have to go on and remove a quarter of my breast to determine what it is? The radiologist said she's not comfortable letting this wait another 6 months to see if there are changes or if it goes away, but I cannot tell you how many other MRIs, CT scans, x-rays, etc I've had because they thought it was prudent to have them done only for nothing to come of them. Or if something was found, the result was to wait until it becomes troublesome before doing anything about it. Has anyone had lobular cancer and can you tell me what your findings were and how it was determined? Also, can anyone guide me on this decision? I know in the end it's our decision to make, but I don't want to be irresponsible if I really should get the MRI done. We don't have the money and I have no idea how we are going to adjust things to make it happen, but I know we have to do what we have to do. I'm nervous, but also at a point of not even wanting to think about it. I have fibromyalgia, nerve damage in my extremities, and my anemia is back even though I had the hysterectomy to prevent that. I'm exhausted and ready to put the breast issue on the back burner if it truly isn't worth pursuing at this point. Thanks for reading. I appreciate any advice or input.",
      "MessageIndex": 0,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/902300-abnormal-mammo-sched-breast-mri-rule-out-lobular-cancer-help.html",
      "Title": "Abnormal mammo, sched. breast MRI to rule out lobular cancer?? Help!"
    },
    {
      "AuthorID": "happylittlefami",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/happylittlefami",
      "Content": "Well, a rather unfortunate change of events has occurred. I don't know what to do. On Tuesday, the radiology office told me that we would only have to pay 20% out of pocket, so my husband and I saw that as God blessing the procedure because it was going to be affordable. Today, I just got a call from the radiology office stating that was inaccurate information and we are going to need to pay 100%, but it can be broken up over 6 months. I'm a stay at home mom to 4 kids and I have to be honest, this makes me wonder if I should be doing this. I called my husband and our only option is to maybe sell one of our vehicles to come up with the money so we are not having to struggle to keep up with the cost of the MRI. I don't know what to do. My gut feels like something may be wrong, but I'm sure that is fueled by fear. My head keeps telling me that this is impractical because everyone says that the results are likely to show everything is ok. I asked the radiologist's office if there were other options and she said I need to ask my gyn about that. I've already called them about 3 times to see if I really needed to have the MRI and they all keep saying yes, even though I told them the MRI is going to cause financial hardship. I just don't know what to do. What if they find something, then what? Who's to say we will have the money to afford it considering we are obligated to paying monthly payments on the MRI? Maybe God is causing this financial challenge to keep me from having the procedure done. And if I can't, what are my other options? Would I just need to have another mammogram in 6 months? It's so hard because today a friend of mine who is only 36 is in surgery to have a double masectomy because of her Stage 2 cancer. Praise God it's not in her lymph nodes! What to do, what to do?",
      "MessageIndex": 7,
      "PostDate": "31/05/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/902300-abnormal-mammo-sched-breast-mri-rule-out-lobular-cancer-help.html",
      "Title": "Abnormal mammo, sched. breast MRI to rule out lobular cancer?? Help!"
    },
    {
      "AuthorID": "happylittlefami",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/happylittlefami",
      "Content": "I just wanted to update since having the Breast MRI on Friday. I haven't heard anything yet and it's Tuesday afternoon. I'm getting more antsy as the minutes go by. Hoping to hear something soon.",
      "MessageIndex": 8,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/902300-abnormal-mammo-sched-breast-mri-rule-out-lobular-cancer-help.html",
      "Title": "Abnormal mammo, sched. breast MRI to rule out lobular cancer?? Help!"
    },
    {
      "AuthorID": "happylittlefami",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/happylittlefami",
      "Content": "Thank you. I will update when I get the results. I'm so nervous and anxious for the results, but I know even the mri isn't going to be able to give a definitive answer. I guess it'll reveal either a need for a biopsy or an all-clear to wait to have another mammogram in 6 months. I try to keep telling myself that there are many steps still to go to determine if it is cancer or a benign issue even if I have to have a biopsy. Ugh, patience is not a virtue of mine! lol",
      "MessageIndex": 10,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/902300-abnormal-mammo-sched-breast-mri-rule-out-lobular-cancer-help.html",
      "Title": "Abnormal mammo, sched. breast MRI to rule out lobular cancer?? Help!"
    }
  ]
}