{
  "AuthorID": "hilery79",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hilery79",
  "Posts": [
    {
      "AuthorID": "hilery79",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hilery79",
      "Content": "Hi, I'm 24 and I found a dime sized lump in the upper outer portion of my left breast. I have a dr.'s appt in a few weeks to get it checked out, but I'm very worried about it. I was dx'd with thyroid cancer earlier this year, so now I am very paranoid about any little bump on my body. This lump is movable and has a rubbery feel to it. It is also very tender. I've read that cancerous lumps are usually hard and fixed. What are the chances my lump might be malignant? I would really appreciate any replys. I have 3 weeks to worry about this. Thanks~",
      "MessageIndex": 0,
      "PostDate": "02/12/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/131371-breast-lump.html",
      "Title": "Breast lump"
    },
    {
      "AuthorID": "hilery79",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hilery79",
      "Content": "Hi, A good friend of mine had a ct scan of her chest recently to look at her lungs because she's been having shortness of breath. Nothing was found, but they told her there was a small nodule in one of her breasts. How would they see a breast lump through a chest CT scan? Doesn't this type of scan just show slices from the inside of the chest wall? I'm having trouble understanding how this nodule showed up on her CT scan. I would appreciate any replies...Thanks!",
      "MessageIndex": 0,
      "PostDate": "31/07/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/194639-breast-lump-showing-up-chest-ct.html",
      "Title": "Breast lump showing up on chest CT?"
    },
    {
      "AuthorID": "hilery79",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hilery79",
      "Content": "Kalie, Thanks for the reply. I'm sorry you were dx'd with breast cancer and at such a young age. I know the scariest day of my life was when I was dx'd with thyroid cancer. How are you doing now? Mintchocolate, Thanks for the reply. Yes, I am taking 100 mcg Synthroid. I never thought of this being from my thyroid med. My breasts have been a little tender and swollen lately. Now that I think about it, this started around the same time I started taking Synthroid. I hope everything goes well at your appt. on the 18th. hilery",
      "MessageIndex": 3,
      "PostDate": "04/12/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/131371-breast-lump.html",
      "Title": "Breast lump"
    }
  ]
}