{
  "AuthorID": "hiphop474",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hiphop474",
  "Posts": [
    {
      "AuthorID": "hiphop474",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hiphop474",
      "Content": "Star13 wrote: I have a lump ( or thickening a 12oclock position) in my left that has been there close to a year in July my gyno told it was probably nothing but gave a a script to get a diagnostic mammo which I never did because I didn't have insurance at the time. This January I have ins. so I finally went. The mammogram tech took many pictures and then asked me to wait in a room while the radiologist looked over them, the mammo tech then returned and said the radiologist need magnified pictures of the left breast only (that's the one with lump) asked the tech why and she said some like they were looking a microcalcifications or checking for microcalcifications. The tech then returned to the room and told me I would be getting a ultrasound and towait in the waiting room. When I had the ultrasound the first thing the tech said was \" I just take pictures\" not sure what that was all about? She took 39 pictures of the left breast at all different positions 2o'clock 4 o'clock, etc. I never saw anything that stood out to me and even said to her it's funny how I can feel something but I don't see anything on your screen, she never replied with anything. I was then told not to get dressed yet she was going to make sure the radiologist didn't need anymore pictures, she returned and told me I was ok to go. I asked when I would get results and she said they would be sent to the ordering dr. If the radiologist didn't talk to me does that mean there are no concerns? Many of you have reported that the radiologist either talked to them or had a biopsy on the spot. I guess the only thing concerning me is that I had to get magnified pictures of the breast with lump and the unexpected ultrasound. I want to also add I saw nothing on the ultrasound( no black areas, circles, blobs, etc.) and didn't see her taking any measurements ..good sign? does 39 pictures of just one breast seem like a lot if nothing is there? Thanks for you help!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/936335-concerned-input-please.html",
      "Title": "Concerned!!! Input please"
    },
    {
      "AuthorID": "hiphop474",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hiphop474",
      "Content": "Look, so today I received the radiologist report and it states that the findings are... Grouped calcifications are seen in the upper, outter quadrant of the left breast aprox 2-3 o'clock region, without accompanying nodules density. Ultrasonic showed nothing abnormal. Density in both breasts in 51%-75%. BIRAD 3 to follow up with 6month diagnostic mammogram. It did say something like to try to find any other mammograms that I had had in the past to compare and might change the impression? I am 38 and had a screening done 7 years ago..would that even help, should I try to locate it?",
      "MessageIndex": 1,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/936335-concerned-input-please.html",
      "Title": "Concerned!!! Input please"
    }
  ]
}