{
  "AuthorID": "hjjasnell",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hjjasnell",
  "Posts": [{
    "AuthorID": "hjjasnell",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/hjjasnell",
    "Content": "So I have to me what feels like (and this is the only way I know how to describe it) a thickening of the breast tissue in the upper part of my right breast towards the armpit. My doctor has noticed some lumps on my left breast and this \"mass\" or thickening but she said I also have very fibrous breast tissue. I have had some clear nipple discharge, mostly from my right breast and even then it's only very rarely that I have it at all. My right breast seems larger to look at full on, at least to me and hubby but she didn't see it. And from different angles (me looking down at my breasts, or hubby looking from the side, etc.) they look sized differently (and they have generally been pretty much the same size and same shape). So that is the symptoms I noticed first and she asked me if my nipples were inverted and I assumed that meant were they always pushed in so I told her no but now I'm having my doubts. I have always had prominent nipples (on my quite large breasts...have been very large chested since I was about 11 when puberty full on hit me) and they have always protruded even when warm and relaxed, but then it would only be slightly so and more so when cold, \"not relaxed\", etc. Now they seem to be flat and the right one is flat or slightly indented when warm or relaxed but they still \"pucker\" I guess you could call it when cold, etc. and if i hold my breasts up, there is an indent in the skin under the nipple area of the right breast. Is this normal and something I've just never noticed before and I'm overthinking things? Or is this yet another indicator of the possibility of breast cancer? I do have a family history of breast cancer, these lumps and mass and am just so scared that I think I'm making myself MORE worried. Any thoughts on the nipple issues? And what were some other symptoms I should be looking for? Thanks!! Oh and I have a mamo and u/s scheduled for Monday of next week, as my dr was concerned with the lumps she felt and the mass (though she still says she thinks they are just because of the fibrous breast tissue and nothing else but better safe than sorry) and the fact that I have some slight nipple discharge and a family history. Help!",
    "MessageIndex": 0,
    "PostDate": "01/10/2012",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/921179-symptoms-bc-mamo-scheduled-still-curious.html",
    "Title": "Symptoms of BC, mamo scheduled, still curious..."
  }]
}