{
  "AuthorID": "ItsMeG",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
  "Posts": [
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "Insane, hope this week flies by for you and you hear B9 results soon! Hugs! I got the call with B9 results and to follow up in 6 months.",
      "MessageIndex": 8,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/938661-new-worried.html",
      "Title": "New and worried"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "I recognize your name from the back problems board where I've posted some about my husband. I'm sorry you're dealing with 2 scary situations at once, but try to remember that they say about 80% of the time it's not cancer. I'm in a similar situation with my breasts. My mammo and ultrasound this week came back showing complex cysts that have grown, have thick walls, and solid features in both breasts...3 areas in one and 1 in the other, so I'm waiting for my needle biopsies on Wednesday. I have some microcalcifications too, thankfully no changes there. And, thyroid issues run in my family. I have a son who was diagnosed as hypo at 10 years old and my sister was diagnosed hypo with one side of the thyroid enlarged just months before passing of a heart attack at 48. I'll be thinking of you and hoping both of yours come back benign. I see you're in NY, so I bet that storm has been another big worry for you. Stay safe and try to stay positive! B9 B9 B9!!!",
      "MessageIndex": 1,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/938661-new-worried.html",
      "Title": "New and worried"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "YES! So glad you got good results and so fast. I thank you for your support too. I have no living female family left or any close friends that I care to share this with, so going through this at the same time as you has given me comfort in itself.",
      "MessageIndex": 11,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/938661-new-worried.html",
      "Title": "New and worried"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "hello, back. Just wondering if you have some good news to share yet? Hope everything is well.",
      "MessageIndex": 3,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/938661-new-worried.html",
      "Title": "New and worried"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "I wanted to reply and hopefully ease your mind some, but I do think you need to go back to the doc and verify what the hard lump is if it isn't gone after your next cycle. Sounds like you might have several cysts and the hard, movable lump could be a fibroadenoma. I was just diagnosed with a fibroadenoma at age 41 and have had lots of cysts since my 20's. They both are common for women with fibrocystic breasts. Most of the time the cysts hurt more before my cycle but a few times they hurt afterward too. The fibroadenoma is a hard movable lump that is common in the teen years and women up to 30-35. They are kind of rare for someone my age. They can cause a tingling/burning sensation and the shooting pains you have. For me even the water pressure from a shower sometimes hurts too. You are young so odds are in your favor you just have cysts and maybe a fibroadenoma. I had never, ever heard of them until I was diagnosed and learned they are the most common lump in young women....look it up and see if it sounds similar to what you have.",
      "MessageIndex": 1,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/955288-scared-about-lump-breast-could-anyone-give-me-more-information.html",
      "Title": "Scared about lump in breast. Could anyone give me more information?"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "Wow, I can't even imagine the odds of both biopsies being inadequate. It stinks that you have to go through them again, but crossing my fingers they get good benign samples this time. It would be nice if they could put a rush on the reports as I'm sure you're at a breaking point. I should get my results by Tuesday. Thankfully I only had to have 2 areas biopsied out of the 4 areas. Hope that everything else life throws your way is treating you kindly!",
      "MessageIndex": 5,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/938661-new-worried.html",
      "Title": "New and worried"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "Paperlaces, how are you? I hope the procedure went well. babygirl, so glad to hear yours is benign! I got benign results in February and just had my 6 month follow up and there were no changes...now if I can make it to next Feb. Do you know what the benign finding was? I am 41 and was diagnosed with a 1.2cm fibroadenoma and have to watch it for changes since they are not very common in women over 40.",
      "MessageIndex": 14,
      "PostDate": "04/08/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/957144-lump-dense-breasts.html",
      "Title": "Lump and dense breasts 1 2"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "Good luck, hope yours is something simple and benign. You should ask for an ultrasound. I have very dense breasts too and get an ultrasound with every mammogram.",
      "MessageIndex": 1,
      "PostDate": "22/07/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/957144-lump-dense-breasts.html",
      "Title": "Lump and dense breasts 1 2"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "Cysts are almost always nothing to worry about and are very common for women between their 30's and 50's. They seem to cause the most trouble during the second half of our monthly cycles. They can vary in size and some are painful. I had to have my first mammo at 35 because of cysts and now 5 years later at 40 I still have lots of cysts. Both simple cysts which means they are of no concern and there are complex cysts, which several just showed up on my mammo and ultrasound this week. They too are usually nothing to worry about. I have more than 10 simple cysts in each breast and 3 complex in one and 1 complex in the other. You want to hear the words simple cysts, they are solid black areas that show up on the ultrasound. The waiting is the hardest part! I'm waiting for my biopsies on Wednesday, but will check back before then to see what you find out. Please try to relax. Don't be sorry for rambling on, new health problems are always scary!",
      "MessageIndex": 1,
      "PostDate": "09/02/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/938571-very-scared-dr-said-i-have-breast-cyst-sending-more-tests.html",
      "Title": "Very Scared. Dr said I have a breast cyst. Sending for more tests."
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "This seems to be a slow board at the moment, thankfully, so I thought I would chime in since you haven't received an answer. It is very unlikely you have anything to worry about, but it wouldn't hurt to ask the ordering doctor to explain it better. I don't think that your mammo from 7 years ago would be much help since it seems it was clear then. If you feel that waiting 6 months is too long see about getting another one done in a few months. If it was me I would talk to my doc's and get another mammo to be certain. I wish your report stated what kind of calcifications you have. I don't know a whole lot, just my experiences. I have very dense breasts too, and several microcalcifications and cysts, so I am supposed to get a yearly mammo and an ultrasound done after and the radiologists comes explains it to me.",
      "MessageIndex": 2,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/936335-concerned-input-please.html",
      "Title": "Concerned!!! Input please"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "How are you feeling now? Hope you've found some relief. Cysts are a huge p.i.t.a. I also have way too many to count. I had a painful one pop up about 2-3 weeks ago, it turned out to be a complex cyst with solid features that had to be biopsied. This cyst sent burning, shooting pains through that breast. It came back B9.",
      "MessageIndex": 1,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/939888-super-painful-cysts.html",
      "Title": "Super painful cysts"
    },
    {
      "AuthorID": "ItsMeG",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ItsMeG",
      "Content": "I agree it's all torture physically, emotionally, and financially! I dread going back every year...guess that's why I ignored my last mammo and went 2 1/2 years in between so now I get to go back in 6 months. Are there any low cost clinics you can go to? Have you tried tylenol? Wish I was better help!",
      "MessageIndex": 3,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/939888-super-painful-cysts.html",
      "Title": "Super painful cysts"
    }
  ]
}