{
  "AuthorID": "javelinx",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/javelinx",
  "Posts": [
    {
      "AuthorID": "javelinx",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/javelinx",
      "Content": "I'm 19 years old. A month ago, a few days after my period (mentioning this because it might be relevant) I started experiencing a lot of pain in my left breast, particularly around the sides, near the armpit, and underneath the breast near the rib cage, though some on the top of the breast too. After about a week, the pain lessened so it was mostly just more tender than usual, and at this point my right breast started feeling tender too. It's worth mentioning I don't usually get this pain/tenderness at this time in my cycle (or at any time in particular that I've noticed.) After another week, I was checking my breasts in the shower and found a hard, movable lump with smooth edges right under the surface of my left nipple. When I pressed it, blood spotted from one lesion on my areola. I saw my GP the next day and he said he thought it was probably an infected cyst, and gave me a week's course of antibiotics as well as setting up an appointment for me to get tests done just to make sure. A few days after I started taking the antibiotics, the bleeding stopped and any pain/tenderness around the lump went away. However, once I finished the antibiotics, I briefly experienced a spot of blood at one point, and once I reached the same place in my cycle I was when the pain started last time, I started experiencing A LOT of pain in my left breast again. The lump doesn't seem to have grown but it does seem to have moved somewhat closer to the surface of the nipple, and now there is significant pain/tenderness there, particularly if it's under any sort of pressure (eg. just wearing a bra.) There's also, like last time, a lot of pain around the side of the breast, near the armpit, and the underside of the breast near the rib cage, as well as the top of the breast a little. Sometimes I get shooting or stabbing pains through the entire breast, which often feel as if they are affecting the rib cage beneath it. My right breast feels a little more tender than usual, but nowhere near this level of pain. I am very scared that it might be breast cancer and I guess my question is this: I know cysts can cause pain but I thought this would only be in the immediate area of the cyst. Is it possible for a cyst to cause pain in almost the entire breast and to cause stabbing pains through it? And is it possible that any pain borne of a cyst would increase during certain points of your menstrual cycle? And then the same question for fybrocystic lumps? I am also worried because I can't tell whether my left areola looks normal or not. I've been in a very hot country for the past two weeks (I live in England so it was a big temperature change) and the appearance of my areolas seemed to change, but my left one in particular looked very swollen and more blurred around the edges than usual. Since I have been back in England it seems to have gone back to normal, but I'm not entirely sure because it still looks a little misshapen and I can't remember whether it was like that before or not. Also I've been experiencing upper back and shoulder ache, which is more severe on the left side, which is worrying me. Any information would be greatly appreciated! I know there is info online but it doesn't answer my exact questions and I thought some of you might know.",
      "MessageIndex": 0,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/955288-scared-about-lump-breast-could-anyone-give-me-more-information.html",
      "Title": "Scared about lump in breast. Could anyone give me more information?"
    },
    {
      "AuthorID": "javelinx",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/javelinx",
      "Content": "Thank you for your response. Yeah, I've got an appointment booked at the hospital breast clinic for Tuesday morning - supposedly they will do a mammogram and an ultrasound, and then a biopsy if needed. At one point I was told I would get all the results on the same day and on another that a biopsy would require a couple day wait before results, so I'm not sure how that will work. I have looked up fibroadenoma and it does sound possible. I'm just very scared, especially as I've been feeling generally ill recently and I had a lot of tests last year (lung/heart/ovarian scans) due to various issues and they all came up with nothing but it makes me wonder if everything could be related :/ I know I've got to try and relax until my appointment but it is very difficult for me to focus on anything else right now.",
      "MessageIndex": 2,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/955288-scared-about-lump-breast-could-anyone-give-me-more-information.html",
      "Title": "Scared about lump in breast. Could anyone give me more information?"
    }
  ]
}