{
  "AuthorID": "jellebeans",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jellebeans",
  "Posts": [
    {
      "AuthorID": "jellebeans",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jellebeans",
      "Content": "hi, thank you for your advice etc, reports arent back yet but yes its such a relief all was fine x",
      "MessageIndex": 9,
      "PostDate": "09/11/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/816102-mammogram-ultrasound.html",
      "Title": "mammogram and ultrasound?? 1 2"
    },
    {
      "AuthorID": "jellebeans",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jellebeans",
      "Content": "hi ive a few small moveable lumps in my breasts and one larger one also,im not overly worried that its cancer as i think they are swollen glands as all my other glads are up at the moment,however im having a mammogram in just over a week to check them and am just wandering if its routine to have maamogram and ultrasound ? why the ultrasound too?? do you get results straight away? anyone else have the similar sort of lumps?? thank you x",
      "MessageIndex": 0,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/816102-mammogram-ultrasound.html",
      "Title": "mammogram and ultrasound?? 1 2"
    },
    {
      "AuthorID": "jellebeans",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jellebeans",
      "Content": "thank you for reply,i have my app tuesaday and have heard that the hospital im going to give you results afterwards,which is great as waiting for results is horrible.x just another question if ok.. how far up would they do the ultra sound?? ive a couple of lumps at the bottom of my neck on the side,am hoping i could be cheeky and get them scanned at the same time ha ha x",
      "MessageIndex": 2,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/816102-mammogram-ultrasound.html",
      "Title": "mammogram and ultrasound?? 1 2"
    },
    {
      "AuthorID": "jellebeans",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jellebeans",
      "Content": "Quote: Originally Posted by eddysmom1 Well, I was told that the ultrasound gives a much better picture than the mammogram. That's why, with me, they told me they would do a second mammogram, and only a ultrasound after if they couldn't get a clearer picture. I am 41, so you are quite a bit younger than me. But, I have always had alot of health problems and had my first mammogram at 31 because they detected some calcification. My point is, I have been ok, even with the little scares, so I am sure you will be, too. Be positive and good luck!! hi,thought i would update you! my lump isnt anything to worry about but im still a little confused on what happened today!! first i saw a junior doctor,who felt the lump and said it could be fibro something? or a gland..which is what i thought.he went and got the the other doctor who felt it and said could be a cyst or the fibo ..thing the other doc said about. cant quite remember what it was...fibrodema ..maybe??? anyway he said hes happy that it was not cancer but should have it scanned. when i went for the ultrasound,the radioligists was really abrupt and horrible,i show him where the lump was and he had a quick feel and said theres no lump,i just have lumpy breasts?? i told him theres definatly a lump there but he didnt want to know,he scanned my breast very very quick and sent me on my way !! when i went back in to see the origional doc he just said theres nothing anormal or anything that concerns him to be worried. but i was so angry about the radioligist i just said ok and came out without even asking what the lump is or even if it show up on the scan. he scanned so quickly and didnt concentrate on the area where the lump was atall. i feel really angry with myself now for saying anything. my mind is put at rest that its not cancerous but i feel that the radioligist didnt scan properly and look for the lump,its a moveable lump which can be difficult to feel for . im going to keep an eye on it,if it gets bigger i will ask for a second opinion. i dont like the idea of not having it shown on the scan x",
      "MessageIndex": 6,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/816102-mammogram-ultrasound.html",
      "Title": "mammogram and ultrasound?? 1 2"
    },
    {
      "AuthorID": "jellebeans",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jellebeans",
      "Content": "Quote: Originally Posted by eddysmom1 Oh no, I didn't notice you replied a couple of days ago!!!! The ultrasound just covers the breast area. Did you have it yet? Or next Tuesday? Good luck and don't forget to post on how you make out--this time I will make sure I see it!!!!! hi there, no havent had it yet,its this tuesday morning. i think ill just get the ultrasound as i know of someone who went last week to the same clinic,and they were told coz of their age they dont need a mamogram,however they did get it in the end as the poor girl did infact have cancer,they biopsied there and then,how awful. im only 33 so i guess ill get ultrasound and only the mammo if they see anything suspicious. slightly nervous now as i have had poor health for the last 2 years but im sure it will be fine,and its good that i will get results straight away too. ill let know how i get on x",
      "MessageIndex": 4,
      "PostDate": "29/10/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/816102-mammogram-ultrasound.html",
      "Title": "mammogram and ultrasound?? 1 2"
    },
    {
      "AuthorID": "jellebeans",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jellebeans",
      "Content": "hi, i was just wandering what breast cancer lumps are like?? i have a small hard lump in one of my breasts just under the nipple. its been there for quite a few weeks and ive not really been that concerned about it as i just thought it might be a spot so a few weeks back i tried squeezing it away and just end up making it sore!! it feels like just one of those hard spots which stay under the skin and wont squeeze. i dont want to go to the docs as i would feel stupid if he tells me its just a spot! i have an app with the nurse soon so i will ask her instead. i do have some breast pain but it maybe because im always trying to squeeze the lump! im only 30 years old and theres no history of breast cancer in my family. any advice would be great x",
      "MessageIndex": 0,
      "PostDate": "03/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/486981-small-lump-any-ideas.html",
      "Title": "small lump ..any ideas?"
    }
  ]
}