{
  "AuthorID": "Jenna22",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Jenna22",
  "Posts": [
    {
      "AuthorID": "Jenna22",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Jenna22",
      "Content": "hi there, i'm happy you are not in pain anymore.I had this pain too,but today i found out i've pulled a muscle,i believe she said it is the muscle that goes from the shoulderblade to the breast,not sure.It hurts under my breast and underarm and my whole left side hurts.She put me on some naproxen and some other pill but i started taking them today and i only took naproxen today and i don't feel any different.I'm seeing an orthopedic doctor on monday.I don't know what else to do to reduce this pain in my breast.Any advice",
      "MessageIndex": 6,
      "PostDate": "05/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/151939-pain-under-arms.html",
      "Title": "Pain under arms"
    },
    {
      "AuthorID": "Jenna22",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Jenna22",
      "Content": "Quote: Originally Posted by jsiplon Hi folks, I've been having pain under my arms (mostly right) that sometimes radiates to my breast...for a week or two. It feels like it's running down my arm. My right shoulder is killing me as well. Before that the pain was up under my neck and chin. I've seen three dr.s and no one can feel any lumps. My bloodwork has come back fine. I'm grasping at straws here... what the heck is going on. They are hesitant to call it Fibromalygia(sp?). I was put on Zoloft because of my vast array of symptoms and anxiety that was coming from it. Could this med be doing this? Your thoughts are so very much needed. hi jsiplon, i have the same thing you are having only on the left side of my shoulder,arm and the breast.It starts in the breast and then it goes down to the arm.My doc told me i was fine and the specialist,they told me it might be the hormones before the period.I don't know but i'm going to find out what the heck this pain is coming from?Let me know if you find out anything new?",
      "MessageIndex": 1,
      "PostDate": "24/02/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/151939-pain-under-arms.html",
      "Title": "Pain under arms"
    }
  ]
}