{
  "AuthorID": "JennaLynnK",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JennaLynnK",
  "Posts": [{
    "AuthorID": "JennaLynnK",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JennaLynnK",
    "Content": "On the top part of my left breast, I have a lump about the size of a bouncy ball. I'm not exactly sure when it appeared, but I would venture to say it has shown up in the last month. Before I noticed it, the only pain I ever felt in my breasts was right before and during the beginning of my period. Now, after I've messed with it, theres a dull constant ache. Its something thats weighing heavily on my mind, so most of my pain could be attributed to that, but I really don't know anymore. You know, kind of like my mind is making the pain up to give me something else to focus on. I'm terrified about what it might mean. I know that my risk for developing breast cancer is only slight, and that it could be a cyst, or it could be nothing. I've also heard, that 8 out of 10 lumps found are harmless, but that doesn't stop me from worrying. My question is, where am I suppose to go from here? I don't have insurance, me and my boyfriend live on our own, and its everything we have just to make ends meet. In high school, the only doctor I attended regularly was a specialist for my stomach problems that I had. I haven't seen a regular doctor in a very long time. Where am I suppose to go to get this looked at? I have to do something soon though, because this is really bothering me. Also I was wondering what happens once you make an appointment. How do they go about finding out what the lump really is? Will this take weeks...? Its only been about 4 days since I found it, and its already having a huge effect on me. I just want to know what I need to expect, if this lump doesn't go away soon. Thanks for any help you might be able to give.",
    "MessageIndex": 0,
    "PostDate": "07/11/2006",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/444360-found-lump-only-22-a.html",
    "Title": "Found a lump.. only 22"
  }]
}