{
  "AuthorID": "Jerry8771",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Jerry8771",
  "Posts": [{
    "AuthorID": "Jerry8771",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Jerry8771",
    "Content": "Hello, my mother is 55 years old. Last week she went to get a mammogram (2 years later after he previous one which was clear, but the one prior to that had some cyst that was removed). What happened was that they brought her back 3 times to do a mammogram within the space of a few hours, and her results suggest that findings show that there is some suspicion of a solid mass and an Biopsy is needed (from what i remember). She has no history of breast cancer in her family and I am really worried about her - she is all that i have left in my family. She will be going to see a specialist and get thisbiopsy done withinthe next week or two and I wanted to ask those who know more about this than i do (ive been reading about this all over the net); How likely will it be that this suspicious solid mass (i understand its due to its irregular shape and appearance) is cancerous to benign? I know that the only way to find out is thrugh a biopsy, but because it is a suspicious solid mass, doesthat mean that there is a extremely high risk that it is cancerous? Are there other non-cancerous things that a suspicious (irregular shapad lump) solid mass could be? Secondly, if worst comes to worst, are we in the early stages or late for treatment of breast cancer? The solid mass is approximately 8mm (pimple size from what i remember or somethin like that). And what would the cure rate be like? Would itbe in our favor? Sorry for all these questions, but im currently in melting point and don't know what will happen if worst comes to worst. I can't lose her early Thank you for your help and time",
    "MessageIndex": 0,
    "PostDate": "14/09/2009",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/712616-solid-mass-suspicious-cancerous.html",
    "Title": "Solid mass suspicious? Cancerous????"
  }]
}