{
  "AuthorID": "jgore",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
  "Posts": [
    {
      "AuthorID": "jgore",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
      "Content": "Dear Carole27 I hate to tell you this, but!!! I had bi-lateral mast. last December and had 7 nodes removed on the left side--they put the port on the right side. I still have numbness and \"strange\" feelings in and under my left arm--even with lymphydema therapy. I had extreme (hyper) sensitivity in my chest up until recently when my dr. prescribed Lyrica (a med used for neuropathy in diabetics); and that has helped the sensitivity. I can stand to touch my chest now whereas I couldn't before. I'm a thin person, so my port really caused me problems. It stuck out. It was placed where any bra strap touched it--so, wearing prostheses was a form of hell. I had trouble finding comfortable sleeping positions--between my \"numb\" left arm and my \"port\" right side, I was miserable most of the time. Looking back, I kind of wonder how I got through it all. But, that's the point I want to make--you WILL GET THROUGH IT ALL. There is light at the end of the tunnel--a rainbow after the storm--etc., etc. All the crap you are experiencing now is what you get with the type of surgery you had. All the crap you are going to experience is what you get with the chemo treatment you will have. The next few months will not be comfortable. I wish I could hold your hand. Jackie",
      "MessageIndex": 5,
      "PostDate": "24/10/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/545190-pain-medi-port.html",
      "Title": "pain from the medi port"
    },
    {
      "AuthorID": "jgore",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
      "Content": "Really, the port is better than no port. You get stuck so many times--blood test, chemo iv's, etc., that you will eventually be grateful for the port. I'm sorry yours is hurting so much. If it keeps hurting, call your doctor. It should be tolerable after a week or so. It's never comfortable, just tolerable. But there are things that can go wrong--i.e., my port area got infected a couple of times--cleared up with antibiotics though.",
      "MessageIndex": 9,
      "PostDate": "01/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/545190-pain-medi-port.html",
      "Title": "pain from the medi port"
    },
    {
      "AuthorID": "jgore",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
      "Content": "We take blood pressure on the wrist, IV in the hand! JRG",
      "MessageIndex": 22,
      "PostDate": "26/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/511174-ductile-carcinoma.html",
      "Title": "Ductile Carcinoma 1 2 3"
    },
    {
      "AuthorID": "jgore",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
      "Content": "My oncologist told me to take 30 grams of Glutamine/day: 10 grams 3 times a day. He emphasized the need to take it 3 times a day; and, he was right!! He recommended it for finger/toe neuropathy from Taxol. The Glutamine helped right away (same day) and continues to help. I don't think it helped with bone pain. My neuropathy was making me pretty clumsy. I let a cup slip through my hand and hit my big toe, leaving a heck of a bruise, but I didn't feel it. A couple of days later, it happened again--it left a second bruise, but I didn't feel it either. After I told my doctor about these incidents, he told me about Glutamine. Be sure to buy powder--don't even both looking for it in capsule form--the highest it comes in capsules is 1000 mg. You need at least 30 grams/day.",
      "MessageIndex": 5,
      "PostDate": "06/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/513006-taxol-need-info.html",
      "Title": "Taxol...need info"
    },
    {
      "AuthorID": "jgore",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
      "Content": "You can mix the glutamine with any drink except hot drinks. It has no flavor of its own.",
      "MessageIndex": 8,
      "PostDate": "06/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/513006-taxol-need-info.html",
      "Title": "Taxol...need info"
    },
    {
      "AuthorID": "jgore",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
      "Content": "Tylersnana: My last treatment was May 14; my eyebrows didn't finish falling out until after I completed treatment. But, they are already growing back. My hair has started growing in, too. Eyelashes are still pretty sparse (i.e., none), but, there's hope!!!",
      "MessageIndex": 9,
      "PostDate": "06/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/513006-taxol-need-info.html",
      "Title": "Taxol...need info"
    },
    {
      "AuthorID": "jgore",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
      "Content": "JoJo My experience with Taxol was that it wasn't easier. When I was doing the adriamiacy/cytoxan treatments, I would feel bad for the first two or three days after treatment (exacerbated by the Neulasta shot), but then felt pretty good until the next treatment. So, out of 14 days, I was having only two or three bad days. But, the Taxol treatments kicked my b---. I had some rare side effects which I won't go into because it might scare you; but, I also had the ver common side effect of bone-like pain. Some days were worse than others, but I think I took pain meds just about every day that I was doing Taxol treatments and for a some time after I finished treatment. Luckily, I had escaped any mouth sores while on the first set of drugs. When I started Taxol, my whole mouth became very sensitive; I couldn't eat anything with the least amount of spice in it because it hurt my mouth. I couldn't tolerate hot things. I even had to give up my occasional Coke because it hurt my mouth. After my third treatment, mouth sores started. My eyelashes, eyebrows, and pubic hair had thinned some while on the first drugs, but with Taxol, they fell out completely. And, I am now losing fingernails and toenails. Periodically, I go over the literature that my oncologist gave me--it's a booklet compiled by his office that covers just about everything. I have to review it occasionally because I forget--chemo brain, you know!! According to the literature, the eyebrow-eyelash thing is fairly common with Taxol, but the fingernail thing is an uncommon side effect. As you know, no two people will have the exact same experience. I think you should acquaint yourself with the most common side effects and then pray hard that you don't have any!!! My best wishes are with you!",
      "MessageIndex": 1,
      "PostDate": "03/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/513006-taxol-need-info.html",
      "Title": "Taxol...need info"
    },
    {
      "AuthorID": "jgore",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/jgore",
      "Content": "JoJo: It always amazes me how we respond differently to these things. My Neulasta bone pain always started the day after the shot and it lasted 3-4 days. I hurt so much I had to readjust my shower head to a soft mist in order to take a shower on those days. Sometimes it was a little hard to sort out what was Neulasta pain and what was Taxol pain. But, I assumed the pain that stayed with me after the 3-4 days following the Neulasta shot had to be from the Taxol. Yes on the counts. JG",
      "MessageIndex": 3,
      "PostDate": "03/07/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/513006-taxol-need-info.html",
      "Title": "Taxol...need info"
    }
  ]
}