{
  "AuthorID": "JJ",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JJ",
  "Posts": [
    {
      "AuthorID": "JJ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JJ",
      "Content": "They are doing the right thing. When anything suspicious shows up it is important to have it checked. If they are doing a biopsy they know exactly what to look for and if there is anything, it will show up in surrounding areas. Hopefully things come back ok, so keep us posted...JJ...",
      "MessageIndex": 1,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/847791-calcium-deposits-breast-biopsy-being-done.html",
      "Title": "Calcium deposits in breast? Biopsy being done"
    },
    {
      "AuthorID": "JJ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JJ",
      "Content": "Hi and welcome. Don't panic if she was told her mammogram results are incomplete. This usually means the radiologist needs more information to make the most accurate assessment of your results. The radiologist may request further studies or copies of previous studies for comparison purposes. Seeing she had it done in one place and it may have been read elsewhere could be the reason. They are getting more and more picky so as to NOT over look something. I got called back once as they thought they saw something on the picture. They showed it to me when I got there and I told them it looked like a dirt spot, as I had done filming for almost 30 years and had seen spots like that. They had to re-do the mammogram and they had me wait till it was read so that if anything looked out of place they could redo it, but it was a dirt spot. I know it is nerve racking to go through this but better they double check then have something show up later. It's usually better to have them done at the same place each time this way they have an earlier one to refer to. Best of wishes and keep us posted how it went...JJ...",
      "MessageIndex": 1,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/855412-incomplete-mammogram-worried.html",
      "Title": "An \"Incomplete\" mammogram? Worried!"
    },
    {
      "AuthorID": "JJ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JJ",
      "Content": "Your quite welcome. Please keep us updated as to what they find..JJ..",
      "MessageIndex": 3,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/847791-calcium-deposits-breast-biopsy-being-done.html",
      "Title": "Calcium deposits in breast? Biopsy being done"
    },
    {
      "AuthorID": "JJ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JJ",
      "Content": "Thank you very much for the update and I hope her surgery goes very well. I'm sure this makes you much more relieved.... Wishing you a great day...JJ....",
      "MessageIndex": 5,
      "PostDate": "08/05/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/847791-calcium-deposits-breast-biopsy-being-done.html",
      "Title": "Calcium deposits in breast? Biopsy being done"
    },
    {
      "AuthorID": "emily jj",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/emily jj",
      "Content": "Hello, I am scheduled to get an ultrasound-guided core needle biopsy with placement of a titanium clip on Thursday. The lump is rather superficial on the upper quadrant of my breast. I am extremely sensitive to medicines and to feelings in my body. I'm concerned I will feel teh 4 mm clip (I feel the 6 mm breast lump now and found it myself). I am looking for as much feedback as I can get about the titanium clips. Do you feel them inside your body? Can they cause irritation/ allergic reaction? If you do feel them and ultimately want it removed is there a surgeon out there who would do it? I've heard stories of the clip gettting lost, has this happened to anyone? I would appreciate as much feedback as I can get. Would you mind including your age and how long you've had the clip? thanks again. Best Wishes, Emily",
      "MessageIndex": 0,
      "PostDate": "25/04/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/385856-titanium-clips-they-use-during-breast-biopsies.html",
      "Title": "titanium clips they use during breast biopsies"
    }
  ]
}