{
  "AuthorID": "JollyGirl",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JollyGirl",
  "Posts": [
    {
      "AuthorID": "JollyGirl",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JollyGirl",
      "Content": "After my lumpectomy and chemo, my oncologist recommended radiation as well. My cancer was a very aggressive type so we were doing all treatments to be thorough. I was told the exact same things you were. And it's not bad. The mapping as you know by now, is a long appointment involving pinpoint tatoos and lying still for a long while. That was the worst part. The radiation treatment itself is only about 5 minutes if that daily. I went in early, around 7:30 or 8 am, took my treatment and then went to work...I'm a teacher so I'm busy every day and I handled it with no problem. Now 4 years after my radiation treatments, there have been no long term side effects. You will probably get a bit of a \"sunburn\", but ask for some free samples from your radio-oncologist for medicated lotion or get a prescription. It helps keep your skin from being too dry. Good Luck!!!",
      "MessageIndex": 6,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/766368-radiation-after-dcis-what-side-effects.html",
      "Title": "Radiation After DCIS - What Side Effects?"
    },
    {
      "AuthorID": "JollyGirl",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JollyGirl",
      "Content": "I took Tamoxifen for 2 years. Then, as advised by my oncologist, switched to an aromatase inhibitor. After some bad join pain and further discomfort in the vaginal area, my oncologist took me off the AI and put me back on Tamoxifen. I have been on it another 2 years....4 years total. My liver enzymes have been elevated for a year. No signs of tumors in the liver, heptatitus of any kind, or other liver disorders. It is now decision time....liver biopsy to make sure and/or go off Tamoxifen. I had little to no horrible side effects before the last few months with Tamoxifen and have heard horror stories about aromatase inhibitors.",
      "MessageIndex": 3,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/765627-tamoxifen-aromatase-inhibitor-better.html",
      "Title": "Tamoxifen or Aromatase Inhibitor?? Which is Better?"
    },
    {
      "AuthorID": "JollyGirl",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JollyGirl",
      "Content": "I'm not sure if I can answer your question exactly but I do know that my malignant tumor felt different........hard and solid. My mother only had some fibroid tumors and they felt more \"squishy\". I don't want to worry you but that is my experience with breast anomalies. Hope it was helpful. Good luck.",
      "MessageIndex": 2,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/767326-breast-lump-irregular-shape.html",
      "Title": "breast lump irregular shape"
    },
    {
      "AuthorID": "JollyGirl",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/JollyGirl",
      "Content": "I've just read your post tonight. My surgery was on 12-20-2005 and my surgeon called my house on 12-23-2005 with the biopsy results of my lymph nodes that were taken to see if the cancer had spread. That is only from a Tues to a Fri....and it was the holiday season to boot!!! I agree with the other gal who said to call the dr on Mon and politely but firmly request for a call back. You have waited too long and I'm sure 'they\" know already. Good Luck.....my tumor was small as well...and the cancer was caught early. This Dec I'm celebrating 5 yr survivor!!",
      "MessageIndex": 11,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/764578-ultrasound-showed-blood-breast-cyst.html",
      "Title": "Ultrasound Showed Blood in Breast Cyst"
    }
  ]
}