{
  "AuthorID": "js21",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/js21",
  "Posts": [
    {
      "AuthorID": "js21",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/js21",
      "Content": "I'm 34 and found a lump in my left breast several weeks ago. My obgyn sent me for my first mommogram this past Wed. I went to a breast center and After the mammogram I waited 20 minutes and Dr. said she needed to do a ultrasound. After another 20 or so minutes Dr. did a core needle biopsy taking 3 samples. She told me she would call me on Friday or Monday with the results. She ended up calling me Thursday (the next day less than 24 hours) and told me it was a benign tumor that didn't need to be removed. But since she was at the other breast center location from where I had the test done, she told me she wanted to look at my films again and she would call me on Monday to talk. Why look at the films if its benign and doesnt need removed? Has anyone had a false neg. biopsy that tuned out to be cancer? I have to wonder if enough cells were taken out. I have a family history with breast cancer and really feel uncomfortable having a tumor in me. Should it be removed for further testing?",
      "MessageIndex": 0,
      "PostDate": "13/09/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/633920-benign-brest-tumor-question.html",
      "Title": "benign brest tumor question????"
    },
    {
      "AuthorID": "js21",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/js21",
      "Content": "I just had one this past Wed. I'm still sore and a little swollen. When the first biopsy was taken I developed a hematoma and they applied alot of pressure to stop the bleeding. Half of my left breast is now green. I didn't feel the needle go in but the pressure when that click went off I felt. I hope you feel better and the bruise goes away soon. My Dr. said it would take about a week or two. Wishing you benign results.",
      "MessageIndex": 6,
      "PostDate": "13/09/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/630075-bruising-after-core-needle-biopsy-normal.html",
      "Title": "Bruising after core needle biopsy normal?"
    }
  ]
}