{
  "AuthorID": "Kali333",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Kali333",
  "Posts": [
    {
      "AuthorID": "Kali333",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Kali333",
      "Content": "Quote: Originally Posted by KittyLove Hello, I'm hoping someone can help ease my mind...even a little bit right now. I'm 43, have never had children, have large D-sized breasts and have always had yearly mammograms without problems. Today I received a call from my GYN's office asking to set up an appointment for an Ultrasound. I asked \"Why, is something wrong?\", and the caller said that my doctor recommended an Ultrasound because I have dense breast tissue. I asked if this is common procedure for dense breasts, and she replied \"Yes\". I asked if I should be worried, and she said that she was just a secretary, and asked if I'd like to speak to a nurse. I guess I was just in shock and felt as if I was overreacting, so I said \"No\", and arranged an appointment. Now it's 8:00 pm and I've been looking up dense breast tissue, and I'm not liking what I see. In fact, I'm getting very anxious and upset. I just called my doctor's office, and the after-hours voice message said that \"If this is an emergency, press 4\", and I hung up. I wish I had talked to a nurse earlier today, because now I have a lot of questions, uncertainty and fear. The day of my Mammogram, I was due for my period the next day. Prior to that day, my breasts had been swollen and tender all week. This was the first time that a Mammogram actually hurt, but I just considered it to be PMS. If any one has any advice or experience with dense breast tissue, I would truly appreciate any words of advice or reassurance. Is this just a precautionary procedure? Please help. Thank you! I know dense breast tissue is common and relatively normal, especially in younger (reproductive age) women, which is why doctors don't recommend routine mammograms until over 40 (some docs don't recommend them until age 50, for women without risk factors). Mammograms are not very good at detecting cancer in women with dense breast tissue (which is basically all women, during their reproductive years). Your doc is probably recommending ultrasound because he wants to do a routine check for breast cancer, and your breasts are too dense for a mammogram to be effective. After you go through menopause and no longer have the amount of hormones that you do now, your breasts will become less dense, and a regular mammogram will be effective. Good luck.",
      "MessageIndex": 10,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/832186-dense-breast-tissue.html",
      "Title": "Dense Breast Tissue?"
    },
    {
      "AuthorID": "Kali333",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Kali333",
      "Content": "Thanks, Ween. That's good to know. I haven't had this issue yet, but if I ever do I'm sure I'd freak out, so it's good to know there are benign causes. To the threadstarter: hon, you're 28. Time is on your side. Breast cancer is really rare under 30. Perhaps it's, as Ween says, a non-cancerous growth in a duct/ papilloma. You should definitely get it checked as soon as possible. It does sound really scary, and I don't blame you for being scared. But I'm sure there are many other things it could be. Good luck!",
      "MessageIndex": 2,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/835892-really-scared.html",
      "Title": "really scared :-("
    },
    {
      "AuthorID": "Kali333",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Kali333",
      "Content": "Okay, neochiq, keep your appointment (I'm sure you don't need me to tell you that, lol), but to prevent you being to terrified in the meantime, I've found some promising statistics. Only 5% of breast cancer cases occur under 40, and most are associated with a family history. You have only a 1 in 2,500 change of developing breast cancer by age 30. Now, if I told you that you had a 1 in 2500 chance of winning the lottery, you probably wouldn't get too excited, because that's a really, really tiny chance. Right? Secondly, I think you should go to the Mayo Clinic website and look up \"nipple discharge\". It addresses your specific issue, and gives a lot of possible reasons why this could be happening (most of them not that serious). I'd post a link, but I don't think we're allowed to do that on this forum. However, the Mayo Clinic website is very reputable. You can believe what you read there. Anyway, please let us know what the doctor says. Hugs!",
      "MessageIndex": 3,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/835892-really-scared.html",
      "Title": "really scared :-("
    }
  ]
}