{
  "AuthorID": "katsmee",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/katsmee",
  "Posts": [
    {
      "AuthorID": "katsmee",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/katsmee",
      "Content": "Hi. I had myfirst mammogram at age 40 last year, and they found microcalcifications also. They were really spread out, and they then did a core needle biopsy to confirm thier suspicious findings. I was diagnosed with early stage t-1 breast cancer, micro invasive but very aggressive. I had a mastectomy in august and reconstruction done at the same time. No chemo or radiation therapy. Looking back at the whole process last year, I realize how very fortunate I am to have gotten that mammogram done. I am alive and doing well, and feeling great. i know first hand how nerve wracking having to get a biopsy is. When I was first told I had calcifications, I did alot of research, and freaked myself out pretty good. I did find out though that calcifications are in most cases not cancerous. Take care and best of luck to you.",
      "MessageIndex": 7,
      "PostDate": "31/05/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/283259-calcifications.html",
      "Title": "Calcifications 1 2"
    },
    {
      "AuthorID": "katsmee",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/katsmee",
      "Content": "I wish I had discovered this website last year when I was diagnosed with breast cancer. There is a wealth of information here, and it's comforting to hear from people who are going through the same thing you are. PrncessRnnr, I went through the same that you are going through. The doctors moved really quickly, from diagnosis to surgery. Just keep in mind, that if you were going to get this nasty disease, you have the best case scenario...I had Ductal Carcinoma In Situ. I was given the option to have a lumpectomy and radiation, but was being encouraged by three different surgeons to have a mastectomy, due to the micro-invasive cells they found. I at first thought I was going to die, literally! I was overwhelmed with every negative thought possible. My fist thought was who will take care of my 5year old autistic son. He needs me. Then I thought of my 14 year old daughter and how she is now at risk and may go through this some day. I had tremendous support from family, friends, and co-workers, but the one thing that helped me get through this the most was my children. I need them as much as they need me. I stopped feeling sorry for myself and decided to do whatever it takes to get well. I hope you remain positive through all this; I know how hard it can be. Take care and stay positive! Kathy",
      "MessageIndex": 15,
      "PostDate": "08/06/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/283259-calcifications.html",
      "Title": "Calcifications 1 2"
    }
  ]
}