{
  "AuthorID": "kcsusan",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kcsusan",
  "Posts": [{
    "AuthorID": "kcsusan",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kcsusan",
    "Content": "I had a baseline mammogram about 9 years ago, the test was so painful I was afraid to go through another one until May of this year 2007. I had read that new equipment made the mammogram much more comfortable, the small county hospital I had the proceedure done at had a GE Mammogram Machine and the test was about 95% more comfortable than 9 years ago. The test results required getting my baseline results to compare with and I was called back in for two more pictures of my right breast. I was then immediately ushered in for an ultrasound of the right breast and revealed a mass, I was told it was not a cyst, that it was solid. Within 3 hours I was sitting in my primary care physicians office and he was discussing breast cancer with me, explaining needle biopsy and lumpectomy and followup with chemo. This hit like a ton of bricks, now I have to wait until June 19th before seeing the surgeon. This is my first time posting on this website because I was seeking information of any kind I might obtain regarding the diagnosis. I do not know if it is benign or if it is malignant. I am 63 years old and I am not really scared, just like to have information and what to expect. I do know I am a real chicken when it comes to pain, and it was explained that I might have a choice on needle biopsy or lumpectomy, and I do not want to be awake for a needle biopsy, even though they use local anesthetics. I just get too nervous and squemish to be awake. The doctor did say they do a frozen section to determine if it is cancer and then remove lymph nodes for examination. Has anyone out there been through the lumpectomy and what follows ? I would appreciate any stories or experiences those of you out there who have been through this same thing. My doctor did say he was sorry I was one of 199.000 people who would hear the words breast cancer, he was quite informative and sympathetic and clear on what I am dealing with. Please share your experience by responding to my post if you will. I have a sister who is close to me and a brother. My mother recently passed away on March 15th, she was 88 years old and the dear soul of my life. I feel alone with this health issue, yet lucky to have the family I do have to help anyway they can.",
    "MessageIndex": 0,
    "PostDate": "09/06/2007",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/506878-mammogram-ultrasound-what-next.html",
    "Title": "Mammogram/ultrasound/ What Next ?"
  }]
}