{
  "AuthorID": "kec1944",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kec1944",
  "Posts": [
    {
      "AuthorID": "kec1944",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kec1944",
      "Content": "Just curious how everyone was first diagnosed? Was it through mammo, ultrasound, etc? Did you find a lump yourself, with or without pain? Thanks!",
      "MessageIndex": 0,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1045603-how-your-bc-diagnosed.html",
      "Title": "How was your BC diagnosed?"
    },
    {
      "AuthorID": "kec1944",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kec1944",
      "Content": "Thank you for your kind words. They are much appreciated. I am currently waiting for the breast clinic to get back to me regarding a biopsy appointment. I will keep you posted.",
      "MessageIndex": 4,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1045603-how-your-bc-diagnosed.html",
      "Title": "How was your BC diagnosed?"
    },
    {
      "AuthorID": "kec1944",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kec1944",
      "Content": "Hi there, well, I AM curious how women were first diagnosed, mainly because I am going through a scare myself. I have dense breasts, had a clear 3D mammogram 2 months ago, but I have recently discovered a painful lump/thickened area in the upper outer quadrant of my left breast. The pain does not dissipate after my menstrual cycle. I had an ultrasound today and the radiologist felt it necessary for me to have an ultrasound guided biopsy of the area. I am guessing that if he felt it was a cyst, he wouldn't insist on a biopsy. I am 46 years old, no family history, no risk factors at all, but I guess that doesn't necessarily mean anything. I am hoping and praying it is just a clump of normal fibrous tissue.",
      "MessageIndex": 2,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1045603-how-your-bc-diagnosed.html",
      "Title": "How was your BC diagnosed?"
    },
    {
      "AuthorID": "kec1944",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kec1944",
      "Content": "Hi there, I am also 46 and having the same issue, except it\u0092s on my upper outer left breast. I had a 3D mammogram 6 weeks ago which I was told was normal, although according to the report, I have dense breasts. I do feel a thickening in the painful area. I went to my GYN yesterday and she felt it might just be inflamed due to hormonal flux. She said if it doesn\u0092t improve after my next period has come and gone, she\u0092ll send me for an ultrasound.",
      "MessageIndex": 3,
      "PostDate": "08/11/2018",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1037950-fibrocystic-breast-pain.html",
      "Title": "Is this fibrocystic breast pain?"
    },
    {
      "AuthorID": "kec1944",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kec1944",
      "Content": "Hi all, I'm wondering if I could go 2 years between mammograms as opposed to annually. I'm 41, no family history, am very fit, eat a vegetarian diet with no alcohol and very little sugar. I do a self exam monthly as well as receiving a clinical breast exam by my GYN yearly. I hate the thought radiating my breasts every year if I could go without and go every 2 years instead. I have been told I have dense breasts. Thoughts?",
      "MessageIndex": 0,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/973332-annual-mammograms-necessary.html",
      "Title": "Annual mammograms necessary?"
    }
  ]
}