{
  "AuthorID": "KellyMT",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/KellyMT",
  "Posts": [
    {
      "AuthorID": "KellyMT",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/KellyMT",
      "Content": "It's confusing to me as well! We have a Breast Center where I live and there is a \"Breast Navigator\" who walks you through everything. On Tuesday (17th) I had a mammo and an ultrasound, on Wednesday (18th) I had an attempted fine needle aspiration, which quickly turned to a core needle biopsy as there was no fluid in the \"area\". Yesterday (19th) the Breast Navigator called and said that the Breast Surgeon is thinking we should just remove the area, even though the results aren't in yet, just to be safe. She also wants to further investigate what is going on in my right breast that is causing it to spontaneously bleed, so she will either explore it through surgery or through the nipple and in to the ducts. I dont' know what is going on...it's all happening so quickly. They just keep suggesting these things. I think one reson for the surgical intervention is that I was not ok with just watching/waiting for 6 months for whatever is making blood seep from my nipple. I don't know if that helped to explain it, or made it more confusing! I didn't know why either, and asked and she just said that the Surgeon decided to just remove it after hearing about everything. I suppose if the results come back today and they are positive for the big \"C\", they will be doing the same thing anyway, so why not just do it pre-emptively? Again, as I said, it is happening so quickly that I haven't even had time to think through the reasoning. I am just grateful to everyone involved through the Breast Center because they aren't just brushing it off as nothing and are being very proactive in the whole thing.",
      "MessageIndex": 9,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/896789-just-had-core-needle-biopsy.html",
      "Title": "just had a core needle biopsy 1 2"
    },
    {
      "AuthorID": "KellyMT",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/KellyMT",
      "Content": "Wow, S&P - we are one in the same. I am 34 and just had my core needle biopsy on 4/18/12 but they said my results would be back in 24-48 hours. Today is when I should get the call. Did they place a clip in you? They placed a clip in my left breast and then I will meet with the Breast Surgeon on 4/26/12 to schedule a lumpectomy for the left side and explorative surgery on the right due to a bloody nipple discharge. They found a cluster of what they assume are cysts right behind the nipple on the right side and were just going to follow up in 6 months with another ultrasound, but I spoke up and said, I have spontaneous bloody discharge from that area and I don't think that waiting 6 months is going to help me at all!! I'm already crawling the walls waiting for the results...it's driving me insane. I like the other advice about not looking on line, I made the mistake of doing that before I found this site and it is scary and unuseful. I just read your reply before posting this, I am so sorry that you have to navigate the cancer journey, I found a great book at B&N called something like sexy cancer, the foreword was by Sheryl Crow, the woman doesn't have breast cancer, but has pancreatic or liver cancer, anyway...she turned it in to an adventure and documented everything through pictures and journal entries. You should check it out, it was inspiring. You are in my thoughts as I wait for my results to come back. Fingers crossed.",
      "MessageIndex": 7,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/896789-just-had-core-needle-biopsy.html",
      "Title": "just had a core needle biopsy 1 2"
    }
  ]
}