{
  "AuthorID": "knemetz",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/knemetz",
  "Posts": [
    {
      "AuthorID": "knemetz",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/knemetz",
      "Content": "About a week ago I felt this very warm painful pimple like lump on the side of my left breast. I tryed to squeeze it (very painful) and a yellowish discharge shot out. It seemed to have gotten better, but today I woke up to find the exact same symptoms all over again. Have not squeezed it yet, as it is painful. I never had anything like this before, and not sure what to do as I have no insurane to have it checked out. I am very worried.",
      "MessageIndex": 0,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/845923-breast-lump-pimple.html",
      "Title": "Breast Lump/Pimple"
    },
    {
      "AuthorID": "knemetz",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/knemetz",
      "Content": "Quote: Originally Posted by nibbsie Try putting warm, wet compresses on it about 3 times a day. Wet a wash cloth with warm water, wring it out, and lay it on top of the area. When it gets cool, wring it out with more warm water. Do that for about twenty minutes. This helps the bacteria to come to a head and drain. Once it starts to drain, continue the soaks and wash the area with an antibacterial soap like Dial etc., to keep it clean. It is important that you wash your hands before and after doing the soaks and keeping the area as clean as possible. If you don't see an improvement then you need to see a doctor. I hope that this helps.",
      "MessageIndex": 2,
      "PostDate": "22/04/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/845923-breast-lump-pimple.html",
      "Title": "Breast Lump/Pimple"
    },
    {
      "AuthorID": "knemetz",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/knemetz",
      "Content": "Thank you for replying.....I hope it works as well,",
      "MessageIndex": 3,
      "PostDate": "22/04/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/845923-breast-lump-pimple.html",
      "Title": "Breast Lump/Pimple"
    }
  ]
}