{
  "AuthorID": "kristin68",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kristin68",
  "Posts": [{
    "AuthorID": "kristin68",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/kristin68",
    "Content": "I don't know what to do. I've been in so much pain lately and can't remember what life is like without having pain and the feeling that in general, something is really really wrong. For a year and a half I have had a constant, noncyclic pain in my left breast. If my breast were a clock, the pain is at 7:00. I had my first mammogram when the pain began and everything was \"normal\". Last month the pain worsened so I saw a doc again and had another mammogram and an ultrasound. A few small lumps were found but nothing appeared to be problematic. Nothing was found in the painful area but there is a notable change in architcture in that particular area so the radiologist ordered a breast MRI which my insurance will not approve as they deem the procedure investigative. I have lost focus as the pain is beginning to take over my life. Because of other health issues, Tylenol is all I can take for pain. This does nothing. I don't enjoy hugs from family and friends anymore. Pain pain pain. I have changed bras, cut out caffeine, eat very healthy foods. Things to mention: I now have an almond sized lump in the painful region. Periods are normal following ectopic pregnancy and ovary/Fallopian tube removal 2 years ago. I have two sisters who were diagnoses with breast cancer. They were both premenopausal at time of diagnosis. This pain is not related to my cycle. The pain is always there, nothing has reduced pain. I'm in relatively decent health. I do have mild arthritis. I also have torn tendons from repetitive work in my industry (chef). Please, I need help and support. I can't continue living like this and feel like the pain is beginning to define me.",
    "MessageIndex": 0,
    "PostDate": "09/04/2008",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/594931-severe-breast-pain-no-diagnosis.html",
    "Title": "Severe breast pain with no diagnosis"
  }]
}