{
  "AuthorID": "krystella",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/krystella",
  "Posts": [
    {
      "AuthorID": "krystella",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/krystella",
      "Content": "Hi, I have not written to this board for about 6 months. But now I am just giving you a short update on the calcifications which are present in my left breast. Well, I am really pleased to say that my atypical lobular hyperplasia has not progressed into anything more serious as yet. Although I was very worried in the beginning when I had many high density mammograms done on various parts of my breast, I realise now this was just to make sure the calcifications had not travelled to my ducts and developed into DCIS. In fact my specialist was pleased to tell me that I did actually have less micro-calcifications than before when I was tested (6 months ago), merely because I had had the biopsies. So I feel I am very much one of the fortunate ones and I definitely urge women to have mammograms done regularly and to follow up with any abnormalities they are aware of. Love Krystella",
      "MessageIndex": 0,
      "PostDate": "26/02/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24636-micro-calcifications.html",
      "Title": "MICRO-CALCIFICATIONS...."
    },
    {
      "AuthorID": "krystella",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/krystella",
      "Content": "Carreen, Thank you for replying to my questions. I have actually read quite a great deal about atypical hyperplasia on the internet and the high risk of it developing into cancer. As I mentioned in my post, I did see one of the well-known breast specialists in Melbourne (Australia). He has advised me to do nothing at this stage. I am on HRT and this he thinks I should conclude when I am 55 because the risks involved in my developing cancer now whilst on HRT would be no greater than if I were not taking it. Do you think this would be the case? Do you think I should be still on HRT? Also, I did in fact ask the specialist about taking Tamoxifen. He advised against it, saying that the risks involved with that were too great. I have had my uterus removed so I would not be in the category of contracting endometrial cancer. I also asked about having the microcalcification surgically removed but apparently if you have it in one spot, your whole breast is prone to having it. Do you think the doctor's advise of having yearly mammograms is adequate enough? Or should I seek a second opinion about starting Tamoxifen? Sorry this is becoming a bit long-winded, but my daughter (25) has been diagnosed with benign calcification in her left breast after having a mammogram. The report summary claimed everything was completely normal. Do you think it would be ok for her to leave this for another 2 years? Thank you so much for your response Carreen. I really do appreciate it. Krystella",
      "MessageIndex": 2,
      "PostDate": "15/11/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24621-can-anyone-help-micro-calcifications.html",
      "Title": "Can anyone help with MICRO-CALCIFICATIONS???"
    },
    {
      "AuthorID": "krystella",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/krystella",
      "Content": "I am a woman of 52 and for the past 7 years my mammograms have been completely clear. My recent mammogram, on the other hand, confirmed I had spots of micro-calcification. The pathology report (after having a core static needle biopsy) was comprised of the words mild epithileal hyperplasia, atypical lobular hyperplasia and others of less concern. The surgeon said the hyperplasia is completely benign and is of no concern whatsoever. Now, after visiting a second breast specialist because I wasn't 100% happy with the ATYPICAL lobular hyperplasia, I have been told that what I have is not 100% benign, yet not in the least bit malignant. However, there is a slight chance that it may develop into cancer, that cancer being DCIS. Of course I am quite worried about this. The specialist said that it would be quite safe to leave my mammogram for another 2 years. Can anyone tell me if they have had any type of ATYPICAL HYPERPLASIA and what they have been told? Or does anyone know of anyone with whom this might have developed into cancer? And what should I be doing about it? I'd be ever so grateful for a reply.... thank you. Krystella PS - I have no history of breast cancer only an aunt on my paternal side, who has lived 45 years since having a masectomy with a diagnosis of breast cancer.",
      "MessageIndex": 0,
      "PostDate": "13/11/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24621-can-anyone-help-micro-calcifications.html",
      "Title": "Can anyone help with MICRO-CALCIFICATIONS???"
    },
    {
      "AuthorID": "krystella",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/krystella",
      "Content": "Hi again, Thank you everyone who has replied to my questions. It's just good to know that I am not the only one who is worried about this breast disease. I certainly agree with you Starr, in saying that radiologists and breast specialists all have their own views on ATYPICAL hyperplasia. Subsequent to my previous two messages I have been to see another specialist who has advised me that ALH is in no way as serious as ADH can be. I was concerned at one stage that ALH can develop into ADH but my second specialist advised me otherwise which has put my mind at ease somewhat. I am now going to see a specialist once every 3 months for a mammogram on the affected breast, and needle core biopsies when necessary. I just want to keep a close eye on it so that it doesn't progress into breast cancer. Should I develop DCIS I will seriously consider a masectomy. I will continue with my HRT although I have halved it. My specialists have advised me this will make no difference in slowing the process down. I would like to know if there is anyone out there or if anyone should know of someone who has had this atypical hyperplasia disease and how it has progressed throughout the years - whether it has developed into cancer or not. Thank you again everyone... and Starr please write back to let me know how you went with your results. I do hope everything was ok. Take care now. Krystella",
      "MessageIndex": 7,
      "PostDate": "16/12/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24621-can-anyone-help-micro-calcifications.html",
      "Title": "Can anyone help with MICRO-CALCIFICATIONS???"
    }
  ]
}