{
  "AuthorID": "lady1954",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lady1954",
  "Posts": [
    {
      "AuthorID": "lady1954",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lady1954",
      "Content": "Thank you! What do they actually do when they remove it? I'm sure they'll have to do something. Bleeding is getting worse. Of course it didn't help that it was again squished and then pressed on. Very tender today! Actually, I was told in August 2013 that they thought there was some type of shadow and I was sent for another mammogram. Again a shadow was seen and I was told not to worry and redo in six months. Had another mammogram done in early February 2014. Again the same--a shadow, not much change from previous mammogram. Same thing in August 2014. My breasts are very dense and it's very hard to detect anything in them. Also dealing with a renal oncocytoma (benign) kidney tumor (4.9 centimeters in size) since 2013. Has to be monitored every so many months. Had uterus removed more than twenty years ago due to lots of fibroid tumors and lots of bleeding.",
      "MessageIndex": 2,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/992842-bleeding-nipple-right-breast-suspicious-tumor.html",
      "Title": "Bleeding nipple on Right Breast with Suspicious Tumor"
    },
    {
      "AuthorID": "lady1954",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lady1954",
      "Content": "About two weeks ago I was told I had what looked like a blood stain on the front of my shirt. I was shocked to find out it was actually blood that seeped through my bra. I actually tried to figure out exactly what I had done that might have caused such a thing, but couldn't come up with anything. After a warm shower I got ready and went to bed. When I got up the next morning I had blood stains all over the right side of my nightgown. I decided to call my APRN that day and got an appointment for last Tuesday afternoon. She commented that she just saw me about a month ago and everything seemed fine. I explained what was going on. She looked up my last mammogram that was done in August 2014. She then did a breast exam on my right breast. Before she was done, blood was welling on the nipple. Her nurse set up an appointment for last Thursday for me to have an ultrasound done. Again they looked back at my last mammogram and then did another one to check them against one another. The tech didn't say much except, \"Weren't you just in here a couple of months ago?\" I told her that she had seen me. Usually they are quite cheerful and will say not to worry. Not this time. By the time she was done, I was again bleeding. After having the results read, I was lead back to the waiting area and then taken to have an ultra sound done. I was asked again and retold what was going on. The technician seemed to be concerned about what she was seeing and so was I. She asked if I had noticed any changes in my breast. Truthfully, other than the tenderness, slight itching and then nipple bleeding, not really! She took the scans to have them checked, came back and took some more and told me that the doctor would be coming in to talk to me. He looked at the screen and told me that I seemed to have a tumor that is surrounded by blood. He also said he couldn't tell me if it was definitely cancer without a biopsy and was going to recommend that I have one done ASAP. He then left to make a call to my doctor. Last night I got a phone call from my doctor asking me to come to his office on Tuesday afternoon. He plans to expedite everything, so that it's done before Thanksgiving. He also told me he was referring me to the oncology department. Not sure exactly what that means, but probably to have the biopsy done. I told him that my mother was a breast cancer survivor and that my sister just had ovarian cancer last November. Last year with my sister, a mass was found on her ovary and then everything happened very quickly and she was having surgery within about two weeks of the diagnoses. So having things move quickly scares me a bit. I remember some of what my mother went through, but that was many years ago. What do they usually do? Any info would be wonderful. Thank you!",
      "MessageIndex": 0,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/992842-bleeding-nipple-right-breast-suspicious-tumor.html",
      "Title": "Bleeding nipple on Right Breast with Suspicious Tumor"
    },
    {
      "AuthorID": "lady1954",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lady1954",
      "Content": "Update. Was told by surgeon and radiologist that needle biopsy would not be done. Instead, a excisional biopsy will be done along with the removal of all the milk ducts in my right breast. This will be done on the 11th of December. At that time the mass will also be removed and tested for cancer. Surgeon told me that usually just removing the affected duct would take care of the bleeding issue, but mine is a bit more complicated. All the ducts in my right breast are dialated, which indicates there are other issues in the breast. Will find out after pathology report is returned. Surgeon also told me that if the pathology results are positive additional surgery may be needed and at that time other treatment options will be discussed. I was told that because the mass cannot be detected by the surgeon, a wire will be inserted through the nipple into the duct with the problem and then will encircle the mass to make sure the whole mass is removed at that time. Would have felt better about it if I was going to be knocked out for the whole thing, but surgeon told me the radiologist will numb the breast and that I won't be knocked out until just before surgery will start.",
      "MessageIndex": 5,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/992842-bleeding-nipple-right-breast-suspicious-tumor.html",
      "Title": "Bleeding nipple on Right Breast with Suspicious Tumor"
    },
    {
      "AuthorID": "lady1954",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lady1954",
      "Content": "After speaking to the surgeon on Friday, she tried stripping each nipple to show the nurse that was there. At that point, the right nipple produced the blood. Not sure if the left nipple produced anything. Then Sunday morning I get up and there is blood spots on the left side of my nightgown too. Lots of blood on the right side, but also spots on the left. This is just plain crazy! Can it happen in both breasts together? Made a call to the surgeon's office and waiting on a call back. Will see my APRN tomorrow morning and will discuss it with her then. Bleeding has increased on left side so that it soaked my nightgown and the bed covers.",
      "MessageIndex": 7,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/992842-bleeding-nipple-right-breast-suspicious-tumor.html",
      "Title": "Bleeding nipple on Right Breast with Suspicious Tumor"
    },
    {
      "AuthorID": "lady1954",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lady1954",
      "Content": "Thank you for your reply! My husband probably won't be too thrilled with that either, if that is what they decide to do! I remember my mother having drains in her breasts and remember her having them removed! I had taken her for her appointment. That was a pretty good sized tumor. I'm hoping to find out some more information tomorrow, since they set me up with an appointment with a doctor. Not quite sure what is going to happen, but hoping to get some answers. I was told that I was being referred to the oncology unit, but biopsy hasn't been done yet, however, blood work should be back by now. Thanks again! Any information is welcome!",
      "MessageIndex": 4,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/992842-bleeding-nipple-right-breast-suspicious-tumor.html",
      "Title": "Bleeding nipple on Right Breast with Suspicious Tumor"
    }
  ]
}