{
  "AuthorID": "lam41565",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lam41565",
  "Posts": [
    {
      "AuthorID": "lam41565",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lam41565",
      "Content": "Quote: Originally Posted by shisslak Lam I had a breast lump that I could feel while taking a shower. When examed lying down, the lump could not be felt. I had a mammogram which showed nothing, I was also giving an ultasound that day and again nothing showed. I have a very over protecting ob/gyn who takes nothing for granted with me and breast cancer because of my family history, so he made an appointment for me the very next day at the breast clinic. Again, the surgeon could not feel it, he only mentioned that yes he could feel a small difference in the tissue thickness but since everything came back normal he was not worried and felt that waiting 3 months to see if anything changed was in order. Well I played the game and when I returned in 3 months I told him that I felt that it had in fact grown and I thought that I could feel a second one right beside the first one. He was stilll not impressed, however, I insisted that it be surgically removed. This was done a month later and the pathology was atypical hyperplasia-a precancerous condition. So if you feel that the lump has changed in size and it concerns you than insist that it be removed and biopsied. All breast cancers do not show up on mammo's. I now have yearly mammograms and breast mri's because my breast tissue is still very dense and a mammogram is not very reliable to diagnose bc in me. Good luck and let us know how you do. Thanks for the info! Yes I will let you know what happens... Appt is 8/19/09.",
      "MessageIndex": 7,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705892-pea-sized-lump-breast.html",
      "Title": "Pea sized lump in breast"
    },
    {
      "AuthorID": "lam41565",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lam41565",
      "Content": "I had this lump for a couple of years now. It started out the size of a bb but it seems to have gotten bigger....size of a pea. It is very hard to feel while lying down but if I take my 2 fingers and pinch the area it is in and move my fingers I can definitely feel a round hard pea sized lump that is movable. It is located at the upper breast almost where the breast starts. I mentioned to my gyno a 2 years ago and she said it was nothing and I have had mammogram done since then and all came back normal. The thing is would a mammogram pick up something that is located higher up on the breast? I have my annual exam at the gyno in a couple of weeks so I will ask then again but just wondering if anyone has had a lump located higher up and what it turned out to be. Thank you for any info you may have.",
      "MessageIndex": 0,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705892-pea-sized-lump-breast.html",
      "Title": "Pea sized lump in breast"
    },
    {
      "AuthorID": "lam41565",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lam41565",
      "Content": "Quote: Originally Posted by trychocolate Hopefully your dr explained fibrous-cystic breast disease to you to calm your worries. I don't know how old you are, but this condition can start when you are fairly young and I am 50, past menopause (it's supposed to be hormone related) and still have it. If your dr were suspicious, she probably would have ordered an ultra-sound of your breast. Apparently, cancer has very distinct characteristics and differs greatly from this condition. This condition does not make you more prone to cancer, but in sufficient quantities, can make mammograms unreliable, hence, the ultrasounds at regular intervals. Bear in mind, these cysts can grow to an unusually large size as well as be very small and in different shapes and thicknesses. This condition can sometimes be controlled by diet. Cysts can be asperated if they become numerous and troublesome. If you are unhappy with your dr, perhaps consider a second opinion. Hope this helps, choc Thank you for the advice. Actually I didn't care for that dr because she always seemed in a hurry and she never even felt the bump, just kind of looked at the skin. One year she didn't even examine my breasts. I don't know if she just forgot or what. I had her for 2 years and switched back to my previous dr that I really like. I had to switch from the one I liked and had for years because my insurance changed and they didn't accept it. Now they do so I am going back to her. But like I said I did have a mammogram last October and they said everything was normal so. The lump is just higher up and I wasn't sure if a mammogram show anything up that high. When I go back to my good dr next month....I will really have her check it out for me!",
      "MessageIndex": 3,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705892-pea-sized-lump-breast.html",
      "Title": "Pea sized lump in breast"
    },
    {
      "AuthorID": "lam41565",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lam41565",
      "Content": "Ok...this is a little strange. Last night I was feeling this lump again just to see if it got bigger and i felt this kind of point through the skin. I pushed on the lump and rolled it between my fingers and all this brownish yellowish thick pasty stuff came out of the skin. Not really a hole like a pimple...just out of the skin. It was quite a bit and it had a foul odor. Could this have been a cyst that I ruptured or something? It didn't bleed at all...just this thick stuff came out. It was nasty. Anyway the lump seems like it went down some but is still there. Anyone experience anything like this? It is just strange that this has been there for a couple of years and this never happenend before. Maybe this is why it got bigger? Maybe infected or something?",
      "MessageIndex": 8,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705892-pea-sized-lump-breast.html",
      "Title": "Pea sized lump in breast"
    },
    {
      "AuthorID": "lam41565",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lam41565",
      "Content": "anybody have the above happen?",
      "MessageIndex": 9,
      "PostDate": "06/08/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705892-pea-sized-lump-breast.html",
      "Title": "Pea sized lump in breast"
    },
    {
      "AuthorID": "lam41565",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lam41565",
      "Content": "Anybody????",
      "MessageIndex": 1,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705892-pea-sized-lump-breast.html",
      "Title": "Pea sized lump in breast"
    }
  ]
}