{
  "AuthorID": "Laurenk314",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Laurenk314",
  "Posts": [{
    "AuthorID": "Laurenk314",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Laurenk314",
    "Content": "Hey I'm 27 and I was having a lot of those same issues as well as my breast would feel heavy at times. I know that pain tho its awful, every once in a while I would get it In my arm or feel it like it was coming from deep down in my arm pit. I had a swollen lymph node that was hard and wouldnt disaopear. I dont have any history of breast cancer in my family, but I do how ever have a family with fibristic breast tissue. My mom had to have a bunch of cysts removed from both of hers around my age. Which is pretty much what I became to blame the pain on. As well as my age. How ever as I was saying that went on a little over the a year and then one day i was laying in bed and my cat walked on my chest and and it hurt so bad. I went to check for some kind of bruise. That wasnt the deal though i felt a lump starting to appear. Asn time went on my breasts became tender especially about a week before my period. After a few months I started to get this burning pain, it hurt so bad. At times I was almost in tears. I should mention at this same time I was also growing super weak and always sleeping. I didnt think that it would be that much of an issue because I still had pain and from what I always heard it's probably not cancer if it hurts. So I just let that stay in my mind til the pain became so bad I started to look up what it could be from ended up with a bunch of different possibilities and also a new fear from reading peoples experiences that if there was one thing they could get out is telling people that cancer can hurt and they should get it checked out. That's when I finally broke down and went to the Dr. The burning would be like behind and actually in my chest and on top but that wouldnt happen with my menstal cycle either. I told my Dr. what was going on she recommended me to get an ultrasound on my breast and myy neck to check what was going on. I only had to get an ultrasound on my breast, and they found it right away and said it was a fibroadenoma. Told me about them and said that they are the 2nd most common non cancerous tumor to appear, that they usually have no real effect on your body. They can be left in there with no harm just come back in 6 months to follow up make sure it didn't grow or if I have an issue before that to come back sooner. It was good and not very helpful to me at the same time good that it was not cancer but at the same time they still had no reason as to why I had this burning which is what I really wanted stopped. I got my other ultrasound that day as well. At my follow up with my Dr. I asked her what I could because in my case I dont drink soda so caffeine wasnt the issue, which I was going to say could be with you as well as dairy foods would bother me. Even with the removal though there was no guarantee that it would stop it as well as there's the always the chance another can appear. She told me that day the ultrasound of my neck however showed a possibility for malignancy in my thyroid and I would need to see an ent about getting a biopsy done. I went to the ent well actually 2 long story but she set up my biopsy and a few days before that I went back to the Dr. Because it felt like I had another lump starting to appear in my other breast. She scheduled my ultrasound it showed up clear they checked the size of the other and made sure everything was clear. At that time I went ahead and scheduled an apt with the breast surgeon to see what she said about it or knew of any ways to deal. She said that usually they only take them out due to size, you can feel them or pain and you want to. I decided then that's what I was going to do, because it hurt so bad I might as well take my chances and see if helps since nothing else would. I set up an apt. to get get it done she said it would be about 6 hours all together for surgery from when I arrived and was out, it was done an out patient surgery. That I would go in and then they would take me to the ultrasound room and use it to put a wire in to hold it in place. She would only actually be doing surgery for about a half hour that she would go along the line of my areola where it meets so that way its natural and will blend in well. From that spot she would cut and cut out the tumor and put in a couple stitches and that would be it. I was nervous at the time it would be my first every surgery. about 20 mins after I left there how ever my biopsy results came in from my ent that I had papillary thyroid cancer and would have to get surgery to have it removed. It was a very over whelming day I ended up calling the Brest surgeon back to let them know for their information or to know and that was when I got the best news of the day I would be able to do them both on the same day and then would be in the hospital that night to be monitored. Needless to say I had them done less then a month ago, I haven't had any more pains in my breast anymore as well as the scar is so tiny its almost gone already. Sorry that was probably a lot more then you wanted to hear or know, but honestly it saved my life so I just want to make sure other people get their's checked too",
    "MessageIndex": 3,
    "PostDate": "02/10/2016",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1016236-shooting-pain-under-left-breast.html",
    "Title": "Shooting Pain Under Left Breast"
  }]
}