{
  "AuthorID": "lhfs",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lhfs",
  "Posts": [
    {
      "AuthorID": "lhfs",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lhfs",
      "Content": "Im 21 and about 2 years ago i found a hard lump in my breast about the size of a grape. I went to the doctor who referred me to a consultant. I had a biopsy and an ultrasound which showed that it was a fibroadenoma and is benign. I was told that these are completely harmless and are usually no problem. The consultant said i could have it removed if i wanted but i opted to leave it there for the time being. 2 years on, it has grown slightly and is sometimes sore. I dont know whether it needs to be looked at again? If its still ok, i dont know whether to just have it removed and forget about it forever. i dont want to have a general anaesthetic because when my sister had one she reacted very badly to it. Would they remove it under local anaesthetic? I just dont know what to do, i would appreciate some advice.",
      "MessageIndex": 0,
      "PostDate": "21/08/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/317208-fibroademoma-not-sure-where-else-would-go.html",
      "Title": "Fibroademoma (not sure where else this would go)"
    },
    {
      "AuthorID": "lhfs",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lhfs",
      "Content": "I have one of those too i think. I'm almost 21 and it appeared about a year ago. I started when one of the tiny gland things got a bit bigger. Its not very big now-only about 3mm in diameter. Its quite hard and looks white. It doesnt really hurt or anything but just doesnt look very nice. Ive not had it looked at. Do you think i should?",
      "MessageIndex": 3,
      "PostDate": "23/08/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/216830-small-hard-bump-areola.html",
      "Title": "small hard bump on areola"
    }
  ]
}