{
  "AuthorID": "LilBabyDoll",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/LilBabyDoll",
  "Posts": [
    {
      "AuthorID": "LilBabyDoll",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/LilBabyDoll",
      "Content": "Sharon, Thanks for your well wish and suggestion to getting a second opinion, but that would not be possible because the stereotactic mammography left markers at location where tissue samples where taken. A new set of mammograms will reveal those markers. How would I explain that to new doctor. If I told the new doctor that I was here for a second opinion, they would concur with the first doctor's opinion. They don't want to offend each other unless the first diagnosis was mess up and I am not BRCA1 positive. I have taken that path before when both doctors wanted to collapse my lungs and intubate. Serene",
      "MessageIndex": 2,
      "PostDate": "08/09/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/917434-recently-tested-positive-brca1.html",
      "Title": "Recently Tested Positive for BRCA1"
    },
    {
      "AuthorID": "LilBabyDoll",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/LilBabyDoll",
      "Content": "BRCA1, mastectomy, contralateral prophylatic Mastectomy, hysterectomy, bilateral salpingo-oophorectomy I am 28 and BRCA1 positive. Worry about my up coming surgeries I have a nickel size tumor on my left breast and other calclified tissues on both breasts. The biospy came back postive with cancer. I have been recommended by my doctor to undergo bilateral mastectomies soon. He also recommended that I should consider getting a total hysterectomy with bilateral salpingo-oophorectomy before I turn 30. He thinks if I take the chance to wait for the cancer to strike first before I take any preventive measures I am putting the other organs in my pelvic region at risk. I could end up needing a form of pelvic exenteration surgery and requiring one or possibly two ostomies. Is this the right thing to do. I am scare as hell.",
      "MessageIndex": 0,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/917434-recently-tested-positive-brca1.html",
      "Title": "Recently Tested Positive for BRCA1"
    }
  ]
}