{
  "AuthorID": "lilruthie44",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lilruthie44",
  "Posts": [
    {
      "AuthorID": "lilruthie44",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lilruthie44",
      "Content": "Hi to everyone just want to update you about my lump, i have received an appointment for next tuesday 29th at the breast clinic in Bath, not looking forward to it and still very worried even though i try not to think about it. Also would like to thank everyone for there nice comments.... Hugs Ruthie xxx",
      "MessageIndex": 4,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/840597-found-lump-my-breast-very-worried.html",
      "Title": "found a lump in my breast, very worried"
    },
    {
      "AuthorID": "lilruthie44",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lilruthie44",
      "Content": "Quote: Originally Posted by cazajacks Hi Ruthie, well i went to my appointment today and turns out i do have breast cancer. I'm totally shocked and devastated. I don't really know what else to say at the moment as im in so much shock, and this bloody chest infection has wiped me right out. I am going to see my gp in the morning as i need to be fit to go in for an op now, so need anti biotics. I really wish you good luck for next week, i will update more on what happened shortly. hi there cazajacks appointment didnt go well the lump isn't a cyst as i was hoping, they done 6 core biopsies 3 from my lymp nodes and 3 from the lump in my breast, have to go back to see surgeon on the 5th april to find out results but they are saying its a higher chance of being breast cancer than a begnin tumour, i am expecting the worse as right from the start my gut instinct has been its cancer. Sorry to hear yours is breast cancer, are you having a lumpectomy or a masectomy??? sorry for the spellin lol, i know i have made up my mind and have spoke to the surgeon and am having a full masectomy to prevent the cancer coming back in my breast, i have heard so much that after just removing the tumour alot of women normally go back as the cancer returns and they still have to have a masectomy, really hope you get over the shock and fell alot better soon with your chest infection... Hugs Ruthie xxx",
      "MessageIndex": 6,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/840597-found-lump-my-breast-very-worried.html",
      "Title": "found a lump in my breast, very worried"
    },
    {
      "AuthorID": "lilruthie44",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lilruthie44",
      "Content": "Quote: Originally Posted by lilruthie44 Hi there well my lump is definately not a cyst had to have 6 core biopsys very uncomfortable but not painfull to have done, they took 3 from my lymph nodes and 3 from my lump and i know what your saying the noise made me jump and more frightened than the pain cos after the injections went in with anesthetic i didnt feel a thing just the noise of the biopsy was a little sore the next day more sorer under my arm where they took them from my lymph nodes than my boob, have to go back on the 5th april to see the surgeon again for the results but have to say not hopefull its a begnin tumour, they are saying its a higher chance of being breast cancer, to be honest my gut instinct from when i felt the lump has been it's breast cancer just know it wasn't a cyst, i guess we know are own bodies, i am feeling the same as you very anxious and very worried as tuesday gets closer, my partner came with me to the last appointment and is coming with me next tuesday, my 18yr old son is devestated as he has seen his nan (my mum) go through breast cancer and is coming with me and my partner to see the surgeon for the results....hope you have good news with your results take care hun and try not to worry says me who is shitting herself lol xxx Hugs Ruthie xxx Hi there well found out tuesday i have breast cancer still in shock and all i want to do is cry, but having so many angry outbursts just dont know how to control all these feelings and emotions that are going on in my head, i have been booked in for a mastectomy on the 15th april just dont know how im goin to cope and feel about my body afterwards, they still arent sure if i have cancer in my lymph nodes so before i go down for surgery i have to have radiation injected into my lymph nodes then when i am asleep they will inject a blue dye in to look for hot spos in my lymph nodes, will not know if i have cancer in the lymph nodes til 2 weeks after my mastectomy, if there is cancer in them then i have to go back in for another operation to remove my lymph nodes then have to have chemo and radiotherepy, just really feelin awfull at the moment, anyway thought i would let you know , hope all is goin well for you.... Hugs Ruthie xxxx",
      "MessageIndex": 8,
      "PostDate": "07/04/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/840597-found-lump-my-breast-very-worried.html",
      "Title": "found a lump in my breast, very worried"
    },
    {
      "AuthorID": "lilruthie44",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lilruthie44",
      "Content": "Hi Everyone, I am 44 suffering severe depression, my partner found my lump just above my nipple in my left breast on tuesday, went to see doctor on the wednesday and now am waiting for an appointment to have a mammogram and other tests, really worried as my mum was diagnosed with breast cancer back in 2004 unfortunately she had to have a masectomy but is doing very well now... Hugs Ruthie xxx",
      "MessageIndex": 0,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/840597-found-lump-my-breast-very-worried.html",
      "Title": "found a lump in my breast, very worried"
    },
    {
      "AuthorID": "lilruthie44",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lilruthie44",
      "Content": "Quote: Originally Posted by cazajacks Hi Ruthie, i am a couple of steps ahead of you, i didn't find a lump but a mamogram did, i was called back last week to have another mamogram and an ultrasound and whilst having the ultrasound they suddenly sprang it on me they were going to do 3 'core biopsy's', i almost fainted with the fear, the thought of needles in my boob terrified me. They numbed my boob, about four quick stings and then nothing, even when i heard the noise of the biopsy being taken, (similar to a staple gun) i still didnt feel a thing. They've confirmed it's not a cyst, so now i have to go this coming wednesday to find out if i have breast cancer or if its a fibrous lump. I'm getting more scared as the day gets nearer, my hubby is coming with me for the results, just in case. I never knew i had a lump, but i was there because my other boob felt a bit sore, it is just a lucky coincidence they found the lump in my other breast, or it could have been there for a long long time. So i will sit and panic until next wednesday. Please be reassured that none of my core biopsy hurt, and i am a baby, i cry if i have to have anything medical done, even though i am 46 i am always anxious and hate having anything done to me. So for me to say it didn't hurt is shocking lol. Good luck, let me know how you get on. Hi there well my lump is definately not a cyst had to have 6 core biopsys very uncomfortable but not painfull to have done, they took 3 from my lymph nodes and 3 from my lump and i know what your saying the noise made me jump and more frightened than the pain cos after the injections went in with anesthetic i didnt feel a thing just the noise of the biopsy was a little sore the next day more sorer under my arm where they took them from my lymph nodes than my boob, have to go back on the 5th april to see the surgeon again for the results but have to say not hopefull its a begnin tumour, they are saying its a higher chance of being breast cancer, to be honest my gut instinct from when i felt the lump has been it's breast cancer just know it wasn't a cyst, i guess we know are own bodies, i am feeling the same as you very anxious and very worried as tuesday gets closer, my partner came with me to the last appointment and is coming with me next tuesday, my 18yr old son is devestated as he has seen his nan (my mum) go through breast cancer and is coming with me and my partner to see the surgeon for the results....hope you have good news with your results take care hun and try not to worry says me who is shitting herself lol xxx Hugs Ruthie xxx",
      "MessageIndex": 7,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/840597-found-lump-my-breast-very-worried.html",
      "Title": "found a lump in my breast, very worried"
    },
    {
      "AuthorID": "lilruthie44",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/lilruthie44",
      "Content": "Hi there Cazajacks i am so sorry for your news and i know how your feeling cos they told me tuesday i have breast cancer but not sure if its in my lymph nodes yet, i go in for my mastectomy on the 15th april, really not lookin forward to it just feel so useless with myself at the moment, feel very tearfull and am havin very angry outbursts, hope all goes well for your treatment and take very good care of yourself xxx Hugs Ruthie xxx",
      "MessageIndex": 9,
      "PostDate": "07/04/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/840597-found-lump-my-breast-very-worried.html",
      "Title": "found a lump in my breast, very worried"
    }
  ]
}