{
  "AuthorID": "Limarie",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Limarie",
  "Posts": [
    {
      "AuthorID": "Limarie",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Limarie",
      "Content": "Hi everyone, My name is Lisa, I am 38 years old....I am having some very strange symptoms.....I noticed some breast thickening in both breast that comes and goes.....almost like a muscle that tightens up and then subsides.....with a tiny bit of tenderness but no real pain to speak of. My nipples are itching like crazy......I have a rash on my right nipple with some flaking and peeling....I have had some discharge out of my right nipple not sure of the color....I am guessing a yellowish color or a straw color because when I have went to relieve my itchy nipple I noticed some crusting on my right nipple...I am positive there is no bloody discharge tho!!! And last but not least I feel like my breasts are tingling at times. I noticed the thickening of the tissue on Friday night (10/26) and will be calling my DR first thing Monday morning to set up an appointment and hopefully a mammogram!!! These symptoms have been going on for about 5 weeks except for the thickening of the tissue..... Here is some background on me.....I had a hysterectomy 3.5 years ago and had 1 ovary removed......I am Bipolar and take meds on a regular basis to control it. I have no sisters and my Mother who is 56 has had a couple scares (lumps turned out to be cysts both times) but has not developed any breast cancers as of yet. I would love to hear what you all think I might be dealing with.....this has been THE longest weekend of my life!!! Any comments are appreciated!! Lisa",
      "MessageIndex": 0,
      "PostDate": "27/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/925036-new-here-some-strange-symptoms.html",
      "Title": "New here with some strange symptoms..."
    },
    {
      "AuthorID": "Limarie",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Limarie",
      "Content": "Thanks so much Sera..... when I had my son 15 years ago I tried to breastfeed him and ended up with mastitis, and this kinda feels very similar to that in some ways. Like it or not I will just have to wait and see when I can get into my DR I really appreciate you taking the time to comment!! Lisa",
      "MessageIndex": 2,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/925036-new-here-some-strange-symptoms.html",
      "Title": "New here with some strange symptoms..."
    }
  ]
}