{
  "AuthorID": "Linda49er",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
  "Posts": [
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hey Phyl, Hi there I'm not her2 positive. I do believe tho with that women have told me they have to take Herceptin (IV) for a year. Your oncologist wold be the best to ask. I'm not sure if Cj is or not, I can't remember. I would look up the med and then that would give u more ideas on what questions to ask your onc doc. Sorry couldn't help more here Tc Huggggs, Linda",
      "MessageIndex": 1,
      "PostDate": "07/06/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/505775-her2-positive-breast-cancer.html",
      "Title": "her2 positive/ breast cancer"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Lourash Sorry to hear about your problems. I think that first guy you saw who poked you twice is a dork lol. About your nipple discharge....At the age of 20 I began having a greenish - black discharge from my breasts, left more than right. They never did a mammogram on me for that but did express some from my breasts and sent it to the lab for evaluation. I had severe fibrocystic disease and that was about all they did. They told me to quit squeezing my breasts. LOL well easy for them to say but I finally did. I got tired of the same ole stupid answers. But mine was fine. 40 yrs later I was diagnosed with breast cancer on the left. But the discharge finally stopped after many years (like when I was 50 not sure). I would say the best kind of doc to see for that is a breast care center doctor, they are awesome. Not sure this has helped but good luck!!!! Hugs, love and prayers, Linda",
      "MessageIndex": 4,
      "PostDate": "17/09/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/631228-diagnostic-mammogram-nipple-discharge.html",
      "Title": "diagnostic mammogram for nipple discharge???"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi, The \"quote\" I've always heard is that breast cancer lumps are not painful (mine wasn't) but to be sure its not cancer it wouldn't hurt having it checked out by your doctor. Also if your doctor doesn't order a mamogram I would request one to back up any ideas he may have as to what the lump might be. Regular mammograms are important too if you've not had one by now. They usually don't start them til age 30 I believe, unless theres a reason such as a lump, family history, etc. Now a days I feel its better to be safe than sorry Being on your menses now could make a difference. Hope this helps Good luck!! Linda",
      "MessageIndex": 1,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/490640-painful-lump.html",
      "Title": "Painful lump"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi all, I am a breast cancer survivor of 11 months as well as a valley fever survivor. I was wondering if any of you who have cancer have valley fever as well?? I am trying to find out if my cancer is related to my valley fever. My valley fever was diagnosed in 2003 and breast CA in 2006. Thanks!! and I love this board Warmest regards, Linda",
      "MessageIndex": 0,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/490514-does-anybody-here-breast-ca-have-valley-fever-well.html",
      "Title": "Does anybody here with breast CA have Valley Fever as well??"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "HI I had a green-black discharge from both my breasts for years. It was related to my fibrocystic disease and was never a problem. I finally quit telling docs about it cuz they all said the same thing. I had had cytology testing done on it but can't remember the results Its probably been more than 10 years ago. Hope you have found out something since you initially posted Best wishes! Linda",
      "MessageIndex": 10,
      "PostDate": "16/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/469959-anyone-out-there-have-nipple-discharge.html",
      "Title": "Anyone out there have nipple discharge????"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Firefly, Welcome to the board. I'm sorry it has to be under these circumstances. What kind of breast history do you have? How old are you? do you have this pain all the time or is it related to your periods? What is your doctor saying since they are going to do a needle biopsy?? Is the doc doing the biopsy in his office? Is he doing a core biopsy or somethng else. I have had a biopsy done by ultrasound in my breast docs office. Mine was to diagnosis mine because it was felt mine was cancer which it turned out to be. That doesn't mean that yours is tho. Several things involved that could make it something else. Have you ever had a diagnosis of fibrocystic disease? I started with that at the age of 20 and had had surgery on my breats 3 times before I was 40. All related to fibrocystic disease. I know its easy for me to say but try and take it one day at a time. See what the biposy shows and go from there. Its good you are having it biopsied. The sooner you deal with problems the better off you are. Not sure this has helped but will keep my fingers crossed for you and say a prayer for you. Do let us know how your biopsy turns out. Any questions you can ask away. People are really good about helping out where and when they can. Take care. Hugs, love and prayers, Linda",
      "MessageIndex": 1,
      "PostDate": "13/06/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/609716-mammogram-showed-multiple-nodules-scared.html",
      "Title": "Mammogram Showed Multiple Nodules Scared"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi there Greenacres, This one is a tough one for anyone to answer but wanted to answer your post anyways. It can be frustrating if you get no reply. When do you see your surgeon next? I would definitely sit down with him so he can explain everyting on the path report so you understand in English what it means. Thats part of his job And if you don't understand what he or she is saying, be sure and let them know that while you are there. Unanswered questions can stress you out and you don't want that. If you aren't going to see him/her for a while, I'd call his office and request he return your call to discuss your path report. I would tell his nurse tho cuz they work closer with the doc than the secretary. Let us know what you find out Hugs, Linda",
      "MessageIndex": 1,
      "PostDate": "15/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/499399-here-pathology-results-lumpectomy-m.html",
      "Title": "Here are the Pathology Results from Lumpectomy (m).."
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi there, When I had my mastectomy 2 of my IV's infiltrated and the fluid went into my skin which caused the swelling. Its not unusual for the iv to hurt when they put them in alot of the times. I hate that part. Mine was both tender and swollen when I left and it just took time to go away. A couple of weeks even. I would still have your doctor check the site to make sure you are okay. and there are no problems. You can even talk to your doc's nurse and she can help you too. Take care, Linda",
      "MessageIndex": 1,
      "PostDate": "16/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/490755-problem-iv-after-excisional-biopsy.html",
      "Title": "Problem with IV after excisional biopsy"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi cdn I think that when they do ultrasounds immediately unless its ordered its because they can't see clearly and can't tell exactly what they are looking at. Or it could be to confirm what they do see. Sometimes too they refer a patient to a specialist because it may be something her primary care doc doesn't treat and with breast issues I'd prefer a specialist any time I know its hard to not worry, you wouldn't be normal if you didn't so hang in there and I hope all works out well with your mom. Let us know how she does. Hope this helps. Warmest regards, Linda",
      "MessageIndex": 1,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/486152-breast-abscess-very-worried-questions.html",
      "Title": "Breast Abscess, very worried - Questions"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Thradia If it is a \"core biopsy\" I had that with my first visit with the surgeon. The surgeon uses the ultrasound machine to see the lump in question on his screen to help guide him. Another name could be a \"punch biopsy\" as that is how the machine that he actually uses to get the sample acts like. I'm not sure if having big breasts or small breasts makes a difference but mine hurt. They normally take 3 samples I think. My first two samples hurt and the last one I didn't feel a thing so I think the anesthesia worked better in that site. I don't want to scare you but don't really want you going in thinking there is absolutely no pain. You could also talk to the doc's nurse that assists him how it is done. You could tell them too you are nervous about having it and maybe they would advise you if you could take something before the test. It never hurts to ask I have heard others say too it didn't hurt so its kind of individualized as to one's pain tolerance too. I actually have high pain tolerance. Plus, I didn't know what to expect and that makes a difference too. Take care and best wishes!!! Linda",
      "MessageIndex": 3,
      "PostDate": "17/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/489411-biopsy-what-expect.html",
      "Title": "Biopsy: What to Expect?"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Kathy, Sorry to hear about what you are going through. I know how scarey it can be. I have a family history of cancer as well. Not all BC but some. My sister had bilateral BC at the age of 37, she is about to turn 60 this July. Then I have an aunt who at the age of 60 had a lumpectomy for her BC. Another aunt had a double mast somehow related to severe fibrocystic disease. I have a niece (my only sister who had the bilat BC) had some kind of cancer in her leg. Then my sister-in-law (not blood related of course) died from BC because it was not diagnosed until she was way advanced. Her lump started in her 3rd trimester of pregnancy and the doc waved it off as enlarged mammary glad. She then had my niece. When my niece was 3 months old my sister in law called me and described to me what her breast looked like. It was the typical sign of cancer with the por d orange effect (orange peel effect) and i told her to see a surgeon immediately She had a mastectomy on that side that week. when my niece turned 3 her mom was having her second mast the same week my niece what having surgery for cancer...a tumor on her uterus the size of a cantelope, one on her colon and one else where. Her mom is gone but my niece is now 11 yrs old. Sorry got carried away. There's more but i think you have heard enough. You are brave and I think you are doing the right thing.I think it will be easier on you having it done without the diagnosis of cancer now. I am getting ready to have the BRCA 1, 2 test. Did you have that with just blood work? For some reason I thought there was more to the genetic study. I am doing it for myself, as well as my 23 year old daughter who just found a lump but the surgeon feels it is \"just\" fibrocystic disease. If I am positive then I think she has to have the test too, do you know?? If I am positive my surgeon also said I would have to have my ovaries out as I still have both of them, with a history of polycystic ovaries. Do you know how long it is for the test results to come back on the BRCA?? I still want my other breast removed just in case. I too have been what they call \"full-figured\". I can remember when I was 9 I wanted breasts like Marily Monroe lol. Crazy me. Thank you for sharing your story. I apologize for such a long post. I wonder if my nieces of my sister in law should have the genetic studies done??? They are part of my brother if that makes sense. My prayers are with you with the whole ordeal you are going through. Best wishes for a speedy recovery!! Warmest regards, Linda",
      "MessageIndex": 4,
      "PostDate": "16/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/471381-prophalatic-double-mastectomy.html",
      "Title": "Prophalatic Double Mastectomy"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hey Teresa & Cj, Teresa, which one are you talking about that has estrogen properties??? I don't think I need any estrogen properties. I think you should read up on red yeast rice before you buy any, okay? Let me know what you think about it before you buy it. My doc wanted me to quit the red yeast rice (he's the one that recommended it to me in the first place) because he felt it would be too much med for my cholesterol cuz he wanted me to start Omega-3. When I read about red yeast rice here are some of the side effects it mentioned... Side effects of red yeast rice are rare but can include: Headache Stomach ache and/or bloating Gas Dizziness Heartburn The Hi Health store I go to said there are no side-effects cuz its an herb. Right now I take Crestor 5 mg. and 2 capsules of red yeast rice a day. Do you guys use omega-3? Then with Arimidex increasing our cholesterol were kind of stuck between a rock and a hard spot???? Ya take a pill for one thing and it creates a problem for something else. What a vicious circle. Now that i'm thinking about it my onc doc mentioned how \"something' increases your cholesterol cuz mine was elevated during chemo. Thats it...chemo decreased the effects of my meds is what she was talking about. I remember now. I think I'll read up on Omega-3 and crestor and see which one sounds the best. I just read a little and crestor has the same risk as the Lipitor I went off had.with muscle pains and aches. I wonder if the leg pain I've been having is related but you would think it would be in both legs? This pain has been bothering me since after I started the Arimidex tho on 12/18/06. It also says that risk factors include people on anti-hypertensive meds which I am on for prophalaxix for my kidneys because of my diabetes. I should dump all my meds except for my arimidex and diabetic and blood pressure meds. Hmmm will have to think about it. I have to have blood work in am so might wait and see what it says. I'm sure my docs don't know that arimidex elevates cholesterol. I'll see what they say about it first. My cholesterol was below 200 prior to being diagnosed with BC. Well sorry just thinking out loud lol. Hey man I just watched this spooky movie called Slither......ewwwwwwwww you should see it lololol. Not alone though Hopefully I can sleep tonite lol. Well take care. Enjoy your lunch tomorrow Cj sounds fun! Nite nite you two and everyone else Hugs, Linda",
      "MessageIndex": 41,
      "PostDate": "20/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "He Teresa Thats the type of reconstruction I want to have if I can handle it from the diabetes standpoint. I think thats called the \"tram flap' technique. I have the tummy for it. My luck with my last two surgeries (lumpectomy/mastectomy left side) was I got terrible infections with both. I had a full blown infection day 3 of my lumpectomy which was on 6/16/06. I was then on antibiotics to clear that up then they continued them til my mast. on 7/13/06. After my mast I ws on antibiotics again for 2 weeks postop and did fine until I went off them 2 weeks after surgery. Then bank 2 weeks later I ended up in the hospital with a cellulitis of the left chest wall with staph. My JP drains were removed on my first postop visits each time. After this next mast on the right I'm going to tell the doc to leave my drain in for a couple of weeks postop. The reason why is he took them out the first postop visit to prevent infection and I got the infection anyways. After my mast he ended up aspirating blood from my wound every week. The first time he did that he got a full pint of blood from me. I am also have to wait til later to have the reconstruction cuz am prone to infections. The reconstruction incision is usually from side to side all the way across your abdomen. Thats for the tram flap anyways. Will have to see what the plastic surgeon says. I know him and man is he gorgeous lolol. I see my surgeon the end of may or first week of June. My sister had the tram flap after having so many complications from the silicon implants. We are going on vacation around June 18th I am so excited! Its been 2 yrs since I've been able to go on vacation. We are heading for Puyallup, Washington first where I am walking for Relay for Life on june 22nd. I will be walking for my sister in law who died in 1999; a coworker who died Jan 11, 2007, for my niece who is a 8 yr survivor (she's now 11), for the cause and for myself. From there we go to Montana to visit my hubby's family and then home. My brother said he will have a wheel chair for me there to help me walk as I can't make a full lap thats forsure on my own. I use a cane now to walk any long distances great than 200 feet. I t really helps. welp have a good one!!!! Hugsss, Linda",
      "MessageIndex": 50,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Teresa Is the other breast being removed because you have cancer there? I would guess yes you'd have to finish your course of Arimidex even if the other breast doesn't have cancer. I plan to have my other one removed after my vacation this year. Take care, Linda",
      "MessageIndex": 17,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi there, I might give the green tea a try. I never could get the hang of tea or coffee cuz of the bitterness of it. My husband takes the Omega-3 and another cholesterol med...Vytorin. He was on 3 meds for his cholesterol and could never get below 300 on them. I get such side effects from some of the choles meds my doc wanted to put me on 2 but I refused. Thats when he mentioned red yeast right which is an herb. So I started both me and my husband on the red yeast rice. After 2 bottles (2 caps a day) my husband's choles was down to 167 on his last check And I am down as well. I think some docs have a hard time accepting herbs over meds. There are no side effects from herbs but meds? lots of side-effects. Well my bills are calling me so better get with them lol. Take care and talk to you laterz Linda",
      "MessageIndex": 35,
      "PostDate": "18/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hey there girlies Hmmmm what is it I was gonna say????????? oh yea!!!!! lol.... Yes I am experiencing loss of memory too. Little things like paying the bills cuz I don't get a regular paycheck like before. Also, can't remember which meds I've taken sometimes. I had these two 7day-pill box ya know and decided one was enuff so I would empty my bottle in its own little cubbie of the pill box. Today I fixed them back to every thing for Mon goes in Mon, for tues etc. That way I know again when my pills are gone in there for the day I've taken them all. That is bad My hubby is constantly asking me if i'm ok and I always tell him of course I am but I usually feel I am okay lol. I finally talked him into taking Lexpro the docs prescribed for him cuz he still worries so much for me and I think it will be good for him so he can cope better. Hey Cj...is your name related to cinammon? lolol Was just wondering lol. I think its your fav spice Teresa...I think that is the difference then. YOU pay for all of your short-term disability. I pay for half and my employer pays the other half. But I still don't think its right to tax disability. That means then you not gonna go to jail!!!!!!!!!!!!!!! Yipppppeeeeeeeeee I'm so berry glad cuz now we can keep talking lol. Had me scared there for a few. So no more fret for u Hey where'd you get that icon jumping up and down? I want one like him Oh wait one sec........... dang it didn't work lolol. Sharzies?????? Nite nite ladies Hugs, Linda",
      "MessageIndex": 48,
      "PostDate": "21/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Supermom, Sorry you are undergoing such stress. I think alot of your anxiety is over your mom's death which I'm sorry to hear of her death. Its not unusual for someone who is going through the loss of your mother to start noticing things on your body. I don't know how old you are but would definitely make sure you get annual mammograms, pap smears and physical exams. Your mind can do funny things to you at times. I've been there when I was going to school and studying about diseases...I developed everyone of them. This probably hasn't helped you much but I hope it does. It is so hard losing a loved one. It takes a long time to get over it, if u do. My dad died in 2002 and I still cry over him. Hang in there Take care, Linda",
      "MessageIndex": 1,
      "PostDate": "29/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/494846-zit-breast.html",
      "Title": "\"Zit\" on breast"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hey Cj I want to have my right side removed for two or 3 reasons. My main reason is because I don't want it to show up there next. Also I have a big family history of cancer including breast and others. And I have this feeling that if I can't have both I don't want any? And I don't want to go thru chemo again. I just noticed my reply to you about using bold lol. The signs were left out so it will sound funny. so the signs i am talking about are a B inside brackets alone turns on bold print and a bracket with a B in side with a / turns off your bold printing. I hope that makes sense lol. lets see it should be a bracket B bracket to start and a bracket /B bracket to stop bold. maybe that will help lol. Its coding but when you use it it does the function but doesn't show the receiver the code. A blood test would be better on the nodule. Not many places do sputum testing anymore. cocci is an airborne disease so the labs fear it. And valley fever is not known about in ny or other states except for the epidemic states. Its usually misdiagnosed. I'm seeing a neurosurgeon the 27the because of my back problems so will find out if it has anything so do with some of my hip/leg problems. Oh, what does NED stand for? Thanks for the welcome and yes I love being here. Its hard being on disability and not working for now. I've been a nurse for 38 years and I sure miss it. Take care Linda",
      "MessageIndex": 21,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Cj i'll try and show it better here lol but will do it un bolded format Ok the above sentence should be in bold. You typing has to be between the two different brackets. You always close something you open. So the first bracket opens the request, the second one closes it First bracket looks like this without the spaces I hope it works [ B ] The second bracket is [ /b ] i'll submit to see if it worked lol woo hoo it worked! lol. Now in what you see you just have to get rid of the spaces in them both...then you will see bold but no brackets Good luck!! lol Linda",
      "MessageIndex": 25,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi lol, Your's worked beautiful cj!!! lol good job! A for the day for both of ya! I even see your smiley faces at the bottom of ur msg. You wouldn't believe the pills I take, arrrggghhhh What are you wanting to take omega fish oil and cq10 for? if i may ask For a vitamin I take prenatal vitamins lol the pharmacist told me that was the best one to take for what I wanted. It has the D 400 u in it as I read in an article you shold take it...helps with BC; for my cholesterol I use \"Red Yeast Rice\" which is awweome and it has the CQ10 in it but you have to make sure u get the right bottle, one doesn't have the CQ10 in it. Crestor for prophalaxix for my kidneys cuz of my diabetes, lexapro for my depression-coping; arimidex ; 3 senekot for you know what (hahahaha) Then for my diabetes I take 2 pills and one shot twice a day. And guess what my shot is made from? you will never guess lolol ---------------------------------------> gila monster ---------->spit! lololol. Honest! (is that TMI? lol) I don't care for tea actually. My gf in calif sent me some tea that is suppose to be good for CA but it tastes like do-do Do you shop at a Hi Health type store for your extas? Thats where I go. Ok I won't write a long one this time, I've gotten carried away here. I'll do better . Take care and talk to yas laterz.... Wait lol. Ok cj u r from NY and Teresa is from Tenn? so time wise u r 2 hrs away and teresa 1 hr away to my time? we don't do DST here Ok good nite!!!! Hugs Linda",
      "MessageIndex": 31,
      "PostDate": "16/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hey Cj, Hey there how was your lunch with your friend? Hope you had a good time Yea, it would be good to talk to your doc about the red yeast rice first. I talked to my pharmacist tonite and I'm gonna stop the rice for a couple of months and try the Omega-3. Then I'm going off my Vit D, and Mega B with C because I get full benefit from the Prenatal Vit I am taking so I would be covered. Just trying to cut down in some of the pills I'm taking. Plus, I want to start my aspirin back up. Have been off of it since chemo. Can't remember if I told you but after the x-rays last week NO fractured rib and no compression fracture at L2 Just got an email from a friend of mine who also has Valley Fever and she just found out she has 6 fractured ribs and the VF has disseminated into her bones possibly Mannnnn!! Well I hope you guys have a super weekend. Any plans? Take care and keep on moving there Teresa!! Hugs, Linda",
      "MessageIndex": 45,
      "PostDate": "21/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Gals JOJO...Yes I have trouble sleeping too. Mine presently is from the Arimidex i take. Soooo a couple of times a week I take my xana so I can get some sleep. I hate taking pills but i'm on so many now whats one more? I do sleep well tho when I take the xanax. I can take 1-2 mg but I usually just take 1 mg. That is plenty for me. When I went for my first MRI...standup even, I took 2 mg for anxiety. I slept through the whole dang test lolol. When I was at the point you are right now, i took it every nite. It will get better Teresa...lololol ur a nut I see! lol. opps brb!! Phew close call! lol. 2 out of 3 of my kids live at home. My oldest is 27 and she is handicapped and has the mentality of a 2-10 year old. We did put her in a group home in 2001 but moved her back home Jan 23 of 2006. The care was very poor and lacked supervision which she requires 24/7 The evening girl left her alone and went home before the nite girl showed up for work. When I found that out I hit the ceiling and moved her home. The best thing I could have done. My son 21 still lives at home but as soon as he gets a better job he plans on moving into a house with his best friend. He's my baby. Then my 23 y/o daughter moved out last June. Her moving has been easier than I thought cuz she only moved a mile away and so we see each other alot and we talk daily. She lives in sin with her boyofriend lolol. No he's really a nice guy. Society has changed I hear. But they are happy so thats all that counts. My brother 60 and 10/12ths also lives with us. Oh my hubby too lolol. As far as my mast site goes its ok. The numbness is from the involvement of sooooooo many nerves in the area. The sentinel biopsy site and my porta cath site caused me the most pain. None really in the incision....just the nickle size spot that wouldn't close on my incision. The day of surgery and even before surgery I started arm exercises which really helped postop. I have probably 98% of range of motion of that arm. My doc has also told me he wants me to use that arm normally but I am some careful because of the lymphedema in that arm. The lymphedema is better but not 100%. I get some thickness feeling in my underarm so I massage the area to wake up the flow and that helps. I hate shoes lolol Well got to run to the bank and store then I'm going to attempt to walk 1/2 mile. Not sure I can do it but will see if I can get farther than I have been walking. Talk to ya later Huggss, Linda",
      "MessageIndex": 59,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi all Hope everyone had a wonderful Mother's DAy!!! I spent the whole day with my family plus my mom was here from Washington state so that was nice too. JoJo, I had my chemo treatments on Monday and then returned on Tues for my Neulasta injection. With me the sternal pain hung around all the time. When it initially started it lasted longer but would come and go. My pattern was like it would come on strong then slow down, then quit, then kinda thumped thumped thumped. I felt the worse part of it was like all the little white blood cells being release cuz after the thumping was done everything would stop. Then repeat it. I would say after 1 month for me the sternal pain slowed down and wasn't as strong. My Onc doc told me the bone pain usually is in the sternal area of the chest, and the pelvis. Mine was all sternal. Are you taking anything for the pain? Me being stubborn I only took something for pain at bedtime so I could sleep better. Did you say your onc mentioned the Aleve and Claritin 24-hr? I took it twice and it didn't really do much for me but everyone reacts differently. Is the Compazine taking care of your nausea??? Its and excellent anti-emetic but I was disappointed it didn't do a thing for me. I was luck tho because I didn't have the nausea long. They also gave me a script for the oral Kytril but I never used it. Dang expensive tho. Thats the same med they give you chemo day. I think I got 3 tablets for like $50. Terrible!!! Are you having chemo weekly or every 2 weeks? Hang in there my friend One DOWN and seven to go. \"High 5\" !!!! It will really go by fast My prayers are with you. Thinking of you every day. Huggs, Linda",
      "MessageIndex": 102,
      "PostDate": "15/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi all Hey JoJo....I got my first prescription for the xanax the first week of May of 2006. I found out about my BC at my mammogram which they did an immediate ultrasound...said its protocol if they see anything. Surprisingly the gave me my results. At that time I was having loads of anxiety and needed something. So I started using the xanax 1-2 mg. the first week of June. It was hard for me to face my family. All I could do is cry in my bedroom. I had my lumpectomy on 6/15 and by day three had a massive infection in my breast. When I did take it I only took the 1 mg. Then on 7/7 I had an auto accident. Some idiot lady hit me almost head on, I didn't have seatbelt on ;( and my van was totalled. When we hit I was thrown against the steering wheel but told the paramedics I just wanted to go home. The only pain I felt at that time was knees and elbows...all 4 looked like rug burns. 2 hrs later I was hurting...my left shoulder blade and left breast (where i had had surgery). I peeked at my breast and it was bleeding and the blow to my chest had popped open my incision half way. I hate taking pain pills cuz they are so constipating so I'd take the xanax maybe everyother day or so. I took it through my mastectomy and chemo. My last chemo was 11/20/06 but maybe stopped the xanax in sept or oct cuz I was finally relaxed. I took one the day of my first radiation cuz I was scared and it was easy as pie So then I didn't take any more til I discovered I had insomnia from the arimidex so might take it 2-3 times a week. No pain from the mast site, just the porta cath area was sore and the incision under my arm with my lumpectomy. Xanax can be addicting but now is not a time to worry about that. If it helps you...take it Thats what everyone told me. And when I can't sleep I take one...I just have to remember to take it early. Same with pain pills, I wouldn't take them either and my chemo doc got mad, said there was no reason for me to hurt sooo I started taking them too, maybe 3 x a week. One med that worked wonders was lexapro. Its an anti-depressant and I didn't think I'd ever be taking one but I really like it. It is also what helped me cut down on the xanax. With Lexapro, if I missed it for 2 or 3 days...I would find myself crying again, so I knew it was helping me alot. Hope this helps Keep the faith and positive thoughts...that will help you through all this. My prayers remain with you. Warmest regards, Linda",
      "MessageIndex": 63,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Ladies, I survived my walk, thanks. Didn't get far but got past 3 more houses. Some progress anyways. Hope you are all well. Huggss, Linda",
      "MessageIndex": 74,
      "PostDate": "26/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Girls ~~~ Hey Teresa its been a while!!!! I was gonna let ya know I called my disability company tax service and finally got the right answers...not for me tho lol. My money paid was before taxes so thats why I got a W2. So darn won't get any of that payment back. I did find out too tho that I don't have to pay taxes on my Long-term. And was informed last week by the LTD rep I need to start applying for Soc Sec disability. She said it takes about 6 mos to get it started. But, I don't want it cuz our business MIGHT get going come aug but i'll start it for now. Hey JoJo...I've used Aquaphor on my skin. Got it from my Rad. doc. It helps re-hydrate your tissue. Now I just use it as needed. You can also use it for your lips. Hope your chest is feeling better Take care and talk to you laterz, Huggsss, Linda",
      "MessageIndex": 87,
      "PostDate": "09/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Ladies!!! Well I hope you all had a gooooood weekend Ours was pretty good weather wise. Yesterday even we had a big dust storm which isn't good here and then today it got up to 102 already. I dread the coming months. I am doing fine now Cj...thanks. I'm coming up on 1 year since I was diagnosed with my BC and I guess it gets me thinking if I'm gonna be here in another 4 years. I'm sure I will be cuz I am so ding dang stubborn. I just keep thinking of my sister in law who died from BC in 5 1/2 yrs but hers was so much more advanced than mine. So I just have to remember that. And 2006 was such a rough year every once in a while it gets to me and I think what next? So I have to just get my thoughts back where they should be and quit feeling sorry for myself. I'm going to call my physical therapist and ask him for exercises for my sciatic nerve since the spine doc thinks thats where the pain is coming from. My primary doc just filled out my disability update statement and he told them I would be out at least another 12 months. So, I am thinking of a career change. Before I was diagnosed with BC I had 2 businesses ready to open. Then I put them on hold when I was dx with the cancer. So, come July after my vacation hope to get things rolling as its pretty hard to save money on disability. I'm really not ready to quit work yet. As for going to the YMCA my 2 kids just joined but I ain't about too lol. Ain't nobody seeing this body in a bathing suit!!!!! I haven yet figured out what to do for a suit, maybe just wear a t-shirt since I only gots one boobie lol. Its my pool out back so I can make up the rules T-shirts allowed!!!!! I haven't worn a bra since June 15, 2006. I have 2 beautiful Softee bras but just don't wear them. They have the camisile <sp?> with them and are nice though. After vacation I plan to have my right side done so maybe after that I might wear the Softee bra. I have 2 questions. The first one is easy I think lol. On arimidex have you noticed a DRY mouth and lips? I sure do. I had it some with radiation but then must have forgot about it but I sure have it again. Secondly, have any of you had an a larger abdomen since your mast?? I don't know if its related to my sliding hiatal hernia I was just diagnosed with but it has bothered me since Sept. 2006. My onc told me we can wait and find out with my pet scan after my last chemo treatment. Just to make sure it wasn't a turmo which I really didn't think it was. My hernia must have gone down in place because the pain I was having in my middle rib area is gone but it still feels like something is pressing against my rigs, left (mast side) greater than the right. I think the distension is finally better but my upper abdomen in the epigastric area is driving me nuts. At what age do the golden years start? My parents told me they suck so I might be in them already lolol. Teresa--- back on the tax issue? Do you know if your money was pre-taxed monies? I'm calling my disability company to find out why I got a W2 since I paid all of the premium. I gotta feeling they are going to tell me all the money I received was pre-taxed grrrrrrrrrr lol. Will letcha know. Hope you all had a good weekend. Talk to ya soon. Huggs, Linda",
      "MessageIndex": 80,
      "PostDate": "29/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "[B]Hey Girls !! JoJo, I've been thinking about you all day and wondering how you did. I'm glad you've got #1 behind you I'm sorry you are felling so upset. With the Decadron be sure you take it after you eat....it can really make you sick to your stomach. It looks like I took the same drugs as u got today...the Emend and Aloxi and Decradron. Did they give you anything for nausea at home? Don't be afraid to take the nausea med to help you through this first week. But definitely take something with the Decadron don't take on an empty stomach. (Huggs) You are doing good Just hang in their girl!! Get lots of rest Was good to hear from you tonite too. Hey there Teresa!!!!! Welcome back! Did you get our permission to be gone so long? lololol. Well glad ur back! I left you a msg earlier about what I found out on my tax situation. I was hoping to get some of my payment back but no luck I could have used the $3300 more than the IRS lol. How was your trip? Oh and guess what!!! I got my results back on my mammogram I had last monday. They also did axillary pics too on my surgical site. All was normal wooooooo hoooooo lol. Well have a good weekend and Happy Mother's Day to you all!!! Huggs, Linda /B]",
      "MessageIndex": 96,
      "PostDate": "11/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "[B]Hi Cj Bold? when you open the reply box you click on the \"B\" right above the msg box. you will get this --> the cursor will be in between the 2 b's so you want to type there. means the bold printing will start here and means the bold print will stop here I see bold better cuz of my eye probs. so I use it when I can. I'm a computer addict lolol. Linda",
      "MessageIndex": 20,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi lol. you guys are cracking me up. didn't u have a tool bar before? or maybe one of you said you used quick reply thingy. Teresa couldn't you use smiles before? Your boo hoo is great!!! It worked perfecto lol. Well if the ques was directed to me as to my type of cancer I had infiltrating ductal and tubular BC. My prognosis is good by taking all the treatments she offered me she said. My her2 was positive so am able to take the arimidex. I had one cluster of nodes removed which contained 10 nodes and 5 were positive out of the 10 which put me at Stage 3. I found the lump so requested the mammogram and it showed the cancer after confirming it with an ultrasound. Yes, I have arthritis in my feet, knees, hands, wrists, elbows and spine. Why leave any part out?????????? lol One nite when getting ready for work back in 2003 every step I took it felt like a knife twisting inside me so I went to urgent care. They took xrays there and that was the first time I was ever told about my spine. They said I had no disc between L1 and L2; no disc between L5 and S1. Then they told me they didn't know what I did to L2 as it was totally destroyed. Said I must have had a terrible accident. Soo, I told them I've never had an accident but my job of 38 years included lifting on a daily basis and they said then thats the cause of my back problems. I spent the next 3 days sleeping from the meds they gave me but my pain went away. Then after contracting valley fever I was sent to an arthritis doc who is now treating my arthritis. Then one nite after falling at work I was seen in ER and this PA jerk came in after looking at my xrays and bluntly said \"I think you have bone cancer\" I was devastated. Then the doctor who the PA worked under came in and said her PA told her I was upset and crying. So all I could say is \"what in the hewq would you do if someone came in and told you you had bone cancer? She then told me she didn't think it was as bad as i thought it was. So I asked her how she would take it. I saw my primary and he ordered my first total body bone scan and thats where my arthritis was confirmed and bone cancer (multiple myeloma) was rule out. I was very happy to say the least and very angry at that PA who had no business saying that to me. Now that I was dx with BC I always wonder but all my tests keep coming back negative and I am now in remission I see a neuro-surgeon on the 27th to get an evaluation from the orthopedic standpoint. Surgery might be recommended but I don't want back surgery unless its the last choice I have. I was also recently diagnosed with a sliding hiatal hernia which I blame for my abdominal pain. By the time I get done I might have a new bod!!! lol. That might be good too Did you guys lose any hair?? Mine was down to my waist but I had it cut 3 times so I was in control. It felt better for me to be in control of something. I had long straight brunette hair and it is coming back now as probably curly salt and pepper hair lol. I like the color. lol Hey I keep looking for sticky notes, do you know what they look like? Welp, going to lunch with some girls from work in an hour so I'd better get dressed? lol. You guys have become addictive to me lol. Yup I blames ya for me being here! I love it!!! lol Take care and talk to ya soon Linda",
      "MessageIndex": 29,
      "PostDate": "16/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hey Teresa, I wasn't aware Arimidex causes elevated cholesterol. i will have to make sure my doc knows. I may experiment with omega 3 but will have to see. He wants me to stop the red yeast rice but I refuse. My husband and I have had too good of luck with it. Let me know what you find out Talk to ya laterz, Linda",
      "MessageIndex": 37,
      "PostDate": "18/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Cj and Teresa I've read your posts and its funny how I have similar issues. Not funny but you know what I mean. Right now I'm nervous about posting because I'm afraid of saying something I shouldnt. So please let me know if i do I'm a nurse and it is HARD not to share my nursing experience, but again they are my personal experiences. I was diagnosed with BC May 30th 2006 following my mammogram. I found the lump as I've had severe fibrocystic disease all my life and had had 3 biopsies in the past so used to doing breast checks. June 15th I had a lumpectomy which did not show clear margins on path so had my mastectomy July 13th. After that I went thru chemo and radiation and this past Dec. 12th I started my arimidex. I don't really know all the side-effects and which problems i've been having are related to the arimidex. I got the neuropathy from chemo and my onc said it will go away in six months. I'm also diabetic so I don't expect it to go away totally. It is much better now, only in fingers and toes versus hands and feet. Then I've had pain in my right hip radiating down to my right knee. I has been a 10 out of 10 pain left at its worse. I initially thought it was bone pain from my arimidex but my onc told me usually the bone pain from arimidex is only in the hands and feet. Does that sound right? The pain down my leg is just on the outside part of my leg, not inner leg. I do have mega back problems from 38 yrs of nursing so they are thinking the pain is from my back problems like a pinched nerve? I do have an \"old compression fracture\" at about L2, and 3 bulging discs and lord knows what else. I have done 2 weeks of physical therapy ordered by my rheumie and it has really helped. I am now able to lift my leg more than 2 inches off the ground without it hurting. The muscle and hip pain is better but not gone. Does this sound similar to your guy's pain???? There's also a possibility that I have a fracture right rib probably related to my radiation treatments. My radiation doc to me I would be at high risk for rib fractures following my radiation. Also I understand my risk for fractures is also increased if i'm on Arimidex. Were you guys told this? They said it may be fractured from coughing. Cj...you said you have a lung nodule? Did they do any tests to diagnosis it? Did they give you any idea of what it could be? Six months to sit on it seems like a long time?? I have a lung nodule as well, smaller now, but I know what mine is is why I am asking. You are in NY right? Have you ever been to Arizona, California or New Mexico? Now I'm a bit nervous to ask much more on this issue in fear of breaking posting rules This is my first nite here and I don't want to be banned from something I say lol. Have you ever heard of Valley Fever? Teresa, what profession are you in pushing boxes of IV fluid's? Work in a pharmacy or central supply? nurse? I was tickled to find this place. I have a gf that has really been by my side through this but sometimes I feel bad talking about my cancer with her all the time so its nice to find someplace where you can talk about it. Teresa? where are you from? Thanks for sharing your stories Linda",
      "MessageIndex": 13,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hey Cj Hi there. I've just been reading about genetic screening for BFCA 1, 2. I think I am going to wait and talk to my doctor about it first. I printed out an article I just read and it sounds kind of scarey in some areas. I am also thinking I should have genetic \"counselling\" B4 the testing is done too. It was my surgeon who recommended it when my daughter went to see him about her breast lump (I went with her). I see my surgeon the end of May or first week of June also. Will let you know I probably won't talk to my daughter for about 2 weeks tho when I see him regarding how I'm doing on my gila monster medicine lol. Nite nite again Linda",
      "MessageIndex": 42,
      "PostDate": "20/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi guys Let me see woo hoo lolol. there we goes Love it! Ok I have to scroll some to read the replies lol On the tram flap my sister had one and has had no prob with it. I've not had the courage to ask her to let me see it so will look at pics 3 things may interfer with me having that done....infections cuz of diabetes, my new sliding hiatal hernia, hmmm forgot what the third was lolol. But I'll definitely check out the pros and cons. I had one area on my mast that didn't close right. Washed it with soap and water for ever I think and then my radiation doc said it has to be closed before radiation so talked to my girlfriend whose in charge of wound care and I then started washing with soap and water then applying duoderm gel every day....it was closed in 3 weeks just in time for my radiation phew. I have 2 girls and 1 boy. Ages are 28 y/o handicapped daugher; 23 y/o daughter who is a cop; and son 21 who is trying to get on with the county as a juvenile detention officer. My hubby is an EEG tech...works on everyone's brains! lol. I'm really looking forward in our vacation cuz I couldn't go on one the last 2 years so it will definitely be fun. Only bad part of it is the ding dang price of gasoline. We are at 2.93 right now, how about you guys? We figure with the motorhome we're looking at 1200-1600 just for gas arggghhh. Today I started drinking lemon water. Trying to cut out my diet coke as I drink prolly 8 cans a day So I've only had 3 can's of diet coke today and so far 2 of water but gonna fix another water shortly. I've also lost maybe another 1-2 pounds. I could do better tho cuz i been a bad girl on my diet this week my fault...shame on me! lol Well will let ya go since ur both prolly already nite nite lol. Its 11:05 pm here. It has been a wasted day cuz I ended up taking my sleeping pill last nite (xanax) too late and I was tired all day. None tonite! More laterz Nite nite, Huggss Linda",
      "MessageIndex": 55,
      "PostDate": "22/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Ladies, How goes everyone? I've been at the spinal docs this morning. So the outcome includes the following: 1. From L1 to L5 my spine is totally messed up. Its unfixable. He also said that sometimes they will try surgery for one or two levels but never 5 like I have. 2. He feels my hip and leg pain is from sciatic involvment. Sooo he is ordering a cortisone injection into my sciactic area and see if that helps the pain. 3. He said he can treat the symptoms but can't fix my back. He said if anyone tried they could do more damage than good. So it is something I will have to just live with. It is ok because my hip and leg are giving me the most problems. So it will be about 2-3 weeks before I get the injection and CT-myelogram. I'll be back laterz. If I miss ya have a super weekend all of yas Have missed ya Just kinda down the past couple of days. Take care, Hugggsss, Linda",
      "MessageIndex": 77,
      "PostDate": "27/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi again Hey Teresa, I meant to mention in my previous post here I found out that my employer did NOT pay any of my premium and I looked up Pub 17 and it does state in there that my disability would not be taxable. Is that what they told you??? I don't know why I got a W2 then so am going to call the IRS again and see what they say. They said it makes a diff how much your employer pays but I didn't know exactly. Maybe I can do an ammendment and get some of my $3315 back? lol would b loverly woo hoo! Will letcha know laterz. Huggs, Linda49er p.s. How's your swelling?????",
      "MessageIndex": 78,
      "PostDate": "27/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi there JoJo Will be thinking of you Friday. Cj is right the unknown is what scared me. The first thing they do is access your port and then will flush it with a little bit of saline to make sure it is patent. You will see a little bit of blood back flash. At my clinic they always did CBC (complete blood count) to make sure your white blood cells (wbc's) and hemoglobin/hematocrit (H&H) are not too low. Then if everything is okay they started me with a little 100cc bag with Decadron to run over 30 mins. Then the Adriamycin. If your getting adriamycin thats what i initially got. Adriamycin was red and they give that by IV push....from the syringe right into you IV site. They told me it was very important to start drinking water a glass every 2 hrs for this drug which they probably told you during your teaching. After that I got the Cytoxan....it was in a 500cc bag and it was run in over I believe an hour. And that was it The nurses are very nice and very knowlegeable so don't be afraid to ask ANY questions you want. I was scared to death my first day and then felt silly afterwards. But it is very normal to be scared Will you be getting a Neulasta shot the day after chemo? Thats the wbc booster..... its to help you from becoming neutropenic (low wbc's). They take very good care of you! I had my chemo on a Monday. They told me I could feel the pain from the chemo in two to 3 days or even possibly that nite. That nite I felt a little heartburn in my sternal area. I took 2 tums and waited. They didn't really helped so I just documented it in my journal. The next day at noon I had the say heartburn type pain in my sternal area. Took a tum and relaxed. No relieve again. At that time I knew it was the pain they described to me. I have esophageal reflux so was familar with heartburn and always got relieve from tums. Once I figured out it was the bone pain I was fine. I handled it pretty good. Maybe only took my Percocet 2-3 times during the first month. I do remember taking a 2 hr nap after each dose cuz I was very tired. My onc recommended 1-2 Aleve with 1 Claritin 24hr one, for bone pain. I found that interesting cuz I couldn't understand why a decongestant for bone pain. So she explained to me they did a study and used 50% in women who had been on claritin for allergies and the other 50% not on claritin. The study showed the women who took the Claritin had no bone pain. It was funny cuz all my docs asked me why as well. You could ask your doc/nurse about it. Its important when getting chemo to check with your doctor on any meds you take that are over-the-counter. Good luck tomorrow my dear You will do just fine. My clinic had warm blankets and they will keep you comfy. It is usually cold there so after my first treatment I knew how to dress. You can take a drink, a snack, and something to read or write or cd's to listen too. Anything that will relax you ((((((((JoJo))))))))))))) Be thinking of you. Huggs, Linda",
      "MessageIndex": 92,
      "PostDate": "10/05/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/488174-arimidex.html",
      "Title": "Arimidex 1 2 3 4 5 Last Page"
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi Aleeluh, After 4 months I would think it would be gone if it was \"just\" a bruise. How old are you? Or are you like over 30? lol Why I was asking is because I wondered if you have had any mammograms. Other questions I would think of is have you had this happen before? has it increased in size at all? is there a lump involved? do you have a family history of any breast problems? are you pre or post menopausal? Alot of places won't do mammograms if you are under 30. My daughter developed a lump in her breast she is age 23 and they told her they don't do them at 23 and I told them she has a breast lump, a doc's order AND I presently had breast cancer...they did it. So I would ask your doctor about a mammogram, if u are over 30 I would just call the office and tell them you want a mammogram. If you don't like or trust your doctor I would seek a new doctor. Alot of places too now have breast care clinics. It never hurts to get a second opinion. Its ur health and you have to stay on top of things Good luck and take care. Warmest regards, Linda",
      "MessageIndex": 1,
      "PostDate": "15/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/490420-spot-breast.html",
      "Title": "Spot on breast.."
    },
    {
      "AuthorID": "Linda49er",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Linda49er",
      "Content": "Hi, I was initially diagnosed with breast cancer May 30, 2006. It was a terrible year to say the least. I kind of blame myself tho cuz when I went for my mammogram on may 30th I was told I hadn't been in for 10 years. I couldn't believe it had been that long. I had been so adimant about getting them yearly til we moved to arizona. I guess life got so busy. What an excuse huh. I was diagnosed with infiltrating ductal/tubular cancer. My tumor was up to 3.5 cm. and my sentinel node biopsy showed 5 positive nodes out of 10. I was petrified. When I saw my oncologist the first day (I wouldn't want their job thats for sure) she told me I was a Stage 3 (3 positive would have been stage 2) and if I did nothing my 10 year survival rate was 30%. My husband and I were shocked and looked at each other (because of the way she worded it- all she initially said was my survival rate was 30%). After finishing her sentence (adding if you do nothing) she explained to us what my options were and how much each treatment would help. So basically if I had chemo/radiation/hormone replacement therapy) my 10 yr survival rate went up from 30% to 76%. Its not 100% but nothing is and 76 sure beat 30. Chemo wasn't bad but it was rough. All depends on what drugs they use on you. I received Adriamycin, Cytoxan and Taxol. Taxol was the worse on me but I knew I had to do it to live longer. No guarantees but I'm not ready to die. I then had 26 treatments of external beam radiation followed by 5 stronger doses they call booster treatments right on my mastectomy incision where the main tumor was found. Being a diabetic I was nervous about the radiation but it went well. I did get a burn on my neck to my chest the last week but it healed fine. They had me use aquaphor on my chest from day one after each treatment and when I was home as long as not within 2 hrs of my treatment. It really helped my skin alot and no problems as far as my diabetes went. Chemo affected my diabetes because they give you steroids with each treatment. So I just ended up on insulin because steroids shoot your blood sugars way high. My highest was in the 500s. Now I'm on the Arimidex 1mg a day for the next 5 years. I'm not sure what side-effects to blame to what. I have neuropathy in my hands and feet but my oncologist said that should go away in six months. But my diabetes will keep some of it but it is better. I've had hip pain with pain radiation down my right leg to my knee. My oncologist didn't think that was related to my arimidex because I have ruined my lumbar spine related to my job for 38 years. She said usually arimidex bone pain will be in your hands or feet so i'm not sure. It too is better tho because of physical therapy i've been getting. My personal opinion is I would do it again even tho parts were rough. I'm not ready to leave this world yet, haven't met all my goals in life Sorry didn't mean to rattle on. Linda",
      "MessageIndex": 14,
      "PostDate": "14/04/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/474721-radiation-after-breast-cancer-lumpectomy.html",
      "Title": "Radiation after breast cancer lumpectomy? 1 2"
    }
  ]
}