{
  "AuthorID": "Lithiate",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Lithiate",
  "Posts": [{
    "AuthorID": "Lithiate",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Lithiate",
    "Content": "A lump in your neck can mean a few things, but the most common reasons are either: 1) A swollen lymph node or tonsil due to some kind of infection your body is fighting off (you don't necessarily have to feel sick for your lymph nodes to swell) 2) It's a swollen thyroid, aka \"goiter\". Most doctors refer to a thyroid that is even puffy as a \"goiter\", so it doesn't have to be a huge 'ol knot in your neck like you see in the extreme cases. If it is your thyroid (and yes, one side can swell while the other side remains normal) it typically means that you have either Hashimoto's Thyroiditis or Graves Disease. Hashi's is where your thyroid function fluctuates between low and high due to the presence of antibodies. Graves is also caused by antibodies, but it's usually marked by your thyroid *over* functioning. In both cases, your thyroid will ultimately burn itself out and you'll become hypothyroid, although this process can take years. Both diseases are not dire, but you should be checked out soon because the sooner you're on medication, the better you will feel. I have Hashi's and it's a pretty common illness among women. The entire maternal side of my family has hypothyroidism, but they think that they caught it early in me, which is why I was diagnosed with Hashi's, not hypo. The theory is that the women in my family probably had undiagnosed Hashi's for years before their thyroid quit working and they were dx'd with hypothyroidism. Anyway, that's just my $0.02. You should definitely get it checked out, but don't automatically assume that it's something like cancer before seeing your doctor. And I don't think this is related to mastitis, but I could be wrong... A lot of diseases and disorders are related to hypothyroidism in one way or another (PCOS, endometriosis, ovarian cysts, chronic fatigue and fibromyalgia are all tied into low thyroid function). Good luck!",
    "MessageIndex": 1,
    "PostDate": "09/08/2003",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25005-mastitis-lump-neck.html",
    "Title": "mastitis and lump in neck"
  }]
}