{
  "AuthorID": "luvmybabies2",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/luvmybabies2",
  "Posts": [
    {
      "AuthorID": "luvmybabies2",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/luvmybabies2",
      "Content": "Can someone tell me what this means? --- Heterogeneously Dense Fibroglandular Tissue, with prominent left axillary lymph node? I just got the results of my last week's mammogram and my doctor called me at home and said I had to come in right away. But I read the paper results and it's in BI-RADS 2 = Benign Findings. So why is my doctor so urgently concerned when Bi-rads 2 = Benign findings?? I am 36 years old and this is my first ever mammogram. My left breast has been bothing me off and on for a year or so now. Can someone please tell me what Heterogeneously Dense Fibroglandular Tissue with prominent left axillary lymph node means? Thank you so much, God Bless.",
      "MessageIndex": 0,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/594367-mammogram-results-heterogeneously-dense-fibroglandular-tissue.html",
      "Title": "Mammogram Results: Heterogeneously Dense Fibroglandular Tissue"
    },
    {
      "AuthorID": "luvmybabies2",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/luvmybabies2",
      "Content": "Thank you so much for your reply. I went and got a second opinion for that and another item that my doctor was going to surgically remove, and found out that my mammogram was normal and the lymph node is swollen, probably due to cold or small infection, So I am going to be just fine. Thank you so much for replying. Quote: Originally Posted by ellemae11 Heterogeneously Dense Fibroglandular Tissue is normal for someone your age. I would think the doctor wants to check further on the lymph node. prominent left axillary lymph node means the lymph node looks different meaning it could be enlarged or show up more dense on the mammogram. This could mean a serious problem or a simple infection.",
      "MessageIndex": 2,
      "PostDate": "10/04/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/594367-mammogram-results-heterogeneously-dense-fibroglandular-tissue.html",
      "Title": "Mammogram Results: Heterogeneously Dense Fibroglandular Tissue"
    }
  ]
}