{
  "AuthorID": "ManxMags",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ManxMags",
  "Posts": [
    {
      "AuthorID": "ManxMags",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ManxMags",
      "Content": "Hi I googled 'armpit lump and painful arm' and found this post - I'm interested in what the outcome was, as I am currently having a similar problem. I also have a close family history of breast cancer. I regularly have painful lumps under my arms particularly around my periods - but this is different. Its nowhere near my period and it actually caused an inflamed area around the lump for about a week. Now that's gone down the lump is still under there and very painful to touch - I'm also having a lot of pain in my arm, noticeable when I lift things - not usually an area I have pain. I think I'm going to see the doctor tomorrow about it, just hoping not to be fobbed off if it could be something serious. Many thanks Mag X",
      "MessageIndex": 2,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/846135-right-armpit-lump-right-arm-pain.html",
      "Title": "Right armpit lump + right arm pain"
    },
    {
      "AuthorID": "ManxMags",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ManxMags",
      "Content": "thanks so much for your support: I managed to get in at the doctors and he looked at it and confirmed that it's an infection in my lymph node, which would block some of the nerves running thro my arm, hence it being painful. As it's on it's way down, he hasn't given me antibiotics because it seems to be healing itself - it's a few days after and the swelling in my pit has gone down and my arm is less painful. So job done for now - it's interesting to know these boards are here tho - I will keep my sign in and look in here for help in the future. Many thanks again for caring X",
      "MessageIndex": 4,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/846135-right-armpit-lump-right-arm-pain.html",
      "Title": "Right armpit lump + right arm pain"
    }
  ]
}