{
  "AuthorID": "maple3",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/maple3",
  "Posts": [
    {
      "AuthorID": "maple3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/maple3",
      "Content": "Many thanks for taking the time and writing such a detailed response. I will advise her on that subject. I'm glad that you are able to take an active part in your own treatment and feel comfortable enough with your own doctor to question her/him. I wish you good luck and a few miracles here and there couldn't hurt!!",
      "MessageIndex": 3,
      "PostDate": "21/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/554900-lumpectomy-radiation-question.html",
      "Title": "Lumpectomy, radiation question"
    },
    {
      "AuthorID": "maple3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/maple3",
      "Content": "Someone close to me was dx with breast cancer, stage one. The rec. treatment was lumpectomy and radiation. Fine....but they only did ten radiation treatments and they said it was something new....two treatments each day. She was finished in one week. Does this sound familiar to anyone?",
      "MessageIndex": 0,
      "PostDate": "21/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/554900-lumpectomy-radiation-question.html",
      "Title": "Lumpectomy, radiation question"
    },
    {
      "AuthorID": "maple3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/maple3",
      "Content": "Quote: Originally Posted by reachout Hi Maple I appreciate the thanks. Sharing is my own thanks for having survived the whole cancer ordeal. Sometimes I have to share ugly things about my own cancer experience, and sometimes I get to share little details like this. Whatever I share, it is a bit of a way for me to give back what I was given in my own time of need. Maybe you would share one more thing with your friend for me? Please let her know that I understand that for this time in her life, she is defined a great deal by her cancer. That is a sad truth, but a truth we must recognize because we need to in order to survive. However, I want her to know that this changes in time. In time, we are once again defined by who we are as a whole human being. Oh, the cancer will always be a partr of the definition of us to some degree, but more pleasants aspects of our essence come back with strength again. Will you share that with her? Thank you reachout",
      "MessageIndex": 5,
      "PostDate": "24/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/554900-lumpectomy-radiation-question.html",
      "Title": "Lumpectomy, radiation question"
    },
    {
      "AuthorID": "maple3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/maple3",
      "Content": "You have put the procedure into words exactly as it happened. I found an article online that seems to indicate that this is a procedure done during a clinical trial. Since this breast cancer is at a Stage 1 I don't see the need the need for a trial. I don't have a date on the article. I hope it's not part of a trial.....it seems to me, one goes into a trial when everything else fails. I'm not telling her about this because the internet doesn't always get things right.....and it could have been an old article. Many thanks again.",
      "MessageIndex": 7,
      "PostDate": "25/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/554900-lumpectomy-radiation-question.html",
      "Title": "Lumpectomy, radiation question"
    }
  ]
}