{
  "AuthorID": "marsv63",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/marsv63",
  "Posts": [{
    "AuthorID": "marsv63",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/marsv63",
    "Content": "Hello, I have had breast lumps and have had them removed, No cancer. Also have a mammogram once a year I am 38 no family member has ever had breast cancer but my GYN, feels the at 35 this should be done.Here is info on breast cancer hope this helps. Symptoms and DiagnosisPrint section Three-quarters of all breast cancer patients seem to have no factors that place them at increased risk for breast cancer, indicating that not all risk factors are understood. As a result, doctors recommend that every woman should have an annual breast examination performed by a health professional, and she should perform a breast self-examination monthly. A woman who finds a lump in her breast should report it to her doctor immediately. However, a lump in the breast is no sure sign of cancer. Every breast is lumpy to some degree and the lumpiness becomes more pronounced shortly before menstruation as breasts naturally enlarge. Furthermore, several disorders of the breast produce growths that may be mistaken for carcinomas. Such noncancerous growths include cysts, which are fluid-filled sacs, and fibroadenomas, which are thickenings of the breast tissues that produce milk. X-ray examination of the breasts, a technique called mammography, can increase the odds for successful treatment by detecting tumors in an early stage, before they are large enough to be felt. Although studies provide conflicting results about the effectiveness of mammography in reducing breast cancer deaths, the ACS recommends that women over age 40 should have a mammogram every year. A mammogram cannot distinguish a benign tumor from a malignant tumor. The only way to make a positive diagnosis on a suspect lump in the breast is by having a biopsy, a minor surgical procedure in which the lump or part of the lump is removed and examined under a microscope for cancer cells. If cancer is found in the breast, doctors try to determine if malignant cells have metastasized beyond the breast and surrounding tissues, which may lead to serious, often fatal, complications. The most common sites of metastasis in breast cancer patients are the lymph nodes located in the armpit. The presence or absence of cancer cells in the lymph nodes helps physicians determine how far the cancer has advanced. Doctors usually remove several underarm lymph nodes to determine if they are cancerous. This surgical procedure may produce lymphedema, a painful swelling of the arm due to fluid accumulation, and it may place a woman at increased risk for infection. In a new procedure called sentinel-node biopsy, doctors use a less-invasive method to identify and remove a sentinel node, a single lymph node to which cancer cells from the breast travel first. If the sentinel node does not contain cancer cells, the cancer has not spread beyond the breast and the woman is saved more extensive surgery God Bless,Mars",
    "MessageIndex": 3,
    "PostDate": "23/07/2002",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24703-symtpoms-breast-cancer.html",
    "Title": "symtpoms of breast cancer"
  }]
}