{
  "AuthorID": "Maryw71",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Maryw71",
  "Posts": [{
    "AuthorID": "Maryw71",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Maryw71",
    "Content": "Hi, I'm newly diagnosed and waiting for appointment with pain clinic. In the meantime, ive have an issue with my breast. My chest on one side has dropped and the breast is all swollen. I had implants some years ago and because of the pcp scare, ive had a mammogram back in Feb due to swelling on my breast but this showed nothing. I get rashes all over my body which i know is my lymphnodes constantly fighting infection. However over the last two months, the skin on the enlarged breast has become mottled, bruised and is burning hot. As well as waiting for an appointment for the pain clinic, I've been referred back to the hospital that performed my breast surgery (ive been waiting since August). But I'm really worried as my symptoms are similar to inflammatory breast cancer. Ive tried to speak to my gp but she's signed off with stress and no one is doing anything. I went back to my surgery and they've said they will try and get my local hospital to have a look but cant promise anything. I am so scared. Ive not been given any infirmation about fibromyalgia apart from being told my pain clinic appointment is pending. Now this breast issue. Is there any connection between breast cancers and fibromyalgia? Am very low as im nit getting any support or any answers. Inflammatory breast cancer is different to nirmsl breast cancer as it is not lump based. My breast looks very similar to the pics online. Any advice or information anyone can provide would be appreciated. Thank you",
    "MessageIndex": 0,
    "PostDate": "21/10/2014",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/991539-just-been-diagnosed-but-got-rash-one-breast-worried.html",
    "Title": "Just been diagnosed but got rash on one breast and worried"
  }]
}