{
  "AuthorID": "Marykate",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Marykate",
  "Posts": [
    {
      "AuthorID": "Marykate",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Marykate",
      "Content": "Whatever you do, please don't rush this decision! The first and best line of defense when treating breast cancer is the surgical component. That's not to say the follow-up treatment isn't important. It is. But keep in mind that post-biopsy/post-lumpectomy treatment recommendations are based on a number of factors, including but not limited to nodal status, ER/PR status, tumor size and tumor grade, S-phase fraction, HER-2/NEU findings, to name just a few. Lumpectomy vs. mastectomy is not nearly as controversial as it once was. In most cases, long-term survival is not markedly increased with mastectomy. There are exceptions, of course, but from your brief description, it doesn't sound like your case would qualify as one of those exceptions. Ask your treating physician for a copy of your pathology/cytology report. Have your physician explain everything contained in that report. Ask questions; take notes; ask more questions. Then do your own research. Get on the internet. Go to the reference section at the library. Email/call advocacy and support groups. Find survivors. Pick their brains. Ask more questions; take more notes. Talk to anyone who'll talk back. Knowledge is power. It's impossible to make an intelligent, informed decision if you're uninformed. If this sounds like an enormous undertaking, consider this: It's your life and your body you're talking about. It matters! Lastly, I know this much is true . . . people who've \"been there\" are the first ones to offer help to others in need, and the people on this board are no exception. If you'd like, post your pathology findings. With a little more information, the veterans around here might just be able to shed more light on \"options\" available to you. I wish you the best. Marykate",
      "MessageIndex": 4,
      "PostDate": "09/08/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24714-lumpectomy-vs-mastectomy.html",
      "Title": "lumpectomy vs. mastectomy?"
    },
    {
      "AuthorID": "Marykate",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Marykate",
      "Content": "Looking for anyone with information on sentinel lymph node biopsy. Interested to learn what led you to choose this procedure and your feelings about the procedure when it was over. Also interested to learn accuracy of your results. Thanks in advance. Marykate",
      "MessageIndex": 0,
      "PostDate": "28/05/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24664-sentinel-node-biopsy.html",
      "Title": "Sentinel node biopsy"
    }
  ]
}