{
  "AuthorID": "Merimac",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Merimac",
  "Posts": [
    {
      "AuthorID": "Merimac",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Merimac",
      "Content": "Quote: Originally Posted by stiff person Hi I felt a lump in my breast about a year ago...I was 34, and didnt think much of it...I didnt even really consider it a \"lump\" so to speak. I have very large breast and they are lumpy every day...this was a small pea size something or another, It was hard, noticable but it was small and not painful at all...so it was easy to ignore. Later on I couldnt find it??? Would a real lump go away or always be there? I went to my next GYNO exam, let the doctor do his regular breast exam and he felt nothing so I let it go at that. With October being Awareness month...I saw adds and shows left and right that prompted me to get serious about what I felt all that time ago...I had my next Gyno exam (this would be about a year later) I told the doctor that I thought I felt something one time, but later it was gone...he again did his exam, felt nothing, and told me to have a mamo just to be safe??? (because I am getting Older) I am going to have my first Mamogram, in two weeks (I have rescheduled it Twice) and now I am so scared that this may be breast cancer. I feel that I may have actually ignored something important. How long is too long to have a lump go from, curable, to incurable? Is a lump always a lump? does it grow? do they dissapear? How fast does it spead or grow? I hope I am worried over nothing... Go get the mammogram. Also don't do any second guessing about whether or not it ever was \"anything\". The body has enormous self healing powers even if the \"something\" was there before. If you keep yourself otherwise healthy, AND get checked out, you have nothing to feel bad about and will be able to face anything that does come.",
      "MessageIndex": 3,
      "PostDate": "02/11/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/442825-ignored-lump.html",
      "Title": "Ignored Lump"
    },
    {
      "AuthorID": "Merimac",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Merimac",
      "Content": "Cysts do not turn into cancer. Some times cancer is diagnosed as merely a cyst and then is discovered to be cancer later. The important thing about cysts are that if you are some one who gets cysts easily, then you need to be checked more often for breast cancer because your body responds to irritations more readily. But, cysts are generally water and irritated tissues and the body forms a protective shield between the irritation and the rest of the body. Some times cysts become very painful. But it takes a professional to determine what a cyst is and compare it to a cancerous lump. Not all cancer forms in to lumps and I specifically have a friend who has breast cancer and had no idea she had it because there were no outward signs at all and it was discovered on a routine mammogram. Check your concerns with your doctor.",
      "MessageIndex": 1,
      "PostDate": "06/01/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/354649-do-cysts-turn-into-breast-cancer.html",
      "Title": "Do Cysts turn into breast cancer?"
    },
    {
      "AuthorID": "Merimac",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Merimac",
      "Content": "The risks of breast cancer are greater in first degree relatives such as mother or sister. The research is showing that father's side of family can carry the gene that effects breast cancer in families. But, remember, that cancer can be detected in people whose families do not have any specific history of breast cancer. There is a measurable trend for breast cancer in families with history of colon cancer, ovarian cancer, and lung cancer. The statistics are not reliable because human beings contribute a lot to their own health or lack of it. The other problem with statistics is that they are usually gathered in order to produce data for funding purposes. So, if they are trying to get funding for research the data for people dying from breast cancer may be biased in order to get more money. Same thing if the data is trying to show success rates for treatment. The digital mamogram is simply a new technique from the computer age, just like the digital camera at home. In medical studies it does enhance diagnostic abilities in dense breast tissue, followed by sonogram for verification. Nothing is different about the exam that a person experiences except that the better the images are the less pulling and tugging has to be done. That is a relief in itself.",
      "MessageIndex": 1,
      "PostDate": "09/10/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/330085-paternal-grandmother-concern.html",
      "Title": "is paternal grandmother a concern?"
    }
  ]
}