{
  "AuthorID": "millieb",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/millieb",
  "Posts": [
    {
      "AuthorID": "millieb",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/millieb",
      "Content": "Hi Bev, Well I am not as emotional. I had lost my job and found out I am eligible for COBRA...I have been told by several that don't let your COBRA drop no matter what. So, I am going to come up with the payments some how and I just enrolled so they said it could be a couple of weeks. I have the prescription for my compression for the breast so when COBRA kicks in I will have it done. Thank you for your concern. I feel like I have a couple of friends. Thank you.",
      "MessageIndex": 4,
      "PostDate": "30/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/177997-tiny-nodular-density-mammogram.html",
      "Title": "A tiny nodular density..on mammogram?"
    },
    {
      "AuthorID": "millieb",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/millieb",
      "Content": "Hi, The doctor called me and I was expecting the same old line from the mammogram results...everythings normal. Not this time. I sat there dumb founded. I had to ask her to repeat what she just said. I got emotional. Then I went to his office and got a copy of the mammogram report that says: Today's examination demonstrates a tiny nodular density seen in the subareolar region of the left breast of questionable significance. This area does appear different than on the prior mammogram, however, and further assessment with spot compression views is indicated. No changes in the right breast. END Questions that I need to clarify on.... 1. Tiny nodular density - is that a lump...I can't feel it. 2. The last mammogram was (I am bad) five years ago. With it being so long can that be the reason that it has changed from the last mammogram? 3. Found out I lost my insurance....any suggestions. I emailed the Breast Cancer network. Never got any reply back...but I read that they help abused and low income. What if you are neither...I am not high income either. Does this mean I have to ignore the situation...you and I both know that no insurance...no medical attention. Any suggestions? I guess that is enough questions. Kinda (bull...I am a lot) scared. Just another not. My mom had to have her left breast removed due to breast cancer. Doesn't help my emotional state. Any replies or words of encouragement...would really be appreciated.",
      "MessageIndex": 0,
      "PostDate": "29/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/177997-tiny-nodular-density-mammogram.html",
      "Title": "A tiny nodular density..on mammogram?"
    },
    {
      "AuthorID": "millieb",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/millieb",
      "Content": "Hi Gemini, I have found out since that I am eligible for COBRA. It is like 289 a month...but consider how much this may end costing...I am going to get the money up. I can't do anything until I get an invoice from COBRA and pay them...I was willing to wire them the money the day I had enrolled. But they said that is not the way it is done. Thank you so much for reply. I really like this site. You get a lot of information. I will definitely follow up on this. Thank you.",
      "MessageIndex": 3,
      "PostDate": "30/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/177997-tiny-nodular-density-mammogram.html",
      "Title": "A tiny nodular density..on mammogram?"
    }
  ]
}