{
  "AuthorID": "mindyp",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/mindyp",
  "Posts": [
    {
      "AuthorID": "mindyp",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/mindyp",
      "Content": "Hi nellie99--Are you a teacher too? My students just came back on Monday. I teach 8th grade science. I'd ask the surgeon about doing some diagnostic tests first-- like and ultrasound, mammogram, and cbc--especially since you haven't had them yet. My doctor told me there are a lot of things that can cause swollen lymph nodes in that area, from breast cancer, to infection, to a reaction from shaving. I'll see my gynocologist again next month to check up on the nodes. Keep me posted on what the surgeon has to say. I'll keep you in my thoughts.",
      "MessageIndex": 3,
      "PostDate": "19/08/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/626977-questions-about-swollen-node.html",
      "Title": "Questions about swollen node"
    },
    {
      "AuthorID": "mindyp",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/mindyp",
      "Content": "Hi there. I am in the same boat as you. I have a set of swollen lymph nodes in my left armpit above my breast. My gyn sent me for a diagnostic mammagram and ultrasound. The report I got from the facility said there was a finding that was probably not significant and I needed to return in 6 months for repeat exams. Do you have other swollen lymph nodes, or any other symptoms of lymphoma? It seems a little hasty to go straight to the surgeon without any other tests first. I may end up at the surgeon too, but they've recommended some watchful waiting first. By the way I am 33, so this was my first mammogram. I wish you the best.",
      "MessageIndex": 1,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/626977-questions-about-swollen-node.html",
      "Title": "Questions about swollen node"
    },
    {
      "AuthorID": "mindyp",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/mindyp",
      "Content": "Hi. I'm glad your surgeon wasn't too quick to cut and is willing to look at the mammogram and monitor it for awhile. This is basically what my doctor is doing. I see him again at the end of September. As far as the mammogram goes, my doctor's office called within 2 or 3 days. Also by law, the facility has to send you a general letter about normal or abnormal findings within seven business days. It's interesting that you noted additional lymph nodes swelling. I had one pop up lower in my armpit today that I had not felt before. However, I have a raging UTI, so maybe the two are related. Keep me posted, and I will try to check in every day or two. I'm wishing you the best. Mindy",
      "MessageIndex": 5,
      "PostDate": "24/08/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/626977-questions-about-swollen-node.html",
      "Title": "Questions about swollen node"
    },
    {
      "AuthorID": "mindyp",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/mindyp",
      "Content": "Hopefully, you'll get your report soon. I'm glad nothing appeared suspicious. I am a caffeine junkie too--must have something to with our profession. Let me know what they decide to do. My next followup with my doctor is 9/30.",
      "MessageIndex": 7,
      "PostDate": "07/09/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/626977-questions-about-swollen-node.html",
      "Title": "Questions about swollen node"
    }
  ]
}