{
  "AuthorID": "missyb57",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/missyb57",
  "Posts": [
    {
      "AuthorID": "missyb57",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/missyb57",
      "Content": "Glad to hear it wasnt painful. The 2 biopsies I had on my left and right thyroid were painful. Got the date for my biopsy Sept 6th",
      "MessageIndex": 4,
      "PostDate": "17/08/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/864517-category-4-mammo-us-results.html",
      "Title": "Category 4 mammo US results"
    },
    {
      "AuthorID": "missyb57",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/missyb57",
      "Content": "Well the odd thing is it didnt show up on the mammogram just on the ultrasound. Yep I am hoping that maybe just that can be drained or removed. Thank you for your reply.",
      "MessageIndex": 2,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/864517-category-4-mammo-us-results.html",
      "Title": "Category 4 mammo US results"
    },
    {
      "AuthorID": "missyb57",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/missyb57",
      "Content": "I had my biopsy done Sept 12 and it was AWFUL painful! The dr didnt numb the skin or anything just stuck the needle in and starting injecting the numbing stuff. The he made a slit and put in what I called a vacuum sucker. He sucked a lot of stuff out and it hurt so bad. They put a steri strip on it. The next day my whole breast was black. It has been 3 weeks and the bruising just left. I got 2 different path reports so I am now more confused than ever. The first report was this: Sections show portions of breast tissue with fibrocystic disease including fibrosis and scattered cysts. Several foci suggestive of ADH are present. No invasive tumor is seen. A background of pseudoangiomatous stromal hyperplasia is present. The surgeon had me wean off of my Premarin and start taking Tamoxifen. So then they sent it to another lab and they sent it to another lab and this is the last pathology report: Sections of breast tissue with focal cookie cutter ductal hyperplasia and focal expansion of terminal ductiles. In addition there is stromal hyalinization and slit like spaces. There is no evidence of infiltratrive malignancy Diagnosis: Gynecomastoid like ductal hyperplasia with associated pseudoangiomatous hyperplasia I dont know if they are 1 in the same thing or if they are 2 diagnosis. My anxiety disorder is on overdrive. I dont go back to the surgeon for a couple weeks. Does anyone else ever have this diagnosis and if so, what is it and how is it treated? Thank ya'll so much",
      "MessageIndex": 5,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/864517-category-4-mammo-us-results.html",
      "Title": "Category 4 mammo US results"
    },
    {
      "AuthorID": "missyb57",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/missyb57",
      "Content": "I have had what my gyn said was Fibrocystic breasts for at least 10 years. For the last year I kept going to him telling him that my left breast hurt so bad I could cut it off myself. He said just the FCD. I have a mammogram every year and a couple times I have had to have US on the right breast because of the cysts, but never the left one which is the hurting one. So I went to a differetn gyn, a woman and she sent me for another mammogram and US on my left breast. Here are my results There is a 2.5 cm focus of asymmetric breast tissue with heterogeneous echogenicity and some shadowing. There is otherwise homogenous visualized breast parenchyma with no cystic or solid mass lesion identienfie Impression Asymmetric breast tissue at teh 6 o clock position left breast with some shadowing. Although this could be related to infectious or inflammatory etiology neoplasia cannot be excluded. Recommend and appropriate course of antibiotics follwed by ultrasound guided breast biopsy Mammogram Code 4 Suspicious abnormality My gyn put me on Duricef twice a day for 10 days and then wants the biopsy 2 weeks after this. I have to say that so far no relief from the pain. I am very nervous and anxious about this. I had 2 aunts with breast cancer. Anyone else have this finding and if so did it turn out benign, I hope??? Thanks",
      "MessageIndex": 0,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/864517-category-4-mammo-us-results.html",
      "Title": "Category 4 mammo US results"
    },
    {
      "AuthorID": "missyb57",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/missyb57",
      "Content": "Quote: Originally Posted by janewhite1 They are both saying approximately the same thing. You have some benign growths, and you have very dense breasts. For now you are ok: \"No evidence of infiltrative malignancy.\" They will keep a close eye on your breasts in the future, though. Oh Thank You so much. Do you think that the pain will eventually ease up?? Or is it just 1 of those things we learn to live with",
      "MessageIndex": 7,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/864517-category-4-mammo-us-results.html",
      "Title": "Category 4 mammo US results"
    }
  ]
}