{
  "AuthorID": "Momsahero",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Momsahero",
  "Posts": [
    {
      "AuthorID": "Momsahero",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Momsahero",
      "Content": "Ok update time. Got my mammo results back and of course they were normal but with a side note to follow up on my \"area of concern\". After putting it off for far too long I made an appointment with my GP to try and get a referral. Appontment was today and he validated my concerns and wants me to see a breast specialist immediately for a bio. He would not tell me his suspicions but could clearly feel the thickening differences and did say we need to know ASAP. .",
      "MessageIndex": 12,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/966698-new-site-worried.html",
      "Title": "New to site and worried. 1 2"
    },
    {
      "AuthorID": "Momsahero",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Momsahero",
      "Content": "New here and very concerned. Scheduled to have diagnostic mammo on 8th. Noticed a bruise like red patch on my right breast (been about 5 weeks) and the skin seems to be slightly thicker. No change in size or color but have been experiencing a burning sensation off and on for last week. Now I've just noticed another \"bruise\" (for lack of better word) near my areola (same breast) and becoming almost neurotic over this. Breast cancer does run in the family (mother). Should I push up this appointment?? I'm hoping for the best but preparing for the worst!",
      "MessageIndex": 0,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/966698-new-site-worried.html",
      "Title": "New to site and worried. 1 2"
    },
    {
      "AuthorID": "Momsahero",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Momsahero",
      "Content": "Unfortunately I have discovered the worst thing you can do is search the web for your symptoms. Almost everything came back IBC",
      "MessageIndex": 2,
      "PostDate": "30/10/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/966698-new-site-worried.html",
      "Title": "New to site and worried. 1 2"
    },
    {
      "AuthorID": "Momsahero",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Momsahero",
      "Content": "Ugh. The burning sensation is becoming more frequent getting more intense and has started radiating to my right shoulder and arm. Also my right nipple is now slightly lower than my left one. No change in size of first red patch but the smaller one has grown a little. Friday can't come fast enough!!",
      "MessageIndex": 5,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/966698-new-site-worried.html",
      "Title": "New to site and worried. 1 2"
    },
    {
      "AuthorID": "Momsahero",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Momsahero",
      "Content": "I originally couldn't get in with my family doctor so I got an appointment with the physicians assistant and that is who ordered the diagnostic mammogram because he was stumped. Called the doctors office to get an appointment when the results came in and I was told no news was good news and if they would have found something that warranted concern they would have called me. My main concern is IBC. From everything I have found researching it, it rarely shows on mammograms or ultrasound and the only way to diagnose it or to rule it out is a biopsy.",
      "MessageIndex": 9,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/966698-new-site-worried.html",
      "Title": "New to site and worried. 1 2"
    },
    {
      "AuthorID": "Momsahero",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Momsahero",
      "Content": "Had the mammogram and ultrasound done Friday. Bruise like marks are still prominent with pain and slight peau de' orange texture. No biopsy done or ordered. Have not heard anything. Called Dr. office to find out if results were in and they told me no news was good news.",
      "MessageIndex": 7,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/966698-new-site-worried.html",
      "Title": "New to site and worried. 1 2"
    }
  ]
}