{
  "AuthorID": "moondrop",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/moondrop",
  "Posts": [{
    "AuthorID": "moondrop",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/moondrop",
    "Content": "Quote: Originally Posted by Atid Trying to decide, after having surgery for a stage 1 tumor, 1.1 cm, clear nodes--whether or not to do radiation: partial breast or whole breast--or nothing. No chemo is planned. I am already on hormone therapy--Arimidex. My various doctors all urge radiation since it would help prevent recurrence in that breast. But radiation does not increase survival rate. I'm worried about the side effects of radiation--lung scarring, fragile ribs, who knows what else. All my naturapath friends say no to radiation, of course. All my mainstream friends assume a yes. I seem to be trapped in the middle ground. Anybody out there who can help or who has gone through this? Would really appreciate hearing from another agonizer about this decision. (Also, has anyone had experiencw with a prone breast board? that's one in which the patient lies face down, breasts going through some cut-outs, thus reducing the amount of radiation to internal organs, etc.) Atid Who told you radiation doesn't improve your survival rate? If that were true, why would they give it to us? I have infiltrating duct cancer and was told they will do a lumpectomy next week followed by 6 weeks of radiation. The radiation is needed to kill any potential remaining cancer in the breast. It would be dangerous not to do it. Otherwise I should be getting a mastectomy instead. I have chosen the radiation and lumpectomy. Besides, the radiation also helps to avoid recurrance. I suggest you talk with the doctors about this in more detail.",
    "MessageIndex": 4,
    "PostDate": "21/03/2007",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/474721-radiation-after-breast-cancer-lumpectomy.html",
    "Title": "Radiation after breast cancer lumpectomy? 1 2"
  }]
}