{
  "AuthorID": "myloathe",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/myloathe",
  "Posts": [
    {
      "AuthorID": "myloathe",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/myloathe",
      "Content": "OK. Here's my story. I had a baby 5 months ago at the age of 30. I have been breastfeeding her ever since. As of late, I had been feeling a lump on the upper, right portion of my right breast. Well, I finally went to go find out about that lump. I had an ultrasound on both breasts on Wednesday. The lump, on my upper right breast that I thought was something turned out to be nothing, but the doctor found another lump that I didn't even know about! I'm so scared. This lump is about at the 4 o'clock position. You can't even feel it from the outside. The doctor swore that she thinks it's just a benign nodule (or fibroid), but I am paranoid. She even said that it isn't a rush for a biopsy, and wanted to wait 7 months until I stopped breastfeeding. I asked her if she was crazy, there's no way I'm waiting that long. She's on vacation next week and they have me scheduled for this biopsy on the 15th. Once I got home and thought about it, I became really panicky about even waiting the 2 weeks. I came home and called my ob-gyn so she could find me someone else to do it, but she had already spoken to the doc that did the ultrasound and both agreed, there was no rush, just to wait the 2 weeks. Does this sound right to you guys?? I mean, if she's absolutely sure that it's a fibroid, why would I need the biopsy? I think it's really something bad and they are just trying to spare me getting upset? Has anyone been told by a doc that they were fairly certain that their lump was a fibroid and it turned out to be cancerous? I did have 7 uterine fibroids that caused me a heck of a lot of trouble during my pregnancy and fibroids do run in my family. But I also had a 2nd cousin die from breast cancer at the age of 33. Anyone know someone who's been thru this?",
      "MessageIndex": 0,
      "PostDate": "03/11/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/443447-question-about-supposed-fibroid-breast.html",
      "Title": "Question about a supposed fibroid in breast?"
    },
    {
      "AuthorID": "myloathe",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/myloathe",
      "Content": "Anyone?????",
      "MessageIndex": 1,
      "PostDate": "06/11/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/443447-question-about-supposed-fibroid-breast.html",
      "Title": "Question about a supposed fibroid in breast?"
    },
    {
      "AuthorID": "myloathe",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/myloathe",
      "Content": "Quote: Originally Posted by anna317 I have been waiting for my bipsy for 6 weeks! What's their excuse for making you wait so long??? That's ridiculous!",
      "MessageIndex": 4,
      "PostDate": "06/11/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/443447-question-about-supposed-fibroid-breast.html",
      "Title": "Question about a supposed fibroid in breast?"
    },
    {
      "AuthorID": "myloathe",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/myloathe",
      "Content": "Let me first say how sorry I am that you are going through this. I too am not an expert, and I know every situation is different, but let me share with you my family's recent bout with breast cancer. My 33 yr old cousin was diagnosed with breast cancer in June 2003. She got opinions: one that wanted to remove the breast, chemo, and radiation, and the other doc who opted for a lumpectomy with chemo and radiation. Her cancer had not spread to nodes and she didn't want to remove the breast so she opted for the lumpectomy. After the lumpectomy, weeks of chemo and radiation, she was told last spring 2004, she was told that the cancer was gone and she could start looking to get the breast reconstructed (u know, not the whole breast but that missing part). Anyway, just a few months later, in July 2004, we found out that she had cancer in her lungs, spine, and 80% of her liver! She passed away in October. Like I said earlier, I know every case is different, so your situation may not be this, but please, think about the masectomy. We spoke to 2 or 3 other specialists towards the end, and they all agreed that her breast should have been removed to prevent this from happening. My cousin, being young, single, and vibrant, opted against having her breast removed. I know it's easy to give advice when it's not you. Frankly, I'm 29 and I too would be conflicted if faced with this. But just remember, you can live without your breasts.",
      "MessageIndex": 3,
      "PostDate": "24/01/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/243630-mastectomy-really-necessary-what-do-you-think.html",
      "Title": "Is a mastectomy really necessary? What do you think?"
    }
  ]
}