{
  "AuthorID": "ncyky",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ncyky",
  "Posts": [
    {
      "AuthorID": "ncyky",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ncyky",
      "Content": "Well I had my biopsies and once again they were fibroadenomas. I must have about 8 of these suckers now, but I'm grateful that they are all benign. Please share your story. I know there are other women out there with fibrocystic breasts. Thanks!",
      "MessageIndex": 2,
      "PostDate": "21/11/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/445108-lots-fibroadenomas-my-story.html",
      "Title": "Lots Of Fibroadenomas - My Story"
    },
    {
      "AuthorID": "ncyky",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ncyky",
      "Content": "Hello Everyone! I haven't been diagnosed with breast cancer as of yet. I currently have no family history of breast cancer that I know of, but I believe that I am at a higher risk simply because I have struggled with Fibroadenomas (benign lumps) for the past 15 years. I just turned 34. My first lump was felt by myself when I was only 19. My mother made an appt for my first GYN visit and after some tests and actual removal of the lump..it was tested benign. 3 years later another lump felt by myself on the other breast...same tests and removal and again benign. A few years went by and a couple of cysts appeared and drained and again benign. I had my son at 28...2 years later after using birth control pills, I started developing these fibroadenomas again . First one appeared, then 2, then 3, then 4...I believe as a result of the birth control pills. I stopped taking them after 2 years. I now go to a breast center every 6 months to keep an eye on these fibroadenomas which I have about 8 of them now. Iv'e been doing this for the last 5 years. I have a mammagram once a year that shows nothing because my breast are very densed. They use ultrasound to look at the lumps and a couple of them have been biopsyied already. They are two small to be removed. My recent visit showed a new one and an old one that has gotten a bit bigger. The Radiologist believes that they are benign, but she has to make sure. So I'm scheduled for 2 biopsies next week for both breasts and I'm nervous as usual. Has anyone else been plagued with fibroadenomas?? What have been your experience? Thanks for reading my story!",
      "MessageIndex": 0,
      "PostDate": "09/11/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/445108-lots-fibroadenomas-my-story.html",
      "Title": "Lots Of Fibroadenomas - My Story"
    }
  ]
}