{
  "AuthorID": "nicholejasch",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/nicholejasch",
  "Posts": [
    {
      "AuthorID": "nicholejasch",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/nicholejasch",
      "Content": "Hi Shellie, Yes this place does offer some really great support. I just came across it recently as well. I really hope everything turns out ok for you. I had a lump in a very similar area I could feel it right behind my nipple, but I was able to move it around (left Breast) way back in Feb. the doctors did so many tests that came back with nothing they kept saying oh youre too young, I doubt it can be anything. Fianlly when I went back for my 3 month check up on it again it had grown and the ultrasound did pick up some abnormal things. They ended up sending me to a speicalist which also did the core biopsy which was in october of this year, so long spread in between right? And unfortuantly it came back as breast cancer im 25 years old, no history of breast cancer, and healthy as can be. This was a complete shock, but you know what, we learn to deal with it becasue thats all we can do. It could be worse and many, many woman have to go through this unfortunate disease in their lifes. In the long run it makes us stronger. No matter what the results are you will be ok, and god will watch over you because he doesnt give us anything we can't handle. Regardless it seems like its small enough where if it is anything then can just remove it on time. In my case this was on going for 8 months so my tumor grew and now its about 5 cm and it hit 2 lymph nodes that we know of. The earlier you catch it the better. Please keep me update my prayers are with you and stay strong. QUOTE=TaeBoMama;3337982]Hi everyone, I've been reading the posts and have a lot of respect for the ladies here. Your strength is amazing. I admire you all. My whole experience has really enlightened me as to how many women are affected by breast cancer--and how scary it is! In early November, I visited my GYN for my yearly exam and nothing was felt. However, on November 16th I accidentally discovered a lump behind my nipple. I went back to the GYN and she still could not feel the lump. That's because she did not check the nipple area! Why not?! After I showed her where it was, she felt it. She told me it was nothing to worry about, but ordered an ultrasound. The ultrasound showed an abnormal mass behind the nipple. I was then referred to a General Surgeon who recommended a Core Biopsy. He said he didn't recommend removal (unless it was cancerous) since the lump was in such a \"precarious\" location. I had the Biopsy on Dec. 4th and am waiting for the results. I'm posting here for a couple reasons: * Support from women who can relate is always helpful. * I also plan to update this thread once I receive the results (as this can help other women who may experience something similar). Thank you for reading! Shellie [/QUOTE]",
      "MessageIndex": 1,
      "PostDate": "05/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/558889-waiting-biopsy-results.html",
      "Title": "Waiting For Biopsy Results"
    },
    {
      "AuthorID": "nicholejasch",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/nicholejasch",
      "Content": "In my opinion they shouldnt say anything about it not being cancerous if there is a lump without doing a biopsy. I had a lump that I found back in Feb they did ultrasounds, mamo's, and a MRI and still couldnt find anything. They did notice it grew though within that few months. I went for a biopsy this october and it was breast cancer. I am 25 years old and no family history or anything like that before. So to answer your question I would get a biopsy if you noticed any change bc if I would gotten in done right away, I could have probably saved my lymph nodes from being infected. Dont worry too much though because it can be anything thats for sure. I hope all is well and good luck. Keep me posted! Quote: Originally Posted by marmar2007 I got a call today about my mammogram and ultrasound and they told me all were normal. However I still have the huge lump in my left breast and its quite painful. The report said it is a palpalble mass but it isnt a cyst and it is benign. I still have the appointment with breast specialist in Jan--and I definitely am keeping that appointment. But could they actually say it isnt a problem-meaning not cancerous without doing a biopsy??Any help would be great. thanks in advance! they said they compared it with my last mammogram and there has been no change in my breasts.But this lump is definitely a change??",
      "MessageIndex": 3,
      "PostDate": "17/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/561171-i-am-so-confused-any-ideas.html",
      "Title": "i am so confused!!Any ideas???"
    },
    {
      "AuthorID": "nicholejasch",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/nicholejasch",
      "Content": "Well thats GREAT NEWS and I am very happy for you. Good luck to you with everything! Quote: Originally Posted by TaeBoMama My biopsy results came back--non-Cancerous. I'm waiting to talk to the surgeon to see if he thinks it should be removed or not. I have a new awareness now about how many women are dealing with breast cancer--and how scary it must be. The strength they possess is amazing. God bless you all! Shellie",
      "MessageIndex": 3,
      "PostDate": "12/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/558889-waiting-biopsy-results.html",
      "Title": "Waiting For Biopsy Results"
    },
    {
      "AuthorID": "nicholejasch",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/nicholejasch",
      "Content": "Take my advice when I say the ultra sounds, mamograms, MRI's sometimes do not detect breast cancer. I am 25 years old and found a small lump as well back in feb. they did all those tests and still couldnt find anything. Finally this Oct they decided to biopsy it was come to find out it was breast cancer. Please just have them do a biopsy its the safest way to detect it. I was amazed that nothing else detected this. Hopefully its nothing, but always be 100% sure. Good luck to you!",
      "MessageIndex": 3,
      "PostDate": "30/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/553783-doing-breast-exam-today-found-small-lump.html",
      "Title": "Doing breast exam today and found a small lump!!"
    }
  ]
}