{
  "AuthorID": "nowatasue",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/nowatasue",
  "Posts": [{
    "AuthorID": "nowatasue",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/nowatasue",
    "Content": "I am 55 years old with fibrocystic breasts as a young woman. I breastfed two children. I ecently had quite a scare. Just wanted to share if my story might help someone else. Six months ago I had mammograms come back with clusters of microcalcfication at 12 oclock on the right breast. The doctor recommended waiting six months and having the breast reevaluated. Imaging revealed more very suspicious calcifications. I was scheduled for a needle biopsy which was touted as so much less invasive. I was so releaved to have an easier test available. A friend recommended that I request a valium to make the procedure less stressful. I took my precious valium after checking in for the procedure. I endured many breast compressions and waited for the surgeon and radiologist to decide where to stick the needle while I laid on the table with my breast hanging down thru the hole. To make a long story shorter, they couldnt do it. The surgeon recommended I come back ASAP for an open biopsy. It was after a holiday and I was unsuccessful in procuring another valium which was unfortunate. Prior to the surgery I had to have a wire placed to mark the spot for the surgeon. That did not go well. The breast did not get numb and the wire had to be yankedout and reinserted at a different angle. Very painful and distressing. I was feeling no confidence in the medical profession. I dont have high blood pressure or acid reflux but was having both by the time I was wheeled over to surgery my blood pressure was higher than it had ever been and I felt an acidic taste burbling up in the back of my throat. They gave me something for that and I started to relax with some much needed versid. I dont remember much after being guided onto the operating table which is as it should be. I woke uo with a two inch incision after a golf ball size tissue sample was removed. I nervously awaited results and received good news three days later. The clustered calcications were only clustered calcifications. I just want to salute everyone out there whoare undergoing so many procefures and the almost unbearable emotional stress that accompanies these procedures. I thought I was pretty tough but this one little foray into the medical grind has worn me to a frazzle. I am just so grateful that I had good test results on this occasion. My heart goes out to anyone who had to continue with more tests and procedures.",
    "MessageIndex": 0,
    "PostDate": "08/07/2011",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/858230-clustered-breast-microcalcifications.html",
    "Title": "Clustered breast microcalcifications"
  }]
}