{
  "AuthorID": "OhioMom65",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/OhioMom65",
  "Posts": [{
    "AuthorID": "OhioMom65",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/OhioMom65",
    "Content": "Hello....so.....a few months ago, I noticed this thing on the tip of my nipple -- I just assumed (and possibly still do) that was a skin tag, caused by our recent vacation, wearing wet bathing suits non-stop, friction, etc. I am 52, in perimenopause, and had (at the time) been dealing with very sensitive nipples that always seemed to be ...well, high-beams, if you know what I mean. So, it seemed like a natural assumption that this is a skin tag. And maybe it is. At one time, it did have that \"stalky\" kind of appearance. It has never bled, or oozed anything. It is not red or inflamed. There is no \"lump\" I feel, either in the nipple, or in the breast. I tried putting that \"tag-away\" stuff on it, with little success. I then tried putting tea-tree oil on it, again, with limited success. Meaning, it's still there, although \"smaller\". So then I read up on this thing called mollescum contagisum. And, yes, it kind of looks like that. It even appears to have the little indentation in the center. If that is what this is, it is caused by a strain of the \"pox\" (as in chicken, I think) virus. And these things usually clear up within 6-12 months, on their own. I don't see much instances of one on the nipple, though. When I google it, skin tags come up. However, I worry that it is breast cancer. I've gotten mammograms every year for the past 12 years, all good. I don't feel any underlying lump. I just went to my gyn yesterday for my yearly exam. And yes, she saw it. I didn't say anything to her about it, because, frankly, I was scared. I just figured, \"well, when she sees it, if it alarms her, she'll say something.\" These past 4 or 5 months have been the most stressful of my life. Anyway, as she was doing the breast exam, she noticed it, never said anything about it, but did peer down to take a closer look. But again, never said a word. She gave me my (expected) req for my next mammogram. She wrote, \"screening\" on it, as usual. Didn't specify that there was anything alarming, or anything to look for (ie, the nipple growth). I finally showed it to my husband last night. Don't ask me how I kept it a secret from him -- I just..kept the lights off. I figured, in all this time, if it was really noticable, he'd have said something, right? So...I show it to him last night, and he's like, \"Wow!\" I said, \"you're not making me feel any better!\" He said it looks to him like a friction injury (like an unbroken blister) that never got a chance to heal (again, like a skin tag). It is flesh colored, about 1/8\" in diameter not angry looking, just looks like....one of those mollesum contagisum things. I wish my gyn would have said, \"oh, you have a ________ there\". I wish I had had the guts, and not been so scared, and said, \"What do you think that is??\" I have my mammogram scheduled for two weeks from now. I guess then I'll know. But don't you think, if the gyn thought it was alarming, she would have said something to me? Or would have said, 'wow, you need a mammo right away!', or scheduled me for a diagnostic mammo? Instead, she just give me the mammo req for the screening mammo, just like the other 11 years, and says \"have a nice New Year's\". If these things (skin tags or whatever it is) are common, people sure don't talk about it! Any reassurance would be most helpful right now...I'm so tired of worrying. Thanks, Lisa",
    "MessageIndex": 0,
    "PostDate": "29/12/2017",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1039633-growth-tip-nipple.html",
    "Title": "Growth on tip of nipple"
  }]
}