{
  "AuthorID": "pa235",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/pa235",
  "Posts": [
    {
      "AuthorID": "pa235",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/pa235",
      "Content": "I know you have to have compression on your breast after the biopsy, how do they do that? how long does the compression last? I am one of those people who when hearing bad news their minds go, glad my husband was a long all I heard was biopsy and that is it.",
      "MessageIndex": 2,
      "PostDate": "30/06/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/954432-biopsy.html",
      "Title": "?? on biopsy"
    },
    {
      "AuthorID": "pa235",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/pa235",
      "Content": "I recently had a mammo done and calcium deposits were seen. I am seeing a breast specialist and am having a stereotatic biopsy done on Mon. Needless to say I am so afraid of the finding. The procedure was explained to me but reading on the net it says you must lay on your stomach for 1 hour. I was told to allow an hour for the procedure but the biopsy only takes a few minuets. I have fibromyalgia and I know I can't lay on my stomach that long without going into back spasms. If anyone had this biopsy done please let me know about your experience. The Dr. said he was not too concerned but wanted to make sure. I have fibrocystic breast disease and read this can cause the tiny calcium deposits but my mother had breast cancer at 82, and pre-cancer in the other breast at 83. I have 4 cousins who have had breast cancer all on my mothers side. I am 71 years old and about 20 years ago was calcium was found in the other breast, the mammo was magnified and nothing ever more was said about this. Thank you for your time, Linda",
      "MessageIndex": 0,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/954432-biopsy.html",
      "Title": "?? on biopsy"
    },
    {
      "AuthorID": "pa235",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/pa235",
      "Content": "Went for my biopsy, I was on the table the girl said I just can't get this breast in far enough to see this area on the x-ray. The Dr. came in and she told him, he said the area is on the x-ray where is the calcium, he checked me and found a mole at the exact spot said you don't need a biopsy, whoever did your mammo never marked this mole and it shows calicum which is normal but it is skin surface. They did a mammo of the breast and the girl marked the mole, the Dr. said that is the exact spot but they had the radiologist check to make sure, he agreed it is nothing but a error on the techs part. The Dr. I went to is calling the hospital and telling them they need a new tech as it seems this one does not know what she is doing and is causing patients to run to Drs. and having anxiety. The Dr. I went too did not order the 1 st mammo,I had it done at the local hospital. he just got the disc and read the report, since there was nothing to feel he said areas that show calcium needs to be biopsied to make sure nothing is starting. He apologized for what I went through but I was so relieved. Thank you so much for your support. Linda",
      "MessageIndex": 4,
      "PostDate": "01/07/2013",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/954432-biopsy.html",
      "Title": "?? on biopsy"
    }
  ]
}