{
  "AuthorID": "peachygrlRN",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/peachygrlRN",
  "Posts": [
    {
      "AuthorID": "peachygrlRN",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/peachygrlRN",
      "Content": "It is perfectly natural to be scared. It's a normal response to something that is unknown. However, I think you are thinking way ahead. Did the doctor say what sort of biopsy needs to be done? Depending on the type of biopsy, will depend on where it can be done. Some simple cyst or fine needle biopsies can be done in either the physician's office or in a special procedure room. Not all biopsies are performed in the hospital. Almost all *open* excisional biopsies are performed in the operating room under general anesthetic. An open excisional biopsy is where the entire area of concern is removed for analysis. But the days of waking up in the recovery room without a breast are all but gone. A woman rarely falls asleep not knowing if her breast will still be there when she wakes. I agree with the other poster in that if you are wanting a second opinion, then seek one out. However, it is premature to seek out an oncologist as no cancer has been diagnosed at this point. If something is growing in the breast, then it needs to be taken out. It's just too risky to let it remain, in my opinion. This is the same for any residual mass that remains in the breast following a cyst aspiration. Hope this helped.... ------------------ peachygrlRN",
      "MessageIndex": 2,
      "PostDate": "13/12/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24615-doctor-says-i-need-remove-lump.html",
      "Title": "Doctor says I need to remove lump!!!"
    },
    {
      "AuthorID": "peachygrlRN",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/peachygrlRN",
      "Content": "It is perfectly natural to be scared. It's a normal response to something that is unknown. However, I think you are thinking way ahead. Did the doctor say what sort of biopsy needs to be done? Depending on the type of biopsy, will depend on where it can be done. Some simple cyst or fine needle biopsies can be done in either the physician's office or in a special procedure room. Not all biopsies are performed in the hospital. Almost all *open* excisional biopsies are performed in the operating room under general anesthetic. An open excisional biopsy is where the entire area of concern is removed for analysis. But the days of waking up in the recovery room without a breast are all but gone. A woman rarely falls asleep not knowing if her breast will still be there when she wakes. I agree with the other poster in that if you are wanting a second opinion, then seek one out. However, it is premature to seek out an oncologist as no cancer has been diagnosed at this point. If something is growing in the breast, then it needs to be taken out. It's just too risky to let it remain, in my opinion. This is the same for any residual mass that remains in the breast following a cyst aspiration. Hope this helped.... ------------------ peachygrlRN",
      "MessageIndex": 3,
      "PostDate": "13/12/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24615-doctor-says-i-need-remove-lump.html",
      "Title": "Doctor says I need to remove lump!!!"
    },
    {
      "AuthorID": "peachygrlRN",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/peachygrlRN",
      "Content": "I'm very sorry to hear of your diagnosis. You must have been devastated and overwhelmed to be told you have cancer, not to mention a gozillion questions. Did you tell your surgeon about the pain you are experiencing in your back? It could be anything. It could be related to the cancer, or it could be something else. Once you see the oncologist, he/she will order a complete workup to see at what stage your cancer is. The stage, the type and how far it may have spread determines your treatment options. Did the surgeon remove any lymph nodes or do what is called a sentinal node biopsy? I would be sure and report this pain when you see the oncologist. If it is very painful, and not relieved by over the counter pain medication, then I would seek medical attention immediatly if for nothing else but to get a prescription for pain medication so that you do not have to suffer with it. Please let me know how you are doing. I am located in Austin. I wish you the best of luck.",
      "MessageIndex": 1,
      "PostDate": "31/01/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24631-breast-cancer-upper-back-burning-aching.html",
      "Title": "breast cancer/upper back burning aching"
    },
    {
      "AuthorID": "peachygrlRN",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/peachygrlRN",
      "Content": "For Sister: Wouldn't it be nice if we could just lop off our breasts and be totally free of the worry from breast cancer. Alas but that is not the case. Breast tissue is not limited to the visible mound of the breast. And a mastectomy does NOT remove all the breast tissue. Some still remains, both on the chest wall and under the arm pit or what is known as the axillary tail of the breast. Remember that men get breast cancer too. So not having breasts, does not guarantee that you will not get breast cancer. So I'm afraid that no matter what you do, you will always have to be aware of breast cancer. I don't \"worry\" about it. I do what is required such as getting my breast exams and mammograms and just hope it doesn't happen to me. ------------------ peachygrlRN",
      "MessageIndex": 8,
      "PostDate": "18/12/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24621-can-anyone-help-micro-calcifications.html",
      "Title": "Can anyone help with MICRO-CALCIFICATIONS???"
    }
  ]
}