{
  "AuthorID": "prouddad98",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
  "Posts": [
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "Four days into round two of chemo. It hit her a lot faster this time, last time she felt ok for about ten hours or so, this time she was sick in about two hours. I canâ\u0080\u0099t say that the Emend did not work because who knows how she would have felt it she had not taken it. Her hair is about 90% gone and she is real tired. As far as new things just about everything tastes bad, from what she told me it sounds like sections of her taste buds donâ\u0080\u0099t work right now and she only can taste bitter or sour parts of food. Bacon tastes like roast beef, pepperoni tastes like bacon, salami tastes like ham and all sodas tastes bad. And she can taste the metals in tap water. Looks like eating will be hard for awhile",
      "MessageIndex": 16,
      "PostDate": "08/02/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "We got bad news last night, the Doctor called us because my wife was going nuts not knowing. Our Dr. had been in surgery all day and was not able to call us until last night. We (my wife) has breast cancer. We do not know the type yet, but he said something about it not being a cancer caused by hormones, not sure what that means. I told my wife about this web sight and that I will help her set up her own screen name so she can make some friends and get through this. We are new at this so any input would be great.",
      "MessageIndex": 1,
      "PostDate": "09/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "We go in on Thursday for a lumpectomy and sentinel node biopsy. I showed her this web sight and she is not quite ready to get on here and talk. I think after she gets some help from the cancer care center she will be ready to interact with more people with the same issues and listen to all the great people that have survived this life altering disease and have moved on to very enjoyable productive lives, and cry and tell her story to new people going through this in the future.",
      "MessageIndex": 4,
      "PostDate": "12/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "We do not see the Dr. until the 13th so I called him today to get more information. He said it is called Infiltrating Carcinoma with lumpy features and calcification. He also told us to bring a list of questions for our meeting. If anybody can help us out on what types of questions to ask that I might not think of I would be thankful.",
      "MessageIndex": 3,
      "PostDate": "09/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "The surgery went well, and the node was negative. Now we wait for more results and then start chemo.",
      "MessageIndex": 5,
      "PostDate": "17/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "No results on the nodes yet due to the Christmas break. But she went to the ER on Christmas due to abdominal pain and found out that she has gallstones. So yesterday they removed the remains of three gallstones and we find out today when she will have her gallbladder removed. They do not believe that the gallbladder and her breast cancer are related. Just another wrench in the gears of her recovery, they did send the stones to the lab for biopsy results.",
      "MessageIndex": 10,
      "PostDate": "27/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "My wife went into for an ultrasound biopsy yesterday and the lady that did it for her said the mass has new nerve growth around the mass and that made it very painful. I do not know much about cancer but is seems to me that cancer kills tissue and new nerve growth around the mass may be a good sign. Can breast tumors with cancer have new nerve growth?",
      "MessageIndex": 0,
      "PostDate": "06/11/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "So we are twenty months past surgery, my wife has been through 6 months of chemo, 6 weeks of radiation, and one year of Herceptin. Now she is getting shooting pains in her head and blood in her stool. She is going in to the Dr. next week to hopefully rule out that the cancer has spread. Are there any users on here that have had your Her2+ metastasized to your brain? If so what were your early symptoms?",
      "MessageIndex": 0,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/706149-20-months-later-her2-bc.html",
      "Title": "20 Months later. Her2+ BC"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "We are 7 days into chemo, the gallbladder went well, no cancer found. As far as her lymph nodes they took a total of 18 and the 2 they knew about and one more had cancer cells. Chemo is rough; she canâ\u0080\u0099t handle too much fat in her food due to the gallbladder then add on the side affects of the Adriamycin/Cytoxan. She will do that every three weeks for a total of four times then she will start Taxol with the same schedule. She will also start Herceptin at the same time and that will last one year, once every week. I canâ\u0080\u0099t recall when she will do radiation, I think after chemo is over and it seems like that will last ten or 12 straight days. If you do not have cancer I highly suggest a cancer policy like Aflac. I have an Aflac cancer policy and it has paid most of my co-pays.",
      "MessageIndex": 11,
      "PostDate": "20/01/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "We are one day after surgery number two, they removed 8 to 14 nodes, we will not know how many for sure until the lab looks at them. We hope that only the two found about 10 days ago in the MRI are the only two that are positive. She also had her power port so if all goes well she starts chemo on January 2nd. She will have a total of 60 weeks of treatment. 4 doses of one type of aggressive chemo then she will start another type of chemo for 4 doses, at the same time she will start Herseptin and that will last 52 weeks. At some time during this ordeal she will have radiation. Wow what a bunch to take in.",
      "MessageIndex": 8,
      "PostDate": "20/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "Day one after round three of the A/C. She has a horrible headache and she has Mucositis grade 3 so her Dr. had to lower the chemo dose. Seems like each round gets worse. Thank God we only have one more round of the crummy red stuff and the Cytoxin. I canâ\u0080\u0099t wait until this summer when the chemo is over and all we have to worry about is the Herceptin.",
      "MessageIndex": 19,
      "PostDate": "26/02/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "Well we are nearly 4 weeks past surgery and in the last week she has had a breast MRI, a full body cat scan, bone scan and a heart scan. And now today due to the MRI results she is having a fine needle aspiration on two nodes. All these tests are due to the fact that her cancer is HER-2 positive. That means it is more aggressive and can spread fast. We find out the results of all the above tests on the 17th and on the 19th she gets her chemo port and with any luck the 2 large nodes will be cancer free and that will be it and we can start chemo.",
      "MessageIndex": 7,
      "PostDate": "12/12/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    },
    {
      "AuthorID": "prouddad98",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/prouddad98",
      "Content": "We are 12 days into chemo and she has painful sores (pimple like) on her neck and head. Has anybody gone through this side affect? Any tips on how to make them less painful? Other than that she is sleepy.",
      "MessageIndex": 13,
      "PostDate": "25/01/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/550562-possible-breast-cancer.html",
      "Title": "Possible breast cancer 1 2"
    }
  ]
}