{
  "AuthorID": "Rachey88",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Rachey88",
  "Posts": [
    {
      "AuthorID": "Rachey88",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Rachey88",
      "Content": "I have noticed over the past week and a half my right breast... the sink became very dry and kind of red.. and part of it is extremely dry and sore. Close to the center is like a very dry blister where in hurts. I'm scared it might be something serious.. but then I wonder if it's just a really bad case of very dry winter skin? Please, Any help or advice will be greatly appreciated because I just don't want to have to spend the money to go to a doctor just yet because I'm a college student and I can't afford to just go and get a mammogramor go see my doctor for that matter. Thank you so much! --Rachel--",
      "MessageIndex": 0,
      "PostDate": "25/10/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/440791-large-red-sore-bump.html",
      "Title": "Large red sore and bump"
    },
    {
      "AuthorID": "Rachey88",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Rachey88",
      "Content": "I still haven't gotten a chance to go to the doctor... but I think it was maybe like an infected pimple if there is such a thing or something like that cause... the blistery part popped and puss came out.. and the reddness has been going away.. it's still dryed a little but not bad at all.. It looks a lot better. It definately feels tons better. Should I still get it checked out? cause it's not really a lump anymore. Just a pinkish red spot.",
      "MessageIndex": 2,
      "PostDate": "29/10/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/440791-large-red-sore-bump.html",
      "Title": "Large red sore and bump"
    },
    {
      "AuthorID": "Rachey88",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Rachey88",
      "Content": "It looks much better now.. The skin is not so dry and it's turned into more of a scab. I still haven't made it to the doctor, but I'm not sure if I'll make it. But thanks everyone for the input.",
      "MessageIndex": 4,
      "PostDate": "01/11/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/440791-large-red-sore-bump.html",
      "Title": "Large red sore and bump"
    }
  ]
}