{
  "AuthorID": "ralve",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
  "Posts": [
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi, I was wondering if any of you might have some information on this. I am 45 years old, and pretty much already through menopause (early). I had my last mamogram about 31/2 years ago. I was supposed to go in and get one on my last exam about 11/2 years ago, but put it off. The last mamogram I had, I had felt a small lumpy area near my nipple, and he said he thought it might be a milk duct or something like that. That was pretty much the reason for the mamogram. Anyway, the results were ok, and they said it was nothing. I kind of always will keep track of how it feels, and it dosen't feel much different, I don't think, maybe a little bigger but I'm not even sure. It feels like a lump near my nipple, and then maybe some dense tissue around it or something. Well, today after I woke up, I noticed that there was some dried blood on the top that I was sleeping in, and it appeared to be coming from the nipple, as it was in that area of the top, and there was also some on my nipple. I went right to the doctor today, and he said that there are many things that can cause bleeding in the nipple. Of course, one of them is cancer, but I was wondering if you think this is an especially bad sign or what. He definitely felt something there, but like I said, it's pretty much the same thing I had before, but he was mentioning the size it was, and saying it felt dense. You know how doctors are, he tried to reassure me, saying he thinks it's benign, but we won't know till the tests come back. Of course, here we are at a three day weekend, and now I have to worry myself sick until Tuesday morning, at which time I have a mamogram, and an ultrasound. Basically I was just wondering if any of you had heard of this symptom, and it turned out to be something less serious than breast cancer. I don't have any history of breast cancer in my family, but I know that dosen't really matter. He said it could be a clogged milk duct, or a papilloma, or other things that I can't pronounce. I am so worried, as I could kick myself for not going in for my mamogram at the last visit, and I have an eleven year old daughter, and I want to be here for her. Well, thanks so much for any advice! Val",
      "MessageIndex": 0,
      "PostDate": "02/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi, and sorry, one more thing, I just wanted to mention that along with the discharge, I have that lumpy area near my nipple (up a little from that) but it's been there for quite a while. This is the same lumpy area that I had a mamogram for over 3 years ago, and they said it was nothing. It was kind of hard to remember if it's exaclty the same, I think when I had that mammogram, it was a little less lumpy, and now feels like maybe there is one more smaller lump next to it or something. My right breast has been leaking blood now all night, it keeps staining my shirt. Isn't it unusual for it to be a papilloma if I'm 45 and through menopause already? My doctor said that even though I'm officially through menopause, I guess you can still have menopause symptoms since I'm young for that, and also even though I've stopped having periods, I guess I could really still be going through it. I'm just worried that most of these signs that I have do point to cancer. Although, I did read on the internet tonight that only like 10% of bloody discharges are cancer, but do you think this is still true when there is a lump there? Again, thanks so much, I guess you can tell I'm in a panic! Thanks, Val",
      "MessageIndex": 6,
      "PostDate": "04/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi again~~yikes, so sorry, but just one thing I forgot to mention. I was reading over your letter again, and you had said that I had no family history, which was in my favor, I guess I had mentioned that some time before.....but one thing I wanted to mention was this. Most of the women in my family are ok, my Mom's Mom is 100 years old, my own Mother is 70, her sister is 60, but her other sister, who is 75, was diagnosed with Ovarian cancer last year. I read up on that, though, and most of the information said that if you get Ovarian cancer late in life like that, it is most likely not the hereditary kind, that the hereditary types shows up earlier in life. That was actually the ironic thing, I went to my GYN right after her diagnosis, just because alot of us in the family did, since we were behind on going, and it's like a wake-up call, and that is when he told me not to worry about Ovarian cancer, but to be sure to get my mammogram, he must have said it five times. I don't know, there was something that was making me nervous about doing it. Well, sorry, I just wanted to mention that family history to you....and thanks again..............just think, after Tuesday, I can stop bugging you! ha ha, thanks again so much, Val",
      "MessageIndex": 11,
      "PostDate": "04/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi!! Thanks so much again for this reply! I can't believe the time you are taking with me, I owe you so much! Anyway, I am just back from my appointment. My daughter went with me, she was so good to have there. She's very calm, and positive about things. Well, I had the mammo and then the ultrasound, and then the doctor who checks the films came in to talk to me. My appointment was at 8 a.m., and so I guess there was not many people before me yet. He said that the mammo and the ultrasound looked normal. This was obviously an initial relief to me, but I'm not sure it should be yet. He started asking me about how the blood comes out, if it's spontaneous, etc. I said it was, and he said the next step would be an MRI because it's more sensitive, and then a referral to a Breast surgeon. He mentioned the papilloma, and also mentioned ductal cancer, there are so many different terms, and when you're nervous, it's hard to remember exactly. I asked alot of questions, and being that the mammo and the US were normal, I asked if this result lessons the chances that it would be an invasive cancer because those tests would maybe show something, and he said yes. He said that a ductogram isn't that good because you have something like twenty ducts in there, and it's not easy to tell which one the blood is coming from. So, I guess he didn't know why the blood would be discharging, and that is why I have to go to the next step. I guess I feel good about the mammo and US being normal, or does this mean that it could still be very serious, and those tests just couldn't pick it up? My husband says that this is good news, and to try to hang onto that. I suppose if it was invasive, that the chances it would show up on a mammo or US would be increased. (?) I can't thank you enough for your help and support this past week. I couldn't wait to get on here and tell you those results. You've been just amazing, and I want to pay you back in some way. I can't help but feel relieved, but I guess it should be a guarded optimism, because I still have the MRI, and more after that. I guess the mammo and the US don't pick up everything. Well, thanks again so much, and sorry for my long long letters! Val",
      "MessageIndex": 15,
      "PostDate": "06/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Thanks again so much for all the helpful information. I don't want to keep bugging you, but I did want to tell you how helpful it was to have the specific information you gave me, because when the radiologist came in and told me about going to a breast surgeon, I think I would have normally been really surprised, and concerned, but I was prepared for it because of you. If my mammogram and ultrasound came out clear, or normal, do you think that lessons the chance that this is an invasive cancer? To be honest, with the reaction I got today at my GYN office and just in general, I'm not sure this news of a good mammo and ultrasound is that significant. I called to talk over my results with him, and the nurse called me back, and just said that my mammo didn't show a mass, and that I should just do the MRI, and then we'll discuss going to a surgeon. I guess it's kind of a weird feeling, like do I have something really serious, or should I be relieved about my test results? Maybe I shouldn't be putting so much weight on them, but I really do feel alot better after those results, because I keep telling myself that if it was something really invasive, it probably would have been seen on those tests. Am I kidding myself? I'm nervous that the MRI will show some cancer, or am I doing an MRI to look now for a papilloma? Questins, questions, well, again, sorry to be bugging you, and thanks again so far for the wonderful information!! Val",
      "MessageIndex": 20,
      "PostDate": "08/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi~~omg, I'm so sorry that you're going through this....but, of course, you probably don't need me to tell you that 90% of all lumps are benign, right?? It sure is scary though, I was reading through my past posts with you the other day, and I sound like a nut! Your letters to me really reassured me, and I was able to feel that again from re-reading them. I hope I can do the same for you! It's so funny you should say that about them asking for clergy, etc....because I was just thinking yesterday as I was at the window waiting for the girl to give me my paperwork, that it's so easy to analyze the way everyone is acting, you know? I mean, I know that is a very uncomforting thing that was said to you, but to that person, they were probably totally in a different place, thinking it was comforting to you somehow. And, just all these times that I thought \"Oh, this HAS to be bad, because this doctor said or did this, or this person acted this way\".... it never amounted to anything. Do you know what I mean? Hard to explain on here.....but just that when you feel like you're going through a crisis of some sort, everything around you is amplified a million times to you. I wish in some ways that nurses especially would be more aware of their impact on the patient with their words and actions. I'm sure you will be fine, hey, I've been reading up so much on breast stuff, and I know you already know this....but the vast majority of lumps are benign.....even with a family history. You can't believe the letters I've been reading from people on different sites, and they are so worried because of a lump that they found, and it usually turns out to be nothing. And, as you've said to me before, you're doing the right thing, getting in there right away, and I know you'll get your piece of mind! It's hard doing it though, it's so unnerving to go through, but it'll all work out in the end. So, you have to wait till Tuesday? That will probably be around my time frame also, as I called the doctor yesterday, and still haven't heard back. I feel like starting at square one at a new GYN office....I mean, I like the one I have, but I don't like trying to get through to him, or his office. Again, so unnerving! But, remember, camping will take your mind off of it, and also it's so healthy for you to be out there in the fresh air in so many ways. Good for the soul! I love getting out camping, I feel like a new person afterwards. If you are ever near Lake Tahoe, you have to go camping there! If you go to the right place around there, it's just amazing. So beautiful! We've been going there since we were kids, and I love it probably more than anywhere in the world. I have such great memories of my whole family going there, and my Dad used to just love it. He was so healthy, and enjoyed so much going out on hikes, etc. He and my Mom retired to Reno, Nevada and almost three years ago, he unexpectedly passed away from something very rare. It's so hard to not have him here, he was just a wonderful person, he was only 69....and very health concsious. Yesterday was my Mom and his 49th wedding anniversary, and she was having a particularly bad day, because he was so romantic, and she knows the things he would have been doing for her. This is just on my mind, because of their anniversay, and this talk of camping brings back so many great \"Dad\" memories!! Anyway, just going on there, sorry! I want you to know I'll be thinking of you, but try not to worry, I just know it's nothing! The odds are so amazingly in your favor, and just the fact that you are even going in right away, shows that even with a family history, you can overcome the odds, because of your vigilance in checking everything out. My Grandmother, who is 100 and amazing, knows about what I'm going through, and she dosen't really believe in going to doctors, and she was telling me that years ago, she got a lump on her breast, and she never went in and checked it out or anything, and it eventually went away. I, of course, am not saying that's a good thing, but it just shows how these things are usually nothing to worry about, unless of course it's happening to you! And, please try not to worry about what was said to you, try not to dwell on it, it's so easy to do. I know I'm going on and on here, but just to tell you a couple things that might help.......right before my Dad's death, I was mistakenly diagnosed with Hepatitis C, I had a test come back positive, and so I went through about a year's time thinking I had this terrible disease, and it even affected the fact that I didn't go out and see my Dad before he died, because this diagnosis was new to me, and I was nervous about traveling. Anyway, I can't tell you how insensitive some medical people are about the things that they say, that I guess they think is comforting. I was treated totally differently, and I could feel that everywhere. I felt like an AIDS patient or something. Anyway, subsequent tests confirmed that I was, in fact, negative for HepC, so I went through all of this for nothing. I knew it was so weird, too, because I really didn't have any risk factors, other that ear piercing. Anyway, my point is, it's just amazing how things that are said to you can really hit you the wrong way, and it seems to obvious to you. Have a wonderful time camping!! Thanks for the words on my MRI test, and you know, I don't feel as bad as I thought I would! I don't know, maybe it was somewhat empowering (I know this sounds weird, but....) to make a decision about getting out of the MRI machine, it's like it made me feel better in a weird way, and I'm not sure why. Maybe it just all didn't feel right. Before I went in to the MRI room, and the nurse was down the hall putting my IV in, and talking to me, it was an uneasy feeling, because they were acing super hassled, like they didn't even have time for lunch, and they were saying how the MRI machine had broken down the week before, so all those people who were scheduled that week, were coming in this week, etc. But, anyway, that is what I'm going to do, get my mammogram and US results, and head off to a breast surgeon. Either there has to be another test I can take in replacement of the MRI, or we can search around for one of those 'open MRI's'. I'll fly to Mayo if I have to!! Anyway, sorry for the long letter, be careful driving this weekend, and have a wonderful time! I am envious of you, I would love to be camping, and what a great time of year for it!! It's such a great idea for you to do, because your kids will see you relaxed, and your mind being off any worries. You are right, we are in this together! And, you and I are more than likely both O.K.!! Enjoy the stars!! Take care, talk to you soon! Val",
      "MessageIndex": 31,
      "PostDate": "16/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "OMG!! Thank goodness you wrote me, I was getting worried! I'm so glad to hear you are doing well! And, I know it's benign, everything sounds like it's completely in your favor. It's so good, as you've said to me, that you're doing this, though. So many people just try to ignore it, or just put it off. What a relief that it's over! I'm just so glad that you're ok. I went to the surgeon today, and again, I can't thank you enough, because there have been just countless situations in which I would have been so nervous about what the doctor was saying, but since you had already told me these things, I was more relaxed and prepared. Anyway, I guess I told you about the MRI experience, right? I think I did~~anyway, I thought he might say to try another MRI, maybe an open one, but what he said, is that he thought, in my case, that an MRI would be \"overkill\". He more or less just tried to reassure me today, taking all my reports into account. I had my films and reports (thanks to you!)...and he examined me himself, and just basically talked to me alot, and said that he didn't feel anything suspicious....mentioned the things I already knew about such as a papilloma.....and said that at this point, he thinks that I should come back in a month or two, and do another ultrasound. He very throughly checked me, tried to express the discharge (which didn't work)...and explained how most discharge, even the scary bloody type, is due to some type of benign process. Also, it hasn't happened again since last Thursday, so I think he was taking that into account, and thinking it might have been an infection (I think). But, he was great, he was just so good at listening (some doctors are NOT)....and was very gentle and caring and one of those doctors that you don't run into that often. I really liked him. I suppose I feel comfortable waiting a month or two. Also, I know that you mentioned that some women come in for follow-ups, so this sounded ok to me. Anyway, I hope you are getting the rest you need. Sounds great that you took the day off tomorrow! Take care of yourself...just relax and make your family wait on you! Have lots of tea (green is so good for you!) and watch some junky tv! We're busy here getting ready for the possibly approaching Hurricane Rita. They say they don't know exactly where it will hit, of course, but I went out today and bought all kinds of groceries that we will probably never use. Oh well, it's easy to get all caught up in the panic shopping! Well, thanks so much for writing, I was really hoping I would hear from you. I know you're going to get good news, it already sounds like everything went great, and no reason to think otherwise. Thanks again so much, and let me know how it's going! Talk to you soon~~Val",
      "MessageIndex": 33,
      "PostDate": "20/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Thank you, so you think it is great news? I know that sounds like a stupid question, but of course it's great news to say that a mammo and US are normal, I guess it's the best news I could have gotten today. It's kind of hard to explain though, it's like, the roller coaster of emotions, because I was way over one way thinking it could be invasive cancer, and so of course, even though the radiologist mentioned cancer, as in ductal cancer, I was relieved, because if the cancer had spread, it should have been seen on mammo and US (hopefully)....but now I'm kind of coming back down to where I am normally, and realizing that I am still dealing with something that I have to go to a breast surgeon for, and most likey have surgery for. And, from what I've been reading, some women have radiation (I think it is) treatments after ductal carcinoma. Don't get me wrong, I am so, so relieved about my results today, just still nervous, since I am still having the discharge. Even if it is just a papilloma, it sounds like I still have to have surgery, since I have the discharge. I am just nervous about the surgery, but I guess this could be a blessing in disguise, because I'm trying to get all my other health problems in check before the surgery. I'm eating better, trying to loose weight, and just trying to get my blood sugars in check, I've been having trouble with them for a while. I also get really bad heart palpitations, ever since I've gone through menopause, and so this is why the thought of surgery makes me nervous. But, thanks again so much for all of your support and help......you were one of the people on the top of my list to tell my results to today! Thanks again so much~~~!!! Val",
      "MessageIndex": 17,
      "PostDate": "06/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi! I just wanted to make sure you were ok, I hadn't heard from you since my last post....everything is fine here. We didn't get the hurricane too badly here, and so we've been dealing with some power outages, usually several hours per day. It's just now starting to calm down a bit. We woke up that morning to find a huge tree in our pool, so it's amazing that we didn't even hear it fall. Anyway, I guess we're glad it didn't hit us too hard, but the kids are actually dissapointed!! ha ha~~ Anyway, are you doing ok?? I hope all is well. I guess everything is ok with me, I still haven't had any more discharge since that last time before I went to the surgeon. Weird, isn't it? I have been having a bit of breast pain in that breast, however. Kind of strange. I have to make the appointment for the ultrasound that he suggested. I still worry a bit that we haven't done enough, you know how these kinds of thoughts creep in. But, I did really like the surgeon, and he seemed to know what he was talking about. Well, let me know how you are doing! Talk to you soon, Val",
      "MessageIndex": 36,
      "PostDate": "29/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi!! Oh my gosh, this might be around the time you are going on your cruise!! You said about three weeks, and I guess it's been about that right now! I can't wait to hear how it went! It sounds so fantastic!! I sure wish we had done that when the kids were smaller, it's a great idea for you to do this now. I always tell that to my husband, that I want to plan as many trips as we can, while the kids are still around. We're lucky that our son, who is 21, is still only an hour away at college, so he comes home alot on weekends, and we all do things together. Anyway, I hope you get this before you leave, but if not, let me know how it all went!! I hope you are feeling well, I'm so glad everything came out great for you. What a relief! I hope you guys had a great Thanksgiving. Ours was good, just kind of quiet, with the five of us. We always have dinner and then go to a show, and this year we saw 'Harry Potter', which I love those movies. I'm in the midst of trying to get ready for Christmas, but am pretty unorganized this year! When Mark comes in this weekend, we're going to get the tree. Kim (my youngest daughter) is in the Nutcracker ballet at this time of year with her ballet classes, and so that keeps us really busy. When Mark comes in for the weekend, it just about takes up the whole thing! So, anyway, I have to get out and find time to shop, and haven't done much of that yet. I'm jealous of you making cookies and all of that (ha ha!) I have to get my act together!! Anyway, I've been doing ok as far as the breast discharge, it just kind of disappeared, isn't that weird? I haven't called yet for the sonogram, I was thinking I would wait till after the New Years, I don't really want to deal with that right now, and I guess a few weeks wouldn't matter, since I don't think it's been two months yet, but maybe it has, I don't know, time goes so fast! I don't know if it's a bad idea to put it off till after the New Years or not, but I would like to do it that way. I'm trying to get some other health stuff in order also.....I've been having a really bad toothache, and am going to the dentist for that, and that takes up alot of time. We have a trip planned for the New Years, and I don't want to have a toothache then! We went to Disneyworld in the summer, and I had a toothache the whole time we were there. It didn't ruin the trip for me, but it was very annoying. I guess I have sensitive nerves in my teeth or something, because I tend to get real bad ones. Anyway, just kinda stuff like that, and also I need to get some other things in check, I've also been having bad acid reflux lately. Wow, I sound like a case!! Not to go on about my health, but just justifying why I'm putting the sonogram off for a few weeks (talking myself into it!!) I'm glad you guys had a great Halloween also, it sounds so fun the stuff you guys do! It's so great how you're so into your family, it's just the best time when they are small. I sort of wish we could be up in the Northeast right now, Mark says it's of course very cold, but pretty. He might be delayed coming in this weekend he said, because of some weather coming in there. Well, you never know, his job ends around January, and he will be coming back here for some time, but he might decide to take another job there in the Northeast now that he has lots of contacts there. Maybe someday we won't be that far apart, and we can actually meet!! I also am very thankful for your friendship, you were really here for me at a time when I really needed someone! I don't know how I would have gotten through it without you, it was such a scary thing for me. You definitely were my angel!! Well, I hope you will have or are having a wonderful time on your trip, and I hope I wasn't too late to catch you before you left!! Have a great time getting ready for Christmas, you sound in the spirit already!! Thanks again for everything, talk to you soon!! Love, Val",
      "MessageIndex": 42,
      "PostDate": "08/12/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi! How fun to go camping! We love to camp (or I should say the kids and I do.....my husband prefers a luxury hotel!)...I hope you had a great weekend!! We used to live out in Northern California, and loved to go to Tahoe all the time. We still have lots of family out there, so we get out there each summer, and spend lots of time in the Sierra's. I'm sorry about the experience you had at the GYN, how scary....especially if you didn't know what was going on. I guess you don't see him anymore, right? Thanks again for all the encouraging words about my health worry. So, you think it does boil down to either a papilloma or ductal carcinoma? I guess I'm really hoping for the papilloma, right? I've been reading up a bit on the ductal carcinoma, and opinion differs greatly on how to treat it. Some people are very aggressive, and opt for a mastectomy. I guess because of the percentage that can go on to invasive cancer. The one thing I was thinking of that makes me feel better, is that I was really beating myself up for not going in to get my last mammogram, but I guess now I know that wouldn't have made any difference, because my mammo and US were clear, and having no symptoms then, that would have been the end of the tests. The only reason I'm going in for the MRI is because of my symptoms, not because of anything that showed on the mammo or US. I haven't seen my reports either, all I know is the radiologist said they were \"normal\". I guess I should trust that, right? The lady who set up the MRI for me said that he said my breast tissue was dense, but then that comment had me worried because I read somewhere where dense tissue can cover up a mass. I don't remember my last mammo having anyone saying my tissue was dense. I don't even know if she said he said that, she was just kind of commenting. I also was reading where ductal carcinoma will show up on mammo as calcifications....so hopefully that also might mean that this might be a papilloma. Either way, I guess I'm facing surgery, which makes me very nervous. I have a heart arrythmia, and I don't like the idea of going under. Stupid question, but do you know if, for this type of surgery, you can stay awake and have a regional anesthesia? Well, I will, of course, let you know how Tuesday goes. I am less nervous this time than last time, but like I said, I wonder if I'm kidding myself. I have to believe that the clear mammo and US are good news, but who knows I guess. On the one hand, I don't know what I would have done without your help, and on the other hand, I feel really bad taking up this much of your time. You have been so generous with your time, and knowledge, and I can't thank you enough. Soon, you will be done with me!! Thanks again so much, and I hope you had a great weekend!! Val",
      "MessageIndex": 22,
      "PostDate": "11/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "HI!!!!!! I am SO happy for you, your letter just made my night!!! I just knew that it was going to be ok for you!! It's so good to read your letter, and just be able to tell that you are feeling so relieved~~you sound great! Wow, you and I are both so lucky!! Wake-up call for me, for sure! I was eating so much better when I was going through this, and now my bad habits are starting to creep in slowly again, so I have to watch myself! That's such a great idea about me keeping track of any bleeding! I will surely do that......it's so weird how it hasn't happened again. I think the last time was about a week ago, on Thursday. Who knows what that means?? Anyway, yes, the surgeon just made me feel so much better! He really reassured me, and let me know how it was very good news to have the normal mammogram and US. Wow, I am just so happy for you. That must have been so stressful for you the last few days. Now, you go into this weekend with a relaxed mind!! Yea, we're getting ready for the Hurricane, I don't know if it will hit here or not, but it's a little tough making the decison to stay or go. We are about 80 miles inland, so we pretty much will just face the wind, and maybe some tornadoes, but it looks even more scary getting out there on the freeways. My older daughter is having fun taping everything so far on her camcorder, she says she is making a documentary of Hurricane Rita. She went into the stores, and taped the empty shelves, and I went with her today, where she taped the freeway that was dead stopped, and also they had the south bound freeway going north now, so that was an unusual thing to see. I just hope we are making the right decision to stay. Most of our friends and neighbors seem to be staying, but are very concerned as we are. My husband actually commutes down here on the weekends from the Northeast, I think I had mentioned that to you before. He flew in this last Wednesday, so I'm so glad he's here. I would be so nervous otherwise! Then, he got here and kind of said, why did we do this? He said that me and the kids should have gotten on a flight earlier in the week, and joined him in Connecticut. Now, it's too late....he checked every single flight out of here and there was absolutely nothing anywhere. But...I think everything will be ok, we have plenty of food and water, and we are pretty far inland. Again, your letter just made my night, I couldn't be happier for you! I'm so relieved for you....I am happy to think of how relieved your family is also. I hope you're still taking time to rest, and enjoy your good news to the fullest!! Take care, and I'll let you know how things are going! I might be out of power for a while, and not able to write on here, so if you don't hear from me for a few days, you know why! Thanks for the advice, and again, thanks so much for all of your help with my problem! You seriously made such a huge difference, I can't even tell you. Thanks again, and take care of yourself! Love, Val",
      "MessageIndex": 35,
      "PostDate": "22/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi!! I hope you are doing well, it's been a little while since I've been on here, this has been a really crazy week! We are planning a surprise trip out to my Mom's this weekend for her birthday, and it's not going as smoothly as I planned! There's just so many details to iron out, and we're trying to keep it a secret, but someone is always getting involved and complicating things. Anyway, how are you feeling? I've been doing ok, still haven't had any more discharge, isn't that weird? I don't know why it would just go away like that. Not that I'm complaining! I still haven't set up my sonogram, and so I'll do that after this weekend. I wonder if I would be doing that with the surgeon's office or back where I did it before. That sounds like a great camping weekend with the Halloween theme! Was it fun? I don't know if I mentioned this before, but my birthday is on Halloween, so I've always loved the Holiday. As a kid, I thought it was all about me! And now, it's just so much fun, other than the fact that our town here sort of dosen't \"do\" Halloween like they used to. It used to be so much fun, with kids everywhere, but now it seems like people are opting for the safest route, so there are a lot of little church things going on, like carnivals and stuff. I hate to see the traditional Halloween things going away, though. It was such a special night as kids to dress up and go Trick-or-Treating and see all the other kids. I loved doing it with my kids also. We still make a big deal of it at our house, and always have some kind of party. My 18 year old daughter loves the gory stuff, so she makes the house look great. Well, I wanted to make sure to say hi, and thanks for all of your help on here! I truly don't know what I would have done without you. I really looked forward to seeing your responses each day, and it would really help me get through the day. Thank you so much. Let me know how you are feeling these days! I hope all is well~~talk to you soon, Val",
      "MessageIndex": 38,
      "PostDate": "12/10/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi, Thanks so much for all the new information! Wow, this is such valuable infomation....I was thinking that maybe I should be going to someone who specializes in breast disorders. This doctor I went to is my GYN.....you know how some doctors can be, he was rattling on kind of fast, and it's hard to even think back on what he said. He did mention the thing that you said, about ductal carcinoma in situ, for some reason, I think maybe he was thinking that was the more likely thing, because he mentioned it a couple of times, and seemed to think that the papilloma is an uncommon occurence. I have been comfortable with this doctor in the past, he did a vaginal ultrasound on me one time when there was a question about my ovaries, and everything was fine, and so I was reassured that same day. He does seem pretty competent, but I have read on some sites on the internet where if you do have a breast concern, you should be going to a doctor who specializes in breast conditions. He said that the doctor over at the place who does the exam would probably talk to me, and he sort of acted like the results would be benign, because he was just sort of pointing out that I would get reassured at the place I did the testing (assuming the results were good)...and that I would get a second reassurance after he called me himself. I remember doing a mammogram at this place a little over three years ago, and I had that small lumpy area, so I was worried, and they told me right away that it was nothing. I don't know if they are supposed to do that or not. Maybe they only do that if they know you are really worried about it, and if the results are good. Anyway, I just wanted you to know that I went to my GYN for this, and wondering if you think that is sufficient. I think he also does obstectrics. I am kinda nervous if I'm not doing the right thing. This ductal carcinoma in siut makes me very nervous, though, being that it is cancer. I would rather have the papilloma, right? I haven't had any more bleeding except that one time. I actually never saw the blood come out of my nipple, it was just on my bedclothes after I woke up, kind of dried up. At that point, there was some around my nipple that I washed off. I get so worried cause some sites say that the worrisome kind of discharge is when it's bloody, unilateral, and spontaneous, and all three apply to me. You certainly have made me feel so much better with your information and help, though.....I was reading on the internet about this Dr. Love and she has put out books on breast disease, and she says that there is only about a 4% chance that a bloody discharge would be releated to cancer, although it does have to be checked out. Well, thanks again so much for taking the time to help me, I can't tell you how much I appreciate it! Of course, I'll be telling you what happens on Tuesday! I dread that day, but can't wait till it gets here at the same time! Thanks, Val",
      "MessageIndex": 4,
      "PostDate": "03/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi~~ It's just me again, up at 4 in the morning and in a panic. Well, the blood stained night clothes was all I had to think it was blood before, but not anymore. I was just up walking around the house, haven't been to bed yet, and noticed the white top I was wearing had blood stains on the outside of it. Also, my nipple was spontaneously discharging the blood. This is so scary! Being that it's definitely red blood, coming from one breast, and spontaneous, dosen't that really signal cancer? It's like, I'm so sure that's what it is, and this scares me to death since I have an eleven year old daughter. I can't believe I wasn't better about doing my mammogram's! My last one was about 3 1/2 years ago. There really is no benign explanation for this type of scenario, right? I feel like I should call a doctor this weekend, but here we are in a holiday weekend, and I'm sure they will just tell me to wait till Tuesday, at which time I'm scheduled for a mammogram and ultrasound. Is it still at all possible this is not cancer with my symptoms? I am 45, and already through menopause, which is also scary. I went through it kind of young, I guess, and haven't had a period in probably over a year, and already went through all those tests, and my ovaries are just done. This also increases the chance that it is cancer, right? Anyway, sorry for the panic sounding letter, it's just late, and also a very scary thing to look down and see all that blood. Do you think I should call someone this weekend? Anyway, thanks again so much for everything, this board helps so much! Val",
      "MessageIndex": 5,
      "PostDate": "04/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Thank you so much for the letter!! I can't tell you how much better I feel after reading it! I am having a particularly bad day, because of the blood discharge last night, and also just generally, for whatever reason, came across a lot of negative information on the internet. I went to google and typed in what the doctor had written on my order, which was 'bloody discharge and right subareolar density'....and there was some good information on things I hope it might be, such as the papilloma, or ectatic duct, but there was lots of scary scenarios as well, such as invasive cancer being on the list of possibliites. You make me feel so good when you suggest that it will put my mind at ease, because that suggests that you think it would be good news. I'm trying to be positive around my kids, but it's hard. My eleven year old of course dosen't know anything, but as you said, I'm sure notices my anxiety. I have a 20 year old son, and an 18 year old daughter, and I do talk to them about it. I'm actually shaky inside I'm so nervous about it. The thing is, my husband is here now, but he commutes in on the weekends from the Northeast, and so he absolutely has to fly back tomorrow afternoon, so unless I want to put my 18 year old daughter through this with me, I'll be going alone to the appointment on Tuesday, and that kind of scares me, if it's bad news. Like you said, I don't even know if the doctor will talk to me, but the GYN suggested he would. Thank you soooo much for the advice about the General Surgeon. I can't thank you enough, this could end up making a difference saving my life! I looked it up in my yellow pages, and didn't see any doctors that specialize in that, so I guess I have to call my GYN and get a referral, right? I would assume for a specialist like that, it might take a while to get in. I was wondering, and I'm so sorry to keep bugging you.....I don't know how I could ever repay you!~ But, my appointment at the hospital for the mammogram and ultrasound starts at 8:00 a.m. on Tuesday, so there is no time before the appointment to contact my GYN....but do you think I should just still go and do these tests at this place? It's at the local hospital here, where they do all the mammograms, stuff like that. I guess it's kind of a women's center, but I know they do alot of different imaging there. I was wondering if you think I should wait and see the General Surgeon first, and do the tests with him, maybe somewhere else that he prefers. I am worried about the radiologist talking to me, and making me even more nervous, because, as you said, these guys are not specialists and might make things worse for me in the short run. So, you have made me feel so much better, without you, I would really be a mess. Really, with all the negative stuff I've read today, I keep reading your letter over, and feel reassured. So, to sum up, even though it's unilateral, bloody, and spontaneous, it's still very possible to be benign....but that you think it's serious enough to see a general surgeon because of the fact that it can be coming from a possible cancer, right? Thanks for the great words of advice, they are in my head as I'm going to go and do something with my eleven year old. I just want to be here for her so bad, she really needs me, as her Dad travels all the time, and we don't have much family around here. I am so sorry to have taken up your time on this holiday weekend! You are an angel....Thanks so much, Val",
      "MessageIndex": 10,
      "PostDate": "04/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi! You know what I'm going to say....thank you sooo much!! I really wouldn't be o.k. without you, I am telling you, the only really positive things I have read have been from you, and one site on the internet from Dr. Susan Love's book (I think that is her name) in which she states that even bloody, unilateral discharge is related to breast cancer only 4% of the time. Pretty good odds, but I do have that lumpy area also. I think that greatly increases the odds that it is cancer, because if the lumpy area is kind of to the side of my nipple, and maybe up a bit, that dosen't sound like what I've read a papilloma feels like. I am so hoping that is it, but I can't help but feel it's such wishful thinking. I've really gone so many years not taking care of myself as I should. I don't smoke or drink, but I have eaten badly, and just generally let myself go. I just can't help but feel that I've let my family down so badly, because if this is something, there was just no excuse that I didn't get in earlier. My husband has a good job, and I stay at home, it wasn't that complicated for me to take care of myself, but I've been lazy. Instead of being out exercising, and doing things, I would be lazy around the house during the day. Ok, sorry to go on and on there, it's just hard. Thanks so much for the advice on what to do, I will make sure to write as soon as I get back on Tuesday. My husband also said what you did, that I probably won't know much tomorrow, but they'll probably refer me to a surgeon, since there apparantely is a mass. But, shouldn't they be able to tell somewhat from a mammo and a US if it is a papilloma? If it's a solid mass, and it's been bleeding, that tells me right there that it's cancer, right? I thought that was what the US was for, to distinguish it from a cyst or a solid mass, and if it's a solid mass, and it's been discharging blood, that dosen't sound good. I don't mean to be negative, I'm just so scared. Also, you were saying before about things being in my favor, but I'm not sure I have that much in my favor really. I am post-menopausal (I'm 45, almost 46, at the end of October)...and went through early menopause, and I know bleeding after you've been through menopause is bad. Do you know if any of those ladies you were talking about had the bleeding after menopause? My GYN kind of acted like, well, you might not be truly post-menopause since it was early, and I guess I could still be going through hormonal changes. I hate to sound stupid, but I can't remember when I had my last period. My husband swears that it was earlier this year, but I think it was way before that, about a year ago or maybe more. The mass thing is confusing, because I went in at that last mammogram, about 3 1/2 years ago, for that lumpy area near my nipple, and they said it was nothing. I hope that something wasn't missed, because this lumpy area is in the same breast, and that's the one I'm bleeding from. This nipple is inverted, but it's been that way all of my life. I suppose there might be another lumpy area there that wasn't there before, but I guess I missed it. The GYN did say he felt something, but that he couldn't tell what it was from his fingertips. Do you think the GYN wouldn't be experienced enough to tell somewhat if this is a benign condition? I think he was trying to make me feel better, but he said he thinks it could be benign...but of course told me other scenarios. Could a papilloma be there for years before it starts to bleed? I worry that something was missed on this last mammo, and now the bleeding is signaling advanced breast cancer. My age is what worries me, and just risk factors of being overweight, and eating badly. If this turns out to be nothing, it sure is a wake-up call. I will never, ever put it off again! (I hope I have the chance to make up for this!) Anyway, I truly am sorry to keep bugging you, you have spent so much time helping me, and I really feel bad. I have to repay you! You've been there so much for me.....I just can't thank you enough. I feel that I'm going in tomorrow armed with so much more information now. One other question, on the mammo form, the doctor put that it was a single episode of bloody discharge, and of course, it's been doing this all weekend, so I guess I'll tell them that it's not a single episode any more. Does that also signal cancer, that it is persistent? I wouldn't say it was alot of blood, but like if I look now, it's like there is some dried blood in the nipple (it gets trapped there as my nipple is inverted)...and like I said, I've had the inverted nipple as long as I can remember. I had a few spots on my nightclothes again last night. OMG~~I am writing you a manuscript! I'm so sorry, please forgive me for being such a pest...again thank you sooo much!! Again, you are an angel!! Thank you, Val",
      "MessageIndex": 13,
      "PostDate": "05/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi, and thank you so much!! Do you realize all the valuable information you are providing me with?? You need to be on the payroll!! Seriously, it's so powerful to have information such as this, otherwise, these nurses and doctors just kind of know that you don't know what you are talking about, and kind of talk above you. It's not that I don't like my GYN, because I do, but it's just a bit frustrating with the lack of info. So, you still think I should do the MRI on Thursday? As I said, I was just wondering why, really, since from what I've read, the MRI isn't that great at picking up the papillomas or the ductal carcinomas, or maybe I'm wrong. Do you think this still could be an invasive cancer that wasn't picked up from the mammo or US, or is that unlikely? The thing about sending any discharge in, is that it would probably be hard to get, because I can't express any out, and it comes out now and then, when it wants to. And, it's not that much, it's a few drops on my bra here and there. Usually when I wake up. I wanted to answer a few of your questions that I overlooked. No, I haven't had any bloodwork done yet, they haven't asked for that yet. Also, you asked if I take a blood thinner, I just take an aspirin per day (325 mg.) I had one episode of Atrial Fib that was short, but caught on the holter moniter, so he decided at that point to recommend one aspirin per day. No, I don't have to take antibiotics prior to the dentist, I have PVC's and PAC's (maybe you know what those are), but I get them probably in the thousands per day. They've been calming down a bit lately, it's like they go in these cycles, and the only thing I can really relate them to is hormones, because I used to get them so bad before my periods, and then as I was going through menopause. Then, they completely stopped for a while, and then like a year later, came back again. I have seen a cardiologist for these, and while they are extremely annoying, they are supposedely benign. So, one other thing you said that made me happy was that you can possibly get a regional anesthetic for ductal surgery? That would be great, I just don't like the idea of getting put out unless absolutely necessary. I would never have cosmetic surgery or anything like that. It's weird, sometimes I am feeling up about this, and pretty good about what the outcome will be, and other times, like this morning, I'm just so worried. I just got off the phone with my husband and it was all I could do to not break down in tears, and I don't know why. It's like the anxiety of all of this is too much sometimes. I really worry that after Thursday, I'm going to find out that I have six months to live or something. Is that ridiculous of me?? I have no patience any more for these people you see on tv that are crying because they found a great make-up, or lost weight, it's like, you realize what problems are really problems, and I am not even close to what other people are really going through. I know I need to toughen up, but it's hard with Mark away, and not much family or support around here. I just hope the outcome is good. Like I said, I am feeling better that the mammogram and US came out normal, but I'm not sure that matters that much in my case. I read where dense tissue in someone can hide a tumor and a mammo misses it. Wow, I am going on too much today! Sorry for my ramblings, and thanks again for all the info! I am going to call today and find out who they are going to refer me to, and go from there. Maybe I can even find one on my own, through my own insurance company. Thanks again soooo much, and sorry again for going on and on here! Thanks, Val",
      "MessageIndex": 26,
      "PostDate": "13/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Really? Thanks so much for the reply! You've made me feel so much better. It can be scary checking out some of the places you find on the internet, I feel better sometimes about something I read, and then I'll find some sites that say that a big warning sign for cancer is bloody discharge, especially being out of only one breast, and also occuring without having to squeeze the nipple. I think I mentioned that I've had this lumpy area around my nipple, and maybe a little outward from that, it may have grown a bit, but I'm really not sure. I did read where a bloody discharge is a rare symptom of breast cancer, though. My doctor did say that papilloma's are rare, though. He more mentioned some kind of \"in situ\" thing, I'm really not sure of the word. He also mentioned a clogged milk duct. So, anyway, just thanks for the reply, I went out with my family tonight, and was in a much better mood because I read your post before I went. This is just such a scary symptom, and I really am mad at myself that I waited over three years to get another mammogram. I hope everything is ok on Tuesday, he said the radiologist will be talking to me. I have to go on my own since my husband commutes during the week, so I just hope I don't have to deal with bad news on my own, not to be depressing. It's just so hard not to worry, I've never had anything like this. I've had discharge before now and then, especially after stopping breastfeeding, but never bloody. Well, again, thanks so much!!! Val",
      "MessageIndex": 2,
      "PostDate": "02/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "I wish I had! For me, it's been about 31/2 years, which scares me because of course that would be enough time for cancer to spread. But, you think this could be nothing given my symptoms? So so sorry if I'm repeating myself, which I know I am, but anyway, I'm 45, been through menopause early, felt a lumpy area over 3 years ago which is why I had the mammogram, which showed nothing. The lumpy area never really seemed to change that much to me, maybe possibly a little lumpier, but anyway, suddenly just having this bloody discharge. It's only in my right breast, and seems to pretty much come out spontaneously, although the first time I saw it was on my bed clothes, and I suppose I could have been sleeping on my stomach, which I do alot, and I guess I could have been pressing it somewhat. But, last night, it was spontaneously coming out as I was walking around the house, and doing chores, bending over, etc. I'm just so scared this is cancer, but you think it could be something else? Isn't it really bad to have this bloody discharge with a lumpy area? I mean, it seems to me that this is llike definitely cancer, and I'm already thinking of not being around to see my daughter grow up. I tell you, though, like you said, if this is nothing, and I'm lucky enough for that, this is such a wake-up call!! I am sooo stupid!! On last years yearly visit to my GYN--I had the yearly pap and all of that, and he gave me the mammogram order, and I just never went, kept putting it off. Man, it kills me now to think if this is something serious that I could have prevented my family from going through all this pain if I had just gone in last year, when it was probably at an early stage. At my age, and given I've gone through menopause fairly recently, it's unlikely to be something benign, like a papilloma, right? Thanks so much for any help, you guys really make such a difference, I am such a basket case right now....Thanks, Val",
      "MessageIndex": 8,
      "PostDate": "04/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Oh, and sorry, one more thing, I forgot to tell you, my MRI is scheduled for next Tuesday. Do you think that is waiting too long? Thanks, and sorry for the re-post! Thanks, Val",
      "MessageIndex": 18,
      "PostDate": "06/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi!! Thanks so much for the letter, I hope you had a good time camping! I couldn't believe it, but today I called the MRI place to ask if I would be out by 3 p.m. because of an appointment that a teacher at my daughter's school wanted for us, and somehow there was a mistake, and my MRI was actually for today! It was too late for me to come in today, so now it's been rescheduled for Thursday. More waiting! I had called my GYN's office today, and as usual, got the nurse who dosen't seem to know too much. I had been looking up things on the internet last night on MRI's, and had some questions as to whether this is the way to go. Some places suggest that with my symptoms, after the mammo and US, that a ductogram is the next step. They say that MRI's are not really that good for the breast exam, because they have alot of false-positives, and that this causes alot of worry and anxiety, something I don't need any more of. Also, it's just so confusing, because it seems like the mammo and/or the US should have picked up either ductal or the papilloma also, which is weird. Maybe the doctors are thinking of doing the MRI because they have a suspicion that the mammo or US missed a tumor. I was kind of hoping that it was either the papilloma or the dcis, but maybe a tumor still isn't ruled out, because of the percentage of things missed on the tests I've already taken. It's hard to decipher things on the internet, being that there is so much differing opinions, but it seems like the MRI wouldn't be the best thing to look for ductal carcinoma or papilloma, but I don't know. The nurse said today that the ductogram wouldn't work, because I can't express the discharge, and it's too hard to find the duct it's coming from in that instance. I'm just being a worry wart, and borrowing more trouble than I need, I guess. I'm just thinking now that why would they order an MRI unless they think there is an invasive cancer that was missed? Since, from what I understand, MRI is not that great at detecting papillomas or dcis. Or maybe I'm wrong. I'm also worried about the false positive rate, I don't need any more trouble!! I basically just asked the nurse today if I should go to a breast surgeon first, and then see what he wants me to do, but she said that he will want the MRI anyway, so just to do it first. Is MRI becoming more of a tool now for breast imaging? Is it common to request an MRI after a negative mammo and US, in a symptomatic patient? Well, I gues you're not quite rid of me yet! ha ha....just kidding, really I'm sorry for the questions....thanks again so much for all of your help!! Like I said before, I would have been so freaked out about the \"breast surgeon\" suggestion from the doctor had I not been communicating with you, so I can't thank you enough! Well, there is my update! I hope you are doing well! Thanks, Val",
      "MessageIndex": 24,
      "PostDate": "12/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi~~hope all is well with you. Well, I went in for my MRI earlier today, and it never happened! Yikes~I am so mad right now, this all makes me kind of angry because I got so prepared for this. What happened was, I waited all that time today, went in and got the I.V in, and then went to the MRI room. I have anxiety problems, so I was admitedly nervous seeing this machine, and just the sounds it makes, etc. But, I really wanted to get the test done, so I knew I could do it. Anyway, she had me lay on the table like they do, with both breasts in these cup things, and face down, and then she said as I go into the tube, I was going to feel the top of the tube on my back. I didn't like the idea of that, but again, knew I could get through it. I was pretty uncomfortable at that point because the thing I was laying on was really pusing into my ribs. Anyway, she started putting me in, and I was so tight in there, that I was having a hard time breathing, like it was labored. It was so unexpectedly tight on my back that each breath was hard, and I know you're not supposed to move around alot while taking the test, and this was also hard since with each breath, I was laboring with it. I do carry extra weight in my stomach area, and I know this was making it worse. Anyway, after she put me in, I said I had to get out cause I could't breathe, and she took me out. She said that I could reschedule and take some anxiety meds before I come next time. BUT~~my problem is that this wasn't anxiety, it was that I couldn't breathe in there because it was too tight! Now, I just don't know what to do. I called my GYN's office to request that referral to a breast surgeon, figuring I'll just get my mammo and US films, and go to him, and start again from there. Maybe there will be some kind of test I can take in place of the MRI, like a ductogram or galactography (sp?)....or maybe there is a place that has an open MRI. I have heard of those before, I don't know if they work for breast imaging. Now I'm worried that all these delays will make my prognosis worse......I am trying to get the ball rolling with the surgeon, I have a call in right now to get referred. BUT~~it sounds like I am going to need an MRI one way or the other. Which is interesting to me, because this is fairly new as far as a tool for breast imaging, so what did they do before this?? There MUST be some other test. Well, I can understand how people decide they don't want treatment for things they have after time, because really our medical situation in my opinion is just barbaric. Someday people will look back at the tests we put people through, and just say they can't believe it. There were all these old people around drinking gallons of terrible looking stuff for their tests, it's just amazing what people have to do. Well, I feel pretty stupid about this right now, and angry at the same time. I am mad at myself for not just doing it, but I knew that it wouldn't work with me breathing like that. I just wanted to let you know what happened today, and thanks again for all of your help!! Hopefully this will get resolved somehow! My husband was laughing on the phone, saying that he would never fit in a MRI if I couldn't!! Well, talk to you soon! Thanks, Val",
      "MessageIndex": 28,
      "PostDate": "15/09/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    },
    {
      "AuthorID": "ralve",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ralve",
      "Content": "Hi!!! I'm so glad to hear you are doing well, you sound great!! I feel so bad that I haven't been on in a while. Getting back to \"normal\" life, I guess. But, I miss coming on here and talking with you! As you mentioned, lets make sure to check in with each other from time to time, I'm sorry it's been so long for me. Thanks for the wishes for my Mom's birthday! With all the worrying, it still turned out to be a really great weekend! It went very fast, but as it turned out, my Mom found out about the surprise because the car place that my husband purchased her car from sent her up a big packet saying 'thank you for the purchase'. It wasn't too difficult for her to put two and two together! But, it all worked out in the end because since she found out we were coming, she told my brother, who lives about 3 hours away near San Francisco, and him and his wife, and two year old daughter came up for the weekend, and we all just had a great time. My two girls had a great time with his daughter, it was so fun. Also, it gave me a chance to see my Uncle, who has M.S. and hasn't been doing too well lately. Since I've been back home, he went into a convalescent hospital, and so I'm so glad I saw him before I left. I hope to go out there over the Christmas Holidays and spend some time with him. He's an amazing man, he is about 76 years old, and he has had M.S. since he was 25. I've always been really close with him, he's a great guy. You were saying about making the appointment for my US with the regular gyn, right? I didn't know what you meant about saying at this point I'm returning prn or something? I hate to sound stupid, but I wasn't sure what that meant. The surgeon just said basically to make an appointment in a couple months for an us, and I didn't know thinking about it later if he meant with him or the regular gyn. Isn't it weird that I haven't had any more bleeding? It seems like if it was the papilloma, or anything else, that it would be continuing, I don't know. But, in any case, thank you for the advice about contacting my regular gyn to have the us. You are right, it's easy to let it go now that I haven't had any more bleeding, and I have to stay on top of it, even if it's easy and tempting to try to forget about it. I'm so relieved for you that everything went ok with your surgery. I'm glad to hear you're feeling good. Sounds so neat where you live, I'm jealous! I wish we had more of the seasons here. We are in Texas, and it gets cold, but no snow where we are! Mark (my husband) is still commuting from Connecticut, and dreads the winter because of airport delays and all of that. Still, it sounds beautiful up there. I don't know really if I should really encourage him to look for work there, or come back here. He has contacts everywhere now, because of course he used to work here, and now he has lots of people that he knows there, so we could go either way. It's really hard to decide, because this feels like home, and the Northeast is so expensive, and we don't know it at all, but it would be such an adventure to live near NYC. Well, sorry to go on and on here, it's just been a while! How was your Halloween? Ours was good, my 18 year old daugher had a good party, and my 11 year old daughter had fun with trick-or-treating. There were actually pretty good crowds out this year, so I was happy with that! It still isn't like it used to be, though. Again, thank you so much for your help with my bleeding problem. I'll make sure to call for my us appointment. Let me know how you are doing! Thanks, Val",
      "MessageIndex": 40,
      "PostDate": "03/11/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/321103-breast-discharge.html",
      "Title": "Breast discharge 1 2 3"
    }
  ]
}