{
  "AuthorID": "ramonamom",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ramonamom",
  "Posts": [
    {
      "AuthorID": "ramonamom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ramonamom",
      "Content": "I found a tiny lump on the edge of my breast last night and am a little concerned about it. It is so small that I cannot imagine it being much of anything, but I suppose it will need to be checked, just in case. At first I thought it was an insect bite, but then I realized it was under the skin and not on top of it. It is right along my bra line, on the outside edge of the breast tissue. Any thoughts? I have lumpy, bumpy breasts, but have never felt anything like this before. It is hard, like a dry pea. It is not sore or anything, though. Do I need to have this checked out? Thanks, Ramona",
      "MessageIndex": 0,
      "PostDate": "02/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/170880-tiny-lump-breast.html",
      "Title": "tiny lump in breast"
    },
    {
      "AuthorID": "ramonamom",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ramonamom",
      "Content": "Thank you, ladies, for your replies. This has worked out very strangely, actually. I noticed Saturday night that when I poked on it just a bit, some white stuff came out, so I was relieved to think that it was a pimple or something, rather than breast related (although that was an odd place for a pimple). However, as the days went on it got bigger and bigger and became very painful. Last night it woke me up and I had a real hard time getting back to sleep. Sooooo, off to the doc today. Guess what he thinks it is?! An insect bite! I am struggling to think of when I might have been bitten and by what, but I am so very relieved to hear this. I am on antibiotics, as it is infected, and warm compresses 3x a day and I hope and pray that will take care of it. I only wish all of those lumps and bumps that we find could be so easily resolved.... Again, thanks for your input. I DO need to have that yearly exam done that is way past due, though, so maybe this will prompt me to get that done... Blessings to you all, Ramona",
      "MessageIndex": 4,
      "PostDate": "06/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/170880-tiny-lump-breast.html",
      "Title": "tiny lump in breast"
    }
  ]
}