{
  "AuthorID": "reijo",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/reijo",
  "Posts": [
    {
      "AuthorID": "reijo",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/reijo",
      "Content": "I have been called back to have another \"diagnostic mammogram: and am scared to death. On Tuesday of this week I had my annual mammogram. When the Breast Care Clinic called me back I was told that there was a \"Structure change\" in my right breast. She also said that it was possible that it could have been just a \"bad\" picture. I noticed when my right breast was compressed that it didn't seem to be a very hard compression and I mentioned to the technician that they must have gotten new equipment. I have always had breast problems......soreness, fibrocystic breasts, cyst aspiration, etc. but no biopsies. Has anyone out there had this \"structure\" problem (whatever that means). I absolutely hate these tests. Not because of any pain during the tests but because I always fear a problem. My appointment is Monday at 10:30AM and I am going to have a horrible weekend even though I'm trying really hard to not let it bother me. Thanks for listening.",
      "MessageIndex": 0,
      "PostDate": "25/02/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/256850-structure-changes-breast.html",
      "Title": "Structure changes in breast"
    },
    {
      "AuthorID": "reijo",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/reijo",
      "Content": "Just an update..........I had the \"spot compression\" done this morning. They wanted to do a third one which was not a compression (thank goodness). All ended up being okay. ElenaK, it was just as you mentioned. One the breast was flattened out the suspicious area went away. The radiologist told me that it was the fibrocystic problem that I had. Also AlanaK, thanks for the suggestion that I take some Iboprophen ahead of time. I believe that it helped. Only one of the compressions was really uncomfortable. I appreciate the two posts. Thanks for caring.",
      "MessageIndex": 3,
      "PostDate": "28/02/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/256850-structure-changes-breast.html",
      "Title": "Structure changes in breast"
    },
    {
      "AuthorID": "reijo",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/reijo",
      "Content": "Singer1, I am 56 years old and have had fibrocystic breasts for at least 30 years. I noticed my first \"lump/cyst\" when I was 26. I panicked!!!! I had a baseline mammogram then. It was nothing and I have been thru many since then that have been nothing. My doctor told me that unfortunately I had \"lumpy\" breasts and that a palpation that he could do was not a good test due to the inconsistencies. He said that the only way to be sure was with a mammogram. I have had annual mammograms since I turned 40 (I believe) but had a couple between age 26 and 40. Have also had several ultrasounds. The only was you can be sure is to have this test. I can't even tell much thru monthly exams myself because they're lumpy and I ALWAYS feel something new. I was just called back in this past Monday to have a diagnostic mammogram done because of \"structure\" changes that had shown up. Thankfully all was okay. If you are concerned and if there is a breast care specialist in your city, you might want to go to that doctor for a second opinion whan one warrants.",
      "MessageIndex": 2,
      "PostDate": "01/03/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/257844-how-many-you-have-fibrocysic-breasts-no-problems.html",
      "Title": "How many of you have Fibrocysic Breasts with no problems?"
    },
    {
      "AuthorID": "reijo",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/reijo",
      "Content": "You're right. But.....the key is to have a doctor who RECOGNIZES that you have \"problem breasts\" and says that while he can't tell much that you absolutely need to have mammograms and/or ultrasounds EACH and every year or more often if you find something abnormal. Some doctors, I understand, just attempt to determine by \"feel\" whether or not you are okay. NOT GOOD! Get the mammogram each year.",
      "MessageIndex": 4,
      "PostDate": "02/03/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/257844-how-many-you-have-fibrocysic-breasts-no-problems.html",
      "Title": "How many of you have Fibrocysic Breasts with no problems?"
    },
    {
      "AuthorID": "reijo",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/reijo",
      "Content": "God bless those of you going through this terrible disease. My prayers are with you and I know that there are miracles and pray that a miracle will touch your life. My thoughts are with your families as well. Please take care and keep a positive attitude.",
      "MessageIndex": 6,
      "PostDate": "04/03/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/238096-progression-breast-cancer.html",
      "Title": "Progression/Breast Cancer ??? 1 2"
    },
    {
      "AuthorID": "reijo",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/reijo",
      "Content": "I'm a little confused about what was said but I CAN tell you that when I've had mammograms that didn't show my cysts (which were aspirated and were fine) they did an ultrasound because I felt the \"lump\". The ultrasound found the lump. I was told that ultrasounds are better than mammograms! Don't know for certain, never checked it out further. I just felt better knowing that it did \"find\" my cyst and it wasn't just in my head.",
      "MessageIndex": 1,
      "PostDate": "04/03/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/258535-had-my-mammogram.html",
      "Title": "had my Mammogram...."
    },
    {
      "AuthorID": "reijo",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/reijo",
      "Content": "I can understand the fear that you're going thru. I've been there but NOT while trying to study for finals. While it's probably nothing it's always best to check anything new out. You're young and that's on your side. Please give us an update and I'm going to say \"try not to worry\" but I know you will..............I would too.",
      "MessageIndex": 1,
      "PostDate": "28/02/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/257709-doc-found-lump.html",
      "Title": "Doc found a lump :("
    }
  ]
}