{
  "AuthorID": "renko",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/renko",
  "Posts": [
    {
      "AuthorID": "renko",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/renko",
      "Content": "I'm so happy for you. Now stop and smell the roses and enjoy your life each day and live. God bless you.",
      "MessageIndex": 7,
      "PostDate": "04/05/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/899276-will-not-give-biopsy-results-phone.html",
      "Title": "Will not give biopsy results on the phone"
    },
    {
      "AuthorID": "renko",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/renko",
      "Content": "Hi, I know you must be anxious and worried but you will know tomorrow so try to find something for you to relax and have peace. I would suggest that you take someone with you that you can be with and that can listen to the doctor and write things down for you because it is a shock to our emotional system and many times you don't hear what the doctor is saying. I had breast cancer 12 years ago and had chemo and radiation and I'm still here by the grace of God and many prayers. God bless you and know that many go before you and have survived. Do all you can do and leave the rest in God's hands.",
      "MessageIndex": 2,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/899276-will-not-give-biopsy-results-phone.html",
      "Title": "Will not give biopsy results on the phone"
    },
    {
      "AuthorID": "renko",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/renko",
      "Content": "I had a 3.5 cm lump in my breast found by an mammogram. My doctor did a core biopsy and not a needle biopsy. Do you know how large your lump is and if he is doing a needle or core biopsy. Read books on breast cancer and get knowledgeable and bring someone with you when you see your doctor to take notes. It is very scary to hear that you have a lump but many times the biopsies are benign. I hope yours is. Mine was cancer and I had to have chemo and radiation. It was manageable and if gotten early it is good. It has been over five years and I am thankful to be healthy. Best wishes.",
      "MessageIndex": 1,
      "PostDate": "05/08/2014",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/986828-lump-breast.html",
      "Title": "Lump in the breast"
    },
    {
      "AuthorID": "renko",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/renko",
      "Content": "Hi, I think I would get a second opinion and find a breast specialist so you can have peace of mind. I had breast cancer and caught it early. Be sure to make an appointment with someone else to get a better grasp of what you can do. Thank you",
      "MessageIndex": 1,
      "PostDate": "21/07/2016",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/1022931-frightend.html",
      "Title": "Frightend!"
    },
    {
      "AuthorID": "renko",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/renko",
      "Content": "Hi, you are so right about being unacceptable when people especially doctor's offices don't call you back. It makes me furious and I think you should not stop trying to get through. This is serious and you have a history in your family of breast cancer and even if you didn't, they should arrange for you to come in and check on it or get an ultrasound or test to make sure it isn't cancer. You need peace of mind. I had a lump on my right breast that was discovered after a mammogram and it was cancer so please don't give up. Be persistent and keep calling. Or get another doctor who will call back and listen to your concerns. Best wishes.",
      "MessageIndex": 3,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/875638-does-anyone-respond.html",
      "Title": "Does anyone respond?"
    }
  ]
}