{
  "AuthorID": "rushell",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/rushell",
  "Posts": [
    {
      "AuthorID": "rushell",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/rushell",
      "Content": "I'm really sorry to hear about your step-mother. I'm even more sorry to hear that the chemo & radiation aren't working. During and after chemo and radiation, the bodies immune system can be pretty worn out. Different things can be effected by that, such as the blood not being able to clot very well sometimes. These are questions you might want to ask either her dr. or even your own dr. could probably give you a better answer. I wouldn't want to give you any info on something like that when i'm not sure of it. Again, I just wanted to say i'm sorry to hear how sick she is and I hope she feels better soon.",
      "MessageIndex": 1,
      "PostDate": "11/08/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/418086-bloody-nose.html",
      "Title": "bloody nose"
    },
    {
      "AuthorID": "rushell",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/rushell",
      "Content": "diane, just a couple of questions. Where exactly is your pain and how long have you had it? And also, how long have you been taking the hormone pills? I finally got some hydrocortisone cream for the itching yesterday and my dr. said that if it is not completely gone by sunday to come right back in. He seemed more concerned about the itch than anything?!? Anyway, i've also noticed a few little blister-like spots around my areola and my nipple has just started to hurt. (like someone pinched it REALLY hard.) I'm still waiting for my app. with my surgeon so i'm really interested in whet happens at your app. today. My dr. said that my mammo and ultrasound show the cysts and said they appear benign but still wants to do the biopsy anyway. He said that you can still have benign cysts and have ibc. As for our weather here, had alot of thunderstorms lately but it's really nice today, no humidity and 20 degrees. a little like fall in the air.....fresh. I'll be looking tonight to see how your app. went. I'm hoping the best for you. tc......rushell",
      "MessageIndex": 5,
      "PostDate": "11/08/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/399914-inflammatory-breast-cancer-important-question.html",
      "Title": "Inflammatory Breast Cancer-Important Question!!!"
    },
    {
      "AuthorID": "rushell",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/rushell",
      "Content": "diane, recently I have had a similar experience both with lumps and itching. I also find that my breast tends to feel fevered a bit but it is not any larger. My dr. also said that because of my symptoms, he wants to check for ibc.My next step is a biopsy, which i'm sure is the next step in your case too. They will either do a needle aspiration or take a small sample of the lump and test it. The surgeon will decide which is more preferable. Be glad that they are paying attention. You seem to be in good hands. Do what needs to be done, that way you are not wondering \"what if\".......lots of hugs. rushell",
      "MessageIndex": 3,
      "PostDate": "10/08/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/399914-inflammatory-breast-cancer-important-question.html",
      "Title": "Inflammatory Breast Cancer-Important Question!!!"
    }
  ]
}