{
  "AuthorID": "sadwife",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sadwife",
  "Posts": [
    {
      "AuthorID": "sadwife",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sadwife",
      "Content": "Hello dre22 I had the same problem in my late twentys. The doctor that cared for me had been my doctor for many years. I had breast cancer in my family. He took blood work, gave me antiboitics and wrote it off to some bazarre thing that was happening to me. I excepted his explanation because I trusted him. The problem kept occuring, and he kept assuring me that I was too young to have breast cancer. Again, I trusted him. When I was 31, I took it upon myself to go and have a mamogram done. There was a tumor in my breast. The guy that did my examine told me to find a surgeon immediately. When I met with the surgeon, We decided that since the problem had lasted for the past 4 years, that we removed my whole breast. Here I was, newly engaded and I was about to loose my breast and go through 14 months of therapy. It was not at all fun! Don't be a statistic like I was. All of you ladies need to stay on top of your health. Do weekly breast exams and always trust your gut instinct. You know your body better than anybody does. Take Care!",
      "MessageIndex": 3,
      "PostDate": "09/06/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/180552-nipple-discharge-worried.html",
      "Title": "nipple discharge....Worried!"
    },
    {
      "AuthorID": "sadwife",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sadwife",
      "Content": "Kalie God Bless you girl! I was diagnosed at 32 with stage 3! How have you been since?",
      "MessageIndex": 4,
      "PostDate": "09/06/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/180585-mammogram-mandatory-get-biopsy.html",
      "Title": "Is a Mammogram Mandatory to get a Biopsy??"
    }
  ]
}