{
  "AuthorID": "shaggy41",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/shaggy41",
  "Posts": [
    {
      "AuthorID": "shaggy41",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/shaggy41",
      "Content": "Thank you for the well wishes... I had a very positive conversation with my daughter today, she is not worried and said \"Mom it is what it is and no matter what it is this it's all happening for a reason.\" She is a strong kid...always has been. She said that maybe it's all happening to her so she can help someone else through tough times some day. She is a great kid! Like my daughter said to me...hopefully it will all be good news but if it isn't we will deal with it when it happens and we will work through it... She is right...positive thinking and a good attitude is the best way to get through any problem or worry!",
      "MessageIndex": 3,
      "PostDate": "11/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/524354-teenage-daughter.html",
      "Title": "Teenage Daughter"
    },
    {
      "AuthorID": "shaggy41",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/shaggy41",
      "Content": "Hi, I'm new at this message board thing a friend suggested I give it a try for advice and support. Can teenager get breast cancer? My 16 year old daughter found a lump in her breast. I took her to her gyno about a week ago, the gyno was concerned and sent her for an ultrasound, the ultrasound didn't really show anything because my daughter is so young and very dense. Within 2 days she was at a breast specialist! The breast specialist before examining my daughter stated it was not unusual for young girls to have breast lumps, usually due to hormonal changes. She then examined my daughter...the look on her face was that of surprise. She explained that my daughter had a solid mass and it needed to be removed immediately. She also explained that is was rare for young girls to have breast cancer but it can happen. She stated that we should be concerned but not alarmed. ???? I'm alarmed... My daughter has had many medical problems overs the years...age 3 kidney disorder, age 11 hypothyroidism, many menstrual problems, heavy bleeding, extended menstrual cycles, cysts on ovaries, after her tonsils were removed she became very sick with a severe infection, age 16 she had her gallbladder removed because it was only functioning at 8%. She has been through a lot and most of it not typical until later in life. My grandmother died of breast cancer and 2 of my daughters grandparents died of cancer at a young age. How rare is it for a young girl to have breast cancer? Has anyone know of any cases? My daughter is scheduled to have the lump removed this week...of course the waiting is killing me.",
      "MessageIndex": 0,
      "PostDate": "11/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/524354-teenage-daughter.html",
      "Title": "Teenage Daughter"
    },
    {
      "AuthorID": "shaggy41",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/shaggy41",
      "Content": "Thank god that's all it was. If I were a betting woman I would lean towards my daughter having the same. Then I look at her medical history I get a little nervous. Now we just play the waiting game.",
      "MessageIndex": 5,
      "PostDate": "12/08/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/524354-teenage-daughter.html",
      "Title": "Teenage Daughter"
    }
  ]
}