{
  "AuthorID": "Sharbear",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Sharbear",
  "Posts": [
    {
      "AuthorID": "Sharbear",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Sharbear",
      "Content": "What if they do an Ultra sound and say that they do not see anything? Does that mean not to worry?",
      "MessageIndex": 14,
      "PostDate": "29/06/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24691-just-got-results-first-mammo-am-little-scared.html",
      "Title": "Just got results from first mammo - am a little scared... 1 2"
    },
    {
      "AuthorID": "Sharbear",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Sharbear",
      "Content": "Hello All, I am a 30 year old woman. I am so worried right now. The last couple of months I have felt a large thickning in my right breast. I ignored it at first, until recently I went to my family Doctor. The Doctor felt it also. I went for a mammo and ultra sound. The doctors office called on Friday and said that they are referring me to a surgeon for a biopsy. They said that the radiologist said that \"a biopsy is indicated\" The nurse said that it may be just fibro somethings. If that is the case why the biopsy? Does the biopsy hurt? Will I have to miss work? I am worried, my Mom and both Grandmothers have had breast cancer and my Mom and one of my Grandma's had mastectomies. I have not asked my Mom any questions or even told her about this, because I do not want her to worry. Also my lump does not hurt, is that a good or bad sign? Please be honest with me. One other thing, the side that has the lump, the breast is larger than the other side. Actually it has always been, but recently I notice that it is even larger, and no I have not gained weight. I have to wait for 3 long weeks befoe I am able to see the surgeron. Someone please respond to my post! Thanks so much! Sharri",
      "MessageIndex": 0,
      "PostDate": "21/10/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24605-breast-lump.html",
      "Title": "A breast lump"
    },
    {
      "AuthorID": "Sharbear",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Sharbear",
      "Content": "I have read on here that some people have \"fibrocystic breasts\" What is that? Is it painful and what is done to take care of it? Sharri",
      "MessageIndex": 0,
      "PostDate": "21/10/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24607-fibracystic.html",
      "Title": "Fibracystic"
    },
    {
      "AuthorID": "Sharbear",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Sharbear",
      "Content": "HI, THANKS SO MUCH FOR YOUR REPLYS. YOU HAVE BEEN VERY HELPFUL TO ME. THANKS SO MUCH. MY APPT WITH THE SURGEON IS NEXT FRIDAY (THE 9TH) I WILL LET YOU KNOW WHAT HAPPENS. I HOPE THAT IT IS NOTHING. I HAVE BEEN THROUGH SO MUCH THE LAST COUPLE MONTHS. I JUST HAD MAJOR SURGERY ON MY JAW. I WAS IN THE HOSP FOR 11 DAYS, AND JUST WENT BACK TO WORK ABOUT 2 WEEKS AGO AFTER BEING OFF FOR 2 MONTHS. I ALREADY HAVE TO TAKE TIME OFF WORK EVERY WEEK TO FOLLOW UP WITH THE MAXIOFACIAL SURGEON AND NOW THIS, UGH! ANYWAY, HOPE THAT YOU ARE DOING WELL AND THANKS AGAIN FOR ACKNOWLEDGING MY POST.",
      "MessageIndex": 2,
      "PostDate": "02/11/2001",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24607-fibracystic.html",
      "Title": "Fibracystic"
    }
  ]
}