{
  "AuthorID": "shellak",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/shellak",
  "Posts": [
    {
      "AuthorID": "shellak",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/shellak",
      "Content": "Hey everyone. I'm really afraid that I may have Paget's disease. For the last month my left areola and nipple have been itchy and very scaly. I went to my gyn and she did an exam and said it looked like a yeast infection. I have not nursed a baby in 5 years. She gave me a script for antifungal oral meds. I have been taken the meds for the last 20 days. No change. I had a diagnostic mammogram and ultrasound. Both were negative. I have made an appointment with a dermatologist and I have a follow-up with my gyn. Both are two weeks from today (1/12/07). What scares me is that (a) it's only the left nipple and areola and (b) that it seems to be getting more scaly and more itchy. I am itching now into my left armpit. Has anyone ever had the same symptoms? Could it just be eczema? Help.",
      "MessageIndex": 0,
      "PostDate": "12/01/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/462084-pagets-i-am-so-scared.html",
      "Title": "Paget's? I am so scared!"
    },
    {
      "AuthorID": "shellak",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/shellak",
      "Content": "Hey there. Thanks for the encouragement. I have been making myself nuts for weeks. I'm irritated too, that I have to wait until the 23rd to see my dermatologist. I see my gyn on the 25th. I am defintely asking for a scatch biopsy from the dermatologist just to rule out cancer at all. I'm not sure if I have eczema. Maybe I do. There are so many different types. I'll find out next week. Did you think you had Paget's or was it something else? I'd really like to hear. My name is Michelle by the way. Well, I have to get to my daughter's basketball game. I will let you know what's going on when I find out. Talk to you soon. Michelle",
      "MessageIndex": 2,
      "PostDate": "14/01/2007",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/462084-pagets-i-am-so-scared.html",
      "Title": "Paget's? I am so scared!"
    }
  ]
}