{
  "AuthorID": "SLJ16",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/SLJ16",
  "Posts": [
    {
      "AuthorID": "SLJ16",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/SLJ16",
      "Content": "I'm having a needle localization and a breast biopsy done on Monday. I'm very nervous. Can anyone share their story with me? I have a very very small lump in my right breast that my Doctor thinks is benign but he still wants to take it out due to my family history. I'm having the needle localization done before the surgery. Please share your stories...",
      "MessageIndex": 0,
      "PostDate": "05/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "SLJ16",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/SLJ16",
      "Content": "Thank you so much for responding. I'm terrified to say the least. I am being put to sleep for the biopsy after my needle localization. I have the option of being awake and having the \"twilight drug\" (spelling) but I think I might be better off fully asleep. I'm glad that your needle localization went well for you. I hope you are OK. You didnt find the biopsy to be bad? Whatever it is, it is very very small and I'm having the whole thing taken out of my breast. My doctor said it's more than likely benign, he just doesnt want to leave it in there. I'm very nervous. I really appreciate you sharing your story with me. and you did not scare me.",
      "MessageIndex": 4,
      "PostDate": "07/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "SLJ16",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/SLJ16",
      "Content": "Thanks for responding Sid. I'm going to be asleep when the Dr. takes it out after the needle localization. It's all very scary. I really appreciate you sharing your story with me. It helps.",
      "MessageIndex": 2,
      "PostDate": "06/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "SLJ16",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/SLJ16",
      "Content": "i found out today that my biopsy results are cancer. i'm 26 years old and i'm freaking out. the first thought that came to mind is am i going to die? i need some advice. my mom had breast cancer when she was 46. she's fine now. cancer free. i'm scared...so scared.",
      "MessageIndex": 8,
      "PostDate": "14/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "SLJ16",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/SLJ16",
      "Content": "Thanks ABGirl. I am a little nervous. I can't wait for it to be over to be honest. I am such a baby about these things. I'm so nervous to be put to sleep. I really appreciate your story! thanks so much.",
      "MessageIndex": 6,
      "PostDate": "08/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "SLJ16",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/SLJ16",
      "Content": "I don't really know much. I\"m meeting with the surgeon today. He really freaked me out yesterday. He told me i'll probably need another surgery and i'm not going to die. but how can you really think you arent. i'm only 26 years old. and this is killing me right now. i'm trying to stay positive. i have a mother who fought cancer at 46 and won! i just hope i'm as lucky. i won't really know much until after today. i'm nervous.",
      "MessageIndex": 11,
      "PostDate": "15/12/2006",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/452021-needle-localization-biopsy.html",
      "Title": "Needle Localization/biopsy 1 2 3"
    },
    {
      "AuthorID": "SLJ16",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/SLJ16",
      "Content": "i'm not an expert but my mother is a breast cancer survivor. she had a double mastectomy. i remember her saying that even though she had the mastectomy she could still get cancer in the walls of her chest. my mother was 48 when she was diagnosed and her dr. felt that the mastectomy would help my mother beat cancer. she too had a small lump in her right breast. then they found something in her left. so just to be safe she went ahead and had the double mastectomy. if you have any other questions i could ask her for you.",
      "MessageIndex": 1,
      "PostDate": "18/01/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/243630-mastectomy-really-necessary-what-do-you-think.html",
      "Title": "Is a mastectomy really necessary? What do you think?"
    }
  ]
}