{
  "AuthorID": "Stop my mind",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Stop my mind",
  "Posts": [
    {
      "AuthorID": "Stop my mind",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Stop my mind",
      "Content": "I would take your daughter to a breast cancer specialist..There is a common type of tumor in girls her age called Phyllodes tumors..they are very rare and also are very rarely malignant...But if they are malignant, they are very fast growing , fast spreading and do not respond to chemo or radiation. Most often tho, in girls her age, they are benign and just need to be removed as they can grow quite large and become very painful!! Also because they are such a rare type ( I had one also) there really isnt alot known about them for sure and many Drs believe different treatments are appropriate. Most Drs do recommend surgery tho just because they dont really know...I would advise doing some research on phyllodes tumors from a reputable site like Nationa; Cancer Institute web site. I wish you all the best!! If I can help in any other way, please let me know..altho Im not a Dr, I researched this topic so much, I should be one lol Take care",
      "MessageIndex": 1,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/868791-12yr-old-very-large-left-breast-cyst-very-sore.html",
      "Title": "12yr old, Very Large Left Breast Cyst & Very Sore"
    },
    {
      "AuthorID": "Stop my mind",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Stop my mind",
      "Content": "Unfortunately, it is true...you need to be your own advocate and never assume because Dr hasnt returned call that everything is fine...I have learned that some Drs will call you faster regarding an overdue bill than they will for a terminal illness..BE PERSISTENT...even change Drs if you have to..its your right to get efficient and prompt care in a situation like this..It is also your right to get as many opinions that you want or need in order for you to feel comf about what is going on..I would advise...studying!! along with being persistent..You dont want to depend on anyone to tell you everythings fine and believe themm read your reports and if u dont understand them, somehow get the answers you need..I wish you the best!! Full force ahead!! Go to office if u have to!! Good luck!!",
      "MessageIndex": 4,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/875638-does-anyone-respond.html",
      "Title": "Does anyone respond?"
    }
  ]
}