{
  "AuthorID": "sueinoz",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sueinoz",
  "Posts": [
    {
      "AuthorID": "sueinoz",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sueinoz",
      "Content": "Hi Jillian I know exactly how you feel as I am going through the same thing myself. I saw a breast surgeon 2 weeks ago and have to wait until Thursday of next week for scan guided needle biopsy. My mammogram said \"sharply defined lesion on intra-mammary lymph node\". I was totally freaked out as my 57 yr old mother had a doulbe masectomy 1 year ago and her mother died from breast cancer at 49. I am 39. I didn't like the sureons attitude at all and felt as though he trivialised my fears. I am not happy about having a needle biopsy, given my family history I would much rather have a lumpectomy. I also think that because I was near the end of my cycle when I saw the surgeon that the lump was less defined because my breast were very \"full\" and I also suffer from cysts. I can't tell you how concerned I am and I am actually thinking of going to my nearest capitol city (1300 kms away) and hving this dealt with there. I wish you all the best for your situation and please let us know how you go. Sue.",
      "MessageIndex": 2,
      "PostDate": "12/06/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/181465-what-odds-your-opinion.html",
      "Title": "What are the odds in your opinion?"
    },
    {
      "AuthorID": "sueinoz",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sueinoz",
      "Content": "I have been having yearly mammograms for some time now because I have \"lumpy breasts\" All of my past mammograms have just shown cysts. Last year I had 9 in one side and 13 in the other. I am just about to turn 39yrs old. Last year my birth mother had a double masectomy. Today when I had my mammogram the results read........... Ther is a sharply defined lesion almost 1cm diameter in the superior aspect of the left breast. Its appearances suggest that it maybe an intra-mammary lymph node rather than a breast tissue lesion. I couldn't get into my doctor this afternoon and I am going to worry all night. If there is someone out there that could explain this to me I would appreciate it. I know you are not doctors but maybe someone could help me out. Thanks so much Sue",
      "MessageIndex": 0,
      "PostDate": "28/05/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/177720-help-understanding-mammogram.html",
      "Title": "Help understanding mammogram"
    },
    {
      "AuthorID": "sueinoz",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sueinoz",
      "Content": "Hello Gemini I had my appointment today with the surgeon at the hospital breast clinic and I am no happier now than I was this time last week after getting my mammogram results. Like you, I seem to be the only one concerned about this lesion. My family history tells me that I should be concerned.......... birth mother (I was adopted) DOUBLE mascectomy one year ago at 58yrs old..........maternal grandmother breast cancer at 47 died at 49. Surgeon said he's not that concerned, but has ordered an ultra-sound and possible fine needle biopsy but can you believe that I can't get that done until the 17th June and my next breast clinic appointment isn't until the 25th JUne!!!!!!!!!! How am I supposed to sleep and function normally until then? As you can imagine my family history is of major concern to me. I will keep you posted and thankyou for your post. Sue",
      "MessageIndex": 2,
      "PostDate": "03/06/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/177720-help-understanding-mammogram.html",
      "Title": "Help understanding mammogram"
    }
  ]
}