{
  "AuthorID": "Suktanker",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Suktanker",
  "Posts": [
    {
      "AuthorID": "Suktanker",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Suktanker",
      "Content": "I am 28, healthy female, no history of breast or any other cancer in family. i recently found a lump and got my physical done. doctor wrote this on the report \"prominent areolar duct in the right breast, vague cyst in the left\" and asked me to get mammogram and ultrasound done. i have heard that the doctors could tell that the cyst is normal and wouldnt you send you forward with the diagnostic procedures my cyst was not correlated to my cycle and it does hurt and feels tender. the location seems to be right-upwards. I have bumpy breast tissue and hard for me to find cysts and lumps i am scared right now and can barely put my thoughts together thanks for helping",
      "MessageIndex": 0,
      "PostDate": "11/09/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/917993-prominent-areolar-duct-scared.html",
      "Title": "prominent areolar duct? scared"
    },
    {
      "AuthorID": "Suktanker",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Suktanker",
      "Content": "Hi Sharon First of all thank you for your response! Here is what happened: The doctors refused to do a mammogram on me saying I am too young for it plus no history. The nurse there did a very thorough physical examination. Much more than my PCP did. She found that small lump near my areola that I had found but not the ducts that my doctor had found. Then I got ultrasound done on my breasts and the radiologist said she found absolutely nothing in my breasts and the small lump was a sebaceous cyst under my skin. I am relieved but will keep checking on my breasts regularly.",
      "MessageIndex": 3,
      "PostDate": "14/09/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/917993-prominent-areolar-duct-scared.html",
      "Title": "prominent areolar duct? scared"
    },
    {
      "AuthorID": "Suktanker",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Suktanker",
      "Content": "To add to my above posting, I find a pea size lump under one of my Montgomery glands that was painful initially but not hurting at all now. I can't tell if it moves or not. Doctor didn't find in the physical exam but now that I think of it, I don't think she checked that area during physical exam at all. I think she just touched on the sides.. I hope I am pasting in the right forum..",
      "MessageIndex": 1,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/917993-prominent-areolar-duct-scared.html",
      "Title": "prominent areolar duct? scared"
    }
  ]
}