{
  "AuthorID": "sunberry",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sunberry",
  "Posts": [
    {
      "AuthorID": "sunberry",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sunberry",
      "Content": "I have all my fingers and toes crossed for you that it comes back negative I know when I was waiting I prepared for the worst and was convinced I had it, so it was amazing news to find out I didn't. Whatever the outcome if you need an ear please feel free to PM me. Big love S x",
      "MessageIndex": 3,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/870501-brca-1-test.html",
      "Title": "BRCA 1 test"
    },
    {
      "AuthorID": "sunberry",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sunberry",
      "Content": "Hi Emma, Although my situation is slightly different I do know what you are going through. It was discovered my mother has the BRCA1 gene after she had breast cancer in her early 40s. This meant I didn't have to jump through any hoops and could get tested if I wanted. I had the test earlier this year and like your sister my test came back negative . My little sister has also chosen to get tested and we are currently awaiting her results (fingers crossed)! It's a big decision to get tested, and I guess it depends on you personally and your situation. You should be able to speak to a genetic counsellor who will run thorugh the pros and cons of getting the test. Although I'm in the UK so this may be different. I don't know if you know the stats but with BRCA1 there something like an 80% chance of developing BC and 65% chance of developing ovarian cancer. I don't know if your IVF therapies put you in a higher risk bracket, but I do know I wasn't allowed to be on certain birth control due to the increased risks. Personally, I chose to get the test done as I want kids and would have gone through IVF genetic screening if my results had come back positive. Also, the regular screening missed my Mum's lump (due to a number of reasons) so my faith in the \"watch and wait\" system is rather tarnished so I would have undergone preventative surgery once I hit my late 30s. Anyway to answer your question, if your sister had the test then there is a president set already, there is paperwork already in the system and they have been through your family history and should also know which genes they should be checking for. I'm afraid insurance-wise I don't know whether this is covered, I remember living in the US and finding medical insurance a nightmare to navigate! There is also the risk of not being able to get insured or pay higher premiums if you test positive. Also if you test positive and already have kids they will need to think about getting tested when they're older. Gosh this is a long post and I hope you're still with me but it's such a strange situation to be in and I found the only other person to understand was my sister, can you talk to yours? (I now worry mine will test positive and I'll feel guilty for testing negative - but it really is just a toss of a coin). Anyway if you have any more questions please just ask and I'll do the best I can to answer them. There are also some great support forums out there and more and more research is being done and new screening methods are getting better all the time. All the best S x",
      "MessageIndex": 1,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/870501-brca-1-test.html",
      "Title": "BRCA 1 test"
    }
  ]
}