{
  "AuthorID": "survivor9",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/survivor9",
  "Posts": [{
    "AuthorID": "survivor9",
    "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/survivor9",
    "Content": "Quote: Originally Posted by SweetClarity I had a lumpectomy 29 May of this year. I'm 58. Tumor was 4cm, clear margins, nodes negative. I did external beam radiation and was placed on Arimidex. This drug, while being touted as the new \"gold standard\" for BC, is driving me crazy! My hands and feet look like balls...I've gained 25 pounds and am more depressed than ever. Also, big time joint, back and muscle pain! The most frustrating part, is that my Onc. tells me...\"but this drug does NOT have those side effects\". The point being, if you think this is bad, you should take Tamoxifen. I’m am so sick of not being able to find any feedback on this drug because, while Tamoxifen has been around for years, and those horror stories are readily available, Arimidex nightmares are hard to find on message boards. Excuse me!???? Because I have BC does not mean I'm delusional! Wondering...anyone else with these symptoms?? Thanks, Cheryl Cheryl, I have also had trouble with Arimidex and am going off of it. Because of the quality of life issues it has caused, I will also not take any other adjuvant hormonal therapy since they all affect the estrogen levels severely enough to cause these problems. I was told that Arimidex has far fewer and milder side effects than Tamoxifin, so I have no incentive whatsover to try Tamoxifin! Arimidex caused 10-12 severe hot flashes per day (I logged them), with rolling sweat, heart palpitations, and a related surge in anxiety from the rapid heartbeat. The flashes woke me up at least 3-4 times per night, causing a chronic sleep deprivation problem. As this went on, depression kicked in and deepened, despite being on an SSRI prescribed by my oncologist to try to control the hot flashes. Besides the SSRI, I have tried black cohosh, vitamin E, and Neurontin, an anti-seizure drug occasionally prescribed for breast cancer patients having trouble with side effects from Arimidex and other hormonal therapies. My body is telling me it does not like this drug, and I am listening to my body now. I have not made this decision lightly - it's a tough one. What I am finding in my reading is the trivialization of side effects from Arimidex by the writers, including the doctors quoted on this web site in the program \"Hormonal Therapy - Do Side Effects Matter\". I do not consider side effects which affect every aspect of my waking and sleeping life to be 'minor' or inconsequential. I think the side effect problem with this drug is being underreported or discussed dismissively in the literature. Perhaps patients think they just have to live this way and they have no choice in the matter. We all have choices. In many aspects of life, including breast cancer, the choices are not easy. All the best, Survivor9",
    "MessageIndex": 1,
    "PostDate": "21/03/2004",
    "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24763-arimidex.html",
    "Title": "ARIMIDEX"
  }]
}