{
  "AuthorID": "sydney51",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sydney51",
  "Posts": [
    {
      "AuthorID": "sydney51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sydney51",
      "Content": "Hi lou When you are ready good book to read is Dr. Susan Loves Breat Book. It explains everything. Good Luck Sydney",
      "MessageIndex": 3,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/568805-mastectomy-reconstruction.html",
      "Title": "mastectomy/reconstruction 1 2"
    },
    {
      "AuthorID": "sydney51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sydney51",
      "Content": "Has anyone had recontructive surgery? I am having a mastectomy and thinking about doing the flap for reconstuction. Would like to know what to expect the day of and days after. any help?",
      "MessageIndex": 0,
      "PostDate": "14/01/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/568805-mastectomy-reconstruction.html",
      "Title": "mastectomy/reconstruction 1 2"
    },
    {
      "AuthorID": "sydney51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sydney51",
      "Content": "Thanks Leea, I have decided to do the DIEP flap. My surgery is scheduled for March 10th. Just one question. How was your range of motion a few days after surgery (arms)? Will keep you posted on progress after surgery. thanks again Sydney",
      "MessageIndex": 5,
      "PostDate": "31/01/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/568805-mastectomy-reconstruction.html",
      "Title": "mastectomy/reconstruction 1 2"
    },
    {
      "AuthorID": "sydney51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sydney51",
      "Content": "Hi Jojo; Thank you very much for the information. I am now scheduled for May 2. Just a couple more questions..Are the drains very uncomfortable and does the pain come from the skin stretching or from the muscle? Is sleeping difficult because the expanders are hard. I always sleep on my side. Thanks again and all the best to you Sydney",
      "MessageIndex": 11,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/568805-mastectomy-reconstruction.html",
      "Title": "mastectomy/reconstruction 1 2"
    },
    {
      "AuthorID": "sydney51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sydney51",
      "Content": "Hi Jojo; Things have changed for me now because of spots on my lungs which they cannot determine yet if it is cancer so I can not have the diep flap but they are suggesting expanders with saline implants. I am having a double mastectomy and then the expanders next week. Can you tell me what to expect when I wake up from surgery and how the expanders feel while being filled each time. Everyone says they are very uncomfortable but in which way? thanks Sydney",
      "MessageIndex": 7,
      "PostDate": "28/03/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/568805-mastectomy-reconstruction.html",
      "Title": "mastectomy/reconstruction 1 2"
    },
    {
      "AuthorID": "sydney51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sydney51",
      "Content": "Hi Jojo; thank you so much for responding. I hope all is welll with you now. I have a couple of other questions.. I am having trouble visualizing what my breast will look like after the expandera are put in. Will they be swollen from the surgery or are they relatively flat. Can you where a bra at all while being filled? Does the saline feel and move like a normal breast? And when you say hard ..are they like a balloon? Sorry for all the questions but haven't been able to really get a clear picture from the web sites. Also I am moving at the end of June so I was wondering since you had a tight time frame..how often did you get filled. Thanks again Sydney",
      "MessageIndex": 9,
      "PostDate": "29/03/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/568805-mastectomy-reconstruction.html",
      "Title": "mastectomy/reconstruction 1 2"
    },
    {
      "AuthorID": "sydney51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/sydney51",
      "Content": "Hi Jojo; thanks again for the info. No I don't have to have radiation or chemo. I had radiation already on both sides and chemo. This last recurrance is only stage 0 but because I already had radiation the only choice is mastectomy so I decided to do both and be done with it. The tank top sounds great. Where can I buy one!! Thanks again and God bless you. Sydney",
      "MessageIndex": 13,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/568805-mastectomy-reconstruction.html",
      "Title": "mastectomy/reconstruction 1 2"
    }
  ]
}