{
  "AuthorID": "TampaSal51",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TampaSal51",
  "Posts": [
    {
      "AuthorID": "TampaSal51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TampaSal51",
      "Content": "I recently had a mammogram that showed a \"suspicious nodule\". I had followup mammograms and a sonogram. It showed a cyst that the doctor said was probably benign but he wants to see me in 3 months and may then decide to do another mammogram. I am rather small breasted and know nothing about breast cysts. I cannot feel this, that I know of...by breasts are rather lumpy. I'll ask him to show me where it is when I go back and what to feel for. There is no history of breast cancer in my family but there is uterine cancer and I have recently been diagnosed with skin cancer. What can you all tell me about cysts and what to watch for? Thanks so much for your help!!",
      "MessageIndex": 5,
      "PostDate": "27/02/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/256546-breast-cyst.html",
      "Title": "breast cyst"
    },
    {
      "AuthorID": "TampaSal51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TampaSal51",
      "Content": "About 3 yrs ago I had a regular mammogram which should a tiny spot on my right breast. After followup mammograms and sonograms, the doctor said it was benign and no worries. I went back 6 months ago for a regular screening and they found the lump had \"changed\". Followup mammograms and sonograms showed it had changed in size and shape. Doc suggested waiting 3 months then going back to see him. By the time the 3 months had expired, I was able to feel the lump where I never had before. The doc also could feel the lump and also found a lump in my left breast that had not shown up on the previous mammograms. I'm going today for additional mammograms and sonograms on both breasts. The doc states if there is any question at all, he will be referring me to a breast specialist. Needless to say, I am extremely nervous. Being a Friday, this means I won't get an answer until sometime next week. The waiting has to be about the worst part of all of this!! Thanks all, just needed to vent.",
      "MessageIndex": 0,
      "PostDate": "24/06/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/297607-mammograms-sonograms-today-nervous.html",
      "Title": "mammograms and sonograms today...nervous"
    },
    {
      "AuthorID": "TampaSal51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TampaSal51",
      "Content": "Got the call from the doc. It's normal, benign breast fibroids! No cancer!! Hurrah!! However, I am still getting copies of the films and reports and getting a second opinion......just to be on the safe side. Best of luck to all the rest of you!",
      "MessageIndex": 3,
      "PostDate": "29/06/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/297607-mammograms-sonograms-today-nervous.html",
      "Title": "mammograms and sonograms today...nervous"
    },
    {
      "AuthorID": "TampaSal51",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TampaSal51",
      "Content": "I'm currently waiting for a call from my gyn. During the sonogram on Friday, the tech asked me where my lump was. I pointed it out to her and asked if she was having a problem finding it. She said no, she was just finding a lot of nodularity in that breast and wanted to make sure she had the right area. She stated she was taking a lot of pictures to send to the doc. I'll probably get copies of the reports and make an appointment at the Moffitt Cancer Clinic in their breast unit just to get a second opinion no matter what my gyn comes back with.",
      "MessageIndex": 2,
      "PostDate": "27/06/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/297607-mammograms-sonograms-today-nervous.html",
      "Title": "mammograms and sonograms today...nervous"
    }
  ]
}