{
  "AuthorID": "TearZ",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TearZ",
  "Posts": [
    {
      "AuthorID": "TearZ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TearZ",
      "Content": "very quiet in here",
      "MessageIndex": 1,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/648661-ultrasound-results.html",
      "Title": "Ultrasound results......"
    },
    {
      "AuthorID": "TearZ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TearZ",
      "Content": "Got these results done today...... Lookig at the screen i could clearly see what was being scanned....everything looked good. She did 12 oclock,1,2,3,4,5,6,7,8,9,10,11 and nipple area. I asked her how it went and she said \"from what i can see it went good\" Im just abit concerned on the left breast at 6oclock....there are 2 small dark shadows under eachother i know im not a doctor but i cant help but feel scared about that....i have searched the sites to compare and it only seems to be of concern when the dark shadow is fairly large? I heard the danger zone if between 12-3 o clock? Could it just be my naturall lumps??",
      "MessageIndex": 0,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/648661-ultrasound-results.html",
      "Title": "Ultrasound results......"
    },
    {
      "AuthorID": "TearZ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TearZ",
      "Content": "Do you have other symptoms with the discharge? Such as inverted nipple, swelling, redness….? Hope the tests come back ok! Let us know how you go?! Hope someone answers you soon……I hate waiting for replies when im stressing out",
      "MessageIndex": 1,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/651798-nipple-discharge-sore.html",
      "Title": "Nipple discharge/sore"
    },
    {
      "AuthorID": "TearZ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TearZ",
      "Content": "I know stress does ALOT of different things to the body but im not to sure to what extent. Maybe you can google symptoms on all the reasons you just suggested and see if any of them match yours? If the nipple with the discharge isnt scaling,sore, scabby etc then thats a really good sign and the tests coming back positive is even better! If you dont trust the results they gave you, you can always go back to a diff/or same doc and tell them your still not secure with the results...but you seem to of had a few done and if they are all ok then i would trust that. Its not like it was a hand examination i wouldnt feel happy with their answer if that was the case but you got scans etc done so something would have showed up..... I felt like i lost 100kgs when i got my results back..and left it as that- but each to their own. Have you seen a doc about your anxeity?? That plays a massive part on you worrying about this so much.",
      "MessageIndex": 3,
      "PostDate": "26/11/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/651798-nipple-discharge-sore.html",
      "Title": "Nipple discharge/sore"
    },
    {
      "AuthorID": "TearZ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TearZ",
      "Content": "How did you go??",
      "MessageIndex": 4,
      "PostDate": "01/12/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/649425-breast-size-change.html",
      "Title": "Breast size change??"
    },
    {
      "AuthorID": "TearZ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TearZ",
      "Content": "Hey, How you going? Sorry for the loss by the way..... Even though your getting opinons from this board i do suggest you should go and get checked regardless as we cant really tell what i could be. When you say 1 breast has gone larger then the other.....is there any painfull swelling? redness? dimpling? discharge from the nipple? if its just gotten bigger without any other symptoms then thats a pretty good sign and it might just be that your hormones are still all over the place and havent settelled down as you think? Go and get checked out to make sure though.....not knowing and having thoughts of breast is awful! i thought i had it and even though i didnt want to know i just go an ultra sound down as painfull it was going through that process. It turned out to be clear THANK GOD! Its better to know then not to know....IF [touch wood no] it is breast cancer it needs to be acted on asap. You would kick yourself knowing you sat on a problem to long...but think positive- there could be 600 reasons why its the way it is....im not to familar on being pregnant but it could be from that? Let me know how your going",
      "MessageIndex": 2,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/649425-breast-size-change.html",
      "Title": "Breast size change??"
    },
    {
      "AuthorID": "TearZ",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TearZ",
      "Content": "Quote: Originally Posted by Questionss Thank you for your reply. I'm going to the doctor tomorrow. Very frightened..... I'll let you know.... Thats cool I know how frustrating it is to want help and no one replies.... You will be fine let me know how you go.....and if your not comfortable with their reply EG: they dont check propally get a second opinon- its not a rash or anything that can be left alone.",
      "MessageIndex": 3,
      "PostDate": "24/11/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/649425-breast-size-change.html",
      "Title": "Breast size change??"
    }
  ]
}