{
  "AuthorID": "TerriD",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
  "Posts": [
    {
      "AuthorID": "TerriD",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
      "Content": "So glad all is well. I had a digital mammogram in July and it turned out fine, but when the dr. did my breast exam, she said my one breast was lumpy and ordered an ultrasound. I had it done last Thursday and haven't heard anything. I tried to reach the dr. but she isn't answering, so I left a message. The report from the mammogram was good.. said no signs of malignancy, no suspicious masses, no architectural changes, no microcalcifications. I do have fibrocystic breasts, so maybe that's why the one feels so lumpy? Anyway I am hoping for another good report. Glad all is well with you though, and that you can rest easy. Terri",
      "MessageIndex": 5,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705290-call-back-second-mammogram.html",
      "Title": "Call Back for a Second Mammogram"
    },
    {
      "AuthorID": "TerriD",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
      "Content": "I've been thinking about you Murphy. Any news yet ??? Terri",
      "MessageIndex": 9,
      "PostDate": "13/10/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25194-blood-breast-cancer-signal.html",
      "Title": "Blood From Breast - Cancer Signal?"
    },
    {
      "AuthorID": "TerriD",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
      "Content": "Hi, This is my first time on this board.. glad to have found it. Anyway I am a 43 year old woman who never had breast problems until this past March. I hit my right breast on the edge of door, as I was exiting a room. I noticed about a week later that there were blood stains on my bra. When I examined my breast , I noticed that there was blood coming out of my nipple. Naturally I went into a panic. A couple of days later I saw the gyn and he ordered a mammogram and ultrasound. He also did a breast smear and sent the slide to the lab. The results from the smear was negative for malignant cells. The results from the mammo and ultrasound also came back negative with a \"benign finding\" and slightly dilated ducts. I was pretty happy about this, but the dr. still decided to send me to see a surgeon, saying that I could possibly have DCIS. I saw the surgeon, and she examined my breast. She applied pressure to the nipple, and a lot of blood came out. When I told her about the trauma I had, had she said she felt this was trauma related and it would take up to 6 months to heal. BTW.. she reviewd the films from my ultrasound, and mammo, and read the reports. I returned to her at the end of May, and there was still a bloody discharge. It was not spontaneous. The only time blood came out of my nipple, was if pressure was applied to it. Anyway, again, she told me this needed time to heal. So here it is almost 6 months since the trauma to my breast. I have an appt. scheduled for an ultrasound next Tuesday ( at the request of the surgeon), and then will take the films/results to see her on Sept. 16th. I haven't had any discharge from my breast, and ( forgot to mention) that right next to the areola a \"density\" was noted. I could feel it with my fingers and showed the surgeon, who said she felt it was a hematoma. It was located in the precise area I hit myself. Anyway, since May, this \"density\" is completey gone now, and my breast feels just fine. I am hoping for a good outcome and am encouraged by the results so far. Has anyone had trauma to their breast, and bleeding ? Sorry for rambling on and on. Thanks for \"listening\" Terri",
      "MessageIndex": 0,
      "PostDate": "26/08/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25119-breast-trauma-anyone-experienced.html",
      "Title": "Breast trauma ...anyone experienced this ?"
    },
    {
      "AuthorID": "TerriD",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
      "Content": "It's good that you're getting it checked , but from what I understand that is not usually a sign of cancer. I have had the same thing. Back in March I hit my right breast really hard on the edge of a door. Two weeks later I noticed blood on my bra, and my nightgown. I also was able to express dark colored blood ( burgundy) from my nipple. I had a blood smear of the breast, ultrasound, and mammogram. All came back negative. I was referred to a surgeon who felt it was due to trauma. Now you haven't mentioned if you had a trauma or not. Anyway, I go to the surgeon this coming Tuesday the 16th of sept. with the films from the ultrasound I had two weeks ago to make sure all is well. It could be intraductal papillomas, which are benign growths in the ducts. It could be due to trauma, and if it is cancer , it could be Ductal Carcinoma In situ, which means its at stage zero and confined to the ducts. As I said it's good that you're getting it checked out, but most likely it won't be anything serious. Try not to worry, and keep us posted. Good luck, Terri",
      "MessageIndex": 1,
      "PostDate": "13/09/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25194-blood-breast-cancer-signal.html",
      "Title": "Blood From Breast - Cancer Signal?"
    },
    {
      "AuthorID": "TerriD",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
      "Content": "Hi again Murphy ! I had my appt. today. My ultrasound results were FINE ! In March when I had, had the first ultrasound, it showed slightly dilated ducts, and a density located by the areola. Well this new one showed my breast be perfectly normal. The density is gone and the dilated ducts are now normal. This was the result of trauma, as the surgeon suspected from the beginning. When I go for my yearly mammo in the Spring, I will see the surgeon once more, as a final follow up. She wants to make sure all is still fine and just be thorough. So now I don't see her again until April. All is well. I hope and pray you receive good news as well. Please let me know what happens. Terri",
      "MessageIndex": 5,
      "PostDate": "16/09/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25194-blood-breast-cancer-signal.html",
      "Title": "Blood From Breast - Cancer Signal?"
    },
    {
      "AuthorID": "TerriD",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
      "Content": "Hi again Murphy, I had a regular mammogram and 2 reg ultrasounds , no dye. The test you are referring to is called a ductogram, where they inject dye into the breast through the nipple, and then do a mammogram to see where the bleeding is coming from. You can type \"ductography and/or ductogram \" into your search engine, and see what it involves. The breast smear was taken by the dr. squeezing blood out of my nipple and onto a slide. Then the slide was sent to the lab and thank goodness , no malignant cells were found. Will you be having a basic mammogram, or a ductogram on the 4th ? You should insist on a breast smear, to check the cells, an ultrasound, and then if you're not satisfied a ductogram. I am not trying to scare you, but it would be best if you had all of these tests to ease your mind. When I go back to the surgeon this coming Tuesday, she will review my ultrasound films and press my breast to see if there is still a bloody discharge. If there is, she will perform surgery in the very near future which would consist of cutting along the edge of the areola , folding it back, and removing the ducts in that area. I am hoping and praying this won't be necessary and that all will be well. By the way, this all started 6 months ago, and I have not had any bleeding in the last two. As I said, don't panic. My sister had a friend who was bleeding out of one breast, heavily. She was like a running fountain. They went into her breast and found a bad infection in there, which was the culprit. They treated her, removed the infected ducts, and she is fine ! Hang in there. The good thing is you're seeing the dr. Think good thoughts. I'll say a prayer for you. Terri My husband is retired Air Force, so I had my mammo, and ultrasounds at the base hospital, in the radiology dept. [This message has been edited by TerriD (edited 09-13-2003).]",
      "MessageIndex": 3,
      "PostDate": "13/09/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25194-blood-breast-cancer-signal.html",
      "Title": "Blood From Breast - Cancer Signal?"
    },
    {
      "AuthorID": "TerriD",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
      "Content": "Murphy, Are you sure your appt. is on the 4th.. it's a Saturday. Not that it matters, I was just wondering. I know that date is getting close. I wanted you to know I'm thinking of you. Please let me know how it goes. Terri",
      "MessageIndex": 7,
      "PostDate": "29/09/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25194-blood-breast-cancer-signal.html",
      "Title": "Blood From Breast - Cancer Signal?"
    },
    {
      "AuthorID": "TerriD",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/TerriD",
      "Content": "Thanks jennie . I'm glad everything worked out for you. I had a follow up ultrasound on Sept 2nd. It showed that the breast is normal now.. the density is gone and the dilated ducts are back to normal as well. The surgeon suspected this was trauma related, and said it would take 6 months to heal. She was right, it has been 6 months since this started, and everything seems to be just fine now. I will go for my annual mammogram in March, and will take my films , one final time to see the surgeon. She wants to see how I'm doing. Other than that, I consider this a done deal. Take care, Terri",
      "MessageIndex": 2,
      "PostDate": "02/10/2003",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/25119-breast-trauma-anyone-experienced.html",
      "Title": "Breast trauma ...anyone experienced this ?"
    }
  ]
}