{
  "AuthorID": "tinamarie0914",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
  "Posts": [
    {
      "AuthorID": "tinamarie0914",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
      "Content": "I have been taking Tamoxifen for just over a year as a preventive measure because of my high risk of breast cancer. About six months ago I started having pain in my hips, thighs and feet. The pain is there at a low level everyday and at times becomes quite severe. I've seen a neurologist and it does not appear to be a neurological problem. I'm wondering if it could be due to the Tamoxifen. Has anyone else had this problem while taking this drug? Any suggestions as to how to get relief? Thank you! Tina",
      "MessageIndex": 0,
      "PostDate": "28/12/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/728498-question-anyone-tamoxifen.html",
      "Title": "Question for anyone on Tamoxifen"
    },
    {
      "AuthorID": "tinamarie0914",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
      "Content": "I am 48 years old and have been taking Tamoxifen for 2.5 years now as a prevention of breast cancer because of my high risk (my mother survived breast cancer, but did not survive colon cancer). During my last annual GYN exam (4/11), the doctor mentioned that I had fibroids on both sides of my uterus. She just mentioned that they were there and didn't say anything else about them. My periods are very irregular and only last about a day or two when I do get them. The last one I had was in early April and it was heavier than usual and MUCH more painful. It is now late May and I have not had a period, which is not unusual. Yesterday I noticed some watery, light pink discharge on the toilet paper. I haven't seen anything like this before...it's definitely not like a period. I used a minipad and throughout the day it was just this really light pink, watery stuff. I took a nap and when I got up I noticed on the toilet paper a heavier, slightly darker discharge, but still not what I would call a period. The same thing happened this morning when I woke up, but there hasn't been much more today. I have had horrible heartburn for the past few days (I do have a hiatal hernia, but my heartburn has been well controlled) and my whole abdomen just feels full and bloated. Also, for the past several weeks I've noticed that when I urinate I feel a dull, ache type pain in my vagina. Boy...I must sound like quite a mess! I'm just wondering if any of this is common for others who are taking Tamoxifen. I know uterine changes are a side effect with Tamoxifen, but I'm just not sure if what I'm experiencing are normal side effects or something I should be more concerned about. Thanks for your help! TinaMarie",
      "MessageIndex": 0,
      "PostDate": "23/05/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/850942-tamoxifen-question.html",
      "Title": "Tamoxifen Question???"
    },
    {
      "AuthorID": "tinamarie0914",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
      "Content": "I am 46 years old and am at high risk for breast cancer so my doctor wants me to consider taking Tamoxifen as a preventive measure. I've been reading about it and see that it is only effective in treating estrogen receptor-positive breast cancer and not estrogen receptor-negative cancer. Is one more prevalent than the other? Does anyone have any advice for someone in my position? It seems like the benefits outweigh the risks, but I'm still just not sure what to do. I'd appreciate any advice! Thank you! Tina",
      "MessageIndex": 0,
      "PostDate": "02/11/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/646230-take-tamoxifen-thats-question.html",
      "Title": "To take Tamoxifen...that's the question!"
    },
    {
      "AuthorID": "tinamarie0914",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
      "Content": "Thank you so much for your reply...I feel better now knowing that my suspicions are correct. I have actually not felt well since starting this drug...I feel naseous, dizzy and overall not well most days. I can't attribute it to anything else because nothing else in my life has changed. Did you experience this also? Understanding what to expect makes dealing it with much easier...I'm not ready to give up on it yet! Happy New Year! Tina",
      "MessageIndex": 2,
      "PostDate": "30/12/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/658556-tamoxifen-elevated-liver-enzymes.html",
      "Title": "Tamoxifen and elevated liver enzymes"
    },
    {
      "AuthorID": "tinamarie0914",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
      "Content": "Thanks for your reply, Robin! Is it true that if a lump is cancerous it won't be detected so close to the surface of the skin? Of course now I'm a little more nervous, because when I checked it tonight I do feel a larger lump deeper underneath it. I have very dense breasts though so it could all be my imagination. I'm trying to just ignore it until I see my doctor on Wed., but everytime I look at my husband and/or my little girl I start worrying again. Thanks again for responding - I appreciate your time. Tina",
      "MessageIndex": 2,
      "PostDate": "13/06/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/294120-question-about-red-spot-breast.html",
      "Title": "Question about red spot on breast"
    },
    {
      "AuthorID": "tinamarie0914",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
      "Content": "For those of you who are taking (or have taken) Tamoxifen, did it ever cause an increase in your liver enzymes? I was taking it for about three weeks when I had some blood work done (for something unrelated) and my liver enzymes were elevated, which they've never been before. My doctor confirmed I do not have any type of hepatitis or mono and an ultrasound confirmed there are no tumors or cysts. Since I rarely drink alcohol and have excellent cholesterol/triglyceride readings, the only other thing I can think of is the Tamoxifen...so I was curious if anyone else ever experienced this. Thanks! Tina",
      "MessageIndex": 0,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/658556-tamoxifen-elevated-liver-enzymes.html",
      "Title": "Tamoxifen and elevated liver enzymes"
    },
    {
      "AuthorID": "tinamarie0914",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
      "Content": "I have a question about something I've noticed in my chest and am wondering if anyone has had the same experience. I have what feels like a \"lump\" to me in my chest, near my sternum on the right side. It's kind of flat in that it doesn't feel like a marble, it is very hard and doesn't hurt. It's a bit irregular in shape as it isn't what I would call round. I saw my general doctor the other day and asked him about it...he thought it was my rib. He ordered a chest x-ray anyway and it came back negative. I alternate between ultrasound and mammograms every six months as I have had a spot biopsied in the past on my right breast. My mom had breast cancer and I take Tamoxifen for prevention. While talking to my sister she said it is possible for breast cancer to be detected in the chest and not in the breast. Is that true? If there were something there would it have shown up on the chest x-ray? I'm going to watch it and see if it changes and if so I'll go to my breast specialist, but I was just curious if anyone else has had this same experience. How common is it that breast cancer is detected in the chest. Thank you very much for your help! Tina",
      "MessageIndex": 0,
      "PostDate": "21/05/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/750101-lump-chest-above-breast.html",
      "Title": "Lump in chest above breast"
    },
    {
      "AuthorID": "tinamarie0914",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/tinamarie0914",
      "Content": "I am 42 years old and my mother had breast cancer, so I naturally get concerned when I see changes in my own breasts. I faithfully have yearly breast exams with my GYN as well as an annual mammogram. I admit to not being so good about my self-exams . About 5 weeks ago, my husband noticed a red spot on the upper (outer) left side of my left breast - he at first thought it was a pimple. I didn't look like a pimple to me, but I was busy and just didn't pay much attention to it. I looked at it later and realized it felt raised on the skin and when I pushed harder on it, I noticed that it felt hard underneath, but not real deep (if that makes any sense). I decided it was probably just a skin irritation and left it alone. The color seems to change from time to time - sometimes it's darker red and other times it's lighter red and there seems to be what I can only describe as a shadow around it. When I pull the skin taught around it I can actually see the \"lump\" which is quite irregular in shape - it's very small though - maybe only .75cm. I have noticed that my left breast seems to be a little bigger than my right and when I put my bra on this morning I really noticed that the left side did not fit as well as the right. It seems to be bigger around the outside. Isn't it normal for one breast to be larger than the other anyway? I have an appointment later this week with my GYN to have this looked at, but I've been curious to know if anyone else has ever experienced anything like this. I know breast cancer shows up in different forms for everyone and since this doesn't fit the \"feels like a marble, or a pea, or a grape\" symptom I thought I'd see is familiar with anything like this. I'm not easily scared - I'm very realistic, so if anyone has been diagnosed with breast cancer by something that started out like what I've described, please don't be afraid to share it with me. I'm grateful for any comments!",
      "MessageIndex": 0,
      "PostDate": "13/06/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/294120-question-about-red-spot-breast.html",
      "Title": "Question about red spot on breast"
    }
  ]
}