{
  "AuthorID": "truelyurangel82",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/truelyurangel82",
  "Posts": [
    {
      "AuthorID": "truelyurangel82",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/truelyurangel82",
      "Content": "im 22 yrs old and never gotten a pap smear. about 4 yrs ago i went to a physical and he checked my breasts and there was no lump. He asked if i wanted to take a pap smear but i said maybe next time. Well recently i thought well i havent been to a physical in awhile and i should get a pap smear. its better to be safe then sorry right.. well i have my physical today at the university health center on campus and the lady found a lump on my right breast . She said its prob a normal lump and to not be worried about it. Ijust got done with my period long ago and i guess they say lumps can develop during it.i duno. Its easy for her to say that though. My aunt had breast cancer and my grandmother had colon cancer. Anyway..she told me to come back wednesday so they can look at it again and if its stil there for me to go see someone so they can check if its cancer or not. Problem is i live far away from home..so i guess if they still feel the lump im going to have to see someone when i go home for spring break. This is really bad news for me. Im stressed. I have 2 exams this week, another exam a week after and 2 papers due march 17. ive had anxiety all day..and been depressed. i know some people wil say not worry about it..but im paranoid and i hope this isnt cancer I dont know what to do..",
      "MessageIndex": 0,
      "PostDate": "28/02/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/257709-doc-found-lump.html",
      "Title": "Doc found a lump :("
    },
    {
      "AuthorID": "truelyurangel82",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/truelyurangel82",
      "Content": "yeh i heard about that too.. i still worry though. thanks i will",
      "MessageIndex": 4,
      "PostDate": "28/02/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/257709-doc-found-lump.html",
      "Title": "Doc found a lump :("
    },
    {
      "AuthorID": "truelyurangel82",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/truelyurangel82",
      "Content": "thanks... ill update..after i get checked out again im trying to not worry about..it..but i cant and im sure u understand since u said u been through something like this before. i dont handle stress easily so this is like a blow for me",
      "MessageIndex": 2,
      "PostDate": "28/02/2005",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/257709-doc-found-lump.html",
      "Title": "Doc found a lump :("
    }
  ]
}