{
  "AuthorID": "Tulsamomof3",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Tulsamomof3",
  "Posts": [
    {
      "AuthorID": "Tulsamomof3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Tulsamomof3",
      "Content": "Ok I don't want to scare anyone but I had the same problem. I am 37 and no history of BC. My doctor was convienced the bloody discharge was nothing, I had 2 negative mammograms and an ultrasound still nothing. I had the ductogram and they saw one little mound. She said it was a papplinoma and that I would have a simple out patient surgery to remove it. She said only 10% of the time is the bleeding actually a sign of cancer. 2 weeks later I got the call _ I had Invasive ductal carcinoma. Now 5 months later I have had a Bilateral masectmy with DIEP flap reconstruction. My tumor wound up being 1.4 cen. There was some stuff that showed up on the mammagram other than my tumor that turned out to be DCIS. I am awaiting an appointment with the Oncologist to disscuss Chemo. With that being said. make them do every test till they find out what is causing it. Bloody discharge is not normal period. You are likely fine but if I had let it go... 5 years or so..who knows",
      "MessageIndex": 10,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/752693-bloody-nipple-discharge.html",
      "Title": "Bloody nipple discharge 1 2"
    },
    {
      "AuthorID": "Tulsamomof3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Tulsamomof3",
      "Content": "When I said some other stuff showed up on my mammogram I meant MRI. The mammograms where always clear",
      "MessageIndex": 15,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/752693-bloody-nipple-discharge.html",
      "Title": "Bloody nipple discharge 1 2"
    },
    {
      "AuthorID": "Tulsamomof3",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Tulsamomof3",
      "Content": "Quote: Originally Posted by janld Hi---soo strange to log on and read first thread re same problem I'm having. I also had bleeding 5 years ago, get mamo every year. My gyn sent bit of discharge to lab at that time and came back negative for all possibilities. Fast forward 5 years and I'm having the bleeding again. I just had a mamo 4 weeks ago and am wondering if the mamo caused the bleeding. I have always had cystic breast with clusters of the things. I to am worried and will go to gyn next week. I don't know if cysts can contain blood or not. I have had several US and detected nothing but numerous cysts. It sure set your mind to worrying. Please post when you have a diagnosis. Will keep in contact myself. I didn't mean to scare you, But I think woman need to know that a clean mammogram does not mean you are in the clear. If you have other symptoms like a lump, or like discharge those things need to be checked out because they CAN be caner even if nothing shows on the mammogram. My doctor said younger women sometiimes have dense breast tissue and you could have a mass that wouldn't show up. I did have a 1.4 cen invasive tumor that was only visible by MRI. I would just make sure you get discharged checked out. From what I have read if its bloody or brown you have more of a reason to be concerend. Not everyone with discharge has cancer but I did. So I reccomend insisting on finding out what is causing it because no matter what its not normal.",
      "MessageIndex": 14,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/752693-bloody-nipple-discharge.html",
      "Title": "Bloody nipple discharge 1 2"
    }
  ]
}