{
  "AuthorID": "VJW",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/VJW",
  "Posts": [
    {
      "AuthorID": "VJW",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/VJW",
      "Content": "Thank you so much for the responses.I have been using Hibiclens on the spot for several days as well in case it was a skin infection with no improvement. There is no warmth or other signs of infection. I feel like I may be making too much out of it since I have no other symptoms except the red patch, but since my grandmother and mother both had breast cancer I am still suspicious. I am going to call the breast specialist's office tomorrow, and let them know what is going on and see if I can get in before my 7/31 annual appt. I would have already done so , but I have been with my husband in the hospital for 7 of the last 9 weeks for his liver transplant and several complications. It helps just to have objective input. Thanks again for taking the time to do so.",
      "MessageIndex": 3,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/906704-red-spot-somewhat-concerned-about-ibc.html",
      "Title": "Red Spot somewhat concerned about IBC"
    },
    {
      "AuthorID": "VJW",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/VJW",
      "Content": "I called the BS office, and they wanted me to come in today just to look at the spot. He said he didn't think it was anything scary but examined the breast and lymph nodes thoroughly. He said he thinks it's some type of dermatitis and prescribed a stronger cream, however he said if it isn't lots better by my regular appt. on 7/31 he wants to biopsy or if it worsens before then or if any new symptoms crop up to call, and he'll get me in before then and biopsy it. Thanks for the push to have it checked, so now it will either improve with treatment or we will have a basis for comparison if it doesn't.",
      "MessageIndex": 5,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/906704-red-spot-somewhat-concerned-about-ibc.html",
      "Title": "Red Spot somewhat concerned about IBC"
    },
    {
      "AuthorID": "VJW",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/VJW",
      "Content": "I am 49 years old with strong family history for breast cancer. I noticed a nickel sized round red spot on left breast about 2 weeks ago. It is not itchy or painful but the skin does seem thickened. I have applied both antifungal and cortizone creams for several days but the area is now quarter sized.My husband has been very ill, so I havent really had time to have it checked out.I have annual mammo and appt with a breast specialist due to being high risk. It is scheduled for 7/31. I really don't think it is anything but after reading about IBC I am unsure if I should wait till then to have it checked.Any suggestions ?",
      "MessageIndex": 0,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/906704-red-spot-somewhat-concerned-about-ibc.html",
      "Title": "Red Spot somewhat concerned about IBC"
    }
  ]
}