{
  "AuthorID": "ween",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
  "Posts": [
    {
      "AuthorID": "ween",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
      "Content": "My bestfriend was diagnosed with stage 2b breast cancer in 2003 with four positive lymphnodes. Recently she has been having a lot of pain in her shoulders and a really bad case of sciatica. She went to the doctor and had some type of blood tests done and her levels were elevated and her doctor insisted she go get a bone scan. Sorry I don't have more information on the blood test she had. It's something she has done every six months since being diagnosed. She is extrememly worried (as am I) that the sciatica is bone mets. Has anyone here experienced anything like this? Thank you in advance.",
      "MessageIndex": 0,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/834921-breast-cancer-sciatica.html",
      "Title": "Breast Cancer and Sciatica"
    },
    {
      "AuthorID": "ween",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
      "Content": "My mother had breast cancer twice and each time she found a large lump the lump did not hurt at all. It felt more like a large pebble with no feeling whatsover. I think the fact that your wife's is sore to touch is a good sign actually. I'm going through something right now and it is scary. Tell not to worry too much though.",
      "MessageIndex": 1,
      "PostDate": "28/07/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705803-large-breast-lunp.html",
      "Title": "large breast lunp"
    },
    {
      "AuthorID": "ween",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
      "Content": "Well my friend got her test results from the bone scan and it seems that the cancer has metastasized to her bones. She goes for a CT scan to confirm on Monday. Keep her in your prayers. Her name is Lisa.",
      "MessageIndex": 1,
      "PostDate": "11/02/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/834921-breast-cancer-sciatica.html",
      "Title": "Breast Cancer and Sciatica"
    },
    {
      "AuthorID": "ween",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
      "Content": "I'm 45 years old and have been having routine mammograms for the past 10 years due to my mother's metastatic breast cancer death. Every year they have been fine. Well I had one this past Tuesday and the receptionist called and said they want to do a second mammo. She said my right breast had changed when compared to last year's mammo results. I asked if it was anything to worry about and she said there will be doctors I can talk to when I got to my second mammo. She said there was no lump or anything, just that the breast had changed. I have gained about 10 pounds in the last year. I now weigh 120 and am 5 feet 6 inches. I'm pretty sure the weight gain is due to pre-menopause. My breast have been tender frequently and have actually gotten a little bit bigger. I'm kind of nervous. Any words of wisdom from any of you fine ladies? Thanks in advance.",
      "MessageIndex": 0,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705290-call-back-second-mammogram.html",
      "Title": "Call Back for a Second Mammogram"
    },
    {
      "AuthorID": "ween",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
      "Content": "Well I'm off in the morning for my second mammo. Thanks for all the input. Insert crickets chirping here....just kidding around. I know you are all on pins and needles...I'll keep you posted.",
      "MessageIndex": 1,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705290-call-back-second-mammogram.html",
      "Title": "Call Back for a Second Mammogram"
    },
    {
      "AuthorID": "ween",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
      "Content": "It sure does. I had a digital mammo and an ultrasound. They had this concerned look on their face like pure doom the entire time and then let me know everything was fine. It scared the crap out of me.",
      "MessageIndex": 4,
      "PostDate": "02/08/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705290-call-back-second-mammogram.html",
      "Title": "Call Back for a Second Mammogram"
    },
    {
      "AuthorID": "ween",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
      "Content": "Turns out I'm fine. It's been awesome chatting with myself.",
      "MessageIndex": 2,
      "PostDate": "01/08/2009",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/705290-call-back-second-mammogram.html",
      "Title": "Call Back for a Second Mammogram"
    },
    {
      "AuthorID": "ween",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/ween",
      "Content": "Don't worry too much. It is more common than you would think. Here are some common conditions that can cause fluid discharge, and the types of discharge they may cause (although there may be variations): Normal breast function: clear, yellow, white, or dark green discharge Pregnancy or breast-feeding: thin and milky, or clear and straw-colored in early pregnancy Hormonal imbalance that’s causing milk production (if not pregnant or postpartum): milky or clear, possibly yellow or green Inflamed duct: yellow, green, brown or black Injury: clear, yellow or bloody Breast infection: pus Fibrocystic breast changes: yellow, green, brown or black Small non-cancerous growth in a duct (papilloma): bloody Breast cancer: bloody",
      "MessageIndex": 1,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/835892-really-scared.html",
      "Title": "really scared :-("
    }
  ]
}