{
  "AuthorID": "windchaser1",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/windchaser1",
  "Posts": [
    {
      "AuthorID": "windchaser1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/windchaser1",
      "Content": "I went to see a cancer specialist (onocologist) this morning. After hand examination, he said he found nothing. But the problem is that he examined by pressing his hands on my breast. I tried to tell him I wouldn't be able to feel the tiny lump (about 5mm) under the areola by hand pressing either. The only way I could feel it is by squeezing it with my finger tips. But he said if he couldn't feel it by hand pressing then it means nothing is wrong. Just like the general doctors, he refused even to send me to do a mammogram. Then when I told him I found discharge from the areola area from time to time, he looked a little worried. He said there shouldn't be discharge from the areola area. But then he just told me to see him when I found discharge again. I know there is discharge because I found something crystalized on the areola from time to time, usually after I squeezed the lump a lot. I searched the web and found that there are so called Montgomery's glands on the areola and they do discharge fluid when we squeeze the areola. Does anyone know whether men have Montgomery's glands on their areola or not? If men have that kind of glands on their areola too, that would make me feel easier because it could explain the discharge. Thank you.",
      "MessageIndex": 10,
      "PostDate": "25/08/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/199692-nipple-lump.html",
      "Title": "Nipple lump"
    },
    {
      "AuthorID": "windchaser1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/windchaser1",
      "Content": "Well, actually I have called a few onocologists but they all required a referrel by the general doctor before they will see me. Like I said I have seen two general doctors and both of them refused to even let me do an ultrasound, let alone seeing a specialist. The main reason given by both of them is that the lump is too small (about 5mm). So they said they were not concerned about it and told me just to monitor it. Is it really true that a 5mm lump is too small to have any concern? Well, like I said, it's hard, painless and under the areola area which are factors needed to be concerned about, I guess. I feel miserable and deseparate now.",
      "MessageIndex": 5,
      "PostDate": "19/08/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/199692-nipple-lump.html",
      "Title": "Nipple lump"
    },
    {
      "AuthorID": "windchaser1",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/windchaser1",
      "Content": "reply deleted",
      "MessageIndex": 4,
      "PostDate": "19/08/2004",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/199692-nipple-lump.html",
      "Title": "Nipple lump"
    }
  ]
}