{
  "AuthorID": "WorkInProgress",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/WorkInProgress",
  "Posts": [
    {
      "AuthorID": "WorkInProgress",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/WorkInProgress",
      "Content": "Hi! After talking to two different doctors, two radiologists (I work in a clinic) and two different xray techs...I have decided to wait the six months. Did you know that about 85% percent of baseline mammo's are asked to be repeated in six months? It is just their way of being extra safe. After I heard that I felt a lot better. Plus, all these people I talked to had looked at my results and said it is perfectly normal. So I was getting concerned for nothing. Plus, my doctors won't do an ultrasound or needle biopsy. I guess the cyst is so small they wouldn't have a very easy time finding it...the doctor said it would be just about impossible. Thanks for your advice though!",
      "MessageIndex": 7,
      "PostDate": "03/05/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24691-just-got-results-first-mammo-am-little-scared.html",
      "Title": "Just got results from first mammo - am a little scared... 1 2"
    },
    {
      "AuthorID": "WorkInProgress",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/WorkInProgress",
      "Content": "Hi Sister, Well, after talking with the radiologist and my doctor, I have been assured that this is perfectly normal. So I guess I will wait the 6 months and get another mammo. I guess the nodule is small, and I guess they can tell by looking what is benign and what isn't. (although nothing is 100%.) Thanks for the response though!",
      "MessageIndex": 4,
      "PostDate": "24/04/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24691-just-got-results-first-mammo-am-little-scared.html",
      "Title": "Just got results from first mammo - am a little scared... 1 2"
    },
    {
      "AuthorID": "WorkInProgress",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/WorkInProgress",
      "Content": "Hi Sister, Thanks for your response. Did this happen on your very first mammo? According to the lab tech, that is the difference in mine. She said that if this had been a \"CHANGE\" from a previous mammo, then they would test it right away, but since it is my first mammo, it is probably normal for me. Kind of a confusing statement I thought. So, had you had previous mammos and this was a change for you? And that needle biopsy, was it painful? What is it exactly? (if you don't mind sharing.) Thanks!",
      "MessageIndex": 2,
      "PostDate": "21/04/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24691-just-got-results-first-mammo-am-little-scared.html",
      "Title": "Just got results from first mammo - am a little scared... 1 2"
    },
    {
      "AuthorID": "WorkInProgress",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/WorkInProgress",
      "Content": "Hi, I am 38 years old and just had my first mammo. (My gramma had breast cancer and my doc wanted to establish a \"baseline\".) I just got the results. They want to see me to have another mammo in 6 months because there is a small \"benign\" looking module in my right breast which the letter says is probably normal for me. It goes on to say that the follow up is to make sure that it doesn't change. Ok, is this normal? Should I get a second opinion? I'm a little bit scared here. Any input would be greatly appreciated.",
      "MessageIndex": 0,
      "PostDate": "20/04/2002",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/24691-just-got-results-first-mammo-am-little-scared.html",
      "Title": "Just got results from first mammo - am a little scared... 1 2"
    }
  ]
}