{
  "AuthorID": "Zipity",
  "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Zipity",
  "Posts": [
    {
      "AuthorID": "Zipity",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Zipity",
      "Content": "My Mom is 67. She went in for her mammogram last week and there were \"calcium deposits\" or calcium spots, I can't remember exactly how she said it. They did a repeat mammogram and now they've ordered a biopsy. The doctor said it's because they've changed since her last mammo in late 2009. He also said that it's a \"line\" of spots and that when it's breast cancer, it's normally in a cluster but he wants to rule out cancer so they're doing a needle biopsy. Is this correct? That bc is normally in a cluster? And I don't know anything about how cancer forms...will they biopsy every spot? What if they biopsy one and it's fine but one that they didn't is cancerous? Is that possible? How does this all work? Sorry for all the questions but I just lost my father in law to C and this has me really scared.",
      "MessageIndex": 0,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/847791-calcium-deposits-breast-biopsy-being-done.html",
      "Title": "Calcium deposits in breast? Biopsy being done"
    },
    {
      "AuthorID": "Zipity",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Zipity",
      "Content": "Thank you so much. The biopsy was benign. It's papiloma (sp) and she will probably have surgery to remove it because it's \"pre-cancerous\"",
      "MessageIndex": 4,
      "PostDate": "07/05/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/847791-calcium-deposits-breast-biopsy-being-done.html",
      "Title": "Calcium deposits in breast? Biopsy being done"
    },
    {
      "AuthorID": "Zipity",
      "AuthorURL": "https://www.healthboards.comhttps://www.healthboards.com/Zipity",
      "Content": "Quote: Originally Posted by JJ They are doing the right thing. When anything suspicious shows up it is important to have it checked. If they are doing a biopsy they know exactly what to look for and if there is anything, it will show up in surrounding areas. Hopefully things come back ok, so keep us posted...JJ... Thank you very much.",
      "MessageIndex": 2,
      "PostDate": "03/05/2011",
      "ThreadURL": "https://www.healthboards.com/boards/cancer-breast/847791-calcium-deposits-breast-biopsy-being-done.html",
      "Title": "Calcium deposits in breast? Biopsy being done"
    }
  ]
}