{
  "AuthorID": "AgGuy1980",
  "AuthorURL": "https://www.cancerforums.net/members/111042-AgGuy1980?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "AgGuy1980",
    "AuthorURL": "https://www.cancerforums.net/members/111042-AgGuy1980?s=1b276477decf6519c562df0329af5289",
    "Content": "My mother is currently battling Stage 4 Breast Cancer. She is currently 59 years old. She had a lump in her breast for many years (prob 4-5), but didn't seek medical attention until it grew so large that she couldn't stand it. She underwent several rounds of radiation and the cancer had already spread to her bones. Her cancer was hormone receptive which was a God send, being at the time my mom was too weak for chemo. She took several different hormone pills and also took a hormone shot. They were able to finally to remove the breast and tumor, but she had cancer in her lymph nodes and bones. I should add that my mom has cancer in almost every bone of her body, including every vertebrae in her spine. She has several compressions fractures as well. Until about four months ago, her cancer primarily remained under somewhat of control...although we knew there was no cure. About four or five months ago her tumor markers started going up. They continued to increase significantly month-to-month which led to more scans. The CT scan of the abdomen showed numerous cancer lesions in her liver--two of them being 2 cm and the rest being numerous but various sizes. This was almost three months ago. At that point mom made the decision to not take any more treatments. My question is what is her prognosis and what can we expect. Her appetite is up and down and by no means is confined to a bed, but is getting weaker. She still get's out some, but her motivation is deteriorating. Can anyone give me any advice on what to expect, etc? Thanks.",
    "MessageIndex": 0,
    "PostDate": "22/05/2014",
    "ThreadURL": "https://www.cancerforums.net/threads/38736-Need-some-advice?s=1b276477decf6519c562df0329af5289",
    "Title": "Need some advice"
  }]
}