{
  "AuthorID": "AlaskaAngel",
  "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "The closer you are, the more likely you will be permanently menopausal. Due to the fact that I had 6 doctors (including 3 female doctors) that I saw at time of diagnosis and not a single one of them gave me any description of the difference in what menopause means for women who are about to experience it by chemical or surgical means (compared to what it means for those who experience it naturally), I will try to do that for you. I was 50 at dx and pre or perimenopausal, and I was 51 at completion of chemo and rads. At completion despite the rigors of treatment I still felt some joy of life every day, and still had some ability to enjoy sex. My onc advised me to start tamoxifen. I said that I understood that tamoxifen was very drying, vaginally as well as just about everywhere else. He literally laughed at me and said that was not true. Two weeks after starting tamoxifen my skin was dry, my eyes were dry, my vagina was dry, my sex life was dry, and my emotions were flat. I stopped the tamoxifen for 2 weeks and there was no change, so I restarted it in the belief that the damage was done and I could at least get the benefit of perhaps being among the 40-50% of women taking tamoxifen that tamoxifen might protect. Since then I have spoken with my internist about this as well as the onc. This is a difficult subject to talk about with a male doctor but I did. Both responded that my testosterone level could be tested to see if adding testosterone was helpful, although it was doubtful. Otherwise they had absolutely no comment at all, other than my onc, who asked me why I was asking him this question and not my internist. Since chemotherapy does bring on menopause and for some reason there is no association in these doctors' minds with the impact of abrupt menopause on women, I don't think this onc really should be prescribing chemotherapy to women, even though he is at the top of his field. They did not offer any counseling, or any referral for counseling. Each doc tested my testosterone, and neither of them ever told me what the results of the testosterone testing were. I want to describe what this change was like for me. To me it was the equivalent of having a lobotomy of the part of my brain that deals with the joy of life and the joy of sex. I am using the E-string for lubrication for sex, along with lots of lubricant, since I have been with a great partner for over 30 years. Sex is now 80% accommodation, 20% pleasure. This might be the worst-case scenario and not what will happen for you, but I wish someone would have said this to me so that I would have had better information BEFOREhand. A.A.",
      "MessageIndex": 5,
      "PostDate": "18/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/235-does-chemo-cause-menopause?s=1b276477decf6519c562df0329af5289",
      "Title": "does chemo cause menopause"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Kristen! Hello Sue! HER2+++ grade 3 here (older than you both, about to turn fifffttyyy-fiiive... eesh did I SAY that out loud?!) Kristen is right, if your cancer is HER2 positive then her2support.org is a good place to learn a lot about that from good people. I'm 3 1/4 years out from treatment and finally decided to have the genetic testing for BRCA1 and 2, to help me decide whether to push for Herceptin. I still can't figure out why the aunt who died of ovarian cancer is of more genetic concern than the aunt who died of bc mets to the brain (whether or not they have found the genetic tie to who gets brain mets and who doesn't, it ain't going to make much difference in actual outcome to ME). They are both usually detected late in the game. Do either of you have any ideas about that? AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "22/01/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2360-mssue?s=1b276477decf6519c562df0329af5289",
      "Title": "mssue"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "What other health problems did she have (if any) prior to the lumpectomy? Her complaint isn't a common complaint among bc survivors. As Lauri mentioned, I would get another opinion from a different medical facility. We all want to trust our doctors and most of them are fine, but unfortunately not all of them are, and sometimes it takes years to weed out the doctors that aren't. A.A.",
      "MessageIndex": 2,
      "PostDate": "19/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/683-Problems-voiding-after-surgery?s=1b276477decf6519c562df0329af5289",
      "Title": "Problems voiding after surgery"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Have you tried looking at teh urologyhealth.org website to find out more about it? No matter what doctor you see, learning as much as you can about the problem will give you better perspective. I looked on that site using the topic neurogenic bladder because I really don't know any other cause for the problem, but there may be others. AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "20/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/683-Problems-voiding-after-surgery?s=1b276477decf6519c562df0329af5289",
      "Title": "Problems voiding after surgery"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi msn, I had one mammo when I was young in 1988, then one about a decade later, and they started doing short-term 6-month follow ups because my breasts were fairly dense. In June, 2001 the rads doc was unsure enough to do an ultrasound at the same time for 2 lumps thought to be fibroadenomas, and then to be on the safe side he gave it a BIRADS 4 and recommended biopsy, partly because of strong family history. The surgeon did not biopsy, but recommended a 3 month follow up ultrasound. At three months, the same 2 lumps were seen pretty much unchanged but a third lump was seen that was questionable enough that again biopsy, BIRADS 4 was recommended. The surgeon failed to follow up and when I phoned her she argued with me and said \"we\" had decided not to biopsy. We don't have any other imaging facilities here and I didn't know what to do so I finally independently scheduled another ultrasound as a way of getting things back on track, and by the time I actually got it, another 2 1/2 months had gone by -- (partly because the surgeon had gone on vacation and by the time she got back to argue with me I was too \"polite\" about it all). Again biopsy was recommended, BIRADS 4. I had the biopsy this time and the third lump was a 1.6 cm IDC with DCIS. No biopsy was done of the other 2 lumps. I then had a competent surgeon in the Lower 48 biopsy both other lumps before I would go ahead with treatment, and both of those were fibroadenomas and were benign. What would I do differently if I had it to do over? 1. NEVER again trust a doctor who is that stupid, even if the doctor trained at UCLA and continues to be a fully qualified practicing surgeon in our town who claims to be a \"breast cancer SPECIALIST\". 2. If at high risk, go for the biopsy. 3.I personally would chose excisional biopsy.",
      "MessageIndex": 2,
      "PostDate": "19/05/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2967-Results-from-Mammo-amp-Ultrasound?s=1b276477decf6519c562df0329af5289",
      "Title": "Results from Mammo & Ultrasound"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I hope that by now you and the others involved have more information about the realities of your mother's situation. I would like to help, perhaps starting by helping to interpret some of the information you have received about her bc and treatment. Sincerely, AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "26/10/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/3707-Morality-and-End-of-Life-Issues?s=1b276477decf6519c562df0329af5289",
      "Title": "Morality and End of Life Issues"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi msn, I had one mammo when I was young in 1988, then one about a decade later, and they started doing short-term 6-month follow ups because my breasts were fairly dense. In June, 2001 the rads doc was unsure enough to do an ultrasound at the same time for 2 lumps thought to be fibroadenomas, and then to be on the safe side he gave it a BIRADS 4 and recommended biopsy, partly because of strong family history. The surgeon did not biopsy, but recommended a 3 month follow up ultrasound. At three months, the same 2 lumps were seen pretty much unchanged but a third lump was seen that was questionable enough that again biopsy, BIRADS 4 was recommended. The surgeon failed to follow up and when I phoned her she argued with me and said \"we\" had decided not to biopsy. We don't have any other imaging facilities here and I didn't know what to do so I finally independently scheduled another ultrasound as a way of getting things back on track, and by the time I actually got it, another 2 1/2 months had gone by -- (partly because the surgeon had gone on vacation and by the time she got back to argue with me I was too \"polite\" about it all). Again biopsy was recommended, BIRADS 4. I had the biopsy this time and the third lump was a 1.6 cm IDC with DCIS. No biopsy was done of the other 2 lumps. I then had a competent surgeon in the Lower 48 biopsy both other lumps before I would go ahead with treatment, and both of those were fibroadenomas and were benign. What would I do differently if I had it to do over? 1. NEVER again trust a doctor who is that stupid, even if the doctor trained at UCLA and continues to be a fully qualified practicing surgeon in our town who claims to be a \"breast cancer SPECIALIST\". 2. If at high risk, go for the biopsy. 3.I personally would chose excisional biopsy.",
      "MessageIndex": 7,
      "PostDate": "19/05/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2967-Results-from-Mammo-amp-Ultrasound?s=1b276477decf6519c562df0329af5289",
      "Title": "Results from Mammo & Ultrasound"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Unless you have very little breast to begin with I would think either an FNA or a core biopsy would change the breast very little. Removal, especially if you choose to have the larger one removed, I would think would put a visible dimple in if your breast is average. But I'm no surgeon. There are no calcifications and you are not in a high-risk category and the radiologist feels that if it is cancer it would be a slow-growing cancer, all of which are strongly in your favor for a benign result. A.A.",
      "MessageIndex": 8,
      "PostDate": "21/05/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2967-Results-from-Mammo-amp-Ultrasound?s=1b276477decf6519c562df0329af5289",
      "Title": "Results from Mammo & Ultrasound"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "ME? Ah Pat, if that is true it is only because I have managed to stumble so many times myself that I have acquired large pile of advice I only wish I would have had to begin with! I very much agree with you about learning to be more assertive. It does result in being more personally responsible for making choices. Thanks for opening the door and providing the chance for counseling here with Dr. Leo and Dr. Lu. AlaskaAngel",
      "MessageIndex": 6,
      "PostDate": "26/04/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/938-Genentech-Announcement-about-Herceptin-for-Early-Stage-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Genentech Announcement about Herceptin for Early Stage bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Unless you have very little breast to begin with I would think either an FNA or a core biopsy would change the breast very little. Removal, especially if you choose to have the larger one removed, I would think would put a visible dimple in if your breast is average. But I'm no surgeon. There are no calcifications and you are not in a high-risk category and the radiologist feels that if it is cancer it would be a slow-growing cancer, all of which are strongly in your favor for a benign result. A.A.",
      "MessageIndex": 3,
      "PostDate": "21/05/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2967-Results-from-Mammo-amp-Ultrasound?s=1b276477decf6519c562df0329af5289",
      "Title": "Results from Mammo & Ultrasound"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "The onc I had is considered top of the line... a good person, and I know he works very long hours. The docs I like, like him.... the patients I know love him... I couldn't find a wavelength we could genuinely communicate on other than polite exchanges. I believe that a patient with bc should receive at the bare minimum the basic written information about their own cancer characteristics and the choices that are recommended, without having to specifically ask for each piece. I received no explanations and no written information, just the verbal recommendation for CAF x 6 followed by rads and tamoxifen. I feel that chemo was recommended for me without any understanding at all in terms of who I am as a total human being, which is much more than simply a live organism that possibly still contains cancerous cells after surgery. I may not be the best person to ask. Maybe Leo can help answer your question too. I wasn't afraid of losing my hair, or of vomiting, etc. I just do not understand, when a person chooses not to do chemo and then sometimes ends up having a recurrence or metastasis, why it is so automatic to assume that if they had done chemo they would not have had a recurrence or metastasis.... I see those who chose to do chemo constantly having recurrences and metastasis, but instead of blaming that on the chemo that they have had, established medicine usually wants them to do MORE chemo. I also see quite often those who have had chemo and have had recurrence and then have amother chemo regimen frequently go into very rapid decline. I can't get a straight answer about any genuine maintenance of information about how people who have chosen not to do chemo have done in terms of survival or recurrence. I did chemo strictly on a one-time basis out of respect for my family's wishes and the recommendation of my internist. A.A.",
      "MessageIndex": 3,
      "PostDate": "07/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/274-HER2-to-ER-cross-talk-and-SERMs?s=1b276477decf6519c562df0329af5289",
      "Title": "HER2-to-ER cross-talk, and SERMs"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Kristen, I was referred to one of the most knowledgeable and well-loved oncologists, but I have to say that I think that for that very reason that kind of conversation just didn't happen for me, either. He can only help so many in a day. I still get upset about it too. At the time I was saying I wanted to be part of a clinical trial but I didn't know how. He just said there were thousands of them. When I tried to figure out questions to ask he just said it was all \"academic\". Finally I asked him if I could talk with one of his nurses instead. He didn't really want to do that, but he let me. I told the nurse that I wouldn't mind talking to any \"junior oncs\", but they weren't into that either. It seems like there should be some kind of intermediate person who might handle our questions but I'm not sure who that would be. I'm thankful for the honest and thoughtful answers this forum allows. A.A.",
      "MessageIndex": 4,
      "PostDate": "26/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/938-Genentech-Announcement-about-Herceptin-for-Early-Stage-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Genentech Announcement about Herceptin for Early Stage bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks! Ido space out my calcium 3 times a day but didn't know the same was true for vitamin D. I have read that if you have your skin fairly well exposed and are in the sunlight, it MAY take as little as 15 minutes a day to get enough vitamin D. I'm not so sure about the limit on the amount of vitamin D. I will see if I can find the info I have on it, but from what I remember, it said that you can store up excess vitamin D (which is helpful for those in dark climates who have occasional sunshine).",
      "MessageIndex": 2,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1008-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Title": "AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Sam and Muttsmom, I have to guts it out a bit here to get any sun at all about 2/3 of the year... sometimes I'm out there in my swimsuit when it is 30 degrees (not for long, though!) In summer it can get as warm as the 80's on rare occasion. I haven't found anything that really works for the dry skin either, although I try to use lotion with aloe because aloe is so healing for burns. I appreciate the info on sun blocker. I'm not much of a sun worshiper so if I am going to get out there at times when it is less than enjoyable I need to know whether it is working or not. As with many natural things we can do to help ourselves, I think that just because SOME things have been discovered about various vitamins, etc., it doesn't mean that there isn't more to them that we just haven't figured out yet. A.A.",
      "MessageIndex": 7,
      "PostDate": "05/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1008-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Title": "AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Leo, I spent 1 1/2 years on tamoxifen but bailed out because I don't know how to tell whether I might have a high level of AIB1 (I am HER2+++). Does anyone know whether the question of cross-talk applies to raloxifene as well as tamoxifen, since they are both SERMs? I am considering trying raloxifene as I am not quite enamored of the aromatase inhibitors. Is all of this discussion based on in vitro? Is there a way to learn whether one has a high level of AIB1?",
      "MessageIndex": 0,
      "PostDate": "01/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/274-HER2-to-ER-cross-talk-and-SERMs?s=1b276477decf6519c562df0329af5289",
      "Title": "HER2-to-ER cross-talk, and SERMs"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I live in a rain forest so most of the time it doesn't cost me anything to avoid too much sun (!), and I avoid tanning beds because I've seen enough skin cancer that other people have had to convince me... but on the other hand, most of us with bc need the vitamin D to help the bones actually absorb all the extra calcium and other minerals we are taking... so I do try to get 20 minutes of sunshine on the front side and 20 minutes on the back side whenever the sun shines... and I am not using sunscreen for that to get the most vitamin D I can... but am wondering, does anyone know if vitamin D is blocked by sunscreen use? The skin is so terribly dry from menopause that I'd like to use something to protect it but I want the natural vitamin D. I do take cod liver oil on dark days but that still is not as much vitamin D as I should get. AlaskaAngel",
      "MessageIndex": 10,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1008-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Title": "AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Drs. Leo and Lu, I'm just one of the multitude of clamorous people who are early stage, HER2+ and either have already had chemotherapy or are in it now but have not had recurrence... and am wondering what the announcement means for us? (And of course you are 2 of the multitude of doctors who are being asked this question no doubt... I am empathetic... ) Thanks, AlaskaAngel",
      "MessageIndex": 0,
      "PostDate": "26/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/938-Genentech-Announcement-about-Herceptin-for-Early-Stage-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Genentech Announcement about Herceptin for Early Stage bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks Dr. Leo. I sure wouldn't want to be the poor gal answering the phone at the onc's office today... I'm delighted by the news, though, for anyone who benefits. A.A.",
      "MessageIndex": 2,
      "PostDate": "26/04/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/938-Genentech-Announcement-about-Herceptin-for-Early-Stage-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Genentech Announcement about Herceptin for Early Stage bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "If you hear more about this from time I'll be watching, Dr. Leo! Thanks!",
      "MessageIndex": 3,
      "PostDate": "31/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/505-Research-into-new-detection-method-for-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Research into new detection method for bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "RE: DCIS vs cancerization of lobules On the contrary, Muttsmom, I found your references helpful and interesting, so thanks very much for them. I just sort of fed back to you my interpretation of all of what I'd seen and read. Hopefully Leo will straighten all of us out if any of it is off-kilter! A.A.",
      "MessageIndex": 7,
      "PostDate": "02/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you Dr. Leo. I didn't want to get any more complicated than necessary, or confuse anyone. I just didn't understand why cancerization of lobules (COL) wasn't the same thing as what is called lobular cancer, since the lobules were \"cancerized\".... It does make a difference for me personally with my path report and now I understand it better. A.A.",
      "MessageIndex": 9,
      "PostDate": "04/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Once anyone is diagnosed with cancer, it is harder for everyone to figure out what actually is going on inside because cancer doesn't always just stay where it starts out. If you are like most of us, you will notice every ache and pain that you really didn't pay much attention to before, and you will also have more aches and pains than you had before because treatment is hard on everyone, whether it is chemo or the medicines you get to keep cancer from coming back. For me costochondritis affected both sides even though I only had a left lumpectomy. I've noticed that every time I have some kind of radiographic imaging it flares up again (mammograms, chest x-rays, etc.). It takes a while to get a feel for what feels like what. It is kind of nerve-wracking because it is possible to have mets to bone (like the ribs) and how are we supposed to be able to tell which is which? I think your approach to finding a new doctor is a good one. Be sure to go online and look on your state medical board site to see if there is any negative information there about any doc you see. I learned the hard way -- the surgeon who did my biopsy had a past history in another state and I didn't know it... fortunately by the time she had biopsied me I knew something was not \"right\" and I got a second opinion and a very good surgeon who did the lumpectomy. You and I both ended up having what is suspected to be fatty liver (although for different reasons), and like you, I was having some mildly abnormal labs prior to being diagnosed with cancer that are still slightly abnormal, so even though chemo is very hard on the liver I can't blame the problem on chemo. Is your sore area on the \"good\" breast still sore, with intermittent sharp stabbing pains? If so, that still seems to me like the top priority. A.A.",
      "MessageIndex": 7,
      "PostDate": "24/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/691-Very-painful-breast?s=1b276477decf6519c562df0329af5289",
      "Title": "Very painful breast"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I found out that until I was the one who actually had the pain personally I didn't know how hard it is to tell which ones are dangerous and which ones aren't! I STILL have trouble with it and I'm more than 2 years out from the end of treatment. How are we supposed to tell the difference between costochondritis versus rib pain from metastasis to the bones? The problem really is not personal paranoia, the problem is the sneakiness of cancer. Medical providers should at least tell all breast cancer patients about costochondritis after surgery. It is hard enough to deal with all the anxiety we have. Do you have any ideas or connections to help you smoke out some good doctors? What country do you live in... where are you?",
      "MessageIndex": 15,
      "PostDate": "21/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/691-Very-painful-breast?s=1b276477decf6519c562df0329af5289",
      "Title": "Very painful breast"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "From the amount of testing you have had I would guess that you may have already considered whether or not the rib pain is costochondritis...? You could have two things occurring at once, with one being costchondritis. Do you understand what that is? The stabbing pains and sore area of the other breast that you say is so far benign to exams is something I would continue to try to investigate, especially since you are losing the docs you have some experience in dealing with. Do you currently still have access by your insurance to a nurse call line to see if they have any suggestions? I've used the one connected to my insurance several times (BlueCross or Aetna and perhaps others). A site that provides trained social workers who may be helpful is cancercare.org, also at 1-800-HOPE. AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "20/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/691-Very-painful-breast?s=1b276477decf6519c562df0329af5289",
      "Title": "Very painful breast"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Once anyone is diagnosed with cancer, it is harder for everyone to figure out what actually is going on inside because cancer doesn't always just stay where it starts out. If you are like most of us, you will notice every ache and pain that you really didn't pay much attention to before, and you will also have more aches and pains than you had before because treatment is hard on everyone, whether it is chemo or the medicines you get to keep cancer from coming back. For me costochondritis affected both sides even though I only had a left lumpectomy. I've noticed that every time I have some kind of radiographic imaging it flares up again (mammograms, chest x-rays, etc.). It takes a while to get a feel for what feels like what. It is kind of nerve-wracking because it is possible to have mets to bone (like the ribs) and how are we supposed to be able to tell which is which? I think your approach to finding a new doctor is a good one. Be sure to go online and look on your state medical board site to see if there is any negative information there about any doc you see. I learned the hard way -- the surgeon who did my biopsy had a past history in another state and I didn't know it... fortunately by the time she had biopsied me I knew something was not \"right\" and I got a second opinion and a very good surgeon who did the lumpectomy. You and I both ended up having what is suspected to be fatty liver (although for different reasons), and like you, I was having some mildly abnormal labs prior to being diagnosed with cancer that are still slightly abnormal, so even though chemo is very hard on the liver I can't blame the problem on chemo. Is your sore area on the \"good\" breast still sore, with intermittent sharp stabbing pains? If so, that still seems to me like the top priority. A.A.",
      "MessageIndex": 17,
      "PostDate": "24/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/691-Very-painful-breast?s=1b276477decf6519c562df0329af5289",
      "Title": "Very painful breast"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "In regard to Just Get Me Through It, I agree with you FiddleDeDe. The book has some practical recommendations, but its focus is pretty myopic as it is written from the viewpoint of treatment for someone who is stage I or II and doesn't really think beyond that. I found that tuning in to many of the telephone conferences and online discussions offered by Cancercare was worth the time, regardless of stage. I used Dr. Love's books (including her menopause and hormone book); Dr. Link's books; Living Beyond Breast Cancer, by Marisa Wiess, and many, many textbooks. Here are a few more recommendations I am still hoping to read, with the recommendations from other women: \"After Breast Cancer\", by Musa Mayer \"The Victoria's Secret Catalog Never Stops Coming\" by Jennie Nash. It too is a positive spin on what we learn because we have bc. \"The Breast Reconstruction Guidebook: Issues and Answers from Research to Recovery\" by Kathy Steligo- if you're going thru reconstruction buy this one! AlaskaAngel",
      "MessageIndex": 14,
      "PostDate": "04/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/620-Books?s=1b276477decf6519c562df0329af5289",
      "Title": "Books"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Definately I will be thinking of you, Madge, and hoping your appointment is a good one. I haven't read that book myself, but the comment was from the woman in another forum who read it, and I do want to read it too. I had another book with really good chapters on reconstruction and sent it to a survivor in Oroville, and will see if I can get her to tell me the title of that book too, as I didn't write it down before sending it to her. A.A.",
      "MessageIndex": 16,
      "PostDate": "04/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/620-Books?s=1b276477decf6519c562df0329af5289",
      "Title": "Books"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi, I've been lurking to see what other answers might surface here, and now I am wondering whether your WBC is climbing yet at all? I don't know how useful this information is, but my WBC also rose after treatment and then fell again (although not as much as yours). One thing I really appreciate is that my docs pay attention and continue to follow the counts WITH me. That gives me confidence that whatever is happening they are doing their best with me. My onc is also a hematologist and after a recent CBC done around Christmas-time he took the time to call and left a brief message acknowledging the length of time I have been out of treatment (2 years) but also indicating that he expects them to rise. I believe him. One alternative source suggested using thymus extract as a possibility. I actually did buy some but have not taken it as it is bovine and from another country and I just couldn't get past the notion of mad cow disease.... I chose instead to go for doing what I can to bring about better bone health in general -- anaylzing what to eat and what not to, plus getting the natural sunshine for vitamin D, getting enough calcium and magnesium and vitamin C to build bone, plus adding in some weightbearing exercise. My counts in general have improved, for whatever that is worth. Best wishes, A.A.",
      "MessageIndex": 5,
      "PostDate": "06/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/622-suggest-on-how-to-raise-WBC?s=1b276477decf6519c562df0329af5289",
      "Title": "suggest on how to raise WBC"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Molecular breast imaging sensitive for detecting smallest tumors Anne Harding Reuters Health Posting Date: January 20, 2005 Last Updated: 2005-01-20 15:09:12 -0400 (Reuters Health) NEW YORK (Reuters Health) - A technique called molecular breast imaging (MBI) is highly sensitive in detecting small lesions and can also spot tumors missed by mammography and ultrasound, according to a report in the January issue of Mayo Clinic Proceedings. The results on the first 100 patients are \"just staggering,\" lead author Dr. Deborah J. Rhodes of the Mayo Clinic College of Medicine in Rochester, Minnesota, told Reuters Health. \"This technique really has many, many implications and many potential applications, but we certainly need further studies.\" Dr. Rhodes and her colleagues have improved on scintimammography by building a gamma camera specifically designed to image the breast. The cadmium-zinc-telluride system measures uptake in breast tissue after technetium Tc 99m sestamibi injection. In their report, they describe the findings for the first 40 patients. All of the women had lesions 2 cm or smaller identified by mammography as \"highly suggestive of malignancy,\" and were scheduled for needle biopsy. The women all had MBI within a day of mammography. Twenty-six of the women had a total of 36 malignant lesions. MBI detected 33 lesions, for a sensitivity of 92%, and 19 of 21 lesions 1 cm or smaller, for a sensitivity of 86%. MBI also identified four lesions missed by both mammography and ultrasound. Scintimammography is used to complement mammography, the researchers note, but the design of conventional gamma cameras makes thorough imaging of the breast difficult and detection of smaller lesions impossible. The camera the researchers developed not only can identify smaller lesions, they note; it also uses lighter compression than employed by mammography systems, making it more tolerable to patients. MBI may be particularly useful in patients with dense breast parenchyma, in whom standard mammography is much less sensitive, or women who are at greater risk of breast cancer, the researchers note. Relative disadvantages of MBI, they continue, include the necessity of radiotracer injections and the longer time required (40 to 50 minutes compared to 15 minutes). However, Dr. Rhodes said her group is developing a double-headed version of their MBI camera that will cut imaging time in half. MBI has a number of advantages over MRI for detecting breast cancer, according to Dr. Rhodes. While MRI requires radiologists to sift through hundreds of images and interpretation is subjective, \"the interpretation of these images is really pretty binary -- there's either an abnormality or there's not.\" She added that once it is in wider use, the cost of MBI will likely be reduced. Dr. Rhodes and her colleagues are now planning a study of MBI screening as an adjunct to mammography in women with dense breast tissue or a history of breast cancer or both. The method could also be useful in a number of other situations, she added, for example patients with LCIS on prior biopsy; patients with biopsy-proven cancer who are going to surgery; or breast cancer patients with scar tissue from surgery or radiation. \"These are all areas that we're going to be investigating in the very near future,\" Dr. Rhodes added. In an accompanying editorial, Dr. Rachel F. Brem of The George Washington University Medical Center, Washington, DC, calls the study \"an important contribution to the field of molecular/physiologic imaging for the diagnosis of breast cancer.\" Mayo Clin Proc 2005;80:17-18,24-30.",
      "MessageIndex": 0,
      "PostDate": "28/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/505-Research-into-new-detection-method-for-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Research into new detection method for bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I'm sorry to hear you went through all that as part of treatment that is hard to do in the first place. It is harder to follow through after something like that. My treatment happened before the current regimen became standard, so the drugs I had were different. For better or worse, I opted not to have any hematopoietic stimulant throughout treatment. I also had a few weird experiences with treatment that made it a little harder to go through with it. For better or worse, each time I chose to continue. One episode was a week of not being able to coordinate my brain with my fingers, and my fingers are part of how I make a living so that was difficult for me. Another episode was when I lost my eyesight for a very, very brief period of time. The medications hadn't changed, and no one knew what caused these problems or why they went away. Thanks for sharing what you learned from your experience, and good luck with the rest of your treatments. A.A.",
      "MessageIndex": 16,
      "PostDate": "18/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/673-Severe-Reaction-Rushed-to-Hospital?s=1b276477decf6519c562df0329af5289",
      "Title": "Severe Reaction -Rushed to Hospital"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Dr. Leo, what is the difference between these two? A.A.",
      "MessageIndex": 0,
      "PostDate": "02/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Neighbor! Ann, if you don't already know about it, there is a Canadian breast cancer forum that might also be helpful to you. I've learned a lot there. bcs.ns.ca or bcans I'm sorry you are having to face treatment. -AlaskaAngel",
      "MessageIndex": 5,
      "PostDate": "08/03/2008",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/6394-Update-on-my-breast-cancer-tests?s=1b276477decf6519c562df0329af5289",
      "Title": "Update on my breast cancer tests"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "RE: LCIS vs cancerization of lobules I don't know.... In the report I was reading I got the impression that cancerization of the lobules wasn't the same thing as invasive lobular cancer, so I'm confused.",
      "MessageIndex": 2,
      "PostDate": "02/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I live in a rain forest so most of the time it doesn't cost me anything to avoid too much sun (!), and I avoid tanning beds because I've seen enough skin cancer that other people have had to convince me... but on the other hand, most of us with bc need the vitamin D to help the bones actually absorb all the extra calcium and other minerals we are taking... so I do try to get 20 minutes of sunshine on the front side and 20 minutes on the back side whenever the sun shines... and I am not using sunscreen for that to get the most vitamin D I can... but am wondering, does anyone know if vitamin D is blocked by sunscreen use? The skin is so terribly dry from menopause that I'd like to use something to protect it but I want the natural vitamin D. I do take cod liver oil on dark days but that still is not as much vitamin D as I should get. AlaskaAngel",
      "MessageIndex": 0,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1008-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Title": "AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I found out that until I was the one who actually had the pain personally I didn't know how hard it is to tell which ones are dangerous and which ones aren't! I STILL have trouble with it and I'm more than 2 years out from the end of treatment. How are we supposed to tell the difference between costochondritis versus rib pain from metastasis to the bones? The problem really is not personal paranoia, the problem is the sneakiness of cancer. Medical providers should at least tell all breast cancer patients about costochondritis after surgery. It is hard enough to deal with all the anxiety we have. Do you have any ideas or connections to help you smoke out some good doctors? What country do you live in... where are you?",
      "MessageIndex": 5,
      "PostDate": "21/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/691-Very-painful-breast?s=1b276477decf6519c562df0329af5289",
      "Title": "Very painful breast"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I live far from my onc so haven't had hardly any contact with him after completing chemo and rads, but right after rads was done I did have an appointment with him and a CBC was automatically done with that appointment. The docs I know here in my home town see bc patients the first 2 years every 3 or 4 months and a CBC is always done with those appointments. The docs differ more in terms of having marker blood draws, some do and some don't (but the ones with the most experience and training do). After the first 2 years post-treatment, the docs here see bc patients every 6 months for the next 3 years. I am 2 years out from chemo and rads, and my blood counts are still just below normal. I have re-read every book and pamphlet I had at time of diagnosis and none of them provide any warning that this is going to be normal after chemo or rads. I do feel that not being told this could happen is just as bad as lying about it, since the blood cell counts are major parts of our immune systems and the immune system is pretty important for those who do end up dealing with recurrence. My focus in dealing with the low counts has been 3-fold. I try to have a tiny piece of liver twice a week to provide more iron (and more alpha-lipoic acid). I try to get whatever direct sunshine I can for 15-40 minutes a day (which is not often in Alaska in winter but I do the best I can, as I think bone health promotes blood health). And I try to get 20 minutes a day of some aerobic exercise. My blood counts improved somewhat at the end of 3 months of concentrated effort to do those things. However, recently they have been dropping again, perhaps due to the onset of winter or perhaps due to something related to the mysterious rise in liver enzymes. If I were you I would ask for a CBC and liver enzymes to be done at least yearly if not every 6 months. Mine are done quarterly and I am NED, Stage 1, HER2+++.",
      "MessageIndex": 5,
      "PostDate": "16/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/330-Bloodwork-is-Low-at-1-yr-Ann?s=1b276477decf6519c562df0329af5289",
      "Title": "Bloodwork is Low at 1 yr Ann"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks! Ido space out my calcium 3 times a day but didn't know the same was true for vitamin D. I have read that if you have your skin fairly well exposed and are in the sunlight, it MAY take as little as 15 minutes a day to get enough vitamin D. I'm not so sure about the limit on the amount of vitamin D. I will see if I can find the info I have on it, but from what I remember, it said that you can store up excess vitamin D (which is helpful for those in dark climates who have occasional sunshine).",
      "MessageIndex": 12,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1008-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Title": "AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I'm sorry to hear you went through all that as part of treatment that is hard to do in the first place. It is harder to follow through after something like that. My treatment happened before the current regimen became standard, so the drugs I had were different. For better or worse, I opted not to have any hematopoietic stimulant throughout treatment. I also had a few weird experiences with treatment that made it a little harder to go through with it. For better or worse, each time I chose to continue. One episode was a week of not being able to coordinate my brain with my fingers, and my fingers are part of how I make a living so that was difficult for me. Another episode was when I lost my eyesight for a very, very brief period of time. The medications hadn't changed, and no one knew what caused these problems or why they went away. Thanks for sharing what you learned from your experience, and good luck with the rest of your treatments. A.A.",
      "MessageIndex": 6,
      "PostDate": "18/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/673-Severe-Reaction-Rushed-to-Hospital?s=1b276477decf6519c562df0329af5289",
      "Title": "Severe Reaction -Rushed to Hospital"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Dr. Leo, what is the difference between these two? A.A.",
      "MessageIndex": 10,
      "PostDate": "02/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "RE: DCIS vs cancerization of lobules On the contrary, Muttsmom, I found your references helpful and interesting, so thanks very much for them. I just sort of fed back to you my interpretation of all of what I'd seen and read. Hopefully Leo will straighten all of us out if any of it is off-kilter! A.A.",
      "MessageIndex": 17,
      "PostDate": "02/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "From the amount of testing you have had I would guess that you may have already considered whether or not the rib pain is costochondritis...? You could have two things occurring at once, with one being costchondritis. Do you understand what that is? The stabbing pains and sore area of the other breast that you say is so far benign to exams is something I would continue to try to investigate, especially since you are losing the docs you have some experience in dealing with. Do you currently still have access by your insurance to a nurse call line to see if they have any suggestions? I've used the one connected to my insurance several times (BlueCross or Aetna and perhaps others). A site that provides trained social workers who may be helpful is cancercare.org, also at 1-800-HOPE. AlaskaAngel",
      "MessageIndex": 11,
      "PostDate": "20/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/691-Very-painful-breast?s=1b276477decf6519c562df0329af5289",
      "Title": "Very painful breast"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I lived in Juneau for over a year a while back and liked it. Sitka is nice too -- much smaller population (and far fewer politicians than the state capitol!) I'm hoping for the freedom soon to see more of the northern part of the state... A.A.",
      "MessageIndex": 4,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1008-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Title": "AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I lived in Juneau for over a year a while back and liked it. Sitka is nice too -- much smaller population (and far fewer politicians than the state capitol!) I'm hoping for the freedom soon to see more of the northern part of the state... A.A.",
      "MessageIndex": 14,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1008-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Title": "AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Sam and Muttsmom, I have to guts it out a bit here to get any sun at all about 2/3 of the year... sometimes I'm out there in my swimsuit when it is 30 degrees (not for long, though!) In summer it can get as warm as the 80's on rare occasion. I haven't found anything that really works for the dry skin either, although I try to use lotion with aloe because aloe is so healing for burns. I appreciate the info on sun blocker. I'm not much of a sun worshiper so if I am going to get out there at times when it is less than enjoyable I need to know whether it is working or not. As with many natural things we can do to help ourselves, I think that just because SOME things have been discovered about various vitamins, etc., it doesn't mean that there isn't more to them that we just haven't figured out yet. A.A.",
      "MessageIndex": 17,
      "PostDate": "05/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1008-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Title": "AlaskaAngel"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I live far from my onc so haven't had hardly any contact with him after completing chemo and rads, but right after rads was done I did have an appointment with him and a CBC was automatically done with that appointment. The docs I know here in my home town see bc patients the first 2 years every 3 or 4 months and a CBC is always done with those appointments. The docs differ more in terms of having marker blood draws, some do and some don't (but the ones with the most experience and training do). After the first 2 years post-treatment, the docs here see bc patients every 6 months for the next 3 years. I am 2 years out from chemo and rads, and my blood counts are still just below normal. I have re-read every book and pamphlet I had at time of diagnosis and none of them provide any warning that this is going to be normal after chemo or rads. I do feel that not being told this could happen is just as bad as lying about it, since the blood cell counts are major parts of our immune systems and the immune system is pretty important for those who do end up dealing with recurrence. My focus in dealing with the low counts has been 3-fold. I try to have a tiny piece of liver twice a week to provide more iron (and more alpha-lipoic acid). I try to get whatever direct sunshine I can for 15-40 minutes a day (which is not often in Alaska in winter but I do the best I can, as I think bone health promotes blood health). And I try to get 20 minutes a day of some aerobic exercise. My blood counts improved somewhat at the end of 3 months of concentrated effort to do those things. However, recently they have been dropping again, perhaps due to the onset of winter or perhaps due to something related to the mysterious rise in liver enzymes. If I were you I would ask for a CBC and liver enzymes to be done at least yearly if not every 6 months. Mine are done quarterly and I am NED, Stage 1, HER2+++.",
      "MessageIndex": 15,
      "PostDate": "16/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/330-Bloodwork-is-Low-at-1-yr-Ann?s=1b276477decf6519c562df0329af5289",
      "Title": "Bloodwork is Low at 1 yr Ann"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I live far from my onc so haven't had hardly any contact with him after completing chemo and rads, but right after rads was done I did have an appointment with him and a CBC was automatically done with that appointment. The docs I know here in my home town see bc patients the first 2 years every 3 or 4 months and a CBC is always done with those appointments. The docs differ more in terms of having marker blood draws, some do and some don't (but the ones with the most experience and training do). After the first 2 years post-treatment, the docs here see bc patients every 6 months for the next 3 years. I am 2 years out from chemo and rads, and my blood counts are still just below normal. I have re-read every book and pamphlet I had at time of diagnosis and none of them provide any warning that this is going to be normal after chemo or rads. I do feel that not being told this could happen is just as bad as lying about it, since the blood cell counts are major parts of our immune systems and the immune system is pretty important for those who do end up dealing with recurrence. My focus in dealing with the low counts has been 3-fold. I try to have a tiny piece of liver twice a week to provide more iron (and more alpha-lipoic acid). I try to get whatever direct sunshine I can for 15-40 minutes a day (which is not often in Alaska in winter but I do the best I can, as I think bone health promotes blood health). And I try to get 20 minutes a day of some aerobic exercise. My blood counts improved somewhat at the end of 3 months of concentrated effort to do those things. However, recently they have been dropping again, perhaps due to the onset of winter or perhaps due to something related to the mysterious rise in liver enzymes. If I were you I would ask for a CBC and liver enzymes to be done at least yearly if not every 6 months. Mine are done quarterly and I am NED, Stage 1, HER2+++.",
      "MessageIndex": 25,
      "PostDate": "16/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/330-Bloodwork-is-Low-at-1-yr-Ann?s=1b276477decf6519c562df0329af5289",
      "Title": "Bloodwork is Low at 1 yr Ann"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Glad to hear things are looking good! Are you feeling better and better? A.A.",
      "MessageIndex": 2,
      "PostDate": "11/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/647-Good-News?s=1b276477decf6519c562df0329af5289",
      "Title": "Good News"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "In regard to Just Get Me Through It, I agree with you FiddleDeDe. The book has some practical recommendations, but its focus is pretty myopic as it is written from the viewpoint of treatment for someone who is stage I or II and doesn't really think beyond that. I found that tuning in to many of the telephone conferences and online discussions offered by Cancercare was worth the time, regardless of stage. I used Dr. Love's books (including her menopause and hormone book); Dr. Link's books; Living Beyond Breast Cancer, by Marisa Wiess, and many, many textbooks. Here are a few more recommendations I am still hoping to read, with the recommendations from other women: \"After Breast Cancer\", by Musa Mayer \"The Victoria's Secret Catalog Never Stops Coming\" by Jennie Nash. It too is a positive spin on what we learn because we have bc. \"The Breast Reconstruction Guidebook: Issues and Answers from Research to Recovery\" by Kathy Steligo- if you're going thru reconstruction buy this one! AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "04/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/620-Books?s=1b276477decf6519c562df0329af5289",
      "Title": "Books"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Definately I will be thinking of you, Madge, and hoping your appointment is a good one. I haven't read that book myself, but the comment was from the woman in another forum who read it, and I do want to read it too. I had another book with really good chapters on reconstruction and sent it to a survivor in Oroville, and will see if I can get her to tell me the title of that book too, as I didn't write it down before sending it to her. A.A.",
      "MessageIndex": 6,
      "PostDate": "04/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/620-Books?s=1b276477decf6519c562df0329af5289",
      "Title": "Books"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi, I've been lurking to see what other answers might surface here, and now I am wondering whether your WBC is climbing yet at all? I don't know how useful this information is, but my WBC also rose after treatment and then fell again (although not as much as yours). One thing I really appreciate is that my docs pay attention and continue to follow the counts WITH me. That gives me confidence that whatever is happening they are doing their best with me. My onc is also a hematologist and after a recent CBC done around Christmas-time he took the time to call and left a brief message acknowledging the length of time I have been out of treatment (2 years) but also indicating that he expects them to rise. I believe him. One alternative source suggested using thymus extract as a possibility. I actually did buy some but have not taken it as it is bovine and from another country and I just couldn't get past the notion of mad cow disease.... I chose instead to go for doing what I can to bring about better bone health in general -- anaylzing what to eat and what not to, plus getting the natural sunshine for vitamin D, getting enough calcium and magnesium and vitamin C to build bone, plus adding in some weightbearing exercise. My counts in general have improved, for whatever that is worth. Best wishes, A.A.",
      "MessageIndex": 15,
      "PostDate": "06/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/622-suggest-on-how-to-raise-WBC?s=1b276477decf6519c562df0329af5289",
      "Title": "suggest on how to raise WBC"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "RE: DCIS vs cancerization of lobules Thanks. The mental picture I have of \"cancerization of lobules\" is that the type of cells that normally line the ducts and have become DCIS have \"spilled over\" into the lobules, as either they have outgrown the space available inside the ducts... or else maybe they are ductal lining cells that were at the edge of the lobules and are simply multiplying into the lobules...??? and so these are cells that are in some way distinguishable in appearance from those that normally line the lobules (as well as distinguishable from LCIS)...?",
      "MessageIndex": 4,
      "PostDate": "02/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "RE: LCIS vs cancerization of lobules I don't know.... In the report I was reading I got the impression that cancerization of the lobules wasn't the same thing as invasive lobular cancer, so I'm confused.",
      "MessageIndex": 12,
      "PostDate": "02/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "RE: DCIS vs cancerization of lobules Thanks. The mental picture I have of \"cancerization of lobules\" is that the type of cells that normally line the ducts and have become DCIS have \"spilled over\" into the lobules, as either they have outgrown the space available inside the ducts... or else maybe they are ductal lining cells that were at the edge of the lobules and are simply multiplying into the lobules...??? and so these are cells that are in some way distinguishable in appearance from those that normally line the lobules (as well as distinguishable from LCIS)...?",
      "MessageIndex": 14,
      "PostDate": "02/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you Dr. Leo. I didn't want to get any more complicated than necessary, or confuse anyone. I just didn't understand why cancerization of lobules (COL) wasn't the same thing as what is called lobular cancer, since the lobules were \"cancerized\".... It does make a difference for me personally with my path report and now I understand it better. A.A.",
      "MessageIndex": 19,
      "PostDate": "04/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/400-LCIS-vs-cancerization-of-lobules?s=1b276477decf6519c562df0329af5289",
      "Title": "LCIS vs cancerization of lobules"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Chrissy, I read your post yesterday but didn't answer, thinking that someone with personal experience would respond to you. But that didn't happen so I will give it a shot. You may know that those who get breast cancer at a young age usually have more difficulty with breast cancer than others do, including more often having a strong genetic basis to end up with other cancers. Do you know if your friend has ever been tested to see if her breast cancer tests positive for BRCA1 or BRCA2? Ovarian cancer is usually much harder to deal with than breast cancer simply because it usually isn't found as early in its development and so by the time it is found, it overwhelms the only therapies available to fight it. A website that may be helpful to you is facingourrisk.org so take a look there. I'm sorry your friend (and you) are going through this. AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "31/01/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2459-Help-me-understand-PLEASE!?s=1b276477decf6519c562df0329af5289",
      "Title": "Help me understand PLEASE!"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Here is yet another vote for you to get the biopsy. I did end up not having a biopsy but it was because I had a surgeon who was a dope and recommended against biopsy... and the result for me was that the cancerous lump I had at the time, which was still small enough then not to require chemotherapy, grew... By the time I finally talked the surgeon into doing a biopsy there were a total of 3 different radiologists all recommending biopsy, PLUS the surgeon also had done her own ultrasounds in her office (3 at the hospital, 2 in her office)... I have to HOPE that most surgeons are better than she is... I know the one I went to elsewhere for the actual surgery sure was wonderful. I highly recommend getting the biopsy. Not only that, I personally would insist on an excisional biopsy. I'm wondering, though, if you are feeling so scared that it might be cancer that you are thinking you don't want to find out?",
      "MessageIndex": 15,
      "PostDate": "10/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/437-Biopsy?s=1b276477decf6519c562df0329af5289",
      "Title": "Biopsy"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Sounds to me like you are giving reasonable thought to all the possibilities as you go along. I'm grateful to my doctors for doing markers. They can at times indicate other things, but mine have very much followed my course of treatment and relate very much to my stage, and having them lets me get a feel for what is normal for me and what may not be. Best wishes, A.A.",
      "MessageIndex": 3,
      "PostDate": "17/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1108-Need-some-advice-on-Tumor-markers?s=1b276477decf6519c562df0329af5289",
      "Title": "Need some advice on Tumor markers"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I often wonder if waiting to start an AI would be more beneficial for any particular group of women, say starting it at 5 years after finishing treatment rather than immediately after finishing treatment (assuming of course that one makes it to 5 years). The reason I wonder is because when I look at predictors, the percentages of survival and of recurrence drop so much at around 4 or 5 years for those who aren't on hormonal therapy, but are fairly high for the first couple of years after treatment -- and that trend continues to get worse. In other words, does the protective effect of hormonal therapy diminish over time, so it would be better to start later if one has fairly good odds to begin with?",
      "MessageIndex": 0,
      "PostDate": "17/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/566-Aromatase-inhibitors?s=1b276477decf6519c562df0329af5289",
      "Title": "Aromatase inhibitors"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "How funny you should mention that. In the last week I've had quite a few discussions about the contradictions between earlier and later years, and every conversation has ended up in the same confusion you have. I'd like to hear what the docs have to say about it....",
      "MessageIndex": 2,
      "PostDate": "17/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/566-Aromatase-inhibitors?s=1b276477decf6519c562df0329af5289",
      "Title": "Aromatase inhibitors"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Here is yet another vote for you to get the biopsy. I did end up not having a biopsy but it was because I had a surgeon who was a dope and recommended against biopsy... and the result for me was that the cancerous lump I had at the time, which was still small enough then not to require chemotherapy, grew... By the time I finally talked the surgeon into doing a biopsy there were a total of 3 different radiologists all recommending biopsy, PLUS the surgeon also had done her own ultrasounds in her office (3 at the hospital, 2 in her office)... I have to HOPE that most surgeons are better than she is... I know the one I went to elsewhere for the actual surgery sure was wonderful. I highly recommend getting the biopsy. Not only that, I personally would insist on an excisional biopsy. I'm wondering, though, if you are feeling so scared that it might be cancer that you are thinking you don't want to find out?",
      "MessageIndex": 5,
      "PostDate": "10/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/437-Biopsy?s=1b276477decf6519c562df0329af5289",
      "Title": "Biopsy"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "KEY PORTION OF MESSAGE: At this time, if your cancer care was abruptly interrupted and if you need to find medical care near your new location, please call Dr. Maitland Deland at: 1-800-237-2057. She has been a breast cancer doctor in that area for over twenty years and is already in contact with a large number of doctors and support services. MESSAGE IN ITS ENTIRETY: Dear breastcancer.org Community Member: The world is shocked by the devastation and destruction the people in the Gulf Coast States of the United States are struggling to endure in the wake of Hurricane Katrina. The citizens of Louisiana, Mississippi, and Alabama are facing unimaginable challenges. We at breastcancer.org are in the process of coordinating an initiative to connect breast cancer patients to high-quality treatment centers in the affected areas. People affected by breast cancer have been hit particularly hard. A diagnosis of breast cancer alone is hard enough! It turns your life upside-down, creating uncertainty and anxiety that takes away any peace of mind. And then BOOM -- overnight -- life as you knew it is gone. Any person going through chemotherapy or radiation, any one who just had surgery or whose surgery was cancelled without a back-up plan, is likely to feel anxious and helpless. The lives of doctors, nurses, technologists, therapists, social workers, and other members of the cancer healthcare team from the Gulf Coast States also have been turned upside down. Those healthcare workers who evacuated had to leave patients and clinics behind and can not reach or care for their patients. Dr. Alan Stolier, a member of the breastcancer.org Professional Advisory Board and five-generation New Orlean who is a leading breast cancer surgeon in the area, was able to reconnect with us last night. He shared his own experience with us and his deep concern for patients who are stranded. We at breastcancer.org are in the process of working with Dr. Stolier to help patients from the Gulf Coast States re-establish their medical care with high-quality treatment facilities. Dr. Stolier and other doctors are trying to coordinate care at nearby, high-quality centers in all the affected states. * * * At this time, if your cancer care was abruptly interrupted and if you need to find medical care near your new location, please call Dr. Maitland Deland at: 1-800-237-2057. She has been a breast cancer doctor in that area for over twenty years and is already in contact with a large number of doctors and support services. * * * We realize that many people affected by breast cancer are unable to access the Internet directly at this time. Loved ones, concerned others, and even strangers might be turning to breastcancer.org to help people trying to get the best medical information and their medical care back on track. Please stay tuned for our next communication in the coming days regarding medical services and solutions during these difficult times, including information regarding wound care, medical emergencies during cancer treatment, and getting access to your medical records. We wish you and your family the very best under these difficult circumstances. Sincerely, Marisa Marisa Weiss, M.D. President and Founder www.breastcancer.org",
      "MessageIndex": 0,
      "PostDate": "02/09/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1954-KATRINKA-bc-survivors-chemo-connection?s=1b276477decf6519c562df0329af5289",
      "Title": "KATRINKA bc survivors / chemo connection"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "The communcation between me and my onc has never been adequate, whether it is me that is the problem or him. But also, I am hundreds of miles from him and am seen and treated by my local internist, who consults with the oncologist. My doc is wonderful and very, very busy. I'm 2 1/2 years out from finishing treatment and I haven't seen an oncologist in over a year. I am HER2+++ and never had herceptin. No one has contacted me. I raised the question about additional treatment for those like me in an earlier post here, but I think all of the oncs at the time were at the recent oncologist's conference and were just starting to receive more details about the news themselves. More information is yet to come for them and us about the details of the new information. So far, the ONLY information I have seen about women in our situation has been from other women posting about their visits with their oncologists. These women are being offered the option of taking Herceptin now. Because the outcomes in the study groups were significantly better for those who received chemotherapy at the same time as herceptin, I want to know if there is going to be a clinical trial to demonstrate whether women who originally had chemo that did not include herceptin get better benefit from having some kind of combination treatment with chemo AND Herceptin, rather than just starting Herceptin now. We need to be told what is known and what isn't, not just to be advised about a single option (such as adding Herceptin alone now). If no one knows, then more information needs to be gathered to give us the best advice possible. Since the study groups only contained those who had never been treated for breast cancer, that group also differs from those treated some time ago in that a number of those treated with chemo regimens and no Herceptin have been taking tamoxifen, or an AI, or a sequence of these medications. So that too may need to be dealt with through the process of additional clinical trials. But silence is not the answer to these questions. AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "24/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1163-Herceptin-for-earlier-stages-of-her2-patients?s=1b276477decf6519c562df0329af5289",
      "Title": "Herceptin for earlier stages of her2 patients"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Kristin, One thing I can tell you for sure in the truest sense of what being a nurse is; modern public health at a minimum should now include determining the most accurate clinical test for HER2, and then offering it to those diagnosed with bc; and then requiring that the results be given to the patient along with a standardized informative handout explaining the importance of being tested and what treatments there are for it. Anything less is not modern public health. I hope the field of oncology is up to setting that minimum standard. One wonders if those of us who are HER2+++ and who were never offered Herceptin are supposed to just die off?",
      "MessageIndex": 4,
      "PostDate": "30/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1163-Herceptin-for-earlier-stages-of-her2-patients?s=1b276477decf6519c562df0329af5289",
      "Title": "Herceptin for earlier stages of her2 patients"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Roxanne Just want to mention that I had my abdominal ultrasound to check out my \"spots\", and everything came back fine. AlaskaAngel",
      "MessageIndex": 19,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/939-Liver-spots-per-CT-Scan?s=1b276477decf6519c562df0329af5289",
      "Title": "Liver spots per CT Scan"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Roxi. I have a \"spot\" that is likely a cyst in one kidney they are watching with 4 to 6-month ultrasounds and am due to have one next week. They also use the same ultrasound to watch 2 likely hemangiomas in the liver that have been there for years now and haven't changed. And I have had mildly elevated liver function tests even before diagnosis several years ago that sort of bump along. AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "26/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/939-Liver-spots-per-CT-Scan?s=1b276477decf6519c562df0329af5289",
      "Title": "Liver spots per CT Scan"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "There still seems to be a misunderstanding among women on breast cancer sites about chemotherapy for early stage bc. Some women in these stages may benefit from chemo. However, there are some women in the early stages whose cancer characteristics do not indicate the need for chemo, but they are so worried about cancer that they want to \"throw everything at cancer\" that they can. I'd encourage anyone with early stage bc who is considering chemotherapy to listen to the taped discussion of Musa Mayer on a recent NPR Fresh Aire radio program. AlaskaAngel",
      "MessageIndex": 0,
      "PostDate": "04/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1009-Treatment-for-early-stage-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Treatment for early stage bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Roxi. I have a \"spot\" that is likely a cyst in one kidney they are watching with 4 to 6-month ultrasounds and am due to have one next week. They also use the same ultrasound to watch 2 likely hemangiomas in the liver that have been there for years now and haven't changed. And I have had mildly elevated liver function tests even before diagnosis several years ago that sort of bump along. AlaskaAngel",
      "MessageIndex": 11,
      "PostDate": "26/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/939-Liver-spots-per-CT-Scan?s=1b276477decf6519c562df0329af5289",
      "Title": "Liver spots per CT Scan"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks Susan for the book recommendation - I've added it to my list. As a society we want to put out the money and take medicine as the complete answer to a problem that is not that simple. However, when it comes to chemotherapy the medicine is not relatively harmless. There is a rough \"breaking point\" for those with early stage bc where chemotherapy is considered to be more likely to be harmful than helpful. What I have seen in many forums is an emphasis by many women who do not understand this, in effect saying that it is better to do chemo no matter how early you are diagnosed. We are all tempted to go to extremes because we are afraid, and we all want to try to protect each other. But we should not be advising blanket use of chemotherapy, and in effect, try to scare the people in this group to choose it. These people might want to get more than one opinion from oncologists but in the end they do have a tough decision to make. In that sense it is difficult for them not to be intimidated into doing chemo, and not to endlessly wonder if they made a good decision. AlaskaAngel",
      "MessageIndex": 8,
      "PostDate": "24/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1009-Treatment-for-early-stage-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Treatment for early stage bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "There still seems to be a misunderstanding among women on breast cancer sites about chemotherapy for early stage bc. Some women in these stages may benefit from chemo. However, there are some women in the early stages whose cancer characteristics do not indicate the need for chemo, but they are so worried about cancer that they want to \"throw everything at cancer\" that they can. I'd encourage anyone with early stage bc who is considering chemotherapy to listen to the taped discussion of Musa Mayer on a recent NPR Fresh Aire radio program. AlaskaAngel",
      "MessageIndex": 10,
      "PostDate": "04/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1009-Treatment-for-early-stage-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Treatment for early stage bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks Susan for the book recommendation - I've added it to my list. As a society we want to put out the money and take medicine as the complete answer to a problem that is not that simple. However, when it comes to chemotherapy the medicine is not relatively harmless. There is a rough \"breaking point\" for those with early stage bc where chemotherapy is considered to be more likely to be harmful than helpful. What I have seen in many forums is an emphasis by many women who do not understand this, in effect saying that it is better to do chemo no matter how early you are diagnosed. We are all tempted to go to extremes because we are afraid, and we all want to try to protect each other. But we should not be advising blanket use of chemotherapy, and in effect, try to scare the people in this group to choose it. These people might want to get more than one opinion from oncologists but in the end they do have a tough decision to make. In that sense it is difficult for them not to be intimidated into doing chemo, and not to endlessly wonder if they made a good decision. AlaskaAngel",
      "MessageIndex": 18,
      "PostDate": "24/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1009-Treatment-for-early-stage-bc?s=1b276477decf6519c562df0329af5289",
      "Title": "Treatment for early stage bc"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Sue. Good to see you too! Thanks for re-posting the notice for the number. There probably will eventually be other organized means for communications for these folks, but for now at least it is a start and who knows how it might help, including just giving the doctors who treat any bc survivors there a clue toward talking with the doctors who treated those patients originally. I've been waking up feeling anxious every morning and I'm sure it is because of the drastic tragic aspects of the hurricane. I don't know whether anyone I know was there in it, or not. It is hard to imagine having to deal with cancer treatment on top of all else they are coping with. A.A.",
      "MessageIndex": 2,
      "PostDate": "03/09/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1954-KATRINKA-bc-survivors-chemo-connection?s=1b276477decf6519c562df0329af5289",
      "Title": "KATRINKA bc survivors / chemo connection"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Roxi. I have a \"spot\" that is likely a cyst in one kidney they are watching with 4 to 6-month ultrasounds and am due to have one next week. They also use the same ultrasound to watch 2 likely hemangiomas in the liver that have been there for years now and haven't changed. And I have had mildly elevated liver function tests even before diagnosis several years ago that sort of bump along. AlaskaAngel",
      "MessageIndex": 21,
      "PostDate": "26/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/939-Liver-spots-per-CT-Scan?s=1b276477decf6519c562df0329af5289",
      "Title": "Liver spots per CT Scan"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you very much Dr. Lu. The article explains the complications for this type of brachytherapy. Is there any kind of comparison available to the current common radiatoin treatments and the complications experienced with that form of treatment? A.A.",
      "MessageIndex": 3,
      "PostDate": "01/03/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/609-mamosite-brachyotherapy?s=1b276477decf6519c562df0329af5289",
      "Title": "mamosite/brachyotherapy"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Sue, I just read the discussion in the string below as you and Nancy were waiting for the hurricane to begin... I'm so glad you have made contact with the members of your family. AlaskaAngel",
      "MessageIndex": 5,
      "PostDate": "03/09/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1904-Mssue?s=1b276477decf6519c562df0329af5289",
      "Title": "Mssue"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Roxanne Just want to mention that I had my abdominal ultrasound to check out my \"spots\", and everything came back fine. AlaskaAngel",
      "MessageIndex": 9,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/939-Liver-spots-per-CT-Scan?s=1b276477decf6519c562df0329af5289",
      "Title": "Liver spots per CT Scan"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Roxanne Just want to mention that I had my abdominal ultrasound to check out my \"spots\", and everything came back fine. AlaskaAngel",
      "MessageIndex": 29,
      "PostDate": "04/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/939-Liver-spots-per-CT-Scan?s=1b276477decf6519c562df0329af5289",
      "Title": "Liver spots per CT Scan"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I'd like to hear the docs ideas on this too. At time of my dx several years ago I looked high and low to try to find a clinical trial for brachytherapy so that I could get access to it. I asked my onc about that, too. But it wasn't there at the time for me. I agree with you. I did the conventional rads treatments (left breast). The ONLY sensation my breast has is discomfort... Also, I ended up with \"fatty necrosis\" at the base of the breast, which is a very hard ridge of tissue that feels like a bone sticking out from the chest. I also have repeated bouts of costochondritis every time I have a chest x-ray or other rads that take a while to settle down again. I am NED, which counts of course, but I wish I could have found access to brachytherapy. A.A.",
      "MessageIndex": 1,
      "PostDate": "28/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/609-mamosite-brachyotherapy?s=1b276477decf6519c562df0329af5289",
      "Title": "mamosite/brachyotherapy"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Rachelle. You are doing your best in continuing to get this checked out. You are younger than most, but yes, there are some women who are only in their 20's who do get breast cancer. The vast majority of women are also not aware that some forms of breast cancer are especially difficult to detect. Science has created some ways (like mammograms) to look for breast cancers, but there are different kinds of breast cancer and some don't show up well even on mammograms. Going through the uncertainty while you are being tested is hard, and it is harder still if you complained some time ago about it to begin with. But even so, all you have to work with is the present. ***Doing your own research is your best protection***. Lymph nodes do swell up for other reasons besides breast cancer, but I have 2 books to recommend to you if it turns out to be breast cancer. One is Dr. Susan Love's Breast Book. The other is Take Charge of Your Breast Cancer, by Dr. John Link. One other recommendation I have is that you continue to participate in sites like this one. You will learn an awful lot whether or not you are diagnosed with breast cancer, and maybe avoid making many of the mistakes some of us have made as we stumbled around ourselves. Why were the hormones prescribed for you? AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "13/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/763-I-am-so-lost!!!?s=1b276477decf6519c562df0329af5289",
      "Title": "I am so lost!!!"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Oncologists are the ones who have to open the door to things we would rather not experience, so being mad at them for it is real. I felt closest to my onc when I read about some of the things he has done in his field that showed real professional integrity. I also found the book, The Anatomy of Hope, by Jerome Groupman, took away a lot of the hard feelings for me. I'm going to have to read it again. I know each \"case\" of breast cancer is presented at tumor board where it gets discussed and a treatment plan is developed, but without somone there like an endocrinologist and a psychiatrist/psychologist how can they possibly make an educated plan? A.A.",
      "MessageIndex": 8,
      "PostDate": "20/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/574-Future-test-for-node-negative-prediction-for-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Future test for node-negative prediction for mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I know THAT feeling. I am self-employed too. I was able to take my work with me, but that just meant doing it whether I felt good or whether I didn't. One option available here is the local cancer fund, which allows at least some $ to pay bills for cancer, not a lot but some. You might check and see if there is one where you are. A.A.",
      "MessageIndex": 1,
      "PostDate": "27/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/950-Breast-Cancer-and-disability?s=1b276477decf6519c562df0329af5289",
      "Title": "Breast Cancer and disability"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "What I had wondered about this was whether calcium depletion of the teeth was affected by chemo. My understanding of that question is that the teeth are already formed so low calcium isn't much of an issue. So... then why did the large teeth in the back fall apart immediately after chemo? I had one literally crack in half, two pieces... I think chemo leaches something out of the teeth but I don't know what.",
      "MessageIndex": 3,
      "PostDate": "15/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/451-Accelerated-tooth-decay-post-chemo?s=1b276477decf6519c562df0329af5289",
      "Title": "Accelerated tooth decay post chemo?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "What I had wondered about this was whether calcium depletion of the teeth was affected by chemo. My understanding of that question is that the teeth are already formed so low calcium isn't much of an issue. So... then why did the large teeth in the back fall apart immediately after chemo? I had one literally crack in half, two pieces... I think chemo leaches something out of the teeth but I don't know what.",
      "MessageIndex": 13,
      "PostDate": "15/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/451-Accelerated-tooth-decay-post-chemo?s=1b276477decf6519c562df0329af5289",
      "Title": "Accelerated tooth decay post chemo?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "You decide: Fight brews over natural vs. synthetic hormone treatments http://www.azcentral.com/php-bin/cli...il.php/5400342 AlaskaAngel",
      "MessageIndex": 0,
      "PostDate": "28/07/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/3324-Natural-vs-synthetic-choices?s=1b276477decf6519c562df0329af5289",
      "Title": "Natural vs synthetic choices"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Protective effects of calcium on colorectal polyps persist Megan Rauscher Reuters Health Posting Date: April 20, 2005 Last Updated: 2005-04-20 10:25:27 -0400 (Reuters Health) ANAHEIM, California (Reuters Health) - The protective effects of calcium supplementation on colorectal polyps appears to persist for up to 5 years after people stop taking the supplements, according to a study presented this week at the 96th annual meeting of the American Association for Cancer Research. \"There is ample epidemiological and experimental data suggesting the a high intake of calcium may decrease the risk of colorectal cancer,\" Dr. John A. Baron from Dartmouth Medical School in Lebanon, New Hampshire said during a briefing with reporters. In 1999, data from the Calcium Polyp Prevention Study involving 930 adults randomized to placebo or 1200 milligrams calcium daily for 4 years showed a 20% reduction in the risk of all colorectal adenomas with calcium supplementation. At the AACR meeting, Dr. Baron reported data on 822 of the original subjects who were followed for at least 5 years after the end of the treatment phase. \"Within the 5 years after the end of randomized treatment, there was a marked effect of the initial treatment assignment on hyperplastic polyps and all adenomas,\" Dr. Baron reported. After adjusting for the use of calcium supplements after the primary study was over, there was a 41% reduction in the risk of hyperplastic polyps and a 35% reduction in risk of all adenomas during the first 5 years after the study. \"These were more pronounced reductions than were seen during the treatment phase,\" Dr. Baron said. This reduction in risk did not persist beyond 5 years since cessation of active treatment. These data, Dr. Baron said, indicate that \"calcium is effective in reducing the risk of colorectal adenomas and, after the end of the supplementation, there is no rebound in risk at all. In fact there appears to be a delayed more pronounced suppression of colorectal neoplasia during the 5 years after treatment.\"",
      "MessageIndex": 0,
      "PostDate": "20/04/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/879-Benefits-of-Calcium-Supplementation?s=1b276477decf6519c562df0329af5289",
      "Title": "Benefits of Calcium Supplementation"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Welcome. I'm self-employed so there wasn't much of a choice for me, either. I did set up a substitute to do my work for the very first chemo as I am chemophobic to begin with, but as fate would have it, she was medivac'd out unexpectedly with a very sick baby to Seattle the night before my first chemo. I know what nursing jobs are like. Your wife has lots of good things going for her -- she isn't as lost as many women are in trying to understand the basics about chemo or breast cancer; she has a partner who is actively seeking to help her; and hospice work is physically somewhat gentler than regular floor nursing -- although it is hard to say whether it is the best thing right now for her mentally. The most helpful thing for me was the people who were \"there\" when I needed someone. My husband has been wonderful. He is in tune with when I am overwhelmed by anything and knows when to step in and provide guidance or simple practical \"doing the dishes, taking the dog to the vet\" help. He doesn't keep track of our paperwork so at one point when we both were in the Lower 48 while I went through rads, by the time we got back it was hard to handle that, but I just did what I could every day and gradually got things back together. My sister was terrific, too. Getting a job will probably help you both. You didn't say what kind of work you do? A.A.",
      "MessageIndex": 2,
      "PostDate": "05/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1012-New-guy-checking-in?s=1b276477decf6519c562df0329af5289",
      "Title": "New guy checking in...."
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Welcome, JM. One additional sad factor to keep in mind is that it is legally required that you be notified by the facility that provides the mammogram in regard to your mammogram results, but not for ultrasound results. So don't be lulled into thinking that no news is good news. Don't count on your health care provider to track it for you either (even though as the person who pays for the imaging you don't automatically get a copy). A.A.",
      "MessageIndex": 7,
      "PostDate": "01/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/521-Diagnostic-techniques-and-when-to-use-them?s=1b276477decf6519c562df0329af5289",
      "Title": "Diagnostic techniques... and when to use them...?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "The future looks so promising. I do have to recognize and admit that as a stage 1 node-negative who has had chemo, rads and some tamoxifen, today instead I would look to the future and skip the chemo in hope that the future test is not far away, since my benefit is only a few percentage points. A.A.",
      "MessageIndex": 3,
      "PostDate": "18/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/574-Future-test-for-node-negative-prediction-for-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Future test for node-negative prediction for mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Absolutely, Drs. Leo and Lu. I am not ungrateful for the expertise both of you have or that my oncologist has. You see patients from one end of the spectrum of cancer to the other, and I don't. However, in the entire course of just my personal experience with cancer I have yet to meet a single health care provider who has personally had cancer, much less chemotherapy. I think that is why not a single one of them has ever taken the time to provide even a brief, perfunctory description of what it is like to be neuter as a direct result of choosing therapy. Maybe they genuinely don't have the time; but neither did they provide me with any reading material about it, or any referral to any other entity that would provide counseling for the impacts from chemotherapy that are outside their area of specialization. I do not think it is legitimate for medical people to act \"in my best interests\" in this regard. I would bet that you don't either, or you would not be kind enough to allow this discussion here. I am appreciative of this forum and dialogue if in any way it ends up meaning that even just one person who is diagnosed has a genuine opportunity to make a more informed decision than I had, no matter what choice they make in the end. And they certainly shouldn't put much credibility in a very preliminary report about a test that might be available somewhere off in the future. Respectfully, AlaskaAngel",
      "MessageIndex": 6,
      "PostDate": "19/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/574-Future-test-for-node-negative-prediction-for-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Future test for node-negative prediction for mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I don't have mets but if I did I'd spend some time at bcmets.org as it is a good website for that. All the best to you. AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "22/01/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2293-breast-cancer-(metastatic-stageIV)?s=1b276477decf6519c562df0329af5289",
      "Title": "breast cancer (metastatic stageIV)"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Gene expression profile predicts breast cancer metastases Reuters Health Posting Date: February 17, 2005 Last Updated: 2005-02-17 18:30:23 -0400 (Reuters Health) NEW YORK (Reuters Health) - Researchers have identified a gene expression signature that is a powerful predictor of distant metastases in patients with lymph node-negative breast cancer. \"Since only 30% to 40% of untreated lymph node-negative patients develop tumor recurrence, our prognostic signature could provide a powerful tool to identify those patients at low risk, preventing overtreatment in substantial numbers of patients,\" senior author Dr. John Foekens, from Erasmus Medical Center in Rotterdam, the Netherlands, and colleagues note. As reported in the February 19th issue of The Lancet, the researchers analyzed 22,000 RNA transcripts from breast cancer samples to identify an expression profile that predicted metastases. The samples came from 286 patients with node-negative disease. Using a training set of 115 tumor specimens, the authors identified a 76-gene signature that predicted distant metastases. Subsequent testing of this signature in a set of 171 lymph node-negative patients yielded a sensitivity and specificity of 93% and 48%, respectively. The profile was found to be useful in predicting metastatic disease even after adjusting for traditional prognostic factors. Moreover, the signature was particularly good at predicting metastases within 5 years; patients with the signature were nearly six times more likely to develop metastases than patients lacking this profile. The investigators found that the signature was a strong predictor of metastases regardless of menopausal status and also performed well in patients with tumors between 10 to 20 mm, a group that has traditionally proved to be a prognostic challenge. In a related editorial, Dr. Tor-Kristian Jenssen, from PubGene AS in Vinderen, Norway, and Dr. Eivind Hovig, from the Norwegian Radium Hospital in Montebello, note that although the current study represents the largest of its kind to date, \"it may still be too small to provide a final selection of genes for signature inclusion. Thus, the signature is there, but it is still necessary to read the fine print.\" Lancet 2005;365:634-635,671-679.",
      "MessageIndex": 10,
      "PostDate": "18/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/574-Future-test-for-node-negative-prediction-for-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Future test for node-negative prediction for mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "The future looks so promising. I do have to recognize and admit that as a stage 1 node-negative who has had chemo, rads and some tamoxifen, today instead I would look to the future and skip the chemo in hope that the future test is not far away, since my benefit is only a few percentage points. A.A.",
      "MessageIndex": 13,
      "PostDate": "18/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/574-Future-test-for-node-negative-prediction-for-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Future test for node-negative prediction for mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Absolutely, Drs. Leo and Lu. I am not ungrateful for the expertise both of you have or that my oncologist has. You see patients from one end of the spectrum of cancer to the other, and I don't. However, in the entire course of just my personal experience with cancer I have yet to meet a single health care provider who has personally had cancer, much less chemotherapy. I think that is why not a single one of them has ever taken the time to provide even a brief, perfunctory description of what it is like to be neuter as a direct result of choosing therapy. Maybe they genuinely don't have the time; but neither did they provide me with any reading material about it, or any referral to any other entity that would provide counseling for the impacts from chemotherapy that are outside their area of specialization. I do not think it is legitimate for medical people to act \"in my best interests\" in this regard. I would bet that you don't either, or you would not be kind enough to allow this discussion here. I am appreciative of this forum and dialogue if in any way it ends up meaning that even just one person who is diagnosed has a genuine opportunity to make a more informed decision than I had, no matter what choice they make in the end. And they certainly shouldn't put much credibility in a very preliminary report about a test that might be available somewhere off in the future. Respectfully, AlaskaAngel",
      "MessageIndex": 16,
      "PostDate": "19/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/574-Future-test-for-node-negative-prediction-for-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Future test for node-negative prediction for mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Ruthie, Waste no time, go to HER2support.org and hang out there, do a few searches there in the past posts by others, ask a few questions there. Because early testing for HER2 was erratically done until the results of the Herceptin trials came out, there was a lot of confusion about HER2's. However, basically it now is believed that around 35-40% are hormone receptor positive. AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "26/07/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/3210-Her2-and-estrogen-positive?s=1b276477decf6519c562df0329af5289",
      "Title": "Her2 and estrogen positive?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Have you looked through the NCCN site that explains staging and treatment to see where you \"fit in\", so that you have a clearer idea what it is about for you when you are talking with the oncs? http://www.nccn.org/patients/patient.../3_work-up.asp You are diagnosed at a time of greater progress as well as greater confusion... and more genuinely less-invasive choices... at a time when there is more recognition that targeted therapies look better for some hormone-responsive patients than chemotherapy... Some women have a tendency to think they want to \"throw the book at it\" but do not realize that less than 20% who get chemotherapy actually benefit from \"throwing the book at it\". I was node-negative also, but grade 3 and the HER2 was why I got blasted with chemo. I asked about the alternative of having the ovaries out and doing hormonal therapy but back in 2002 my onc was far from thinking more progressively about anything that didn't favor chemotherapy. Some oncs back then were giving Herceptin off-label to women like me, who weren't eligible for the clinical trial. Now the same women as me get Herceptin with chemo. Were you given an educated guess using Adjuvant! ? Be very picky about your treatment and especially consider having your tumor block analyzed in more detail... (many past posts about this at her2support.org website that are worth reading). A.A.",
      "MessageIndex": 3,
      "PostDate": "26/07/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/3210-Her2-and-estrogen-positive?s=1b276477decf6519c562df0329af5289",
      "Title": "Her2 and estrogen positive?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I posted the article in a breast cancer forum because the substances that are discussed in it relate to breast cancer, but the real issue here is not which side of the fence we are on in terms of those particular natural substances but the issue of our future ability to choose to use natural substances. My question is... if studies have shown that a drug company used a non-natural substance in combination with estrogen for HRT and it appears that was harmful, is it important to preserve freedom to choose if that same company can maneuver to make access to the bioidentical substance more difficult? If this company achieves this, what other natural substances will be next? Not all people can afford to pay not only for a substance itself but for repeated doctor visits to get a continuing prescription. If these people are being priced out of the ability to have drugs that cost hundreds of dollars a month, is it reasonable to prevent them from accessing a bioidental substance that has been subject to too little research, quite likely due not to its dangerous qualities but to the relative lack of profit that can be made from natural substances compared to the high-priced non-natural drugs? Do breast cancer patients have a place in dealing with this issue or do we just leave the pharmacists who are only trying to serve the public to be targeted by a drug company? Respectfully, AlaskaAngel P.S. In answer to your question, the non-natural substance that was combined with estrogen in the HRT that was studied was a progestin, not a bioidentical/natural form of progesterone. Many women are using over-the-counter progesterone; many others are using a method such as saliva testing for level in the blood and then getting it compounded specifically designed for their personal level. Dr. John Lee (now deceased) discussed the possibility that natural progesterone may be a GOOD thing in his books on the subject, and that it deserves additional investigation.",
      "MessageIndex": 2,
      "PostDate": "29/07/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/3324-Natural-vs-synthetic-choices?s=1b276477decf6519c562df0329af5289",
      "Title": "Natural vs synthetic choices"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Maria One of the fastest ways to understand would be to go to a website like Mayoclinic.com and search under breast cancer. They have some pretty good explanations of what it is all about to help you and your sister. If you get stuck come back here and someone here will try to explain. Also there is a note on the top part of this screen that says \"NEW! Cancer Online - comprehensive cancer reference website\" and you might try seeing if that is helpful. Hugs, AlaskaAngel",
      "MessageIndex": 5,
      "PostDate": "04/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/522-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "breast cancer"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Does anyone know why this product is essentially unavailable (\"back-ordered\") currently around the US?",
      "MessageIndex": 10,
      "PostDate": "22/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/489-E-string?s=1b276477decf6519c562df0329af5289",
      "Title": "E-string"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Does anyone know why this product is essentially unavailable (\"back-ordered\") currently around the US?",
      "MessageIndex": 20,
      "PostDate": "22/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/489-E-string?s=1b276477decf6519c562df0329af5289",
      "Title": "E-string"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Does anyone know why this product is essentially unavailable (\"back-ordered\") currently around the US?",
      "MessageIndex": 0,
      "PostDate": "22/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/489-E-string?s=1b276477decf6519c562df0329af5289",
      "Title": "E-string"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Everybody, Pro or con, nobody seems to have an answer to the question I asked, so I am still puzzled by the shortage. I read the comments with a lot of interest because I am a bc survivor whose doctors are not opposed to my use of the E-string. My onc is very respected in his field nationally, and my internist is no slouch either. The package insert does indeed contain the warning about breast cancer. Whether it is there to simply provide protection for the manufacturer in these times of litigation for even the slightest possibility that it could influence the course of cancer or not is unknown. We are a group of women with many, many different characteristics that influence our risk level. I would bet my bippy that the same docs who are open to my use of the E-string would be opposed to the use of it by some women who are staged III or IV, for example. Another aspect to this question is the degree of change in any particular woman's life as a result of her treatment for cancer. There are many women who are younger (and some who are older as well) than others and who do not experience the extreme, abrupt, permanent loss of libido, loss of lubrication, and loss of sexual identity to the degree that others do. That is why I don't think it is best to treat this as a black and white issue. Each one of us suffers different aspects of cancer to different degrees that beg for compassion and understanding, rather than division among us. All too often health care providers dismiss this as simply an issue of figuring out how to provide adequate lubrication for the mechanical process of coitus. Most of the health care providers that we have the most constant access and exposure to will defer this issue to the oncologist. That is appropriate IF the the oncologist is genuinely dealing with the patient's full range of problems that are a direct result of the therapy prescribed by the oncologist. Unfortunately, much of the time once the issue has been deferred to the oncologist and the oncologist makes a professional recommendation one way or the other, none of the other health care providers deal with any of the variety of other aspects of this problem that are facing the patient. Those issues are there, they are not simply \"in the patient's head\", and they need to be discussed with a focus on looking for solutions. For some women, a valid PART of that solution is the use of the E-string or other similar products. Just as we are understanding of each woman's choice in which therapies to use in the first place (such as chemo or rads, or hormonal treatments, etc.), let's not paint a black picture of this option for women who are simply trying to find a way to deal with their particular situation. Just as there are bc survivors who can perform coitus adequately with fake lubrication alone, there are those who need more than that and are finding the act of love to be a form of great pain both physically and psychologically. Best wishes, AlaskaAngel",
      "MessageIndex": 9,
      "PostDate": "23/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/489-E-string?s=1b276477decf6519c562df0329af5289",
      "Title": "E-string"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Everybody, Pro or con, nobody seems to have an answer to the question I asked, so I am still puzzled by the shortage. I read the comments with a lot of interest because I am a bc survivor whose doctors are not opposed to my use of the E-string. My onc is very respected in his field nationally, and my internist is no slouch either. The package insert does indeed contain the warning about breast cancer. Whether it is there to simply provide protection for the manufacturer in these times of litigation for even the slightest possibility that it could influence the course of cancer or not is unknown. We are a group of women with many, many different characteristics that influence our risk level. I would bet my bippy that the same docs who are open to my use of the E-string would be opposed to the use of it by some women who are staged III or IV, for example. Another aspect to this question is the degree of change in any particular woman's life as a result of her treatment for cancer. There are many women who are younger (and some who are older as well) than others and who do not experience the extreme, abrupt, permanent loss of libido, loss of lubrication, and loss of sexual identity to the degree that others do. That is why I don't think it is best to treat this as a black and white issue. Each one of us suffers different aspects of cancer to different degrees that beg for compassion and understanding, rather than division among us. All too often health care providers dismiss this as simply an issue of figuring out how to provide adequate lubrication for the mechanical process of coitus. Most of the health care providers that we have the most constant access and exposure to will defer this issue to the oncologist. That is appropriate IF the the oncologist is genuinely dealing with the patient's full range of problems that are a direct result of the therapy prescribed by the oncologist. Unfortunately, much of the time once the issue has been deferred to the oncologist and the oncologist makes a professional recommendation one way or the other, none of the other health care providers deal with any of the variety of other aspects of this problem that are facing the patient. Those issues are there, they are not simply \"in the patient's head\", and they need to be discussed with a focus on looking for solutions. For some women, a valid PART of that solution is the use of the E-string or other similar products. Just as we are understanding of each woman's choice in which therapies to use in the first place (such as chemo or rads, or hormonal treatments, etc.), let's not paint a black picture of this option for women who are simply trying to find a way to deal with their particular situation. Just as there are bc survivors who can perform coitus adequately with fake lubrication alone, there are those who need more than that and are finding the act of love to be a form of great pain both physically and psychologically. Best wishes, AlaskaAngel",
      "MessageIndex": 29,
      "PostDate": "23/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/489-E-string?s=1b276477decf6519c562df0329af5289",
      "Title": "E-string"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Dr. Leo, I keep wondering why, when a patient who is at high risk but has never been diagnosed with bc and is on a \"wait and see\" schedule for periodic additional mammos or ultrasounds because something isn't quite obvious, the doctors don't just automatically order a CA 27.29 or CA 15-3 as one last check? Why aren't markers used more frequently in conjunction with imaging prior to diagnosis if they are comparatively so often used after treatment? Pondering Again AlaskaAngel",
      "MessageIndex": 0,
      "PostDate": "01/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/521-Diagnostic-techniques-and-when-to-use-them?s=1b276477decf6519c562df0329af5289",
      "Title": "Diagnostic techniques... and when to use them...?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Yes, the markers for bc are the CA 27.29 and the CA 15-3. Your answer makes sense to me for the most part, except when I think about those women who end up being diagnosed in the first place with mets and who have said they had mammos for years without finding anything. The problem in that case is that basically mammos are used first rather than used routinely with ultrasounds. Therefore those women whose cancers only show up on ultrasounds are up the creek from the start, because unless they have something suspicious on mammo they are told \"all clear\", come back in a year.... I have \"heard\" that lobular usually is harder to find by mammo, for example. I am wondering if you add that group in with the group of women who are known to be at high risk and then either routinely do both a mammo with an ultrasound for women every year in those groups... or if you at the very least throw a marker in with every mammo for these women (and then add the ultrasound if the marker is up), you might be able to catch a meaningful number of cancers with a good cost/benefit ratio. I wish I could do a study on it. I'm sure it would have made a difference for me and I'm stage 1.",
      "MessageIndex": 2,
      "PostDate": "01/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/521-Diagnostic-techniques-and-when-to-use-them?s=1b276477decf6519c562df0329af5289",
      "Title": "Diagnostic techniques... and when to use them...?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I work with a variety of docs and they consider blood testing as a part of any annual physical exam, but especially with anyone who has a chronic disease. I don't know why a health care provider would be reluctant, except some may have a personal bias and tend to avoid ordering them for those who happen to be economically disadvantaged? I get aggravated too with the notion that finding out \"doesn't make a difference\" (perhaps to somebody ELSE it doesn't...) I understand that treating brain mets early can make a difference. I also do think that if we are willing to pay the full cost for any particular test we should be able to order it ourselves as often as we like.",
      "MessageIndex": 5,
      "PostDate": "01/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/521-Diagnostic-techniques-and-when-to-use-them?s=1b276477decf6519c562df0329af5289",
      "Title": "Diagnostic techniques... and when to use them...?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Margie, I'm in the group that has some faith in markers, partly because I see enough cases where they have been meaningful. But don't let that sway you. However, having no blood tests at all unless you have symptoms is an entirely different matter to me. I know everyone's history is different, but tracking liver enzymes and CBCs on a regular basis for a bc survivor whether or not they have symptoms makes very good sense to me.... A.A.",
      "MessageIndex": 3,
      "PostDate": "01/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/521-Diagnostic-techniques-and-when-to-use-them?s=1b276477decf6519c562df0329af5289",
      "Title": "Diagnostic techniques... and when to use them...?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "1/3 of the women with bc detected annually have been HER2+. So is there going to be any formal discussion at all among oncs about the rather large group of bc survivors who have not had recurrence but finished chemo too soon to share in the combination treatment with herceptin? I've been paying attention to the ASCO revelations about herceptin and so far I haven't seen any indication that any clinical trials to document either usefulness or lack of it for these survivors is even being contemplated by this convention of oncologists. Is there some valid reason for the complete silence about this? AlaskaAngel",
      "MessageIndex": 0,
      "PostDate": "18/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1114-herceptin-question?s=1b276477decf6519c562df0329af5289",
      "Title": "herceptin question"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I am one of quite a lot of HER2+++ breast cancer patients who followed the oncologist's advice and went through chemo without any Herceptin. My understanding is that the recent clinical trial results clearly indicate that those HER2+++'s who had chemo with Herceptin have a far lower recurrence rate. So logically my understanding is that those of us who never had Herceptin have a far HIGHER recurrence rate. People like me followed the advice of the oncologist and went through some pretty unpleasant chemo, commonly Adriamycin. Now when I read the articles discussing the advantages of Herceptin, I find that oncologists have not mentioned what those of us who did not get Herceptin should do. The worst thing about it is that they are not even acknowledging us at all. Why is it that oncologists think that Herceptin helps people who are newly diagnosed, or people who have recurrence, but they are dead silent about whether it is useful in any way for the rest of us -- who are, after all, the ones who are now stuck with the far higher recurrence rate. How can we have any trust in them at all if they continue to avoid any mention of us?",
      "MessageIndex": 0,
      "PostDate": "10/06/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1276-Maintaining-trust?s=1b276477decf6519c562df0329af5289",
      "Title": "Maintaining trust"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Dr. Leo. Whether or not anyone has \"all the answers\", the continuing dialogue is important. You do have the question correct and I appreciate once again your straightforward response. The recent Herceptin trial outcomes certainly raised more questions. What I want to understand is why there is lots of open discussion about how those at early stages who have never been treated can benefit, and there is lots of discussion about how those with mets can benefit, but so far there is dark, repressive silence from oncologists about this question: \"What approach is being taken in regard to establishing better clinical data about how the use of Herceptin affects those who have had chemo without Herceptin and who are currently NED?\" To me if the results of the clinical trials for Herceptin use for early bc clearly indicate a significantly lower recurrence rate, then logically those HER2++'s who are still alive and who have never had Herceptin are going to continue having a significantly higher recurrence rate. So why is there not discussion about clinical trials for those who have been treated but have not received Herceptin? I know that one concern is cardiac toxicity. I know that there are lifetime limits on the amount of Adriamycin one can have, and also that some people who are HER2+++ and who have a low ejection fraction may not be able to tolerate more chemo-in-combination-with-Herceptin. But what about the possibility of a clinical trial giving one combined dose, or 2 combined, dose-dense doses to those who have a good ejection fraction/MUGA or echo to see if early stage bc survivors who are NED end up reducing their recurrence rate? (I do know it probably means losing hair again. I still ask.) I have to also be very honest here with you about other aspects of being HER2/neu that are certainly not your fault personally, but that still are part of the breast cancer picture as a whole that we all are part of. A major aspect of the current HER2/neu confusion is unfortunately due to the lack of open discussion about HER2/neu all along with many of those who have breast cancer. I am not raising rabble here. I am just asking that those who know the most about oncology try harder to avoid continuing to make that mistake. It is up to oncologists to see our questions not as something to avoid answering, but as an opportunity for maintaining (or restoring) trust with HER2+++ patients who went through the nastiness of Adriamcyin without Herceptin at the advice of their oncologists; patients whose cancers were not even tested to find out whether they are HER2+++; patients who were never told what their HER2 status is or even why it could be important to know. If oncologists truly don't know whether Herceptin is beneficial to those who have already completed chemotherapy without it, or how much benefit it would have for us, then at a bare minimum they should at least communicate with us about what they are actively doing about that to get better answers for us. (I would like to at least know they don't just assume--or even worse, hope--that we are all dead, which is what their silence is saying to me.) Respectfully, AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "11/06/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1276-Maintaining-trust?s=1b276477decf6519c562df0329af5289",
      "Title": "Maintaining trust"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Gene expression profile predicts breast cancer metastases Reuters Health Posting Date: February 17, 2005 Last Updated: 2005-02-17 18:30:23 -0400 (Reuters Health) NEW YORK (Reuters Health) - Researchers have identified a gene expression signature that is a powerful predictor of distant metastases in patients with lymph node-negative breast cancer. \"Since only 30% to 40% of untreated lymph node-negative patients develop tumor recurrence, our prognostic signature could provide a powerful tool to identify those patients at low risk, preventing overtreatment in substantial numbers of patients,\" senior author Dr. John Foekens, from Erasmus Medical Center in Rotterdam, the Netherlands, and colleagues note. As reported in the February 19th issue of The Lancet, the researchers analyzed 22,000 RNA transcripts from breast cancer samples to identify an expression profile that predicted metastases. The samples came from 286 patients with node-negative disease. Using a training set of 115 tumor specimens, the authors identified a 76-gene signature that predicted distant metastases. Subsequent testing of this signature in a set of 171 lymph node-negative patients yielded a sensitivity and specificity of 93% and 48%, respectively. The profile was found to be useful in predicting metastatic disease even after adjusting for traditional prognostic factors. Moreover, the signature was particularly good at predicting metastases within 5 years; patients with the signature were nearly six times more likely to develop metastases than patients lacking this profile. The investigators found that the signature was a strong predictor of metastases regardless of menopausal status and also performed well in patients with tumors between 10 to 20 mm, a group that has traditionally proved to be a prognostic challenge. In a related editorial, Dr. Tor-Kristian Jenssen, from PubGene AS in Vinderen, Norway, and Dr. Eivind Hovig, from the Norwegian Radium Hospital in Montebello, note that although the current study represents the largest of its kind to date, \"it may still be too small to provide a final selection of genes for signature inclusion. Thus, the signature is there, but it is still necessary to read the fine print.\" Lancet 2005;365:634-635,671-679.",
      "MessageIndex": 0,
      "PostDate": "18/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/574-Future-test-for-node-negative-prediction-for-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Future test for node-negative prediction for mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Oncologists are the ones who have to open the door to things we would rather not experience, so being mad at them for it is real. I felt closest to my onc when I read about some of the things he has done in his field that showed real professional integrity. I also found the book, The Anatomy of Hope, by Jerome Groupman, took away a lot of the hard feelings for me. I'm going to have to read it again. I know each \"case\" of breast cancer is presented at tumor board where it gets discussed and a treatment plan is developed, but without somone there like an endocrinologist and a psychiatrist/psychologist how can they possibly make an educated plan? A.A.",
      "MessageIndex": 18,
      "PostDate": "20/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/574-Future-test-for-node-negative-prediction-for-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Future test for node-negative prediction for mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Link: http://www.humansideofcancer.com/chapter2/chapter.2.htm",
      "MessageIndex": 6,
      "PostDate": "27/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/592-attitude?s=1b276477decf6519c562df0329af5289",
      "Title": "attitude"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Yes -- it is natural and \"okay\" to feel down when faced with adversity. Different people have different ways of handling stress -- some by putting on a happy face, some by becoming a little more contemplative and quiet, etc. The article explained it much better than I did. Some people are so polite or reserved that it takes feeling very negative before they will get mad enough to try to do something about their situation, while others have to focus on the positive to be able to \"see\" what alternatives might be available or believe in their ability to try. And not everyone believes \"fighting\" to the end is the right thing to do in their personal situation, which is a deeply personal decision that can be honored. It is hard to know when to try to hold onto someone and when to let go. A.A.",
      "MessageIndex": 18,
      "PostDate": "28/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/592-attitude?s=1b276477decf6519c562df0329af5289",
      "Title": "attitude"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Everybody, Pro or con, nobody seems to have an answer to the question I asked, so I am still puzzled by the shortage. I read the comments with a lot of interest because I am a bc survivor whose doctors are not opposed to my use of the E-string. My onc is very respected in his field nationally, and my internist is no slouch either. The package insert does indeed contain the warning about breast cancer. Whether it is there to simply provide protection for the manufacturer in these times of litigation for even the slightest possibility that it could influence the course of cancer or not is unknown. We are a group of women with many, many different characteristics that influence our risk level. I would bet my bippy that the same docs who are open to my use of the E-string would be opposed to the use of it by some women who are staged III or IV, for example. Another aspect to this question is the degree of change in any particular woman's life as a result of her treatment for cancer. There are many women who are younger (and some who are older as well) than others and who do not experience the extreme, abrupt, permanent loss of libido, loss of lubrication, and loss of sexual identity to the degree that others do. That is why I don't think it is best to treat this as a black and white issue. Each one of us suffers different aspects of cancer to different degrees that beg for compassion and understanding, rather than division among us. All too often health care providers dismiss this as simply an issue of figuring out how to provide adequate lubrication for the mechanical process of coitus. Most of the health care providers that we have the most constant access and exposure to will defer this issue to the oncologist. That is appropriate IF the the oncologist is genuinely dealing with the patient's full range of problems that are a direct result of the therapy prescribed by the oncologist. Unfortunately, much of the time once the issue has been deferred to the oncologist and the oncologist makes a professional recommendation one way or the other, none of the other health care providers deal with any of the variety of other aspects of this problem that are facing the patient. Those issues are there, they are not simply \"in the patient's head\", and they need to be discussed with a focus on looking for solutions. For some women, a valid PART of that solution is the use of the E-string or other similar products. Just as we are understanding of each woman's choice in which therapies to use in the first place (such as chemo or rads, or hormonal treatments, etc.), let's not paint a black picture of this option for women who are simply trying to find a way to deal with their particular situation. Just as there are bc survivors who can perform coitus adequately with fake lubrication alone, there are those who need more than that and are finding the act of love to be a form of great pain both physically and psychologically. Best wishes, AlaskaAngel",
      "MessageIndex": 19,
      "PostDate": "23/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/489-E-string?s=1b276477decf6519c562df0329af5289",
      "Title": "E-string"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Yes -- it is natural and \"okay\" to feel down when faced with adversity. Different people have different ways of handling stress -- some by putting on a happy face, some by becoming a little more contemplative and quiet, etc. The article explained it much better than I did. Some people are so polite or reserved that it takes feeling very negative before they will get mad enough to try to do something about their situation, while others have to focus on the positive to be able to \"see\" what alternatives might be available or believe in their ability to try. And not everyone believes \"fighting\" to the end is the right thing to do in their personal situation, which is a deeply personal decision that can be honored. It is hard to know when to try to hold onto someone and when to let go. A.A.",
      "MessageIndex": 8,
      "PostDate": "28/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/592-attitude?s=1b276477decf6519c562df0329af5289",
      "Title": "attitude"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I've been reading the recent publicity about the effects of olive oil for cancer. I started using olive oil 2 years ago for most things that call for oil in my diet just because most of the writers I respected were pushing it. (So far I'm NED, maybe that counts for something... although admittedly I am stage 1 to begin with.) The recent info about olive oil made me wonder what would happen if olive oil were somehow used topically for IBC... and then I started wondering if something as harmless as olive oil were sprayed on the surgical site after lumpectomy or mastectomy... Sometimes old wives tales have some very real basis to them. PURELY SPECULATING, AlaskAngel",
      "MessageIndex": 0,
      "PostDate": "16/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/467-The-helpful-properties-of-olive-oil?s=1b276477decf6519c562df0329af5289",
      "Title": "The helpful properties of olive oil"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Micrometastases often persist in breast cancer patients Reuters Health Posting Date: March 8, 2005 Last Updated: 2005-03-08 11:27:01 -0400 (Reuters Health) NEW YORK (Reuters Health) - Despite undergoing surgery and receiving adjuvant therapy, most patients with early-stage breast cancer have bone marrow micrometastases up to 4 years later, according to a report in the March 10th issue of the International Journal of Cancer. Dr. Martin J. Slade, from Imperial College London, and colleagues used a quantitative PCR (QPCR) technique they developed to look for transcripts of cytokeratin 19, a cancer marker, in the blood and bone marrow of 131 women with breast cancer, most of whom had node-negative T1 disease. These results were compared with standard immunohistochemistry findings. All of the patients were treated with surgery and adjuvant therapy and had no evidence of metastatic disease on conventional scans. About half of the patients had QPCR or immunohistochemistry results that indicated bone marrow micrometastases before surgery, the authors note. Of the 91 subjects who had repeat samples taken, 87% and 65% had evidence of metastatic disease at some point with QPCR and immunohistochemistry, respectively. Systemic adjuvant therapy seemed to have an effect on residual disease. Among patients with residual disease before treatment or at 3 months, 32 of 44 displayed a drop in the CK19/ABL ratio and 15 of 24 showed a drop in cytokeratin-positive cells during follow-up, the authors point out. \"We have demonstrated that in a substantial proportion of patients, minimal residual disease persists using the techniques that we have developed, and that it is possible to monitor patients, preferably using both QPCR and immunohistochemistry, after breast surgery using bone marrow aspirates,\" the researchers conclude. Int J Cancer 2005;114:94-100.",
      "MessageIndex": 0,
      "PostDate": "21/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1126-Early-stage-bc-and-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Early stage bc and mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "That question seems simple but I don't think the answer is that simple. There is a sort of hidden cruelty about expectations. A while back in one of the online bc support groups I tune into there was quite a discussion about this. I don't know if I have any of it saved somewhere in my files to be able to give it to you without my interpretation of it, but for now you get the short AlaskaAngel version. There is a genuine need to acknowledge what is good and what is bad about things that happen. If you take the position that focusing on the good leads to a better outcome then to some degree you are also taking the position that anyone who has a bad outcome probably simply hasn't put enough faith or energy into thinking positive. That is a destructive thing to do to people because there are genuine limits to what \"thinking positive\" can accomplish. A minor example: Personally I did find it offensive during my course of treatment when someone else had almost no nausea or vomiting whereas I was having a very different experience. Positive thinking wasn't dealing with reality. Another example would be recurrence and the focus of blaming oneself for simply not thinking positively enough to keep cancer at bay. I read Mind Over Menopause, The Complete Mind/Body Approach to Coping with Menopause, to try to explore positive thinking. I found a number of interesting and helpful aspects to the book, but it deals almost entirely with natural menopause and not chemical or surgical menopause, which means it pretty much leaves out women who have some of the most need for a book about being positive about menopause. It is of course simpler for them not to deal in any depth with the more difficult forms of menopause. For that I probably could be accused of \"thinking negatively\". On the positive side, hopefully they will correct this omission sometime soon and put out a book entirely devoted to chemopause and surgipause? A.A.",
      "MessageIndex": 13,
      "PostDate": "25/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/592-attitude?s=1b276477decf6519c562df0329af5289",
      "Title": "attitude"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Shelly, It is only through the posts of those like yourself that others can learn. Regardless, it is good to hear from you. Let us know how it goes. AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "28/04/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2863-been-a-while-update-on-me?s=1b276477decf6519c562df0329af5289",
      "Title": "been a while....update on me"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I will post here an article for everyone to consider, followed by my own impression: Reported December 20, 2004 Chemobrain HOUSTON (Ivanhoe Broadcast News) -- Chemotherapy has revolutionized cancer treatment. But with the therapy comes an often overlooked side effect that researchers have dubbed \"chemobrain.\" Here's what is and what doctors are doing to stop it. Janis Shea works hard to stay focused. \"I'm lost,\" she says. \"I can't say what I want to say right now. My thoughts have just left me.\" Chemotherapy helped Janis beat breast cancer, but those treatments left her with memory loss and attention problems. It's a phenomenon doctors call chemobrain. \"Their memory retrieval's very unreliable, so they'll block on words in conversation or forget people's names. It's very aggravating,\" says Christina Meyers, Ph.D., a neuropsychologist at M. D. Anderson Cancer Center in Houston. Janis's husband, an oncologist named Renato Lenzi, M.D., says her behavior was unusual. \"She started saying things that were really out of character.\" Ten years after her treatments, Janis still has trouble paying attention. Dr. Meyers says, \"I think a lot of people have that expectation that when treatment ends, the chemotherapy gets out of their body, and they should pop back to normal, and that is not the case at all.\" It's not clear exactly how chemo affects the brain, but Dr. Meyers says relaxation exercises can ease symptoms. Medications like Procrit and Ritalin are also used to help patients. \"It helps people focus and concentrate, and most of these patients also experience a lot of fatigue, and it helps with their stamina and fatigue as well,\" she says. Janis has her own remedies. \"I did a lot of journaling -- an enormous amount of reading,\" she says. \"I read all the time. I think that I'm much, much better. However, back to normal? I don't know. I don't know what this is anymore.\" But she says she's still trying to get there. Dr. Meyers says memory and concentration problems can occur more than a year after stopping chemo treatment. However, she says not all patients on chemotherapy will experience these types of problems. More than half of people on chemotherapy develop significant chemobrain symptoms. This article was reported by Ivanhoe.com, who offers Medical Alerts by e-mail every day of the week. To subscribe, go to: http://www.ivanhoe.com/newsalert/. If you would like more information, please contact: M.D. Anderson Information Line (800) 392-1611 END OF ARTICLE MY PERSONAL COMMENTS: In 2002 when chemo that included Adriamycin was recommended for me, I told both my onc and my internist that I was more concerned about the question of what chemo would do to the brain than I was about whether or not it seriously affected the heart. If it is so dangerous for the heart, what would it do to the brain? I was luckier than many, because I was stage 1 and the question of recurrence of cancer was less likely for me. But both my internist and my onc had no answer to my question and yet encouraged me to do chemo. At the time my onc, a top oncologist in his field, said that in his entire career of 30 years he had only had 5 or 6 seriously impaired patients after they did chemo. (My thought was, well.... how many that were not seriously impaired people did you have over time?) On my own, because my health insurance would not pay for it, I had a qualified psychiatrist administer some general mental measurement tests to me so that if necessary I would have a baseline for comparison. That cost $250. I could not afford a comparison after completing chemo and one has not been done so far, but I am having trouble not only with names but also with the kinds of simple task relationship factors that indicate I do have a problem. For example, today I went to put the blender container on the blender base. I actually tried to put it together without screwing on the circular base portion that fits into the blender base. I am very aware of these problems, but because I work at home no one else but my husband sees me and frequently he doesn't see either as he is not always with me. Although in the past I have done things like renting an automobile and driving in the big city on my own, I am terrified now of doing that because I literally cannot recognize when I am not putting \"2 + 2\" together in a random situation. I am only 53 years old and this was not part of my life prior to doing chemo at age 51. I do not believe that this is simply part of \"normal aging\". I would never advise anyone to do chemo if they are at an early stage. Everyone I know thinks I have pretty much \"recovered\" from treatment now that I am 2 years out, even my husband. But these things happen on a daily basis and I know I have not recovered and may get worse. Personally, I believe part of the problem may be due to the lack of adequate oxygenation due to low blood counts. All of my blood counts still are slightly below normal 2 years after treatment. It is sad that it took having an oncologist whose wife ended up dealing with it, to start looking away from chemotherapy for better ways to treat human beings who are stuck with the misery of cancer. A.A.",
      "MessageIndex": 0,
      "PostDate": "20/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/355-Chemobrain?s=1b276477decf6519c562df0329af5289",
      "Title": "Chemobrain"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "That question seems simple but I don't think the answer is that simple. There is a sort of hidden cruelty about expectations. A while back in one of the online bc support groups I tune into there was quite a discussion about this. I don't know if I have any of it saved somewhere in my files to be able to give it to you without my interpretation of it, but for now you get the short AlaskaAngel version. There is a genuine need to acknowledge what is good and what is bad about things that happen. If you take the position that focusing on the good leads to a better outcome then to some degree you are also taking the position that anyone who has a bad outcome probably simply hasn't put enough faith or energy into thinking positive. That is a destructive thing to do to people because there are genuine limits to what \"thinking positive\" can accomplish. A minor example: Personally I did find it offensive during my course of treatment when someone else had almost no nausea or vomiting whereas I was having a very different experience. Positive thinking wasn't dealing with reality. Another example would be recurrence and the focus of blaming oneself for simply not thinking positively enough to keep cancer at bay. I read Mind Over Menopause, The Complete Mind/Body Approach to Coping with Menopause, to try to explore positive thinking. I found a number of interesting and helpful aspects to the book, but it deals almost entirely with natural menopause and not chemical or surgical menopause, which means it pretty much leaves out women who have some of the most need for a book about being positive about menopause. It is of course simpler for them not to deal in any depth with the more difficult forms of menopause. For that I probably could be accused of \"thinking negatively\". On the positive side, hopefully they will correct this omission sometime soon and put out a book entirely devoted to chemopause and surgipause? A.A.",
      "MessageIndex": 3,
      "PostDate": "25/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/592-attitude?s=1b276477decf6519c562df0329af5289",
      "Title": "attitude"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Link: http://www.humansideofcancer.com/chapter2/chapter.2.htm",
      "MessageIndex": 16,
      "PostDate": "27/02/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/592-attitude?s=1b276477decf6519c562df0329af5289",
      "Title": "attitude"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "As someone with early stage bc I have found it hard to \"know\" how much risk is involved when choosing how to deal with bc. The study I posted is just one study for you to consider. I think women who are HER2 should be very, very persistent about understanding what choices they could have, and especially now those with early stage bc. As someone who completed treatment with Adriamycin in 2002 (without any taxane or any Herceptin), the only option I have heard so far that is being offered to women like me is to start Herceptin alone, which MAY provide somewhere around 13% greater protection. For those with early stage bc who are just now looking at treatment, the Herceptin results indicate that by having Herceptin at the same time as Adriamycin (with taxane), the protection is far better than 13%. The article I posted indicates that most of us early bc have micromets despite having had standard treatment. I think it is important for those of us who have completed chemo in the past, and who it seems are only going to be eligible for herceptin alone, push for a complete answer as to whether having more Adriamycin + taxane actually might work to help us avoid or further limit recurrence. Yes, it might mean losing our hair again, and being sick again. Yes, there is a lifetime limit on the total amount of Adriamycin we can each have. Yes, both Adriamycin and Herceptin affect the heart muscle and that has to be considered. But what I think may need to be determined is whether those of us who have hearts that can be proven to be adequate by way of MUGA scan or echo, and who believe the option should be OURS to consider, could go through perhaps something like dose-dense Adriamycin + taxane + Herceptin rather than just settling for adding Herceptin now -- and get greater benefit similar to that received by those who will be going through treatment now for the first time. Perhaps even having just 2 treatments (to limit the amount of Adriamcin) could make that kind of a difference for us. Who knows? The population that demonstrated the recent success with Herceptin was a different population, one that had never had chemotherapy at all. So I think we need to have a clinical trial for early bc survivors who have had chemotherapy that was not given concurrent with herceptin and may not have included a taxane -- limited to those whose hearts are capable of withstanding it. I was told when I chose to do chemotherapy that it does not extend survival, it only puts off recurrence or limits the number of recurrences one would have. I think a clinical trial needs to be offered in behalf of those of us who are HER2 positive and who went through the torture of chemotherapy that is already proven not to extend survival -- to see if we actually could get significant benefit from treatment that combines Herceptin with Adriamycin and a taxane. AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "21/05/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/1126-Early-stage-bc-and-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Early stage bc and mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "It is nice to know I am not the only one to suppose this is possible. Mammograms have been around a lot longer than much knowledge about DCIS, what it is, what it does, and what it doesn't. And mammograms are so well established that it is pretty hard to get anyone to consider change even if it IS in everybody's best interest. (Consider how long it took science to get a better idea about the danger of estrogen replacement therapy.) I don't think anyone has ever collected the statistics to find out whether mammos cause DCIS to be squished out of the ducts or lobules, and if it does, whether it then sends out signals to stimulate angiogenesis and the subsequent development of IDC or lobular cancer. (Not to mention the cumulative effects of annual rads from the mammograms.) Studies are already demonstrating that MRI and not mammograms should be used for women at high risk with dense breasts. MRI's are more expensive in the short run, but early detection for such woman with MRI is cheaper in the long run (not to mention more humane). AlaskaAngel",
      "MessageIndex": 2,
      "PostDate": "29/11/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/261-Wondering-about-something?s=1b276477decf6519c562df0329af5289",
      "Title": "Wondering about something"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Unfortunately breast cancer is a complicated disease, and the vast majority of those of us with bc do not know enough about it at the time of diagnosis. I didn't. Medical specialization is contributing to the problem. Most practitioners we see have little ability to coordinate overall treatment for a disease that directly affects primarily females. How many oncologists or radiologists have had breast cancer? They expect the GP, the internist, or the OB-GYN to handle the problems with the rest of the body that result from chemo or rads. But the GP, the internist, and the OB-GYN who acknowledge that these things affect the endocrine system stand back and do nothing about the endocrine problems that are a direct result of chemotherapy or rads. IF estrogen and and and an increasingly estrogenic environment coupled with heredity are major reasons for the development of breast cancer, then isn't it an endocrine disease? We usually see a GP, internist, or OB-GYN for monitoring the breast, who refers us to the radiologist (who often never sees us in person) and we are then referred to a surgeon. If the surgeon finds breast cancer we have surgery and are referred to the oncologist, who doesn't deal with endocrine problems, psychological issues such as sexuality and reproduction, or much of anything other than chemotherapy and radiation and sometimes death. Very rarely do any of us see an endocrinologist, and by the time we do it is only after more damage has been done to the endocrine system and the immune system. How often are we referred to an immunologist to help us figure out what we have left to work with after chemotherapy and rads? The chain of command used to deal with breast cancer just might not make a lot of sense.",
      "MessageIndex": 9,
      "PostDate": "29/11/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/261-Wondering-about-something?s=1b276477decf6519c562df0329af5289",
      "Title": "Wondering about something"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Kristin, is the article you are thinking of this one...? \"This summer, the journal Cancer published a study from the University of Texas M.D. Anderson Cancer Center that found that among 84 breast-cancer patients, more than 1/3 showed cognitive impairment prior to chemotherapy. Whether the impairment was directly related to the cancer or how cancer might affect cognitive function isn't known, but the study suggests cancer itself might affect a patient's cognitive function.\"",
      "MessageIndex": 4,
      "PostDate": "21/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/355-Chemobrain?s=1b276477decf6519c562df0329af5289",
      "Title": "Chemobrain"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "As noted, the studies that support the use of MRI are in regard to those women at high risk, with dense breasts. This is not the entire population of women receiving mammograms, just those most likely to present the highest risk. Early detection is of significant economic value; the larger a cancer is, the greater the $ expense of treatment. Again, current science seems uncertain whether or how DCIS progresses to IDC or lobular carcinoma. Unless someone does a study of breast tissue to find out if squishing it and radiating causes DCIS to break through the duct walls or lobule walls and then lead to IDC or lobular cancer I wouldn't be the one to pooh-pooh the notion out of hand. If we aren't willing to consider the possibilities we are more likely to see the 1 in 8 women who get breast cancer become 1 in 7 and then 1 in 6.... And that truly would raise the cost of our insurance. A.A.",
      "MessageIndex": 14,
      "PostDate": "29/11/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/261-Wondering-about-something?s=1b276477decf6519c562df0329af5289",
      "Title": "Wondering about something"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Even if the chemo is effective, the problem is that adding alcohol when the liver is already under assault by chemicals makes other serious liver problems more likely. Relaxing is important too, but the idea is to get treatment over with, not to prolong it by encouraging other things to go haywire. I don't know how old your wife is, but the older we get the more our innards fall apart. Hope you have many more years together to enjoy, A.A.",
      "MessageIndex": 9,
      "PostDate": "21/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/350-Alcahol?s=1b276477decf6519c562df0329af5289",
      "Title": "Alcahol"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "A number of people have asked me about my perceptions of the recent clinical trial I participated in. The testosterone clinical trial is not entirely over although it is closed to new participants, having filled its number of candidates long before expected. The coordinators were very helpful in doing whatever they could to help me participate by distance after the initial on-site physical exam and labs. The trial was 2 months in length, with each participant getting 1 jar of cream each month and not knowing which was the placebo and which had the testosterone in it, and then the next month reversing the creams. The cream was 2% testosterone and we were to use 1/8 teaspoon daily on the skin of the stomach or the thighs (fatty areas absorb in the best way). The only unpleasant aspect was that one had to put it on and then wait 5 minutes while it absorbed, which was a bit tiresome since all I wanted to do most of the time was hit the sack to sleep... The first 2 days were a bit problematic in that the small spoon that I received was the wrong size but I wasn't sure until the third day. For whatever reason, I had 3 straight nights with a bad headache and wondered if that meant I was then getting the testosterone cream. It also seemed to me that the perineal area felt uncomfortably sensitive although I didn't feel any more libido. My husband and I started the clinical trial at the same time as a 2-week vacation so our mood was happy and we were at play. Once a week a 1-page form with questions about various aspects had to be filled out. No, I didn't grow any more hair anywhere, or develop acne, or a deeper voice during the entire 8 weeks. At the end of each month a more detailed questionnaire had to be filled out. I also had to have lab tests periodically and send them in, so they would be able to terminate my participation if any lab came up out of range. At the beginning of the first week of the second month I was surprised to suddenly find myself very depressed for the first 2 days. I wondered if that meant I had been on testosterone during the first month, and was coming off of it as I went into the second month and the second jar of cream. The depression ended without any problems and in fact I felt somewhat better in terms of mood for the rest of the second month than I had during the first one. At the end of the 8 weeks I filled out the last detailed form and sent it in, with my written guess that because of the sharp headache at the beginning when I accidentally started out with the wrong size spoon and dose, and because of the sudden depression at the start of the second month, I thought maybe I had been on testosterone the first month of the trial. Not so. It turns out that the month that I was feeling the best was the month I was on the testosterone. At the end of the trial we were told that if we desired to continue to use the cream we would need to get a local provider to prescribe it, and that if we agreed then we would be contacted at the end of 6 months to provide any additional information. I don't know how many women decided to continue, but I did. It took some time to get the appointment with a local provider to get the prescription, but with the paperwork provided by the clinical trial, the cream was provided by our local small-town pharmacy without any problem. As a participant during the remaining months I am required to have blood draws every 3 months to be sure my hormonal levels remain postmenopausal. I am only a short way into the extended period now and actually I think it helps most in terms of general mood and greater energy, which then contributes to a more loving environment in general. I have no information about the results of the clinical trial pertaining to ALL of the women who participated, so this commentary on it is just my personal perspective. If and of you are interested (including doctors), I will let you know at the end what I find out and what my experience with the entire process is.",
      "MessageIndex": 0,
      "PostDate": "30/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/723-Libido-natinal-clinical-trial?s=1b276477decf6519c562df0329af5289",
      "Title": "Libido, natinal clinical trial"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "The results of the 2004 NCI study about this are available. As one of the 150 chosen to participate in this trial in 2004, I have some comments about it. The trial was done to see if use of testosterone by breast cancer survivors would help with libido, AND to see what hormonal changes took place. The conclusions reached were that testosterone supplementation does not help with libido AND that testosterone supplementation does NOT increase the blood levels of estradiol. This information I think is important. Breast cancer survivors have been leery of using testosterone supplementation because the medical community believed that testosterone would break down into estradiol. So from this trial it appears clear that it does not. One might ask what is the point, since it doesn't seem to help with libido? But I would be cautious about accepting that it does not help. Testosterone supplementation alone may not help; but this trial did not answer the question as to whether using it by balancing it with other hormones would help. As mentioned in the trial results, perhaps libido requires some amount of supplementation with estrogen. However, it also may be true that restoring libido requires some amount of testosterone as well to provide a needed balance, or it might require a balance of testosterone with other hormones such as progesterone, or even melatonin or insulin or ? So as a participant in the trial I do not accept that testosterone is \"not useful in this group\". The fact that use of testosterone did NOT increase the levels of estradiol is quite significant to ME. A second point is that the trial required that the testosterone cream not be applied in the genital area. My understanding from general discussion among women who found testosterone supplementation quite useful was that they were applying it to the clitoris. If you want to see the study results, they can be found in ASCO 2006, Abstract 8507. -AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "05/07/2007",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/723-Libido-natinal-clinical-trial?s=1b276477decf6519c562df0329af5289",
      "Title": "Libido, natinal clinical trial"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Even though there isn't yet a \"cure\" for everything and everyone, I too see a lot of progress in medicine. I'm grateful for the Human Genome Project especially. Discussions about recurrence are difficult. It is important to encourage the value of hope, and it is also important to have some ability to deal with whatever \"reality\" we are able to tie down. Even the encouraging recent announcements about Herceptin have limits in that not all HER2 positives end up getting as much from having the new Herceptin combo treatments. I am disappointed and frustrated and somewhat upset by the lack of clear explanation about possible Herceptin benefits for those who completed therapy in the past that didn't include Herceptin in combination with Adriamycin. It gave me the impression that even if there might be some way to provide better results for that group of women, perhaps we are just supposed to be grateful for the more limited likelihood of survival as long as we have the aromatase inhibitors (and what misery that comes with them). A.A. P.S. Muttsmom, some oncs have been providing Herceptin \"off-label\", and some women of course have been getting it through the clinical trials, but until there were more certain results from the clinical trials such treatments aren't generally available or encouraged. And Herceptin has been spendy so that too has limited its use.",
      "MessageIndex": 4,
      "PostDate": "21/05/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1126-Early-stage-bc-and-mets?s=1b276477decf6519c562df0329af5289",
      "Title": "Early stage bc and mets"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Madge/Rita, The \"tiny cancer cell that remains\" is sort of theoretical... and chemo can also cause cancer... Mine was 1.6 and I am ER/PR+ too but not slow-growing, more's the pity. I did CAF x 6 and rads and am hopeful for new methods so that there will be fewer women who end up having to go through it -- especially since the vast majority of women who are stage 1 apparently would do just fine without anything but surgery. A.A.",
      "MessageIndex": 8,
      "PostDate": "08/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/511-Stage-I-Invasive-ductal-carcinoma?s=1b276477decf6519c562df0329af5289",
      "Title": "Stage I: Invasive ductal carcinoma"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Dr. Leo, Thank you for sharing those sources with us. I had the genuine pleasure of hearing Dr. Ahles discuss this in the past year, and am still appreciative of his presentation and his thoughtful choice of words. It may be too late for me but I like to think that others can benefit from what I've learned. If anyone wants to listen to Dr. Ahles on this topic, I believe the recorded teleconference is still available online through CancerCare. A.A.",
      "MessageIndex": 6,
      "PostDate": "23/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/355-Chemobrain?s=1b276477decf6519c562df0329af5289",
      "Title": "Chemobrain"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Madge/Rita, The \"tiny cancer cell that remains\" is sort of theoretical... and chemo can also cause cancer... Mine was 1.6 and I am ER/PR+ too but not slow-growing, more's the pity. I did CAF x 6 and rads and am hopeful for new methods so that there will be fewer women who end up having to go through it -- especially since the vast majority of women who are stage 1 apparently would do just fine without anything but surgery. A.A.",
      "MessageIndex": 18,
      "PostDate": "08/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/511-Stage-I-Invasive-ductal-carcinoma?s=1b276477decf6519c562df0329af5289",
      "Title": "Stage I: Invasive ductal carcinoma"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Unfortunately breast cancer is a complicated disease, and the vast majority of those of us with bc do not know enough about it at the time of diagnosis. I didn't. Medical specialization is contributing to the problem. Most practitioners we see have little ability to coordinate overall treatment for a disease that directly affects primarily females. How many oncologists or radiologists have had breast cancer? They expect the GP, the internist, or the OB-GYN to handle the problems with the rest of the body that result from chemo or rads. But the GP, the internist, and the OB-GYN who acknowledge that these things affect the endocrine system stand back and do nothing about the endocrine problems that are a direct result of chemotherapy or rads. IF estrogen and and and an increasingly estrogenic environment coupled with heredity are major reasons for the development of breast cancer, then isn't it an endocrine disease? We usually see a GP, internist, or OB-GYN for monitoring the breast, who refers us to the radiologist (who often never sees us in person) and we are then referred to a surgeon. If the surgeon finds breast cancer we have surgery and are referred to the oncologist, who doesn't deal with endocrine problems, psychological issues such as sexuality and reproduction, or much of anything other than chemotherapy and radiation and sometimes death. Very rarely do any of us see an endocrinologist, and by the time we do it is only after more damage has been done to the endocrine system and the immune system. How often are we referred to an immunologist to help us figure out what we have left to work with after chemotherapy and rads? The chain of command used to deal with breast cancer just might not make a lot of sense.",
      "MessageIndex": 19,
      "PostDate": "29/11/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/261-Wondering-about-something?s=1b276477decf6519c562df0329af5289",
      "Title": "Wondering about something"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Even if the chemo is effective, the problem is that adding alcohol when the liver is already under assault by chemicals makes other serious liver problems more likely. Relaxing is important too, but the idea is to get treatment over with, not to prolong it by encouraging other things to go haywire. I don't know how old your wife is, but the older we get the more our innards fall apart. Hope you have many more years together to enjoy, A.A.",
      "MessageIndex": 19,
      "PostDate": "21/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/350-Alcahol?s=1b276477decf6519c562df0329af5289",
      "Title": "Alcahol"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "It is nice to know I am not the only one to suppose this is possible. Mammograms have been around a lot longer than much knowledge about DCIS, what it is, what it does, and what it doesn't. And mammograms are so well established that it is pretty hard to get anyone to consider change even if it IS in everybody's best interest. (Consider how long it took science to get a better idea about the danger of estrogen replacement therapy.) I don't think anyone has ever collected the statistics to find out whether mammos cause DCIS to be squished out of the ducts or lobules, and if it does, whether it then sends out signals to stimulate angiogenesis and the subsequent development of IDC or lobular cancer. (Not to mention the cumulative effects of annual rads from the mammograms.) Studies are already demonstrating that MRI and not mammograms should be used for women at high risk with dense breasts. MRI's are more expensive in the short run, but early detection for such woman with MRI is cheaper in the long run (not to mention more humane). AlaskaAngel",
      "MessageIndex": 12,
      "PostDate": "29/11/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/261-Wondering-about-something?s=1b276477decf6519c562df0329af5289",
      "Title": "Wondering about something"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "It was hard to find out after going through treatment just how long it takes to be able to have enough endurance to get going again with exercise. For me it was about a year and a half, which translated to over 2 years after diagnosis. It was very educational to learn just how fast we go to pot when we are taking a beating from treatment. I have a lot more sympathy for other people than I used to. I love to snowshoe too -- much better than skiing (we only have cross-country here as the nearest commercial skiing is hundreds of miles away and might as well be on the moon) -- although ice skating is my newest sport and I just wish we had good ice on the lakes more often... A.A.",
      "MessageIndex": 3,
      "PostDate": "08/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/542-The-day-is-almost-here-ahhhhhhhhh?s=1b276477decf6519c562df0329af5289",
      "Title": "The day is almost here..........ahhhhhhhhh"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "As noted, the studies that support the use of MRI are in regard to those women at high risk, with dense breasts. This is not the entire population of women receiving mammograms, just those most likely to present the highest risk. Early detection is of significant economic value; the larger a cancer is, the greater the $ expense of treatment. Again, current science seems uncertain whether or how DCIS progresses to IDC or lobular carcinoma. Unless someone does a study of breast tissue to find out if squishing it and radiating causes DCIS to break through the duct walls or lobule walls and then lead to IDC or lobular cancer I wouldn't be the one to pooh-pooh the notion out of hand. If we aren't willing to consider the possibilities we are more likely to see the 1 in 8 women who get breast cancer become 1 in 7 and then 1 in 6.... And that truly would raise the cost of our insurance. A.A.",
      "MessageIndex": 4,
      "PostDate": "29/11/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/261-Wondering-about-something?s=1b276477decf6519c562df0329af5289",
      "Title": "Wondering about something"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you for your patience and understanding, your willingness to provide this opportunity for meaningful discussion, and especially for your continuing honesty. May you and your family enjoy the coming year and the new challenge you are taking on with your career. AlaskaAngel",
      "MessageIndex": 2,
      "PostDate": "31/12/2004",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/394-CHEERS-and-a-toast-to-Dr-Leo!?s=1b276477decf6519c562df0329af5289",
      "Title": "CHEERS and a toast to Dr. Leo!"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Jodi Linn, Try to find out if there is a Gilda's Club you can attend near you so that you can talk with others who know a lot about ovarian cancer. You can also see if there is a center near you that is offering the Early Detection for Ovarian Cancer clinical trial -- for that you are monitored for ovarian cancer more intensively by blood testing and by periodic ultrasounds. I am in that clinical trial myself because of a strong family history of breast cancer on both sides plus an aunt who died of ovarian cancer. google facingourrisk AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "22/01/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2299-Wonder-what-else-I-can-do?s=1b276477decf6519c562df0329af5289",
      "Title": "Wonder what else I can do?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Sharon. What I've seen was in regard to concerns that led to investigations involving the use of Procrit, and I haven't yet seen any definite conclusions about it one way or the other. AlaskaAngel",
      "MessageIndex": 14,
      "PostDate": "26/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/912-Dose-dense-chemo-and-Neulasta-question?s=1b276477decf6519c562df0329af5289",
      "Title": "Dose dense chemo and Neulasta question"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Dr. Leo and Kristen, Kristen thanks for your question. At diagnosis I wanted immediately to be part of a clinical trial, if I could find any that I felt were asking questions that were meaningful to me and that I would qualify for. I was too confused at time of diagnosis to effectively find a clinical trial for me. Later I found the national website (ClinicalTrials.gov). I searched for any trial dealing with libido. Because of my family history I eventually got into The Early Detection for Ovarian Cancer clinical trial (and I am still in that trial, which lasts several years). But I kept watching the website for a trial dealing with libido, and last year found it. It wasn't open for a long time, but I dogged it and the day it opened I was on the phone calling. It wasn't simple. None of the locations offering the trial were near me; the closest were either Hawaii or Arizona. I had to find the money to get there and I had to pay for the physical exam and initial lab. I didn't know for sure that my labs would allow me to qualify even on the plane ride down there. Life is sometimes a gamble and I'm not really much of a gambler. But I want very much for answers to the question of post-treatment loss of libido to be worked on, instead of just being part of the problem and feeling that nobody cares as long as we are fortunate enough to be alive. I also think that some of the best answers to breast cancer will probably be found through a more thorough understanding of hormones. As with most things we don't know about, there are possible risks. Like Leo I know it will be years yet before something is available. There are always conflicting interests in wider spheres than the realm of bc survivors when it comes to a clinical trial like this and any results. A few other comments: The short answer to the question \"Did testosterone help with libido?\" the answer is yes. 1. Before participating in the clinical trial, I found that a number of women in online discussions who had experience using testosterone mentioned that it took quite a while before they experienced good effect. The 4 weeks of the clinical trial may not be long enough to demonstrate the effect accurately either way. 2. In the late 1990's there was program on Oprah on national TV where a general group of postmenopausal women who had used the testosterone cream were explaining how helpful they had found it to be. A major difference between their use and the use in the clinical trial was that those women were using it directly on the perineal area/clitoris, whereas the clinical trial required it to be applied to the stomach and upper thighs. 3. Another difference between the effects experienced by each of the 2 groups would be that a high percentage of the group of bc survivors would likely have had a more complete transition to menopausal hormonal levels due to having had chemotherapy. 4. Another difference between the effects experienced by each of the 2 groups would be that many of the bc survivors would likely have at some time been on (and probably still are on) medication affecting hormonal levels throughout the clinical trial, such as letrozole, anastrozole, etc. in addition to having had chemotherapy. 5. Another difference in effect for some of the women in the trial may be due to which method they were using as a lubricant, and whether it included any estrogen. So?. Prior to starting the trial I had spent 1 3/4 years on tamoxifen and then had not been on any hormonal suppressant medication for a long period of time. At the end of the clinical trial it was the general mood and energy that are a legitimate component of libido that had improved for me. In addition, for some time prior to the clinical trial and during the clinical trial, I was using the E-string, which dispenses a minute amount of estrogen directly to the vaginal area. Prior to the clinical trial I found that it helped somewhat but that intercourse was still quite uncomfortable and very mechanical. What I didn?t know at the time that the 8 weeks of the clinical trial ended but since have discovered is that intercourse is now a lot less painful--even during a break from the testosterone while I was in the process of getting it prescribed in my home town. I am still using the E-string. I do not know if the testosterone \"triggered\" this improvement, or what. If it did, maybe I don't even need to continue the testosterone. There still is no sexual response to breast stimulation in either breast. (I am a left lumpectomee, hanging off the edge of Stage 1.) I do feel that the increased interest I have in the physical expression of intimacy and passion is very worthwhile. No, it isn't exactly like being in the back seat of a Chevy as a teenager, but is much better for me from how I felt prior to participating in the clinical trial. I am interested in trying an aromatase inhibitor to see what affect (if any) that may have. AlaskaAngel",
      "MessageIndex": 3,
      "PostDate": "01/04/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/723-Libido-natinal-clinical-trial?s=1b276477decf6519c562df0329af5289",
      "Title": "Libido, natinal clinical trial"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "If my history still prints at the bottom of this message you can see why I might consider genetic testing. (There is also an aunt who died of ovarian cancer, not listed there.) As part of the clinical trial I am in I was given genetic counseling. If you are pondering whether to get genetic testing, it wouldn't hurt to seek genetic counseling. It gives you a much clearer focus after considering your particular history. After receiving counseling, if my history had been stronger or if I had children I would have wanted testing. As it is, my sister already knows she is at high risk and is doing everything possible to be careful for herself so I am not being tested. The last I heard, testing was running around $2500 and some insurance covers it some do not.",
      "MessageIndex": 3,
      "PostDate": "10/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/439-BRCA1-and-BRCA2?s=1b276477decf6519c562df0329af5289",
      "Title": "BRCA1 and BRCA2"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "It is hard to choose between valuing your own perceptions and those who are licensed and paid to do their job, especially with something that gets as complex as cancer treatment. I don't think you would be as worried as you are if there wasn't good reason. In your situation another opinion could at least perhaps relieve your mind, and if the advice is different from the treatment you are getting you at least would have more information to use in deciding what to do. Best wishes, AlaskaAngel",
      "MessageIndex": 17,
      "PostDate": "27/04/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/912-Dose-dense-chemo-and-Neulasta-question?s=1b276477decf6519c562df0329af5289",
      "Title": "Dose dense chemo and Neulasta question"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "If my history still prints at the bottom of this message you can see why I might consider genetic testing. (There is also an aunt who died of ovarian cancer, not listed there.) As part of the clinical trial I am in I was given genetic counseling. If you are pondering whether to get genetic testing, it wouldn't hurt to seek genetic counseling. It gives you a much clearer focus after considering your particular history. After receiving counseling, if my history had been stronger or if I had children I would have wanted testing. As it is, my sister already knows she is at high risk and is doing everything possible to be careful for herself so I am not being tested. The last I heard, testing was running around $2500 and some insurance covers it some do not.",
      "MessageIndex": 13,
      "PostDate": "10/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/439-BRCA1-and-BRCA2?s=1b276477decf6519c562df0329af5289",
      "Title": "BRCA1 and BRCA2"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "If my history still prints at the bottom of this message you can see why I might consider genetic testing. (There is also an aunt who died of ovarian cancer, not listed there.) As part of the clinical trial I am in I was given genetic counseling. If you are pondering whether to get genetic testing, it wouldn't hurt to seek genetic counseling. It gives you a much clearer focus after considering your particular history. After receiving counseling, if my history had been stronger or if I had children I would have wanted testing. As it is, my sister already knows she is at high risk and is doing everything possible to be careful for herself so I am not being tested. The last I heard, testing was running around $2500 and some insurance covers it some do not.",
      "MessageIndex": 23,
      "PostDate": "10/01/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/439-BRCA1-and-BRCA2?s=1b276477decf6519c562df0329af5289",
      "Title": "BRCA1 and BRCA2"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Some of you may be aware that drugs stimulating the production of blood cells for anemia are being examined more closely due to some questions about them that have been raised. Many breast cancer patients get these drugs as part of their treatment, particularly those doing dose-dense treatment. The drugs MIGHT not be a problem when not exceeding the recommended dose, but you might want to read this very current update about these drugs: http://www.oncolink.upenn.edu/resour...&ss=222&id=937 AlaskaAngel",
      "MessageIndex": 0,
      "PostDate": "21/05/2007",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/4696-blood-cell-stimulating-drugs?s=1b276477decf6519c562df0329af5289",
      "Title": "blood cell stimulating drugs"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi ODIGOBLU, I do not speak Spanish but know breast cancer well enough to make a pretty good guess, if that helps. If you can tell me how big the tumor was that would be helpful. Otherwise the 3 key items in what you wrote I believe say that you are highly ER positive, highly PR positive, and HER2 negative. it doesn't get much better than that -- but the size of the tumor is also important. Basically it means you are considered strongly \"hormone receptor positive\" and \"HER2 negative\". Being hormone receptor positive is a very good thing because it means that after basic therapy of chemo and/or radiation you can be put on either a daily pill like tamoxifen if you are premenopausal, or on Arimidex (anastrozole), Femara (letrozole), or Aromasin (exemestane) if you are postmenopausal. They help keep cancer from coming back. Take a look at the cancer characteristics I had, and then try to tell me anything more about yours, including size. Did you just have a single tumor? How old are you? Also, this link will explain a lot about who gets treated with what in the U.S., so try looking here. It is the national guidelines for breast cancer. I will come back later and see if you have read this and answered me. http://www.nccn.org/patients/patient.../3_work-up.asp AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "19/03/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2682-INFO-ON-IDC-and-a-language-problem?s=1b276477decf6519c562df0329af5289",
      "Title": "INFO ON IDC and a language problem"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I see you did give your age. You are considered \"young\" in terms of breast cancer and that means your risk is higher for various reasons. But tell me how big the tumor was, please. AlaskaAngel",
      "MessageIndex": 2,
      "PostDate": "19/03/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/2682-INFO-ON-IDC-and-a-language-problem?s=1b276477decf6519c562df0329af5289",
      "Title": "INFO ON IDC and a language problem"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Sharon. What I've seen was in regard to concerns that led to investigations involving the use of Procrit, and I haven't yet seen any definite conclusions about it one way or the other. AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "26/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/912-Dose-dense-chemo-and-Neulasta-question?s=1b276477decf6519c562df0329af5289",
      "Title": "Dose dense chemo and Neulasta question"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "There could be a lot of reasons for chemobrain, including the cancer itself. For example in my case it could just as well have been the result of using tamoxifen after chemo, which I did for a period of time by medical direction. In recommending chemo and then tamoxifen to me, my doctors did what is commonly accepted by their peers. It was my choice to make and I made it. I am currently having exams to find out why I have low-level pain in my right side, as well as low blood counts and high alk-phos and high ALT and AST. I am still considered NED. Abdominal ultrasound and abdominal/pelvic CT have shown no reason. I have posted under a separate subject about the loss of libido after starting tamoxifen upon completion of chemo. For someone who started out with good health, no chronic illness, and as Stage 1 bc, I have to share what is happening to me in the 3 years since dx.",
      "MessageIndex": 3,
      "PostDate": "20/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/355-Chemobrain?s=1b276477decf6519c562df0329af5289",
      "Title": "Chemobrain"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I did tamoxifen until I decided being HER2+++ and taking it wasn't the best idea for me. No meds except occasional muscle relaxant, 1/4 of 10 mg, for old injury that really needs PT instead or with that. Supplements: Natural sunshine whenever I can get it, no more than 20 minutes each side Days with no sunshine I take cod liver oil capsules for the vitamin D Exercise 20 minutes a day Flax seed fresh ground 2 tablespoons a day Olive oil for cooking and salads Small piece of liver once or twice a week Multivitamin CoQ10 50 mg a day Calcium 1500 mg a day Magnesium and selenium, low dose, 1/2 pill, alternating each one every other day Antioxidant capsule Frequent wild cold water fish No red meat (other than liver) No dairy",
      "MessageIndex": 2,
      "PostDate": "01/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/525-What-are-you-taking?s=1b276477decf6519c562df0329af5289",
      "Title": "What are you taking?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "On another forum I saw posts about cording in the breasts, which was mostly discussed as something felt to be \"ropy\" in the breast and was due to rads treatment for bc. I don't think it is very common. The woman who posted about it was being treated with a medication for it and she wasn't sure whether the medication was helping or not. I have rads damage in the breast too, called \"fatty necrosis\", but it is a very hard piece of tissue where the fat in the breast was burned and melted into a hard shape. It is painful to any pressure so I no longer can sleep on my front side at all, and it isn't very pleasnt. It isn't all that common either. I have taken a very low dose of amitriptyline for it at times, but that along with the loss of estrogen from chemo treatment was too drying to the eyes, so I only take the amitriptyline when the pain is pretty awful. Best wishes to you. I wish there was more awareness of how damaging treatment can be for us, so that docs have more genuine perspective about recommending it to some of us for whom the benefit is so marginal. AlaskaAngel I suspect both of these are just uncommon enough that they are not usually mentioned as possible side effects from radiation -- whether or not we have a \"right to know\" so that we can make better decisions about whether to have treatment.",
      "MessageIndex": 3,
      "PostDate": "15/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/326-Cording-in-breast-due-to-radiotherapy?s=1b276477decf6519c562df0329af5289",
      "Title": "Cording in breast due to radiotherapy"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Like Kristin says, extra calcium is generally recommended in particular for those who have had chemo, taking it in several doses spread apart. We all start losing bone density around age 35 anyhow. I was recommended to take 1500 mg a day even though my bone density test came out very well. By the way, if you happen to be a salt-aholic like me, you should understand that enjoying that extra salt also causes you to lose calcium. *sigh* What will I have to give up NEXT....!!! AlaskaAngel",
      "MessageIndex": 14,
      "PostDate": "04/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/725-vitamins?s=1b276477decf6519c562df0329af5289",
      "Title": "vitamins"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "It was hard to find out after going through treatment just how long it takes to be able to have enough endurance to get going again with exercise. For me it was about a year and a half, which translated to over 2 years after diagnosis. It was very educational to learn just how fast we go to pot when we are taking a beating from treatment. I have a lot more sympathy for other people than I used to. I love to snowshoe too -- much better than skiing (we only have cross-country here as the nearest commercial skiing is hundreds of miles away and might as well be on the moon) -- although ice skating is my newest sport and I just wish we had good ice on the lakes more often... A.A.",
      "MessageIndex": 13,
      "PostDate": "08/02/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/542-The-day-is-almost-here-ahhhhhhhhh?s=1b276477decf6519c562df0329af5289",
      "Title": "The day is almost here..........ahhhhhhhhh"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "It is hard to choose between valuing your own perceptions and those who are licensed and paid to do their job, especially with something that gets as complex as cancer treatment. I don't think you would be as worried as you are if there wasn't good reason. In your situation another opinion could at least perhaps relieve your mind, and if the advice is different from the treatment you are getting you at least would have more information to use in deciding what to do. Best wishes, AlaskaAngel",
      "MessageIndex": 7,
      "PostDate": "27/04/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/912-Dose-dense-chemo-and-Neulasta-question?s=1b276477decf6519c562df0329af5289",
      "Title": "Dose dense chemo and Neulasta question"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Being close to 1 cm can be sort of a blessing or a curse, because it is usually the cutoff point for adding chemo to treatment. You probaby already have this link that shows what the standard breast cancer treatments are but I'll put it here just in case: http://www.nccn.org/patients/patient.../3_work-up.asp My personal interpretation is that LVI is a significant factor and particularly for those who are ER/PR negative, and would mean being more aggressive with treatment. AlaskaAngel",
      "MessageIndex": 1,
      "PostDate": "26/05/2006",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/3004-Vascular-invasion?s=1b276477decf6519c562df0329af5289",
      "Title": "Vascular invasion"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Some people make such a huge difference in so many lives in so many ways that the hole they leave behind is immense... AlaskaAngel",
      "MessageIndex": 2,
      "PostDate": "13/04/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/762-So-tragic?s=1b276477decf6519c562df0329af5289",
      "Title": "So tragic"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "You're welcome, Liz. By the way, I eventually did make it a point to go back and see the rads doc I had for rads treatment, even though I had to travel back to California to do it. I think that rads docs do not generally see these problems because it takes so long for them to surface. I wanted the rads doc to have more information about what happens with some of the patients she has treated. I like her quite a bit as she has always been very conscientious with me. She examined the breast and we decided to do an MRI for the area in question. The MRI did not indicate cancer. I then saw my surgeon, who had told me previously that he believed it was probably fatty necrosis. He then reviewed the MRI as well. He eventually did a needle aspiration, which I appreciated because it did relieve some of the pressure/pain that had been building up, and that pain has never been quite as bad since then. So... in summary... I think the docs are not as informed about these things as they would be if in the normal course of events they did get to see us again, which they generally don't, so they just truly don't actually know what the outcome is. But now my rads doc does know. Alaska Angel",
      "MessageIndex": 6,
      "PostDate": "16/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/326-Cording-in-breast-due-to-radiotherapy?s=1b276477decf6519c562df0329af5289",
      "Title": "Cording in breast due to radiotherapy"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Sharon and Pastor Rich, When I finished CAF x 6 here in Alaska, my husband and I chose a brand-new rads facility in Northern California to do the rads treatments, because it was located within a block of my sister's workplace and only 9 miles from her home. So... it meant 4 days' driving time for us. I am self-employed full-time and have no stand-in for daily work deadlines, so it also meant working 8-hour days for me while traveling and throughout treatment, wherever we might be, including the 4-day drive back home. Sometimes it was hectic. He had to return home by plane after leaving me there, and then fly south to help me drive back. He also attended a conference for his job in Reno at exactly the time when my rads doc said I could take a 3-day break if I made up the time afterward, so we enjoyed that side trip. Everyone was very understanding about giving me time and opportunity to rest. I think the only time I got especially exhausted was when we did a 1 1/2 mile hike into a canyon and swam in a river and then hiked back up the steep canyon wall. I have no other health conditions that could add to the discomfort of treatment. My rads doc saw me every week throughout treatment. Our trip back was made just in time to get through Canada in a light snow, before the winter really set in. The tiredness that I had after chemo did take 2 years to completely go away to where I could exercise without getting terribly out of breath. Part of that came from being overweight from all the steroids I had during chemo. But it is quite common to have lingering tiredness from all the treatment for a long time afterward. And the tiredness wasn't the kind that interfered with my life really. It just slowed me down for that 2 years. I had to take a little more time to get things done, and a little more time out a little more often, but it was fine. So as long as you don't plan to disco every night for fun right after she is done, enjoy your travels! A.A.",
      "MessageIndex": 2,
      "PostDate": "08/03/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/638-How-did-you-feel-after-radiation?s=1b276477decf6519c562df0329af5289",
      "Title": "How did you feel after radiation?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Like Kristin says, extra calcium is generally recommended in particular for those who have had chemo, taking it in several doses spread apart. We all start losing bone density around age 35 anyhow. I was recommended to take 1500 mg a day even though my bone density test came out very well. By the way, if you happen to be a salt-aholic like me, you should understand that enjoying that extra salt also causes you to lose calcium. *sigh* What will I have to give up NEXT....!!! AlaskaAngel",
      "MessageIndex": 4,
      "PostDate": "04/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/725-vitamins?s=1b276477decf6519c562df0329af5289",
      "Title": "vitamins"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "You could also go to mayoclinic.com and search under breast cancer, and then read what it has to say about different types of biopsies. A.A.",
      "MessageIndex": 3,
      "PostDate": "27/04/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/949-Being-Silly?s=1b276477decf6519c562df0329af5289",
      "Title": "Being Silly?"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Leo. I was diagnosed with HER2+ bc at the end of 2001 and like most, had a lot to learn but little time to make decisions about treatment. Since then I have explored a number of bc \"decision guides/tools\" online. It seems to me that it is more than just a little hypocritical for oncs to routinely recommend using chemo that includes an anthracycline for patients who are HER2+ and yet they can't come out of the closet to agree on that enough to put that criteria in the online decision guides. Has ASCO ever come out with a consensus statement on this? If so, why wouldn't it be included as part of the online decision guides? It is deceptive not to include this in the decision guides, particularly since anthracylines pose some additional potential dangers. Why should we have to continue to rely on what each onc \"thinks\" and \"recommends\" if they aren't basing that on a consensus after considering what evidence there is?",
      "MessageIndex": 0,
      "PostDate": "22/11/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/238-Oncologic-hypocrisy?s=1b276477decf6519c562df0329af5289",
      "Title": "Oncologic hypocrisy"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks for the response, Leo. I know the reason for having decision guides in the first place is to try to explain and simplify the complicated nature of breast cancer. I still believe the decision guides for adjuvant treatment should at least reference the issue of HER2 and anthracyclines somewhere, because without that the results can be discordant with what most oncs would actually recommend, which tends to make one wonder if the onc they are seeing is out of touch or just tends to hand out the nastiest chemo as a rule of thumb. A.A.",
      "MessageIndex": 2,
      "PostDate": "23/11/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/238-Oncologic-hypocrisy?s=1b276477decf6519c562df0329af5289",
      "Title": "Oncologic hypocrisy"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "Rashmi I don't know what you will eventually find out from the exam you have had, but mammography, ultrasonography, CT, MRI or PET are the types of imaging tests normally used to detect breast cancer. I originally had fibroadenomas, but I requested that they be biopsied to verify that they were not cancerous. Eventually a cancer grew large enough to also be suspicious and it was biopsied and I had a lumpectomy followed by standard treatment. Sometimes fibroadenomas or cysts can be painful, so don't necessarily assume it is cancer - but if they can't biopsy it then maybe you can get a second opinion and another try at a biopsy.",
      "MessageIndex": 1,
      "PostDate": "05/02/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/2483-suggestion-please?s=1b276477decf6519c562df0329af5289",
      "Title": "suggestion please"
    },
    {
      "AuthorID": "AlaskaAngel",
      "AuthorURL": "https://www.cancerforums.net/members/81-AlaskaAngel?s=1b276477decf6519c562df0329af5289",
      "Content": "I'd recommend finding and buying or borrowing a copy of Dr. Susan Love's Breast Book and reading about FNA in there to figure out whether you prefer FNA, core biopsy, or excision biopsy and to get an understanding of what stereotactic biopsy is. \"solid\" is a term used in radiology to indicate that whatever that lump is, it is not fluid-filled; fluid-filled would be interpreted as benign. However, not all solid lumps are cancerous, which is why a biopsy is necessary to say for sure. Let us know how things go for you. AlaskaAngel",
      "MessageIndex": 2,
      "PostDate": "27/04/2005",
      "Signature": "Dx Dec 2001 at age 50 Lumpectomy Jan 2002, 1.6 cm IDC plus some DCIS Node neg ER+, PR+, HER2+++ CAF x 6, 35 rads+boost, 1 3/4 yr tamoxifen, No taxane, no trastuzumab, no aromatase inhibitor NED Tamoxfen 1 3/4 yrs In 2 clinical trials bc for mom and 1 sis and 1 aunt and 1 granny ovarian cancer for 1 aunt",
      "ThreadURL": "https://www.cancerforums.net/threads/949-Being-Silly?s=1b276477decf6519c562df0329af5289",
      "Title": "Being Silly?"
    }
  ]
}