{
  "AuthorID": "alice2111",
  "AuthorURL": "https://www.cancerforums.net/members/120938-alice2111?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "alice2111",
      "AuthorURL": "https://www.cancerforums.net/members/120938-alice2111?s=1b276477decf6519c562df0329af5289",
      "Content": "Originally Posted by BobInBonita Alice, You have replied to two threads that are very old. It is extremely unlikely that the original posters will read your replies. Please read our rules about alternative treatments. This website only supports scientific documentation. The website you liked to uses some legitimate scientific sources but draws very questionable conclusions from them. Please introduce yourself and tell us what your relationship is to cancer. Both of your posts were in the breast cancer forum. Bob Thanks for your note. I will notice",
      "MessageIndex": 4,
      "PostDate": "23/11/2016",
      "ThreadURL": "https://www.cancerforums.net/threads/36482-Anxiety-Meditations?s=1b276477decf6519c562df0329af5289",
      "Title": "Anxiety Meditations?"
    },
    {
      "AuthorID": "alice2111",
      "AuthorURL": "https://www.cancerforums.net/members/120938-alice2111?s=1b276477decf6519c562df0329af5289",
      "Content": "You can try cottage cheese. It is known to release anxiety effectively. Potassium in its ingredients constitutes health benefits on the prevention against anxiety and strokes. It is confirmed by many research https://wikihomenutrition.com/cottag...ealth-benefits You can add them into her meals everyday. I hope it could be helpful.",
      "MessageIndex": 2,
      "PostDate": "23/11/2016",
      "ThreadURL": "https://www.cancerforums.net/threads/36482-Anxiety-Meditations?s=1b276477decf6519c562df0329af5289",
      "Title": "Anxiety Meditations?"
    },
    {
      "AuthorID": "alice2111",
      "AuthorURL": "https://www.cancerforums.net/members/120938-alice2111?s=1b276477decf6519c562df0329af5289",
      "Content": "I totally agree with you. However, besides the methods you mentioned, I think the diet also plays the important role. As my opinion, consume foods suggested for cancer prevention is one of the cheapest, easiest and best way. As many research, wheat germ is very beneficial to prevent cancer. By adding wheat germ into daily diet, people may lower risk factors for many cancer types. In fact, wheat germ shows good ability to neutralize glucose metabolism and keep numerous kinases in check. Glucose metabolism and kinases are 2 factor which may trigger cancer. Thus, it is the permanent food in my meals. Source: https://wikihomenutrition.com/wheat-...ealth-benefits",
      "MessageIndex": 3,
      "PostDate": "23/11/2016",
      "ThreadURL": "https://www.cancerforums.net/threads/10771-Prevention-is-better-than-cure?s=1b276477decf6519c562df0329af5289",
      "Title": "Prevention is better than cure."
    }
  ]
}