{
  "AuthorID": "artour",
  "AuthorURL": "https://www.cancerforums.net/members/12309-artour?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "artour",
    "AuthorURL": "https://www.cancerforums.net/members/12309-artour?s=1b276477decf6519c562df0329af5289",
    "Content": "STUDY OF APPLICATION OF THE REDUCED BREATHING METHOD IN A COMBINED TREATMENT OF BREAST CANCER Short communication S. N. Paschenko, Zaporozhsky State Institute of Further Medical Education, Zaporozhie, Ukraine Oncology (Kiev, Ukraine), 2001, v. 3, No.1, p. 77-78. Rakhimov (PhD) Abstract. It was established that elimination of hyperventilation and hypocapnia in patients with breast cancer (T1-2N1M0) after the completion of the special treatment led to increased three-year survival rate, better quality of life, including released fear of unfavorable outcomes of the treatment, improved working ability, easier social adaptation and relief of edema of upper extremities. Introduction It is known that oxygen partial pressure in malignant tumors is lower than in unaffected tissue or in benign tumors [1, 2]. It is also established that decreased partial pressure of oxygen stimulates cell proliferation [3]. The majority of researchers link tumor hypoxia to, first of all, the state of oxyhemoglobin in red blood cells. During malignant growth of tumors, hyperventilation is developed, the partial pressure of blood carbon dioxide is lowered, and there is a shift of the curve of blood hemoglobin dissociation [4-6]. The degree of affinity of oxygen to hemoglobin decreases in accordance with tumor growth [7]. Moreover, the outer respiration function is disturbed: many patients with cancer have increased minute ventilation which results in, on the one hand, reduced oxygen utilization, and, on the other hand, the development of hypocapnia. The reduced difference between the maximum lung ventilation and the minute ventilation increases the risk of metastasis [8]. It is also known that carbon dioxide improves tissue oxygenation, reduces lipid peroxide oxidation, and increases tissue tolerance to hypoxia [9]. Elimination of deep breathing promotes elimination of hypocapnia [10,11]. It has been previously established that normal breathing improves quality of life in patients with malignant tumors and increases the efficiency of special anti-cancer treatment. To normalize one's breathing, the yoga methods of treatment have been used and their application resulted in a positive clinical effect [12, 13]. One of the preventive methods to reduce the recurrence and metastasis of breast and lung cancer is autogenic training which promotes relaxation of skeletal muscles and breathing normalization [14]. Physical exercise is an important factor in normalizing carbon dioxide concentration in lung alveoli in animals with experimentally induced tumors, and in patients with cancer. It can modulate oxygenation of tumors and the parameters of metabolism and cellular immunity [15-17]. The goal of our study was to investigate the influence of reduced breathing on elimination of hypocapnia and hyperventilation in patients with breast cancer and the influence of breath correction on the efficiency of special treatment. Subjects and methods We clinically observed and analyzed 120 breast cancer patients (T1-2N1M0) who were treated in the Department of Clinical Oncology (Zaporozhie, Ukraine) from 1996 to 1998. Seventeen patients were aged under 35, 85 patients were aged 36 to 55, and 18 patients were over 56 years old. The patients were surgically treated: Peity's radical mastectomy \" 72 patients (60%); Madden's radical mastectomy \" 20 (16.7%), radical resection of mammal gland with the removal of lymph nodes and the fatty tissue in the surrounding areas (shoulders, armpits, and shoulder blades) \" 25 patients (20.8%), sectoral resection of the mammal gland \" 3 patients (2.5%). The surgical treatment was complemented by standard radiation therapy, adjuvant polychemotherapy (from 3 to 6 sessions, usually CMF), and tamoxifen therapy. Fifteen patients (7.8%) had the course of neoadjuvant polychemotherapy (CMF) or hormone therapy. The control group was formed by 53 patients who were only subject to the special treatment, and the main group was formed by 67 patients who, after the completion of the special treatment, received training in the elimination of deep breathing [18-20]. The patients of the main group underwent 3 to 8 sessions of reduced breathing, 20 to 30 min each, daily. The carbon dioxide content in alveoli was measured with a gas analyzer AUH-2 before and after the completion of the special treatment, as well as after 1, 2 and 3 years of observation. The comparison of quantitative results was made with the use of the Fisher-Student law. Results and Discussion The percentage of carbon dioxide (CO2) in the expired air increased relatively slowly during the elimination of the deep breathing and was dependent upon the age of the patients and the presence of additional pathologies. Before the treatment the amount of CO2 in the expired air in patients of the control group was 2.7±0.2%, and in patients of the main group it was 3.1±0.3% (p>0.05). After the special anti-cancer treatment of patients of both groups, we observed a slight reduction in CO2: 2.4±0.2 and 2.5±0.3% correspondently (p>0.05). After one year, the patients who practiced reduced breathing had a higher CO2 content in the expired air, up to 4.3±0.5% (p<0.05); after two years, up to 5.1+0.5%; and after three years, up to 5.5±0.6% (p<0.05 compared to the initial level). In the control group, this parameter remained unchanged during the entire period of observation and was 3.1± 0.3%. During the three year period of observation, the partial CO2 pressure in patients of the main group aged 50 and older did not exceed 5%. Particularly slow CO2 increase in the expired air was observed in patients who had additional pathologies, such as hypertension, stenocardia, and diabetes mellitus. During the spread of the tumor to distant tissues, CO2 content decreased from 1.5% to 2%. The patients of the main group experienced improvements in their quality of life: disappearance of fear of unfavorable outcomes of the treatment, improved working ability, and easier social adaptation. Seven (13.2%) of the patients in the control group suffered from edema in their upper extremities. The same symptoms were present in 9 (13.4%) patients of the main group. However, unlike the control group, their edema disappeared with elimination of deep breathing. As the CO2 concentration in the expired air increased from to 4.5-5%, we observed an increased resistance of the organism: reduced inflammatory and allergic processes in the upper respiratory airways, reduced blood pressure, less frequent chest pain, and improved working ability and physical endurance. The results of the special treatment were considerably improved. Thus, the three-year survival rate after surgeries was 95.5% in patients of the main group, and 75.5% in the control group (p<0.05). Conclusions 1. The application of the special treatment methods in cancer patients, such as surgeries, radiation therapy and chemotherapy, does not significantly influence CO2 content in the expired air. 2. Additional application of the method of elimination of deep breathing significantly increased CO2 content in the expired air during the whole period of observation (3 years). The achieved effect depended on additional health problems and the patients' age. 3. The elimination of hyperventilation and hypocapnia in patients with breast cancer led to an increase in the three-year survival rate and a better quality of life of patients. References 1. Bulakh AD, Comparative characteristic of O2 tension in malignant and benign tumours. In: Cancerogenesis. Methods of diagnostic and treatment of tumours (in Russian), Kiev, Nauk Doumka, 1971: p. 18-20. 2. Lartigau E, Randrianarivelo K, Martin L, Oxygen tension measurements in human tumors, Radiat Oncol Investigat 1993 (1): p. 285-291. 3. Kosevich AM & Krouglikov IL, Diffusion model of combined consumption of oxygen and glucose by cells of a large tumor (in Russian), Problems of Oncology 1983, 29 (12): p. 68-71. 4. Davidova IG, Kassil' VA, Effects of temporary metabolic alkalosis on bioelectrical activity of the brain in oncological patients with regional and distant metastasis. In: Metastasis of malignant tumors (in Russian). Kiev: Institute of Problems of Oncology and Radiobiology, 1991: p. 37-38, 174-175. 5. Kochetkova MK, Belousov AP, Epshtein IM, Investigation of oxygen-binding ability of blood in patients with malignant tumors (in Russian), Problems of Medical Chemistry, 1969 (1): p. 56-60. 6. Nisam M, Albertson TE, Panacek E, Effects of hyperventilation on conjuctival oxygen tension in humans, Crit Care Med 1986; 14: p. 12-15. 7. Manz R, Otte J, Thews G, Vaupel P, Relationship between size and oxidation status of malignant tumors. In: Oxygen Transp Tissue / Proc Int Symp Detroit 25-28 Aug, 1981, NY \" London, 1983; 4: p. 391-418. 8. Balitsky KP & Pinchuk VG, Pathogenetic aspects of individuality of prognosis and prevention of metastasis (in Russian), Exper Oncol 1989, 11: p. 7-11. 9. Gulyi MF & Mel'nichuk DA, Role of carbon dioxide in regulation of metabolism in heterothroped organisms (in Russian), Kiev, Nauk Doumka, 1978, 242 p. 10. Buteyko KP & Shurgal SI, Functional diagnostic of coronary disease. In: Surgical treatment of the coronary disease (in Russian), Moscow, 1965: p. 117-118. 11. Sinichenko VV, Leschenko GY, Melekhin VD, Emotional-volitional training in complex treatment of patients with rheumatoid arthritis (in Russian), Therap Arch 1990, 62: p. 58-61. 12. Luk'yanenko TV, Outer breathing in patients with tumors of jaw-facial area (in Russian), Stomatology 1977, (5): p. 47-48. 13. Nagarathna R, Seethalakshmi R, Krichnamurt TG, Cancer Syoga therapy. In: Proc Annu Int Conf IEEE Eng Med and Biol Soc, New York, 1991: p. 2388-2389. 14. Grossarth-Maticek R, Krebs and Psyche. Die Verhalfens-dimension in der Onkologie, Dtsch J Onkol 1992, 24: p. 155-162. 15. Mosienko VS, Krasyuk AN, Zagoruiko LI, Effect of physical exercise and high altitude on oncological process in animals (in Russian), Experim Oncol 1984; 9: p. 58-61. 16. Sternyuk YM & Gnatjishak AI, Correction of metabolic immunodepression in breast cancer patients. In: Systematic pathogenetic approach to prevention, early diagnostic and treatment of hormone-dependent tumors in women (in Russian), Novgorod-Leningrad, 1988, 57 p. 17. Bernstein L, Ross RK, Lobo RA, The effects of moderate physical activity on menstrual cycle patterns in adolescence: Implications for breast cancer prevention, Brit I Cancer 1987; 55: p. 681-685. 18. Paschenko SN & Gusakov AD, Treatment of patients with neuro-vegetative form of vasomotor rhinitis with modified method of elimination of deep breathing (in Russian), Journal of Ear, Nose and Throat Diseases 1994; (3): p. 10-13. 19. Paschenko SN, Gusakov AD, Voloshin NA, Treatment of patients with chronic allergic vasomotor rhinitis with the method of reduced breathing (in Russian), Journal of Ear, Nose and Throat Diseases 1995; (1): p. 4-8. 20. Paschenko SN, Levik NN, Ryabikov AV, Paschenko IV, Treatment of diseases with reduced breathing and the Buteyko method (foundations of the hypometabolic therapy) (in Russian), Melitopol', 1998, 73 p.",
    "MessageIndex": 0,
    "PostDate": "19/12/2009",
    "ThreadURL": "https://www.cancerforums.net/threads/11459-Clin-Trial-Women-with-normal-breathing-survived-metastas?s=1b276477decf6519c562df0329af5289",
    "Title": "Clin Trial: Women with normal breathing survived metastas.."
  }]
}