{
  "AuthorID": "daughter1",
  "AuthorURL": "https://www.cancerforums.net/members/2487-daughter1?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "daughter1",
      "AuthorURL": "https://www.cancerforums.net/members/2487-daughter1?s=1b276477decf6519c562df0329af5289",
      "Content": "I am so sorry about your situation. My mother had her tumor removed three months ago. It has been a nightmare for our whole family too. Please take one day at a time. Be proactive. Ask all the questions you have in mind. There is no such thing as silly questions. Also, keep open communications with all the doctors and medical onocologists. Keep praying. Keep in touch.",
      "MessageIndex": 2,
      "PostDate": "26/06/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/3045-Found-out-today-that-my-mum-has-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "Found out today that my mum has breast cancer"
    },
    {
      "AuthorID": "daughter1",
      "AuthorURL": "https://www.cancerforums.net/members/2487-daughter1?s=1b276477decf6519c562df0329af5289",
      "Content": "I am so sorry about your situation. My mother had her tumor removed three months ago. It has been a nightmare for our whole family too. Please take one day at a time. Be proactive. Ask all the questions you have in mind. There is no such thing as silly questions. Also, keep open communications with all the doctors and medical onocologists. Keep praying. Keep in touch.",
      "MessageIndex": 12,
      "PostDate": "26/06/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/3045-Found-out-today-that-my-mum-has-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "Found out today that my mum has breast cancer"
    },
    {
      "AuthorID": "daughter1",
      "AuthorURL": "https://www.cancerforums.net/members/2487-daughter1?s=1b276477decf6519c562df0329af5289",
      "Content": "Dr. Leo, I hope that you can find the time to read this and answer my questions. My mother means the world to me. My mother is 54 years old. She had a lumpectomy on March 2006. She is perimenopausal. The pathology report came back as follows: T1N0M0 0.7 cm IDC with 0.8cm DCIS component. Well modified Bloom & Richardson- Architectural Grade 2, Nuclear Grade 2, Miotic Index 1. Negative margins. SLN was done with negative nodal involvement. Negative for vascular space invasion. 90% staining for ER+ and PR+. 3+ for Her 2 neu (Dako). Oncotype DX test score is 17 (with no her2neu mRNA detected). Fish test was done but came back inconclusive because of limited tumor sample. However, the pathologist said that she could not see amplification with the nuclei which were available (but fewer than 20 nuclei were able to be examined). My mother's oncologist had put her through radiation therapy (5 weeks) which my mother will complete by the end of this week. Due to the small size of the invasive tumor and being ER/PR+, my mother's oncologist does not recommend my mother for chemo or herceptin. Instead, the oncologist is giving my mother Zoladex monthly(to help her reach menopause) and tamoxifen daily. Please tell me if these treatments are effective for my mother. I am very concerned about the 3+ for her2+ (DAKO). Do you think that Zoladex and tamoxifen are effective for my mother? Is there \"cross-talk\" between hormonal and her2 receptors through the use of Zoladex and tamoxifen? Is it true that reducing estradiol (by Zoladex) would increase Her 2 level? Do Zoladex and/or tamoxifen make it worse for ER+/PR+/her2+ tumor? Please answer these questions as soon as possible. Thank you.",
      "MessageIndex": 0,
      "PostDate": "26/06/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/3142-Questions-about-my-mother-s-treatments?s=1b276477decf6519c562df0329af5289",
      "Title": "Questions about my mother's treatments"
    }
  ]
}