{
  "AuthorID": "Dorothy Lynn",
  "AuthorURL": "https://www.cancerforums.net/members/8888-Dorothy-Lynn?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Dorothy Lynn",
      "AuthorURL": "https://www.cancerforums.net/members/8888-Dorothy-Lynn?s=1b276477decf6519c562df0329af5289",
      "Content": "Nancy, Thank you for taking the time to share your experiences, I sincerely appreciate your advice. I don't know what kind of doctor to try to see...with two mammograms that don't indicate anything positive, I'm afraid no one will see me. I ordinarily see a family doctor/internal medicine and all my specialists (orthopedic, G/I, ENT, gynecologist, etc.) but I honestly don't think any other doctor will address my fears if the radiologist doesn't pinpoint a problem. Are there other tests I could request? Our insurance is so weird - they aren't ever particularly receptive to anything not absolutely essential and I cannot afford to pay to start over with another doctor. I'm overwhelmed - my husband has had two open-heart surgeries and isn't well, I'm my mother's primary caregiver, and I have two little dogs with tremendous special needs...and I'm also wondering if I'm too stressed out and emotionally drained to even be thinking straight. Am I making a mountain out of nothing? Reading what so many here have been through, I feel like a jerk even asking about such a personal concern. I do know that if I was facing cancer, I definitely would need professional help more willing to work with me and answer my questions than this radiologist. I'm also sorely disappointed in the quality of medical care my family seems to receive and two years ago my father died during surgery because of a doctor's negligence. Maybe I'm just over-reacting to everything. I don't know how to go to another doctor and say I've had two mammograms, the radiologist doesn't seem particularly concerned about two lymph nodes, but I'm scared. I really don't believe anyone will take me seriously at this point. Dorothy Lynn",
      "MessageIndex": 2,
      "PostDate": "03/08/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5026-Lymph-Node-Question?s=1b276477decf6519c562df0329af5289",
      "Title": "Lymph Node Question"
    },
    {
      "AuthorID": "Dorothy Lynn",
      "AuthorURL": "https://www.cancerforums.net/members/8888-Dorothy-Lynn?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks again, Nancy. I need encouragement - that's a fact! My so-called life has been so chaotic the past few years that I know (or worry) that people will think I'm over-reacting. I fear being seen as a middle-aged hypochondriac! I've actually always been SO healthy that I don't honestly know how to pursue something like this. When I get more time I want to pursue another question - I've heard people say that extreme stress is often associated with cancer and I'm curious what y'all believe. I've read many pages in this forum and am so totally blown away by the courage and determination of so many cancer victims. Y'all are absolutely an amazing group of people. Dorothy Lynn",
      "MessageIndex": 4,
      "PostDate": "03/08/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5026-Lymph-Node-Question?s=1b276477decf6519c562df0329af5289",
      "Title": "Lymph Node Question"
    },
    {
      "AuthorID": "Dorothy Lynn",
      "AuthorURL": "https://www.cancerforums.net/members/8888-Dorothy-Lynn?s=1b276477decf6519c562df0329af5289",
      "Content": "I recently had a screening mammogram and a few days later was called back for a more thorough mammogram. Naturally I was anxious but because I am faithful about my yearly mammograms, I thought if something had happened, I would be catching it early. The radiologist, after viewing the second set of \"pictures\", said he had called me back for a second mammogram to get a better look at two lymph nodes in my left breast. He said the second mammogram didn't shed any further light on the two lymph nodes and he wants me to return for a third mammogram in six months. He did not seem particularly concerned whatsoever and quite obviously was NOT a doctor I could ask about much of anything. I left the imagining center totally bewildered - wondering what these two suspicious lymph nodes would indicate if there is any change visible in six months. Are they a possible precursor to breast cancer? Would a change indicate cancer spreading to my breast from another part of my body? Exactly one year ago I had a thorough check-up, everything from mammogram to colonoscopy to endoscope, etc., and everything was normal. I am 65, do not take any prescription drugs, and feel healthy. I wanted to ask the radiologist about persistant pain I have in the armpit next to the breast he was concerned about...but he behaved like he was too rushed to discuss anything and I'm just thoroughly upset. I almost feel swollen under that armpit but the pain is not constant, it comes and goes for no real reason. I was hoping someone might be willing to share their experiences with this lymph node question. Can I assume that the radiologist's abruptness with me was a sign that it's nothing to worry about - or should I look for a new imaging center? THANK YOU. Dorothy Lynn",
      "MessageIndex": 0,
      "PostDate": "03/08/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5026-Lymph-Node-Question?s=1b276477decf6519c562df0329af5289",
      "Title": "Lymph Node Question"
    }
  ]
}