{
  "AuthorID": "Fanta",
  "AuthorURL": "https://www.cancerforums.net/members/30394-Fanta?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Fanta",
      "AuthorURL": "https://www.cancerforums.net/members/30394-Fanta?s=1b276477decf6519c562df0329af5289",
      "Content": "Originally Posted by ChemoMan Hi fanta Are they suspecting breast cancer or are these your fears? Keep at it and remember the rules I assume they do as they said a biopsy is necessary to rule out malignancy.",
      "MessageIndex": 2,
      "PostDate": "06/04/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/22535-Breast-cancer-Scared-dont-understand-terminology-in-report?s=1b276477decf6519c562df0329af5289",
      "Title": "Breast cancer? Scared dont understand terminology in report"
    },
    {
      "AuthorID": "Fanta",
      "AuthorURL": "https://www.cancerforums.net/members/30394-Fanta?s=1b276477decf6519c562df0329af5289",
      "Content": "Help trying to work out long and short of above report appreciated. Anyone had similar ultrasound findings?",
      "MessageIndex": 3,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/22535-Breast-cancer-Scared-dont-understand-terminology-in-report?s=1b276477decf6519c562df0329af5289",
      "Title": "Breast cancer? Scared dont understand terminology in report"
    },
    {
      "AuthorID": "Fanta",
      "AuthorURL": "https://www.cancerforums.net/members/30394-Fanta?s=1b276477decf6519c562df0329af5289",
      "Content": "Originally Posted by thinkpinkribbon You have to let your doctor view the report, because in my opinion, I am a doctor by the way, it needs special attention. Normal morphology of lymph nodes is actually a very good sign because it denotes that there is no abnormality suggesting a tumor process. As the lymph node in the right axilla enlarged from 2.1 to 3.5, this means an ongoing process which can be inflammatory. The right breast has a mass which is heteregenous--------> this means that there are more than one type of tissue in the mass hyperechoic----------> this means that the mass reflects the ultrasonic waves efficiently which suspects the presence of fluid or cyst. In my opinion, you should undergo a fine needle aspiration cytology to rule out the presence or absence of malignancy, especially if you are above 45 years. LINK REMOVED AS PER FORUM POLICY. PLEASE READ THE RULES AND COMPLY. Thank you so much I appreciate your help. Can you please tell me is the heterogeneous and hyperchoic a good thing or bad? Also the normal morphology could a 3.5cm lymph node be anything other than cancer? If it was cancer would more signs show within the node? What was our link I wouldnt mind googling it.",
      "MessageIndex": 6,
      "PostDate": "09/04/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/22535-Breast-cancer-Scared-dont-understand-terminology-in-report?s=1b276477decf6519c562df0329af5289",
      "Title": "Breast cancer? Scared dont understand terminology in report"
    },
    {
      "AuthorID": "Fanta",
      "AuthorURL": "https://www.cancerforums.net/members/30394-Fanta?s=1b276477decf6519c562df0329af5289",
      "Content": "I had lymph nodes found to be enlarged in an ultrasound. NO lumps in breast dr decided to leave it. I pushed for another scan and now my nodes are grown and I have a breast lump. Can anyone interpret some wording from my report. Lymph nodes of reasonably normal morphology are present in both axillae. The largest in the right is 3.5cm and the largest in the left is 2.5cm. The largest in the right has previously been reported at 2.1cm. At 2 oclock in the right breast there is a hyperechoic heterogeneous mass which is only moderately well defined and measures 1.1x0.6x0.8cm. It has no diagnostic characteristics and its aetiology is uncertain. It shows no vascularity.",
      "MessageIndex": 0,
      "PostDate": "06/04/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/22535-Breast-cancer-Scared-dont-understand-terminology-in-report?s=1b276477decf6519c562df0329af5289",
      "Title": "Breast cancer? Scared dont understand terminology in report"
    }
  ]
}