{
  "AuthorID": "foobar",
  "AuthorURL": "https://www.cancerforums.net/members/11002-foobar?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "foobar",
    "AuthorURL": "https://www.cancerforums.net/members/11002-foobar?s=1b276477decf6519c562df0329af5289",
    "Content": "Well I'm asumming I may have breast cancer. I have a appointment next week with my doctor. I'm worried but I already expect it. I just want to know if anyone think its a possibility its not cancer. Well about 9 months ago I started having symptoms but I did not know anything about breast cancer especially in males. Its started as nipple itch. It was in both nipples. Than a couple days later both nipples were dry and scaly and inverted. No discharge. I used itch creams and they relieved the itching some what. This lasted for maybe 5 days than both my nipples went back to normal. On and off through these 9 months since that happened I have been experiencing slight itching and sometimes tingles. This has been on and off but rarely. About 2 months ago I developed a very painful lump on my right nipple. Its was red and inflamed so assummed it was a swollen lymp node. It quickly went down in a few days and dissappeared completly over time. Now the nipple itching and tingles rarely happen and its in both nipples. Now here is the serious part. Over the last couple weeks a kinda noticed that my right nipple was tilted going down. Now its hard to notice and sometimes it just seemed like my imagination. Yesterday I decided to feel around the right nipple and I felt a pea size bump under my right nipple. I kept feeling it and it got slightly irritated. Now I know lumps are serious. I was just thinking about I been having symptoms in both nipples all this time now a lump pops up in the right one. I know when I got that inflamed lymp node I was feeling around and did not feel that lump before. First I was thinking it was possibly a nipple yeast infection because over the last year I have had a few fungus rashes that I was not treating properly and they lingered for a while but now this lump pops up and I'm thinking strictly cancer. I have been taking natural testosterone supplements with a couple years so I also thought it might be gynecomastia. I have had access fat in my chest area since I was younger so it could be because of to much estrogen. I have the same symptoms as gynecomastia. I don't know if the dryness and retracted nipples are a symptom of it though. The itchiness and the lump I found are symptoms of gyno though. My appointment is next week I just wanted a few opinions. Does anyone have any other possibilties other than cancer. I expect the worst. Thanks",
    "MessageIndex": 0,
    "PostDate": "15/06/2010",
    "ThreadURL": "https://www.cancerforums.net/threads/13323-Need-some-opinions-please-Male?s=1b276477decf6519c562df0329af5289",
    "Title": "Need some opinions please. Male"
  }]
}