{
  "AuthorID": "halekan",
  "AuthorURL": "https://www.cancerforums.net/members/8587-halekan?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "halekan",
      "AuthorURL": "https://www.cancerforums.net/members/8587-halekan?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you Nancy and Jim! We do realize how lucky Mom is to have found the lump so early. We also have no history of breast cancer in the family. We know that it could be worse. I lost one friend to breast cancer after a long battle but I also have a friend who is a survivor (double mastectomy, 21 positive lymph nodes, radiation, chemo, the works) - 8 great yrs and counting!! I worry about Mom having multiple surgeries at her age and so we wondered if she should just have a mastectomy to be on the safe side. I understand better now why the surgeon suggests a lumpectomy. And I feel better now about the current plan for lumpectomy. Hopefully the margins will be clean and the lymph nodes negative. Mom has no problem with the idea of a potential mastectomy. She jokes that she will be able to drop some of those extra pounds she's been carrying around. Thanks so much for sharing your advice and your hope. I wish you both strength and hope to continue the fight, day by day, minute by minute. Thanks again and God bless you, HA Lekan",
      "MessageIndex": 3,
      "PostDate": "15/07/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/4887-need-advice-on-mom-s-biopsy-results?s=1b276477decf6519c562df0329af5289",
      "Title": "need advice on mom's biopsy results"
    },
    {
      "AuthorID": "halekan",
      "AuthorURL": "https://www.cancerforums.net/members/8587-halekan?s=1b276477decf6519c562df0329af5289",
      "Content": "Hello, My mother was recently diagnosed with breast cancer age 73, post menopause diagnosis June 2007 invasive ductal carcinoma, 7 mm ER+, PR+, HER2Neu (-) moderate differentiation no angiolymphatic infiltration (?) I live in TX and Mom is in OH. I would like to be as informed as possible about her options and her medical care. She relies heavily on my opinion as I have a science background. She is scheduled for a lumpectomy and lymph node dissection in a week, followed by radiation treatments. I believe that her doctor is a good one I just fear that a lumpectomy may be too conservative. She is asking for my opinion on whether to just have the lumpectomy or a mastectomy. Thank you for reading this. HA Lekan",
      "MessageIndex": 0,
      "PostDate": "14/07/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/4887-need-advice-on-mom-s-biopsy-results?s=1b276477decf6519c562df0329af5289",
      "Title": "need advice on mom's biopsy results"
    }
  ]
}