{
  "AuthorID": "jonykruger",
  "AuthorURL": "https://www.cancerforums.net/members/18673-jonykruger?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "jonykruger",
    "AuthorURL": "https://www.cancerforums.net/members/18673-jonykruger?s=1b276477decf6519c562df0329af5289",
    "Content": "Stage 4 breast cancer has spread beyond the breast and nearby lymph nodes to other parts of the body. In stage IV breast cancer, the cancer has spread elsewhere in the body. Affected areas may include the bones, brain, lungs, or liver. Because multiple areas may be involved, focused treatments like surgery or radiation alone are not sufficient. So far, treatment of stage IV breast cancer does not provide a cure for the disease. By shrinking the cancer, treatment can slow down the disease, make you feel better, and let you live longer. Although patients with stage IV breast cancer may live for years, it is usually life-threatening at some point. Many factors influence this * Chemotherapy , or treatment with cancer drugs, is often the main treatment. It can slow down the growth of the cancer. Chemotherapy is often used in combination with hormone therapy or immunotherapy. * Hormone therapy can be key for women with hormone receptor-positive cancers. These are cancers that need hormones to grow. Tamoxifen has been used to block the effects of estrogen for decades. But newer drugs, like the aromatase inhibitors Arimidex and Femara, and the aromatase inactivator Aromasin, also show great promise. They reduce the amount of estrogen your body makes. By cutting off the supply of estrogen, you can choke the cancer and slow it down. Women who haven't reached menopause may consider having their ovaries removed to stop them from making hormones that help cancer grow. * Biological therapy is a new approach. In about 25% of women with breast cancer, an excess of a protein known as HER2 makes the cancer spread quickly. Herceptin is a new drug that's been approved to treat women with metastatic breast cancer that is HER2-positive. It stops this protein from making the cancer cells grow. It may also boost your immune system, giving it the strength to fight the cancer itself. It is most often used in combination with chemotherapy. * Clinical trials are open to many women with stage IV cancer. A clinical trial may allow you access to cutting-edge treatments. Many new therapies -- new drugs, new treatments, and new combinations -- are in clinical trials now. Keep in mind that any successful treatment we have now started out in a clinical trial. * Surgery and radiation are used in some cases. These treatments aren't used to cure the cancer. But they may help treat pain and other symptoms in areas where the cancer has spread. * Other drugs may also help treat some of the side effects of breast cancer treatment, such as nausea, fatigue, and infections. Source(s): webmd.com",
    "MessageIndex": 5,
    "PostDate": "12/12/2009",
    "ThreadURL": "https://www.cancerforums.net/threads/11178-Stage-4-breast-cancer?s=1b276477decf6519c562df0329af5289",
    "Title": "Stage 4 breast cancer"
  }]
}