{
  "AuthorID": "Kimmy, South Jersey",
  "AuthorURL": "https://www.cancerforums.net/members/27711-Kimmy-South-Jersey?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Kimmy, South Jersey",
      "AuthorURL": "https://www.cancerforums.net/members/27711-Kimmy-South-Jersey?s=1b276477decf6519c562df0329af5289",
      "Content": "Don't be scared….it can be lots of things and doesn't have to be cancer. I've had a boipsy and it's not terrible. They will numb you and you won't hardly feel a thing! If I had to do it again I would bring my I-Pod. Having head phones on so that I couldn't hear the nurses and dr talking would have been really helpful. I find the less I know the better off I am! (I will pray for you…)",
      "MessageIndex": 2,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://www.cancerforums.net/threads/19912-Scared-and-helpful-information-would-be-great?s=1b276477decf6519c562df0329af5289",
      "Title": "Scared and helpful information would be great"
    },
    {
      "AuthorID": "Kimmy, South Jersey",
      "AuthorURL": "https://www.cancerforums.net/members/27711-Kimmy-South-Jersey?s=1b276477decf6519c562df0329af5289",
      "Content": "I'm a 41 yr old mother of two teenagers. I was diagnosed with breast cancer in June. Because of my family history I decided to have a bi-lateral mastectomy. My surgery was 10/3. I was really feeling good last week and was finally able to get out of the house and even shop! I need both chemo and radiation. I had my first chemo on Monday 11/7. On Tuesday 11/8 they gave me a shot of Neulasta to boost the growth of the white blood cells in my bone marrow. I AM IN EXCRUCIATING PAIN FROM THIS SHOT! They said it would cause bone pain but I've never experienced anything like this before. Every single bone in my body hurts and I feel like I have a bad case of the flu. I hate drugs! I finally weaned off of Percocet and I don't want to go back to that because of the side effects I have with it. Right now I'm taking Zofran for nausea, Ativan for nausea and nerves, 800 mg motrin and tylenol for pain. It hardly helps as all. I'm just trying to figure out how much longer this will last? I'm 5 days in\u0085 I just took a Benadryl because I read that lots of people got relief from that. Doesn't seem to be doing anything for me. Anyone have any experience with this?",
      "MessageIndex": 0,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://www.cancerforums.net/threads/19941-Neulasta-Experiences?s=1b276477decf6519c562df0329af5289",
      "Title": "Neulasta Experiences?"
    },
    {
      "AuthorID": "Kimmy, South Jersey",
      "AuthorURL": "https://www.cancerforums.net/members/27711-Kimmy-South-Jersey?s=1b276477decf6519c562df0329af5289",
      "Content": "I'm experiencing Neulasta pain right now! Briefly, I'm a 41 yr old woman with left breast cancer and decided to have a bi-lateral mastectomy. I need chemo and radiation. I had my first chemo on Monday and my Neulasta shot on Tuesday. They said i'd have bone pain but this is ungodly! I'm taking 800 motrin, tylenol, Zofran and Ativan. NOTHING is making this pain any better. It's awful and I can't believe it's still this bad after 5 days. I've read that Neupogen isn't as harsh but it's also not a one shot treatment. I've also read that Claritan and Benydryl helps…something with the histamine blockers? I hope your situation gets better.",
      "MessageIndex": 2,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://www.cancerforums.net/threads/18368-Incisional-pain-after-chemo-and-or-neupogen-therapy?s=1b276477decf6519c562df0329af5289",
      "Title": "Incisional pain after chemo and/or neupogen therapy?"
    }
  ]
}