{
  "AuthorID": "Kokua",
  "AuthorURL": "https://www.cancerforums.net/members/861-Kokua?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Kokua",
      "AuthorURL": "https://www.cancerforums.net/members/861-Kokua?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks again for your responses. My mom has not taken Tomoxifen (or any of the 3 Aromatase inhibitors, as they were not yet available during her last treatment). I apprecate your time.",
      "MessageIndex": 4,
      "PostDate": "08/07/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1478-My-mom-has-metastatic-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "My mom has metastatic breast cancer..."
    },
    {
      "AuthorID": "Kokua",
      "AuthorURL": "https://www.cancerforums.net/members/861-Kokua?s=1b276477decf6519c562df0329af5289",
      "Content": "She had breast cancer prior to menopause which was sucessfully treated with a lumpectomy and chemotherapy. She had been cancer free for 15 years, but has now been diagnosed as having bone cancer in many bones and in her liver. It is breast cancer and is estrogen receptive. That noted, she is exceptionally \"healthy\" and bikes 25 miles most days (sometimes after a long walk). My question has to do with other users experiences with sequencing aromatase inhibitors and/or Tomoxifen. I cannot find any literature which suggests a basis for choosing a specific one to begin with, and a sequence with which to follow up. Any thoughts/experiences/links will be greatly appreciated. This is an exceptional lady. - Age - 65 in August - Age of diagnosis or time since diagnosis - 49 (first time around), 64 (diagnosed with metastasis as above) - menopausal or not at diagnosis- Post Menopausal (now) Pre Menopausal (earlier diagnosis) - Specific type of cancer (adenocarcinoma, ductal carcinoma in situ, lobular carcinoma etc) I don't know yet - Markers such as estrogen and progesterone receptor status (ER/PR), her2neu status. Yes to Estrogen, I don't know on Progesterone - Stage at diagnosis-See above - Treatments: surgery, chemotherapy (if possible with names), radiation, etc. -See above",
      "MessageIndex": 0,
      "PostDate": "07/07/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1478-My-mom-has-metastatic-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "My mom has metastatic breast cancer..."
    },
    {
      "AuthorID": "Kokua",
      "AuthorURL": "https://www.cancerforums.net/members/861-Kokua?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks for your response. One note: I did find out that my mom is Progesterone Rec. She has actually never taken Tomoxifen, as she was pre menopausal last time around. Does anyone know of any reasearch that has lead to a further understanding of how to best sequence these drugs? Is there a sound reason for a doctor choosing one Aromatase inhibitor over another, or is it somewhat of a crapshoot? Thanks again!",
      "MessageIndex": 2,
      "PostDate": "08/07/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1478-My-mom-has-metastatic-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "My mom has metastatic breast cancer..."
    }
  ]
}