{
  "AuthorID": "LadyHawk57",
  "AuthorURL": "https://www.cancerforums.net/members/11470-LadyHawk57?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "LadyHawk57",
      "AuthorURL": "https://www.cancerforums.net/members/11470-LadyHawk57?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi there. I am new to this site. My Mom is 87 years old and was just diagnosed with breast cancer. She is in awesome shape for an 87 year old and can work circles around most of her 10 children. She has recently under gone many tests to see if cancer was in other breast, heart catherization to make sure heart is strong enough, etc. Cancer is only in right breast and heart tests show to be good although she is on blood thiner (cumadin). Since there are two spots in right breast that show to be cancer 1 spot is 1cm the other way smaller but far away from first site. Dr is suggesting a mastectomy. I fear she will not be able to handle the surgery or the aftercare especially if chemotherapy is required. Her surgery is scheduled for 3/27/08. I do not want to lose my Mom. She is an awesome person. Anyone who has ever met her has a genuine love for her. She is that kind of person. Any suggestion before she goes under the knife??? Any help would be appreciated. Thanks!",
      "MessageIndex": 0,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://www.cancerforums.net/threads/6484-87-year-old-mother-diagnosed-with-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "87 year old mother diagnosed with breast cancer"
    },
    {
      "AuthorID": "LadyHawk57",
      "AuthorURL": "https://www.cancerforums.net/members/11470-LadyHawk57?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Vee, Thank you for your reply. I am attempting to set up a family conference with the doctor to ask questions. Your reply is making me feel that it is necessary to do so. I am not willing to destroy her quality of life. Right now, she feels great except for extensive biopsys and heart tests she has undergone over the past two weeks. UUGGHH. Thank you!!",
      "MessageIndex": 2,
      "PostDate": "20/03/2008",
      "ThreadURL": "https://www.cancerforums.net/threads/6484-87-year-old-mother-diagnosed-with-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "87 year old mother diagnosed with breast cancer"
    },
    {
      "AuthorID": "LadyHawk57",
      "AuthorURL": "https://www.cancerforums.net/members/11470-LadyHawk57?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Cindy, Thank you for responding. Well, my Mom did opt to have the mastectomy. She had a \"drive thru\" mastectomy and came home the same day!! IMAGINE THAT!! She did well with that procedure and felt no pain at all the next couple days. (I would still be in the hospital screaming!!) However, she did have a \"mini stroke\" 48 hours after surgery which may have been caused by the on-off coumadin over the month of testing before surgery. Her speech and some cognitive functions were and still are a problem, but she seems to be getting a little better. She is also on an oral chemo drug which is supposed to work with the estrogen as they did see some tiny specs of cancer in her lymph nodes. So, on we go. Hope all is well with you. Thanks again!! LadyHawk",
      "MessageIndex": 3,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://www.cancerforums.net/threads/6484-87-year-old-mother-diagnosed-with-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "87 year old mother diagnosed with breast cancer"
    }
  ]
}