{
  "AuthorID": "Lorie Brady",
  "AuthorURL": "https://www.cancerforums.net/members/123-Lorie-Brady?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Lorie Brady",
      "AuthorURL": "https://www.cancerforums.net/members/123-Lorie-Brady?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi, Just very curious if any of you on intial dx of BC; was discoverd in both or solitary breast? Thanks for any input. Lorie",
      "MessageIndex": 0,
      "PostDate": "24/03/2005",
      "Signature": "Stage IIIA BC Grade 3; 2.5 cm Left Breast; DCIS Right Breast (comedo type) Bi-Lateral Masectomies Immediate reconstruction No adjuvant Therapy Thyroid Cancer; 1999 Hodgkin's Disease; 1970 http://www.larry-n-lorie.com",
      "ThreadURL": "https://www.cancerforums.net/threads/702-Anyone-Been-Dx-ed-BC-in-Both-Breasts?s=1b276477decf6519c562df0329af5289",
      "Title": "Anyone Been Dx'ed BC in Both Breasts?"
    },
    {
      "AuthorID": "Lorie Brady",
      "AuthorURL": "https://www.cancerforums.net/members/123-Lorie-Brady?s=1b276477decf6519c562df0329af5289",
      "Content": "I was reading your post and wanted to send good vibes your way for the upcoming surgery. Of course you are nervous-it is a tough operation. I had bi-lateral masectomies in May 04' IDC left breast and DCIS right); immediate reconstruction (expanders) and pretty much was laid up for 5 weeks. I had 4 drains in each side (pain the you know what). Women are tough though and I am sure you will do fine. Some suggestions; I made sure you get some loose fitting men's shirts ( like pajama tops) and pretty much lived in those for weeks. My fiancee' really kept up with the drains-every four hours he stripped them which really aided in my healing. I religiously did the exercises; I had alot of muscle spasms on my left side and as much as it hurt I think it helped the healinfg process as well. Baby yourself the first few weeks, eat well and if you have a recliner use that for aehile instead of a bed. As far as chemo, my onc said the timeline is 8 weeks after the surgery. I opted for no chemo (personal decision), but I had cancer before and lost all my hair which was long, blonde..and well you get the picture. I lost it all and it was kinda odd being bald. It grew back tho--even thicker!! Big hugs to you.....Lorie",
      "MessageIndex": 1,
      "PostDate": "02/12/2004",
      "ThreadURL": "https://www.cancerforums.net/threads/279-just-needed-to-vent?s=1b276477decf6519c562df0329af5289",
      "Title": "just needed to vent..."
    }
  ]
}