{
  "AuthorID": "lwshatch",
  "AuthorURL": "https://www.cancerforums.net/members/2005-lwshatch?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "lwshatch",
    "AuthorURL": "https://www.cancerforums.net/members/2005-lwshatch?s=1b276477decf6519c562df0329af5289",
    "Content": "My mother was diagnosed with stage IV metastatic breast cancer in January, which has spread to her brain, T8 verterbae, and lungs. Her cancer is HER2neu postive, not estrogen responsive. She was orginally diagnosed three years ago, at age 68, and underwent a mastectomy of her left breast with limited lymph node removal. At that time, she underwent 6 weeks of radiation followed by 6 months of chemo at 3 week intervals. Herceptin was not used at that time. She was given a clean bill of health five months before this stage IV diagnosis. She has now lost 25-30 pounds and has completed 5 weeks of radiation to her brain, 4 weeks to her vertebrae, and is undergoing weekly chemo - Taxotere, Carboplatin, and Herceptin. After 2 easy weeks, she is now having violent reactions to the chemo, spiking fevers of 104, uncontrollable shaking, extremely low blood counts, etc. This past week, she received chemo on Friday, was scheduled for a blood transufusion on Saturday, and spiked a 104.2 fever in the middle ot the night. By the time she was taken to the hospital Saturday morning, her blood pressure was 67/40 and her temperature was 96 and dropping quicky. I am located across the country from her, although I was just there for a month prior to this weekend, and need to know if giving a transfusion after chemo is normal. And, based on what is happening, what is the real prognosis for the quality of life she has remaining? Any help will be most appreciated.",
    "MessageIndex": 0,
    "PostDate": "27/03/2006",
    "Signature": "Laura",
    "ThreadURL": "https://www.cancerforums.net/threads/2721-Stage-IV-metastic-breast-cancer?s=1b276477decf6519c562df0329af5289",
    "Title": "Stage IV metastic breast cancer"
  }]
}