{
  "AuthorID": "mac",
  "AuthorURL": "https://www.cancerforums.net/members/5556-mac?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "mac",
      "AuthorURL": "https://www.cancerforums.net/members/5556-mac?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi - thanks for your interest. I have found several other papers on the subject written by researchers who have extensive knowledge base of the subject. I have not had any other contacts with researchers on the subject. But the researchers all point to breast cancer development. Ok on the link - thanks, I'll check it out. Yes, I thought that the development to trial might be shorter given the already proven results, but the patent>agreement nogiations>FDA approval>trial can prove to be a long one. Ok on only medical professionals access to the knowledge base. I have to confess that I've logged on to some of the drug companies sites as a medical professional student. Not much there except for drug company ads, etc - you will find NO ref to future developments for the obvious reasons. I'm a firm believer in science, molecular biology. The most extensive web site I've found on the subject covers everything, from news, companies, drugs, trial info etc updated daily. http://www.genengnews.com/",
      "MessageIndex": 4,
      "PostDate": "26/04/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/4542-Cancer-reversal-using-TACE-inhibitors?s=1b276477decf6519c562df0329af5289",
      "Title": "Cancer reversal using TACE inhibitors"
    },
    {
      "AuthorID": "mac",
      "AuthorURL": "https://www.cancerforums.net/members/5556-mac?s=1b276477decf6519c562df0329af5289",
      "Content": "A new paper by Dr Mina Bissell - http://www.lbl.gov:80/Science-Articl.../LSD-TACE.html suggests that the use of TACE protease inhibitors show great promise for the treatment of breast cancer. The TACE inhibitors are currently in trial for the treatment of RA (Rheumatoid Arthritis). In her paper, she suggests that the drug environment would be well served to develope similiar drug for application to breast cancer. Her lab has a patent application on the research, and indications are that the drug environment is interested. I would like to follow this development. It shows great promise. I've followed the new drugs via FDA links, etc. I suspect that the drug environment that produces the RA treatments would be the logical choice for further development into Her2. Help if you can by followup. My interest is that I have a daughter with Her2 stage 4. Thanks - Mac",
      "MessageIndex": 0,
      "PostDate": "23/04/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/4542-Cancer-reversal-using-TACE-inhibitors?s=1b276477decf6519c562df0329af5289",
      "Title": "Cancer reversal using TACE inhibitors"
    },
    {
      "AuthorID": "mac",
      "AuthorURL": "https://www.cancerforums.net/members/5556-mac?s=1b276477decf6519c562df0329af5289",
      "Content": "Yes, very early in the development stage. Yes, I have contacted Dr. Bissell. She indicates that the drug companies are interested. Since the TACE inhibitors are already in trial for treatment of rheumatoid arthritis, I hoping the same companies are interested in development for HER2 application. And since the TACE inhibitor drugs are being used for human application, I'm hoping for some kind of a fast track thru the development/approval process, but I know this is a long shot. In a previous paper, the Dr mentioned Roche Diagnostics and Wyeth as some of the RA drug companies, but could find no further info. Thanks very much for your interest. Mac",
      "MessageIndex": 2,
      "PostDate": "24/04/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/4542-Cancer-reversal-using-TACE-inhibitors?s=1b276477decf6519c562df0329af5289",
      "Title": "Cancer reversal using TACE inhibitors"
    }
  ]
}