{
  "AuthorID": "manishsqrt",
  "AuthorURL": "https://www.cancerforums.net/members/118055-manishsqrt?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "manishsqrt",
      "AuthorURL": "https://www.cancerforums.net/members/118055-manishsqrt?s=1b276477decf6519c562df0329af5289",
      "Content": "Mammography results appear within 24 hours, i am not sure why they need a week for that. Its just a low intensity x- ray that's all. If you are not satisfied then you may consult some other pathologist.",
      "MessageIndex": 7,
      "PostDate": "21/12/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/46160-Why-do-I-have-to-wait-a-week?s=1b276477decf6519c562df0329af5289",
      "Title": "Why do I have to wait a week?"
    },
    {
      "AuthorID": "manishsqrt",
      "AuthorURL": "https://www.cancerforums.net/members/118055-manishsqrt?s=1b276477decf6519c562df0329af5289",
      "Content": "I can suggest you to come to India. You will get very affordable and best hospitals. Few to mention are Dharmshila cancer hospital in delhi, or tata memorial center in mumbai. In India you can get very good facilities in super specialty hospitals and people are getting very nice treatment also.",
      "MessageIndex": 2,
      "PostDate": "22/12/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/45793-Looking-for-cancer-hospital?s=1b276477decf6519c562df0329af5289",
      "Title": "Looking for cancer hospital"
    },
    {
      "AuthorID": "manishsqrt",
      "AuthorURL": "https://www.cancerforums.net/members/118055-manishsqrt?s=1b276477decf6519c562df0329af5289",
      "Content": "Margins, also known as \"margins of resection,\" refer to the distance between a tumor and the edge of the surrounding tissue that's removed along with it. When a tumor is removed, some tissue surrounding it is also removed. The tumor with surrounding tissue is rolled in a special ink so that the outer edges, or margins, are clearly visible under a microscope. A pathologist checks the tissue under a microscope to see if the margins are free of cancer cells. Negative margins: No cancer cells are found in the ink. Uninvolved margins and Negative margins mean similar. See this link https://www.sharecare.com/health/bre...-breast-cancer You Need not to worry.",
      "MessageIndex": 4,
      "PostDate": "21/12/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/46292-Help-understandiing-pathology-report-please?s=1b276477decf6519c562df0329af5289",
      "Title": "Help understandiing pathology report please"
    },
    {
      "AuthorID": "manishsqrt",
      "AuthorURL": "https://www.cancerforums.net/members/118055-manishsqrt?s=1b276477decf6519c562df0329af5289",
      "Content": "My mother was diagnosed with breast cancer 5 months back and and went for mastectomy of left breast. after that she went for 4 chemo cycles due to which she developed serious side effects. Doctors decided to halt chemo cycles as she seriously lacked tlc and haemoglobin. last month she developed cellulitis in her legs(she is diabetic) which was cured through antibiotics. the cellulitis is now gone but now she has severe pitting edema in both feets and complains of serious burning sensation. doctors are saying that this is due to low protein. We are well fedding her with protein from last two months but we can hardly see any improvement. Can their be any more reason behind that which docs are missing. Her albumin is 2.7gm/dl as per last week kft report.",
      "MessageIndex": 0,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://www.cancerforums.net/threads/47871-Edema-developed-after-chemo-therapy?s=1b276477decf6519c562df0329af5289",
      "Title": "Edema developed after chemo therapy."
    },
    {
      "AuthorID": "manishsqrt",
      "AuthorURL": "https://www.cancerforums.net/members/118055-manishsqrt?s=1b276477decf6519c562df0329af5289",
      "Content": "My mother had breast cancer and she got one of her breasts(left one) removed by surgery on 7 th december 2015. It was a second stage cancer, and the doctor said that she will require chemotherapy at intervals of 21 days till 6 months. The first chemo was done on the 28 december 2015 and she got some serious side effect which troubled her for around a week. Now she is fine but within the first week after chemo she got very serious constipation, piles and joint pains. Next chemo is scheduled on 18th of this month. She is afraid that the same problems may occur again. Does it really happen, does the same problem reoccur after every chemo therapy or it was just one time by chance. Someone please share their experience.",
      "MessageIndex": 0,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://www.cancerforums.net/threads/46909-Does-chemo-troubles-every-time?s=1b276477decf6519c562df0329af5289",
      "Title": "Does chemo troubles every time."
    },
    {
      "AuthorID": "manishsqrt",
      "AuthorURL": "https://www.cancerforums.net/members/118055-manishsqrt?s=1b276477decf6519c562df0329af5289",
      "Content": "I don't know how a stage 0 cancer requires mastectomy, but if the doctor advises it i would suggest you to follow her/ him. Mastectomy will make you sure that the surgery is complete, breast conserving surgeries are often risky for future. By the way do you have positron emission test ct done . if yes then the doctor must be sure that the cancer is limited to breast only. Additionally i think saving life is more better than preserving breast, don't take chance.",
      "MessageIndex": 2,
      "PostDate": "23/12/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/45843-Dcis-need-urgent-help-(did-lumpectomy)?s=1b276477decf6519c562df0329af5289",
      "Title": "Dcis - need urgent help (did lumpectomy)"
    },
    {
      "AuthorID": "manishsqrt",
      "AuthorURL": "https://www.cancerforums.net/members/118055-manishsqrt?s=1b276477decf6519c562df0329af5289",
      "Content": "I don't understand why doctor is delaying chemo even when he is saying that there was traces in lymphs. In such case chemo must start after three weeks of surgery. By the way if your aunts surgical drainage is still continuing then that many be the reason. But even then 5 weeks is quite a long gap. Don't take chances and discuss to to your oncologist.",
      "MessageIndex": 2,
      "PostDate": "21/12/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/45195-Breast-Cancer-Questions?s=1b276477decf6519c562df0329af5289",
      "Title": "Breast Cancer Questions"
    }
  ]
}