{
  "AuthorID": "melissasd50",
  "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "facingourrisk.org is another fabulous site. I am sorry for you and your mom, but believe me, between all these sights you will find courage, strength and (most importantly) knowledge from some incredibly strong, fierce women! mleissa~",
      "MessageIndex": 17,
      "PostDate": "28/01/2007",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3045-Found-out-today-that-my-mum-has-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "Found out today that my mum has breast cancer"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "facingourrisk.org is another fabulous site. I am sorry for you and your mom, but believe me, between all these sights you will find courage, strength and (most importantly) knowledge from some incredibly strong, fierce women! mleissa~",
      "MessageIndex": 7,
      "PostDate": "28/01/2007",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3045-Found-out-today-that-my-mum-has-breast-cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "Found out today that my mum has breast cancer"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "I am 49 years old (about to turn 50) with 2nd breast cancer. 5 years ago I found a lump in my right breast and was diagnosed with infiltrating lobular carcinoma, er/pr positive, her2 negative, stage I. Nothing in the lymph nodes. I had a lumpectomy and radiation. Last fall I found a lump (me, again!) in my left breast and was diagnosed with invasive lobular carcinoma, er/pr negative, her2 negative , stage III. Nothing in the lymph nodes. I have had chemotherapy, 2 lumpectomies, 1 mastectomy with an expander put in. 5 days later, a blood vessel burst in my chest and I was rushed in for emergency surgery to correct that. Unfortunately the expander began to poke through the skin at my chest bone area. This required yet another surgery to clean out the area, place cadaver skin at the thin spot and replace the expander with a smaller size. 2 weeks alter I had some more of the damaged area ?worked? on. And then I was told I needed radiation. At this point the expander area was still not healing well, so I had the expander removed to make radiation easier. I started radiation the week of 10/31. I will have to wait for my reconstructive surgery for 6 months to a year, depending on my skin condition. i have been particularly frustrated and disappointed not to have a breast. i am trying to research the gluteal donor surgery (IGAP) because i don't have much fat in my belly and am terrified of the back surgery reconstruction. (And my butt has plenty of fat to be \"rendered\". ) I am looking for information regarding this type of surgery. The pros, the cons, rebound time after surgery,etc. Can anyone help me? Thanx in advance... melissa~",
      "MessageIndex": 0,
      "PostDate": "07/11/2005",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/2230-IGAP-for-reconstructive-surgery?s=1b276477decf6519c562df0329af5289",
      "Title": "IGAP for reconstructive surgery"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "Tegan, i am sorry to hear about your mom. i have 2 daughters who have had to endore the hardship of cancer. i, too, am battling breast cancer for the 2nd time. My first was 5 years ago, while at the same time the girls lost their dad to cancer. If i can be any support to you, i would be happyto help. This is very tough on family members. Everyone copes in different ways. Just being there for your mom is the best that you can do. i am so sorry for you and your mom. You sound like a brave girl. It's okay to feel your mom is different. She is. But, so are you. The important thing is that you love and support each other. i am not sure of how old you are, but besides this website and many others, you can get a lot of support. Also, you might check in your area to see if there are any groups you can join where you live. Sometimes thatis a good thing, sometimes, not. Niether if my girls wanted to join in with groups. The way we coped was to talk, talk, talk. Feel free to email me if you want to chat. [email protected]. Good lick. Keep strong. melissa~",
      "MessageIndex": 2,
      "PostDate": "14/02/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/2462-My-mum-just-got-news-that-she-has-breast-cancer-again?s=1b276477decf6519c562df0329af5289",
      "Title": "My mum just got news that she has breast cancer again"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "i am due to have augmentation in my right breast in October, and am weighing the type of implant i want. Back when i had an expander on my left breast, my PS said he would recommind silicone because it was more natural feeling. Well many surgeries (and complications), and a new PS later, i had a DIEP on my left side. So now it is the right side we are concentrating on. When my PS asked what i would prefer, i told him silicone because i had heard it was a more \"natural\" feeling. While my PS agreed with that, he felt that because he would be putting the implant under the muscle and i have enough tissue on top, i really wouldn't feel the difference between the two types. He told me that silicone was not a problem (per say), but that i would have to be part of a study for 20 years where a team would follow me in case of changes, or problems. This is a good thing as if there were any complications they would be right on it and i wouldn't have to worry about leakage (to any extreme) or other issues that silicone could cause. However, i am wondering if this would be a hassle, and if i am just adding more anst to my lofe. Would i be constantly be wondering about the \"what if's\". Perhaps i would be better off with the saline, and not constantly be worrying. Or maybe i wouldn't be worrying because the issues and controversies of before have been debunked... i really want to have the breast that i can still have sensations feel as natural as possible. Anyone with words of wisdom - good, bad or indifferent?",
      "MessageIndex": 0,
      "PostDate": "20/08/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3435-saline-or-silicone-you-input-please?s=1b276477decf6519c562df0329af5289",
      "Title": "saline or silicone... you input, please?"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "See response to this question by flsurfkarma. Also, see that this member asnwered my question on silicone or salone with equal distaste. i am sorely dissappointed, and may not come back to this site again. This member needs to be banned!!!",
      "MessageIndex": 0,
      "PostDate": "26/08/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3461-moderator-please-see-HELP!!-I-NEED-YOU-OPINION?s=1b276477decf6519c562df0329af5289",
      "Title": "moderator, please see HELP!! I NEED YOU OPINION"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanx, Bethanny. i will post there! melissa~",
      "MessageIndex": 3,
      "PostDate": "29/08/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3435-saline-or-silicone-you-input-please?s=1b276477decf6519c562df0329af5289",
      "Title": "saline or silicone... you input, please?"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "Hard to believe this post has had almost 300 hits, but only 3 (THREE) responses...",
      "MessageIndex": 4,
      "PostDate": "13/09/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3435-saline-or-silicone-you-input-please?s=1b276477decf6519c562df0329af5289",
      "Title": "saline or silicone... you input, please?"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "I am so sorry to hear what you & your husband are going through. I lost my husband 6 years ago to cancer. He was diagnosed in May of \u009199, and died, June 2000. He was 44. His cancer was esophageal that matastized to his liver. Although the chemo and rads killed the original tumor, it was the cancer in the liver that killed him. Similar to your relative, my husband was treated with high doses of chemo and had rads. He, too, took a break in Jan. Of'00, but had more aggressive chemo in Apr. \u009100. He almost died from that, as well. His Dr even tried rads on the liver which made him very ill. In June, he was home with hospice coming in every day for a week. I think he lasted about 10 days. He was very jaundiced at the end, but that was the liver. My suggestion to you would be to talk with Hospice. They will give you the signs to look for - the extremities becoming cold, etc. My husband was really out of it for about 5 days (I'd find him in the bathroom, crouched on the tub, cleaning the cabinet below the sink - he had always been kind of a neat freak, but...). He went into a coma about 2 days before he died, although interestingly enough, he \"woke\" briefly about 6 hours before he died, when our daughters (aged 16 & 10) came in to kiss him goodbye, and told them he loved them. He went peacefully (with the help of morphine), but happily with his family all around him. I am glad he could be at home. It was what he wanted. My heart goes out to you. It is a very difficult time, and i would be happy to share any thoughts or concerns with you. You may email me at [email protected]. melissa~",
      "MessageIndex": 1,
      "PostDate": "01/09/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3486-dying-from-cancer-what-should-we-expect?s=1b276477decf6519c562df0329af5289",
      "Title": "dying from cancer - what should we expect?"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "Surely, there are some of you who have had implants & can give me an oponion...",
      "MessageIndex": 1,
      "PostDate": "28/08/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3435-saline-or-silicone-you-input-please?s=1b276477decf6519c562df0329af5289",
      "Title": "saline or silicone... you input, please?"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "i posted a question about silicone or daline for augmentation and was very disappointed to recieve only one response. This is the quote: i've been to plenty of strip clubs and prefer silicone to saline..... in for the pics. EXCUSE ME??!!!??? i was frustrated that no one responded (unlike 3 other websites). But this was a response. Forget this website.",
      "MessageIndex": 0,
      "PostDate": "25/08/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3450-Members-PLEASE-read-response-to-about-sikicone-ir-saline?s=1b276477decf6519c562df0329af5289",
      "Title": "Members, PLEASE read response to ? about sikicone ir saline."
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "Did you remove the response on Zometa, aredia & fosonex..., IBC? Maybe..., i had my breasts removed & saline or silicone? This person responded to those as well. Again, many thanks for your swift responce. Much appreciated!",
      "MessageIndex": 3,
      "PostDate": "26/08/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3450-Members-PLEASE-read-response-to-about-sikicone-ir-saline?s=1b276477decf6519c562df0329af5289",
      "Title": "Members, PLEASE read response to ? about sikicone ir saline."
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "never mind, i see that you did!",
      "MessageIndex": 4,
      "PostDate": "26/08/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3450-Members-PLEASE-read-response-to-about-sikicone-ir-saline?s=1b276477decf6519c562df0329af5289",
      "Title": "Members, PLEASE read response to ? about sikicone ir saline."
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "I am 50 years old with 2nd breast cancer. 5 years ago I found a lump in my right breast and was diagnosed with infiltrating lobular carcinoma, er/pr positive, her2 negative, stage I. Nothing in the lymph nodes. I had a lumpectomy and radiation. In the fall of 2004, I found a lump (me, again!) in my left breast and was diagnosed with invasive lobular carcinoma, er/pr negative, her2 negative , stage III. Nothing in the lymph nodes. I have had chemotherapy, 2 lumpectomies, 1 mastectomy with an expander put in. 5 days later, a blood vessel burst in my chest and I was rushed in for emergency surgery to correct that. I was miserable with my expander. It hurt, I couldn't sleep. I was in constant pain, and then the expander began to poke through the skin at my chest bone area. This required yet another surgery to clean out the area, place aloderm at the thin spot and replace the expander with a smaller size. (After my PS - or should I say my BSPS - told me that expanders only came in one size.) A month later I had some more of the damaged area \"worked\" on. And then I was told I needed radiation. At this point the expander area was still not healing well and my PS told me that he would not fill the expander until after my rads were over (yikes, 6 weeks or more of the pain with no gain?!) - so I had the expander removed to make radiation easier. During radiation, I spent hours doing research on reconstruction. That is how I discovered the GAPs and DIEP reconstruction. I emailed NOLA to ask if there were any surgeons who did these types of procedures in the area where I lived. To my amazement, they called me the next day and refered me to my (now) PS! In June \u009106 I had a DIEP. My surgery was unbelievable - my recovery amazing! I was given permission to walk my dog, drive my car (& have sex - yippee!) only 4 days after coming home from the hospital. I never felt so well in the past 2 years, as I did after this surgery. I just completed Stage II on Oct. 26th (revisions to my reconstructed breast, touch up at drain sites, & lipo in stomach and hip area and augmentation to my right breast -lift and implant). While I haven't seen the total package, due to a little bandaging, I am confident that the girls will be looking pretty darn good! (The reveal will be Friday when I meet with my PS.) Sorry about the long-winded profile. I am so glad I did the DIEP and really wished that I hadn't had to endure the first round of reconstruction. However, the most important thing you can do is to take control of your destiny and make your own decisions. Just what you have begun to do here. With the information you gleen from this forum, other forums and countless knowledgeable women, you will take empower yourself and be confident in your decisions. Best of luck to you. Knowledge is power.",
      "MessageIndex": 1,
      "PostDate": "01/11/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3746-Breast-Reconstruction?s=1b276477decf6519c562df0329af5289",
      "Title": "Breast Reconstruction"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "I am 50 years old with 2nd breast cancer. 5 years ago I found a lump in my right breast and was diagnosed with infiltrating lobular carcinoma, er/pr positive, her2 negative, stage I. Nothing in the lymph nodes. I had a lumpectomy and radiation. In the fall 0f 2004, I found a lump (me, again!) in my left breast and was diagnosed with invasive lobular carcinoma, er/pr negative, her2 negative , stage III. Nothing in the lymph nodes. I have had chemotherapy, 2 lumpectomies, 1 mastectomy with an expander put in. 5 days later, a blood vessel burst in my chest and I was rushed in for emergency surgery to correct that. Unfortunately the expander began to poke through the skin at my chest bone area. This required yet another surgery to clean out the area, place cadaver skin at the thin spot and replace the expander with a smaller size. 2 weeks alter I had some more of the damaged area \"worked\" on. And then I was told I needed radiation. At this point the expander area was still not healing well, so I had the expander removed to make radiation easier. I started radiation the week of 10/31, finished the 2nd week in Dec.. i am currently scheduled for a DIEP procedure in June, but have one concern - i dodn't have a skin spairing mastectomy, so how does the skin stretch to provide for a new breast? Will i have to have a skin graft? i was a smal B and want to go to a C. According to my ps, it can be done. But how?? There is some 'flabby\" skin (how ugly) under my arm pot. Will this give enough skin to accept the DIEP. Thanx, in advance...",
      "MessageIndex": 0,
      "PostDate": "06/03/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/2609-DIEP-after-failed-expander?s=1b276477decf6519c562df0329af5289",
      "Title": "DIEP after failed expander"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "My 22 year old daughter refers to my hot flashes as POWER SURGES! Makes you feel kinda special, eh?!!? Thought a moment of humor might be needed...",
      "MessageIndex": 2,
      "PostDate": "23/10/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3691-Hot-flashes-menopause?s=1b276477decf6519c562df0329af5289",
      "Title": "Hot flashes/menopause"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "- Age: 50 - Age of diagnosis since diagnosis at first cancer: 44 - second cancer 49 - menopausal - Specific type of cancers: infiltrating lobular 5 yrs ago, rt breast -invasive lobular left breast - Estrogen and progesterone receptor status: negative, her2neu : negative. - Stage at diagnosis: III (?) - Treatments: surgery: limpectomy, rt breast - 2 lumps & 1 mastectomy with expander for left breast (expander failed and has been removed), chemotherapy: none for rt breast - ac & something 1st treatment, taxol 2nd treatment for left breast, radiation: 25 sessions for both breasts. i was wondering if anyone tried maternity tops after surgery. i remember having a heck of a time with my drains after my mastectomy & expander. i thought that maybe the extra \"girth\" at the bottom of maternity tops might accomodate those rotten drains? Any thoughts? thanx, melissa~",
      "MessageIndex": 0,
      "PostDate": "07/02/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/2502-clothing-for-after-DIEP?s=1b276477decf6519c562df0329af5289",
      "Title": "clothing for after DIEP"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "Although I did finally find a lump, believe it or not, my first symptom (for 2nd breast cancer - both found mysekf) was a very itchy breast! I have heard other women mention this, too...",
      "MessageIndex": 2,
      "PostDate": "19/12/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3934-symptoms?s=1b276477decf6519c562df0329af5289",
      "Title": "symptoms"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "i am currently scheduled for DIEP surgery, but saw a posting on alloderm. What is alloderm? Is it a procedure unto itself, or is it in addition to other surgeries? Can one have it post mastectomy? i had an expander (which ultimately failed). i had it removed when i was told that i would need radiation. Would i be eligible for this, or am i best to stick with DIEP (assuming this is another type of reconstruction not an \"additive\" to an wexostong procedure).",
      "MessageIndex": 0,
      "PostDate": "22/02/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/2557-what-is-an-alloderm-procedure?s=1b276477decf6519c562df0329af5289",
      "Title": "what is an alloderm procedure"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "You are certainly not alone. Although I am 50 now, my first bout with breast cancer was at 44. While sitting in my PS waiting room two weeks ago, I noted that 3 out of the 5 women there were in their early 30's. There is a good website called youngsurvival.org. While there are women of all ages that go there, I think you will find a good majority of the women are around you age. Good luck. melissa~",
      "MessageIndex": 1,
      "PostDate": "01/11/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/3745-How-many-out-there-are-around-my-age?s=1b276477decf6519c562df0329af5289",
      "Title": "How many out there are around my age?"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "had infiltrating lobular cancer, stage 1, no nodes, er/pr positive, hrt negative, in my right breast in 2000. I had a lumpectomy and radiation for the cancer. In 2004, found a lump (again) in my left breast: invasive lobular, stage 3 (?), no nodes, er/pr negative, hrt negative. Have had 2 lumpectomies, mastectomy w/expander, problems with expander, had it removed, ending with radiation. Am due for DIEP on June. My question is that I have been having this sensation of pulling, almost bruising feeling in the nipple area of my \"good\" breast. When I met with my oncologist for a check up, I mentioned this. He did not feel anything abnormal, but I can't get past the feeling that something is not right. Has anyone else experienced this feeling, and did it become cancerous? (i did schedule a mamogram for tomorrow. Hope it's \"all in my head.\"",
      "MessageIndex": 0,
      "PostDate": "04/04/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/2762-chance-of-lobular-cancer-returning-for-3rd-time?s=1b276477decf6519c562df0329af5289",
      "Title": "chance of lobular cancer returning for 3rd time?"
    },
    {
      "AuthorID": "melissasd50",
      "AuthorURL": "https://www.cancerforums.net/members/1375-melissasd50?s=1b276477decf6519c562df0329af5289",
      "Content": "i was on Tamoxifen for 51/2 years, then i found a lump in my other breast . It controled the inifltrating lobukar, but didn't help to stop invasive lobular...",
      "MessageIndex": 4,
      "PostDate": "01/09/2006",
      "Signature": "m~",
      "ThreadURL": "https://www.cancerforums.net/threads/3304-Is-Tamoxifen-Effective-In-Curing-Breast-Cancer?s=1b276477decf6519c562df0329af5289",
      "Title": "Is Tamoxifen Effective In Curing Breast Cancer?"
    }
  ]
}