{
  "AuthorID": "MiaNC",
  "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I appreciate your input and your sharing your experience. I am also a swimmer and I have not been in a pool since the summer of 04 because of all this. I miss doing laps and just relaxing while doing so. Feeling and looking normal is also important to my quality of life. And I also strongly dislike the prosthesis, they are heavy and quite hot in the summer. I am scheduled for surgery in two months. The surgeon will do a pedicle TRAM with a second operation 4 months later to put implants. I simply cannot get around this because I am not large enough, or my belly is not large enough, for him to make two breasts. I am hoping and praying that all goes well. Thank you and good luck with your reconstruction! MiaNC",
      "MessageIndex": 4,
      "PostDate": "21/04/2006",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/2786-Need-some-advice-on-reconstruction-and-survival?s=1b276477decf6519c562df0329af5289",
      "Title": "Need some advice on reconstruction and survival"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "There is no question that if you live in the Northeast you should research Memorial Sloan Kettering in NYC (my hometown), Dana Faber in Boston and UPenn. I sent emails with questions upon my diagnosis and not only had email answers but one chief in MSK actually called me home. Best of luck MiaNC Breast Ca IIA just finished cemo and RT",
      "MessageIndex": 7,
      "PostDate": "27/08/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1355-info-and-opinions-about-Cancer-Tx-Centers-of-America?s=1b276477decf6519c562df0329af5289",
      "Title": "info and opinions about Cancer Tx Centers of America"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "You are right, I like to hear all sides of the issue and you have a right to your opinion. I opted to have bilateral mastectomies, with one being prophylactic, because I could have the chance of reconstruction and because I have two small children and just wanted to have all out. Nothing is a guarantee as you saw yourself, but I am happy with that decision. I am considering all options still since I have time, all the chemo and radiation are over. Many thanks! MiaNC",
      "MessageIndex": 2,
      "PostDate": "10/04/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/2786-Need-some-advice-on-reconstruction-and-survival?s=1b276477decf6519c562df0329af5289",
      "Title": "Need some advice on reconstruction and survival"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I am now 50. Had dx invasive ductal ca 12/04. Had bilat mastectomies, skin-sparing, 2 sentinel nodes were positive, 21 axillary were negative. The tumor was 1 cm, ER+,PR+, HER/Neu neg. Had dose-dense chemo A/C x 4 and Taxol x 4. Then radiation x 6 weeks. Initially I had expanders but one had to be removed after two further surgeries for hematomas and seromas (a mess). The time has come to decide the reconstruction. One surgeon said I could just have silicone implants or TRAM flaps with skin graft on the radiated site. Another surgeon said TRAM flas but with silicone implants. After the disaster with teh expanders I would like to avoid anything \"not mine\" in there. I would appreciate any suggestions, advice, anything. And also, is it worth it by now? I keep reading women with Stage II like me with recurrences and others with more advanced stages with no recurrences..it's confusing and seems as it is the luck of the draw... Yhank you MiaNC",
      "MessageIndex": 0,
      "PostDate": "09/04/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/2786-Need-some-advice-on-reconstruction-and-survival?s=1b276477decf6519c562df0329af5289",
      "Title": "Need some advice on reconstruction and survival"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I am currently on Taxol #3/4 and yes, about day 3 after treatment at exactly 2PM the pains in hips, knees, behind and feet start. All I do is go to bed with 2 Motrins and 1 Lortab. The bedrest helps a lot. I also started to take Vitamin B6 200 mg per day before starting Taxol, and I drink Tonic water because it ahs some quinine in it. Imust say that the pains start to subside by the latter part of the next day and are gone by the fifth day after treatment. And I have not ahd any neuropathy (tingling, numbness of feet and hands). I find this to be bearable especially if it is the weekend. Good luck and I am absolutely certain that this is well worth it for all of us, esp in light of the announcements today in the Lancet about chemo after surgery and its success even with the old regimens. MiaNC 49 y/0 Stage 2A, 1 cm tumor, HER/neu neg, E+, P+ 2 sentinel nodes positive, 21 axillary nodes negative A/C x 4 Taxol 3/4 Bone Scan neg I refuse any radiotherapy - terrified of it!",
      "MessageIndex": 5,
      "PostDate": "14/05/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/713-Taxotere-Joint-Pain?s=1b276477decf6519c562df0329af5289",
      "Title": "Taxotere Joint Pain"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, Iam approaching the first anniversary of my abnormal mammogram. I have now survived the bilateral amstectomies, chemotherapy, radiation, complications galore and now I am on Arimidex. My hair is growing back and quite curly, but I have terrible dryness in my genitals, headaches and insomnia. But no hot flashes. My reconstruction will be next year. Any advice, suggestions ? I have to take this pill for 5 years and would like to find a way to resolve these issues. Regardless I will continue the pills...my life depends on this. Thank you! MiaNC",
      "MessageIndex": 0,
      "PostDate": "07/11/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/2225-Arimidex-and-side-effects?s=1b276477decf6519c562df0329af5289",
      "Title": "Arimidex and side effects"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Two years ago I was dx with Stage IIA breast ca, E+, P+, HER/neu neg, 1 cm, 2 sentinel nodes positive but no axillary nodes affected. Had bilateral mastectomies, ACT dose-dense and radiation after. A year later had reconstruction. It's been 2 yrs since the end of all treatments. Had avery itchy rash last Aug and a culture was positive for herpes zoster aka shingles. By the time the results came in the are was crusted so I did not take meds. Now, again I saw a red and itchy rash and the dermatologist did a biopsy but advised me to start Valtrex. I am very concerned although noone else is. I am being told that this can happen even years after chemo. My fear is that I am still immunosuppressed. My white blood cell count is still low at 3.1 with neutrophils at 1.6.; my platelets are normal and I have mils anemia which responds to iron pills. I would be very interested to find out if there are any similar experiences out there just to have some comg=fort. Every time something small happens I panic. But I am 50 and have two still small children... Thank you from te bottom of my heart MiaNC",
      "MessageIndex": 0,
      "PostDate": "11/11/2007",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/5630-Shingles-after-Breast-Cancer-tx?s=1b276477decf6519c562df0329af5289",
      "Title": "Shingles after Breast Cancer tx"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, I am now after my #3 Taxol out of 4 so I am almost done. I just had a call from the oncologist. Apparently my tumor marker was up again to 63, they want less than 38. I stopped the Prozac thinking that it could be upping the levels since Paxil can do that. I have been between 44 and 63 since before the chemo started. My bone scan was negative. I have no symptoms except the side effects of the Taxol which go away after a few days. I don't want to get all upset once again but I wonder if you have any words of wisdom... Thanks you!!! Mia NC 49 y/o Stage IIA, 1.1 cm node, 2 sentinel nodes positive 21 axillary negative nodes, E+, P mildly +, HER/neu negative A/C x 4 Neulasta Taxol 3/4 so far I will not agree to radiation, too scared!",
      "MessageIndex": 0,
      "PostDate": "16/05/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1108-Need-some-advice-on-Tumor-markers?s=1b276477decf6519c562df0329af5289",
      "Title": "Need some advice on Tumor markers"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "After finishing chemo my onc wants me to see a radiation oncologist to ascertain the need for radiatiopn in my case, esp because I am not totally convinced that it is needed after bilateral mastectomies. I have asked at Memorial Sloan Kettering, Cleveland Clinic and UPenn (I have friends in those places) and the answer has been no. I would appreciate knowing what questions to have ready so I can make a good decision. Also, the plastic surgeon told me that rads usually make implant surgery much harder. Many thanks MiaNC Stage IIA, 1 cm tumor, E+, P+, HER/neu - 2 sentinel nodes positive, 21 axillary nodes negative s/p bilateral mastectomies s/p dose dense A/C x 4, Taxol x 4",
      "MessageIndex": 0,
      "PostDate": "06/06/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1224-What-should-I-ask-radiation-oncologist-tomorrow?s=1b276477decf6519c562df0329af5289",
      "Title": "What should I ask radiation oncologist tomorrow?"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, today it is a year since my first chemo. On Arimidex since 9/05 with only insomnia as side effect and some weight gain despite exercise.. I have always had a sensation of fullness in my right side which is the site of the ca (had bilat mastectomies). I don't have an expander there bec I developed an infection earlier on. Reconstruction postponed til later this year. At the beginning I had lots of pins and needles sensation in the area of surgery. That resolved but every now and then I feel a burning sensation, and some minor pain in the area. Saw the onc and he said it was normal to have funny feelings there. My tumor markers which were elevated during chemo returned to normal after chemo and RT. Don't really know the importance of this. He is repeating a CT of chest and abdomen because acc to him there were some \"nodularities\"in the right mastectomy site and the radiologist had recommended a repeat scan in 6 months. Now, this makes little sense to me, if it is so abnormal why wait 6 months. I would appreciate any input from other survivors who may have ahd the same experience. I feel fine. Many thanks MisNC 50, Stage IIa IDC, 2 sentinel nodes pos, 21 axillary nodes negative, tumor was 1.1 cm, DCIS also found, Er+,P mildly +, HER -. Had bilat mastectomies, dose-dense chemo, RT Two young children!",
      "MessageIndex": 0,
      "PostDate": "26/01/2006",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/2440-One-year-since-chemo-always-feel-fullness-in-mast-site?s=1b276477decf6519c562df0329af5289",
      "Title": "One year since chemo, always feel fullness in mast site"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I think that diet and exercise are paramount. I have always been a jogger, walker, swimmer and love Jazzercise. Swimming is out for the moment. But I started back at the treadmill 2 weeks after the last chemo. I have never been a fan of fast food, except once in a while pizza. Don't eat any red meat (too much colon ca in the family) but lots of veggies and fruits and water. As far as vitamins I take a women multivit, 2 Caltrates, Vit B complex, Folic Acid, Vit C 2 g, B6 trying to get rid of the Taxol-neuropathy, and iron. ANy other suggestions? Antioxidant teas I bought also. I would have hoped that all of that could have helped but I will not change that now. I can only pray and continue as I always have. Thank you and it is always nice to find \"sisters\" everywhere! Fondly Mia NC",
      "MessageIndex": 3,
      "PostDate": "29/08/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1901-Thank-you-for-answers-to-my-post-on-quot-after-treatment-qu?s=1b276477decf6519c562df0329af5289",
      "Title": "Thank you for answers to my post on \"after treatment&qu"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Cannot thank you enough for the answers I received last week. I am finding this time after chemo and RT very, very hard. I was at ease, in a way, while receiving treatments. But now that I am looking at a pill a day for 5 years it seems so little that I literally panicked. I keep thinking that 8 chemos is not enough, that 3 times I had to get the chemo after 3 weeks and not 2 weeks because of unforeseen complications, etc etc. You name it and I have thought of it. I had this bad sinusitis and bronchitis and took antibiotics til last Tuesday. What do you know I started back with sore throuat and cough and phlegm again yesterday. Had the CT Scan but do not know results til Monday. I have a feeling that I need more than 10 days of antib now. Anyway, thank you!!!!!!!!!!!!!!!!! MiaNC Breast Ca Stage IIA, 1.1 cm, 2 sentinel nodes pos, 21 axillary neg, E+,P+, HER/neu neg, s/p dose dense A/C x 4 and Taxol x4, s/p RT 33 rads. Had bilat mastectomies, reconstruction planned for later on.",
      "MessageIndex": 0,
      "PostDate": "27/08/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1901-Thank-you-for-answers-to-my-post-on-quot-after-treatment-qu?s=1b276477decf6519c562df0329af5289",
      "Title": "Thank you for answers to my post on \"after treatment&qu"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I cannot add any more to the first very comprehensive post, esp bec I have not finished with Taxol yet. I got some excellent nausea med called EMEND. I literally had no nausea, no queaziness, no vomiting. The fatigue of course was there for days 3 and 4 after AC. After the Tazol it was day 4 and 5. I also took Vitamin B6 and Tonic water in case of neuropathy, none so far. I drink a ton of fluids. The only liquid I can tolerate is boiling water with some dried SunMaid fruits that I get at the supermarket. It comes out not too sweet and not just watery taste. It keeps me going. SOmetimes I add some OJ with pulp really cold. Hope this helps MiaNC 49 Stage IIA, 1 cm tumor 2 sentinel nodes positive, 22 axillary negatives E+ P+ Her.neu negative",
      "MessageIndex": 3,
      "PostDate": "22/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/900-AC-Taxol-questions?s=1b276477decf6519c562df0329af5289",
      "Title": "AC Taxol questions"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I cannot add any more to the first very comprehensive post, esp bec I have not finished with Taxol yet. I got some excellent nausea med called EMEND. I literally had no nausea, no queaziness, no vomiting. The fatigue of course was there for days 3 and 4 after AC. After the Tazol it was day 4 and 5. I also took Vitamin B6 and Tonic water in case of neuropathy, none so far. I drink a ton of fluids. The only liquid I can tolerate is boiling water with some dried SunMaid fruits that I get at the supermarket. It comes out not too sweet and not just watery taste. It keeps me going. SOmetimes I add some OJ with pulp really cold. Hope this helps MiaNC 49 Stage IIA, 1 cm tumor 2 sentinel nodes positive, 22 axillary negatives E+ P+ Her.neu negative",
      "MessageIndex": 13,
      "PostDate": "22/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/900-AC-Taxol-questions?s=1b276477decf6519c562df0329af5289",
      "Title": "AC Taxol questions"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks Linda. I am pretty certain that this marker does not mean mets at this time, it may just be my normal. I am scheduled for a body CT tomorrow. I think it's OK to at least have a baseline. I had a double mastectomy and now chemo. I have consulted several big centers and if one has 4 or more nodes with cancer then radiation is recommended. With 2 sentinel nodes noone seems to know, it can go either way but they cannot be sure of the advantage. I am just fearful of it more than of any chemo and if I don't have to have it I won't. The chemo and the subsequent Arimidex treatment should get those nasty cells away. The oncologist also is not too keen on RT but will send me for an official consult with the radiation oncologist. MiaNC 49y/o, s/p double mastectomies Stage IIA, 1.1 cm tumor, E+, P+, HER/neu- 2 sentinel nodes + 21 axillary nodes negative bone scan neg A/C x 4 Taxol #3/4",
      "MessageIndex": 2,
      "PostDate": "17/05/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1108-Need-some-advice-on-Tumor-markers?s=1b276477decf6519c562df0329af5289",
      "Title": "Need some advice on Tumor markers"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I am 49 y/o and have Stage IIA breast Ca diagnosed 12/04 with a routine yearly mammogram. Had bilat mastectomies 1/05. Results: 1 cm, E+, P+, 2 sentinel nodes +, 22 axillary nodes negative, HER/neu negative. Started dose-dense cehmo with A/C 1/26. On second dose had fever and cellulitis around expander, so was cancelled, hospitalized anf given antibiotics, all cultures negative. Had 2nd dose and it was changed to FEC. I went for second opinions and was told to stick to dose dense. Well, after FEC I had to wait 21 days for the second dose-dense (which really would be the third total dose of chemo). Had 2 more A/c every two weeks with Neulasta and EPO support. Normal ECHO after A/C. Had Taxol #1 on 4/6 and was told not to do Neulasta because my WBC was 8.8 with ANC 7.9. A week after Taxol my WBC was 2.5 with ANC 1.69. Went for Taxol #2 but was postponed bec WBC was 1.0 and ANC 0.56 (monocytes 0.14). At this point I am not sure that bI ever really received dose-dense chemo and it does upset me some as it may lead to a lower response rate and cure rate. Also, the oncologist told me that my initial CA 27-29 was in the upper levels of normal. I went to 40, then 52 and then back to 44. He repeated it today and wants to do a bone scan if it goes up again. I have been on Prozac 40 mg since the diagnosis of ca in 12/04. I also take MVI, Calcium, Bcomplex, Folic Acid (hx of colon ca in family), B6, Coumadin and Sonata. I would appreciate some advice, opinions and suggestions as I am quite concerned. Many thanks Mia NC",
      "MessageIndex": 0,
      "PostDate": "20/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/881-CA-27-29?s=1b276477decf6519c562df0329af5289",
      "Title": "CA 27-29"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you for the replies. The new marker was 47 and they want less than 37, so I will be getting a bone scan. I am pretty scared. He did tell me to wean myself off the Prozac because I asked him if it could be contributing to the levels. It is easier said than done because it does help me cope. I may need a different type. No, I didn't have any bone scans or CT scans. I was puzzled but I called a friend t Memorial Sloan Kettering in New York and she told me that they also don't do them in early stages. I can't help but think about the cases discovered because of distant mets but not because of breast massses... I will follow the recommendations and take it from there. It's all very frightening. Thanks for the support and help MiaNC",
      "MessageIndex": 3,
      "PostDate": "21/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/881-CA-27-29?s=1b276477decf6519c562df0329af5289",
      "Title": "CA 27-29"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I really, trully appreciate your help because I don't know where to turn. I am angry and upset because I had the silly Neulasta shot in my refrigerator two weeks ago and believed them when they said that most patients (over 80%) don't need it. But a week later my counts were much lower, red flag as far as I am concerned. And now there is nothing we can do. I accepted the dose dense convinced that everything would be done to preserve the every two week treatments. I have two small children and I will do whatever it takes to be alive, no matter what the effects, fatigue, bone pain I don't care. They wanted to save me from more bone pain and from another shot. But I am not sure this is what Memorial Sloan Kettering had in mind with dose-dense. They are pretty aggressive. I am seriously thinking of changing doctors but I wanted to dothis after the chemo and not make hasty decisions during it. Nothing I can do about this episode now. What do you think? MiaNC",
      "MessageIndex": 17,
      "PostDate": "22/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/881-CA-27-29?s=1b276477decf6519c562df0329af5289",
      "Title": "CA 27-29"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Today was my second treatment. They last a very suprising 10 minutes as it only involves the chest wall, no axilla. I feel a bit under the weather as when one is incubating a cold or something. I also have some chest pai n over the right side of the chest which is where they are irradiating. Just wondering if this is normal and what experiences you gals had with XRT. I am still working part time. MiaNC 49, 1.1 cm tumor, invasive ductal ca rt breat, DCIS, E+, P+, HER/neu -, 2 sentinel nodes +, 21 axillary nodes negative. s/p AC x 4, Taxol X 4 dose dense. Had bilat mastectomies",
      "MessageIndex": 0,
      "PostDate": "08/07/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1510-I-have-a-mild-chest-pain-after-2-RT-Is-this-OK?s=1b276477decf6519c562df0329af5289",
      "Title": "I have a mild chest pain after 2 RT. Is this OK?"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you Nancy and Leo. I am devastated today because I went for Taxol #2 and my WBC was 1.2 but my ANC dropped to 0.2. Now I am on Levaquin for protection against infections. I am also puzzled because after the first Taxol, which is not supposed to drop your white counts, I was told not to do Neulasta (my WBC was 8.8 and my ANC was 7). A week later they had plummeted to WBC 2.5 and ANC 1.7 I asked about Neupogen but they thought I would recover by myself. Well, it is obvious I didn't. Now they tell me that Neupogen is contraindicated and I have to wait til the BM recovers by itself. So, I am truly upset bec supposedly this is dose-dense and it should be given every two weeks. This is the second time I have had to go to the third week. What will this do to my chances of response and cure? I am crying as I write this. I have two small children 3 and 9...sorry Any reassuring thoughts, besides all you have given me? MiaNC",
      "MessageIndex": 5,
      "PostDate": "22/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/881-CA-27-29?s=1b276477decf6519c562df0329af5289",
      "Title": "CA 27-29"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I really, trully appreciate your help because I don't know where to turn. I am angry and upset because I had the silly Neulasta shot in my refrigerator two weeks ago and believed them when they said that most patients (over 80%) don't need it. But a week later my counts were much lower, red flag as far as I am concerned. And now there is nothing we can do. I accepted the dose dense convinced that everything would be done to preserve the every two week treatments. I have two small children and I will do whatever it takes to be alive, no matter what the effects, fatigue, bone pain I don't care. They wanted to save me from more bone pain and from another shot. But I am not sure this is what Memorial Sloan Kettering had in mind with dose-dense. They are pretty aggressive. I am seriously thinking of changing doctors but I wanted to dothis after the chemo and not make hasty decisions during it. Nothing I can do about this episode now. What do you think? MiaNC",
      "MessageIndex": 7,
      "PostDate": "22/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/881-CA-27-29?s=1b276477decf6519c562df0329af5289",
      "Title": "CA 27-29"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I am 49 y/o and have Stage IIA breast Ca diagnosed 12/04 with a routine yearly mammogram. Had bilat mastectomies 1/05. Results: 1 cm, E+, P+, 2 sentinel nodes +, 22 axillary nodes negative, HER/neu negative. Started dose-dense cehmo with A/C 1/26. On second dose had fever and cellulitis around expander, so was cancelled, hospitalized anf given antibiotics, all cultures negative. Had 2nd dose and it was changed to FEC. I went for second opinions and was told to stick to dose dense. Well, after FEC I had to wait 21 days for the second dose-dense (which really would be the third total dose of chemo). Had 2 more A/c every two weeks with Neulasta and EPO support. Normal ECHO after A/C. Had Taxol #1 on 4/6 and was told not to do Neulasta because my WBC was 8.8 with ANC 7.9. A week after Taxol my WBC was 2.5 with ANC 1.69. Went for Taxol #2 but was postponed bec WBC was 1.0 and ANC 0.56 (monocytes 0.14). At this point I am not sure that bI ever really received dose-dense chemo and it does upset me some as it may lead to a lower response rate and cure rate. Also, the oncologist told me that my initial CA 27-29 was in the upper levels of normal. I went to 40, then 52 and then back to 44. He repeated it today and wants to do a bone scan if it goes up again. I have been on Prozac 40 mg since the diagnosis of ca in 12/04. I also take MVI, Calcium, Bcomplex, Folic Acid (hx of colon ca in family), B6, Coumadin and Sonata. I would appreciate some advice, opinions and suggestions as I am quite concerned. Many thanks Mia NC",
      "MessageIndex": 10,
      "PostDate": "20/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/881-CA-27-29?s=1b276477decf6519c562df0329af5289",
      "Title": "CA 27-29"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you Nancy and Leo. I am devastated today because I went for Taxol #2 and my WBC was 1.2 but my ANC dropped to 0.2. Now I am on Levaquin for protection against infections. I am also puzzled because after the first Taxol, which is not supposed to drop your white counts, I was told not to do Neulasta (my WBC was 8.8 and my ANC was 7). A week later they had plummeted to WBC 2.5 and ANC 1.7 I asked about Neupogen but they thought I would recover by myself. Well, it is obvious I didn't. Now they tell me that Neupogen is contraindicated and I have to wait til the BM recovers by itself. So, I am truly upset bec supposedly this is dose-dense and it should be given every two weeks. This is the second time I have had to go to the third week. What will this do to my chances of response and cure? I am crying as I write this. I have two small children 3 and 9...sorry Any reassuring thoughts, besides all you have given me? MiaNC",
      "MessageIndex": 15,
      "PostDate": "22/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/881-CA-27-29?s=1b276477decf6519c562df0329af5289",
      "Title": "CA 27-29"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Hello ladies, well I ambeginning to feel that you are all correct. These markers may have too many false positives but also I am glad that these scans are done so I can feel safe in knowing I am still Stage IIA. My total body scan showed some lesions in the liver and in the pubic bone. I got this call this morning at work! Had to run for a PET Scan in the afternoon. I was amazed at the technology! The tech who has been doing nuclear medicine for 30 years showed me the pictures in the computer and felt that tehre was absolutely nothing in the liver or the bones (my bone scan was negative 2 weeks ago). The \"official\"reading is for tomorrow. I am somewhat relieved but I fear he will call me tomorrow and suggest a CT of the head! That is indeed the only place I have not been scanned! LOL MiaNC 49, St IIA (still), 1.1 cm tumor, E+, P+, HER/neu - 2 sentinel nodes positive, 21 axillary neg AC X 4, Taxol #3/4 reconstruction for later (had infection in expander and had to be taken out)",
      "MessageIndex": 0,
      "PostDate": "20/05/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1121-Well-I-have-been-scanned-up-and-down-due-to-my-tumor-marker?s=1b276477decf6519c562df0329af5289",
      "Title": "Well, I have been scanned up and down due to my tumor marker"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you for the replies. The new marker was 47 and they want less than 37, so I will be getting a bone scan. I am pretty scared. He did tell me to wean myself off the Prozac because I asked him if it could be contributing to the levels. It is easier said than done because it does help me cope. I may need a different type. No, I didn't have any bone scans or CT scans. I was puzzled but I called a friend t Memorial Sloan Kettering in New York and she told me that they also don't do them in early stages. I can't help but think about the cases discovered because of distant mets but not because of breast massses... I will follow the recommendations and take it from there. It's all very frightening. Thanks for the support and help MiaNC",
      "MessageIndex": 13,
      "PostDate": "21/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/881-CA-27-29?s=1b276477decf6519c562df0329af5289",
      "Title": "CA 27-29"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, got the last Taxol last Wednesday. I was so happy but a bit disappointed because the doctor told me that he was \"cautiously optimistic\"given my stupid markers being still up around 60. Bone scans, CT scans and PET scan were all negative. Don't know, maybe they never tell us we are cancer free and maybe that is what I wanted to hear... Now I have to go for a radiation oncology consult in a week... still terrified of RT, guys. When do you start Arimidex? I thought it would be right after chemo finished. I started to cry today because I just can't feel cured or done, I still feel scared that I might not see my babies grow...Maybe it's all normal. I could use some words of comfort! MiaNC 49 y/o, 1.1 cm tumor, Stage IIA 2 sentinel nodes positive, 22 axillary nodes negative E+, P+, HER/neu negative AC x 4 Taxol x 4",
      "MessageIndex": 0,
      "PostDate": "27/05/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1168-Finished-Chemo!?s=1b276477decf6519c562df0329af5289",
      "Title": "Finished Chemo!"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, I went for the RT consult today. The Dr. told me that given the stage IIA and the size of the tumor I would not need RT. BUT, there was deep soft tissue surgical margin tumor involvement and focal lymphatic spread of the tumor> Therefore, there was a 20% chance of local recurrence which would decrease to less than 5% with radiation. Now I don't know what to do since they have left the decision mostly up to me. I have two small kids so I want to make the best decision for the longest survival (I know we don;t live forever). Any opinions or advice? I would really appreciate it. Thank you! MiaNC 49 y/o, Stage IIA, 1 cm tumor, E+, P+, HER/neu - 2 sentinel nodes positive, 21 axillary negative Bone Scan, CT scan, PET Scan negative s/p bilateral mastectomies s/p dose dense chemo 4 A/C, 4 Taxol",
      "MessageIndex": 0,
      "PostDate": "07/06/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1229-Radiation-consult-results-and-thanks?s=1b276477decf6519c562df0329af5289",
      "Title": "Radiation consult results and thanks"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Dear friends: I went for my initial RT appt last week where they do all kinds of measurements and take photos. My right arm was above my head and after a few minutes it went numb, totally numb and it hurt. I was surprised but I had to ask when we would be done. I had pain in that arm for almost two days. I usually have a high tolerance for pain. Any ideas as to what to do or how to position the arm during RT. It is going to be longer than that appointment and I had never thought of this as a potential problem. Please help!!! Thanks MiaNC 49, 1.1 cm tumor, invasive ductal ca, Stage IIA E+, P+, HER/neu -, 2 sentinel nodes +, 21 axillary negative bilateral mastectomies AC x 4 plus Taxol X 4 Arimidex for after RT",
      "MessageIndex": 0,
      "PostDate": "05/07/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1473-Arm-pain-during-radiation-Any-helpful-advice?s=1b276477decf6519c562df0329af5289",
      "Title": "Arm pain during radiation. Any helpful advice?"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Just like you gals told me, that was just the first appt. The treatments have been a breeze so far (got 6 out of 33 already). Each one lasts 10 minutes and I am out. Enough time to listen to one of my CD especially aimed at preparing you for radiation. I am just a little tired only. We shall see in the coming weeks. I feel good about this extra effort to increase my chances of disease free survival. Prayers have helped. Thank you again MiaNC 49 y/o, Stage IIA, 1.1 cm, estrogen +, Progesterone +, HER/neu neg, 2 sentinel nodes positive, 21 axillary neg. s/p bilat mestectomies and dose dense chemo. Hey, my hair is growing back!",
      "MessageIndex": 3,
      "PostDate": "14/07/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1473-Arm-pain-during-radiation-Any-helpful-advice?s=1b276477decf6519c562df0329af5289",
      "Title": "Arm pain during radiation. Any helpful advice?"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, I cannot believe it but tomorrow is my last RT treatment. Now, after bilat mastectomies, chemo dose dense and 33 RT I am feeling very, very anxious and nervous. Had a chest xray last Monday and the radiologist (while having her breakfast!) saw a \"nodular density\"in my left lung and asked for a CAT scan. My RT doc told me he was not impressed given that I have had a nasty sinusitis and bronchitis for 4 weeks. It is just getting much better with antibiotics, Allegra and Nasonex. He told me to just get the PET Scan as planned by onc. I believe I am on for Arimidex next when I see the onc this week. I had a negative PET and bone scan after chemo. What are the chances of mets this soon (I know I am paranoid by now)? What are my chances of remission given my history? I have two small children and I am quite anxious. Stage IIA, 1.1 cm, 2 sentinel nodes positive, 21 axillary negative, E+, P+, HER/neu neg. Chemo dose dense A/C/Taxol and 33 RT. I really apreciate any answer. Thank you MiaNC",
      "MessageIndex": 0,
      "PostDate": "21/08/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1844-What-are-my-chances-of-remission-and-survival?s=1b276477decf6519c562df0329af5289",
      "Title": "What are my chances of remission and survival?"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Dear Rachel: I absolutely loved and will cherish for a long time this movie. And I did not have any voice in my computer. Thank you, than you... MiaNC 49, St II, 1.1 cm IDC, 2 sentinel nodes positive E+, P+, HER/neu negative S/P dose dense chemo A/C/T Now on day 20 of XRT out of 33.",
      "MessageIndex": 2,
      "PostDate": "04/08/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1283-url-www-thesurvivormovie-com-url-must-see!?s=1b276477decf6519c562df0329af5289",
      "Title": "[url]www.thesurvivormovie.com[/url] - must see!"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, my ANC was 0.2 MOnday and 0.67 today so once again I had no Taxol today. This is week three after Taxol #1, some dose dense! I have to go back Friday for yet another count. I feel that I have not received the dose-dense therapy that Memorial studied and God only knows if and how I will respond to this mess. I am not sure about the long term effects of Neulasta/Neupogen but having an ANC of 200 is pretty darn dangerous and if I had a fever I would now be in the hospital and in reverse isolation. I would like to know if this also happens despite Neulasta, then I would not feel as bad and disappointed. I still believe that they made a mistake. Not that I will take legal action or anything stupid, not my style at all, but I still feel terrible about all this mess. Thanks MiaNC",
      "MessageIndex": 6,
      "PostDate": "27/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/912-Dose-dense-chemo-and-Neulasta-question?s=1b276477decf6519c562df0329af5289",
      "Title": "Dose dense chemo and Neulasta question"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Does anybody know if there are any contraindications to the use of Neupogen once your counts are low? I got Taxol two weeks ago and was told not to do the Neulasta because my counts were good. A week later they had dropped (from 8.8 to 2.5 and my ANC from 7 to 1.6). I was told that I would probably recover by myself but this week when I was supposed to get Taxol #2 they plummeted to 1 and ANC of 0.5. Now he says that Neupogen is contraindicated and that the BM has to recover by itself. Well, I am supposed to be on dose-dense every two weeks. Aren't they supposed to keep me on Neulasta no matter what?? I would like to see other experiences before O change doctors. I am getting tired. Thanks MiaNC",
      "MessageIndex": 0,
      "PostDate": "22/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/912-Dose-dense-chemo-and-Neulasta-question?s=1b276477decf6519c562df0329af5289",
      "Title": "Dose dense chemo and Neulasta question"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "I am on treatment day 27 of 33. I have done quite well so far. But I noticed a small area of redness under my arm. The Dr told me never to put anything there, but now says that maybe I can try aloe vera. It feels a bit tight but no pain, ulcers or oozing. I would appreciate some advice or comments Many thanks MiaNC 49 y/o, Stage IIA, 1.1 cm tumor, 2 sentinel nodes positive, E+, P+, HER/neu-, 21 axillary nodes negative. Completed dose dense A/C x 4 and Taxol x 4.",
      "MessageIndex": 0,
      "PostDate": "13/08/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/1768-How-to-treat-radiation-redness-on-skin-I-need-advice-commen?s=1b276477decf6519c562df0329af5289",
      "Title": "How to treat radiation redness on skin? I need advice/commen"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Does anybody know if there are any contraindications to the use of Neupogen once your counts are low? I got Taxol two weeks ago and was told not to do the Neulasta because my counts were good. A week later they had dropped (from 8.8 to 2.5 and my ANC from 7 to 1.6). I was told that I would probably recover by myself but this week when I was supposed to get Taxol #2 they plummeted to 1 and ANC of 0.5. Now he says that Neupogen is contraindicated and that the BM has to recover by itself. Well, I am supposed to be on dose-dense every two weeks. Aren't they supposed to keep me on Neulasta no matter what?? I would like to see other experiences before O change doctors. I am getting tired. Thanks MiaNC",
      "MessageIndex": 10,
      "PostDate": "22/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/912-Dose-dense-chemo-and-Neulasta-question?s=1b276477decf6519c562df0329af5289",
      "Title": "Dose dense chemo and Neulasta question"
    },
    {
      "AuthorID": "MiaNC",
      "AuthorURL": "https://www.cancerforums.net/members/535-MiaNC?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, my ANC was 0.2 MOnday and 0.67 today so once again I had no Taxol today. This is week three after Taxol #1, some dose dense! I have to go back Friday for yet another count. I feel that I have not received the dose-dense therapy that Memorial studied and God only knows if and how I will respond to this mess. I am not sure about the long term effects of Neulasta/Neupogen but having an ANC of 200 is pretty darn dangerous and if I had a fever I would now be in the hospital and in reverse isolation. I would like to know if this also happens despite Neulasta, then I would not feel as bad and disappointed. I still believe that they made a mistake. Not that I will take legal action or anything stupid, not my style at all, but I still feel terrible about all this mess. Thanks MiaNC",
      "MessageIndex": 16,
      "PostDate": "27/04/2005",
      "Signature": "MiaNC",
      "ThreadURL": "https://www.cancerforums.net/threads/912-Dose-dense-chemo-and-Neulasta-question?s=1b276477decf6519c562df0329af5289",
      "Title": "Dose dense chemo and Neulasta question"
    }
  ]
}