{
  "AuthorID": "miasny",
  "AuthorURL": "https://www.cancerforums.net/members/22397-miasny?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "miasny",
      "AuthorURL": "https://www.cancerforums.net/members/22397-miasny?s=1b276477decf6519c562df0329af5289",
      "Content": "I have been on Arimidex for almost 5 years without much side effects. I had breast cancer Stage IIA, had double mastectomies, chemo and radiation. Last week and today I noticed spotting (have not had a period in over 5 years). I am very concerned about this. Two weeks ago my gyn gave me some estrogen cream to apply sparingly to relieve vaginal dryness. I don't use it every day, maybe I have used it 2-3 times. I also wonder if it could be related to this. I had an abdominal/pelvic CT last month bec of abdominal pain, but it was negative/ I could use some expert words from experienced patients! Can't do much til Monday bec of the weekend. Many thanks MiasNY",
      "MessageIndex": 0,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://www.cancerforums.net/threads/15328-spotting-on-Airimdex?s=1b276477decf6519c562df0329af5289",
      "Title": "spotting on Airimdex?"
    },
    {
      "AuthorID": "miasny",
      "AuthorURL": "https://www.cancerforums.net/members/22397-miasny?s=1b276477decf6519c562df0329af5289",
      "Content": "Almost at the end of 5 years of Arimidex after mastectomies, chemo and radiatyion 5 years ago. Had Stage IIa 1 cm cancer with no axillary nodes and 2 sentinel nodes. Have not had bad side effects at all. I feel \"protected\" and safe taking this anticancer med and want to know if any one here is aware of any data supporting the continuation of the medication after 5 years. Thank you very much. Miasny",
      "MessageIndex": 0,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://www.cancerforums.net/threads/15582-Arimidex-for-more-than-5-years-Any-data-or-news?s=1b276477decf6519c562df0329af5289",
      "Title": "Arimidex for more than 5 years? Any data or news?"
    }
  ]
}