{
  "AuthorID": "mjz",
  "AuthorURL": "https://www.cancerforums.net/members/26884-mjz?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "mjz",
      "AuthorURL": "https://www.cancerforums.net/members/26884-mjz?s=1b276477decf6519c562df0329af5289",
      "Content": "I'm so sorry that you have to go through this. I'm 12 years older then you and had bi-lateral mastectomy with reconstruction this past April. I finished my reconstruction last month. I have nothing but positive results from my surgery. They look great. In fact, they look way better then they ever did. I do agree that it probably depends where your scars will be. Mine go verticle from under the nipple. You can't even notice. I had BC in my left breast only and opted to remove both. I'm happy I did, I would be constantly worrying. It's a hard decision but you need to make the one that's best for you and you will be most comfortable with.",
      "MessageIndex": 7,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/25551-Big-decisions?s=1b276477decf6519c562df0329af5289",
      "Title": "Big decisions"
    },
    {
      "AuthorID": "mjz",
      "AuthorURL": "https://www.cancerforums.net/members/26884-mjz?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks for sharing with me. I actually had the port in yesterday and spoke with the DR. in the morning. He did explain that the tumor is sitting on the muscle and it would be more difficult to remove and they believe the chemo first should be a help. he also said the survival rate whether before or after surgery would be the same. So I do feel better. Starting Chemo on Monday A/C-T.",
      "MessageIndex": 2,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://www.cancerforums.net/threads/19232-pre-surgery-chemo?s=1b276477decf6519c562df0329af5289",
      "Title": "pre-surgery chemo?"
    },
    {
      "AuthorID": "mjz",
      "AuthorURL": "https://www.cancerforums.net/members/26884-mjz?s=1b276477decf6519c562df0329af5289",
      "Content": "diagnosed 2 weeks ago with infiltrating lobular carcenoma, grade 1 tumor. met with a team this week and they have scheduled me for chemo before surgery. PET scan and MRI show cancer is only in the breast, however according to dr. it's the whole breast. I'm scheduled to have a port put in tomorrow. However, after reading on the internet, pre-surgery chemo is usually performed when trying to shrink tumor for lompectomy. I have been told the tumor will probably not shrink much but may soften. Anyone familar with this? I'm starting to question this decision.",
      "MessageIndex": 0,
      "PostDate": "02/10/2011",
      "ThreadURL": "https://www.cancerforums.net/threads/19232-pre-surgery-chemo?s=1b276477decf6519c562df0329af5289",
      "Title": "pre-surgery chemo?"
    }
  ]
}