{
  "AuthorID": "mom2two",
  "AuthorURL": "https://www.cancerforums.net/members/111694-mom2two?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "mom2two",
      "AuthorURL": "https://www.cancerforums.net/members/111694-mom2two?s=1b276477decf6519c562df0329af5289",
      "Content": "Originally Posted by Questforlove Hi Everyone, I got my first mammogram when I was 39 years old. They did all sorts of tests as well and it showed I had nothing. Results were negative. I got my mammogram done today and I am more than terrified. The night before I threw up and was just in panic. My father passed away from Prostate Cancer so all of this is just a lot! I got the mammogram done at a new place because I have a new job. I went to the mammogram place and they told me that I will hear from them in one week as they need to get my first mammogram when I was 39 first to compare with the mammogram I just did now. Why do they have to compare? Why do I have to wait a week and they will contact me? Don’t they give results on the spot? Take a deep breath. I don't think there is anything to worry about. It is procedure to compare mammograms to the previous ones. The can look to see if there are any changes. Also from my exprience if they told you it will take about a week, they weren't too concerned. My mom was recently (Aug) diagnosed with breast cancer and let me tell you that when she had her mammogram, before she even left, they fit her in for an ultrasound and biopsy! I know how terrifying the wait is (we are now post-surgery and waiting for bone scan results), but don't drive yourself crazy. To me this sounds very routine....good luck and let us know.",
      "MessageIndex": 1,
      "PostDate": "23/10/2015",
      "Signature": "Dad's stats: Biopsy: 2/13 cores positive(+DRE) G both positive cores4+4)+8. Adenacarcinoma(acinar) Lymph/vascular or perineural invasion:not identified. Pelvic ultrasound:unremarkable. Transrectal ultrasound: 9mm tumor left lateral peripheral zone. contact with capusle is about 7mm No definite ECE noted Seminal vesicals: normal Jun30/2014 clear CT scan Aug21/2014 clear bone scan 30Sep2014: open radical prostatectomy Post-op Path Oct 9/2014: G:4+3=7 (mostly4);left pelvic lymph nodeN0 surgical margins: all negative perineural invasion: present vascular/lymphatic invasion & seminal vesicles: not identified ECE:established,extensive, left posterior aspect (pT3a) % prostate involved by tumor: 5% Distant metastisis: not applicable 19Nov2014, 3Feb2015, Sep2015: ≤ 0.01 2017:PSA rising: 0.015, 0.027, 0.040, 0.044 35 sessions SRT completed Dec2017 PSA dropping post SRT: 0.024 (5wks), 0.009 (3months), ≤ 0.008 (sep201, ≤ 0.008 (Mar2019)",
      "ThreadURL": "https://www.cancerforums.net/threads/46160-Why-do-I-have-to-wait-a-week?s=1b276477decf6519c562df0329af5289",
      "Title": "Why do I have to wait a week?"
    },
    {
      "AuthorID": "mom2two",
      "AuthorURL": "https://www.cancerforums.net/members/111694-mom2two?s=1b276477decf6519c562df0329af5289",
      "Content": "Hello, I need some help understanding my mom's pathology report. I have a pretty good grasp, because I have a science background and work as a scientist. She had a left breast lumpectomy and the post-surgical report is what I'm referring to. Her cancer is Invasive Ductal Carcinoma with minor micropapillary component. One of three lymph nodes was positive and she had a bone scan and chest/pelvic scan for which we won't know the results for another two weeks when she sees the medical oncologist. So in terms of margins the report says: margins uninvolved for invasive carcinoma which is great right? along with this there is info on the distance in mm to the closest margin. I'm sure this is what the surgeon read when he told us margins were negative. Here's my issue: at the very beginning of the report where the type of cancer is identified as IDC with a micropapillary component it says in brackets (see note). This note is on the following page and reads as follows: \"This is an invasive ductal carcinoma, NOS with a micropapillary component. Tumor emboli show micropapillary features and involve small and larger lymphovascular spaces in the peritumoral area and well away from the main mass, they are also seen very close to multiple resection margins and transected at the posterior and the revised inferior margins\" They would not write \"uninolved margins\" in the report under the margin section if there were positive margins right? so how if the margins are negative (and the dr. told us this) what does this comment mean and should I freak out about it? After much thought and readng I was thinking the the tumor emboli are pieces that broke loose and are not ''active cancer\" which is what clear margins looks for? Anybody have a friend pathologist they can ask? I'm going to go crazy waiting for another 2.5 weeks to speek to the dr.",
      "MessageIndex": 0,
      "PostDate": "06/11/2015",
      "Signature": "Dad's stats: Biopsy: 2/13 cores positive(+DRE) G both positive cores4+4)+8. Adenacarcinoma(acinar) Lymph/vascular or perineural invasion:not identified. Pelvic ultrasound:unremarkable. Transrectal ultrasound: 9mm tumor left lateral peripheral zone. contact with capusle is about 7mm No definite ECE noted Seminal vesicals: normal Jun30/2014 clear CT scan Aug21/2014 clear bone scan 30Sep2014: open radical prostatectomy Post-op Path Oct 9/2014: G:4+3=7 (mostly4);left pelvic lymph nodeN0 surgical margins: all negative perineural invasion: present vascular/lymphatic invasion & seminal vesicles: not identified ECE:established,extensive, left posterior aspect (pT3a) % prostate involved by tumor: 5% Distant metastisis: not applicable 19Nov2014, 3Feb2015, Sep2015: ≤ 0.01 2017:PSA rising: 0.015, 0.027, 0.040, 0.044 35 sessions SRT completed Dec2017 PSA dropping post SRT: 0.024 (5wks), 0.009 (3months), ≤ 0.008 (sep201, ≤ 0.008 (Mar2019)",
      "ThreadURL": "https://www.cancerforums.net/threads/46292-Help-understandiing-pathology-report-please?s=1b276477decf6519c562df0329af5289",
      "Title": "Help understandiing pathology report please"
    },
    {
      "AuthorID": "mom2two",
      "AuthorURL": "https://www.cancerforums.net/members/111694-mom2two?s=1b276477decf6519c562df0329af5289",
      "Content": "Originally Posted by BobInBonita I'm so sorry you're here about your mother now after your fathers battle. I'm neither a Dr nor a pathologist, so please take this with a large grain of salt. When the Dr told you that there were clear margins, was it immediately after the lumpectomy (before the final pathology report)? Many times there will be a pathologist in the OR who will do a quick microscopic exam of the tissue during surgery. This is a preliminary look to guide the Dr. It is not as sensitive as the final pathology report where the tissue is stained to make the internal structure more visible. It is possible to have clear margins in the OR that are not clear after final pathology. If the surgeon told you there were clear margins AFTER the final pathology report, then the margins were clear, but the pathologist was clearly concerned based on the note. The fact that this is an invasive cancer, cells were seen well away from the main tumor and near the margins, and there were positive lymph nodes are all cause for worry, but not for freaking out. Freaking out does no good. Now you have to research options, potentially get a second opinion at a major cancer center, and make a list of question for her oncologist (or you will miss something - everybody does). If you are not already at a major cancer center, you might consider a consult from one. They tend to employ a team approach where medical oncologists, radiation oncologists, and surgeons work as a team rather than as separate disciplines. In the US, the NCI has designated Comprehensive Cancer Centers - here is a link: NCI Cancer Center Finder My best wishes to you and your family. Thank you for your reply. Yes this is the final pathology report which we got 4 weeks post-surgery. I asked for a copy. The surgeon told us \"clear margins\" the report says \"margins uninvolved for invasive carcinoma\" and goes on to state the distance to the closest margin (being 6mm). That note I mention is in the report not under the margin section (it's under the histological type section as a note). We are at a very big cancer center in Toronto, one of the best in the world they say...appointment with the oncologist is in 2.5 weeks so I'll ask all my questions then....I just hope this in-between time is not too long....we already know she'll do radiation, and now because of the lymph node she'll also need either chemo and/or hormone treatment.",
      "MessageIndex": 2,
      "PostDate": "07/11/2015",
      "Signature": "Dad's stats: Biopsy: 2/13 cores positive(+DRE) G both positive cores4+4)+8. Adenacarcinoma(acinar) Lymph/vascular or perineural invasion:not identified. Pelvic ultrasound:unremarkable. Transrectal ultrasound: 9mm tumor left lateral peripheral zone. contact with capusle is about 7mm No definite ECE noted Seminal vesicals: normal Jun30/2014 clear CT scan Aug21/2014 clear bone scan 30Sep2014: open radical prostatectomy Post-op Path Oct 9/2014: G:4+3=7 (mostly4);left pelvic lymph nodeN0 surgical margins: all negative perineural invasion: present vascular/lymphatic invasion & seminal vesicles: not identified ECE:established,extensive, left posterior aspect (pT3a) % prostate involved by tumor: 5% Distant metastisis: not applicable 19Nov2014, 3Feb2015, Sep2015: ≤ 0.01 2017:PSA rising: 0.015, 0.027, 0.040, 0.044 35 sessions SRT completed Dec2017 PSA dropping post SRT: 0.024 (5wks), 0.009 (3months), ≤ 0.008 (sep201, ≤ 0.008 (Mar2019)",
      "ThreadURL": "https://www.cancerforums.net/threads/46292-Help-understandiing-pathology-report-please?s=1b276477decf6519c562df0329af5289",
      "Title": "Help understandiing pathology report please"
    }
  ]
}