{
  "AuthorID": "Neeshu Jain",
  "AuthorURL": "https://www.cancerforums.net/members/17395-Neeshu-Jain?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Neeshu Jain",
      "AuthorURL": "https://www.cancerforums.net/members/17395-Neeshu-Jain?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi everyone! Can anyone pls tell me about \"CyberKnife\" technology for killing cancer cells. PPL who are totally ignorant about this here is a bit of it(The mind-boggling technology, CyberKnife, which promises to treat deadly cancers has come as a miracle for those who gave up hope. The bloodless and painless surgery is performed by a robotic system, using artificial intelligence.) My relative went through an operation for breast cancer and now chemotherapy is going on I heard about this robotic treatment and am keen to know if it helps and avoid complications during chemotherapy. Any comparison in two .. I would appreciate your help guys. thanks. Neeshu.",
      "MessageIndex": 0,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://www.cancerforums.net/threads/10205-Its-on-Breast-Cancer-treatment?s=1b276477decf6519c562df0329af5289",
      "Title": "Its on Breast Cancer treatment .."
    },
    {
      "AuthorID": "Neeshu Jain",
      "AuthorURL": "https://www.cancerforums.net/members/17395-Neeshu-Jain?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi Friends, I thanks everyone who is linked with this forum. I have a query for breast cancer problem, Last month was very painful for me as My mother in law observerd symptoms of breast cancer and finally it was diagnosed as the same, later she went through an operation and the affacted portion was removed. But samethime I heard(from the doctors even) that this problem can be genetic too which really make me worry. Can anyone pls share his\\her experience or thoughts on it..? or if it is true then is there any precautionary treatment for this which can reduce the chances .. thanks in advance! Neeshu",
      "MessageIndex": 0,
      "PostDate": "19/08/2009",
      "ThreadURL": "https://www.cancerforums.net/threads/10105-I-thanks-everyone-who-is-linked-with-this?s=1b276477decf6519c562df0329af5289",
      "Title": "I thanks everyone who is linked with this .."
    }
  ]
}