{
  "AuthorID": "Orion",
  "AuthorURL": "https://www.cancerforums.net/members/11007-Orion?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Orion",
      "AuthorURL": "https://www.cancerforums.net/members/11007-Orion?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you guys. I really appreciate it. I guess the reason why it's so easy for me to panic is because the breast cancer fear is so ingrained. I remember as a teenager waking up every morning terrified. I saw my mother die slowly over eight years, and it was am absolute nightmare. I have been to counselors, etc, and I do realize there is no point in being unnecessarily stressed, it's just the mere suggestion of this happening to me is dreadful. I am overall a happy, vivacious personality. No one knows this side of me, except my husband and you now. It really puts things in perspective when you are potentially faced with this issue. Nothing else matters in life but those you love. It's hard not to feel like a victim. On a positive note, I have the BEST doctors in the world working with me, both plastic surgeon and preventative oncologist. I also LOVE my family doctor. I am blessed in this way. Part of my issue is that I am not fond of my breasts. I am a teeny tiny weencey 104 pounds with a HUGE DD/E chest, and all natural. I have booked a reduction for September, and it has nothing to do with the BC. The oncologist thinks I should wait until I am through with the testing before I go for it. Question. Why are they saying that I have to ask my aunt to get tested and not me? I didn't really understand that part. Does it have to do with life insurance or something? Also, how long does it typically take for the genetic aspect of things to come through, and if my aunt continues to refuse the test, what can I do then? Thanks guys, I REALLY appreciate this. O.",
      "MessageIndex": 3,
      "PostDate": "07/02/2008",
      "ThreadURL": "https://www.cancerforums.net/threads/6220-Genetic-Link-Terrified?s=1b276477decf6519c562df0329af5289",
      "Title": "Genetic Link - Terrified"
    },
    {
      "AuthorID": "Orion",
      "AuthorURL": "https://www.cancerforums.net/members/11007-Orion?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi all, I just registered in a desperate state of mind. I am so scared. I just turned 30 this week and I am finally coming to terms with the fact that I have to look into the breast cancer in the family in order to identify my risk. I made an appt. about a month age via my family MD to see a renowned preventative specialist here in toronto. Before I get into what happened, here is a little about my history: Mom: got breast cancer at 45, both breasts, pre-menopausal (not jewish, BUT had a very rare form that is most seen in one particular jewish bloodline). deceased Aunt: got breast cancer at 62, post-menopause, I believe both breasts. No one else in the family had it. I am so scared. After my appt with the preventative oncologist this morning, I know that I am at an increased risk for BC. She asked me to call my aunt to find out about my mom and my aunts BC - type, etc. At the appt, I didn't mention my mom's cancer as being pre-menopausal, NOR being the aggressive type, the RARE type. I am sure once she hears this I will be scared to hear what she says. The MD asked me to ask my aunt if she would be willing to go for a blood test to see if the gene is there and my aunt refused. I am scared and feeling very alone. Today I feel like I have a death sentence. Once I receive the package for the genetic info lab and get my dad to release my mom's medical records I will know even more of what this process will entail. I feel like it will definitely happen now because my mom had the worst and most rare type. Can anyone talk to me about this. I need reassurance. The husband is just telling me to relax and not worry until I know all the facts, but realistically, that is not how things work. I was tormented all through my adolescence with mom having cancer and dad not being in the picture. It was a nightmare, and I feel like I am revisiting it. Help.",
      "MessageIndex": 0,
      "PostDate": "06/02/2008",
      "ThreadURL": "https://www.cancerforums.net/threads/6220-Genetic-Link-Terrified?s=1b276477decf6519c562df0329af5289",
      "Title": "Genetic Link - Terrified"
    }
  ]
}