{
  "AuthorID": "RlW",
  "AuthorURL": "https://www.cancerforums.net/members/129224-RlW?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "RlW",
    "AuthorURL": "https://www.cancerforums.net/members/129224-RlW?s=1b276477decf6519c562df0329af5289",
    "Content": "Originally Posted by mesolee Hello my mother was newly diagnosed with breast cancer today and is having a Mastectomy in three weeks time which i think is a long time to wait ..they found two cancerous lumps in her left breast and that is all i have been told ..i dont know what stage it is , if its invasive ...will she need chemo etc etc ... I live with my mother who is also disabled having had polio as a child and im really struggling to understand any of it and what will happen and to be honest im absolutely terrified ... my mother does not want to talk about it which i understand but i need to talk to somebody .. thanks in advance for any replies ------------------------- Hi mesolee. I am sorry to hear about your mother, but I wanted to let you know there is hope and neither of you are alone. It depends on the type of breast cancer she has and the Oncologists decision on how best to treat her. I was diagnosed with Stage 2 Triple Negative in 2014, went thru several tests & scans that took months before ever starting chemo. My Dr chose chemo, surgery then radiation. I did agree to the chemo and the surgery, but I refused radiation, mainly because it wasn't needed but just an extra precaution. The Dr wasn't too happy with me for that, but it was my choice. I know that the mind plays a big role on how well our body takes care of itself, so during my treatments I only wanted people around that could make me laugh, because I wasn't going to bow down & let cancer control my life. Other Dr's suggest different treatment options and when to do them and in what order. Whatever they suggest is for the best treatments to have the best results for the particular type of cancer involved. It is a very scary time for all involved, but there have been so many advances in treatments that more people are surviving than ever before. I would suggest to go with your mother to her appointments and ask the Dr any questions you may have about the cancer itself and her treatment options and her home care to know what and how to deal with any & all side effects. Also, keep a list or journal of things such as how your mom is doing at home, eating, sick, mental issues or whatever may come up, so you can let the Dr know and you & your mom don't forget in between appointments. All in all, just remember to breathe and laugh and keep a positive attitude, both you and your mom too.",
    "MessageIndex": 6,
    "PostDate": "18/01/2019",
    "ThreadURL": "https://www.cancerforums.net/threads/53135-Mother-diagnosed-with-breast-cancer?s=1b276477decf6519c562df0329af5289",
    "Title": "Mother diagnosed with breast cancer"
  }]
}