{
  "AuthorID": "samizme",
  "AuthorURL": "https://www.cancerforums.net/members/8827-samizme?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "samizme",
    "AuthorURL": "https://www.cancerforums.net/members/8827-samizme?s=1b276477decf6519c562df0329af5289",
    "Content": "Please accet my sincerest sympathies. I supported my wife through 7 years of treatment for breast cancer and recently lost her in August last year. I can only encourage you just to be there for your friend and try to be as positive and normal as you can. Be a listener and a shoulder, but remember she will not need you to solve her problems for her or to be a perfect source of solutions - listen to what she says (listening is more than hearing) and help her to share her burden as much as she can. I realised that I would always be grateful for the time that I had with my wife and that no matter what happened, every new day was a time to cherish and make the most of. Once we had the diagnosis we made sure that we lived each moment to the full. I hope that your friend's illness does not turn out to be too serious in the long term but too many people in the later stages are too busy dying when then should be living each day and making the most of the time that they have. If you can help her to do this (even if things work out OK) what a wonderful gift you can give her. With a positive attitude I found the later years of nursing my wife a very rewarding experience, with nothing unsaid and no regrets. How lucky were were to have that time together knowing how precious it was and being able to leave each other in a very tranquil and relaxed state of mind. I wish you both well and hope most of this is not needed and that you shake this off and carry on with your lives. I would be happy to keep in touch if you wished and have several excellent books that I can recommend if this is of interest. Sam",
    "MessageIndex": 2,
    "PostDate": "12/01/2008",
    "Signature": "Sam",
    "ThreadURL": "https://www.cancerforums.net/threads/6037-What-Shall-Friends-Do-Say?s=1b276477decf6519c562df0329af5289",
    "Title": "What Shall Friends Do, Say?"
  }]
}