{
  "AuthorID": "scaredofit",
  "AuthorURL": "https://www.cancerforums.net/members/8180-scaredofit?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "scaredofit",
      "AuthorURL": "https://www.cancerforums.net/members/8180-scaredofit?s=1b276477decf6519c562df0329af5289",
      "Content": "Thank you for your responses, Muttsmom and Vee Smith. It gave me some sort of courage and strength. It's hard to come back in this forum because everytime I read through the questions and experiences of other members, it just breaks me down. [quote =\"Muttsmom\"] I was 43 when Dx and had NO history of cancer of any kind that I know of for at least 2 generations. I was the 1st with breast cancer. [/quote] Does this mean it really is not heridetary? I feel so ignorant. What's up with women's hormones that some women get BC and some of them don't? That's strange. Originally Posted by Vee Smith As to treatments, don't knock chemo - it can be unpleasant, but it has kept me alive. The nasty effects are relatively temporary, and if the cancer is stopped in its tracks, it is worth it. I don't know. Maybe for Stage I and II. When my mom was suffering from chemo side effects, I wished I was the one in her position. It was such a heart-breaking experience. I wish I could have done something to take away her pain. Is it advisable for BC victims to still undergo chemo if they are already in Stage IV of it?",
      "MessageIndex": 4,
      "PostDate": "26/06/2007",
      "Signature": "*** Live like it's your last day on earth ***",
      "ThreadURL": "https://www.cancerforums.net/threads/4763-Is-it-really-hereditary?s=1b276477decf6519c562df0329af5289",
      "Title": "Is it really hereditary?"
    },
    {
      "AuthorID": "scaredofit",
      "AuthorURL": "https://www.cancerforums.net/members/8180-scaredofit?s=1b276477decf6519c562df0329af5289",
      "Content": "I lost my mom to breast cancer almost 6 yrs ago. She passed away just 4 months after her diagnosis. She was 66. Since then, I've been trying to keep myself fit and I eat healthy foods as much as I can. I admit though that sometimes I do get tempted to eat junk foods. Truth is I get sick all the time. My immune system is weak so I get colds and allergies here and there. It's not as bad as before though. I don't drink and smoke. I have 2 young children and I want to stay healthy for them for as long as possible. I am 41. I had my first mammogram 2 yrs ago. It was clear. My doctor asked me last year to have a mammogram again. I didn't take it. I don't know....it's either I doubt how mammogram works or I'm scared, or both. I'm scheduled to see my doctor again for my annual next month. She's gonna ask me again to get a mammogram. Is it really hereditary? I mean, there was nobody in my big family who had any type of cancer before my mom did. She was the first. I have 3 brothers so I know that they're thinking of me....that it could be a possibility someday. I remember once being in the hospital with my mom. I saw a mother and her adult daughter sitting at the waiting room. They both had mastectomy. I looked at my mom....weirdly. She had no reaction. Could it just be poor diet? Is it really what you put inside your body? Is it the lifestyle? My mom never drank and smoked. What could have given her breast cancer? I don't want to get it one day but somehow I don't trust the conventional treatments. I think chemo is the most barbaric thing ever to be given to a human being. I've already decided that I if one day I get cancer, I would rather wait for my time to die than go through chemo. My mom was given 6 mos to live. After chemo and radiation, she only lasted 4 mos. To die with cancer is painful enough. Why let the person suffer more? There's a lot of things on my mind. My father-in-law was just diagnosed with adenocarcinoma, Stage 3B (lung cancer). My husband is depressed. It brings back sad memories on my part. I want to stay strong for him but it's so sad. I hide my tears from him at night. I just learned that her grandpa had cancer but was a survivor until he passed away several years ago. My father-in-law was a heavy smoker over 20 yrs ago. I guess it's pay back time. I don't want to think that cancer is hereditary because there's no proof that it is but.... is it??? Should I go for that annual mammogram? I don't know what I'm feeling. I want to tell my husband to not let his father undergo chemo cause it's just going to spread out and could kill him sooner. I don't know. I'm keeping everything to myself. I'm scared for my father-in-law and I feel sorry for my husband.",
      "MessageIndex": 0,
      "PostDate": "20/06/2007",
      "Signature": "*** Live like it's your last day on earth ***",
      "ThreadURL": "https://www.cancerforums.net/threads/4763-Is-it-really-hereditary?s=1b276477decf6519c562df0329af5289",
      "Title": "Is it really hereditary?"
    }
  ]
}