{
  "AuthorID": "seamster",
  "AuthorURL": "https://www.cancerforums.net/members/30227-seamster?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "seamster",
    "AuthorURL": "https://www.cancerforums.net/members/30227-seamster?s=1b276477decf6519c562df0329af5289",
    "Content": "I had my last taxol treatment November 13 of 2011. Four months later, I am still dealing with the side effects. My fingernails (but not my toenails as of yet) are in various stages of turning white, black and lifting off. I have neuropathy in hands and feet and I think in my right thigh. After the taxol, I had a mastectomy at the end of December and now I have lymphedema in my right hand. Because of the extreme tenderness in my fingertips and now the swelling my in right hand, I slowly stopped using my right hand - fortunately I have been able to do as little as I do with my left hand. Here is the one bright spot in all of this. I only recently found that there are physical therapists who specialize in lymphedema. After two sessions I can see a decrease in the swelling, but I guess I'll be wearing a compression stocking and gauntlet till whenever. NOW, if I can only find someone who knows how to treat neuropathy, maybe things will start looking more positive. I am really concerned about my doctors who all deny any of their treatments are the reasons for my side effects. That is puzzling to me, and it makes me angry. I truthfully get more helpful advice and information from a couple of friends who are nurses. I'm glad to have found this forum so I can \"vent\". And it was a blessing to know I wasn't in this situation alone. I guess we should consider ourselves lucky that some of these drugs are available for our cancers. And this forum will help those coming after us to learn and to cope.",
    "MessageIndex": 3,
    "PostDate": "24/03/2012",
    "ThreadURL": "https://www.cancerforums.net/threads/21858-Breast-cancer-and-taxol?s=1b276477decf6519c562df0329af5289",
    "Title": "Breast cancer and taxol"
  }]
}