{
  "AuthorID": "sharon55",
  "AuthorURL": "https://www.cancerforums.net/members/813-sharon55?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "sharon55",
      "AuthorURL": "https://www.cancerforums.net/members/813-sharon55?s=1b276477decf6519c562df0329af5289",
      "Content": "I was diagnosed 6/04 with bone mets and have been on femara since then. The femara has been holding things pretty good, but my CA27/29 markers have been steadily climbing from around 60 in Dec. to 113 now. My PET/CT scan from three weeks ago shows the bone mets the same but now I have liver mets. The doc wants to put me on chemo, but I was given a choice between two different combination regimes. I don't know what to choose because the doc said both would probably have the same effect (which she thought would be good). So is any one of these better than another? Taxotere and Xeloda Taxotere and Navelbine I've heard wonderful things from many people about Xeloda. Is this something you can take again later? Sharon",
      "MessageIndex": 0,
      "PostDate": "29/06/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1416-New-to-this-forum-with-questions-on-chemo?s=1b276477decf6519c562df0329af5289",
      "Title": "New to this forum with questions on chemo"
    },
    {
      "AuthorID": "sharon55",
      "AuthorURL": "https://www.cancerforums.net/members/813-sharon55?s=1b276477decf6519c562df0329af5289",
      "Content": "I have bone and liver mets and I am debating whether to take taxotere by itself or taxotere w/ Xeloda. Has anybody w/bone and liver mets first taken taxotere and had a good response? Then after progression taken Xeloda and had a good response? Has anybody taken them as a combo, had good results, and then gone back to take one of them again, with good results? I know this is a lot of questions but I just can?t find the answers anywhere, so I figured the best place to go is to all the wonderful people who?ve been there! Sharon",
      "MessageIndex": 0,
      "PostDate": "01/07/2005",
      "ThreadURL": "https://www.cancerforums.net/threads/1426-Combo-or-single?s=1b276477decf6519c562df0329af5289",
      "Title": "Combo or single?"
    }
  ]
}