{
  "AuthorID": "silky",
  "AuthorURL": "https://www.cancerforums.net/members/21892-silky?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "silky",
    "AuthorURL": "https://www.cancerforums.net/members/21892-silky?s=1b276477decf6519c562df0329af5289",
    "Content": "So far they've got me diagnosed at Stage I, but I am having a lymph ultrasound tomorrow, and if they find anything funny, then I'll have the lymph biopsy done. If they find anything in the lymph, I move to Stage II. My pathology report says the cancer tests positive for both estrogen and progesteron and negative for HER2. I guess that's supposed to be good. I've had core biopsy, stereotactic biopsy and MRI done so far. I had blood drawn and sent to a geneticist to see if I've got the BRCA1 or BRCA2 mutation, as breast cancer runs very strong in my family (I'm the 4th of 5). If I have the mutation, that's bad news for my daughter and grand-daughter, so am praying that I don't have it. The pathology report says the growth rate is \"intermediate\". Does anyone know what that means? I got no answer from my doctor (which isn't surprising, as so far everyone is treating me like a somewhat retarded 3 year old). I've been very good about getting mammograms each year, and had a questionable one 4 years ago, but the biopsy was that it was a cyst. Anyway, I can see that DCIS doesn't really show up on a mammo, so I am wondering how long I've had this stuff - and how fast I need to move going forward. Can anyone help? Also, how do I get it across to my dr and team that I am not stupid and when they treat me like I am it is very upsetting. It's bad enough that I have cancer and will be losing what is to me a very important part of my body. I do not want to be treated like I'm also losing my mind.",
    "MessageIndex": 0,
    "PostDate": "04/11/2010",
    "ThreadURL": "https://www.cancerforums.net/threads/14827-recent-diagnosis-of-DCIS-IDC-questions-if-anyone-can-help?s=1b276477decf6519c562df0329af5289",
    "Title": "recent diagnosis of DCIS + IDC - questions if anyone can help."
  }]
}