{
  "AuthorID": "spiritlead",
  "AuthorURL": "https://www.cancerforums.net/members/11210-spiritlead?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "spiritlead",
    "AuthorURL": "https://www.cancerforums.net/members/11210-spiritlead?s=1b276477decf6519c562df0329af5289",
    "Content": "Breast cancer Felt lump in 2002 Diagnosed in 2005 at age 39 Got pregnant at agfe 39 and advised to abort by oncologist and gynecologist because of how fast cancer spreads when tou are pregnant. Bluntly refused.....doesn't line up with the plan of God Baby girl is now 2yrs, 3mths old and very healthy... so am I. After the diagnosis I have never been back to a doctor, have had no surgery, radiation or chemotherapy. Think I'm crazy? I certainly am not. Tumor is slow growing and will soon disappear forever. Why? I believe in the power of natural medicine and the power of God. Changed my diet from acidic to highly alkaline...for life....no meat, dairy, sugar, flour etc. Not easy because most of what we eat is acidic but it's worth it. Couldn't use the more powerful herbs when I was pregnant so I had tons of juiced carrots. Really worked. Use tumeric, green tea, lots of grapes, garlic, aloe, parsley, herb teas, wheatgrass, kelp, fruit and vegetable juices, olive oil, flax seed, cayenne, ...any cancer fighting herb, tried cantron once but didn't use long enough to see results ( very expensive in the West Indies) herbal parasitic cleansers, kangen water, herbal blood purifiers like red clover. I detox often. Have move raw than cooked food Now trying Essiac alone. Giving it six months before I can vouch for it. Will keep you posted. My advise is: Do not put your faith in any doctor or cure even if it is herbal, but place all your hope and trust in God. He has seen me through this far and He never fails you. Don't give up. I will never. Love you all' Spiritlead.",
    "MessageIndex": 0,
    "PostDate": "26/07/2008",
    "ThreadURL": "https://www.cancerforums.net/threads/7323-Tried-Essiac?s=1b276477decf6519c562df0329af5289",
    "Title": "Tried Essiac?"
  }]
}