{
  "AuthorID": "spoke",
  "AuthorURL": "https://www.cancerforums.net/members/589-spoke?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "spoke",
      "AuthorURL": "https://www.cancerforums.net/members/589-spoke?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks for that. I jumped on it and have one sitting ready for tomorrow morning. Great idea!",
      "MessageIndex": 1,
      "PostDate": "08/05/2005",
      "Signature": "She should never have looked at me If she meant I should not love her! Sir Robert Browning",
      "ThreadURL": "https://www.cancerforums.net/threads/1031-FYI?s=1b276477decf6519c562df0329af5289",
      "Title": "FYI"
    },
    {
      "AuthorID": "spoke",
      "AuthorURL": "https://www.cancerforums.net/members/589-spoke?s=1b276477decf6519c562df0329af5289",
      "Content": "Well, she got through the first week of chemo. It was given on Monday (which was ok), Tuesday was not bad, Wednesday was brutal, and Thursday was worse. Friday, she worked all day seeing patients (as a Hospice Nurse). It was a tough week, but it's finally begun. She said the nausea meds were working alright today, so we went to see one of the kid's softball games. Apparently, as long as she keeps eating a little here and there, there's some relief. Thanks for taking the time to post all your replies and great info. And AlaskaAngel, you asked me what line of work I'm in. I've been in financial services in one capacity or another for nearly 25 years. During the 80's as a stockbroker, and for the past 11 years as a wholesaler of financial products like mutual funds and annuities. It's kind of unlikely that I'll be wholesaling again, unless the job is a real good fit for our current lifestyle. For the past few years I've traveled quite a bit and I'd like to avoid that now. OTOH, having no income and no benefits doesn't add much to our quality of life either, so who can say?",
      "MessageIndex": 5,
      "PostDate": "07/05/2005",
      "Signature": "She should never have looked at me If she meant I should not love her! Sir Robert Browning",
      "ThreadURL": "https://www.cancerforums.net/threads/1012-New-guy-checking-in?s=1b276477decf6519c562df0329af5289",
      "Title": "New guy checking in...."
    },
    {
      "AuthorID": "spoke",
      "AuthorURL": "https://www.cancerforums.net/members/589-spoke?s=1b276477decf6519c562df0329af5289",
      "Content": "Hello! I spend many hours on other internet forums, but my beautiful wife was diagnosed with breast cancer about four weeks ago. She needs much more than I'm able to supply (being the Neanderthal that I am), so I'm stumbling around right now. First some background. Karen was a cancer nurse at MD Anderson Hospital in Houston for nearly fourteen years. She's an Oncology Nurse Clinician, and specialized in adult leukemia patients and bone marrow transplants. When we moved to North Texas nearly ten years ago, we were able to fulfill a part of our family plan, which was for her to be a stay-at-home Mom. She did that for eight years for our three children, and just about a year and a half ago went back to nursing part time, this time as a hospice nurse. In January, she went to work full time. She's the most godly woman I've ever known and has approached nursing and motherhood in the same fashion: as separate callings from God, and has always committed 110% to each, comitting herself to please Him in each endeavor. If there was ever a woman designed to be a nurse and a mother, my wife is that woman. Her children and patients receive all she has to give without ceasing, but now it's her turn to be a patient. This part of our life is made more difficult by the fact that I've been unemployed for six months. When she was offered the chance to work full time in January, we decided she should accept, since health & medical benefits came with the job. Good move on our part! About five weeks ago on a Saturday, she felt a lump while taking a shower. On Monday, she was at the doctor, and then we were off to the races. About ten days later, she had a lumpectomy, and two days ago (on Monday), she began her first course of chemotherapy. Monday was okay, Tuesday not bad, today was brutal! Rough day, and most of it spent in bed. She needs to go to work to keep the benefits that will assure her of treatment to beat the cancer, but it's going to be tough. If there was ever a year when I'd like her to be that stay-at-home Mom, this is it. Until I get a job however, that can't happen, and maybe not even then. I'll be checking in here as often as possible for any insight you folks can provide, and hopefully some encouragement too!",
      "MessageIndex": 0,
      "PostDate": "05/05/2005",
      "Signature": "She should never have looked at me If she meant I should not love her! Sir Robert Browning",
      "ThreadURL": "https://www.cancerforums.net/threads/1012-New-guy-checking-in?s=1b276477decf6519c562df0329af5289",
      "Title": "New guy checking in...."
    },
    {
      "AuthorID": "spoke",
      "AuthorURL": "https://www.cancerforums.net/members/589-spoke?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks for welcoming my bride, ladies. I know she's going to find this site to be a great source of information and encouragement, and at this point in the treatment that will be invaluable. Wait until our kids find out that Mom has joined an internet forum and wants more computer time...yikes!",
      "MessageIndex": 3,
      "PostDate": "05/07/2005",
      "Signature": "She should never have looked at me If she meant I should not love her! Sir Robert Browning",
      "ThreadURL": "https://www.cancerforums.net/threads/1472-First-time-post!?s=1b276477decf6519c562df0329af5289",
      "Title": "First time post!"
    },
    {
      "AuthorID": "spoke",
      "AuthorURL": "https://www.cancerforums.net/members/589-spoke?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks for welcoming my bride, ladies. I know she's going to find this site to be a great source of information and encouragement, and at this point in the treatment that will be invaluable. Wait until our kids find out that Mom has joined an internet forum and wants more computer time...yikes!",
      "MessageIndex": 13,
      "PostDate": "05/07/2005",
      "Signature": "She should never have looked at me If she meant I should not love her! Sir Robert Browning",
      "ThreadURL": "https://www.cancerforums.net/threads/1472-First-time-post!?s=1b276477decf6519c562df0329af5289",
      "Title": "First time post!"
    }
  ]
}