{
  "AuthorID": "spoticus",
  "AuthorURL": "https://www.cancerforums.net/members/8973-spoticus?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "spoticus",
      "AuthorURL": "https://www.cancerforums.net/members/8973-spoticus?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi there, My 32yo partner has a Her2 +ve, ER -ve breast cancer (DCIS) diagnosed in March. The cancer cells from biopsy were grade 3. The original tumour was 20 x 30mm and one lymph node was positive (swollen to about an inch in size) - so roughly stage 2b. She is having pre-surgical chemotherapy. First was 3 months of Epirubicin and Cyclophosphamide which has reduced the tumour so that it's not visible with ultrasound. She is now doing 3 months of Docetaxel and Herceptin (with 9 months Herceptin planned for after surgery). We are trying to plan surgery and were hoping to have a choice between lumpectomy and radiotherapy, or mastectomy with immediate reconstruction. However, the breast surgeon is insisting on a mastectomy, the radiotherapist is insisting on radiotherapy, and the cosmetic surgeon is insisting on a delayed reconstruction if there is going to be radiotherapy. We feel like we are being railroaded into mastectomy + radiotherapy + delayed reconstruction. We're confused because everything we've read says that radiotherapy is only required with a mastectomy in cases with larger tumors or where more lymph nodes are involved. We want to balance eradicating the cancer with limiting the side effects. My concern is that my partner's heart function has already been reduced from the Epirubicin (from an LVEF of 59% to 55%) and if radiotherapy affects her heart further then that will mean she can't continue to take Herceptin which will likely provide much more benefit than the radiotherapy (the cut-off for the Herceptin here is 55%). The doctors are hammering us with empirical data but don't seem to be taking my partner's specific situation into account. Any advice with regards to having mastectomy and radiotherapy would be much appreciated. Thanks",
      "MessageIndex": 0,
      "PostDate": "09/08/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5070-Mastectomy-Radiotherapy?s=1b276477decf6519c562df0329af5289",
      "Title": "Mastectomy + Radiotherapy?"
    },
    {
      "AuthorID": "spoticus",
      "AuthorURL": "https://www.cancerforums.net/members/8973-spoticus?s=1b276477decf6519c562df0329af5289",
      "Content": "Here is the core-biopsy pathology report . . . MACRO 1. R breast cores Specimen consists of two cores of fibrofatty tissue up to 12mm in length. A. 2/ai/levels ; 1. R breast. MICRO 1. Histology reveals breast tissue cores which are infiltrated by a mammary adenocarcinoma of no special type. This shows little tubule formation, moderate to marked nuclear pleomorphism and readily identifiable mitotic figures (modified Bloom and Richardson grade 3 in these cores). There is no convincing in situ disease or vascular space invasion. Slides seen by PBB. SUMMARY RIGHT BREAST CORES - ADENOCARCINOMA (BR). . . . there was a little bit more with IHC results which we don't have a copy of - but we know that it is HER2 3+. After the biopsy was done, a CT scan was done that showed a swollen lymph node in the arm pit. To be honest I don't know what any of the pathology report means. When I asked if the cancer was ductal or lobular I was told ductal. My partner is 32 years old, but has always had a slightly \"eccentric\" heart beat. Thanks for the feedback. Nick",
      "MessageIndex": 2,
      "PostDate": "10/08/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5070-Mastectomy-Radiotherapy?s=1b276477decf6519c562df0329af5289",
      "Title": "Mastectomy + Radiotherapy?"
    },
    {
      "AuthorID": "spoticus",
      "AuthorURL": "https://www.cancerforums.net/members/8973-spoticus?s=1b276477decf6519c562df0329af5289",
      "Content": "We know that the one swollen lymph node was positive because a doctor did a fine needle aspiration on it and it contained cancerous cells. You're right it is Invasive Ductal Carcinoma. It sure takes a while to understand some of the terminology. I have been reading the stats from some studies into post-mastectomy radiotherapy. One study was of women who had 1 to 3 histologically involved axillary lymph nodes, a T1/T2 primary tumour, mastectomy, chemotherapy/hormonal therapy where appropriate and no radiotherapy. The results showed on average 16% of the women in the study had Loco-Regional Recurrence after 4 years. But there were a number of risk factors - for the women that matched those four factors the loco-regional recurrence rate rises to 67%. My partner matches all four of those factors - less than 40 years old, ER -ve, tumour size >= 3cm, lymphovascular invasion. The radiotherapy recommendation is making more and more sense. Nick",
      "MessageIndex": 5,
      "PostDate": "18/08/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5070-Mastectomy-Radiotherapy?s=1b276477decf6519c562df0329af5289",
      "Title": "Mastectomy + Radiotherapy?"
    }
  ]
}