{
  "AuthorID": "still-thinking",
  "AuthorURL": "https://www.cancerforums.net/members/2270-still-thinking?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "still-thinking",
      "AuthorURL": "https://www.cancerforums.net/members/2270-still-thinking?s=1b276477decf6519c562df0329af5289",
      "Content": "I'm 54, had a hysterectomy about 4-5 years ago, left one ovary and had my first mammogram in April. Turns out I need a biopsy on a lump they found in my mammogram, and also in the follow-up ultrasound. I was thinking that it made more sense to me to remove it cleanly in one lump, but one thing bothered me. I had a consultation with the surgeon and asked, \"if they remove the lump and it turns out to be cancer, will they still be able to find the sentinol node, since the lump will already be gone by the time they find that out?\" His reply, \"no problem\". Today I read this in an article: Surgeons inject a blue dye and a radioactive tracer *into the breast cancer before removing it.* These tracers travel to the lymph node where the cancer is most likely to spread first -- the sentinel node. Previous research has shown that if the sentinel node doesn't contain cancer neither will the rest of the lymph nodes. The surgeon finds the sentinel node (it either turns blue, or becomes radioactive, or both) and removes it to examine it for cancer. After reading this, I realized the answer the doctor gave me was not an answer at all. In no way did it tell me how he expected to still do a sentinel test if I needed one, rather it was a statement meant to sluff me off, and possibly only really means it's no problem for him because he can just remove them all and not worry about it. Now, am I crazy or does anyone else see a problem with this? How can you trace the sentinol node by injecting the cancer, if the cancer is removed and you don't even know it WAS cancer until 2-3 days later? Need advice quick, as this was SUPPOSED to happen Tuesday, but I'm getting unsure.",
      "MessageIndex": 0,
      "PostDate": "14/05/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/2943-biopsy-needed-but?s=1b276477decf6519c562df0329af5289",
      "Title": "biopsy needed, but..."
    },
    {
      "AuthorID": "still-thinking",
      "AuthorURL": "https://www.cancerforums.net/members/2270-still-thinking?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi again, I had my surgical removal of the lump in my breast and it is benign. It's been 2 weeks since the surgery, my scar is over the nipple area and I wonder why my breast feels hard inside. I expect it to feel hard under the incision, but not up toward the top of my breast up to the underarm level. You would think I had a breast implant and you were feeling that! Also, he made the kind of stitches that are buried, but the incision area still looks red and blotchy after 2 weeks. I kind of thought it would just be a memory by now, but it isn't. Naturally, I will call the doc, so please don't advise me to do that, I'm really looking for personal experience to compare with what I'm experiencing. I don't like just blindly following whatever a doc says, that's why I want other people's experiences to compare with what he says. Thanks.",
      "MessageIndex": 0,
      "PostDate": "30/05/2006",
      "ThreadURL": "https://www.cancerforums.net/threads/3036-BREAST-HARD?s=1b276477decf6519c562df0329af5289",
      "Title": "BREAST HARD"
    }
  ]
}