{
  "AuthorID": "taggart",
  "AuthorURL": "https://www.cancerforums.net/members/24201-taggart?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "taggart",
    "AuthorURL": "https://www.cancerforums.net/members/24201-taggart?s=1b276477decf6519c562df0329af5289",
    "Content": "Hello everyone, I've been navigating this forum and find it very informative and useful. So thank you to all who have been contributing. My mother-in-law underwent a routine PET/CT scan and from that the doctors noticed a tumor in her brain. My mother-in-law was told that her the tumor was too risky to biopsy or surgically remove and that it is most likely breast cancer metastasis and that they would treat it as such. She underwent a single stereotactic radiosurgery procedure using the Novalis TX machine. Our local oncologist have not prescribed or recommended any types of medication to help with the radiosurgery treatment or to limit the possibility of another tumor popping up, despite our requests. Although our knowledge in the field is limited we have asked about using either Temodar, Metformin and/or Avastin but have been told that for these treatments are out of the so called \"Standard of care\" because she does not have a primary. We have instead been told to she should sit tight, eat healthy and relax for 3 months until another MRI will be performed to see if the procedure worked. Needless to say we are both rather frustrated in our inability to accurately diagnose the tumor and even more so that their isn't something more she could be taking or doing to better the odds and decrease the chance of other tumor sites occurring. I would like any advice on simply, what to do now? Has anyone else undergone this treatment? Suggestions? Thank you for taking your time to read all of this, Cheers",
    "MessageIndex": 0,
    "PostDate": "29/04/2011",
    "ThreadURL": "https://www.cancerforums.net/threads/16932-Novalis-Treatment-check-but-now-what?s=1b276477decf6519c562df0329af5289",
    "Title": "Novalis Treatment, check, but now what?"
  }]
}