{
  "AuthorID": "tamiep",
  "AuthorURL": "https://www.cancerforums.net/members/9089-tamiep?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "tamiep",
      "AuthorURL": "https://www.cancerforums.net/members/9089-tamiep?s=1b276477decf6519c562df0329af5289",
      "Content": "I have never been diagnosed with breast cancer, so I hope that is ok to ask questions here. I was taking a shower yesterday and ran my hand over my breast and found what felt like a long hard cord in my right breast. I thought I was imagining things, so I felt again and sure enough. It runs the length of by breast, which aren't big, from the top to the nipple area. I imagine it feels like a hard vein. It is tender, but only to the touch. I am 45 and breast fed my nearly 5 year old son until he was 3. I don't know if any of this is relevant, but thought I'd throw it out there. I called the doctor's office yesterday and they were about to go home for the weekend and couldn't be bothered with me and just said make an appointment for next week. My mind is going crazy trying to figure this out: is it cancer? blood clot blocking a vein? milk duct clogged? What? Any ideas?",
      "MessageIndex": 0,
      "PostDate": "18/08/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5120-Hard-Vein-(-)-in-Breast?s=1b276477decf6519c562df0329af5289",
      "Title": "Hard Vein (?) in Breast"
    },
    {
      "AuthorID": "tamiep",
      "AuthorURL": "https://www.cancerforums.net/members/9089-tamiep?s=1b276477decf6519c562df0329af5289",
      "Content": "Thanks so much you guys for the encouraging words. I'm kind of embarrassed to say that I cannot find the hard vain thing now. But it was still there up until a few hours ago. I'm still going to go to the doctor tomorrow or Tuesday to see what it might have been. My sister had Hodgkin's so I think I get kind of paranoid sometimes.",
      "MessageIndex": 3,
      "PostDate": "20/08/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5120-Hard-Vein-(-)-in-Breast?s=1b276477decf6519c562df0329af5289",
      "Title": "Hard Vein (?) in Breast"
    }
  ]
}