{
  "AuthorID": "Thoughtful",
  "AuthorURL": "https://www.cancerforums.net/members/42921-Thoughtful?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Thoughtful",
      "AuthorURL": "https://www.cancerforums.net/members/42921-Thoughtful?s=1b276477decf6519c562df0329af5289",
      "Content": "I am a 31 year old woman who has is going through chemo for breast cancer. At the end of the chemo I am due for surgery. Initially it looked like just the lump being removed and now, with genetic testing and being high risk anyway, I've been asked to consider having both breasts removed. I'm told it reduces my chances of getting breast cancer again by 90% - which is such a high percentage I cannot ignore it. I have reconciled with myself that having both removed is the sensible thing but I am scared about having the strength to go through with it and looking at myself in the mirror between surgery and reconstruction. I also worry how it will affect me as a woman and my future self image with my partner. I know there are plenty of others out there who have done this and could give some advice...I do not mean it to sound more worried for how I look than my life, it's more about me as a woman and feeling confident in myself.",
      "MessageIndex": 0,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/25551-Big-decisions?s=1b276477decf6519c562df0329af5289",
      "Title": "Big decisions"
    },
    {
      "AuthorID": "Thoughtful",
      "AuthorURL": "https://www.cancerforums.net/members/42921-Thoughtful?s=1b276477decf6519c562df0329af5289",
      "Content": "A bit late replying, but for those who still have the question, I love being bald! Enjoy wearing scalves too but, and to quote, 'I am what I am'. I have no hair so why pretend. I'm a teacher too, and even the young kids don't bat an eyelid - as for adults who stare, they are jealous they don't have the extra time in bed before work because they have to style their hair! Be brave my friends!",
      "MessageIndex": 6,
      "PostDate": "22/09/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/21886-How-much-did-you-use-your-wig-during-hair-loss-chemo?s=1b276477decf6519c562df0329af5289",
      "Title": "How much did you use your wig during hair-loss chemo?"
    }
  ]
}