{
  "AuthorID": "Trebor",
  "AuthorURL": "https://www.cancerforums.net/members/19299-Trebor?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "Trebor",
      "AuthorURL": "https://www.cancerforums.net/members/19299-Trebor?s=1b276477decf6519c562df0329af5289",
      "Content": "Hello, My wife has stage 4 breast cancer that has gone to her lower spine. We are looking at traditional radiation vs Cyber knife. I cannot find anything using the seaerch function. Does anyone know where I can read peoples feedback regarding the Cyber knife and traditional radiation?",
      "MessageIndex": 0,
      "PostDate": "09/02/2010",
      "Signature": "Robert Martinez",
      "ThreadURL": "https://www.cancerforums.net/threads/12020-Cyber-Knife-vs-traditiona-radiation?s=1b276477decf6519c562df0329af5289",
      "Title": "Cyber Knife vs traditiona radiation"
    },
    {
      "AuthorID": "Trebor",
      "AuthorURL": "https://www.cancerforums.net/members/19299-Trebor?s=1b276477decf6519c562df0329af5289",
      "Content": "Hello cigxman....After checking things out including calling on some of his current patients, we decided that we would give it a try. My wife is on hormone blocking treatments which cause her to have a horrible time controlling her body temperature. We spoke with the Burznski clinic and they continuously said that their treatments have nothing to do with hormone blockers. Although the current treatment was doing good, her quality of life was suffering. She continuously asked Burzynski about hormone blockers and the reply was always. No hormone blocker here. We watched videos, and read every piece of literature they sent. We decided to have Stanford do scans and tests to get a baseline, then we would go through six months of Burznski treatments and re test. If all looked good and her quality of life was better we figured we would somehow come up with a way to pay for it. We were going to have to pay $1500.00 for the initial consultation and then have about $20 to $30 thousand dollars to get started. After that the cost would be about $4k to $6k per month. Still not knowing how we would ever pay for this, we decided to go because we had the about 25k to get started and we figured we would figure out how to get more if needed. We flew to Texas from California on a Sunday night and stayed at motel anticipating the new treatments and hoping that somehow this would be good for us. Monday came, and we were off to start a new chapter in life. Upon getting there, we were greated by very nice people. My wife began to get nervous as she looked around noticing the building and all the beautifull decor. She said, \"I hope this isn't a scam\". Keep in mind that leading up to this moment were three months of hopes, dreams, and talk of how great life would be again. After all she had spoken with some of his paitents. She was convinced that this was for her. One lady said that Dr Burzynski had saved her life, and that she now lives as if she never had cancer. We were elated. Well we sat in an office after paying our $1500.00 and waited in anticipation of the doctor that would pre interview her. It seemed like an eternity for him to show up. Once there he sat down and began to speak of the treatment and how it worked. My wife cut him short saying that we had read and were fully aware of how things worked. She asked him if she could get off the hormone blockers once she started on the program. He said \"are the hormone blockers working for you\" She answered yes, but they make me sick. He then proceeded to tell her that he would not suggest that she stop a treatment that was working. He did say that they could also do the Burzynski program alog side her current treatments. For what gain she asked. He had no go answer. All this within 5 minutes. My wife whom is a very strong person and normally very capable of keeping her composure was crushed. She broke down crying and was falling completely apart right in front of me. In 20 years I've never seen her this devastated by anything. I knew deep in my heart that she had been hoping for a miracle. I also knew that they had strung her along. It was a bad day for us. Maybe they do good work, maybe there are people that owe them thier lives, but my wife was very clear about wanting to get off the hormone blockers. She damanded our money back, they refused. Keep in mind that the consultation did not even go beyond 10 minutes. After about an hour of us refusing to leave without our money, they relented and gave us back $1000.00. It was hardly going to make up for the plane fare, the motel, the food, the fees we would pay for pulling money from ivestments with heavy penalties. The money was one thing, but my wifes dreams and hope for the future were completely destroyed in a matter of minutes, that never needed to happen. I cannot give you a difinitive answer on whether it works. All I can say is that it appears to me that they need to keep a certain number of people coming through to cover the overhead. Burzynski's staff deals with cancer patients everyday. I'm sure that they are no longer capable of reacting to another person crying or for that matter dying. It's just the day to day routine. My wife and I have not said much about the whole ordeal, nor do we even speak of cancer anymore. I don't say anything, because I know that talking about it will bring up the inevitable question. Should we ask the doctor to do another scan? Her doctor, whom she loves seems content keeping her on a program, a program that will continue to work, until it stops working. I dread that day. I wish you luck and I pray for a cure. This post is not an endorsment nor is it meant to deter anyone from checking them out. It is our experience.",
      "MessageIndex": 2,
      "PostDate": "09/10/2011",
      "Signature": "Robert Martinez",
      "ThreadURL": "https://www.cancerforums.net/threads/14865-Burzynski-Clinic?s=1b276477decf6519c562df0329af5289",
      "Title": "Burzynski Clinic"
    },
    {
      "AuthorID": "Trebor",
      "AuthorURL": "https://www.cancerforums.net/members/19299-Trebor?s=1b276477decf6519c562df0329af5289",
      "Content": "Hello, My wife has stage 4 breast cancer. It has moved to her spine, rib, and a spot on a lung. We are currently going to Stanford and she likes her doctor. We are also looing into alternatives. I have done some online research and found the Burzynski clinic. We are currently thinking of trying this clinic. My question, Are there any good places to get paitient testimonials, good and bad? I know that you cannot post links. I just need a point in the right direction. I have done a search on this site and did not get much.",
      "MessageIndex": 0,
      "PostDate": "11/11/2010",
      "Signature": "Robert Martinez",
      "ThreadURL": "https://www.cancerforums.net/threads/14865-Burzynski-Clinic?s=1b276477decf6519c562df0329af5289",
      "Title": "Burzynski Clinic"
    }
  ]
}