{
  "AuthorID": "Winston44",
  "AuthorURL": "https://www.cancerforums.net/members/21119-Winston44?s=1b276477decf6519c562df0329af5289",
  "Posts": [{
    "AuthorID": "Winston44",
    "AuthorURL": "https://www.cancerforums.net/members/21119-Winston44?s=1b276477decf6519c562df0329af5289",
    "Content": "Bone and liver mets. I have looked for months for a site like this to try to help me get my head round this thing. My wife was diagnosed with BC in January 2008. Mastectomy, taxotere and herceptin with tamoxifen. Herceptin has continued, as in July 2009 at age of 46, routine blood tests suggested liver involvement and confirmed on CT scan. Mets to bones on pelvis, rib, sternum, backbone etc, and diffuse cancer to liver. They measured one major area. Placed straight on to navelbein, continued with herceptin, and zometa for bones. Navelbein kept thigs stable for 7 months, but in Jan 2010, started to fail evidenced by rising liver blood tests. Resulting scan showed growth on the largest tumour between October 09 and March 10 of 40% from 6.1cm to 8.7cm which seems large to me. This was to the largest lesion on the liver, and scan said cancer on the liver was still difuse. Moved on to Xeloda. The Onc in April said that would try Xeloda first, then had another one to try after that (Gemzar), but after that, it would be clinical trials. Mercifully, the Xeloda has shown an improvement. The latest scan in July suggests at least a partial response. The small amount of ascites remains stable, and whilst there are multiple low density areas remaining with the liver, but associated contrast enhancement has much reduced. Conclusion was a good partial response. What struck me about this site was the balance of hope and realism. I understand that there are no certainties, any advice can only be in general terms, but even that is better than what I have at the moment which is total ignorance of how things are likely to pan out. We accepted months ago that the prognosis is poor, will not improve, and my wife is almost certain to die from this condition. I try to plan ahead, but it is difficult when I don't know if I am likely to be talking about years, or months. The response to Xeloda is encouraging, but the response to navelbein was only 7 months, 5 months less than the Onc was hoping. We are living life to the full, but some decisions might be slightly different if I knew what the likely timescales were. I appreciate that nobody could possibly be totally confident in any prediction, there are so many variables, but I would be grateful if anyone could give any pointers on likely time frames.",
    "MessageIndex": 0,
    "PostDate": "12/08/2010",
    "ThreadURL": "https://www.cancerforums.net/threads/14049-Liver-and-Bone-Mets?s=1b276477decf6519c562df0329af5289",
    "Title": "Liver and Bone Mets."
  }]
}