{
  "AuthorID": "WorryGirl",
  "AuthorURL": "https://www.cancerforums.net/members/9630-WorryGirl?s=1b276477decf6519c562df0329af5289",
  "Posts": [
    {
      "AuthorID": "WorryGirl",
      "AuthorURL": "https://www.cancerforums.net/members/9630-WorryGirl?s=1b276477decf6519c562df0329af5289",
      "Content": "I went to the doctors today about a sensitive swollen lump under my breast. Even though I've felt it many times, today of all days I could barely feel it. The doctor did a breast exam and said she felt nothing and said that was good. She recommended the ultrasound so that she could see. I'm mad that she couldn't find it though, she thought there might be nothing but I know somethings there. Should I be relieved at all?",
      "MessageIndex": 0,
      "PostDate": "28/09/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5353-I-know-it-s-there-doctor-couldn-t-find-it!?s=1b276477decf6519c562df0329af5289",
      "Title": "I know it's there, doctor couldn't find it!"
    },
    {
      "AuthorID": "WorryGirl",
      "AuthorURL": "https://www.cancerforums.net/members/9630-WorryGirl?s=1b276477decf6519c562df0329af5289",
      "Content": "Hi, I have an appointment scheduled to see a doctor, but I'm trying to ease my fears in the meantime. I have a swollen lump with is painful to touch just under one breast and another one on the other side which I can't see, but I can feel it sometimes. I hear that in many cases if it's painful it's not cancerous but until I get the results of the tests I'm gonna be worried. Can anyone give me some enlightenment? Thank you.",
      "MessageIndex": 0,
      "PostDate": "28/09/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5344-Painful-swelling?s=1b276477decf6519c562df0329af5289",
      "Title": "Painful swelling"
    },
    {
      "AuthorID": "WorryGirl",
      "AuthorURL": "https://www.cancerforums.net/members/9630-WorryGirl?s=1b276477decf6519c562df0329af5289",
      "Content": "Just to add a few details, I'm 24 and I'll be getting an ultrasound, they said that they don't do mammograms at my age. Will they be able to tell me during the ultrasound what it might be or will I have to wait for results? The doctor who I'll be seing is just giving me a script to get the ultrasound, I intend to ask her, however, as much as I can about what she thinks it might be and hopefully I can take her word for it.",
      "MessageIndex": 2,
      "PostDate": "28/09/2007",
      "ThreadURL": "https://www.cancerforums.net/threads/5344-Painful-swelling?s=1b276477decf6519c562df0329af5289",
      "Title": "Painful swelling"
    }
  ]
}