{
  "AuthorID": "13531353",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/13531353",
  "Posts": [
    {
      "AuthorID": "13531353",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/13531353",
      "Content": "hi Moleend. i am soory for reccurency of yuor disease. but itis not to bad .  I am Ali Hooshair proewsor of nursing in iran. my wife has stage 1 invasive lobular carsinoma in her brest too. desion making about your condition is depend on to know yuor exact diagnosis , pathology finding and your imonohistochymestry result absolutly as yuoe health team and your doctor alert tp them. we have  your situation in 2 mounth agoo too.  after consultation fron jhon hopkins university, other doctors such as Dr. keshtgar in london we decide to chmo for extera coution . (my wife tumor is first time diagnosis ) . technical decision making about yuor condition is depend on yuor lab test, type on cytology result and immuno hysto chemical resut. ",
      "MessageIndex": 9,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23014/to-chemo-or-not-to-chemo---that-is-the-question",
      "Title": "To Chemo or not to chemo - that is the question?"
    },
    {
      "AuthorID": "13531353",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/13531353",
      "Content": "hi Moleend. i am sorry for reccurency of your disease. but itis not too bad .  I am Ali Hooshair profesor of nursing in iran. my wife has stage 1 invasive lobular carsinoma in her brest too. decision making about your condition is depend on to know your exact diagnosis , pathology finding and your imonohistochymestry result absolutly as your health team and your doctor alert to them. we have  your situation in 2 mounth agoo too.  after reciving consultation from jhon hopkins university, other doctors such as Dr. keshtgar in london we decide to chmo for extera coution . (my wife tumor is first time diagnosis ) . technical decision making about yuor condition is depend on yuor lab test, type on cytology result and immuno hysto chemical resut.  excuse me because of my writting fults in first message. It is  resendg corrected version of my message to you . by best wishes and hope of  helth and wellness.  A.hooshiarPhD.MSN,RN",
      "MessageIndex": 10,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23014/to-chemo-or-not-to-chemo---that-is-the-question",
      "Title": "To Chemo or not to chemo - that is the question?"
    }
  ]
}