{
  "AuthorID": "1Caroline",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
  "Posts": [
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Flower, you really sound like you have been through it lately.  I think what some others are saying is that you might have to hold something back for yourself.  This whole Cancer business has really made me re-evaluate people and things that I can let go of.  Try not to worry too much.  You sound like a strong person and no matter what is ahead, (OR NOT) you have the strength to get through it.  Also, it sounds like you had a lucky escape from the guy you were introduced to.  I hope the future offers you more possibilities.  I am sending you a BIG HUG (((()))).xxx",
      "MessageIndex": 7,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85820/feeling-totally-demoralised",
      "Title": "Feeling Totally Demoralised!"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Dreamthief, yes I mean Radiotherapy.  I had to see an Oncologist for this who is going to get my planning session started soon.  It was all in the same department.  I wonder if anyone can share what the Radiotherapy was like because I am feeling quite vulnerable.  My usual support systems have vanished and this board seems like my only hope.  I do feel guilty actually, because I am not having Chemotherapy and I know so many women on here seem to be much worse than me.  Thank you for reading my post.  All the best to you.",
      "MessageIndex": 2,
      "PostDate": "12/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82529/about-to-start-radiotherapy-in-a-couple-of-weeks-help",
      "Title": "About to start Radiotherapy in a couple of weeks. Help!"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi everyone, I am still recovering from my second WLE 5 weeks down the line.  I'm driving and doing my thing but the pain still catches me by surprise.  Is this normal?  Anyway, I saw the Oncologist yesterday (who was quite arrogant - nothing like my lovely Surgeon) and am wondering what to expect.  I already felt quite wobbly yesterday when I walked into the Oncology Department anyway and his attitude did not help.  It somehow makes this disease all the more real seeing the word ONCOLOGY in black and white. Also seeing people hooked up and having Chemo shocked the hell out of me! But what did I expect to see? So I am just wondering now if anyone can share their experience of what Radiotherapy was like please because it might take some of my fear away. I understand that we are all different though.  Apart from my Hubby and a couple of friends who have visited the support I thought I would get is not there.  People have disappeared.  As a result, I have even fallen out with my parents.  Shocked that this could happen now, but I am re-evaluating things from here on in.  Thanks for reading. Caroline.x",
      "MessageIndex": 0,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82529/about-to-start-radiotherapy-in-a-couple-of-weeks-help",
      "Title": "About to start Radiotherapy in a couple of weeks. Help!"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Thank you so much for your replies.  Dreamthief, you are so kind to give me such a full and lengthy explanation.  I will certainly read the links that you have attached in your post.  Its good to know that it is do-able.  I will have a lift from my Husband when he is not working, but otherwise, I will have to make my own way to the Hospital.  Your information regarding parking is very useful.  Thank you. April I appreciate your reply and I do hope that all is going well for you back at work.  I am off work for now and it feels quite daunting to think about work at the mo.  Good luck with your recovery. Fiddly Fingers - I understand about the emotional rollercoaster you describe.  I wonder if some of the extra wobbly days are due to fatigue from the Radiotherapy you have had?  When I am tired, everything seems so much worse.  Best of luck to you.  Thank you for your reply. I don't feel as frightened as I did about it now which has helped me.",
      "MessageIndex": 6,
      "PostDate": "14/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82529/about-to-start-radiotherapy-in-a-couple-of-weeks-help",
      "Title": "About to start Radiotherapy in a couple of weeks. Help!"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hello Flower, Wow, you sound so happy.  Good for you.  It seems like its been a long journey for you so you deserve this good news.  I am only at the beginning of my journey and I have my WLE on Wednesday.  I feel reading your post and the responses have given me some hope.  Take care of yourself.  xxx",
      "MessageIndex": 7,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78856/first-review-mammogram---it-can-be-done---success-yippeee",
      "Title": "First Review Mammogram - It Can Be Done - Success! Yippeee"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Aroma Mum, Sorry you are so upset at the moment.  It seems like sometimes hospital staff actually forget that the people who come in for tests/procedures etc. may actually be frightened and vulnerable.  I had a pretty awful time when I had my surgery recently so I understand how distressing this can be.  Let's hope the next time you visit the Hospital that you are treated with kindness and compassion, qualities that seem to be missing at times.  All best wishes to you.  Caroline.x",
      "MessageIndex": 5,
      "PostDate": "14/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79641/ecg-feel-exposed",
      "Title": "ECG feel exposed"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Debden,  sorry you are going through this.  I've just had my WLE 2 days ago.  It is a worry though when you feel twinges elsewhere.  As someone else said, maybe contact someone just to get it checked out.  Wishing you all the best.  Caroline.x",
      "MessageIndex": 4,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79137/bloody-cancer",
      "Title": "Bloody cancer!"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hiya,  I think anything is possible and it sounds like your operation was a big one.  I've had 2 WLE in 4 weeks and I know this has affected my BP.  I'm glad your reconstruction went well and you are pleased with how you look.  Very encouraging.",
      "MessageIndex": 3,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81263/anaesthetic",
      "Title": "anaesthetic"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Maddog,  I know its really disappointing when the margins are not clear.  I had two WLE's but the Surgeon got clear margins so I have kept my breast.  Its a very worrying time for you but somehow you will keep going, as we all do.   Good luck with everthing.  Caroline.x",
      "MessageIndex": 11,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83381/disappointed",
      "Title": "Disappointed :("
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Spammie, it really does sound like a very difficult situation you are in right now.  I think that having this diagnosis really does make you examine what's important in your life and WHO is important.  I was diagnosed 4 weeks ago but already I'm re-evaluating things.  However, I'm not sure if you have other people around you who can support you?  You say you want to do this alone, and it sounds like you want some space.  It is certainly a very difficult time to make concrete decisions.  Only you know how unbearable it is to have your Husband around, but sometimes we all need help even if we are the \"Do'ers\".  I wish you well going forward.  Caroline.x",
      "MessageIndex": 4,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79197/where-do-i-go-from-here-part-two",
      "Title": "Where do I go from here, part two"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Chiara98, so sorry you have found yourself here, you sound like a good Daughter.  Anyway I just wanted to wish you all the best with your information finding.  I think this is a good site because a lot of the ladies on here have been through quite a lot of treatment and can offer you help in finding out more.  I wish you and your Mum well.  Take Care.  Caroline.x",
      "MessageIndex": 2,
      "PostDate": "06/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79267/brest-cancer-grade-3",
      "Title": "Brest cancer grade 3"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "I can't believe that I have breast cancer.  I know it is a reality but its been 2 weeks since diagnosed with DCIS High grade.  Surgery in week and half.  I already knew before they confirmed it after my mammogram screening picked something up.  I am worried that it has already spread, because I have never been a lucky person.  Is this a normal reaction, to imagine the worst?  Just wondered if I was the only one like this.  Help pls.  Best wishes to you all.  Still trying to navigate this board.",
      "MessageIndex": 0,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78551/i-feel-shellshocked",
      "Title": "I feel Shellshocked."
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hello everyone, I was overwhelmed by your kind words and the fact that you have taken the time to respond.  I had my pre-op yesterday and was told very little.  My Consultant told me that it will be a WLE with extra breast tissue to check. Then if all is clear I'm due to have Radiotherapy.   As I said I haven't been a lucky person this far in my life (no Children after years of IVF) Many years of Endometriosis resulting in Womb and Ovaries going 5 years ago and the list goes on...  I thought I'd had my share already.  Anyway, I do have some good people around me who are trying to understand and give me positive support.  The thing is I don't even know how I feel right now.  I had to come off my wonderful HRT and that has really upset me.  I keep eating loads of chocolate normally I watch what I eat but I don't seem to care at the mo. What's the point?  I was putting moisturiser on my skin the other day and I thought Why bother? Mustn't start that self pity though, that's not going to help.   My surgery is next week and I have just got back from GP with anti-biotics for a bad cough/chest.  I hope it clears before next week.   Everyone on here sounds so brave, when I've read what you have all been through I feel humbled.  I hope I can be brave as my GP told me to be today.  I simply feel odd, like I want to protect myself.  I'm not even crying which is odd.  I'm sure more feelings will really surface as my treatment unfolds.  Thank you all for your wonderful support.  I hope that I can be there for you soon. xxx",
      "MessageIndex": 11,
      "PostDate": "24/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78551/i-feel-shellshocked",
      "Title": "I feel Shellshocked."
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Kazzie you sound very upbeat.  Thank you for your support especially with what you have just been through.  I may message you soon. Take care.",
      "MessageIndex": 20,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78551/i-feel-shellshocked",
      "Title": "I feel Shellshocked."
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Sandi14 so sorry to hear you are also feeling a bit frantic.  I hope the MRI results are not bad for you.  I think you are right, in the dead of night is a really bad time.  One thing I'm trying at the moment is distraction.  When I wake at night, I'm putting on my radio or watching Youtube on my phone.  Its a Godsend right now.  Anything to stop the internal chatter which is always worse in the dead of night.  My surgery is on 2nd so you will be a couple of days later.  Let's hope neither of us goes out of our mind before then.  The waiting is terrible.",
      "MessageIndex": 19,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78551/i-feel-shellshocked",
      "Title": "I feel Shellshocked."
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Lyndsey,  It sounds like you are getting some support from these boards so I wanted to add mine.  I'm sorry this has happened to you because you are so young.  It is a shock to get this diagnosis and it can dominate your thoughts.  I have thought of little else some days since 6th June.  One thing that is helping me a bit is to keep distracted.  Loud music some days blocks out my chatterbox in my head.  Also in the dead of night, when it can be very scary I watch Youtube films on my mobile, so I don't wake up my Husband.  This has been a Godsend because I am a terrible sleeper.  Hope this is of help to you.  All best wishes.  Caroline.x",
      "MessageIndex": 22,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79908/new-to-this-page-diagnosed-on-20th-june-aged-33",
      "Title": "New to this page! Diagnosed on 20th June aged 33!"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Lyndsey,  It sounds like you are getting some support from these boards so I wanted to add mine.  I'm sorry this has happened to you because you are so young.  It is a shock to get this diagnosis and it can dominate your thoughts.  I have thought of little else some days since 6th June.  One thing that is helping me a bit is to keep distracted.  Loud music some days blocks out my chatterbox in my head.  Also in the dead of night, when it can be very scary I watch Youtube films on my mobile, so I don't wake up my Husband.  This has been a Godsend because I am a terrible sleeper.  Hope this is of help to you.  All best wishes.  Caroline.x",
      "MessageIndex": 7,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79908/new-to-this-page-diagnosed-on-20th-june-aged-33",
      "Title": "New to this page! Diagnosed on 20th June aged 33!"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hello Mel,  I just want to wish you all the best for the next phase in your treatment.  It must be very scary for you, but given what you have already been through, you sound strong at the moment.  All best wishes.  Caroline.x",
      "MessageIndex": 2,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80010/chemo-starting",
      "Title": "Chemo starting"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "I have had 2 WLE's in 4 weeks and am feeling a bit down.  The pain is much worse this time and I feel like a wimp.  I'm still on full wack of pain relief but it is so sore.  I'm also waiting for the results which if margins are not clear this time, it will mean mastectomy. I have high grade multi-focal DCIS so I didn't know that a Mastectomy was ever going to be on the cards for me.  The Consultant mentioned it in passing just before I went in for Surgery this time.  I know I'm jumping the gun, but I don't seem to be very lucky health wise so I'm trying to prepare myself, if its possible to prepare to lose a breast.  To the Ladies who have gone through this how do you cope?  I already lost my womb and ovaries and have no children and don't feel like much of a woman some days.  My Hubby says I'm lovely, so I have to hold onto that.  I read the posts on here and am amazed and humbled how everyone seems to cope.  Is it agony?  Sorry for waffling on.  Not too great at the mo.  My family support is also patchy so feel a bit alone while Hubby at work.  Wishing you all well.  Caroline.",
      "MessageIndex": 0,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81236/2-wle-and-waiting-for-results",
      "Title": "2 WLE and waiting for results."
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Thank you Sussex and Daisy.  It is nice of you to reply.  I'm not the only one who worries too much.  Its good to hear of someone also who has been through the Mastectomy and you sound quite positive about it.  It also sounds as if the pain was quite manageable for you which is good news.  Sussex, it must have been hard without the support you needed, but your Dad is starting to come around now.  I think this experience is hard enough so its important to feel that you are not alone.  I sometimes feel that because I have already had so many illnesses that family and friends are just bored of it.  My Cancer is just another thing in a long line.  One thing that has surprised me though, is that some poeple who I did not expect to support me with texts and occasional phone calls have really been there for me which has been a nice surprise.  However, those who I expeced support from have run a mile.  Oh well, I am grateful for my Husband who is so wonderful and supportive.  I will take heart from your comments and hopefully tomorrow will be a better day all round.  All Best wishes.  Caroline.Enter your message...",
      "MessageIndex": 3,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81236/2-wle-and-waiting-for-results",
      "Title": "2 WLE and waiting for results."
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Wow, I have just read Dr. Harvey's essay on what happens after treatment is over.  It is extremely powerful and has moved me to tears.  I still have to face my Radiotherapy in a few days, but I will keep reading this from time to time and I know it will give me something to cling on to.  Hope you are well.  Caroline.x",
      "MessageIndex": 3,
      "PostDate": "28/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83436/i-fell-apart",
      "Title": "i fell apart"
    },
    {
      "AuthorID": "1Caroline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/1caroline",
      "Content": "Hi Karan,  Just sending you a hug as you seem to need it.  I don't have any answers but hopefully it will not be anything to worry about.  I had a terrible day yesterday because I'm waiting to see if I need a Mastectomy, and it is that 1% that will do it every time.  Take care.  Caroline.",
      "MessageIndex": 3,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81248/in-need-of-some-reassuring-words",
      "Title": "In need of some reassuring words!"
    }
  ]
}