{
  "AuthorID": "2014sara",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/2014sara",
  "Posts": [{
    "AuthorID": "2014sara",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/2014sara",
    "Content": "Hi My Mum had a mastectomy and lymph nodes removed just over 3 weeks ago.  She was in hospital overnight and was discharged the next day whilst the drain was still in.  She too was given a bag to keep the drain in and was pottering around at home.  She was taking paracetamol and codeine for several days to help with the pain.  However she didn't need to take the maximum dose every time.  As for her drain. she kept hers for a week because when they checked it approx 3 days after her op she was still draining quite a bit of fluid.  Nothing to worry about, but they decided to leave it in for a further 3 days.  Whilst the drain was in, my Mum didn't want to go out but she wasn't really up to it anyway - very tired and feeling the effects of the anaesthetic. She is still taking things easy but is gradually starting to do more things.  She did find that in the early days after the op, simple things, such as the effort of making conversation with family/visitors would be very tiring.  So don't be surprised if you feel very tired after doing something you would normally take for granted.   There were a couple of surprises in the days after the op which I thought might be useful to mention, Mum occasionally gets a phantom itch/tingling in the breast that was removed.  It wasn't painful, just \"odd\", as without thinking she tried to scratch it.   The other thing is that after about a week the pain/discomfort had really subsided, but then after a few days it came back again.  The pain she had was in the back of her arm, so we think it is more to do with the lymph node removal.  We spoke to the cancer team and they said its possibly nerve damage in the arm but your body will either heal in time or your brain will will get used to it and learn to overcome it.  In the meantime Mum increased the painkillers for a few days and it has since settled down again.  So mum is now just taking the occasional paracetamol. It may be coincidence but the pain settled down after we saw the consultant for follow up and to find out what stage her cancer was etc.  I'm pleased to say we had good news and maybe hearing something positive had a positive effect on Mum's pain too!  We always find the waiting is the worst bit! Good luck and all the best! PS, we all went out to a favourite pub for a great meal as soon as the drain was out.  :)",
    "MessageIndex": 10,
    "PostDate": "19/08/2014",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81472/mastectomy--1day-to-go",
    "Title": "Mastectomy -1day to go"
  }]
}