{
  "AuthorID": "603232",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/603232",
  "Posts": [
    {
      "AuthorID": "603232",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/603232",
      "Content": "Gilly, do not even think of recon as being vain, reconstruction is returning to normal. I had a double nipple sparing mx with LD reconstruction with implants as I had 34 dd breasts. I was hoping for a one step operation but it turned into a good few steps as the first implants were too small and my breast skin was hanging off them. The second was to replace with expanders and the third to replace with larger permanent implants, 500's. I find these quite heavy, I did have the option of having the skin size reduced but this would have left visible scars which I did not want. I have since read about light weight implants called B Lites, which would be a great improvement, ask yours PS about these.. After the main mx and reconstruction I felt like I had been hit by a bus. I don't think that I am a wimp as I have had 4 C sections and went back to work five days from my last C section operation, but then I suppose it is not negatively emotional as you have a baby to show for it. It has taken me two years, after the LD op, to be able to dig a hole with a trowel. The weakness in my arms is ongoing, the upside is that my stomach is flat as I have had to compensate by using them instead of my arms. It has been a long road to recovery, I have always been fit this was a big shock to the system. I had a frozen shoulder which I gather happens quite often. That is the negative side, now to the positive side, I have a great pair of boobs, a complete overhaul on the NHS. Would I do it all again in hindsight, YES. It was a no brainier really, risk reducing surgery, great boobs. The option of implant only had a risk of skin necrosis, the skin of my breasts and nipples and areola dying versus LD which would possible give weakness in the arms only. I chose LD reconstruction and would do the same again. I hope this gives you some insight into the operation as I don't think the PS or PS nurse or booklets prepare you adequately. Get a V pillow, I still have a small pillow that I cuddle, partly to rest my arm and partly rest my boobs on, it helps. Also find heavy duty total support bras, in your current size and a size larger, bras size and cup size as you will be quite swollen for a while. It will be quite like wearing an iron bra for months, a bra that you can't take off because it is your own body. I wanted to ask, \" when will I feel naked, when I am naked\". The answer for me was a couple of years. But please don't let me put you off. It is like having a baby - well worth the pain and effort. Good luck and please post updates for other ladies like yourself who will want to know all about it. Xxx",
      "MessageIndex": 23,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73343/mastectomy-and-ld-flap-reconstruction",
      "Title": "Mastectomy and LD flap reconstruction"
    },
    {
      "AuthorID": "603232",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/603232",
      "Content": "I went to a breast consultant with a lump which turned out to be a harmless cyst, I had a mammogram, scan and the cyst drained. Less than a year later I had a call up for a mammogram, thinking I am fine, I went and was called back. They said that I had calcification which were brighter than on my previous mammogram, did a biopsy and said I had DCIS. Then a lumpectomy which revealed not only DCIS but a small 4mm invasive cancer. I opted for a risk reducing nipple sparing double mastectomy with reconstruction, best decision that I made, they look good and they found more cancer. It is a journey which doesn't necessarily end badly, it could be something, it may be nothing. I find it better to look at the worst scenario and decide what my options will be so I know where I am going should the worst happen and I am ready for it, not floundering trying to make decisions. It is all too emotional and once emotion takes hold your logical, sensible mind goes out the window and you become a blithering idiot, or at least I know I do. So I make the decision beforehand, whist I am still thinking logically, before the actual diagnosis. I had already made my decision to have a mastectomy before the results from the lumpectomy. I find it helps me to focus on something. Good luck, I hope you find yours is much ado about nothing.",
      "MessageIndex": 4,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73781/awaiting-results-and-bewildered",
      "Title": "Awaiting results and bewildered."
    }
  ]
}