{
  "AuthorID": "680511",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
  "Posts": [
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Hi Yvonne, Firstly I'm sending you a big hug of support. If today is your worst day then tomorrow can only get better. I sometimes hyperventilate when I think about it - I am yet to crumble but I know for sure the day is going to come. Your hubby will totally understand your emotions - just as you would if it were him. Wishing you good luck with your treatment. Xxxxx",
      "MessageIndex": 7,
      "PostDate": "05/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77773/very-very-bad-day",
      "Title": "Very very bad day"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Hi Joanne, It's rubbish isn't it? It's most definitely a time of confusion and uncertainty. These forums are a lifeline when you are feeling alone and scared. It's good to hear from people who are a bit further down the line and are proof that you can and will get through it. I think we need to cry when we feel like it (I can't watch anything on tv today without crying even though I have hardly cried since being diagnosed!). Be prepared for your surgery - it's not as bad as expected but as someone else has said the post surgery exercises are very important. I'm not sure if you are aware but some women also have to go back into hospital for more surgery after a WLE for further surgery - I'm heading back in next week. Do some search and familiarise yourself with the terminology surrounding BC - prepare yourself for your results and don't be afraid to ask your surgeon or BC nurse anything at all. I usually find my questions can be answered here as someone else has usually been there, done it and is wearing the t-shirt! Be strong - You can kick cancers butt! Xxxxx",
      "MessageIndex": 12,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Hi Alfieval, My pain has got much better today thank you, it's just a matter of persevering with the exercises. I have more surgery on Tues but I'm so convinced I'm in for a much faster recovery than my last surgery that I've booked a weekend away in London for next weekend! Cancer has turned my life upside down over the last 6 weeks or so - I''m going to rule cancer and not let cancer rule me from now on :-) Best of luck with your surgery. Xxxx",
      "MessageIndex": 52,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Hi Joanne, I also found it really difficult to tell family and friends - I had to stop telling friends as they're reactions were so strong I ended up comforting them even though I was the one who had been diagnosed. I had to ask friends to spread the word on my behalf - they have been so supportive though. One of the difficult things has been telling my boys - 12 & 14 - I think children immediately link cancer to death so that was difficult. My husband has been fab but it breaks my heart to see the worry in his face - when they confirmed it was cancer it was as though someone had punched him in the face with it. I guess in hindsight staying strong for everyone else has stopped me crumbling although I still have a private wobble occasionally. My brother passed away last year - aged 45yrs and we lost my father in law in Jan to lung cancer so the last 10 months have been rather difficult. To say I am looking forward to 2015 would be an understatement! If you do have any questions you should ask them - if you let it all build up in your head you will feel like its going to explode. This is where this website will become your lifeline. You are still dealing with the shock at the moment - I started to feel better as soon as I arrived at the hospital for surgery, I suddenly felt strangely calm and in control. I had a few tears when I was wheeled down for surgery but apart from that it was fine. You have to accept that you have cancer and that you need to buckle up for the ride - it will have its highs and its lows and you will feel different about it each day but along the way we'll all be here for you to hold your hand. Stay in contact on here - it will be good to hear how you are getting on. Keep your chin up and try to enjoy the weekend as best you can. Xxxxx",
      "MessageIndex": 16,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Hi Alfieval, I also suffer with a shoulder problem - I have done for about 6 years. The exercises can be done at a very gentle pace but you may need a bit of extra help. I would mention it to your BCN - she may be able to refer you to a specialist Physio. On the positive side though you may not suffer with any post surgery pain - not everyone does. I find having a warm bath in the morning and warming up the surgery side of the arm by using it wash myself helps loosen it up. In do the exercises as soon as I get out of the bath. I do a little bit of light dusting before the afternoon session - again to losses it up a bit then I usually have another bath or a shower before the evening session. Also, try not to do the eve session too late. If you do suffer with pain always take your pain killers 30mins before you do the exercises. Good luck with your surgery. Lots of love. Xxxx. Ps. Mention your shoulder problem to the surgeon and he/she might reconsider the position of your arm during the surgery. Xxxx",
      "MessageIndex": 22,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Hi Alfieval, Statistics show that just 5 out of 100 people will experience pain after a SNB. Us girls are the unfortunate minority who are discussing our level of pain on here - the majority have no need to post :-) The girls I shared a ward with have not experienced any pain at all :-) Please don't worry about it too much. Xxxx",
      "MessageIndex": 49,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Frances, Having one of those days? This site is proof that you are not and never will be alone. I was diagnosed a few weeks ago and I have found that it doesn't matter how you feel, someone else on here is either feeling the same or has felt the same as you are feeling today. I had a mini meltdown first thing this morning and almost posted but instead I made a cuppa and had a nice bath - I really know how to live! You will have good days and bad days but just roll with them. Support groups are a good idea if you do not have any friends who have been through cancer themselves. I find no one really understands your worries and fears as much as someone who has had the same feelings as you. I chose to decorate my bedroom which has given me a focus throughout the experience - maybe you can find yourself a project to give you a focus to help you through. Stay strong lovely. Lisa xxxx",
      "MessageIndex": 6,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77894/feel-alone",
      "Title": "feel alone"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Hi Lisa. Peppermint tea - I found this to be the easiest thing to drink first thing in the morning - with my ginger biscuits! I suffered with severe sickness on my first chemo but I think it was down to having too much to eat before chemo so I would recommend a very, very light snack before your treatment. I have only had 1 chemo so far but my nausea lasted for approx 5 days. I did find that grazing almost every 2hrs helped the nausea. I grazed on pineapple, apple slices, small chunks of melon and blueberries. I also froze some strawberries which were quite nice to nibble on. I did find I only wanted to eat cold food too. You may find you do not have an appetite - I would only sometimes manage 4 mouthfuls of an evening meal but even if you feel nauseous try to eat - it really does help. I also walked everyday - very slowly for the first few days but exercise is so important in aiding your recovery. Don't forget to drink water - lads of the stuff :-) Good Luck - it's rubbish but so doable. Xxxxx Oh and almonds! They give you a great boost much needed of energy! Xxxx",
      "MessageIndex": 12,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80859/shopping-list-for-chemo---am-i-missing-anything",
      "Title": "Shopping list for chemo - am I missing anything?"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Don't feel silly - I do that kind of thing on a good day! You're not the first and you won't be the last :-) Lisa xxxx",
      "MessageIndex": 7,
      "PostDate": "17/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78317/hope",
      "Title": "Hope???"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Fantastic response Anne - Marie! Get those gloves on Angel and give it all you've got! Xxxx",
      "MessageIndex": 10,
      "PostDate": "22/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78551/i-feel-shellshocked",
      "Title": "I feel Shellshocked."
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Hi all, My BCN has told me I can drive 2 weeks after WLE and SNB - I am still experiencing a lot of armpit and upper arm pain but was thinking of driving myself to the doctors today. I have checked with my insurance and they will insure me as long as the BCN assures me it is ok to drive. My friends who have also had the same surgery were told they should not drive until 4 weeks after surgery. Any advise please? Thanks Lisa",
      "MessageIndex": 0,
      "PostDate": "05/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77747/how-soon-after-a-lumpectomy-is-it-safe-to-drive",
      "Title": "How soon after a lumpectomy is it safe to drive?"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Thank you ladies. Take care xxxx",
      "MessageIndex": 3,
      "PostDate": "05/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77747/how-soon-after-a-lumpectomy-is-it-safe-to-drive",
      "Title": "How soon after a lumpectomy is it safe to drive?"
    },
    {
      "AuthorID": "680511",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/680511",
      "Content": "Gosh what a lovely guy! Paul...... you sound as though you could use a shoulder to cry on going through all of this. Wishing you good luck and good health. Xxxxx",
      "MessageIndex": 2,
      "PostDate": "19/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78431/still-here-for-anyone",
      "Title": "still here for anyone"
    }
  ]
}