{
  "AuthorID": "8383susie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
  "Posts": [
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi there   I had a lumpectomy in 2009 and still get the odd pain in my boob. It was very painful for quite some time. I was told by my Oncologist that when you have a lumpectomy they cut many nerve endings. When these start to repair and the feelings come back they can be very painful. She said that it can take up to 2 years for everything to get back to \"Normal\" as far as the nerves are concerned.   I hope your pain goes away soon Sue x",
      "MessageIndex": 8,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46641/boob-pain-1-year-on",
      "Title": "Boob pain 1 year on."
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi Janice Is there something you are suffering with in particular?   I really had a bad time with the T part of my chemo. I had terrible mouth ulcers the first round and I got some Diflam mouth wash from my GP. this is excellent stuff and really helps. You can now buy it over the counter but as we get free prescriptions you may as well ask the doctor or nurse for it. I also had bad pains in my legs. I discussed everything with my breast care nurse and the 2nd round was reduced in strength to help with the side effects. Have you someone to discuss this with.   Best Wishes Sue    ",
      "MessageIndex": 1,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46739/fect-t-part-and-it-s-side-effects",
      "Title": "FecT-T part and it's side effects"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi Lorraine Your taste buds will definately be affected by the chemo. I hated the taste of everything and had a few mouth ulcers. when my friend had ulcers she used to eat pineapple. This helped her but not me but it is worth a try. The other thing I found was that the steroids really made me hungry but I didnt fancy anything so it was a catch 22 situation. Everyone is different but anything is worth a try. Chemo is not a nice thing to go through but it is doable and everyone gets through it in the end. Good luck and best wishes. Sue",
      "MessageIndex": 2,
      "PostDate": "19/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36467/what-s-best-to-eat-while-on-chemo",
      "Title": "What's best to eat while on Chemo??"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi there I was diagnosed with grade 3 HER+ in 2009 and my lump was 5 centimetres. I had a lumpectomy and 2 lymph nodes removed which were clear and then I started 6 FEC-Ts and 18 radiotherapys and 18 Herceptins. I never questioned my treatment as I believe rightly or wrongly that the docs know more than I do. They deal with this terrible disease day in and day out. My Oncologist told me that the surgeon had saved my life and he would prolong it with the best treatment available. Sometimes it is not good to over annalise everything you read and you must trust the sites where you are getting the information from. My oncologist gave me a choice whether to have chemo etc but he did say he would guarantee if I didnt then the cancer would be back within 3 years if not sooner.That was good enough for me as any chance of keeping it at bay I would take. Now I have finished treatment, my hair is growing back I am back at work and my strength is getting there. I wont pretend it was easy but it is doable. Take care Sue",
      "MessageIndex": 2,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39996/concerns-about-chemo",
      "Title": "Concerns about chemo"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi Zena I had 6 rounds of FEC-T chemo followed by four and a half weeks of daily radiotherapy which finished in July. I too wasn't told about the radiotherapy at my intial consultation. I am on a year of Herceptin. After I finished my radiotherapy I had what I can only describe as a melt down. Things started to happen very slowly, I didn't get to see the consultant so much and I felt I was on my own. The Oncologist told me this was perfectly normal. I haven't had any scans and now don't even have any blood tests. when I asked why I was told that they would only scan me if there was reason too. I was also told now the only thing I will probably have is yearly mammograms.I haven't had a masectomy but from friends that have know that it is not good to have radiotherapy when you have had a reconstruction so that is why they do it that way around. 5 years for Tamoxifen is the normal. Have you a breast care nurse that you can talk to and ask all the things that are worrying you. I am sure that everything you are experiencing is the norm. BW sue",
      "MessageIndex": 1,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32717/why-am-i-scared-now-as-i-am-coming-to-end-of-my-chemo",
      "Title": "Why am I scared now as I am coming to end of my Chemo?"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi tina Haven't tried it myself but there was a big article yesterday in the daily mail where a women was told there was no treatment for her but then she tried Avastin and has now been in remission for 18 months. It has been turned down by NICE as its £20,000 for ten months worth of treatment and is only available to private patients so I think if you have the opportunity to try it then I would. I am on Herceptin but my husband says if that doesn't worth and they recommend Avastin then we would borrow the money from somewhere.   Good Luck BW Sue",
      "MessageIndex": 1,
      "PostDate": "25/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30795/any1-tried-avastin-for-bc",
      "Title": "Any1 tried Avastin for BC ??"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi tina Sorry to hear you need more chemo. I had 6 x FEC-T and I was glad when that was over. I also had 4 and a half weeks of radiotherapy which was very harsh and left me with no skin and very sore. all healed up now though. At the moment I am having trouble with the Herceptin side effects as its affecting my heart. Got to have another heart scan next week and then they will decide whether to carry on, have a break or stop it altogether. I have had 5 months worth and would feel okay to stop if I have one more as there is no evidence that after 6 months it gives you any more chance of beating the cancer. No hormone treatments needed. My cancer was grade 3 and I was told without all this treatment it would come back within 3 years so I am just doing what the experts say and hoping for the best. Good luck.Definately think Avastin is worth a try if they say so. Take care. BW Sue x",
      "MessageIndex": 3,
      "PostDate": "27/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30795/any1-tried-avastin-for-bc",
      "Title": "Any1 tried Avastin for BC ??"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi Shelly   First of all sorry you have had to join this group but you will find lots of support and advice. Have they told you your results yet i.e. what type, what grade. I had grade 3 breast cancer and they didnt look at my lymphnodes until they did my lumpectomy. I then had two nodes removed and was lucky enough after examination not to need to have anymore removed. I also didnt see a Genetics person for quite some time. I work at a hospital and I know it can be very frustrating but they do unfortuantely have a lot of patients waiting for surgery which doesnt help you at all. do you know the doctor at the other hospital that they referred you to 3 weeks ago. If so ring his secretary and make sure they have received it. In most cases the secretary will offer to help with this. Have they discussed any other treatments, have you been told a treatment plan. Please ring the breast care nurse when you feel up to it and tell her all your worries, thats what she is there for. while going through all my treatment I used my nurse for all my worries and didnt care if I was a nuisance. Its your mind and body. It does take time for them to work out the best treatment for each individual. Take care Keep posting if your worrying or need an opinion on anything Sue x",
      "MessageIndex": 3,
      "PostDate": "20/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51729/confused-at-the-moment",
      "Title": "Confused at the moment!!!"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi there I have just finished a year of Herceptin and had heart problems almost straight away and the only thing I noticed was that I was quite tired. Have been on two different heart pills. It is very rare that they stop the herceptin completely forever but just give it a break sometimes. I never had this as the tablets did their job. also my consultant said that although the Herceptin affects the heart function you would not have  a heart attack or anything like it. I have also just had a bone scan this is usually always done after chemo as the chemo affects the density of the bones and some people need extra calcium tablets. Good luck and hope your treatment goes without any more hiccups. sue",
      "MessageIndex": 4,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/37259/heart-problem-whilst-having-herceptin",
      "Title": "Heart Problem whilst having Herceptin"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi there I hadnt started the menopause by the time I started chemo (I was 51) and my peroids stopped after the second round. The chemo made me start the menopause and I now dont have peroids. Everyone is different and it all depends on which chemo you are having. BW Sue",
      "MessageIndex": 1,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36609/chemo-and-periods",
      "Title": "chemo and periods !"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi Carol glad you are feeling a little better and you are right listen to your body, eat when your hungry and rest when your tired. Simple I know but I over did it a few times cos I wanted to feel \"Normal\" and I paid for it the next day. What chemo are you on? Definately ask the nurses if you are suffering. I had trouble with mouth ulcers for one of my treatments and the nurses came up with a mouthwash and all sorts of remedies to help. Take care. Stay positive. Sue  ",
      "MessageIndex": 3,
      "PostDate": "12/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36269/nausea",
      "Title": "nausea"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hi there Sorry you have had to join us but there is very good support on here when you need it. Did the hospital give you sickness tablets in case you felt sick. I was told by a nurse to take these from day one even if I didnt feel sick because they would help and can honestly say I rarely felt sick during chemo. Also the steroids they should have given you should also help with sickness. The sickness shouldnt last much longer as normally you have the first week after chemo is usually the worse then the second week you may only feel strange about day 10 to 14 when your cells start to die and then the third week you pick up again before your next chemo (all this is if you are on 3 weekly chemo) Saying all that everyone is different. I sailed through chemo but when it came to radiotherapy I was very sick and bad. Have you got a care nurse you can ring. they are there to help. Or if you can wait till your next appointment tell the nurses as there are many different tablets they can give you for sickness there is no need to suffer. good luck and best wishes Sue",
      "MessageIndex": 1,
      "PostDate": "11/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36269/nausea",
      "Title": "nausea"
    },
    {
      "AuthorID": "8383susie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/8383susie",
      "Content": "Hello I chose to have a picc line fitted when I had my FEC-T as I also had to have a year of Herceptin. My veins were so bad that I couldnt go through the pain any longer. All in all I had to have 3 lines fitted which wasnt a bad experience. The only problem I had was I hate needles and you have to have a local to numb your arm. Still it meant no more needles for a year as everything was done through the PICC line. I had to have 3 because the first one got blocked (think this was cos I relaxed so much in the bath my arm fell in) and the 2 nd one moved (think this was cos when having radiotherapy they shoved me about a bit too much. You would have to see the nurse each week to clean it but that is a small price to pay. Chemo is much quicker because no more problems getting the canular in they just hook you up and away you go. They did try to talk me into a port as it need much less maintence and you can get it wet but I didnt want any more my chest cut. It was the best thing I did and I am sure you will get on just fine with it if you choose to ahve one.   Good Luck   Sue",
      "MessageIndex": 3,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52481/new-with-picc-line",
      "Title": "New with PICC line"
    }
  ]
}