{
  "AuthorID": "Ag01",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ag01",
  "Posts": [
    {
      "AuthorID": "Ag01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ag01",
      "Content": "Hi, just joined the forum and can relate to the dilemmas others are facing. I had a right skin sparing mastectomy with immediate reconstruction using back muscle 6 weeks ago today. I'm pleased to say I'm recovering well. When the surgeon gave me options for surgery, I felt overwhelmed. I was keen to explore the strattice procedure and would have probably opted for that to minimise the extent of surgery. However once all results from, biopsies, scans and MRI were back, they indicated that Radiotherapy would be likely and the surgeon said that the strattice procedure was no longer an option as Radiotherapy would have an adverse effect on the success of the strattice. Even then the decision to go for immediate reconstruction was painstaking as he had to inform me that in some cases, Radiotherapy can cause tightening and constriction of implant! I was also worried about the effect it would have on my back. In the end, I took the risk on the basis that he reassured me he could operate and sort any problems caused by Radiotherapy and he also reassured me that other back muscles would compensate and do the work for the one they would relocate. Sometimes it's difficult for the surgeons and the multi-disciplinary team to give a definitive steer because although biopsies, scans and imaging give them some info, they don't definitely know what they're dealing with until they perform surgery. For me, they found 4 tumours and due to size and multi focal nature, I will be having chemo, radio and hormone therapies starting with chemo on 3 Jun. I'm bracing myself and hoping that Radiotherapy doesn't damage my lovely new boob! Even if it does, I feel for me, immediate reconstruction was the right choice! I haven't had any problems in terms of pain from where they used my back muscle; I'm happy that I've got a new right breast and I would be too much of a chicken to elect for recon sometime in the future! Sorry I've ended up writing war and peace! One thing for sure, everyone's situation is different and there's no right and wrong. Whatever you decide will be right for you individually. Keep positive and take care.",
      "MessageIndex": 0,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60841/new-here-too-and-bracing-myself-for-chemo",
      "Title": "New here too and bracing myself for chemo"
    },
    {
      "AuthorID": "Ag01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ag01",
      "Content": "Evening Lou, I am just over 2 years post op and had mastectomy with immediate recon using LD flap (back muscle). I knew prior to the op that I would have to have radiotherapy and my consultant explained that this could damage the recon. I'd never had an operation before, I was scared and couldn't imagine electing to have the recon at a later stage so I wanted to get the major surgery done at a time when I had no choice but to have surgery. When I probed, the surgeon explained that any damage caused by radiotherapy would be repairable with a further, smaller op. Whichever way I looked at it, i either had a big op (recon) which MAY need a smaller op if the r/therapy caused probs or a smaller op (I.e. Mastectomy) with major op later. i took the decision to get the bigger op out of the way! Then had chemo and radio. Sure enough, the radiotherapy affected my recon and I had a capsulectomy (removal and replacement of implant) in Jan this year. For me this was the right decision and I have no regrets. However, I know ladies who have been happy with their decision to have a mastectomy without reconstruction. Keep asking questions, take in all the info and eventually you will arrive at a decision that's right for you. Good luck with your op and make sure you rest to give yourself chance to recover ready for the next phase of treatment. It's a tough few months but manageable as long as you accept that you won't be able to do all of the things you may be used to doing. Take care",
      "MessageIndex": 23,
      "PostDate": "29/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96846/diagnosed-yesterday---need-mastectomy-august-19th--o",
      "Title": "Diagnosed yesterday - need mastectomy August 19th :-O"
    }
  ]
}