{
  "AuthorID": "agar14",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/agar14",
  "Posts": [{
    "AuthorID": "agar14",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/agar14",
    "Content": "Hello Ladies,    I had my appointment today and I am pleased to say I have a fibroid lump.  I had the same radiologist as the first time I had an ultrasound who told me there was nothing there, so I was a little nervous.  She told me the mammogram found a lump, she did the scan and measured it and it was small.  It wasn’t a cyst. She asked me if I have had a previous mammogram in the last few years and if I had, they would compare them, if the lump was not there on the previous mammogram they would do a biopsy.  They found the previous mammogram that I had a few years ago and there it was, I was not recalled when they did it a few years ago as she said it looks normal and they have to look at a lot. It had not changed shape or size. So I was reassured. She was 99.9% you don’t get breast cancer when you have pain. I didn’t comment. I will be due another mammogram in 3 yrs and now I know it’s there will keep an eye on it. I don’t know why I have the pain, I guess it is just one of those things. I want to let you know that I have learnt a lot from reading individual stories/experiences how people come to find they have this awful illness and not just from this site from other sites across the globe. A lot of women have found they had cancer through pain, that was what drew their attention to their illness in the first place. I think what we should be looking at is any problem that does not feel right or look right seek advice. I just wanted to thank you all for your experiences and support I wish you all well.",
    "MessageIndex": 8,
    "PostDate": "10/11/2017",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141658/recalled-waiting-worried",
    "Title": "Recalled, Waiting, Worried"
  }]
}