{
  "AuthorID": "Akiiki",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/akiiki",
  "Posts": [{
    "AuthorID": "Akiiki",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/akiiki",
    "Content": "I tried the cold cap, but it wasn't that successful. Lots fell out even before the second treatment, but I managed to retain a bit of fringe, which was emotionally very important to me at the time. It felt more natural looking with a bit of fringe sticking out from under a hat or scarf. It was tough when the hair started falling. Very tough. I stuck with the cold cap until the very last treatment, when I decided to shave whatever hair I had left. My hubby couldn't understand why I'd stuck it out for so long only to gave in just before the last session, but it was my choice and it felt right to shave then. Partly because I was stopping working for a few months, so didn't have to face any customers (I had worked throughout chemo, but took time off after surgery and radiotherapy) and I also felt empowered by it. A friend decided to shave in sympathy for what I was going through and when she did it, I thought why can't I? As I understand it, the cold cap works best for people with thick and dark hair. Mine is fair and thin. I also think the fit makes a difference. Some of the nurses were clearly better at fitting it than others. It is very uncomfortable, yes even painful. It's like sticking your head in the deep freezer for three hours, but I can tell you that if you manage the first 15-20 minutes, then it doesn't get any worse, so it's certainly worth a go.  Recently I saw a feature about someone who had henna painted her bald head. It looked great and I wish I'd known about it when I was bald. I would certainly have given that a go. Good luck!",
    "MessageIndex": 18,
    "PostDate": "19/01/2017",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121610/her2-and-hormone-receptor-positive",
    "Title": "Her2 and hormone receptor positive"
  }]
}