{
  "AuthorID": "Ali.24",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
  "Posts": [
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "Morning to you too! I've got terrible indigestion. I swear it's the steroids... Off to have some gaviscon and catch up with Bill Bryson. ",
      "MessageIndex": 1,
      "PostDate": "31/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87647/4-am-club",
      "Title": "4 am club !!!"
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "Hi Rosalyn, These are the ones I was given by the physio team after my mastectomy, so they should be really helpful. Be careful how much you carry with your tested arm... May need to invest in a funky shopping trolley! http://www2.breastcancercare.org.uk/sites/default/files/bcc6-exercises-after-breast-cancer-surgery.pdf  use both arms for housework so you don't over do it.  Let me know if the link doesn't work.  Alison",
      "MessageIndex": 1,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90117/arm-exercises",
      "Title": "arm exercises"
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "I am not diabetic at all but when a district nurse visited me she did a routine blood sugar test and my sugar levels were sky high. Apparently it's the steroids thatare being prescribed. Chat with your oncology Drs and nurses and your diabetes team as adjustments may need to be made regarding your insulin. ",
      "MessageIndex": 1,
      "PostDate": "12/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88202/effect-of-chemotherapy-on-insulin-levels",
      "Title": "Effect of chemotherapy on insulin levels?"
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "Morning everyone!  I am still having chemo and my hair is still thinning on my head but it's started to grow back in other places with some as ingrowing hairs. Any recommendations to treat this or prevent it? ",
      "MessageIndex": 0,
      "PostDate": "25/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88826/ingrowing-hair",
      "Title": "Ingrowing hair!"
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "I am also struggling to process the fact that I've got breast cancer, but I told my friends that they can ask me any question they like about it and what my treatments will be. I have also had flowers from people; how useless is that! I know it makes them feel like they have done something but i would prefer a supportive text or facebook message, or a good book/magazine to read.  This last year my me time has become less and less with work getting in the way. I have changed and will continue to do so and I know that I will not be doing any more unpaid overtime or working Sundays to help out. I come first. ",
      "MessageIndex": 15,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87031/fed-up-of-cancer-being-the-focus",
      "Title": "Fed up of cancer being the focus ..."
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "After my diagnosis I really only wanted my immediate household to know and the few people that I work closely with(they might have taken phone calls from the hospital) as I felt it was no-one else's business even though I knew they would want to help. I knew that things would soon be out of my control so I clung to that like mad. My mum decided to tell her hairdresser and I absolutely flipped.  I don't think you're being overly sensitive; this is very personal and very private and no-one else's business.   I think my Mum spoke out because she really didn't understand why this had happened to me and she really needed to talk to someone else about it. I know she didn't do it to hurt me but if felt like a complete betrayal of trust, but she had to talk about it to someone. Tell your Husband to pick and choose who he tells and that he has your permission first: its your decision not his. Remind him that he can speak to the Macmillan people himself if he needs to talk about it. Once i'd had my mastectomy I felt more able to share with friends and family and my attitude was that it was the beginning of a journey that was going to end and once it had started I could think about other things. I hated people discussing with me what might or might not happen during my treatment so armed myself with a lot of knowledge and that shut them up that way! Hope this helps, sorry if I've gone on a bit! Ali.24",
      "MessageIndex": 14,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87031/fed-up-of-cancer-being-the-focus",
      "Title": "Fed up of cancer being the focus ..."
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "Thanks everybody for your suggestions. Going to try the olive oil first.  Big hugs to all. Xxx",
      "MessageIndex": 6,
      "PostDate": "28/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87506/nose",
      "Title": "Nose"
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "i am currently having paclitaxel and herceptin. I find that my nose runs quite a bit but is not too much bother but in between it running the inside gets so dry and sore. Anyone else had this problem? What can you use to stop it if anything?",
      "MessageIndex": 0,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87506/nose",
      "Title": "Nose"
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "I had right side mastectomy at the beginning of september and lymph node clearance.  I was a bit tight and sore after I went home but co-codamol sorted that out and you can quickly reduce those to paracetamol then nothing at all.  If you are given exercises to do make sure you do them. They will feel quite strange and again quite tight but you wont do any damage, but don't over do them. Keep in contact with your breast care nurses about anything worries you have at all: they are a fabulous group of people and nothing is trivial to them at all. You'll be just fine.",
      "MessageIndex": 10,
      "PostDate": "15/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86878/mastectomy-and-lymph-nodes-removed",
      "Title": "Mastectomy and lymph nodes removed"
    },
    {
      "AuthorID": "Ali.24",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ali.24",
      "Content": "After having my mx I could not for the life of me remember how I used to get out of the bath. I've since been turning round and it's been quite awkward. Tonight I managed to get out without hurting anything and the right way around. It's a small success but so positive I cried my eyes out! How soppy! It's a good start to the new year though...yay me! ",
      "MessageIndex": 0,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87748/small-success",
      "Title": "Small success!"
    }
  ]
}