{
  "AuthorID": "Alipotter",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/alipotter",
  "Posts": [
    {
      "AuthorID": "Alipotter",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/alipotter",
      "Content": "Hello, Can anyone tell me which creams to use as a moisturiser as i don't like aqueous cream, and my radiotherapy starts tomorrow. ali x",
      "MessageIndex": 0,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53580/cream-for-radiotherapy",
      "Title": "Cream for radiotherapy?"
    },
    {
      "AuthorID": "Alipotter",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/alipotter",
      "Content": "HI Lopseygoldwig I too was diagnosed with benign fibroadenoma 3 years ago. I was told at the time it would NEVER change and i was being an ANXIOUS patient. they actually wrote that on my notes. I was 32 at the time. 3 years later i thought it was growing and went to a different hospital and was diagnosed with IDC. I have thought many times about writing to the original hospital and telling them that they should be careful what they say to patients...but will it make a difference? i doubt it!!! ali x",
      "MessageIndex": 2,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54305/has-any-body-else-had-a-similiar-experience",
      "Title": "has any body else had a similiar experience"
    },
    {
      "AuthorID": "Alipotter",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/alipotter",
      "Content": "Hi chloecat45, I felt compelled to respond to you. whether it will help or not i dont know. I am a 35 year old Osteopath diagnosed in June this year with IDC. As an osteopath my life is about letting the body heal itself by putting it in the best possible place to do so. I worked very hard for 5 years to qualify. I know ALL about research, statistics, conventional medicine and alternatives. I have read sooo many papers now on all treatments available, and all the side effects of each treatment. Your choice is basically choosing between proven,  researched methods or not yet proven alternatives. It is your choice. I will say that in 5 -10 years time the choices will be different, and for example even how they target radiotherapy will probably be different, but believe me they didn't get to where they are now lightly. My grandma died in her 40's, 30 years ago through not having the research we are privileged to have now.  I would have happily chosen alternative methods if i believed that would be enough to keep me alive in 10 years time. I personally decided I was not willing to take that chance. The alternatives then become complementary instead of alternative. The research is there for a reason. As it happens the \"slice and burn\" has not been too bad. In fact for me it was \"slice and slice and burn\" but i have changed my diet completely, taken up yoga and meditation everyday, got rid of all people in my life who drain me and with a few minor glitch days along the way I have sailed through. So i know conventional seems horrid but really its not the NHS fobbing you off. No-one can make the decision for you. Ali x",
      "MessageIndex": 17,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "Alipotter",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/alipotter",
      "Content": "Hello everyone, This is going to seem really ridiculous but instead of stressing about the treatment I am now on one about my christmas holiday!!! I am a skier and we go every year and i've always wanted to go to Canada or USA to ski there as its supposed to be amazing. So being diagnosed this year and coming up to the end of treatment (except for tamoxifen) I decided i would reward myself with the best xmas trip ever in whistler. NOW however being the loser that I am!! I think instead of rewarding and celebrating I am now tempting fate. If I go on this holiday am I ticking it off before worse things happen and the BC comes back to get me!?!? do you undertsnad what i mean??? I know its ridiculous. Just as I write this I know its ridiculous but what if i do??? Ali x",
      "MessageIndex": 0,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54033/tempting-fate-ridiculous",
      "Title": "Tempting fate....ridiculous"
    },
    {
      "AuthorID": "Alipotter",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/alipotter",
      "Content": "Hi everyone So after weeks of messing around with consultations and egg freezing financial issues, i have given up and decided to just start taking tamoxifen. Today is the first day and am a little scared of the side effects. Please can someone tell me they haven't had any at all!!! I also remember reading a while ago that someone said that the different brands had different effects due to the coating and that the ones from boots?? i think were better. Does anyone else recall this?  My brain is in turmoil because on one hand i feel cancer free but on the other it is all on going, I still have to think about certain things and still have a gene test to come. Does it ever go away? Ali x",
      "MessageIndex": 0,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56844/tamoxifen-help-please",
      "Title": "Tamoxifen help please"
    },
    {
      "AuthorID": "Alipotter",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/alipotter",
      "Content": "hello, Just wondering if anyone had dizziness with their radiotherapy? I'm 2 weeks in and it doesn't seem to suit me too well. Today the dizziness is making me feel rubbish. any tips? Ali x",
      "MessageIndex": 0,
      "PostDate": "05/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53992/tricks-for-radiotherapy-dizziness",
      "Title": "tricks for radiotherapy dizziness?"
    }
  ]
}