{
  "AuthorID": "Allylou76",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/allylou76",
  "Posts": [
    {
      "AuthorID": "Allylou76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/allylou76",
      "Content": "Hi Carol Many thanks for your reply to this. I have just spoken to a lovely nurse from here who assured me that drinking 3 litres a day was prefectly fine and would not have compromised the efficiency of the drugs. She did say that as I drunk less last time the drugs were in my liver and kidneys for longer causing the side effects. It was lovely to hear from both the nurse that I am doing the right thing and also from you to share your experience with each cycle of treatment that you have had. Thank you so much. Take care Ally xx",
      "MessageIndex": 3,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52698/can-you-have-to-much-water",
      "Title": "Can you have to much water?"
    },
    {
      "AuthorID": "Allylou76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/allylou76",
      "Content": "Dear all, Just had my second lot of Fec on Wednesday just gone. On my first treatment I suffered on the third day really bad weakness and tiredness and a severe headache which latest about 4 days but only drunk about 1.5 litres of water over the first few days after treatment. This time on treatment day after I got home I drunk roughly 2 litres and about 3 litres yesterday. I woke this morning expecting to feel rubbish last time but so far am not feeling to bad, a little tired but nothing like beforehand. I am now concerned that I have drunk to much water and flushed the drugs out of my system to quickly for them to be of any benefit. Is this just me being silly, am I doing the right thing or should I speak to my ONC next week at my appointment and see what he says. I have read on the net many things mostly saying that it's important to flush your system but to go from one cycle to the other feeling so much better is worrying me. Anyone offer and advice or what they did first few days after treatment? Thank you. Allylou x",
      "MessageIndex": 0,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52698/can-you-have-to-much-water",
      "Title": "Can you have to much water?"
    },
    {
      "AuthorID": "Allylou76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/allylou76",
      "Content": "Hi everyone Firstly I would just to say how fantastic all the support you give is. I joined a couple of weeks ago and have really just lurked in the background as I didn't think I could offer any words of wisdom but you have all made me realise that we are in the same boat..so thank you. I had my mastectomy in June and had my first lot of FEC two weeks ago tomorrow, second one next week. It hasn't been as bad as I had thought, just major tiredness and feeling of weakness for about four days and then slowing getting back to normal. I did suffer however the most awful headaches for the first seven days as well which my oncologist has said is pretty common. When I last spoke to my BCN I asked if I could have any complementary therapy and she said yes it may be helpful towards emotional wellbeng etc as long as no herbs etc were used. A friend of my husband does Reiki and offered to come round and offer some \"healing\" with me which I agreed to. It involved me lying on my bed whilst she stood over me placing her hands gently on my head, face, next, shoulders back and stomach to help with my energy (I appreciate this may sound as bit bizarre to someone of you :-). ) Anyway afterwards she said she could sense I had been suffering from headaches as the area above my eye where I has been experiencing them felt hot?? Also she said my head felt itchy and prickly...13 days since 1st chemo...hair on way out (no signs yet though) ?? I was a bit sceptical but did say that it was relaxing and I felt quite calm and positive after. My question is...and you all gong probably think I am being really silly but Im now worried that her \"healing\" may somehow stop the chemo from working properly. My rational side says don't be so silly the drugs are mega powerful and she is only touching me gently with her hands ....the other side of my says....\"hmm yeah but what if\"? Any thoughts on complementary therapies would be greatly appreciated. Allylou xx",
      "MessageIndex": 0,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52390/complementary-therapy---reiki",
      "Title": "Complementary therapy - Reiki"
    },
    {
      "AuthorID": "Allylou76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/allylou76",
      "Content": "Hi I had a mx on my right side 7 weeks ago and have just started my chemo. I was offered reconstruction at the same time of the mx but decided that for me the main concern was to get all the cancer out, deal with any further treatment needed then look at reconstruction at a later date. I must admit straight after surgery I was very emotional thinking I'm not a proper woman and look lopsided but I have grown used to it already. I have just been fitted with my prothesis and people who didnt know what side was removed can not tell. The only person who sees my scar apart from myself is my husband and he says that he loves me for me not my boobs. I may feel differently after chemo has finished, who knows, but for me the most important thing is to get through the treatment not how my chest looks. Please feel free to PM me if you need to. Take care Ally x",
      "MessageIndex": 11,
      "PostDate": "03/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52091/hi-i-m-new",
      "Title": "Hi, I'm new"
    }
  ]
}