{
  "AuthorID": "AllyInScotland",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/allyinscotland",
  "Posts": [
    {
      "AuthorID": "AllyInScotland",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/allyinscotland",
      "Content": "I would say stick with the nhs. I can't fault the treatment that I've received and there is the continuity with follow ups as well as the direct links with macmillan nurses, specialist psychologists, dietician, and any other health care professional that you may need as a result of chemo etc. I think that paying for treatment doesn't make it better treatment.",
      "MessageIndex": 3,
      "PostDate": "17/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108023/private-or-nhs-care-treatment-decision",
      "Title": "Private or NHS care/treatment decision"
    },
    {
      "AuthorID": "AllyInScotland",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/allyinscotland",
      "Content": "I think that wanting the mastectomy is very much a knee jerk reaction to the situation. I spoke to my oncologist about having a mastectomy - he explained that it wasn't necessary (I had a grade 3 invasive tumour). When they remove the lump, they are very careful about 'healthy margins' to ensure they have removed all the cancer. I made a conscious decision to trust my surgeon's judgement. If I had wanted to see a psychologist, the service was available at my local Maggie's centre as well as my GP being able to refer me to one at my local Macmillan support centre - maybe pop in, if you have a Maggie's near to you? I'm surprised that your surgeon and breast team haven't tried to allay your fears and reassure you, rather than delay. Something I have found, is that on occasion, I have had to be proactive in sorting things out myself - not how it should be, but sometimes, taking control yourself can be helpful in dealing with the anxiety aswell.",
      "MessageIndex": 3,
      "PostDate": "17/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108011/new-diagnosis-and-i-want-a-bilateral-mastectomy",
      "Title": "New Diagnosis and I want a bilateral mastectomy"
    }
  ]
}