{
  "AuthorID": "Altolady",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/altolady",
  "Posts": [{
    "AuthorID": "Altolady",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/altolady",
    "Content": "Oh dear!! I have been asked by a friend to join him in a sponsored shave next month, and I was happy to agree. As a 6 year breast cancer survivor, I was anxious to raise some cash via sponsorship to help in the fight against this dreadful disease which so far has taken two of my close friends as well as my father, uncle and brother. Three years ago I did the same thing and raised £750 for the local hospice where my brother died. It was a low key solo effort and not affiliated to any campaign. Overall, people's reaction was positive. Only one friend was quite deeply upset by what I planned to do. She had a hard time during chemo and said that by far the worst part of her cancer journey was the loss of her hair. Whilst I shall be forever grateful not to have needed chemo myself, what I lost, namely my lymph glands and left breast, will never grow back. I have never, would NEVER imply that voluntarily losing my hair gives me an insight into the pain of her experience or that of others like her. In the end she conceded that possibly the end had justified the means. I think that it's a pity \"brave\" and \"shave\" rhyme!! There's nothing brave about a voluntary radical haircut, but if people will give me money to pass on to a worthwhile cause just to have one then I probably shall. I really don't want to offend anyone but am not fit enough to run a marathon or do a triathlon. I am not brave enough to do a bungee jump or hurl myself out of a plane. I am a 62 year old grandmother looking for a way to give something back in belated gratitude to support Macmillan's work.  Really, I don't want to offend anyone. All your words have made me feel terribly conflicted. Thoughts? X x x",
    "MessageIndex": 184,
    "PostDate": "24/08/2016",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
    "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
  }]
}