{
  "AuthorID": "Am4nda",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/am4nda",
  "Posts": [
    {
      "AuthorID": "Am4nda",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/am4nda",
      "Content": "Pete (my partner) had his first chemo session on Thursday, so we are on day 5 now. I went in the chemo room with him for about an hour. I too was amazed at the amount of people in there - young, old and from all walks of life. I was also amazed at the amount of thank you cards on the wall - I think we will be adding our card at the end of this journey! The atmosphere was extremely pleasant, which surprised me for some reason? The nurses were laughing joking and even dancing and singing at one point to Status Quo on the radio! The whole communal thing put me off initially, but I can see now how it really works and helps people who are having the treatment. Pete is now on tablets for 2 weeks, one week rest, then thats cycle one over and done with - only 3 more to go! Manda",
      "MessageIndex": 2,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10927/1st-chemo",
      "Title": "1st chemo"
    },
    {
      "AuthorID": "Am4nda",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/am4nda",
      "Content": "Hi Tessa I think it really depends on the treatment you are having and you as an individual. My OH cannot drive himself to and from chemo - not because of tiredness (although he is tired, but awake enough to drive). For him, its his hands. He gets intense tingling, pins & needles, and numbness immediately after a session and couldn't safely hand the steering wheel or chnage gear! Manda",
      "MessageIndex": 4,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10970/driving-and-chemo",
      "Title": "Driving and chemo"
    }
  ]
}