{
  "AuthorID": "Amanda66anne",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/amanda66anne",
  "Posts": [
    {
      "AuthorID": "Amanda66anne",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/amanda66anne",
      "Content": "Abbey, I have just joined the site this morning and your post is one of the first I read.....you sound so strong and positive and I truly wish you the very best. It is a frightening time but having friends and family to support you really helps! Amanda x",
      "MessageIndex": 1,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53387/1st-chemo-today-today-i-start-fighting-back",
      "Title": "1st chemo today...today I start fighting back!"
    },
    {
      "AuthorID": "Amanda66anne",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/amanda66anne",
      "Content": "What a great blog spot! Thanks for the info",
      "MessageIndex": 4,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53382/fab-just-a-fab-find",
      "Title": "FAB! Just a fab find !!!!"
    },
    {
      "AuthorID": "Amanda66anne",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/amanda66anne",
      "Content": "Hi All, I am new to the site and joined for some help and advice following the suggestion from my Oncology nurse so here I am....... Today I am day 14 following my 1st round of FEC, I have kept relatively well which I am thankful of but on Friday I ran my hand through my hair and yes got a handful! I did find this very distressing initially but it was to be expected.....it was just a earlier than expected! As I have very thick hair it is still looking ok but I have a very sore scalp and found it difficult to sleep last night. I am also dreading washing it as it so sore to touch? I had talked about getting it shaved off and I still plan to but it's easier just to talk about it doing it is a different matter. I am just looking for some advice with the sore scalp.....will it stop being sore if I have it shaved off? ......and how long did you all wait before you shaved it? Amanda x",
      "MessageIndex": 0,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53390/new-to-site-joined-for-support-and-advice",
      "Title": "New to site joined for support and advice"
    },
    {
      "AuthorID": "Amanda66anne",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/amanda66anne",
      "Content": "Ladies, The deed is done I got my head shaved today and I was surprised as to how liberating it felt....I got what I think is a number 2....can't quite believe how grey it is and how many bald patches I have but they will soon all blend in to baldness I guess?? I had my wig fitted too and as suggested went to lunch with friends mind you felt everyone was looking at me and thinking that's a wig.....who knows and who cares.....I certainly felt good mind you my daughter found it difficult to locate me in the shops, meant she had to pay for her own shopping I could get used to this! Thanks again for your support ladies Amanda xx",
      "MessageIndex": 5,
      "PostDate": "20/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53390/new-to-site-joined-for-support-and-advice",
      "Title": "New to site joined for support and advice"
    },
    {
      "AuthorID": "Amanda66anne",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/amanda66anne",
      "Content": "Ladiesthanks for your replies and support I have found your messages very comforting. You are all so strong and positive. I am getting frustrated with finding hair everywhere it will have to go soon.......i just need to find the strength to do it The woman who is supplying my wig has offered to shave it and fit my wig at the same time to help soften the blow until I am ready to look at it! I am going to take her up on the offer and I will let you know how I get on when I pluck up the courage! I like your tip Mary I will arrange to meet friends afterwards! hope all goes well with your last chemo! Michele, my daughter is 18 and has been my rock, she has been with me every step which has been hard for her too, she is insistent in being with me when I get my hair shaved and I love for this but think it will be really tough on her too (my husband works away from home mid week so she is my main support!) Again ladies I take strength and courage from you all and will keep you posted. Hope Friday goes well Michele Amanda x",
      "MessageIndex": 4,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53390/new-to-site-joined-for-support-and-advice",
      "Title": "New to site joined for support and advice"
    }
  ]
}