{
  "AuthorID": "Americagirl",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/americagirl",
  "Posts": [
    {
      "AuthorID": "Americagirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/americagirl",
      "Content": "Hey I am also 36 and was diagnosed on 10 July 2011.  I have had my surgery now and am waiting to start chemo.  I had a 2.6cm lump removed from my left breast and 6 lymph nodes removed.  Thankfully I was lucky and got a good clear margin around the lump and all of the lymph nodes were clear.  the scar on the breast is around 5 inches long but very straight and is healing very well.  There is a dint where the lump was removed and the skin is a little puckered (makes things look a bit lop-sided as I had quite big boobs and because of the size of the chunk removed the surgeon had to pull the skin quite tight).  They have said I can have reconstruction but will have to wait until all my treatment is finished.  The lump was to close to the chest wall so they couldn't reconstruct at the same timme as the removal op. I agree that the sentinal node was the worst for after effects.  I would say to make sure you do the recommended exercises as soon as you feel able to get your movement back. To be honest I thought the op was the easy part, I am not looking forward to the chemo and radio therapy but with everyones help I am sure I will get through it and so will you.  This site is really good for when you just need someone to talk to.  I found I didn't want to upset my family by letting them know how scared or worried I was so thiis has been the one place where I have been able to ask any questions and say how I am feeling without having to be brave Stay strong, I hope it all goes smoothly for you. Zoe x",
      "MessageIndex": 2,
      "PostDate": "03/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42072/approaching-op",
      "Title": "Approaching Op"
    },
    {
      "AuthorID": "Americagirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/americagirl",
      "Content": "I had my lumpectomy and sentinal node disection on 10th August and I go back for the results tomorrow.  Very nervous and worried about what I am going to hear.  Trying to stay positive but sitting here thinking the worst !!! ",
      "MessageIndex": 0,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41686/surgery-results-tomorrow",
      "Title": "Surgery results tomorrow"
    },
    {
      "AuthorID": "Americagirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/americagirl",
      "Content": "Thank you all for your supoprt.  Thankfully I have been very lucky an dhad a good surgeon who got the entire tumour out and the lymph nodes he removed were also all clear so no more surgery required.  I still have the chemo and radio therapy to face but I feel like I have made a step on the road to recovery. Zx",
      "MessageIndex": 4,
      "PostDate": "24/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41686/surgery-results-tomorrow",
      "Title": "Surgery results tomorrow"
    },
    {
      "AuthorID": "Americagirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/americagirl",
      "Content": "Hey Jane no I wont be having any pills - my tumour was estrogn negative so my surgeon says I wont have to have any.  I am scheduled for 6 sessions of chemo although I dont have a start date for that yet and whe that is done I have to have radio therapy. I am a bit nervous about the chemo - side effects, lossing hair etc but like you I am trying to not think the worst.  I have assigned myself to the hair loss (I got my very long hair cut to chin length a few days ago) but am not looking forward to the other side effects.  Hopefully we  will be lucky ones and only have a few to deal with or even better none at all !! Good luck for your first session.  I hope it all goes smoothly for you.  I would be interested on hearing your experiances if and when you are up to it. Stay strong Zoe xxxxxxxxxxx",
      "MessageIndex": 6,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41686/surgery-results-tomorrow",
      "Title": "Surgery results tomorrow"
    },
    {
      "AuthorID": "Americagirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/americagirl",
      "Content": "I was diagnosed with breast cancer in 2011 and after surgery, chemo and radiotherapy I have been given the all clear but today whilst I was doing my self exam I have found another lump but it is closer to my shoulder than my breast and is painful to touch.  Should I bother my breast care nurse with this or is it something other people have experienced ? Zx",
      "MessageIndex": 0,
      "PostDate": "07/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64427/a-new-lump",
      "Title": "A new lump"
    }
  ]
}