{
  "AuthorID": "Ang67",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ang67",
  "Posts": [
    {
      "AuthorID": "Ang67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ang67",
      "Content": "Hi Juniruni Welcome to the place no-one wants to be  - you will receive a lot of support here wether just for reading (which I mostly do) or joining in. I was diagnosed had lumpectomy on 18/09 last year.  2.5cm tumour with clear margins,  2 out of 3 nodes involved - one with 4mm cell , one with 1mm cell and 3rd clear.  I had 3 x FEC + 3 x T Chemo followed by 19 Radiotherapy. I had my first yearly mammogram last on 26/09 and got the all clear. My cancer type was Triple Negative so no other treatment other than Zometa infusion every 6 months (had my 2nd one this week) to strengthen bones. I was told I was only being given the Chemo and Rads as a \"Mop Up\" job just to make sure all small cells where gone. I feel really good now - it has been a hard year  I won't sugar coat it but I feel almost normal again I am sure other will come along to give you some more positve stories. Take care Ang xxxx",
      "MessageIndex": 1,
      "PostDate": "11/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169570/her2--lymph-node-involvement",
      "Title": "Her2- lymph node involvement"
    },
    {
      "AuthorID": "Ang67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ang67",
      "Content": "Juniruni We all have our down days.   I've never had a CT scan  - I only ever had my original Mammogram, Ultrasound and Biospy (all in the one day) followed by my Op then Chemo and Rads. I am sure your onc is just erring on the side of caution.  Grab all the treatment they give you.  They are giving you this for a reason. I must admit this last 13 months has seemed like blur.  There is a lot of support so if you want help or a hug just say xxx",
      "MessageIndex": 7,
      "PostDate": "11/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169570/her2--lymph-node-involvement",
      "Title": "Her2- lymph node involvement"
    }
  ]
}