{
  "AuthorID": "AnjiB",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/anjib",
  "Posts": [
    {
      "AuthorID": "AnjiB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/anjib",
      "Content": "I found a lump in my right breast a few weeks ago, the consultant told me at my first appointment that it was likely to be cancer and that I would need a mastectomy because there were lots of lumps.  When I went back a week later for the results (it is cancer), he did another examination and found a lump on the other side so back for ultrasound and biopsy and again told there and then that it was cancer and now looks like double mastectomy. I’ve also had a bone scan and chest X-ray and have an appointment on Tuesday for all the results.  All this over a three week period, I’m really frightened because the lumps on my right side seem to be getting bigger, you can actually see them now, I’m told they are grade 2. I’ve not felt well for the last few months and I’m petrified that it has spread to my bones, I get quite a lot of pain in my chest bone and back but also suffer with arthritis so might be worrying for no reason. Has anyone else had this?  The consultant said it was 5% chance to get it in both breasts, just my luck!",
      "MessageIndex": 0,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141115/cancer-in-both-breasts",
      "Title": "Cancer in both breasts"
    },
    {
      "AuthorID": "AnjiB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/anjib",
      "Content": "Thank you so much for your reply, I don’t have much family around I live on my own so have quite a lot of time to think.  My dog seems to know somethings not right he won’t leave my side! I’m worrying about work but do have very supportive colleagues, I keep changing my mind about what to do about work should I take time off or try to carry on.  Perhaps things will be easier after I get more results on Tuesday.",
      "MessageIndex": 2,
      "PostDate": "29/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141115/cancer-in-both-breasts",
      "Title": "Cancer in both breasts"
    }
  ]
}