{
  "AuthorID": "Anjimay",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/anjimay",
  "Posts": [
    {
      "AuthorID": "Anjimay",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/anjimay",
      "Content": "Hello Jane Thank you so so much for all the time you have put in to your research and your excellent post to share it with us. You are a star! I have just been given a prescription for my first Letrozole and it turns out to be Teva.  After reading my fellow ladies heartbreaking experieces I feel as if the NHS has put me into a game of Russian roulette with the quality of the rest of my life. Are we going to put up with this? My fight begins now!xxxxxx",
      "MessageIndex": 14,
      "PostDate": "27/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91495/letrozole-v-femara-again",
      "Title": "Letrozole v Femara (again)"
    },
    {
      "AuthorID": "Anjimay",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/anjimay",
      "Content": "Hello Macrad, Thank you so much for responding! You have given me hope with your experienced comments which I did not have before. Yes, it is odd that something attributed to radiotherapy on the right side is manifesting on the opposite side of the chest. Also after so many weeks, it is now becoming distinctly yellowish which suggests bruising. Also I have, after more than 2 months from my op, serum still accumulating in the breast 'pocket' that remains which suggests possible bruising of the tissues. Maybe it will fade in time. Here's hoping! ",
      "MessageIndex": 4,
      "PostDate": "11/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111673/radiotherapy-response",
      "Title": "Radiotherapy response"
    },
    {
      "AuthorID": "Anjimay",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/anjimay",
      "Content": "Hello lovely, strong ladies! Radiotherapy response - Anyone even heard of this?! 8 years after having wle and radiotherapy, I have had a mastectomy(( 4th May) on the same side and a month after my op the skin around the scar and gradually over the whole breast area turned puce then brown and the pigmentation is now spreading across to the other breast and up my chest. BC nurse and oncologist call it a radiotherapy response.  Anyone else experienced this, please? Are there any consequences to come that I haven't beeen told about yet? It looks very scary. I have pale skin and this is a dark brown spreading stain covering about 4 handspans of my chest. So far! Thanks. Xx",
      "MessageIndex": 0,
      "PostDate": "10/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111673/radiotherapy-response",
      "Title": "Radiotherapy response"
    }
  ]
}