{
  "AuthorID": "ann_gee",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ann_5f00_gee",
  "Posts": [
    {
      "AuthorID": "ann_gee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ann_5f00_gee",
      "Content": "Hi moleend my decision was made quite easily, I had a 3cm lump which i had removed and had nodes removd which they say had no cancer in them which i think is very lucky, but since i am only 42 and have 3 girls to worry about. I decided to take any treatment they could give me to make sure i will be here for my girls growing up. I know its not easy going through chemo which i started on 25th nov but i have to stay psitve ad remind myself this was my decision!! Sometimes i say please remind me why i am doing this but i know why!!! Good luck for youre future and i hope you can make youre own decision hun xx",
      "MessageIndex": 7,
      "PostDate": "06/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23014/to-chemo-or-not-to-chemo---that-is-the-question",
      "Title": "To Chemo or not to chemo - that is the question?"
    },
    {
      "AuthorID": "ann_gee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ann_5f00_gee",
      "Content": "Hey tye i know exactly what you mean about youre head being all over the place i think everyone does the same as yu and me!! Im sorry i took so long to reply to you but i have just finally got to the catch up with normality. I am now going onto my third dose of FEC and have had a hard tie with my first dose but i am now coping with how to handle the side effects i stopped taking the anti sickness drugs and the steroids after the second day and have been brilliant. I have even managed to have a 4 course christmas dinner without being sick as the first dose made me very sick and all that goes with it.  I am completely bald and the kids have been fine they know everything, i tried to keep it from them but i had to explain as i knew the changes they would have to cope with. It is amazing how they can talk about cancer in thier daily conversation iam gobsmacked as it is one thing i dont talk about. Anyways i hope you have had good news and know whats going to happen next as the waiting nd wondering is the worst. Be honest with youre wee ones as they will be amazing and with thier love and support you will get through this. I hope you let me know how u are and keep in touch luv n hugs xxANNxx",
      "MessageIndex": 15,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23014/to-chemo-or-not-to-chemo---that-is-the-question",
      "Title": "To Chemo or not to chemo - that is the question?"
    }
  ]
}