{
  "AuthorID": "AnnabelC",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annabelc",
  "Posts": [
    {
      "AuthorID": "AnnabelC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annabelc",
      "Content": "Take the pain relief, and watch rubbish on TV. I had lots of plans to improve my French, read books I had wanted to, organise stuff in the house... I bought a box set of Pink Panther movies and that was it.  Three week is still very good going and you are strong enough to feel annoyed by it all .... which IS a good thing xxx",
      "MessageIndex": 1,
      "PostDate": "15/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48050/post--surgery-infection",
      "Title": "post- surgery infection"
    },
    {
      "AuthorID": "AnnabelC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annabelc",
      "Content": "Hello  I had immediate recon after surgery and then RT. I had the LD flap with implant but very quickly after the RT my implant started to go solid and changed shape.  I had to wait to have that changed for a period of time after the RT, it took longer with that implant for it to go solid but it did unfortunately.  since then I have had two further attempts at implants and now have had it removed.  What I can say is that I am convinced that the LD flap has given me some shape even without the implant and although it all looks rather horrible i do have some shape.  I am waiting until May for everything to settle to find out what other reconstruction I can have. The LD flap and the RT I think would have been just fine, my body obviously doesn't like the implant.  I am sure yours will be perfect.  I don't remember any discomfort at the front just some at the back but at least that meant cuddling my children and sitting with them wasn't affected.  All I can say is that I exercised and stretched constantly to ensure full movement with my arm and although some very small areas are quite numb, generally it has not affected me in anyway.  I can use all the weights at the gym, it hasn't affected my strength and I can type at my computer for hours.  I will be thinking of you.   xx",
      "MessageIndex": 6,
      "PostDate": "04/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48647/immediate-reconstruction-followed-by-radiotherapy",
      "Title": "Immediate reconstruction followed by radiotherapy"
    },
    {
      "AuthorID": "AnnabelC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annabelc",
      "Content": "Hello  I know exactly how you feel and one of my closest friends who came off Tamoxifen a year before me felt the same.  I found it a comforting habit taking the tablet everyday , in fact I added another vitamin to my daily intake just to fill the gap.  I feel fine, I have to admit I put weight on when I came off it (not when I went on it) but everyone is different.  My lovely lovely oncologist said that research had said that, certainly for the cancer level I had, it was actually better to come off it. I have had panic attacks but it's all fine and you have been through FAR worse moments of anxiety.  You really are able to put it all behind you soon and think what an amazing person you are for having dealt with everything whilst looking at others who go into melt down about totally irrelevant things x",
      "MessageIndex": 1,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48005/5-years-clear",
      "Title": "5 years clear"
    },
    {
      "AuthorID": "AnnabelC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annabelc",
      "Content": "Hello Everyone As you will see in my profile I had breast cancer but still having problems with healing, implants etc. However in my work, as an art consultant,  I am involved in working on a new hospital purely for the treatment of cancer (any).  I want to find ways where art can help people  - I know that for my part if there had been some images/photographs etc above the treatment beds and during radiotherapy I would have valued any distraction. Where i was treated was a new hospital but it still had white walls with little sad pictures around, chairs lined up at the wall etc.   If any of you have and thoughts on types of art you would like to see or in fact anything you feel would have helped in the hospital environment I would really value your thoughts. xx",
      "MessageIndex": 0,
      "PostDate": "15/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48045/what-can-help-in-hospital-art",
      "Title": "What can help in hospital?.... art?"
    },
    {
      "AuthorID": "AnnabelC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annabelc",
      "Content": "Hello  When I had my mastectomy I had a reconstruction at the same time and that was followed by the radiotherapy.  The implant did start to get harder quite quickly and eventually became totally solid, that was eventually replaced and again that implant went solid too.  Before Christmas they decided to change the implant again but after about 2 weeks it started to leak from under the breast . I was told it wasn't infected and they changed it again in the new year.  Within a couple of days the leaking started again, I was told it wan't the implant (which when I think about the material implants are made of I should have known, but was beyond thinking reasonably)  My skin isn't healing properly and they have now removed the implant completely - something I have been terribly upset about.  I have to wait a few months and then they will consider what to do - the options mentioned are lipo or DIEP.  DIEP I am told is a major operation but the lipo I know nothing about, where they take it from, how long it lasts, will it stay in the breast area!! Does anyone know? Thank you  x",
      "MessageIndex": 9,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47961/puckerred-boob",
      "Title": "puckerred boob"
    },
    {
      "AuthorID": "AnnabelC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annabelc",
      "Content": "Hello  I suppose in my constant search to find the positives out of this experience Lipo has to be one of them!  You're right lipo first and then at least I have an alternative.  I did actually have the other side lifted and reduced a little to try to balance me out but now I have nothing to balance it with!! Anyway I will get there... slowly. Thank you so much it is so helpful to speak to someone who knows Very best wishes xx",
      "MessageIndex": 11,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47961/puckerred-boob",
      "Title": "puckerred boob"
    }
  ]
}