{
  "AuthorID": "Annagran",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annagran",
  "Posts": [
    {
      "AuthorID": "Annagran",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annagran",
      "Content": "I couldn't agree more June. I too was incensed at the article and like you am not obese, never smoked and ( so I thought )lead a healthy lifestyle. I cook everything from scratch, don't eat takeaways or processed meat, drink little alcohol and take regular exercise. Had WLE in November and am now on Letrozole - for 5 years - and have just finished 15 radiotherapy sessions. I asked my BCN why this might have happened to me and she just said 'You're female and you're getting older' and there's nothing you can do to change that is there ?! Oh and I also breast fed my children and carefully used non parabens underarm deodorants for as long as I can remember... It does leave you wondering just what you can do to avoid a recurrence doesn't it ? Whatever though, none of us is to blame for this happening. Letting off steam on here can be therapeutic though !",
      "MessageIndex": 8,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122644/newspaper-article-re-cancer",
      "Title": "Newspaper article re cancer"
    },
    {
      "AuthorID": "Annagran",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annagran",
      "Content": "Dear All Thought I was coping OK, tumour was not palpable, surgery was wire guided and report said margins were clear. After first two radiotherapy sessions I noticed a thickening at the top of my breast, not at the scar site, it also  felt tender there. radiographer wasn't sure what it meant and referred to oncologist for a review. She said she 'thinks' its just from the surgery ( though surgery was in early November) and though not at scar site it's really where the original tumour was. Nonetheless, she didn't seem 100% certain and has arranged for my post radiotherapy follow up to be a bit sooner than normal ( I've had 11 out of 15 sessions) in early March. Has anyone else had this ? Sorry but I'm not reassured so far. Since diagnosis in early October I've been scared that treatment might mean I wouldn't be able to travel to New Zealand in April for my younger daughter's wedding. Time is moving on, apologies if I sound paranoid, but don't know where else to turn.",
      "MessageIndex": 0,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122116/lump-developed-during-radiotherapy",
      "Title": "Lump developed during radiotherapy ?"
    },
    {
      "AuthorID": "Annagran",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annagran",
      "Content": "Thanks for your reply Jane, the thickening I've got is visible as well as palpable so it may be the same kind of thing. I'd have been less concerned if the radiographer and oncologist had both said it was not unusual. Good luck for your appointment and let me know how you get on ! x",
      "MessageIndex": 2,
      "PostDate": "26/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122116/lump-developed-during-radiotherapy",
      "Title": "Lump developed during radiotherapy ?"
    }
  ]
}