{
  "AuthorID": "Annie6",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
  "Posts": [
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "I switched from a generic to Femara and it did make a difference. Although I still have bone and muscle pain, it is nowhere near as bad. The hospital  switched from Herceptin to a biosimilar drug and I started getting more pain as well as headaches and insomnia. Now the hospital has switched me back to the proper Herceptin the pain has improved. I guess we all respond differently and even if your gp won’t prescribe Femara it’s worth switching to another to see what works best for you. We have to be taking them for long enough! ",
      "MessageIndex": 5,
      "PostDate": "15/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176576/letrozole-femara",
      "Title": "Letrozole/Femara"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "I have been given the Zometa infusion from round 2 of EC. It would have been from the first but my Vit D was too low. It will then be 6 monthly after the chemo. I will also be having Herceptin and radiotherapy and Letrazole after the end of the Herceptin. One more EC to go (had 3) and 12 Paclitaxel.  Best of luck for the start of your treatment.  Annie",
      "MessageIndex": 8,
      "PostDate": "28/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153455/herceptin-anyone-else-feel-yucky-for-4-5-days",
      "Title": "Herceptin, anyone else feel yucky for 4-5 days"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "I asked my oncologist about follow up testing and why they don't do blood tests for markers as well as mammograms. She said the markers are not consistently reliable and often tend to worry people for nothing and the mammograms should be enough. Obviously go to the doctor if you notice anything unusual or have any other symptoms. Once the 5 years of annual mammogram checks are finished and you go back to every three years, someone advised me to get an interim one at 18 months privately  as that should sufficiently pick anything up. I don't know about you but my BC appeared  in-between my regular mammograms this time. ",
      "MessageIndex": 4,
      "PostDate": "08/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158918/screening-once-treatment-is-all-finished",
      "Title": "Screening once treatment is all finished"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Mine is booked for a year after surgery date and I had surgery pre chemo etc. ",
      "MessageIndex": 7,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158918/screening-once-treatment-is-all-finished",
      "Title": "Screening once treatment is all finished"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Shellian - so sorry for your situation - really sympathise. We seem to get to a point in life where it feels like one thing after another. But can find solutions and it will get better, or we have to believe so. In the last few years I’ve lost both parents, got made redundant after 23 years, got divorced, son left for uni, moved house after 27 years last year and now the hideous breast cancer so really relate.  Do you have any kind of pension that you could take either the cash free lump sum or larger amount - if you opted out of serps perhaps? Or is yours all in state pension?  I am not working either now and agree the benefits available barely cover anything. I was told the max I would get would be £280 a month with universal credit based on no savings or income which wouldn’t even cover council tax and a couple of bills so have had to take pension early.  I really hope you can resolve things as financial worries put so much pressure on a relationship. The Maggie’s adviser I spoke to said that if bills are a problem speak to them and explain you’re having cancer treatment and can’t work and some will allow you to have reduced payments for a period of time. Your partner needs to get his accounts done so that you can then have a full picture of your household.  Do let us know how you get on. I feel sad for you - it really is hard. Hope you can find some good advice and you’re partner gets the kick up the bum he needs to help you.  Annie",
      "MessageIndex": 19,
      "PostDate": "22/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153174/i-just-cant-take-anymore",
      "Title": "I just cant take anymore"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "@Lottie8 I’m starting 12 weeks of Paclitaxel and the first of 18 Herceptin this week. I didn’t find my 4 EC a barrel of laughs with 3 hospital admissions. Will keep you posted with how things go. I’m 57 and have not been finding any of the chemo easy. i’ve probably had about 7 good days in 12 weeks. Hoping it improves. Do you get any good days with the weekly regime? I am Grade 2 ER+ HER2+++ no node involvement. Annie",
      "MessageIndex": 3,
      "PostDate": "29/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156154/taxol-12-weeks-having-trouble",
      "Title": "Taxol 12 weeks......having trouble."
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Lottie8 Thanks for the reply - half of the posts don't seem to go through to my phone so hadn't picked it up. It's really helpful to get a general idea of how people feel, even though we are all slightly different. I hope the last few improve for you.",
      "MessageIndex": 7,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156154/taxol-12-weeks-having-trouble",
      "Title": "Taxol 12 weeks......having trouble."
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "I got a Trendco wig too although it’s lovely I have to say I’ve not worn it. I find it a bit hot and scratchy so have been more comfortable with scarves in various patterns. Think it doesn’t help that my head in large and the wigs are a little bit tight. My favourites are from hipheadwear called jersey with a knot. So soft and comfortable. have fun trying them on. Annie6",
      "MessageIndex": 4,
      "PostDate": "08/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158859/wig-shopping-advice",
      "Title": "Wig shopping advice"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Best of luck with the op. I bought sports bras to wear but they all felt a bit tight so just wore my usual ones. My lump was 11 o’clock too and that wasn’t sore really at all. The underarm from node removal is more uncomfortable as it rubs but have been fine with overhead or button pjs. My op was 15th December and the underarm still a bit sore but quite manageable. Good luck. ",
      "MessageIndex": 5,
      "PostDate": "06/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146345/what-to-wear-after-a-lumpectomy",
      "Title": "What to wear after a lumpectomy"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Leolady56 - how did it go today with #3 Taxol? I had #2 today and slept the whole afternoon afterwards. Different from last week but not feeling ill like with the EC. Hoping a bit of energy comes back tomorrow. Only have steroids on the chemo day so happy to have less of them.",
      "MessageIndex": 93,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Loubag - I’m having 12 weekly Paclitaxel now (had 4 x EC first) along with Herceptin and Zometa 3 weekly until next May. First week of Paclitaxel  was fine - no side effects really-  but the second week has been harder with nasty bout of cystitis, blocked nose with nosebleeds and dodgy tum as well as achy legs and hips and just feeling yuk. It is a rollercoaster emotionally too so I think we have to allow ourselves the down days and enjoy the brighter ones. It is a long journey but we just have to go with it knowing it’s the best way forward. I wish you luck with your treatment and may the side effects be minimal. Annie",
      "MessageIndex": 136,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Loubag - I felt spaced out through most of EC I have to say. i had four rounds of EC with 8 days of filgrastin each cycle. I haven’t felt it with Paclitaxel - just a heap of other side effects. ",
      "MessageIndex": 154,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Violet25 - don't feel like a failure - we all react differently to the drugs. I've not been working and have to say there is no way I could have worked a single day while on EC from feeling too tired or too spaced out or just too unwell. Not that much better on the Paclitaxel, albeit not spaced out. Still need naps after doing very little. I hope everyone who is working isn't feeling pressured by their employer.",
      "MessageIndex": 161,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Veliz - I have had 4 x EC and Zometa and just started this week with Herceptin and the first of 12 x Paclitaxel (I asked to have this instead of T even though it is weekly as I believe side effects gentler). Zometa has been fine and the Herceptin was not a problem either. Feeling a bit achy today from the Paclitaxel and a little more tired but finding it easier than EC. Everyone is different as I’m sure you have read so hope you manage with minimal side effects.  Good luck.",
      "MessageIndex": 67,
      "PostDate": "06/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Ask123 - I’m not a doctor but it could be that your first one is over a longer period than the others. Mine was and now the Paclitaxel is only about an  hour or so. They like to monitor the first one carefully. Also, although  it has its side effects,  I still find the Paclitaxel easier than the EC and was very nervous before my first one too. Best of luck with it. ",
      "MessageIndex": 141,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "If your sickness is still bad ask them to give you Akynzeo on the day of chemo. It’s one of the strongest ones so should do the trick. Hope the side effects get better for you. ",
      "MessageIndex": 9,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121974/side-effects-of-ec-chemotherapy",
      "Title": "Side effects of EC chemotherapy?"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "JammyR - good luck with the Docetaxel tomorrow. Hope your side effects are manageable.  Annie",
      "MessageIndex": 208,
      "PostDate": "13/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Ruby Rose - I really feel for you and you are in the right place here to get support. We all have days like this - you are not alone.  Have you thought about asking them if it is possible or suitable for you to have Paclitaxel weekly instead which is supposed to be gentler. It seems to be offered often if the T is proving hard to cope with. It could be worth calling them to discuss. I have asked to switch and they were happy to without it affecting the efficacy of treatment. I think it may not immediately be offered as you go for more sessions.  It is all scary and we cope some days better than others. Having met others from this forum this weekend who are all further ahead in treatment, it gave me hope at getting through this as they have all managed it.  I hope you can sleep tonight and feel stronger tomorrow. Annie",
      "MessageIndex": 147,
      "PostDate": "10/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "leolady56 - i’m with you re the wig. I bought a lovely wig before chemo started and it wasn’t that cheap and had my head shaved before the first chemo. Have only worn the wig once and find the scarves so much more comfortable and much cooler. The wig is too hot and itchy. Ok, I’ve still months to go but I think the wig was a bit of a waste and am quite comfortable with a selection of different patterned scarves. Love the Jersey with a knot ones from HIPheadwear.  Good luck with your treatment - sorry to read you’ve ended up having to have the full suite of treatments. i’ve Just had my last of four EC, next will be the 12 Weekly Paclitaxel along with 18 Herceptin 3 weekly and Zometa 3 weekly, then 6 monthly. It will be a long journey but just take a week at a time. ",
      "MessageIndex": 207,
      "PostDate": "13/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Sympathies both. I’ve been admitted on day 8 each cycle. Frustrating it certainly is but I guess better than sepsis. Day 6 now after cycle 4 - will make sure bag packed tomorrow.  I do hope your stays are short. ",
      "MessageIndex": 246,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Just out of interest - do you find your temperature spikes tie in with GCSF injections? Or could just be the natural low. Frustrating, whatever the reason - hospital is exhausting! Good luck and may you be home soon. ",
      "MessageIndex": 247,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "From my understanding perjeta is given if node positive or advanced, but I could be wrong. I am ER+ and HER+++ and have had 4 rounds of EC (many hospitals dropping the F) plus am in the middle of 12 weekly Paclitaxel along with the 3 weekly Herceptin and Zometa. Paclitaxel is apparently better tolerated than Docetaxel. Previous comments are correct in that you have to have chemo alongside Herceptin and although it isn’t fun, better to zap any stray cells. I think it would be very risky to refuse it. Best of luck with your treatment anyway. ",
      "MessageIndex": 6,
      "PostDate": "29/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158114/refusing-chemotherapy-after-her2-results",
      "Title": "Refusing chemotherapy after Her2+ results"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Zebrano - I believe my hospital is dropping Docetaxel altogether. They are using Paclitaxel instead so you could ask about that. As it’s weekly it’s a much lower dose and better tolerated. I am also Her2+++ and ER+ I’m having 4 x EC (last EC next week) and 12 x Paclitaxel plus Herceptin and Zometa, radiotherapy x 25 and then Letrazole at the end for 10yrs. I’m sure they wouldn’t cut it if they didn’t think it was safe to but you could ask them again and express your concerns to be sure. Good luck.",
      "MessageIndex": 46,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Ruby Rose - the other strong one for nausea/sickness is Akynzeo. They usually give that if others fail but I expressed my anxieties so they agreed to give it to me from the outset. Best of luck",
      "MessageIndex": 70,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "Ruby Rose - so pleased you were well enough for your mum’s funeral. It’s a tough day when you’re feeling well. Your mum would have been so proud of you. I hope your side effects are manageable and you get through this difficult time.  Annie",
      "MessageIndex": 266,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "summer holiday - advice certainly varies from Trust to Trust and doctor to doctor. It probably depends on their specific protocols, particularly relating to drug regimes, although I have found them flexible if you have done your research.  I was advised not to to eat anything with probiotics, ordinary pasteurised yoghurt fine but no others and no high oestrogen food such as soya... Re oncologists - I see them three weekly too and my appointments have varied from a rushed 15mins when it has been hard to get through questions to two or three that have been over an hour. I have generally seen a different person on each visit, some the consultants and some the registrars. About to start Paclitaxel and Herceptin this week after 4 x EC. Good luck with round 5",
      "MessageIndex": 383,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "It must be trust dependent. I’m in the  South-East and didn’t pay.",
      "MessageIndex": 226,
      "PostDate": "16/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Annie6",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/annie6",
      "Content": "From my understanding perjeta is given if node positive or advanced, but I could be wrong. I am ER+ and HER+++ and have had 4 rounds of EC (many hospitals dropping the F) plus am in the middle of 12 weekly Paclitaxel along with the 3 weekly Herceptin and Zometa. Paclitaxel is apparently better tolerated than Docetaxel. Previous comments are correct in that you have to have chemo alongside Herceptin and although it isn’t fun, better to zap any stray cells. I think it would be very risky to refuse it. Best of luck with your treatment anyway. ",
      "MessageIndex": 21,
      "PostDate": "29/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158114/refusing-chemotherapy-after-her2-results",
      "Title": "Refusing chemotherapy after Her2+ results"
    }
  ]
}