{
  "AuthorID": "Apple123",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
  "Posts": [
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Hi Jo I'm also 38 I've only just finished 6/6 chemo treatment so nowhere near as far ahead as you I totally understand your fear thou you can do this as you have proven on more than 1 occasion may be try a bit of meditation as I find that this really helps me with anxiety just listening to waterfalls on the net works for me but everyone is different. Maybe ask your doctor for something too as I know meditation sometimes is not enough Hope everything works out for you big hugs x  Angela x",
      "MessageIndex": 1,
      "PostDate": "24/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88788/fear-after-treatment-ends",
      "Title": "fear after treatment ends"
    },
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Hi all  Only got home from hospital yesterday after having a single mastectomy and immediate reconstruction after being diagnosed with gradee 3 BC sept 14 already had my chemo but im feeling really anxious about the possibility my lymphs that they removed during my surgery come back positive I know I should try not to worry but easier said than done any tips to take my mind off it bearing in mind I'm not that mobile yet after surgery and still have my drainage bag on!!  Any suggestion welcome please xx",
      "MessageIndex": 0,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90597/anxiety-between-mastectomy-and-lymph-results",
      "Title": "anxiety between mastectomy and lymph results"
    },
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Hi I have already had 6 lots of chemo ( terrible time but got through it) and just had my single masectomy and immediate reconstruction 6 wks after end of chemo I had 3 lymphs removed and find out the results on weds 4th March I think the reason I'm worrying so much is a few weeks ago my armpits where swollen and lumpy but had a scan a week later and they had gone down however when I had my initial scan and biopsy back in sept 2014 2 different doctors where 90% sure that it was a benign tumour when results came back turned out it was a grade 3 invasive ductile carsinoma! ! Hence the reason me having doubts with doctors interpretation of a scan!! Sounds like I'm moaning but I really don't want to have to tell my family there will be more treatment to come in terms of radio more ops etc..",
      "MessageIndex": 10,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90597/anxiety-between-mastectomy-and-lymph-results",
      "Title": "anxiety between mastectomy and lymph results"
    },
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Audio book sounds like a fab idea I'm going to try that now.. Thanks xx",
      "MessageIndex": 4,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90597/anxiety-between-mastectomy-and-lymph-results",
      "Title": "anxiety between mastectomy and lymph results"
    },
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Hi Liz thank you I'll  ask my hubby if he can go and find an audio pillow. I tried games and I'm on 461 candy crush but then I get angry and frustrated when I'm struggling to complete a level haha think I've been stuck on the same level for almost 2 weeks. It's silly how the most smallest of things can make me angry or cry I used to be such an organised but chilled person I'm hoping it's the chemo that has made me feel like this and it will soon pass think I'd have an heart attack if I keep going like this!! So I'm really trying not to get mad x",
      "MessageIndex": 6,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90597/anxiety-between-mastectomy-and-lymph-results",
      "Title": "anxiety between mastectomy and lymph results"
    },
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Thanks for your response mistymoley I know it's a waste of time worrying just can't help it!! Can't keep focused on a book or tv either buts thanks for your suggestions x",
      "MessageIndex": 2,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90597/anxiety-between-mastectomy-and-lymph-results",
      "Title": "anxiety between mastectomy and lymph results"
    },
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Hi new2this Sorry to hear your feeling alone it's sounds like you're having a bad day it's something we all have going through this horrible disease and beyond. Please don't feel like you're on your own you can talk about anything and everything on here sometimes just posting your thoughts, fears and feelings really helps. I'm still wide awake if you'd like to talk now x",
      "MessageIndex": 2,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90641/does-anybody-talk-here",
      "Title": "does anybody talk here?"
    },
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Morning new2this sounds like your in better spirits today. It does take weeks if not months to get over the shock of diagnosis your not the only 1 who missed any signs of the dreaded disease I found mine by way of chance from a single sharp pain in my chest which just happened to be on the same side of the lump in my breast please don't beat yourself up over it the good news is it's now been found and is being treated they can wonders with medicine today so stay as positive as you can and fight and if you need a scream moan or anything just holler on here and we will be here x",
      "MessageIndex": 5,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90641/does-anybody-talk-here",
      "Title": "does anybody talk here?"
    },
    {
      "AuthorID": "Apple123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/apple123",
      "Content": "Hi less Sorry to hear about your news I was diagnosed in sept with grade 3 invasive ductal I have suffered with anemia for years and it does make you feel very tired but the doctors with give you iron tablets or an iron injection and you will start to feel stronger. Once you have your full treatment plan you will feel more focused in fighting this awful disease with us all that are in this horrible club having a good scream and cry often helps and don't be afraid to rant on here about anything xoxo",
      "MessageIndex": 5,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90657/newbie",
      "Title": "newbie"
    }
  ]
}