{
  "AuthorID": "Arthur12",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/arthur12",
  "Posts": [
    {
      "AuthorID": "Arthur12",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/arthur12",
      "Content": "Hi, Prior to my diagnosis I had been to the doctors because I had been feeling out of sorts for a long time. I just wasn't myself I was tired and had aching joints and just seemed to have lost my mojo. My Doctor arranged for me to have some blood tests and the upshot of those were I was in his words 'almost' severely deficient in Vitamin D. Great or so thought a supplement and all would be well.Anyway a couple of weeks later I found a lump in my breast whilst showering. I guess most of us know the feeling of shall I go and get it checked out or is it just lumpy breast tissue. I was in two minds as I had only just been to the doctor's and thought he might think I was being a hyperchondriac I'm so glad I did go back as after being referred to  BC clinic I was diagnosed with breast cancer. I have since found out that low levels of Vitamin D can be an indicator of cancer and know that my tiredness was probably a combination of the two. I'm on the mend now physically and feel more like my old self...I have some motivation. I still have some dark days and am still sore but I am now looking forward. I am now a great believer if you are not sure if something is right or not get it checked out it is so much better to be safe (and get treatment as early as possible) than sit and worry about what if. I hope all goes well with your treatment and know that things do get better...with time and patience.",
      "MessageIndex": 7,
      "PostDate": "12/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123115/tiredness-and-aches",
      "Title": "Tiredness and aches....."
    },
    {
      "AuthorID": "Arthur12",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/arthur12",
      "Content": "Hi Emj, Thank goodness for the trial in your area especially that the cancer has now been caught early. However, I get how you are feeling. My husband told me he will never forget the moment we were told that I had cancer, neither will I. It is such a shock when you here those words out loud and so hard to comprehend how it can happen to you especially if you look after yourself health wise. Good diet,exercise etc...I breast fed both of my children for nearly a year - believing at the time this offered some protection. It does all sound like the positive end of a negative with regards to the fact that the cancer was found early and that you don't have to have Chemo , this was my biggest fear but I too was lucky like you and my cancer was caught early. having said that it doesn't belittle the fact that you have had a cancer diagnosis and are experiencing all the anxiety that comes with it. I finished my radiotherapy just over 4 weeks ago. The treatment wasn't as bad as I thought, the hardest part was having to lay still. It's just like when someone tells you not to touch all you want to do is touch. Why is it when you are told to be still you suddenly develop an itch! The radio therapist recommended to me to use 100 percent Aloe Vera gel and E45 cream. I took the Aloe Vera gel with me to my treatments to use on the affected area straight after. I then used the E45 before I went to bed not sure if I am lucky but only suffered from slight redness of the skin. I did find that I had bouts of tiredness during the treatment so I set myself a time during the day where I would just sit and shut my eyes if I dozed off great, if not at least I felt had rested. I am also on Tomoxifen I do have some side effects from this ie night sweats and some hot flushes during the day but on the whole I think on it as a small price to pay. My oncologist recommended taking evening primrose oil with the Tomoxifen as she said that some women find this helps with regards to the side effects. Trying to stay positive is pretty hard and now and again a negative thought will creep in. I just try to shut it down as quickly as I can and try to think I am lucky there are people who are worse off than me. It also helps if you have positive family and friends around to support and listen and to treat you as they did ant not with kid gloves.  This site is great not only because you are able to speak to people who are experiencing what you are and get good advice but it reassures you that your feelings are normal and they are part of the journey you are going through. I am not sure if you ever get over a cancer diagnosis but from what I have read here we will learn to live with it. Wishing you all the best.",
      "MessageIndex": 2,
      "PostDate": "17/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113489/new-to-the-group-and-not-quite-sure-what-i-should-be-feeling",
      "Title": "New to the group and Not quite sure what I should be feeling?"
    }
  ]
}