{
  "AuthorID": "ASB",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
  "Posts": [
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi I hope you are all doing ok today. I am so happy to be going for my last chemo and I have booked a holiday today (going in 3 months time all being well)...and I'm just wondering if anyone thinks I am likely to have much hair after 3 months as it would be great to think I could look forward to going wig/hat free? Does Herceptin slow down hair growth at all? Any advice would be much appreciated! Thanks.",
      "MessageIndex": 0,
      "PostDate": "10/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56748/final-fec-tomorrow-woop-woop-then-herceptin-starts-but-how-long-till-i-get-some-hair-back",
      "Title": "Final FEC tomorrow (woop woop) then Herceptin starts but how long..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "I will add zinc and vit c to my list...parsley is meant to.help too and apparently u can buy it as a supplement! x",
      "MessageIndex": 5,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56748/final-fec-tomorrow-woop-woop-then-herceptin-starts-but-how-long-till-i-get-some-hair-back",
      "Title": "Final FEC tomorrow (woop woop) then Herceptin starts but how long..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Thanks for the replies...i'll have a think about the shampoo once i get some hair. I guess i just need to.be patient and wait to see what happens! x",
      "MessageIndex": 3,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56748/final-fec-tomorrow-woop-woop-then-herceptin-starts-but-how-long-till-i-get-some-hair-back",
      "Title": "Final FEC tomorrow (woop woop) then Herceptin starts but how long..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Trudy It sounds like we're at a similar stage. I had 2 biopsies today and am going back for the results on Friday and I'm also going to an appt. in oncology then. I've been ok all day and have been telling everyone who I've had to break the news to that I'm fine etc. but then I lay down on my own on the sofa and closed my eyes an hour ago and suddenly it hit me and I though s**t this is really happening and I'm not ok...I'm really scared...but I guess this is the start of a roller coaster of emotions. I'm so glad I found this forum! Take care, Abbey",
      "MessageIndex": 7,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53020/hi-i-m-new-here",
      "Title": "Hi I'm new here..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Trudy Telling family is hard and I can totally understand you not wanting to tell your son given the circumstances...it's so hard!  I've explained things very simply and in a positive way to my 8 yr old son as I didn't want him overhearing conversations and wondering what was going on!  I was dreading telling my mum the most as I wanted to protect her but she was so great...and stonger than I expected but then she has been through chemo herself so can advise me a bit hopefully. I've just seen that you live in Devon too! I'm in Honiton. Are you going to RD&E at Exeter? Abbey",
      "MessageIndex": 16,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53020/hi-i-m-new-here",
      "Title": "Hi I'm new here..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Thanks Patricia :)  ",
      "MessageIndex": 2,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53020/hi-i-m-new-here",
      "Title": "Hi I'm new here..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Shutzie Good luck with your treatment...I'll bear the food advice in mind! My mum had chemo 5 yrs ago and she read that cancer cells hate broccoli and that you should eat as much of it as possible and drink the water it's cooked in...(as gravy I suppose!). She even eats it on the side next to a chinese ready meal!! Take care Abbey",
      "MessageIndex": 9,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53020/hi-i-m-new-here",
      "Title": "Hi I'm new here..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Shawshank The waiting and not knowing is awful. I think I'm being fast tracked or something as they cocked up at the hospital last week when I turned up for my first appt. which was my 2 week referral and they decided to close the breast clinic early due to staff shortages and wouldn't see me so so I had to wait another week and so spoke to my GP who wrote a letter complaining so I guess now they're trying to  make up for it  so I've only got to wait 3 days for biopsy result. I hope you hear before two weeks and definitely keep chasing it up. Fingers crossed for us all. Take care Abbey",
      "MessageIndex": 8,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53020/hi-i-m-new-here",
      "Title": "Hi I'm new here..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Just wanted to say hello as I've been reading some posts on the forum which are full of such useful information and you all sound so supportive to eachother...I think I may be using this forum alot in the weeks/months to come as I've just been told today that I have a lump that's probably cancerous after going to the breast clinic and have been advised to have chemo to shrink it before they remove it. I feel surprisingly ok at the moment but then I've had 3 weeks since being referred by th GP to get my head around it (and not alot of sleep!)... I guess the worst is to still come but I'm determined to beat it whatever it takes and stay strong. Abbey",
      "MessageIndex": 0,
      "PostDate": "04/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53020/hi-i-m-new-here",
      "Title": "Hi I'm new here..."
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi I saw your previous posts and am so pleased to hear you are feeling better today...did you have the jab on top of the antisickness tablets as they weren't working? I'll have to remember that as I want to be as organised and prepared as I can be as I start my first chemo this Friday. I really hope you continue to feel ok and good luck! Take care",
      "MessageIndex": 1,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53130/today-a-new-day--",
      "Title": "Today a new day :-)"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Glad to hear it seems to be shrinking and I hope it went ok today too. I start Herceptin tomorrow so fingers crossed for no horrid side effects...then I have a scan next Friday",
      "MessageIndex": 21,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56173/its-spread-so-scared",
      "Title": "its spread so scared"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Wow...that's a great result Sue. I'm really pleased to hear your good news this morning. :) Love and hugs back to you too.",
      "MessageIndex": 23,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56173/its-spread-so-scared",
      "Title": "its spread so scared"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi I have mets in my liver and finished 6 cycles of FEC 6 weeks ago and have had 2 Herceptin...I went to discuss the post chemo scan yesterday and it shows the cancer in my liver appears to have spread a bit so the Onc suggested I have docetaxol alongside the Herceptin. I am just enjoying feeling well again after the fec and am really looking forward to a holiday in Turkey in 6 weeks time with my family so i have decided to postpone the Docetaxol and just have herceptin...then have a scan in May to see how things look. There is a chance the Herceptin could still shrink things but apparently it is more effective when combined with the dreaded Docetaxol. Has any one else been in a similar position. I just want a few months of feeling normal before I have to go through it all again. Be really nice to have a 'bit' of hair when I go away and be able to swim. I never thought I'd need more chemo so soon after the first lot! I guess I want somebody to say they understand how I feel! Thanks!",
      "MessageIndex": 0,
      "PostDate": "23/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58105/postponing-more-chemo-have-i-made-right-decision",
      "Title": "Postponing more chemo...have I made right decision?"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Thanks SaxxyD. Sounds like you've got some lovely things to look forward to...just keep thinking about all those nice things when times get tough...that's what I've been trying to do. I will be keeping everything crossed for you that the results of the scan are ok. I expect it is hard not to worry though. I have just looked at my Paris flights and I can re-arrange them for October and will have to pay a fee but at least we hadn't booked hotels and park tickets so I guess that might be the sensible thing to do if I do need to start chemo again in April or May....it will still be something nice to look forward to...just might be a bit chillier in Oct but I don't really want to be travelling while on Deocetaxol and that leaves time for 7 treatments in case one of the chemo is delayed! I feel a bit better now I have it all a bit more sorted in my head...It's such a pain having to plan life round cancer treatments isn't it? Which centreparcs are you going to? I love it there...in fact I'm off to longleat on Wednesday for a spa day with my partner for a birthday treat. I thoroughly recommend a visit to aquasana as its is so lovely and relaxing....just what I need right now. I was a bit worried about going with my current patchy post chemo skinhead look but I ordered something called a turbi towel on eBay to wear and I think it will look ok with a robe on so I won't feel so self conscious in there! Italy sounds good too...another place I love! Take care.",
      "MessageIndex": 4,
      "PostDate": "24/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58105/postponing-more-chemo-have-i-made-right-decision",
      "Title": "Postponing more chemo...have I made right decision?"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Sue I think we had some conversations on here a few months back. I'm so so sorry to hear your news...its totally understandable that you are feeling emotional and very upset...you've had a huge shock thats turned your world upside down. I too was diagnosed with secondaries (a week after the primary lump was discovered in August) and I am now 5 chemos down with one more to go (and then Herceptin for a year). I've been told that the side effects with Herceptin are nothing like chemo hopefully, just possible flu like symtoms I think. I think we have to stay positive. Remember everybody is different and you have so much to fight for with 3 young children. It is ok to feel upset...better that than bottle it all up. I just hope that in time you will regain some of your strength and positivity. My initial CT scan showed secondaries in my liver and bones but then I had  a bone scan after chemo no. 1 and there was absolutely no sign of anything in my bones at that time! My liver had a 3cm area and the breast lump was 3.6cm but the 2nd CT scan I had (after chemo no. 3) showed that everytning had shrunk by 50% so I am trying to remain positive that I will be one of the lucky ones and I hope that you will be too. Many women with secondaries go on to live for many many years and hopefully new treatments or even a cure may become available during that time!  Thinking of you and I hope you can start to get your head round this and regain your strength and fighting spirit soon. Abbeyx ",
      "MessageIndex": 3,
      "PostDate": "23/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56173/its-spread-so-scared",
      "Title": "its spread so scared"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Thanks for you reply aroma mum...I hope you are doing ok at the moment. When I was sat at the hospital my immediate reaction was no I can't handle any more chemo yet but now the more I Think about it the more I think there's no point putting it off when I know it's inevitable. My holiday is only 6 weeks away so gives me time to have 2 more herceptins to see if that makes any difference. The Onc was going o book a scan for May but maybe I'll ask to have it in April as soon as I get back from my holiday and then get straight back to chemo then! Due to my diagnosis we have booked a few nice things which kept me going during the last lot of chemo. We have booked flight to Paris and were planning to take our 8 yr old to Disneyland and Paris but I'm not sure that will be doable 6 days after docetaxol so maybe I'll have to postpone that now and just get on with the chemo...but I guess I know it's then going to be 5 more months of feeling yucky a lot of the time. It's so hard to know what the right thing to do it...I guess writing this is like a sort of therapy for me! I have tears in my eyes now...first time since finding out the latest bad news. Sorry to go on but I know some of you ladies may understand what I'm going through and may have been in a similar position. I'm not saying I won't have more chemo but now I just keep thinking it may be getting worse so how can I just 'forget about it' and enjoy the next few months with that thought going through my mind...it's so hard! My partner seem to think I've made a sensible decision but then he's not me and having been told docetaxol and Herceptin are more effective together it's a tough decision to make.",
      "MessageIndex": 2,
      "PostDate": "24/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58105/postponing-more-chemo-have-i-made-right-decision",
      "Title": "Postponing more chemo...have I made right decision?"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hope everyone is doing ok today. I was meant to start last Friday but had the bad news from the CT -  secondary cancers in my liver and bones,and they suggested I may want to wait and get my head round that bad news first. I was booked in to start this Friday but am taking control (of the things I can still control) and I got on the phone yesterday and said I want to start asap so today is the day. It's feels a bit like the doctors and nurses so far don't hold out much hope and haven't offered me any positive words but I guess that's just the way they are...my friends and family are all so positive and if I have anything to do with it thie chemo is gonna start working and even if 'they' don't seem to think my future looks good... I'm gonna fight this all the way... I read something on another site yesterday from a woman still going strong 9 years later. Wish me luck...     ",
      "MessageIndex": 0,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53387/1st-chemo-today-today-i-start-fighting-back",
      "Title": "1st chemo today...today I start fighting back!"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Thank you for the lovely messages. I'm back home now and the first treatment went really well...the staff were excellent and made me feel so comfortable and relaxed. I got home to find that my friends have dropped round tea for tonight, plus a home baked cake and a lovely hand crochettted purple beanie hat with a flower on the front. It brought such a smile to my face... knowing I'm not facing this alone makes such a difference. Just gotta wait to see what the side effects will be for me...fingers crossed. Thanks to all you ladies for your support.",
      "MessageIndex": 6,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53387/1st-chemo-today-today-i-start-fighting-back",
      "Title": "1st chemo today...today I start fighting back!"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Thanks...will take a look sometime.  ",
      "MessageIndex": 2,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53382/fab-just-a-fab-find",
      "Title": "FAB! Just a fab find !!!!"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Annabel Sorry you are going through such a difficult time. I don't know what to say that others haven't said but worrying about what might be really won't help but that's easier said that done and we all have days when we are low. It's ok to feel scarerd sometimes as nobody can be strong and positive all the time with this thing hanging over them. I hope you are feeling a little better about things today and I'm thinking of you and I'm sending you love and hugs. I'm going to try a 'healing circle' in a few weeks time so will be thinking of all the lovely ladies on here and sending lots of positive vibes. Take care.  ",
      "MessageIndex": 10,
      "PostDate": "12/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54162/feel-like-i-am-back-at-square-one",
      "Title": "Feel like I am back at square one"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "It's good to share your true feelings on here...we can't always do it with people we know and care about so good for you for being brave enough to be honest. I don't know what I can say to help but you aren't on your own and we all have to be strong for eachother when we can and you certainly aren't winging over nothing. Focus on the positive...I think that's the only way. The wig should make you feel better hopefully. I got a lovely one sorted in advance and I'm now looking forward to losing my hair because if the drugs are are attacking the hair follicles then that means they'll be attacking the cancer cells too hopefully. Take care and I hope things get better for you soon x ",
      "MessageIndex": 17,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53326/s-t-fed-up-with-the-stress-of-it-all",
      "Title": "S**T !! Fed Up With The Stress Of It All !!!"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "It's good to share your true feelings on here...we can't always do it with people we know and care about so good for you for being brave enough to be honest. I don't know what I can say to help but you aren't on your own and we all have to be strong for eachother when we can and you certainly aren't winging over nothing. Focus on the positive...I think that's the only way. The wig should make you feel better hopefully. I got a lovely one sorted in advance and I'm now looking forward to losing my hair because if the drugs are are attacking the hair follicles then that means they'll be attacking the cancer cells too hopefully. Take care and I hope things get better for you soon x ",
      "MessageIndex": 2,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53326/s-t-fed-up-with-the-stress-of-it-all",
      "Title": "S**T !! Fed Up With The Stress Of It All !!!"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi all I'm having the line fitted tomorrow and can't stop worrying about it having it fitted and also living with it after. Just the whole idea it is making me feel sick. I don't know if I could have a port instead  if I don't like it - would I be able to change after it's done? I had to make a decision on the spot so had no time to think about it or look into it but they said I'd have to wait longer if I wanted a port so that's why I went for the line. I think it's making everything seem more real now. It sounds crazy but in the back of my mind I still keep thinking someone at the hospital will say sorry and that they've mad a mistake in the diagnosis! They haven't given me an appt.  time yet which doesn't help with the stress as I've got to organise work and school run around it and so I'm not sure if I'll have to go on my own. I think I'd prefer a sedative or something of they can give it so I guess I wouldn't be able to drive home. Thanks in advance for any advice. Abbey x",
      "MessageIndex": 0,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53212/worried-about-having-a-hickman-line-reassurance-needed-please",
      "Title": "Worried about having a hickman line...reassurance needed please!"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi and thanks everyone for your replies and kind words. It's an early appt. at 9.30am so at least I won't spend the whole day getting nervous, and my mum is driving me...I think she might have to stand behind me and push to get me into the hospital mind you! I had a CT scan today and I was bad enough just having the iodine in my vein! This time tomorrow it will all be over hopefully then its 1st chemo the next day to look forward to! Hope you are all doing ok today. I'll let you know how it goes. Abbey x    ",
      "MessageIndex": 6,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53212/worried-about-having-a-hickman-line-reassurance-needed-please",
      "Title": "Worried about having a hickman line...reassurance needed please!"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi guys Well the procedure itself  was absolutely fine..the nurses and doctor were lovely. They gave me an oral sedative and I didn't feel a thing or see anything nasty as it was all done behind a sheet type thing!! However it is painful when I swallow and turn my head ... I've had 3 lots of pain killers since and I am feeling a bit sorry for myself and hope I feel better tomorrow for chemo. Will the soreness wear off soon do you think? Thanks for all your help. Abbey x",
      "MessageIndex": 9,
      "PostDate": "13/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53212/worried-about-having-a-hickman-line-reassurance-needed-please",
      "Title": "Worried about having a hickman line...reassurance needed please!"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Just wanted to say Hi and welcome. Sorry to hear your diagnosis...it's a huge shock so not surprising you're not sleeping well. I was diagnosed with primary and secondary breast cancer at the same time last Sept and have had my ups and down but like you I too try to stay positive but of course we all have times when we are scared and worried about what the future may hold. This site is full of wonderful ladies to answer questions and give support when needed. Take care,",
      "MessageIndex": 1,
      "PostDate": "15/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57819/hello",
      "Title": "hello"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "You should feel proud Joanie. I'm back home now and the first treatment went really well thanks. Fingers crossed it will do some good! xx",
      "MessageIndex": 1,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53391/secondary-cancer",
      "Title": "Secondary Cancer"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Joanie I'm having 3 cycles of FEC and then they will reassess and see if they need to carry on or change the treatment. There is a cancer charity near me that offer all sorts of advice, counselling and treatments so I intend to make use of them. I dread having to go back to the oncologist or getting further scan results as so far each appt. has brought one bit of bad news after another but I know theres no point worrying about all that now. One day at a time! The chanting sounds good and if its helping don't worry about your neighbours! Thanks and you take care too.",
      "MessageIndex": 3,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53391/secondary-cancer",
      "Title": "Secondary Cancer"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Just wondering as I was diagnosed with mild MS 2 years ago and have been on Rebif but today the Consultants said I have to stop the Rebif while I'm being treated and also that the chemo could affect you neurologically and therefore affect the MS. Thanks in advance Abbey x",
      "MessageIndex": 0,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53107/anybody-else-here-with-ms-who-also-has-breast-cancer",
      "Title": "Anybody else here with MS who also has breast cancer?"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Lisa Thanks for your reply. I hope you are doing ok? What a shock for you to be diagnosed with the cancer and MS at the same time! It's good that your treatment didn't make it any worse. I've had 2 FECs and so far everythings is ok so hopefully as my MS is very mild it will be fine so fingers crossed. Take care Abbey x",
      "MessageIndex": 2,
      "PostDate": "27/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53107/anybody-else-here-with-ms-who-also-has-breast-cancer",
      "Title": "Anybody else here with MS who also has breast cancer?"
    },
    {
      "AuthorID": "ASB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/asb",
      "Content": "Hi Just wondering has anyone else experienced anything like this? I had the infusion on Friday and noticed the sore shoulder yesterday morning and it seems to be getting a bit worse now...whenever I lift my arm it hurts quite a bit. It feels like a really bad bruise over the whole of the front of my shoulder. Could it be a side effect? Thanks in advance.",
      "MessageIndex": 0,
      "PostDate": "04/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57537/sore-bruised-feeling-in-shoulder-a-few-days-after-1st-herceptin",
      "Title": "Sore/bruised feeling in shoulder a few days after 1st Herceptin....."
    }
  ]
}