{
  "AuthorID": "Aspen",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
  "Posts": [
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Should clarify - my measuring scans were the day after my last chemo and the meeting with the surgeon a week later.  Good luck xx",
      "MessageIndex": 2,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158289/scan-following-last-chemo",
      "Title": "Scan following last chemo"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Congratulations on finishing your chemo, Jackster.  Length of time for results will vary from hospital to hospital but I already had a meeting with my surgeon planned for a week after my last chemo and the results were available and discussed then.  I presume as you still are talking about the tumour that, like me, you received neo-adjuvant chemo and will get surgery after.  I would imagine that you will get an appointment fairly soon with your surgeon and they will then set a date for your surgery.  My surgery was almost 5 weeks after my last infusion.  They will give you enough time for the effects of your last chemo to wear off and you to be generally well.  I would certainly give them a call though as it's not nice to be left wondering.  Sure it will be soon.  L xx",
      "MessageIndex": 1,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158289/scan-following-last-chemo",
      "Title": "Scan following last chemo"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "HI NiceCuppa I just wanted to give you a hug and tell you this crapness won't last forever.  When we are physically low - and multiple hospital admissions with neutropenic sepsis certainly qualifies in that category - it brings us low mentally as well.  Your resilience for the wee knocks in life that you could have taken in your stride before just isn't there.  You are having to concentrate all your efforts on just getting through this horrible treatment and getting yourself well.  I know what you mean - if the nurse had said it in the present tense it would have been a different matter.  I had 2 admissions with NS after my first docetaxel but, I'm not sure where you are with that, I didn't have any on the 2nd and 3rd doses.  Just being in the hospital is depressing when you are away from your family, never mind feeling physically rubbish.  I was in over the Beast from the East last year and Edinburgh was very badly hit - no public transport for 3 days and roads undriveable.  So it was very weird in the hospital with no-one getting any visitors.  Thank god I could get on the hospital wi-fi as I work at the uni and could Facetime my hubby and son and stream some films.  You are definitely not broken, just a bit bent at the moment.  Time really is a great healer and every day you will get that bit stronger when the chemo is finished.  All the best love, Linda xx",
      "MessageIndex": 4,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177013/fuming-with-comment-from-nurse-in-chemo-unit",
      "Title": "Fuming with comment from nurse in Chemo unit"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Maria, if you’re waiting on a response from the cancer team and need something over the counter in the meantime, the gel that is named after an Eskimo dwelling (can’t say name on here) was the only one I found that worked , ie it stayed on well and formed a good protective coating on the ulcers.  Best wishes Linda xx",
      "MessageIndex": 4,
      "PostDate": "22/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178546/pesky-mouth-ulcers-driving-me-crazy",
      "Title": "Pesky mouth ulcers driving me crazy"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Kacang Glad to hear you got relief from the acupuncture. I can also heartily endorse it. I had a frozen shoulder that came on on my non-BC side around the time of my diagnosis (stress I think). Then the surgery side developed into frozen shoulder about 2 months after my treatment finished. Both treated very successfully with acupuncture. Had to pay privately though as NHS physio didn’t offer it.  Linda xx",
      "MessageIndex": 5,
      "PostDate": "02/06/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/182145/ais-and-acupuncture",
      "Title": "AIs and acupuncture"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi there,  Looks like I’ll be joining the December club. Just got told today that I’ll be starting a course of 6 FEC-T on Wednesday 20th. Pretty short notice and it’s put me in a bit of a spin with my Christmas preparations but I suppose the sooner the better from the viewpoint of getting the cancer beat! Plan is then lumpectomy and affected lymph node removal.  Been reading the chemo tips link which is really useful. I have an 11 year old son and just not sure how I’m going to cope with the childcare side of things, although I’m lucky in that I can get sick leave from work, have a great hubby and it’ll be the holidays anyway at the moment. Just feels like a sucky way to spend Christmas.  Cheers xxx",
      "MessageIndex": 18,
      "PostDate": "15/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi all, I just got diagnosed on 6 December with a grade 3 IDC which is also in a lymph node.  I am due to start a course of FEC-T on Wed 20 Dec.  It has all been so quick, like suddenly stepping from a standing start onto a speeding rollercoaster.  There was no lump to feel in my breast but my lymph gland was swollen so that's what I felt.  They think the primary in the breast is about 1cm, couldn't pick it up on mammogram but did on ultrasound.  Gradually had that sinking feeling when they were doing multiple biopsies on my boob and underarm, then I was the last man standing in the clinic and then they asked if I wanted my husband in.  It has been a whirlwind of appointments since but they have been brilliantly quick.  All other scans clear although still to get MRI on breasts on Tues to check if anything else they haven't picked up.  Was sort of hoping I'd be able to enjoy my turkey before I got a chemo date but I'll just have to get on with it.  I am bloody petrified, truth be told.  Just got told about the chemo start date today and I've been on the phone ever since trying to get flu jab, dentist appt and wig appt.  Also need to tell work I won't be back before Christmas.  Should I try to get all my shopping and wrapping done now?  Will I be totally wiped?  Am I not going to be able to pick my son up from school or cook his tea?  It all seems such an unknown.  Really good to have found this community though. thanks  xxx",
      "MessageIndex": 0,
      "PostDate": "15/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144863/just-diagnosed-chemo-about-to-start",
      "Title": "Just diagnosed, chemo about to start"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Thanks, guys.  It's good to get a bit of reassurance and support.  I have also posted on the Dec Chemo club.  It all still feels very surreal.  I've been very impressed with the NHS here in Edinburgh - all been so quick and smooth.  Literally 2 weeks from biopsy results to first chemo!  But I also need time to process it and that's difficult at any time of year but with a thousand other things to think about with Christmas, it's doubly hard.  Love and hugs to all xxx",
      "MessageIndex": 4,
      "PostDate": "16/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144863/just-diagnosed-chemo-about-to-start",
      "Title": "Just diagnosed, chemo about to start"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "It's such a crap time to do this before Christmas, isn't it, Bigguy?  I hope you find your ice-poles.  Great memories of those from school.  I had first FEC chemo today.  All right so far, taking it as it comes.  I'm dreading feeling crap on Christmas Day with an excited 11-year-old opening his presents. Fingers crossed I'll manage.  Take care xx",
      "MessageIndex": 25,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hellooooo.... *waves to all* Just wondered who else is still on the Dec Chemo club?  Has anyone else started just pre-Christmas?  I suppose it's been understandably quiet with the big day getting in the way.  I had my first FEC-T on Wed 20th.   Been feeling much more like myself again in the last couple of days.  Felt quite nauseous on the evening of the chemo but it was pretty well controlled over the next 3 days with Granisetron and the steroids.  Was constipated but that shifted eventually with the Laxido.  I did manage some Christmas lunch by naughtily taking the Granisetron for the other 2 days that I had tablets for, although the box said for 3 days.  It was Christmas Eve and Christmas Day!!!  I did feel very ropey on Boxing Day with only Metoclopromide left, with instructions to take as and when, but I felt it was actually adding to my stomach cramps, which was the main thing that was making me feel sick/dodgy.  I read somewhere on a thread that the Laxido could help with the stomach cramps so I continued to take it for a couple of days and think it did, but could have been placebo or it just cleared up anyway. Now feeling that slight morning sickness way that gets better as the day goes on.  Appetite coming back slowly.  The worst thing was that hubby had the flu about 2 days after my chemo and I was paranoid about getting it, and it also floored him for doing anything for me.  It was a weird, isolating weekend pre-Christmas with us all satelliting round each other in different rooms of the house.  Been sleeping well which is a massive bonus, I know.  Trying to get out each day for a walk with the dog as the fresh air helps.  I have had a lot of migraines, worst on Xmas Day.  I think due to dehydration and the salty food, and probably just doing too much.  Been taking ibuprofen after taking my temp.  I read that chemo can exacerbate your weak spots and I've always been headachey and I've had some stonkers this week.  All in all, it's not been pleasant but not as bad as I was expecting.  I'm avoiding the shops etc this week due to low immune system, although it's a hell of a time to book an online shopping slot!!  They're like gold-dust.  Attempting a drive to my mum's tomorrow for a visit whilst I still have my hair :-(  How's everyone else?  xxx",
      "MessageIndex": 30,
      "PostDate": "29/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Bigguy, Sorry to hear about your dizziness.  Glad your nausea has gone but the dizziness must be rough too.  I had a couple of dizzy spells but it's not lasted.  I really hope yours passes soon.  I'd say that I feel fairly normal now and that the major side effects passed by day 8 and that the meds seemed to control it OK.  I'll take that.  xx",
      "MessageIndex": 32,
      "PostDate": "29/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I noticed that same thing about my tongue, Sparkle!  Thanks for keeping my lum reeking xx",
      "MessageIndex": 44,
      "PostDate": "31/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Glad you’re through the worst of it, karebear. Are you having problems sleeping? I’ve got my usual ‘morning hangover’ feeling without having had a drop! No fair!  Xx",
      "MessageIndex": 36,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I’m day 12 today, sparkles63. Just keep feeling my lovely hair wistfully and wondering how long it will be before it’s this long again. Ok, in reality I have a fine, short bob that I struggle to get any body in but it’s mine! I think that’s what I found odd about the wigs I tried on - they were all quite thick compared to my own hair.  Wishing everybody a Happy Hogmanay from a stormy Edinburgh xx",
      "MessageIndex": 40,
      "PostDate": "31/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Just looking for a bit of advice from those who have experienced cording following an ANC.  I went for my booking in appt/CT scan prior to my RT starting next week and had problems with getting my arm right back.  I'd thought this was natural stiffness but the breast specialist that they called in confirmed that I do have a cord.  I hadn't really been able to feel it because of the seroma I've had since my ANC/WLE.  That's been drained 3 times now and is much better, although there is still a bit of a lump but it's not getting in my way in general.  The nurse that I saw in radiography said I needed to massage it vigorously, even though it was painful, to 'crack' the cord.  Goes from my armpit down to past my elbow (that I can feel anyway).  But my BCN phoned about something different later and I discussed it with her and she advised just gentle massage would be fine.  What do others think? thanks, Linda xx",
      "MessageIndex": 0,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158724/cording-aws",
      "Title": "Cording (AWS)"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Thanks Fundamentals and Mistmoley.  I am due a physio referral for my other arm for the rotator cuff problem and was put on the urgent list.  So I'll mention it if I get no joy doing it myself - or if I'm too much of a wimp!  I can feel the cord round my inner elbow area and that's not sore to touch but it is on my upper arm.  I'm still kind of numb from the op in my armpit though.  Will do what I can.  On googling it, I realised that I need to actually be stretching beyond my comfort zone too and I wasn't doing this.  So thanks all xx",
      "MessageIndex": 5,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158724/cording-aws",
      "Title": "Cording (AWS)"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I agree.  I seem to be caught between 2 camps with the advice I got today.  All I know is that it was very sore when the first lady tried to touch it in a more 'rigorous' way.  Just about jumped off the bed!  For that reason, it make me reluctant to do it and that's counterproductive.  So I agree with the BCN.  I think you can only go with what is bearable for yourself.  Thanks, Seaspirit ",
      "MessageIndex": 4,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158724/cording-aws",
      "Title": "Cording (AWS)"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Sarah, As others have said, just take it a step at a time.  It all seems overwhelming just now as you have had a massive shock and your life feels like it's been turned upside down.  Once your treatment has started, it's a bit easier as you just deal with the next thing in front of you, and you have the support of the medical team.    I had chemo first, then lumpectomy and node removal, followed by radiotherapy.  The chemo isn't a walk in the park but it's more doable than you think.  Let your partner/other family take the strain if you are feeling rough.  Even when I was poorly, I nearly always managed to do the school run which was important to me, although other mums did offer.  As others have said, your kids won't necessarily notice when you aren't feeling great.  My son did have a cry when I lost my hair but he soon got used to it and has been the best help - so attentive and caring.  And you caring for them takes you out of yourself and gives you another focus than the bloody cancer.  I had a lovely wig and no-one knew when I went out, even to a wedding.  My mum loved it better than my own hair!  Like you, I didn't want to feel that people were pitying me.  But when it came to the summer and it was hot, I just ditched it even though I only had a 5 o'clock shadow.  I felt differently about it all by then and had more confidence in myself and strength actually after what I'd been through, to think that I didn't give a fig what others thought.  And they don't care as much as you think.  I'm now nearly 8 months past chemo and 4 months past the end of my main treatment and have a trendy pixie crop, which is much thicker than my hair was before (and no grey surprisingly!).  All the best with your lumpectomy and whatever treatment follows.  You will cope.  And you can always log on here for advice and support.  Linda x",
      "MessageIndex": 12,
      "PostDate": "21/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171952/how-to-cope",
      "Title": "How to cope"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Tweets20 The constant worrying about every lump and twinge is so hard, isn’t it? You have been brave and done the right thing in getting booked in for a checkup but the waiting is almost unbearable. Just wanted to get in touch and give you some support. I haven’t had the same symptoms but am always worrying too, nearly a year out of treatment. It’s something we have to live and cope with, without it taking over and ruining your whole life. Wishing you all the best at the clinic. Love and hugs Linda xx",
      "MessageIndex": 1,
      "PostDate": "21/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179947/lumpy-breast-18-months-after-lumpectomy-and-radiotherapy",
      "Title": "Lumpy breast 18 months after lumpectomy and radiotherapy"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Sarah, As others have said, just take it a step at a time.  It all seems overwhelming just now as you have had a massive shock and your life feels like it's been turned upside down.  Once your treatment has started, it's a bit easier as you just deal with the next thing in front of you, and you have the support of the medical team.    I had chemo first, then lumpectomy and node removal, followed by radiotherapy.  The chemo isn't a walk in the park but it's more doable than you think.  Let your partner/other family take the strain if you are feeling rough.  Even when I was poorly, I nearly always managed to do the school run which was important to me, although other mums did offer.  As others have said, your kids won't necessarily notice when you aren't feeling great.  My son did have a cry when I lost my hair but he soon got used to it and has been the best help - so attentive and caring.  And you caring for them takes you out of yourself and gives you another focus than the bloody cancer.  I had a lovely wig and no-one knew when I went out, even to a wedding.  My mum loved it better than my own hair!  Like you, I didn't want to feel that people were pitying me.  But when it came to the summer and it was hot, I just ditched it even though I only had a 5 o'clock shadow.  I felt differently about it all by then and had more confidence in myself and strength actually after what I'd been through, to think that I didn't give a fig what others thought.  And they don't care as much as you think.  I'm now nearly 8 months past chemo and 4 months past the end of my main treatment and have a trendy pixie crop, which is much thicker than my hair was before (and no grey surprisingly!).  All the best with your lumpectomy and whatever treatment follows.  You will cope.  And you can always log on here for advice and support.  Linda x",
      "MessageIndex": 27,
      "PostDate": "21/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171952/how-to-cope",
      "Title": "How to cope"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Mavi- it's funny you saying that, like you are embarrassed that you have cancer.  I really get that.  I worry that I'm attention-seeking!  Then my husband helpfully reminds me that I have a life-threatening disease and should let people help!  Chemo went fine.  Nothing horrible happened.  Staff were all lovely.  Just sitting 'waiting' for side effects which is a bit mad but the only way I can describe it.  I didn't do the ice cap.  I have pretty fine hair anyway so thought the chances of it surviving the chemo were zilch.  I went for a wig appointment at a salon in town yesterday and have ordered 4 I think as they didn't quite have the colour I wanted.  I really suited a shorter one and my sister liked it but I didn't have the guts.  Wanted to keep it similar to my current style.  The lady in the salon said it was no problem to order a few in and then decide.  I might get the short one as a second style!  But I know what you mean - it's all still in the abstract at the moment.  The minute my hair starts coming out I'm sure I'll be devastated.  But I'll have to seem fine with it for my son's sake as I don't want to freak him out. I will be getting 6 rounds of FEC-T, 3 weeks apart. All being well, fingers crossed, I have already mapped out that my last will be 4 April.  Good call on the notebook.  I have one.  Main thing is to write down anything you have to do - ie other appointments to book.  And any questions you can think of in advance.  My husband just took his tablet and either was with me in the waiting rooms or sat in the café at the hospital for my long day of tests.  He drank a lot of coffee.  All the best tomorrow and Friday xx",
      "MessageIndex": 13,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145147/new-to-site-and-recently-diagnosed",
      "Title": "New to site and recently diagnosed"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Oh, yes, like Nutmeg I bought a nice magazine file box for all the booklets, leaflets and stuff.  I do have a theory about stress and how terribly it affects the body.  I have been in a stressful job for years and I also think it affected my fertility.  I struggled to conceive and then had several miscarriages after my son.  Ironically, I had just handed in my notice about 10 days before I found the lump!  Finished in that job the day after a got diagnosed.  But at least I am free to concentrate on getting myself better without worrying about bloody work.  I'm in a less stressful job 3 days a week now and they have been lovely - it's in the same organisation so I am still entitled to full sick pay cos of continuous service. ",
      "MessageIndex": 21,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145147/new-to-site-and-recently-diagnosed",
      "Title": "New to site and recently diagnosed"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Glad it all went smoothly and you are feeling calmer.  I feel OK today, but I suspect that it's because of the steroids and anti-sickness pills.  I only take them for 3 days, just in time for wearing off on Christmas Eve and Christmas Day!  I felt pretty ropey last night which was chemo day.  Nauseous and headachey. But it's a lot to cope with in a day.  So I went to bed early and thankfully slept not too badly.  Woke at 5.30, took my anti-sickness tabs straight away and my steroids at 8 as directed.  Just have to take each day as it comes.  You are so right about that new attitude for 2018!  Time to look out for you xx ",
      "MessageIndex": 24,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145147/new-to-site-and-recently-diagnosed",
      "Title": "New to site and recently diagnosed"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Mavi, Just wanted to send you my support.  The waiting and testing bit is the worst.  I'm only a couple of weeks ahead of you as I was diagnosed with my biopsy results on the 6 Dec and had my first chemo today.  I have the type of cancer where it is better to have the chemo first to shrink the tumour and then operation. It is totally natural to feel scared and overwhelmed.  The tests can be invasive and worrying.  I just had an MRI on my breasts yesterday and honestly thought I was OK but then a bit of panic hits you again.  A good tip that helped me was to close my eyes and transport myself in my mind somewhere nice.  I imagined I was stroking my cat and that really really helped.  Sometimes I picture myself on a Caribbean beach - really go to town on the whole imagery.  And they are over before you know it.  Do try to let friends help you.  A friend said a lovely thing to me.  That there will be days when I want to close the door on the world, but leave it ajar just a little so that someone can reach in with a helping hand.  Right now, I am trying not to interfere in letting my husband wrap the Christmas presents!  :-) Wishing you all the best for tomorrow.  And do have a good cry.  It releases the stress hormones. Hugs xx",
      "MessageIndex": 7,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145147/new-to-site-and-recently-diagnosed",
      "Title": "New to site and recently diagnosed"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Lellyv, I just wanted to reassure you that, although it all seems like a massive mountain to climb at the moment, it is doable if you take it a step at a time.  I had the same diagnosis and treatment - neoadjuvant FEC-T chemo, surgery then RT.  This board really helped me get through it by being able to message with others in the same boat.  There is a monthly chemo chat and RT chat thread which are very helpful.  Everyone reacts differently to chemo, so you will just have to see how you go.  But the nurses and doctors want to ensure that you are not suffering so there are many meds available to counteract sickness or discomfort and if one doesn't work, they will try another.  Some people feel really OK and even work through chemo.  I took the time off work so that I could really just concentrate on getting better.  Although it was tough at times,  it was still very doable and I kept as much normality as I could - going out for coffee with friends for instance when I could, getting out with the dog for a bit of fresh air, doing the school run.  Just listen to your body and take it easy though on days when it's  harder.  You could maybe look at things like online grocery shopping for instance.  There will always be a shoulder to cry on here.  There are people on the MacMillan helpline too, if you need to ring and talk to someone.  Are you near a MacMillan or a Maggie's centre or similar?  They both have great resources and people you can chat to or just pop in for a cup of tea before or after treatment. I just finished my Herceptin jabs in Feb.  You think it seems like forever in the beginning but you will get there.  All the best, Linda xx",
      "MessageIndex": 2,
      "PostDate": "30/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178935/chemo-etc",
      "Title": "Chemo etc"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I’m still up for it. Glasgow or Edinburgh probably best for transport links from rest of Scotland. A weekend day would be better for me due to childcare responsibilities. Venue wise, Zizzi in Exchange Sq in Glasgow is big and handy for the train stations. There’s also a lovely Zizzis just off Cockburn St in Edinburgh although it is up some steps in case that’s a problem for anyone.  Again handy for Waverley. Or there’s a few restaurants round St Andrews Sq. It’s picking a date that’s tricky.  Linda xx",
      "MessageIndex": 28,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171869/2019-meet-up-in-scotland-anyone",
      "Title": "2019 Meet up in Scotland ? Anyone ?"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Aw I’m from Kelso originally, Violetsniff. Beautiful town. Enjoy your trip xx",
      "MessageIndex": 33,
      "PostDate": "07/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171869/2019-meet-up-in-scotland-anyone",
      "Title": "2019 Meet up in Scotland ? Anyone ?"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Shiny I’m also originally from the Borders, though now in Edinburgh. Regularly back to visit family. Hope you can make it. X",
      "MessageIndex": 21,
      "PostDate": "21/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171869/2019-meet-up-in-scotland-anyone",
      "Title": "2019 Meet up in Scotland ? Anyone ?"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I’d be up for that. I’m in Edinburgh but Glasgow or Dundee easy enough to get to.  Might brighten up a dreich January.  Linda xx",
      "MessageIndex": 4,
      "PostDate": "18/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171869/2019-meet-up-in-scotland-anyone",
      "Title": "2019 Meet up in Scotland ? Anyone ?"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Yes I suggested Zizzi. It is the one in Exchange Sq.  I could do Sat 2nd but not the Sun as it’s hubby’s 50th.  They do cocktails, Granny59! ",
      "MessageIndex": 38,
      "PostDate": "10/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171869/2019-meet-up-in-scotland-anyone",
      "Title": "2019 Meet up in Scotland ? Anyone ?"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi all - it looks like I may have to miss this now. Hubby been invited to a do in Birmingham by his cousin and wants to go. He doesn’t get out often (!) and it’s his 50th birthday weekend so I’ll have to babysit. If he changes his mind I’ll pop along but don’t expect me.  Hope you all have a lovely time. L xx",
      "MessageIndex": 66,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171869/2019-meet-up-in-scotland-anyone",
      "Title": "2019 Meet up in Scotland ? Anyone ?"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Good luck to all those starting RT this month.  I am now more than half way through mine, finishing on 13th.  All going well so far.  A wee bit pink but not sore as such and I am very fair so we'll see.  Have been drinking lots of water -good idea just with this weather really too.  Our unit (Edinburgh) give you a huge bottle of Diprobase and a tube of Betnovate steroid cream.  So I've just been using them. It's more the travelling that's been a pain in the backside as, even though I only live technically 20 mins from the unit, my appt time is 8.50am and I was dealing with commuter traffic for the first couple of weeks.  Now the schools are off, I thought it would get much quieter but of course the council love digging up all the roads in July between schools finishing and the festival starting.  I am having to take my almost teen son with me and get him up early for the first 2 weeks of his holidays (popular!) and we were still late for the appointment yesterday due to roadworks/traffic congestion.  Set off early today and ended up 35 mins early for appt!!  Anybody's guess what it will be tomorrow!  Have to say, the unit were excellent about slotting me in when I was late.  Great staff.  Linda xx",
      "MessageIndex": 29,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi all - very strange, I thought I'd posted on here on Sat re a wet (and reluctant on dog's part) dog walk but it's not showing up.  Anyway, made me feel better as I like a walk in the rain and also needed cheering up after the rugby result (worst I've seen Scotland for a while).  Planned a walk in the park today and oops somehow ended up in the big shopping centre instead.  Wee bit of retail therapy never did any harm either - just some chocolates and some castor oil which I'd heard was good for your eyebrows and eyelashes.  And treated myself to a healthy lunch in Wagamama's - salad and a 'positive' juice (that's what it's called - anyway it was green so must have been good).  I'm on day 6 post FEC3 and feeling pretty well this time in terms of nausea but I was down and teary again yesterday and today hence getting myself out.  I'm now 2 months on from my biopsy results and 3 chemos down and it's maybe just about sinking in.  I'm trying not to think of what's still in front of me - more chemo, operation and RT.  Months more of it.  I'm probably at a stage where I need to talk to someone and offload because I know I am keeping everything to myself and trying to protect those around me.  But inside I'm all a jumble.  Any suggestions?  Linda xx",
      "MessageIndex": 131,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "What a great idea, Leolady.   I sometimes read the Awake thread but haven't had the guts to post - I like the pictures!  (sound like my son) Seen this too late to post a picture but I went out for about half an hour with a friend and our dogs up to a nearby loch to blow the cobwebs away (wore hat as was a bit worried Clare (the wig) would blow away).  Had a sofa day yesterday with a bit of a temp and kinda depressed, so it felt great to get some fresh air.  My cocker loved getting dive-bombed by her 4 month old cocker pup - so cute.  Had lunch after and a natter.  Felt NORMAL - yay!  Linda xx (chemo3 due Wed 31st)",
      "MessageIndex": 2,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "No walkies for me today as it’s been chemo day, so I’ll take it easy this afternoon. That’s FEC done and dusted at least. Am still going to try and get some fresh air tomorrow though xx",
      "MessageIndex": 46,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "WhatHappened_  _ - I'll see you the geese, and raise you some llamas!  Gobsmacked seeing these on my walk today in the local castle estate.  Had to definitely keep Poppy on the lead, much to her disgust!  Was a bit slack in my walking over the weekend but trying to get back into it.  OH was off today and it's half-term so I could get out while he kid-sat.  Oh, there was more snow here today, wasn't expecting that.  L xx",
      "MessageIndex": 270,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Bit of snow up here overnight, which Poppy (dog) absolutely LOVES, so had to drag myself out for her sake.  Such a beautiful walk up the nearby castle estate - it did cheer me up.  I had felt very low yesterday (day 6 post chemo) and then randomly felt dizzy and achey at bedtime so had a marathon sleep and felt better this morning.  WhatHappened - I don't know where I read about the castor oil being good for hair growth.  It's something about the essential fatty acids.  I can only find Pukka which is a tenner in Holland and Barrett (or other good retail outlets).  Worth a shot.  But yes, definitely for external application only - even the woman in H&B admitted it shouldn't really be in the 'digestive health' section! L xx",
      "MessageIndex": 166,
      "PostDate": "06/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Great to get out and about today.  Nearly an hour walk with my doggy companion, although only 2.3 miles covered as stopped to blether to another couple of dog walkers - which is nice in itself to get a bit of connection and adult conversation instead of staring at the 4 walls. Linda xx  ",
      "MessageIndex": 28,
      "PostDate": "30/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Feeling a bit more like I'm back in the human race again today after 3rd FEC on Wed.  Had such a banging headache yesterday which I put down to the granisetron.  Took the radical step of not taking it today as I'm still on the steroids and took a cyclizine instead for the nausea.  Hooray, no headache!  Can function.  And no nausea too, so...  Wee walk with dog round the field and went for lunch with a friend when our sons were at football for kids with ASN.  I actually really enjoyed my soup - must be the steroids.  Her son doesn't have a diagnosis yet and is a bit younger than mine (who is on the autism spectrum) so it was nice to be able to help her a wee bit.  PennyL - fantastic news!  Enjoy your break - sounds lovely.  Linda xx",
      "MessageIndex": 89,
      "PostDate": "02/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Not out for a walk today but had sis round for tea so that cheered me up - the shopping for it, cooking and the chocs. I’m learning to ignore that ever present ‘scunnered’ (Scottish for makes you feel a bit sick) feeling and go ahead and eat and then I find I wolf down the food in 10 seconds flat! I might be half way through my chemo,  Leolady, but dessert pics always welcome! Linda xx",
      "MessageIndex": 190,
      "PostDate": "07/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Sausage butty...mmmm.... mrsox  You've put me right in the mind for one now xx",
      "MessageIndex": 272,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Sorry to hear you don't have any answers about your treatment yet, Leolady56 .  Must be very frustrating.  Whilst I didn't get a sausage butty this morning, I met up with an old school friend that I really only see every few years, and we had lunch at Zizzi and a walk round Edinburgh.  It was a lovely sunny day here despite the forecast - sorry I didn't not take any pics. My son came too as it is half term and he was really great all day (he's on the autism spectrum so it can be a bit hit and miss on days out).  I didn't know that about the daffodil Violetsniff but it makes sense with the Marie Curie symbol.  Linda xx",
      "MessageIndex": 281,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I think we’re all different, Spinningrose. Like you, mine seems quite slow. I’m now 14 weeks post chemo (had to check that, last one 4 Apr) and I’ve also got the bumfluff and 5 o’clock shadow just. least it’s dark enough that I can kid myself it’s a bit Sinead O’Connor. I’m wearing my docs and a lot of camouflage   I do think Herceptin slows it a bit. But then again my friend is on it too and her hair is coming in great. I suppose we just have to be grateful that it is growing back, albeit slowly.  Linda xx",
      "MessageIndex": 8,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/163090/of-hair-regrowth-after-chemo",
      "Title": "Of hair regrowth after chemo ...."
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Just a note to say I'm thinking of you, Yellowdaffodil.  Glad you're getting out to the shop for a wee daunder.  Hmm, might be time to consider the shave if you are up for it, as it starts to get in your food and everywhere.  Yes, new priority is kill cancer.  The hair will grow back.  L xx",
      "MessageIndex": 7,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153053/2nd-lot-of-chemo",
      "Title": "2nd lot of chemo"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Luthien, Sorry you find yourself here but I'm glad you have as this site is a wealth of information.  Don't go googling anything, as it is often not accurate and you can scare yourself.  I wanted to reply because I was almost exactly the same - got my routine mammogram appointment through after my 50th in Sept, but as luck (!) would have it, I found a lump in my armpit 5 days before I was due to go for it.  Mistymoley has given you lots of good information.  They will tell you the results of the tests on your biopsies at the consultant appointment and this determines the treatment plan - ie based on type of cancer you have.  It's likely that the consultant will and/or Breast Cancer Nurse will write down the type of treatment you are due to have - they circled the various treatments in a booklet for me, as it's a lot to take in when you are in a bit of shock.  It would be good if you could take someone else with you too at the appointment so that there are 2 sets of ears, if possible, and for moral support.  Rest assured that there is a lot they can chuck at breast cancer and, although the treatments themselves can be gruelling, you will get through it.  These boards have been a great source of information and support for me. Don't know what I would have done without them.  Wishing you all the best, Linda xx",
      "MessageIndex": 3,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150192/just-back-from-follow-up-appointment-after-mammogram---bad-news",
      "Title": "Just back from follow-up appointment after mammogram - bad news!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "That's really lovely of your friends, Luthien.  Don't feel like a fraud!  Definitely have to follow doc's orders and rest.  I know what Jowomoot means about feeling like you are living in a parallel universe sometimes.  You can be very up and down so I suppose we just have to enjoy the good days and get through the bad.  L xx",
      "MessageIndex": 13,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150192/just-back-from-follow-up-appointment-after-mammogram---bad-news",
      "Title": "Just back from follow-up appointment after mammogram - bad news!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Lillyrose,  I’m very similar, just had 2nd FEC  of neo-adjuvant for 10mm Idc with a lymph node. I just received an appointment for a mammogram and ultrasound on 15 Feb which will be a week before I go onto T bit of chemo. From other answers, practice must differ. Mine wasn’t a feelable lump. Thank god it isn’t an mri. I bloody hate those (claustrophobic).  L xx",
      "MessageIndex": 5,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147366/neo-adjuvant-chemotherapy-midway-scan",
      "Title": "Neo adjuvant chemotherapy, midway scan"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Brilliant news, Shirl.  That will give you that bit more strength to keep going.  xxx",
      "MessageIndex": 4,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145145/mri-results",
      "Title": "Mri results"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Meant to say - I know that the FEC is working so far as the lump I could feel, which is the cancer in the lymph gland in my armpit - about the size of a grape - has gone down completely.  That was pretty much after the first FEC.  Am on day 10 after 2nd now.  So that certainly feels like a result!  L x",
      "MessageIndex": 16,
      "PostDate": "19/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147366/neo-adjuvant-chemotherapy-midway-scan",
      "Title": "Neo adjuvant chemotherapy, midway scan"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Roberta, can you double check with the gynae that they are aware of your BC history/pathology? My GP wouldn’t prescribe an oestrogen cream for this reason. Maybe they were being over cautious but sounds like you’re worried too. At the moment I’m not using anything as I still just don’t feel like sex anyway ( poor hubby) but I know I’m burying my head in the sand. Would be interested in other replies to your thread. All the best,  Linda x",
      "MessageIndex": 4,
      "PostDate": "29/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168900/estriol-cream",
      "Title": "Estriol Cream"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi sunshinesuzie Welcome to the site and good to hear you have your first FEC done.  You're probably best to just follow how your body feels.  No point forcing yourself to eat something you don't want.  At least you have had something and keep drinking.   I always felt yucky for the first week of FEC but then had 2 weeks of feeling back to normal really, and often went out and met friends etc.  My appetite certainly came back when the nausea left after those first few days so bear with it.  You might find you are the same and turn a corner in the next few days.  My day 5 of my first FEC was actually Christmas Day (2017) and although I managed to cook a whole Christmas dinner for the family (WHY??), I just picked at it myself.  I remember feeling rotten on Boxing Day then got loads better.  So fingers crossed.  It seems like a long haul at the moment, but just take it a day at a time and a treatment at a time and you will get there.  All the best and take care, Linda xx",
      "MessageIndex": 1,
      "PostDate": "03/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180611/eating-during-fec-first-week",
      "Title": "Eating during FEC first week"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "That's meant to say - I'm in Queensferry.",
      "MessageIndex": 14,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150357/edinburgh-group",
      "Title": "Edinburgh group"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Maxine,  practice seems to differ widely across the country re follow-up appts. I got seen at the long-term patient clinic in Dec, one year on from diagnosis, about 6 months after end of treatment. Will be seen there every Dec for next 4 years now. That’s run by a nurse practitioner. I saw oncologist in Sept for what I thought was a sign-off about 6 weeks after RT finished. However, I got a ‘surprise’ appt through for oncologist last week, which is around a year on from my surgery (I had chemo before surgery). They said it was just a check up. Mainly discussing how I was doing on the tamoxifen and that they might swap me to letrozole in Dec as I’ll be deemed post menopausal by then.  L xx",
      "MessageIndex": 7,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181425/two-years-since-chemo-what-now",
      "Title": "Two years since Chemo what now"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Thanks Dreamthief.  I must have missed this post. Ginacarla - Dreamthief has probably given you as much info as I know.  Although I'm under the Western, because I'm in the far west of the city I got the choice to have my chemo at St John's in Livingston.  But will be back at WGH for surgery and RT.  But for that reason I haven't been up to Maggie's or the MacMillan at the Western yet.  I believe there is a lot going on at both.  I absolutely promise myself I will go up for a nosy this week, now the school's are back. I was diagnosed in early Dec and started my chemo on 20 Dec.  Am now half way through the chemo but still due the operation and RT thereafter.  I do have my name down for the 'Look Good Feel Better' session in March at Maggie's.  Phone up Monday and get yourself booked in as they are really popular and get booked up a couple of months in advance.  It's a beauty session where you get a really good goody-bag apparently.  I'd be happy to meet up sometime if you like - I'm off work for the duration of my treatment.  Lovely to hear from you. Linda xx",
      "MessageIndex": 4,
      "PostDate": "17/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150357/edinburgh-group",
      "Title": "Edinburgh group"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Ginacarla and PammyBear - I've sent you both friend requests so that we can private message some contact details.  Thanks for that kind offer, Pam.  Like GinaCarla, I only had a couple of weeks between diagnosis and starting chemo (chemo first for me, then op and RT) and it means it is hard to get your head round.  I am 2-3 months in now and starting to come to terms with it a bit better but was saying on another thread how I could do to talk to someone who has been through this, as my family don't understand the same and in some ways I am shielding them.  The walking and yoga groups sound good.  I'm about to start the T bit of my chemo on Wed though and will have to see how I feel physically, I suppose.  I managed quite well with well-controlled SE with the FEC but it feels like a whole new ballgame.  Good luck with your RT. Linda xx",
      "MessageIndex": 7,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150357/edinburgh-group",
      "Title": "Edinburgh group"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi IvyT, I'll pull Mavi into the conversation as well as she's replied on the Feb chemo board.  Now for the challenge of getting a time 5 of us can meet!  Will send you a friend request too so that we can message and not share private details on this thread.  I'm off work at the moment so am free any day although need to be at home by 3 for school run, so mornings best.  Sorry to hear about your flu, Ivy.  Other than that, how have you found the docetaxel/herceptin cycle?  I'm also self-funding the pertuzamab.  Are they giving you it over 3 cycles?  Our treatment plan seems the same.  Take care xx",
      "MessageIndex": 10,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150357/edinburgh-group",
      "Title": "Edinburgh group"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I'd be happy to come up to a coffee morning at Drumbrae library, Ginacarla Queensferry xx",
      "MessageIndex": 13,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150357/edinburgh-group",
      "Title": "Edinburgh group"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Grand.  I'll be there tomorrow at 11am.  For anyone that can't make it, we can always arrange something with a bit more notice - perhaps at the MacMillan or Maggies at the Western - at a later date we can agree on.  Perhaps a weekend for those working.  Thanks for the encouragement, Ivy.  I am nervous re Wed, must admit, and such a long day xx",
      "MessageIndex": 17,
      "PostDate": "19/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150357/edinburgh-group",
      "Title": "Edinburgh group"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Volvox167, I'm sorry to hear that your cold cap treatment didn't work.  It is such a demoralising part of chemo, losing your hair.  Although I had fine, blonde hair that I struggled to get much body in, it was mine and I loved it.  I often burst into tears when I catch sight of my bald head still.  But...as you say, the hair loss doesn't define us and is only temporary.  I am about to get my 5th chemo tomorrow, now being a few weeks clear of the FEC chemo which is the one that's a b*gger on your hair, and I was ecstatic to feel some fuzz in my armpit this morning!  Never thought I'd say that!  Wigs these days are really good and it allows you to go out and blend into the crowd.  See it as your friend for a few weeks of your life and you can experiment with some different styles as your own lovely hair grows back in.  Beautybeau15 - just to mention that I didn't have any scalp pain as my hair went, perhaps because it was very fine.  I'd been warned that day 16 of cycle 1 seemed to be the ominous one, and as if on cue, mine started coming out that day.  I washed it and it matted so badly on one side, I had to shave it.  Went to a no.6 with hubby's clippers initially.  This means you don't see it everywhere as it falls out or get big strands in your soup!  It's up to you on that one but it's probably a bit more practical to go short or shave.  Take care, Linda xx",
      "MessageIndex": 6,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152475/coming-to-terms-with-hair-loss",
      "Title": "Coming to terms with hair loss."
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Thanks, Cathy.  I am honoured to get the fireworks!  :-)",
      "MessageIndex": 5,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "So, had my booking in CT scan today and the tattoos.  I knew I was going to have problems with getting both my arms up actually, as I have a rotator cuff problem in my non-surgery shoulder/arm too.  Luckily, they didn't require me to put that one up as they could see I was struggling (still awaiting physio for it).  And they let me have my surgery arm as low as they could.  Turns out I do have cording which is what was restricting the movement.  I hadn't really noticed due to the seroma I've had in my armpit which has needed drained 3 times now.  They got a breast nurse specialist in to have a look and she advised fairly vigorous massage to get rid of the cord but it hurts like buggery when I try!  Yikes.  Might post a query about this as I've had conflicting advice.  Anyway, good news is that my RT proper starts next week on the 14th and finishes on 10th July.  So that only takes me a week and a half into the school holidays.  Hopefully DS can amuse himself whilst I'm in for a wee while.  So I'll be all aboard the RT train as of next week.  They supply the cream at my hospital and I wear factor 50 suncream anyway due to being a strawberry blonde...when I had hair!  Linda xx",
      "MessageIndex": 8,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Hclare, In my area it’s around 5 weeks after the surgery, as Leolady said. So that’s a rough guide. L xx",
      "MessageIndex": 12,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi all, I started my RT on Tuesday and going OK, although it's at 12.40 this week which doesn't half split up your day for doing anything else.  Thankfully, it changes to 8.50 from Monday onwards.  It got given a huge bottle of cream and a tube of steroid cream.  I've still got a bit of cording in my surgery arm but it's OK for lifting up for the machine.    I got my first session of complementary therapy today at the MacMillan in the hospital.  I had some reflexology as the therapist couldn't put oils on my body before my RT.  It was lovely and I'm booked in for another in a couple of weeks.  It's the first pampering thing I have had done in months and I've been quite teary today.  It's no wonder really.  Sometimes it really hits you just how much we've been through in the last few months.  Linda xx",
      "MessageIndex": 71,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Grrr, thought it was too good to be true. Just got a call from radiology consultant saying I’m one of those whose heart is a bit close to the chest wall so I need to go in for another CT scan on Friday where I hold my breath, and they will then treat me this way. All fine and doable but bad news is that it might put my treatment start date back to the 19th. Which means it will go on further into the school holidays. Feckity feck",
      "MessageIndex": 14,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Thanks, Lindsay.  I am joining the RT group in June too.  I just got the call for my set-up appointment which is next Tues and the oncologist said they usually start around 10 days after that.  I will get 15 treatments and 4 boosters.  Bit irked that it will take me into the school summer holidays (here in Scotland they finish on 29 June) but needs must.  The wee man will just have to come along with his Nintendo.  I've not been able to book any holidays until I know the dates although we have Centerparcs booked in Sept.  However, I have told OH that a long weekend in a hotel somewhere would be very welcome once the RT is over.  Absolutely no self-catering allowed!  The very good news, when I met with my surgeon for post-surgery follow-up, was that I had had a 'complete pathological response' to my chemo so when the analysed the tissue from my lumpectomy and ANC, there were no cancer cells left in either area!!  However, the RT will still go ahead on the boob as belt and braces.  I was so pleased.  It made all that sickness worth it.  Now, if only my hair would grow back.  I am still pretty bald :-( but on the whole, don't want to complain!  Hello and all the best to everyone else undergoing RT this month.  Linda xx",
      "MessageIndex": 3,
      "PostDate": "01/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Congratulations, Nutmeg! X",
      "MessageIndex": 32,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Great that you discovered that policy, Tina.  I didn't remember that I had taken out critical illness cover 18 years before when I bought my flat as part of the life insurance on the mortgage.  It took a friend prompting me to look it up.  I couldn't even find my original paperwork but applied to get a copy of it through the company (Alliance and Leicester/Aviva) and lo and behold I did have the critical illness.  So once the Oncologist had confirmed the diagnosis, they paid out and I got my mortgage paid off.  I'm writing this to prompt anyone who has mortgage life cover to check for critical illness cover.  I don't know why I ticked it at the time, as no cancer history in family, but boy am I glad I did! L xx",
      "MessageIndex": 13,
      "PostDate": "12/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177997/well-women-now-reassure-cancer-insurance-anyone-had-a-claim-in-recently",
      "Title": "Well Women now Reassure cancer Insurance. Anyone had a claim in recently..."
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "HI Kem, I also have breast lymphoedema and was referred by my BCN to a specialist nurse, who I will keep seeing until we seen an improvement.  She was great and showed me massage techniques and some exercises as it's important to keep moving the area.  All of what she showed me can be done by me on my own - seems strange to say you need a helper, although of course if you have a partner they might be keen, ha ha!  It would be a good idea to see a specialist nurse if you can, as I would have had no idea about the type of touch needed from a leaflet.  Much more confident now someone has shown me.  It did seem quite a soft touch but she explained that the lymph system is just under the skin, and adhered to the skin.  So you only need to move the skin gently or your fingertips over the skin to have an effect.  Unlike Grannylara, I didn't find the kinesio tape helped me much but the massage is effective. I did specifically ask the nurse if it ever goes away completely and she said it can.  If you keep up the massage, it will get better and better and eventually either not come back or be much less if so.  Another tip is that you can use a body brush to do the massage technique.  I suffer from frozen shoulder so it makes it easier for me to reach around, under my boob and into my armpit with the brush.  All the best, Linda x",
      "MessageIndex": 5,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168279/breast-lympodema",
      "Title": "Breast lympodema"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Amanda865 - my pharmacist warned me about this re the 20mg tablets when I renewed my prescription last month but advised that Teva still do the 10mg tablets but you need your GP to change your prescription. I did that and just take 2 at a time. Keeping my fingers crossed that Teva don’t stop them too. Worth asking your pharmacist first then speaking to GP? L xx",
      "MessageIndex": 4,
      "PostDate": "07/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180741/teva-tamoxifen-discontinued",
      "Title": "TEVA Tamoxifen DISCONTINUED!!!!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I had 3xFEC and 3xdocetaxel/trastuzumab/pertuzumab.  Got scanned after the FEC and then again at the end. ",
      "MessageIndex": 3,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181244/scans---neoadjuvant-chemo",
      "Title": "Scans - neoadjuvant chemo"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Londongurl,  If you are already suffering from every menopause symptom in the book, is there anything to lose by giving it a try? I’ve been on it for a month and had no noticeable symptoms so you might be the same. I did ask for Teva brand after reading some discussions on here as read they may be less problematic than some, but others may disagree.  Personally, I just couldn’t take the risk of not taking it, even if I had problematic side effects, because my cancer was oestrogen positive and it suppresses its production. I know I wouldn’t forgive myself if it came back and I hadn’t taken all the treatment offered.  Linda xx",
      "MessageIndex": 8,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164562/refusing-tamoxifen",
      "Title": "Refusing Tamoxifen"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "You've been through such a lot of loss, Karen.  I am sorry to hear that.  You are right that it is easier to let it out in front of strangers and your BCN will be very used to it, I'm sure.  I have also been saying that I'm at a stage where I would like to talk to someone like a counsellor but haven't done anything about it so far.  However, I'm off to the local Maggie's centre this afternoon for the Look Good Feel Better session (do look into booking one for yourself as they are supposed to be very good), and I'm going to check out counselling with them whilst I'm there. All the best, Linda xx",
      "MessageIndex": 5,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152482/chemo-looming-i-am-now-feeling-quite-emotional",
      "Title": "Chemo looming.... I am now feeling quite emotional"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi KT69, I think it's totally normal to feel like a quivering wreck sometimes during this awful bloody 'dance with cancer' as I read it referred to.  You will have been holding it together for a long time, in helping your mum.  And you've gone through your own diagnosis and operation, which are major life events.  Perhaps seeing your mum going through chemo has also made you nervous in advance of your own treatment.  These are all huge things that you have coped with.  You are allowed to also feel terrified and worried and tearful.  Crying does help to release some tension and emotion so cry away.  I know that I've been helped enormously by finding this site and being able to share my experiences with others going through the same thing.  Keep in touch on here and perhaps join in the March Chemo thread if you'd like.  All the best, Linda xx",
      "MessageIndex": 2,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152482/chemo-looming-i-am-now-feeling-quite-emotional",
      "Title": "Chemo looming.... I am now feeling quite emotional"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Lovely words, Leolady.  It's nice to hear how you are doing, Princesa8.  Do keep in touch as these boards are great for a bit of connection - whether moaning, ranting, laughing or supporting.  You are really getting there with your chemo and the end is in sight.  It really bloody does get to you mentally though at times.  Don't be ashamed of that.  I go between feeling quite brave and positive, and a quivering wreck.  Sometimes from one day to the next!  I don't have the answer, other than just keeping on (because what choice do we have) but I am glad I found this site as it's kept me sane to read of others going through the exact same thing.  All the best and take care, Linda xx",
      "MessageIndex": 17,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146996/primary-occult-breast-cancer---anyone-else",
      "Title": "Primary occult breast cancer - anyone else??"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Rosie, Please don't be worried.  For one thing, like the chemo, it always helps to keep reminding yourself what a good job the Herceptin is doing for you.  Personally, I found it very hard to distinguish what SE were Herceptin and what were 1) hanging over from the chemo, 2) tamoxifen, 3) symptoms of the sudden menopause caused by chemo and tamoxifen.  I finished my Herceptin at the beginning of Feb this year and have had some ongoing things to contend with since finishing chemo in April last year and getting radiotherapy June/July - joint stiffness, some joint pain, and fatigue - but all of these have gradually got better the further away from chemo and RT that I got.  The joint stiffness has lingered though and doesn't seem to be getting any better so I'm sure that's the tamoxifen/menopause.  I did also have a bit of a runny nose and very dry eyes which some people attribute to Herceptin.  I got my optician on side and he prescribed gel to put in at night and drops to put in as and when you need.  That really helped.  The one thing I do think that was Herceptin SE was a dull ache in my lower back.  It's been much better since stopping.  Never needed painkillers for it so I it wasn't severe, just uncomfortable.  I'm sure you will get on fine with it.  Once you are finished with your main treatment, just doing the Herceptin feels like you are getting on with life.  Looking back, I think a lot of my side effects over the last year have been from the chemo because they got better gradually, even though I was on herceptin.  It takes your body a long time to get rid of chemo and repair.  Best wishes, Linda x",
      "MessageIndex": 1,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178284/side-effects-on-herceptin",
      "Title": "Side effects on Herceptin"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "That's so thoughtful.  Hope you are recovering well from your op xx",
      "MessageIndex": 8,
      "PostDate": "14/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179658/heart-pillow-and-dammit-doll-her-breast-friends",
      "Title": "Heart Pillow and Dammit Doll (HER Breast Friends)"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Sara, I'm sorry that you find yourself here but welcome.  I haven't heard of occult breast cancer but can understand what it is from your description.  Basically the lymph nodes are reacting to something in your breast that they cannot see.  My BC is something similar in that I found a lump in my armpit which was a lymph gland reacting to something in my boob.  They could not pick up a primary tumour on the mammogram but could on the Ultrasound, measuring about 10mm but hiding well.  Thank goodness for that lymph gland!  Your chemo will be sorting out a lot and shrinking/killing what is there in both your lymphs and breast.  It is very treatable at this stage but there's no getting away from the fact that the treatment itself can be gruelling.  Our treatment plans sound very similar.  I am on my 2nd lot of FEC-T of 6, then I will be due an op (hopefully lumpectomy if the chemo does it's job and node removal) then RT.  Do go back to your team if the nausea is really wiping you out as they can give you different drugs that might work better for you.  It is very debilitating, isn't it?  Don't feel bad about feeling down - it is totally natural!  It is a feck of a shock to find out you have cancer.  Can other people help with your son?  Don't feel bad about that or the teaching.  Do what you can, when you can.  People will understand.  You are not alone as you have now found friends here. All the best and take care, Linda xx",
      "MessageIndex": 1,
      "PostDate": "13/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146996/primary-occult-breast-cancer---anyone-else",
      "Title": "Primary occult breast cancer - anyone else??"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "zaf37 - did you manage to go ahead and your bloods come back better today?  This happened to me on cycle 4 (which was a T chemo) - ie low the day before when taken by nurse at GP surgery but had come back up when tested on the morning of chemo in the unit.  Hope all was well for you xx",
      "MessageIndex": 3,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152588/bit-worried",
      "Title": "Bit worried"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "zaf37 - Good, glad it went ahead!  Our treatment plans sound similar, although I'm only getting 6 chemos, last one on 4 Apr all being well.  Then surgery and radiotherapy.  I'm also down for lumpectomy and from scans the FEC  has shrunk things so fingers crossed, but also need lymph node clearance.  All the best xx",
      "MessageIndex": 5,
      "PostDate": "16/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152588/bit-worried",
      "Title": "Bit worried"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Taralou, Great that you have the first one under your belt.  Honestly, I've been pretty OK on FEC so far - had 2nd one a fortnight ago.  Like you, I took all the drugs they gave me and only had mild nausea, more tummy cramping which I also managed with peppermint tea and eating little and often.  Some headaches for which I took ibuprofen but you have to make sure you take your temperature first if you take ibuprofen or paracetamol so that they don't artificially lower what might be a high temp to be wary of.  When the 3 days of steroids and anti-sickness stopped, I had another anti-sickness to take as-and-when (Cyclizine) and this has worked (Metoclopromide didn't).  Just try and listen to your body and take it easy if you are feeling dodgy.  I've been able to function in week one, and felt pretty 'normal' in weeks 2 and 3.  All the best, Linda xx",
      "MessageIndex": 4,
      "PostDate": "26/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Taralou, Great that you have the first one under your belt.  Honestly, I've been pretty OK on FEC so far - had 2nd one a fortnight ago.  Like you, I took all the drugs they gave me and only had mild nausea, more tummy cramping which I also managed with peppermint tea and eating little and often.  Some headaches for which I took ibuprofen but you have to make sure you take your temperature first if you take ibuprofen or paracetamol so that they don't artificially lower what might be a high temp to be wary of.  When the 3 days of steroids and anti-sickness stopped, I had another anti-sickness to take as-and-when (Cyclizine) and this has worked (Metoclopromide didn't).  Just try and listen to your body and take it easy if you are feeling dodgy.  I've been able to function in week one, and felt pretty 'normal' in weeks 2 and 3.  All the best, Linda xx",
      "MessageIndex": 19,
      "PostDate": "26/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Aaarrgghh!!  Jac - don't say hair loss!  My hair is still really AWOL after the chemo which finished early April.  I think it's a combination of me just having shy follicles and perhaps a bit of Herceptin SE.  When you say 'dryness', where do you mean?  I've got very dry eyes still.  L xx",
      "MessageIndex": 6,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159160/tamoxifen-brands-uk-list-trying-to-find-one-that-suits-me",
      "Title": "Tamoxifen brands UK list? trying to find one that suits me!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Jackie, That is really frustrating that your chemist said that.  I would definitely try some other pharmacies.  My GP was happy to put 'TEVA brand requested' on the prescription and the pharmacy will order it in for me.  It wasn't the brand they had on their shelf but she phoned the supplier there and then and they will have it in tomorrow.  They couldn't have been nicer about it.  Practice really seems to differ on this.  I deliberately chose the smaller chemist in my town as my impression of the other pharmacist is that he is a bit patronising and I could just see him arguing the toss!  I've been getting continued joint pain, especially in hips, since my last chemo in April.  It was so bad that the oncologist sent me for an x-ray to put my mind at rest, which thankfully came back clear.  I know it wasn't logical and she said it's more likely that it's a menopausal thing as the chemo plunges you into menopause.  I've started taking fish oils which I think are helping but the last thing I need is tamoxifen making it worse.  I already think the Herceptin, which I have another 10 months of, is making me creaky.  I wasn't in a hurry to fill out my tamoxifen prescription as it's been interesting to see what the pure Herceptin SE are, and I can now hopefully separate out the two.  Good luck with the other chemists! Linda xx",
      "MessageIndex": 3,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159160/tamoxifen-brands-uk-list-trying-to-find-one-that-suits-me",
      "Title": "Tamoxifen brands UK list? trying to find one that suits me!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Bigbird3 - do you have to stop the tamoxifen when on RT? Nobody's mentioned that.  Thanks, Linda x",
      "MessageIndex": 7,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159160/tamoxifen-brands-uk-list-trying-to-find-one-that-suits-me",
      "Title": "Tamoxifen brands UK list? trying to find one that suits me!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Jackie, I will be interested in the answers to your thread.  I am off this afternoon to my GP to get my first tamoxifen - only 10 years to go!  I am just not sure how much leeway you get with GPs/pharmacists.  I really don't want lectured at or patronised that 'they're all the same'.  I'd read from an old thread that Teva is better but probably best for ladies who are on it, especially if they have also tried others, to confirm.  Cheers, Linda xx",
      "MessageIndex": 1,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159160/tamoxifen-brands-uk-list-trying-to-find-one-that-suits-me",
      "Title": "Tamoxifen brands UK list? trying to find one that suits me!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Peanut - I really struggled with drinking on FEC too, as I always felt I had a lump in my throat which didn't bother me with eating, only drinking.  Jammy's suggestion is good that you can get a lot of liquid through food too.  I was Ok with soup, cup-a-soup, milk on cereal.  And just sipped at whatever drink I fancied or could stomach.  Weak squash mainly. I know I was probably not getting however many litres a day we're encouraged to have but just do what you can.  L xx",
      "MessageIndex": 4,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150435/drink",
      "Title": "Drink"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "HI Julesy, I started tamoxifen (20mg) in June last year and have been OK symptoms-wise.  I do get very stiff joints if I've been immobile for a while but once I'm moving I'm fine, and I do take a couple of supplements that are supposed to help with joints (fish oil and glucosamine), so maybe it would be worse otherwise.  If you are getting leg cramps, I would really recommend supplementing with magnesium.  Try either magnesium citrate or chelated magnesium as these are easier for your body to absorb.  I take the former, sometimes one, sometimes two tablets per day and get them in a well-known high street health shop.  I have played around with taking my T in the morning or evening and, personally, I prefer the morning as 1) I'm a lot less likely to forget to take it which is pretty important and 2) taking it in the evening made my joints stiffer at night as I slept.  This is an advantage for some ladies as they get the worst of it over then and have less issues during the day.  But I just found it disturbed my sleep as I didn't like being so stiff and sore as I moved my body between sleep cycles.  To me, any stiffness is more manageable in the day as I am moving more which helps.  Some people reckon that different brands cause different side effects, although I think it is mainly dependent on the person.  But it might be worth asking your chemist if they can get another brand in when you next fill your prescription as it might help.  My chemist normally stocks Relonchem but I requested Teva on the advice of someone on this board.  Worth a try. all the best, Linda x",
      "MessageIndex": 5,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177582/tamoxibollocks",
      "Title": "Tamoxibollocks"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Me too!  I'm roughly a year on from chemo and my GP organised a full blood count in January, just to support me with my ongoing health worries.  The Vit D came back at the low end of the 'insufficient' range (28 somethings rings a bell), borderline deficient.  He put me on an 8-week, once-a-week mega dose.  I haven't had the test repeated yet to see how it has helped but am seeing him again next week, so presumably that will be organised.  Takes a week for normal blood results but 3 weeks for the VitD test result so I won't know for a while.  However, I'll be pushing to get the dose re-prescribed because I've also seen the evidence relating low vit D levels to BC and recurrence and it is a worry.  I haven't a clue what my levels were before treatment. L xx",
      "MessageIndex": 7,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179100/vitamin-d---who-knows-their-vitamin-d-levels-are-low",
      "Title": "vitamin D - who knows their vitamin D levels are low ?"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Sean, It's difficult to say but if it's causing you concern, I would go back to the GP.  He/she could at least talk through your test results with you.  I've no idea what all that means but I'm assuming it wasn't cancerous if no further action was taken.  The fact that the lump changes in size actually doesn't sound like cancer.  But I would speak to your GP as it is obviously a worry to be left with a lump, although do be reassured if they say that's normal for the condition and benign.  All the best, Linda",
      "MessageIndex": 1,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178287/can-t-sleep-over-a-lump-in-my-left-breast-under-the-nipple-male",
      "Title": "Can't sleep over a lump in my left breast under the nipple, male"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Julie, It is normal, honest.  I am about 6 weeks post-RT and just the same - some days worse than others with the fatigue.  I'm also on tamoxifen and Herceptin, so we are still getting pumped with drugs and tamoxifen can have quite a few side effects, never mind that the chemo'tamoxifen might have put you into menopause very rapdicly (it has me), with all that can entail.  I'm taking a myriad of supplements that are supposed to be good for stiff joints, so that might help if you haven't tried yet (although I still feel it).  Do you feel ready to go back to work?  It sounds like the added pressure of that and your money situation is not helping with your stress.  Your employer should treat those recovering from cancer as having a disability and make reasonable adjustments - a phased return for example.  It probably depends on your workplace however, what their pay policy is for phased return.  I know ours was changed lately and they will only pay you for days worked.  (I was one of the union stewards who fought against this, and ironically I'll now be subject to it!)  I am on half-pay just now and my sick line runs out in a week and a  half so I probably will go back, and will just have to tighten our belts as much as possible as I know I will need the phased return.  It's a scary thought, work, though. You absolutely should just feel how you feel.  No right and wrong about when you should have 'gotten over it'.  If there is one thing I have taken from this wonderful community and the ladies who post their experiences on here is that I will feel up and down for a long time, as we have gone through such a major life change, and to not feel guilty about that. Difficult for people IRL to understand, but we do.  And the emotions can be conflicting.  Sometimes I look in the mirror, for example, and am quite positive about my hair growing back (veeerrryyy slowly) and think it looks quite funky.  Other times I could cry and am really angry that I don't look like 'me' any more and just want my old blonde bob back now.  Often I get annoyed at people saying how brave I am (not that I would show that to their face as they are just being kind) but I feel quite angry that I'm not because I didn't have any choice and just had to face it all anyway.  But other times, I think about what I have been through, and do feel brave.  You will be a jumble of all these emotions and it's normal, honey.  I'm glad you wrote and got it out though.  Better out than in, as my mum used to say! Much love and hugs, Linda xx (I've been crying writing this reply!)",
      "MessageIndex": 3,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/167050/need-a-rant-and-a-kick-up-the-a",
      "Title": "Need a rant and a kick up the a$$!!"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I'm so sorry to hear about your mum, Ruby Rose. You did the right thing telling the chemo nurses. Let them guide you. And glad you now feel you can go ahead with the chemo when you were so nervous about it. That's a great step forward. Please allow others to support you at this time though. As others have said, being specific about what tasks you would like people to do helps. I'm sure they will only be too glad to help. Big hugs xx",
      "MessageIndex": 179,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "PS - they didn't reduce my T doses with the symptoms I had - neutropenic sepsis, tummy and mouth troubles - but I believe that any problem with the hands and feet which might indicate neuropathy, they would be very careful.  They always ask me on the phone the day before about tingling in hands and feet or numbness. ",
      "MessageIndex": 21,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Heronsong - glad you are out of hospital but pants about the T truck hitting in other ways. I keep forgetting about some SE I’ve had but I do get cold shivers, bit like a cold flush rather than hot flush. Do you have anything for the pain? X",
      "MessageIndex": 26,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Ruby Rose - I am so sorry to hear about your friend.  The doctors will have to understand what it was that lead to her death but, if it was sepsis, it is very rare.  And that is why we are told to keep a close eye on our temperature and off to hospital if it is above 37.5.  It happened to me, I was in  hospital a couple of times but treated and all was fine.  You will be fine.  Much love, Linda xx",
      "MessageIndex": 153,
      "PostDate": "10/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "I've thought the same about the April chemo thread - will be very glad to 'graduate' from here with last chemo tomorrow (touch wood)! DL  - oral thrush can be a problem with T.  I've had it each cycle and in fact have a GP appt for Thurs to get some meds for it in advance.  Haven't really had too much pain, thank goodness, so can't advise on that.  I do still (on day 20 this cycle) get an aching in legs if I go upstairs, like bad fatigue.  This seems to have been cumulative and suspect it might just take a while to go after last one, and I'll probably also need to build up my general fitness after sitting around so much for the last few months.  JammyR - there are a few things that I have got from the chemist which have helped other than the main prescribed meds.  I had seen a few of these on the 'chemo tips' list but never needed them on FEC and have needed all of them on T.  Baby toothbrush, baby toothpaste (normal stuff far too stingy with peeling mouth!), indigestion medicine, IBS medicine that contains peppermint oil (the peppermint tea wasn't enough for my tummy cramps in the end), dry eye drops, mouthwash for dry mouth.  I wouldn't rush out and get the last 4 there until you see if you have these symptoms but handy to know that they're readily available to you.  My skin has also been a lot drier on T so slather on whatever is a your normal moisturiser, and a good lip balm.  I did get a red rash on my face for a few days but it soon cleared up without me doing anything special other than moisturising.  I have been a lot more tired on T so do take it easy as much as you can.    Cheers, Linda xx",
      "MessageIndex": 15,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Ding ding ding!!! Yes Bigguy, had last chemo today. Ringing my virtual bell as not one on ward. All the best for your upcoming final one too.  Congratulations to Karebear too !!! Will catch up with everyone’s news tomorrow. Trying to have early night as slept rubbish last night- partly steroids, partly nerves or excitement.  Linda xx",
      "MessageIndex": 52,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Dormouse - Sorry to hear you are still in the hospital.  It is very frustrating when there is nothing you can do about your temp but it obviously is a warning sign of lurking infection and needs treated.  Been there unfortunately!  Good news is that things can turn round very quickly and you could be grand by evening or tomorrow.  It's also a head-melt when you're chemo is put back as you have these days in the calendar and can just imagine/dream about finishing.  But you will get there.  You are doing fab.  Big hugs.  Linda xx",
      "MessageIndex": 109,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Hi Peanut, I'm the same and like Blaster am having the chemo first, then operation and radiotherapy.  The chemo is to shrink the cancer before the operation and hopefully lumpectomy and node removal.  I've been told that they will start the Herceptin same time as T part of chemo and that will be every 3 weeks for a year and Tamoxifen for 10 years.  I've had first FEC chemo on 20 Dec and next due Wed.  I think in England they give you Perjeta/Pertuzamab with the T bit for HER2+ (or maybe just some health authorities?) but they don't in Scotland.  They said I would have to pay £15,000 if I want it.  I do believe it is being reconsidered by the Scottish government health committee in January though.  Don't hold out much hope as they've rejected it 3 times on the basis of cost. L xx",
      "MessageIndex": 8,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146297/her2-and-er-positive",
      "Title": "Her2 and ER positive"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Sammystaff - that sounds grim re the nausea/sickness.  Glad the sickness meds worked in the end though.  I'm sure the hypnotherapy will help with your needle phobia.  it sounds like a good idea.  As jmp says, as you have such an extreme reaction, the hospital could consider a PICC line or similar.  DL  - I've had the sore nails too since the beginning of T but it's not progressed to them falling off or anything.  In fact they look quite healthy.  I'm hoping it stays that way although I've read of folk losing their nails after chemo.  I started off with putting dark nail varnish on them, as that was supposed to help somehow, but now I just keep them short and treat with cuticle oil and paint with clear nail hardener.  L xx",
      "MessageIndex": 20,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "karebear - Baby steps sounds like the way.  I think we are just going to copy each other - one week into last T too.  That sounds like a plan as I need to get off my sofa/bed.  After I've caught up with my sleep tonight (see below).  Gradually recovering after a couple of duvet days on Sun/Mon.  I mentioned on The Operation thread that I had my oncologist appointment today and good news is that I have my operation date now - 8 May.  Will be a lumpectomy and full node clearance.  But I just had a total meltdown last night.  Couldn't sleep, panicking, worrying, loads of tears this morning.  To make matters worse, I went to the wrong hospital and missed my appointment.  I just went to the hospital I had last seen that consultant at, but hadn't read the letter properly.  Anyway, they thankfully squeezed me in a bit later at the other place.  It's not the operation I am worrying about.  It's just everything else.  Seem to have room after chemo now to feel a bit...overwhelmed.  Anyway, I think the key is your idea, Karebear, and just getting myself back a wee step at a time.  (And the counselling, which I have now contacted MacMillan about.) Linda xx",
      "MessageIndex": 169,
      "PostDate": "11/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Sammystaff - I found the skin in my nether regions in general was very thin and sensitive.  So moist loo roll and even some nappy cream, which you can get cheap in supermarket, were good.  xx",
      "MessageIndex": 106,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Sammystaff - I can tag people when on the PC but it doesn't work on my iPad.  So probably dependent on your device xx",
      "MessageIndex": 110,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Ruby Rose - Just wanted to send you a hug and reassure you.  None of us are strong all the time and I know I have very low moments during my chemo.  But I have also had lots of normality, days out, dog walks, keeping to the routine when I can.  Cancer is not your fault and I'm sure your family understand that.  My husband has been a lovely support and, after all, the vows say 'in sickness and in health', and I would do it for him in a minute.  And this is temporary.  You will get well again.  It is a daunting prospect at the start of chemo (or the start of a new regime like T, not sure if you've already had FEC) and I know that you are panicking - it's the fear of the unknown.  I know I felt the same before mine started, which was before Christmas, and here I am out the other end now.  Just take it a cycle at a time, a day at a time, rely on advice of the BCNs who will put you at your ease, and do pick up the phone and contact them if you are struggling with side effects.  And keep in touch on here for support.  Take care and big hugs, Linda xx",
      "MessageIndex": 150,
      "PostDate": "10/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Aspen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/aspen",
      "Content": "Karebear - I don’t feel guilty as such as I know I’ve been through the mill/ earned my stripes - however you want to put it. But I get what you’re saying. I have a friend who has now come to me because she has just been diagnosed and started chemo last week. I had a mix of emotions about it cos I don’t feel like any expert. But mainly I was sad for her and wanted to just be there. I remember the shock, confusion and terror only too well. We know each other through an online forum and have never met so I picked up the phone and called her. It has meant the world to me when my friends have done this instead of texting ( though that has its place, sometimes good friends stay a bit at arms length).  I certainly feel at a new stage with a whole new jumble of emotions. I’ve had a very teary week. Like hysterical sobbing fits. I reckon it must just be cathartic.  Ruby Rose - glad you got the chemo over and done with. Thinking of you  Linda xx",
      "MessageIndex": 218,
      "PostDate": "14/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    }
  ]
}