{
  "AuthorID": "Athenax2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
  "Posts": [
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "Hi Tessa In the chemo suite, the nurses were encouraging about trying cold cap (I will have FEC). I saw both the sort of separate hat things, and also a device like a hair salon dryer only where the big thingy is that goes over your head, is a sort of coiled thingy which gets v. cold. It didn't seem too awful. I have elected to try the salon hair dryer thing as it is in a smaller room, and in the bigger chemo room 40 patients a day are going through, so hopefully the smaller room will be a bit more calm. hopeit all goes ok anyway - much love",
      "MessageIndex": 12,
      "PostDate": "05/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10978/hair-loss-cold-cap-and-fec-t",
      "Title": "Hair loss/cold cap and FEC-T"
    },
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "Hello all. I have spent a long time researching cold cap use and am not surpriosed thastTessa encountered the \"fibs\" from the nurse that can't be bothered. Take heart - the overall experience of people using cold cap whilst on FEC is positive~! ~So do it! here's the info (Tessa - I sent you a OM) Closing the toilet seat before flushing will dramatically reduce distribution of bacteria in the bathroom. I was told to flush twice first 2 days after chemo (I was on A/C). ……… Hairy tongue * Frequent cleansing with combo of water, baking soda and salt is recommended, * Sucking on lemon wedges to re-encourage salivary glands, * Brushing one's tongue with a toothbrush, hydrating with water. Cytoxan seems to mess with the salivary glands.………. • Yesterday I learned some handy-dandy pointeers for making it easier to locate a \"good\" vein from which to draw blood or start an IV. • A/C can be hard on the veins. At some hospitals, women on A/C automatically have a port surgically installed. At MSKCC, however, I was given the opportunity to use my veins. The goal is to keep my veins in good enough health that I can use them for all 8 treatments. Another goal is to \"start low\" on the arm so that if one vein is blown, then they can work their way up. A nurse can go to a higher vein for attempt #2, but she cannot go lower. • • The standard advice is \"Drink lots of water\" because hydrated veins are easier to find and stick. I still \"blew\" a vein on the back of my wrist on #4. At #5, I asked the phlebotomist (not the nurse), \"Any pointers? Any advice?\" She said, \"Well, I've noticed that your hands are always cold. Cold veins don't work very well. Warm up your hands before they put in the IV, draw blood, etc. You could use a hot pack or you could just rub your hands together. Run them under warm water. \" That's odd, my hand is cold? Why is that? And this wonderful, brilliant phlebotomist said, \"You're probably drinking a lot of water. Are you holding your water in your right hand? It's probably cooling off your hand and your circulation in that hand. Either drink room temperature water or hold the bottle of water in your other hand.\" I could have kissed her. • • The nurse also has a technique for finding good veins. She had me hang my arm down off a pillow and pumping my hand open and closed to make it easier to identify a vein. The result? My IV was about 2 inches above my wrist (still low, I have another six inches of forearm to use!) and it went off without a hitch. • Pain/aches • Tylenol is the first pain killer of choice for A/C as it has the fewest possible side-effects (I was told \"No Ibuprofen or aspirin.\") The poster suggested taking a painkiller 30 minutes prior to the Neulasta injection, and then regularly for 2-3 days after. A/C & Ibuprofen are processed through the liver; Taxol and Tylenol are processed through the kidneys. For this reason, I was urged to use Ibuprofen w/ Taxol and to use Tylenol w/ A/C. [I find it all very confusing; \"Ask your doctor which pain reliever is right for you.\"] Supplements: Check with a dietician or a nutritionist about supplements and multivitamins. (My A/C + T regimen may contribute to bone loss. I checked with MSKCC dietician & a nutritionist and they recommended I take Calcium Citrate, Magnesium, Vitamin D3 (cholecalciferol) during chemo (and forever) to combat bone loss. They said \"not during chemo\" to everything else, including a multivitamin. They also said \"never\" to most soy products [I am ER+] -- only 2 servings a week-- and Vitamin C supplements.) . I had nausea with the FEC (but controlled with Emend) the first one being the toughest for me as far as the nausea and just feeling puny. I got thrush with each chemo i had despite chewing ice while they are doing the Epirubicin push...I got my treatments on Thursdays and was back at work by Tuesday of the next week. I was a little fatigued but like I said FEC was a cakewalk for me compared to the taxotere. .. I completed my three rounds of FEC about two weeks ago. The third one was definitely harder than the first two. My main SE's were the nausea, (but I only threw up once) and I was really tired on about day 3 and 4. I also had very bad heartburn, but my onc prescribed a good med and that took care of it. I was like Texas357 - I was laid out for about the 3 or 4 days after the treatment, but the next too weeks, I felt almost normal. …. I started FEC-T every 3 weeks on 1st July 2009 and I have had 2 rounds of FEC so far. I will have another round of FEC then 3 of Taxotere. I have had feelings of nausea with the FEC, although I have not actually puked so far. I have taken the anti nausea meds they give me for the first 3 days regardless of whether I feel I need them or not. I am also given some different meds for nausea that I can take as and when I feel the need, but so far I have not needed these. I have also had a slightly sore, rough mouth and I made a salt water mouth rinse several times a day and that helped me. It has not developed into mouth ulcers or sores yet. I have felt a bit yukky for a few days after each round, food and drinks have not tasted right, but it has actually not been as bad as I thought it might be. I would say my side effects have been fairly minimal so far",
      "MessageIndex": 15,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10978/hair-loss-cold-cap-and-fec-t",
      "Title": "Hair loss/cold cap and FEC-T"
    },
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "Hi everyone. I posted a long thing onto this post ages ago which was actualy not what I meant to paste in, so apolgies. I am doing 6 cycles of FEC 75. I go to the Royal Marsden. The nurses in the chemo dept there are very pro the use of cold cap and whilst I understand it may not work for me, the nurse told me she reckons I might very well get away with thinning. I didn't find the wearing of the hat too awful. It wasn't particularly painful or uncomfortable but did require a bit of determination. I would put that on a scale of 4 out of 10 in terms of difficulty. As I was made redundant at Christmas, at the moment I can easily fit a little time into my schedule to use the hat. It is only an extra hour or so here and there. If you are new to this thread and have the opportunity to try it - do. Really, just do. For hair washing : The Patient Information Services chemo brochure (royal marsden) specfically states: \"Chemotherapy can cause your hair to become dry and brittle, so take good care of it. Use a neutral pH shampoo and conditioner (baby shampoo is too alkaline). Hope this is useful, good luck all",
      "MessageIndex": 29,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10978/hair-loss-cold-cap-and-fec-t",
      "Title": "Hair loss/cold cap and FEC-T"
    },
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "Very useful to know. Have a great weekend -",
      "MessageIndex": 31,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10978/hair-loss-cold-cap-and-fec-t",
      "Title": "Hair loss/cold cap and FEC-T"
    },
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "USA ladies seem to think Nioxin Follicle Booster is pretty good. I haven't tried it or seen it here, but thought I'd mention it. xxxxxx",
      "MessageIndex": 32,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10978/hair-loss-cold-cap-and-fec-t",
      "Title": "Hair loss/cold cap and FEC-T"
    },
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "Hi Tessa- sorry not to have been in touch but I got lost on this site! I don't know if you've sorted out a decent wig (should it become necessary) but I went to Selfridges yesterday and I have to say, it was bloody brilliant! It is a wig place in a posh salon in the beauty treatments zone, they make you a fab coffee, and all in all, it is like going to buy a really grand hat for a wedding, or Ascot. Great range of wigs and free beauty treatments etc. A greek friend who is being trated in Athens has told me that many of the girls doing cold cap treatment there have actually retained quite a lot of their hair, so it really is worth considering. I am going to give it my best shot as it would take years to grow my hair so long again, but having a good wig to hand is comforting. Hope the chemo goes well. I start FEC in about 3 weeks. lots of love -",
      "MessageIndex": 9,
      "PostDate": "21/07/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10970/driving-and-chemo",
      "Title": "Driving and chemo"
    },
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "Jeanette - I have just started FEC at the Marsden. It wasn't to bad starting off and the nurses are great in the M",
      "MessageIndex": 58,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10850/has-anyone-chosen-not-to-have-chemo",
      "Title": "Has anyone chosen not to have chemo?"
    },
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "Jeanette - I have just started FEC at the Marsden. It wasn't to bad starting off and the nurses are great in the M You may also find a welath of info on www.breastcancer.org It is a very active american site, with some great sassy women on there, lots of posting all the time. All the info parts of the sire are great too. Good luck!",
      "MessageIndex": 59,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10850/has-anyone-chosen-not-to-have-chemo",
      "Title": "Has anyone chosen not to have chemo?"
    },
    {
      "AuthorID": "Athenax2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/athenax2",
      "Content": "Half my post wouldn't post before!! The chemo depot really is excellent - go there in confidence. Nothing hurt. Try the cold cap treatment to retain your hair - it works and is worth it. Phone them to let them know you want to do it. FEC (my chemo) - really not too bad. Having it doesn't hurt and the nurse was with me all the time. I felt seasick in the evening, and the same for 3 days. You MUST take the anti nausea meds. Drink lots of fluids, but water tasted horrid - lay in tonic water and ginger ale and fizzy mineral water (not still). Get some constipation pills and use them - I got constipated about day 3 and 4 and it was agony! then explosive! so don't wait, take the pills. I didn't get on very well with the steroids but cut the dose and it has settled down. I am sleeping ok but waking a bit early. Feel perfectly ok to exercise. Eating fine - don't eat too much fresh fruit or brocoli - it sets off your tummy! Get in plenty of decent yoghurt - very soothing on tummy. Get mouthwash to prevent sore mouth. I just started getting sore tongue today; it comes with the territory. My overall verdict though is - don't be scared. Once you've got past the feeling pukey stage (I haven't been sick) you'll be fine. Write down on a piece of paper when you take all your tabs coz otherwise YOU WILL FORGET if you've taken them! As it is the unknown, until you've done it you feel really apprehensive - it is natural. Remember, work out the percentage for each treatment. IF like me it is 6 treatments, at the end of the fist one you've completed 16.66% of total treatment, no. 2 is 32%, no 3 - 50% - it really helps break things down. All best wishes -",
      "MessageIndex": 63,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10850/has-anyone-chosen-not-to-have-chemo",
      "Title": "Has anyone chosen not to have chemo?"
    }
  ]
}