{
  "AuthorID": "Audrey.77",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/audrey.77",
  "Posts": [
    {
      "AuthorID": "Audrey.77",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/audrey.77",
      "Content": "Hello everyone. Hope you are doing well. I received a 2nd breast cancer diagnosis 5 weeks ago, my first being in 2010, aged 31 then. Both times I have been lucky it was caught early. I had a mastectomy in 2010 & another 3 weeks ago. First time I was diagnosed I feel I dealt with it super well & remained totally positive throughout. My personality will always see the bright side of everything. But unfortunately this time around I seem to have sunk very low & I cannot see the light at the end of the tunnel. I find it hard to motivate myself to even get out of bed & I am so jealous of everyone around me for just being cancer free. It's a horrible feeling. I suppose I am looking for someone who will tell me they have been there twice & came out the other side with a good mental outlook. Thank you for reading this. X",
      "MessageIndex": 0,
      "PostDate": "16/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97724/2nd-time-around-the-bloc",
      "Title": "2nd time around the bloc"
    },
    {
      "AuthorID": "Audrey.77",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/audrey.77",
      "Content": "Thank you for your message Dreamthief. You are very kind and you make very practical points! My first diagnosis was ER+, PR+ & HER2-. This time it is positive for all three. Treatment last time was 4 sessions of chemotherapy (cyclophos & taxotere) & 15 sessions of radiotherapy. I had 2 tumours that time, 1.1cm & 2.2cm with calcification between. This time the tumour was 1.2cm. There was no lymph node involvement either time thankfully. My chemo starts on the 21st of September & this time I am having 4 sessions of cyclophos & another that starts with A. (Sorry it has completely left my head), then 12 weeks of Taxol along with Herceptin, which will continue for a year. I know it will be all fine in the end but I just feel so deflated right now. The hair loss this time around is really bothering me for some reason. Last time I just got on with it. I think I am more resentful this time but you are right Dreamthief. I need to buck up a bit!! Thank you.",
      "MessageIndex": 2,
      "PostDate": "16/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97724/2nd-time-around-the-bloc",
      "Title": "2nd time around the bloc"
    },
    {
      "AuthorID": "Audrey.77",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/audrey.77",
      "Content": "Hey again, Thank you so much. That information link was so useful. I am starting chemo on the 21st of September with the 2 cytoxics every 3 weeks. That chemo will finish last week of December & I will start the Taxol just before Christmas. I am so glad to hear the Taxol is not so severe Dreamthief. Thank you. I got through treatment very well last time. I would just feel a bit spaced the day I received the chemo & the day after. Day 3 & 4 I would feel like I had a flu & then I started getting back to normal. I've seen a nutritionist about building myself up as best as I can so I start with optimum health. This time I feel more drained & I'm still building fluid under the skin from surgery. I had no fluid build up in 2010. I'm having a mini pity party today & eating my body weight in junk food but tomorrow I will start preparing myself for 5 weeks time. How are you doing Dreamthief? You have been super helpful. Thank you.",
      "MessageIndex": 4,
      "PostDate": "16/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97724/2nd-time-around-the-bloc",
      "Title": "2nd time around the bloc"
    },
    {
      "AuthorID": "Audrey.77",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/audrey.77",
      "Content": "Hello everyone, I am starting chemo tomorrow & would love to join the monthly chemo group. I am still trying to navigate my way around this site. Could anyone tell me where to find it & how to join? Please & thank you. A",
      "MessageIndex": 0,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98926/re-how-do-i-join-september-chemo-group",
      "Title": "re: How do I join September Chemo Group?"
    },
    {
      "AuthorID": "Audrey.77",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/audrey.77",
      "Content": " Thank you Julia. The reason is because I had to take them in 2010 when I was going through chemo then & they made me so restless. They kept me awake every night. I found from not taking them on the AC this week that my energy levels were low but I slept through the first 5 days & it made it easier. I know my Oncologist would be very much against it. I'm usually not one to go against doctors orders but I really wanted to avoid the restlessness. I felt very brave this time but in reality I would probably be too apprehensive as the AC builds up in my system each time. Thanks again Julia. Can I ask you one more question please? I am having weekly sessions of Taxol after my 4 AC. Which did you find more difficult? I feel blessed that I got through my first AC as well as I did. ",
      "MessageIndex": 2,
      "PostDate": "04/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99475/re-steroids",
      "Title": "Re: Steroids"
    },
    {
      "AuthorID": "Audrey.77",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/audrey.77",
      "Content": "Hello Everyone, I just had my first session of AC on Monday. I took Emend for 3 days but decided to chance giving the steroids a skip. I don't want to be foolish but I managed the nausea with the Emend & prescribed Valoid when I needed them. I just wondered if anyone else got through chemo (Adriamycin more to the point) without steroids? Thank you.   Audrey. X",
      "MessageIndex": 0,
      "PostDate": "04/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99475/re-steroids",
      "Title": "Re: Steroids"
    },
    {
      "AuthorID": "Audrey.77",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/audrey.77",
      "Content": "Thanks Julia so much. I appreciate your help. In 2010 I was on 4 x sessions of Taxotere & Cyclophos every 3 weeks so my full treatment was over in 3 months. I was HER2- then. I'm HER2+ now & the regime is just so different. I just don't know anyone personally sho has been on the AC-T. ",
      "MessageIndex": 5,
      "PostDate": "04/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99475/re-steroids",
      "Title": "Re: Steroids"
    }
  ]
}