{
  "AuthorID": "AvaC",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/avac",
  "Posts": [
    {
      "AuthorID": "AvaC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/avac",
      "Content": "Hi everyone, an incredible woman I have known for many years was diagnosed with breast cancer last year. She underwent a mastectomy and began chemo whilst supporting her ex-husband before he passed away after suddenly experiencing his own health complications. She cared for him whilst being an incredible mother to her three boys. Following this, she was a victim of domestic violence in her following relationship and is just an all round wonderful person, she is now doing really well. All of this is led me to thinking about CHOICES. What happens when you lose the privilege of choice, the choices that we make in our relationships, and how we respond when cancer enters our lives and the challenges that come with them all. I am currently researching a writing project relating to women and cancer and would love to hear as many of your views as I can. What do you feel in relation to \"CHOICE\" in your experience of cancer? ",
      "MessageIndex": 0,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67707/thoughts-on-being-a-woman-cancer-and-choices",
      "Title": "Thoughts on being a woman, cancer and choices."
    },
    {
      "AuthorID": "AvaC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/avac",
      "Content": "Thank you for all of your responses to the original post. I really appreciate all of your frankness and honesty. I deliberately made the title vague in not wanting to impose an opinion on something that I have not myself experienced. My actions and intentions are always for truth and understanding - I have worked with vulnerable people in many contexts but never to write an essay - male, female, young and old I have been in talks with Women's Aid and recently worked with Kids Company helping young people to write about and tell the stories that have changed their lives. I will request that this discussion is closed as I don't wish for it to continue in its being inappropriate. I sincerely apologise for any upset that I may have caused and send my best wishes to you all xx  ",
      "MessageIndex": 11,
      "PostDate": "28/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67707/thoughts-on-being-a-woman-cancer-and-choices",
      "Title": "Thoughts on being a woman, cancer and choices."
    },
    {
      "AuthorID": "AvaC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/avac",
      "Content": "Dear ladybird, I sincerely apologise if my post seemed underhanded. I am writing this for my friend because in speaking with her she expressed how she felt she hasn't been able to be open with the people that she loves and the pressure of protecting her children from the distress that it caused them often resulted in her feeling as if she was having to deal with what she was going through on her own I don't think this is something that people often consider. I have not been in her shoes, I have not had your experience and I cannot imagine what it is like, having seen what she has been through, believe me, I am not here to upset anyone.  ",
      "MessageIndex": 3,
      "PostDate": "28/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67707/thoughts-on-being-a-woman-cancer-and-choices",
      "Title": "Thoughts on being a woman, cancer and choices."
    }
  ]
}