{
  "AuthorID": "Baileybelle",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baileybelle",
  "Posts": [
    {
      "AuthorID": "Baileybelle",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baileybelle",
      "Content": "Hi Carolyn, Isn't this bra thing annoying? I just get so frustrated, it really is a big thing for me. I struggle to cope with all that's happened to me without the added upset it causes every time I walk past the underwear section of any clothing shop! I end up getting really upset and running out of the shop. I feel like a freak!  I do have a general anxiety about surgery, I considered the implant but was told I only had a 50% chance of success due to having had radiotherapy. I know surgery is the answer but I just can't do it! I wish I could do something about this bra problem. Thank you for the advice about twitter. Julie",
      "MessageIndex": 3,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122989/mastectomy-bras",
      "Title": "Mastectomy Bras!"
    },
    {
      "AuthorID": "Baileybelle",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baileybelle",
      "Content": "Hi ladies! I had a grade 2 breast cancer diagnosis in 2009, I had a right mastectomy without reconstruction, I was only 40 years old!  I had chemo, radiotherapy then 5 years of tamoxifen! I'm sure most of you ladies out there know what this means? Before this all happened I loved buying pretty matching underwear, I took care in my appearance then suddenly you are missing a breast, loosing your hair and gaining lots of weight, not to mention the complete shock of the diagnosis and having to deal fear and dismay! Once I started to recover from my chemo in 2010 I went on a mission to find pretty, reasonably priced bras.  To my delight Marks and Spencer did a lovely range, packs of two for around £22.00 in Pinks, Blues, Red, Black, White & mixed patterns all with matching pretty knickers. wonderful! I equipped myself with all colours, every time they brought a new range out I bought it. It made me feel feminine again, then about 18 months later I noticed they were only doing plain black or white? all the other bras all looked horrendous to me, horrible shades of beige. I contact M&S to find out why they had stopped supplying all these pretty colours but they did not answer my question! I must also mention that I could only purchase the pretty ones online, they were never in any of the stores!  I am still hanging onto my pretty coloured ones (which of course by now are worse for wear) I still buy the Black/White ones online only. I have bought bras from the many catalogues out there for us unfortunate ladies but they are so expensive, why should we have to pay these prices for bras that everyone else can buy at reasonable prices? I only buy them when they are on sale and even then it's hard for me only being a 32c, a lot of bras start at 34? Why?? I hope you do not feel I'm being trivial but I can't be the only one who feels like this? I feel bad about myself since the surgery, I'm too scared to have a reconstruction, I cant even look at my disfigured body! I am well aware that I am very lucky in many ways but I am struggling to understand why we cannot purchase reasonable, colourful, feminine underwear to make us feel the way we used to? I want to find out how many ladies out there feel like this? Please comment, I feel something needs to be done about this!",
      "MessageIndex": 0,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122989/mastectomy-bras",
      "Title": "Mastectomy Bras!"
    },
    {
      "AuthorID": "Baileybelle",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baileybelle",
      "Content": "Hi Marie! Its comforting to hear other ladies are going through this difficulty, as if we don't have enough to deal with? You would think this part should be easy! Why make it so difficult for us? It doesn't matter what size, shape, age etc we are, the fact remains we cannot source pretty bras, perhaps stores think we should just be content with frumpy, beige bolder holders! I too had no income for a year whilst going through my treatment, I think there should be some sort of allowance or fund for ladies to be able to have something that resembles a garment we may have chosen before our diagnosis! This is such a major part of recovery, we have our femininity taken from us in every way it seems.  I wish I could give you some advice but this is why I am posting on here, I wanted to know how many ladies have an issue with this.  I do hope you find something nice for Valentines Day? Wishing you all the best for your recovery my lovely!      Julie xxx    ",
      "MessageIndex": 6,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122989/mastectomy-bras",
      "Title": "Mastectomy Bras!"
    },
    {
      "AuthorID": "Baileybelle",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baileybelle",
      "Content": "Hi Dee, Thank you for your comment. I hope you are feeling better, chemo really takes it out of you doesn't it? Isn't it amazing how the remaining booby gets bigger? This also happened to me, I used to look down at it and think \"can't you just disappear\" I can reassure you that it does go back to normal after all the treatment, so does the weight gain. I'm back to my usual size 8 now but I'm only 5ft and went up to a tight size 12 with one huge boob! I felt horrible, the Tamoxifen did it to me more than the chemo. There is light at the end of the tunnel my lovely! The Matalan bra sounds very good value for money but black and white again!  it's as if they think \"that will do for them, they wouldn't want lovely colours etc\".I feel we are punished for something totally out of our control. I have bought a couple of bras from Amonea but had the same trouble as you, even now they feel uncomfortable although they do a marvellous vest top which has a built in double pocketed top, very comfortable. I teach Zumba and I wear them for that, once again they are expensive but a wardrobe essential for me now (and they come in a few colours). I intend to take this bra issue further, not quite sure how to do it but I'm sure there are hundreds maybe thousands of ladies feeling like this.  Take care of yourself Dee, be strong & go with it ! Julie xx",
      "MessageIndex": 4,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122989/mastectomy-bras",
      "Title": "Mastectomy Bras!"
    }
  ]
}