{
  "AuthorID": "bakersdozen13",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bakersdozen13",
  "Posts": [
    {
      "AuthorID": "bakersdozen13",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bakersdozen13",
      "Content": "Jazmine - Admin Hi everyone, What did you do to keep your mind/yourself busy whilst waiting for test results? We understand that the gap between having a scan/having a biopsy etc and getting the results is incredibly nerve wracking; did you do anything in particular to keep your mind off it? Did a long walk help, or did you prefer to do crosswords? Swimming or drawing? We welcome all suggestions - just comment below. Jazmine Jazmine - Admin Hi everyone, What did you do to keep your mind/yourself busy whilst waiting for test results? We understand that the gap between having a scan/having a biopsy etc and getting the results is incredibly nerve wracking; did you do anything in particular to keep your mind off it? Did a long walk help, or did you prefer to do crosswords? Swimming or drawing? We welcome all suggestions - just comment below. Jazmine",
      "MessageIndex": 10,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117088/keeping-your-mind-busy---suggestions-welcome",
      "Title": "Keeping your mind busy - suggestions welcome"
    },
    {
      "AuthorID": "bakersdozen13",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bakersdozen13",
      "Content": "I am a Laryngectomy.  Mine was put down to smoking, although I had given up smoking 38 years before.  After my operation, I decided to write my life story.  I am 78 years old.  Smoking as we knew it then, we didn't know that smoking had anything to do with poor health, so haveing started my story, I realised that I had been smoking from the day I was born, as my parents smoked, then there was smoking on buses, Cinemas, theartres, pubs clubs, works canteens etc, so even after being stopped for 38 years, I was still smoking other peoples smoke.  Then I went down the road of doing my family tree, only to find that, grandparents on both sides suffered cancer of some sort and my father also, so I was doubly at risk.  Out of all this, I did a list of family illnesses, both cancer and other illnesses.  I gave a list to my three children, as sometimes Doctors ask if there has been different illnesses in the family.  Anyway, I am 14 years on from my cancer operation, and feeling great.",
      "MessageIndex": 21,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132235/lifestyle-questions",
      "Title": "Lifestyle questions"
    }
  ]
}