{
  "AuthorID": "Baki",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
  "Posts": [
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi friends, Ever since I was diagnosed with mets to the lungs and rib cage (so far), I have gone through the normal sequence of shock, absorbing the shock, acceptance, and then keeping a false pretense of baldness. I am especially scared of the fate of my younger son who is still completing his studies as well as the usual fear of the future unknown world that I am to move to soon. All my supportive friends and family are not comfortable speaking about death. I do not feel comfortable talking to shrinks. But I cannot avoid the feeling that I have given a death sentence and that my doctors are the solicitors who are trying to prolong the process through appeals. This feeling makes me want to give in and perhaps this is why my tumor markers and scans showed rapid progression. I am sure that if the new regimen also fails, I shall totally succumb. I have already given up on the holistic approach towards my new cancer since it has apparently failed to help the previous protocol. I've been fighting the first grade 2 BC episode 4 years ago, but now I fee that i have lost all my cavalry and fighters. What probably made things worse was the backstabbing at work which finally made me quit and move to a more serene less financially rewarding job.  Now, how is there any way that I can avoid this obsession with the death sentence attitude?   ",
      "MessageIndex": 0,
      "PostDate": "31/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109812/how-do-i-change-my-perspective-of-a-death-sentence",
      "Title": "How do I change my perspective of a death sentence?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "No need to worryy dear Aneesa. Usually 2-3 shots of Neupogen should fix your blood count and bring it back to normal or acceptable levels. This could be a reaction to the chemo till your body gets used to it. I've been constantly put on Neupogen at the end of each cycle. It is very important that you avoid crowds. Stay away from infected people and take extra care of hygiene. Also wear masks on each visit to the clinic. Good luck ",
      "MessageIndex": 12,
      "PostDate": "17/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123362/wheezing-and-coughing",
      "Title": "Wheezing and coughing"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "My French oncologist prohibited me from taking vitamins or food supplements while on chemo but allowed Manuka honey. In general he advises me to have a balanced diet with lots of fruits and green vegetables, fish, and less dairy. I trust him because he cares about every single detail starting with explaining how to read PET scans all the way to recommending nail strengtheners and cotton gloves. ",
      "MessageIndex": 6,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123362/wheezing-and-coughing",
      "Title": "Wheezing and coughing"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thanks between and Carolyn for the links. I am a stubborn person who refuses but to see any job well done. This disease is not only killing my healthy cells, but it is devouring this trait in me as well. My close friend will help me with meditation and other spiritual therapies as this is her domain. She cries whenever we speak about death and I end up supporting her!   I just want to do all that I could for the sake of seeing my son established. Otherwise guilt will kill me. I am even trying to look for clinical trials if my current regiment fails as the least I could do is help researchers develop future drugs for patients. I hope the doctors prolong the process till I see my son kick start his career. I've invested so much in him and he's not coping with my illness. He panics whenever he sees me in pain. All my best wishes to you that no recurrence erupts.",
      "MessageIndex": 3,
      "PostDate": "31/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109812/how-do-i-change-my-perspective-of-a-death-sentence",
      "Title": "How do I change my perspective of a death sentence?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thanks for the reply. Indeed I need to discuss such stuff with close people. Yet my family and friends always seem so uncomfortable and hurt discussing death and fear of death. I need reassurance from my husband as to how he's going to take care of my boys whilst starting a life with someone new. He refuses such talk. My son is concerned and seems to be trying to help me sketch his future. He suggests that his dad tries to secure a small flat for him and his brother to share after my departure. My husband gav him a piece f his mind and refuses such talk. My best friend asks me not to \"talk like this\". I have a cousin who accepts this kind of talk but her words seem far too harsh and painful. I can't find someone who discusses these crucial matters in a balanced way. Part of my cure is to feel that my sons' future is secured.  ",
      "MessageIndex": 17,
      "PostDate": "12/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109812/how-do-i-change-my-perspective-of-a-death-sentence",
      "Title": "How do I change my perspective of a death sentence?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Rhonda, I wish you well from the bottom of my heart. I hope that you belong to the 1% NED that make it for long long years. It feels so bad putting our loved ones through this and the guilt kills me even faster than the cancer cells and multiple tumors. It is this guilt that probably makes us push away people who probably love us. Please take special care of your daughter as her serenity is probably masking a volcano that you do not want to erupt at the wrong time.  I crave to see my grandchildren but my son has decided to name his future daughter after me. I hate my name but I love the gesture. It helps a lot finding people who fully understand how we feel. I hope that we do not suffer a lot and do not cause others much pain. My boys deserve a happier carefree life similar to people of their age.  I hope that our children cope and learn to snatch a few happy moments amid this ordeal. You too take good care and stay tuned xxx",
      "MessageIndex": 20,
      "PostDate": "12/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109812/how-do-i-change-my-perspective-of-a-death-sentence",
      "Title": "How do I change my perspective of a death sentence?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Londonlass  Hope things went well today. ",
      "MessageIndex": 24,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121471/now-i-know",
      "Title": "Now I know....."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I would like to add that I am using thick silicone heel insoles all the time especially for my home woollen slippers. After a couple of weeks the pain started to subside. You can find them at most pharmacies but make sure that the insoles are not for the entire foot but only for heels and are very thick with a soft spot. I have a few of these and never go without them. After three months of religiously using these my pain has decreased by at least 50-60%. I am still on taxol+Avastin. Hope it works for you. ",
      "MessageIndex": 6,
      "PostDate": "27/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120309/side-effects-of-fec-t-on-feet-and-body",
      "Title": "Side effects of fec-t on feet and body"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I feel much worse during my chemo infusions. I don't want to overload you with my inability to breathe properly and the terrible thoughts that I get. I also taste the infusions which may make sense and may not be an illusion after all.  My coping techniques change every time since what seems to work one time fails later on. Last time I downloaded a very interesting thriller movie that kept me absorbed for most of the session. Some times I use meditation but it does not work any more. Sometimes I ask a friend to come but this has started to fail. I have asked them for sedatives which make me sleep for half of the session but the nurses keep waking me up checking up on me. So I asked them to discontinue this.  I am not sure what to do next time. I just hate this disease from the bottom of my heart.  I am sharing this with you just to let you know that you need to come up with so many methods just in case one method lets you down. Alternatively you can use more than one technique during the same session. My very best to you and please do let us keep this thread going with more suggestions about coping techniques. Big hug my dear xxx",
      "MessageIndex": 17,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121054/psychological-revulsion-towards-intravenous-drugs",
      "Title": "Psychological revulsion towards intravenous drugs"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hello dear  I was prescribed Neosporin, albeit I was warned not to use it after the infection has gone or else the germs would develop resistance to antibiotics. This is why it is available only on prescription. My advice is to go see your GP in case your surgeon is not available. If the wound is infected they will prefer to try antibiotic sprays for a day or two before prescribing oral antibiotics. This is what happened to me and the infection cleared up after a few days without the need to pump more toxins into my system.  Good luck",
      "MessageIndex": 23,
      "PostDate": "17/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119786/what-is-the-best-antibiotic-for-wound-infection-after-mastectomy-any-reccomendations-please",
      "Title": "what is the best Antibiotic for wound infection after mastectomy...."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "In France they gave me antibiotic spray in addition to the antibiotic pills. The surgeon himself also changed the dressing every week to make sure that no infection developed. He instructed me to use the spray three times a day for 2-3 weeks till the wound fully healed. He gave me the dressings and the spray. You may want to check this with your team but I think that in some clinics in the UK they prefer not to use local antibiotic spray.",
      "MessageIndex": 1,
      "PostDate": "16/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119786/what-is-the-best-antibiotic-for-wound-infection-after-mastectomy-any-reccomendations-please",
      "Title": "what is the best Antibiotic for wound infection after mastectomy...."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "LondonLass we are all keenly awaiting your results. I've downloaded a mystery movie and it has helped me relax. My kind if work (preparing textbooks) helps me as it makes me feel very useful to thousands of students. Gardening is a pleasure but keeps my thoughts hooked to the impending results. This means that we should keep our minds working. When are your results due? ",
      "MessageIndex": 20,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110360/controlling-anxiety-while-waiting-for-results",
      "Title": "Controlling Anxiety while waiting for results!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thank you friends for recommending the hospital. My oncologist is French and he is renowned for being passionate about his research and patients. He’s putting me on a clinical trial right now and I don’t like to be handed over to a less capable aide. So does anyone of you know  of an equivaletly proficient and caring doctor who’s into clinical trials and research and proved to have a good record? Thanks a lot friends. I am in a mess and prefer London right now because my sister lives there and I can depend on her whenever I’m sick. This is easier than making her travel all the way to frequently see me.  Really appreciate yiur help ",
      "MessageIndex": 5,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155545/recommendations-for-an-oncologist",
      "Title": "Recommendations for an oncologist"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "JPls let's think of a way to deal with this. I am usually a nervous wreck right before my assessments. Keeping busy has not helped. One suggestion is to start a thread where we can support one another before assessments. It may remove like 10% of the anxiety.",
      "MessageIndex": 18,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110360/controlling-anxiety-while-waiting-for-results",
      "Title": "Controlling Anxiety while waiting for results!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "LondonLass we are all keenly awaiting your results. I've downloaded a mystery movie and it has helped me relax. My kind if work (preparing textbooks) helps me as it makes me feel very useful to thousands of students. Gardening is a pleasure but keeps my thoughts hooked to the impending results. This means that we should keep our minds working. When are your results due? ",
      "MessageIndex": 5,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110360/controlling-anxiety-while-waiting-for-results",
      "Title": "Controlling Anxiety while waiting for results!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Congrats LL! That's greet news. Enjoy life as usual and we wish that all goes well for everyone else.",
      "MessageIndex": 26,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110360/controlling-anxiety-while-waiting-for-results",
      "Title": "Controlling Anxiety while waiting for results!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi lovely ladies I was diagnosed with MBC to lung and spine in 2016. I’ve been following up with a brilliant French oncologist who helped keep me alive in spite of poor survival prospects. Now destiny is mocking us and my doctor was diagnosed with cancer. He’s been so supportive and loving to the extent that I’m in a state that he’s sick. We are waiting for the results of his pathology report but I’m here to ask you about recommendations for a specialist in MBC either in Paris or London as I travel between these two cities. I need someone with a rich experience and who tends to patients with warmth and care. Would really appreciate your help. Take good care of yourselves.",
      "MessageIndex": 0,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155545/recommendations-for-an-oncologist",
      "Title": "Recommendations for an oncologist"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thanks a lot Afar, Judith, Carolyn and Helen. I’ll look into this more carefully. My doctor wants his assistant to take over his cases and this makes me uncomfortable. someone recommends Dr Paul Ellis. Does anyone know of him? The credentials of both the two oncologist on the thread are very good. But I need to ask you about your personal experience. Have you dealt anyone personally and felt good. i don’t want someone to turn everything upside down before the current protocol stops working. So unhappy about where I am now. As if we need more things to irritate us :(",
      "MessageIndex": 7,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155545/recommendations-for-an-oncologist",
      "Title": "Recommendations for an oncologist"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "JPls let's think of a way to deal with this. I am usually a nervous wreck right before my assessments. Keeping busy has not helped. One suggestion is to start a thread where we can support one another before assessments. It may remove like 10% of the anxiety.",
      "MessageIndex": 3,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110360/controlling-anxiety-while-waiting-for-results",
      "Title": "Controlling Anxiety while waiting for results!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Congrats LL! That's greet news. Enjoy life as usual and we wish that all goes well for everyone else.",
      "MessageIndex": 11,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110360/controlling-anxiety-while-waiting-for-results",
      "Title": "Controlling Anxiety while waiting for results!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hope you're sound and safe LL. we are here for you. Pls remember he as soon as you an. Many people here need you and love you xxx",
      "MessageIndex": 5,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142672/london-lass",
      "Title": "London Lass"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Wow great news!",
      "MessageIndex": 4,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122687/the-results-are-in",
      "Title": "The results are in!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Yvonne, You have been through a lot and at times one feels that their energy has worn out. Stress could be the culprit, but you also need to go have this checkup. At our age we hope that all cells in our body are somewhat less aggressive. If this is of any help I am also going through very difficult times and will be on chemo as long (or short) as I live. I want you to know that we are here for you so pls promise to go have a checkup. ",
      "MessageIndex": 3,
      "PostDate": "26/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108388/i-just-don-t-know-what-to-do-or-think",
      "Title": "I just don't know what to do or think??????"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I also get my treatment on th  hands of a French oncologist. In France CA15-3 is used to monitor breast cancer efficacy of treatment. It is also used in many countries as part of routine tests to ensure that there is no recurrence. The normal level is anywhere below 30 U/ml. One thing that you should know for the future is that you need to have the markers always done at the same lab because different labs use different kits, hence different labs can give you different readings for the same blood sample. On its own CA15-3 may not be enough but it is useful as one among many other indicators.  One last thing, please do not miss your routine checkups.  Best of luck ",
      "MessageIndex": 8,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119178/blood-test-for-markers",
      "Title": "Blood test for 'markers'"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi darling I know exactly what you're talking about. I'm a metastatic patient with lung and bone mets. What I did was to close my eyes and think about my childhood and adolescent times as well as my first memories of my sons as babies and toddlers. I tried to think of funny stuff to keep my mind off the process. My determination to stick my tongue out to the disease keeps me going. So carry on with this attitude and I am sure it will work for you.  Best of luck and pls keep us posted of the results ",
      "MessageIndex": 1,
      "PostDate": "30/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109775/pet-ct-scan-tomorrow",
      "Title": "PET CT scan tomorrow........"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi LondonLass I'm happy that you got through this. Removal of ovaries sounds like a good option and the operation should minor if they use laser knives. Sometimes I just don't understand why oncologists delay such decisions. Next time pls ask for the advice of a surgeon.  Your medication should be well tolerated and remember to always stay positive. In case you take the downward roller coaster ride pls do speak to us as this is quite normal. In fact it is best to vent out your anxiety and anger and to seek the assistance and support of empathetic people like us who know exactly what you're going through. All the very best and try to follow a holistic lifestyle to help the medication do the job.",
      "MessageIndex": 4,
      "PostDate": "01/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109775/pet-ct-scan-tomorrow",
      "Title": "PET CT scan tomorrow........"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Pls avoid perms and harsh chemicals at all costs from now onwards We don't want a recurrence do we? My onco allows straighteners if I'm too unhappy with my hair.",
      "MessageIndex": 5,
      "PostDate": "13/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126853/curly-hair",
      "Title": "Curly Hair!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Many people don't phone back if I don't pretend I'm les than cheerful. I can't keep the false pretences and everyone's tone is all of a sudden low and sympathetic. Calling me is a burden that I can sense. I cant pretend to be a hypocrite so I've started dodging their questions and replying by asking them how they do and how their families do.  I Share my true feelings with a few empathetic ones as there is a great difference between sympathy and empathy. I see how uncomfortable people are around me. I can't take it any more. I can't live with a sword hanging over my head (I have lung and bone mets) while people say I'm morbid and pessimistic. They expect me to ignore the sword and the SE of the chemo and to feel and act cheerfully.  Life is so unfair and people further complicate the unfairness. I just wish that they let us be. ",
      "MessageIndex": 7,
      "PostDate": "29/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115646/why",
      "Title": "Why ?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "You're so right Bijou. We need to talk to someone about our ordeal and possibly our good days as well. But we ought to figure out the ones who don't want to be pulled down by our odd feelings. We need to limit our whining to each other and. To a few selected ones.",
      "MessageIndex": 21,
      "PostDate": "01/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115646/why",
      "Title": "Why ?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Oh LondonLass! This disease scares the s**t out of us. I am hopeful that it's just scar tissue that would have gone unattended to had you had another diagnosis. Like you, I was asked to got for a thorough thyroid gland ultrasound and the accompanying bloods because my PET CT showed that the gland absorbed some of the radioactive substance. Had your and my diagnosis been different, your scar tissue and my thyroid gland would have gone unchecked. But it is good that our teams are cautious.  I am counting the days with you till next Wednesday so that we soon have this behind us. We will also be with you during the long wait for the results. Please don't forget your pain killers.  I shall be hoping and praying that all goes well for you. Try to distract yourself. You said you love on Exeter right now, so try to enjoy the lovely scenes. I fell in love with this small idyllic city and its lovely scenes. I was so happy to go on two business trips there a couple of years back and was lucky to enjoy great weather. I wish I could be there with you to go on a long walk from High street through the woods and all the way to the uni.  For some reason I am very optimistic that this will be fine for you. Please go on long walks and inhale the fresh air whenever the weather allows you to. I don't have this luxury over here in crowded Paris and I honestly wish I could be at Exeter.  Sending you the biggest of hugs xxxx",
      "MessageIndex": 13,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122180/have-to-be-honest",
      "Title": "Have to be honest....."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thanks a lot Karen. It's great that we can understand each other and share our maladies. Your virtual hug is such great comfort as it comes from an understanding empathetic person.  I wish you all th very very best and hope you can out most of this behind you. ",
      "MessageIndex": 17,
      "PostDate": "30/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115646/why",
      "Title": "Why ?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "All of us understand how you feel; anticipation is soooo difficult but we are here with you to help you out. I still insist that you strongly insist on a PET CT scan jus yo rule out other suspicious stuff. Pls insist and persevere as it is quite expensive and money should not be an issue when health is involved. It's a routine test that ALL French oncos do. Btw my onco is the chief onco at Gustave Roussy the prime cancer institute in France. Also my Getman cousin had the same PET CT scan performed as standard procedure for suspicious metastatic Breast cancer in Germany. MyAmerican friend says that this is also the standard procedure there. So insisit that you have the right to follow global standards. A stitch in time saves nine. You're quite lucky to respond to hormonal therapy. Btw were you on any hormonal pills?",
      "MessageIndex": 6,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111062/cancer-in-spine",
      "Title": "Cancer in spine"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi R, The shock waves hit me when my oncologist wrote in his medical report that I was diagnosed with aggressive Breast cancer that he would endeavour to keep at bay. Initially I felt that life has been treating me unfairly. Now I'm hoping that this works for me as if the medication works for us (fingers crossed) we would be no different from a chronically ill kidney or heart patient. I'm fine with this and my heart goes out to all chronically ill patients. Let's hope that the oncologists manage to control our cancer. I'm glad that you opted for a clinical trial. Do you mind sharing more info about it with me? I am so much interested in signing up for a trial as if it fails for me, then at least I would have helped other patients. Pls do stay positive and take full advantage of the high spots in our roller coaster ride. Pls remember that we are always here for you so always share your entire rise with us. Tomorrow I have my weekly infusion. I hope that I can tolerate it better than last week. I'll keep you posted. Lots of warm heartfelt hugs to you R, Caroline and all the rest of us.",
      "MessageIndex": 20,
      "PostDate": "03/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111062/cancer-in-spine",
      "Title": "Cancer in spine"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi again R. Carolyn is so right. When I wS diagnosed my onco promptly started my treatment. Every day that these cells are left freely multiplying is a loss that we cannot afford. Go tomorrow in person and ask your GP for a PET CT scan to rule out any spreading to other organs. Also they need rexent pathology tests to choose the most appropriate therapy. I second Carolyn on pestering them as early as tomorrow in person and pls do push fora PET scan. We shall be awaiting your feedback tomorrow. In the meantime pls do shoot any questions tha you may have. Hugs and hugs and hugs ",
      "MessageIndex": 3,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111062/cancer-in-spine",
      "Title": "Cancer in spine"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Jeannie I've had my operation 5 years ago and my Sedona gradually disappeared during the first 6 months. However till this day I suffer from constant buildup of chording. If it is severe I would recommend a physiotherapist as they showed me lots of techniques to avoid major build ups. Now I usually dismantle them on my own following the procedure that they showed me. It amounts to some massage after which I apply ice pads in order to avoid bruising.  Exercise, swimming and stretching helps a bit with smaller chords usually only after the major chords are torn. ",
      "MessageIndex": 4,
      "PostDate": "07/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116060/how-do-i-get-rid-of-cording",
      "Title": "How do I get rid of cording?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi R Yea I've got cancer in the spine, ribs and lungs. Mine is metastisis but you have to wait to see if it's a new primary one. I have a cousins who found out about spine cancer and Breast cancer and was given hormonal therapy. Fine after 2 years with no recurrence. Every one is different so you have to wait and see your prognosis. Please let us know the outcome of your meeting on Friday. Big hug and hang in there. Do stay in touch if you need us to help you through the difficult waiting period. Take care ",
      "MessageIndex": 1,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111062/cancer-in-spine",
      "Title": "Cancer in spine"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Carolyn, I was complaining from breathlessnes which later proved to be due to metastatic breast cancer to the lung. Slight pain in my back proved that it had matestised to the spine. I thought that these symptoms were due to being overworked,under exercised and poorly nourished. I never even thought of checking my markers. I religiously did my mammograms but ignored markers and tried to avoid doctors. Pleas don't ignore any symptom. Better safe than sorry.",
      "MessageIndex": 11,
      "PostDate": "28/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111062/cancer-in-spine",
      "Title": "Cancer in spine"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Alison, Have you tried small sips of carbonated water? I sometimes add lemon to it and it does miracles to me. Fruit tea also helps. My advice is to change flavours as after a while the same flavour contributes to nausea. Ice lollies are great as they help with mouth ulcers and carry some fluids as well. Have you tried almond milk? It is said to be great for cancer patients. Best of luck my dear. ",
      "MessageIndex": 7,
      "PostDate": "24/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115388/struggling-to-drink-recommended-fluids-after-chemotherapy",
      "Title": "Struggling to drink recommended fluids after chemotherapy!"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "That's great Steve! The difference is detailed here www.petscaninfo.com/.../petct_basics Similar to me you may have stopped responding to hormonal treatment. They had put you on tamoxifen which is a hormonal treatment that 65% of er+ve primary Breast cancer patients respomd to. I belong to the unlucky 35%.  The OET CT scan is interactive to receive accurate results to be able to follow up later on with regular CT scans. You must insist on IT as this is international practice. We  can't afford that they miss anything now. We are here to share our experiences. I ignored my symptoms for so long and made it more difficult for my onco to keep my mets at bay. I beg you to learn from my mistake. Hopefully it would be early and they can shoot it in the eye. Keep us posted and rest assured that we care so much. Hugsxxx",
      "MessageIndex": 9,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111062/cancer-in-spine",
      "Title": "Cancer in spine"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Sorry for typo due to sloppiness and severe pain. Always had only one shot before but this time got two shots.",
      "MessageIndex": 1,
      "PostDate": "27/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118801/neupogen-and-lower-back-pain",
      "Title": "Neupogen and lower back pain"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hello dear friends  I've had 2 shots of Neupogen in a row to boost my WBC. Only a few hits after the second shit I experienced severe lower back pain similar to birth contractions. Never had this side effect before but usually was given only one shot. Has anyone had this side effect before? And how long does it last? ",
      "MessageIndex": 0,
      "PostDate": "27/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118801/neupogen-and-lower-back-pain",
      "Title": "Neupogen and lower back pain"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi JSpindley I'm on Letrozole and feel like I'm 190 years old, not only 90 years old. Will you pls let me know whT are the exact supplements (and brand names) that helped with the pain. Thanks",
      "MessageIndex": 6,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129171/rib-pain---arimidex",
      "Title": "Rib Pain - Arimidex"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi friends I hope you're enjoying these festive days and taking a break from the sly wicked disease. I wonder if any of you (inside or outside the UK) has used hyperthermia as an additional therapy. If not have you heard of any centre that offers it? I want to try it out at my own expense to maximise the efficacy of my medication. I have metastaric breast cancer to the lungs and bones and am almost done with 8 very aggressive chemo cycles. I'm due to start maintenance chemo very soon and longevity chances are not great.  So any help is very much appreciated. Happy new year to all of you ",
      "MessageIndex": 0,
      "PostDate": "28/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120345/anyone-used-hyperthermia",
      "Title": "Anyone used hyperthermia?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Maggs, I use gel insoles and have actually grown into a collector (lol). I prefer the wider male ones sized XL. Don't go for the small thinner ones. ",
      "MessageIndex": 7,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116537/sore-feet-peripheral-neuropathy",
      "Title": "Sore Feet/ peripheral neuropathy"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Do you prefer full insoles or just for the heels? I have full Scholl insoles for my errand shoes. For walking I use the gel heels. I think these were something like Pro11 and I bought them online from Amazon ",
      "MessageIndex": 9,
      "PostDate": "18/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116537/sore-feet-peripheral-neuropathy",
      "Title": "Sore Feet/ peripheral neuropathy"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Kiwi I sprained my ankle a couple of years before my diagnosis and it never went away mainly because I did not rest it enough. My advice is to take it easy on the ankle Nd to use your friend's clutches for as long as you can. In case you need to exercise go to the gym and use the rowing machine only. You should also bandage it whenever you go out on foot even if you're feeling better. A few weeks of this religious ritual should help it heal for good. Pls do take my advice to spare yourself years of recurrent ankle injury especially that chemo usually delays healing.",
      "MessageIndex": 4,
      "PostDate": "21/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115216/twisted-ankle-and-feeling-miserable",
      "Title": "Twisted ankle and feeling miserable"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Annmarie, Yes I've been through the same and now they've moved me to another regimen. Just to have things clear, you cannot expect to sue oncologists as the degree of response to chemo differs from one person to the other. Oncologists are there to help us and they have standard protocols that are approved nationally and internationally. These protocols have proved effective for the majority of patient, however it is well known that there are some unlucky people like us who do not respond first time. My advice is to find a way to improve your morale as it is 50% your psychological outlook that matters. Try not to be angry since these things are not within our control. You must find a way to vent your anger. My friends and family are a great source of help. Some meditation or hobby cab help you. Cheer up and hope fr the best",
      "MessageIndex": 1,
      "PostDate": "11/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110255/lump-is-got-bigger",
      "Title": "lump is got bigger"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Maria, I wonder if your mom's way of coping with this traumatic experience is to blame you for causing her pain. Or is she the selfish type who wants to have fun and run away from responsibility and trouble? Surely there are some people who are that selfish. I'll share with you my brother in law's story. He passed away a few years ago after battling with drug abuse. His mom walked out on him and never lifted a finger to help him. She always expected him and my husband (also me) to look after her. Since his death she's been trying to go out all the time and has a ball every single day. When my husband was accompanying me to the therapy sessions for my breast cancer she shouted out at me that I was not the centre of the universe and that I am blowing things out of proportion. To add insult to injury, she kept reminding me of our troubled times during our marriage when he cheated on me repeatedly. She added that my husband now looks much younger and healthier than me and that I should be grateful that he's still with me. I never expected support from her, but I decided that I shall keep a very healthy distance. I think that people like your mom and this lady need help. One should stay as far away as possible from such people. They are the ones who need help, not you. Don't allow a psychologically troubled person to cause you pain. Exorcise her from your mind. If she doesn't come around then you're better off without her negative energy. ",
      "MessageIndex": 10,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104012/extended-family-have-turned-their-back-on-me",
      "Title": "Extended family have turned their back on me"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "My eldwr son and my sister love abroad. They're the closest to me and I feel helpless without them. Now I depend on random help and support from my younger son and husband. When I collapse they also do. with time I realised that they equally need support. It don't get enough making me vulnerable. The trouble is that my cancer is untreatable so there is no end to this. Always remember that our loved ones also need support. They are not as devastated as us but they are in immense pain and agony. It's a viscous circle that needs to. E broken ",
      "MessageIndex": 9,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133945/loved-ones-strange-reaction",
      "Title": "Loved ones' strange reaction"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Can't believe that what I took lightly as a tiny benign nodule below my collar bone turned out to be cancer recurrence. Now I don't have any courage or energy to go through the long battle. I am prone to give in and I haven't slept a wink since the prognosis. Now I move like a zombie and worry a lot about my younger son who still has to go through college. I'll wait for the PET scan tomorrow and then if it's spread further I'll refuse therapy and let go. Honestly I don't have energy to fight. ",
      "MessageIndex": 0,
      "PostDate": "15/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106686/devastated-breast-cancer-recurrence",
      "Title": "Devastated breast cancer recurrence"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Loiby, Will you pls ask your doctor for the following checkups: 1) Heart echo procedure  2) Full kidney functions  Steroids usually cause swelling all over the body.  Best of luck xx",
      "MessageIndex": 4,
      "PostDate": "22/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123733/swollen-legs-and-feet",
      "Title": "Swollen legs and feet??"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thank you all for your supporting words. I've had a rather compassionate phone conversation with my brother last night and he begged me to accept his \"small present\". We were in tears. Both my sons denounced the money that I've worked hard all my life to make for them. My closest friend told me how much he would have loved to pay every penny he has to keep his late father alive for only a few days.  But I'm not convinced. Guilt is eating me alive because I know that my disease is incurable. Money should buy us happiness but not a few more months or even a couple of years. I need to reach a compromise because I fully agree that my sons are going to hate the money if I don't use it especially that I am the one who had made it for them. I am in a mess and I can't think properly.  I have always been a very private person and I have never been able to open up the way I do with you. This forum has made things easier for me. I admit that I need your help as to how to reach compromises. My brain is blurred and I am doomed with insomnia. I honestly need my peace of mind which only a compromise solution would grant me.  Please help me out and brainstorm with me. Should I use the drug for  few months only and ask for another drug afterwards? Pls help me think and decide. ",
      "MessageIndex": 8,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122183/guilt-and-self-loathing",
      "Title": "Guilt and Self loathing"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "The latest scan showed that I've developed a new secondary lung lesion. I was immediately put on a new three drug regimen including a new and very expensive drug that my insurance would not cover because it is not yet registered with the authorities. My brother gets it at a fraction of the price from Canada but it is still far too expensive. The sums of money that I spend out of what was intended to be my sons' inheritance makes me feel so guilty. Every time I swallow a pill I get this self loathing feeling that stifles me to the extent that I feel that the medication will not work. My brother has bought a couple of months' supply and it makes me even more guilty. How many people's lives would be alleviated if I donate this money to them? Why not just give in to a disease that will kill me sooner or later?  I hate myself. I hate my illness. I hate large pharma firms. I hate these weak governments. I hate this unfair world. ",
      "MessageIndex": 0,
      "PostDate": "27/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122183/guilt-and-self-loathing",
      "Title": "Guilt and Self loathing"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thanks so much my lovely friends. Your posts have truly helped calm me down a bit. I hope that I shall be able to pull myself together in a day or two so that I am able to think straight. This disease has ripped me of my cognitive abilities, my job, my health, my athletic figure, my long hair and my dignity. I am no longer able to resume my full time job, but I am still able to make some money working on independent projects. These projects can cover only 20-30% of my current medical expenses.  I've been doing some research and have contacted some people on this new medication and found out that it causes severe neutropenia that may not be easily resolved by Neupogen shots. In this case it is usually discontinued. This explains why my brother gave me a gift for 2 months, after which I might simply be asked to discontinue it. So the decision is now to wait till February 13th to see how my WBCs are behaving. If I am to discontinue it then it is going to be a blessing in disguise.  My aims and priorities in this world have always been to give my two sons a good future and to help them do a job that they enjoy. I don't want them to be obliged to do something that they hate just to put food on the table. This is why I hate big pharma for stealing our hard work simply because they have a cure to our disease. I read a technical financial report that explained that there is no hope to reduce the price of this new medication until it reaps its producers a revenue of at least $6 billion over a couple of years. In case no competitor drug is manufactured the price would not be reduced. This is sooooo unethical, much worse than drug and arms dealing because it sucks blood out of terminally sick people.  I am honestly so much dependent on your support and I feel that the best of counselling would never help me the way you do.  I'll keep you posted as to how my side effects are. Love you all xxx",
      "MessageIndex": 14,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122183/guilt-and-self-loathing",
      "Title": "Guilt and Self loathing"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I agree that governments have to urgently take over or at least enter the medical/pharma research field. But big pharma are horrible because they are supposed to help people get better and subsequently assist economies to grow and develop. The least that I would have expected is for them to reap a return on investment equivalent to that of educational institutions. The following link shows that pharma firms reap the average ROE of all sectors of 9.5%. pages.stern.nyu.edu/.../roe.html Not only is this inhumane, but I consider it unethical to do so. They should be on the low scale, way below average. No wonder that everyone looks down on them. ",
      "MessageIndex": 16,
      "PostDate": "29/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122183/guilt-and-self-loathing",
      "Title": "Guilt and Self loathing"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "For anyone who's has cancer before I would say: better safe than sorry. Pls ask for an immediate appointment with the oncologist or even better the surgeon (not  the GP). I would recommend a pathology or at least a biopsy.  Hopefully it's nothing but there's no way to tell unless you're certian. Pls keep us posted  xxx",
      "MessageIndex": 1,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111600/should-i-go-and-see-gp-or-mention-to-bcn",
      "Title": "Should I go and see GP or mention to BCN?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Delighted for you my dear!",
      "MessageIndex": 3,
      "PostDate": "20/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116781/light-at-the-end-of-the-tunnel",
      "Title": "Light at the end of the tunnel"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I've asked my french oncologist who I travel to every few months for private consultation. He's a great scientist who has performed so many clinical studies on BC patients. He says that diet is useless if we have already got the disease. His recommendation is to have fun and enjoy everything that makes us feel happier. This is 90% of the ammunition needs for our battle. But he still recommends the following minor changes to our diet just in case some of the unfounded claims turn out to be true: - Prepare one litre of stil bottled water with lemon slices and fresh mint to be drunk throughout the day  - always add fresh mint to tea - most protein should be white meat - use organic yogurt and milk - add plenty of almonds and greens to your diet  - replace chocolate with very dark chocolate  - eat sugar and carbs in moderation  These are doable for me and I don't need to cheat as my PH is always neutral to alkaline",
      "MessageIndex": 40,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115380/natural-v-chemo",
      "Title": "Natural v Chemo"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Sorry to hear about your diagnosis and you're not alone. We are here for you 24/7 with love and advice . I was in the same position 41/2 years ago and I opted for operation and radiotherapy followed by hormonal therapy. If there was a time machine I would use I and do chemo as my cancer recurred violently six months ago. I was ER and PR positive but my hormonal therapy stopped working for some reason. What I advise you to do is to carefully balance the pros and cons. The pros are increasing your chances of killing nasty cells that cannot be detected by the scans. The cons are the six months of having to shoulder the side effects of the chemo on your own. This is going to be especially taxing if your work and quality of life are affected.  My advice is to prepare two tables and write down the pros and cons for each choice and then weigh them as if you are preparing an income statement. Choose the option that makes you emerge profitable.  Best of luck with your choice. ",
      "MessageIndex": 3,
      "PostDate": "24/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115380/natural-v-chemo",
      "Title": "Natural v Chemo"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thanks Carolyn for the article. I got an answer from my doctor friend and he says that I need 3 litres per day today and tomorrow to flush the chemo out of my system, followed by 2 litres per day. He also says tea in moderation is ok. Hope that this helps others ",
      "MessageIndex": 6,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125894/ideal-amount-of-water",
      "Title": "Ideal amount of water"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hello ladies My bloods today showed some deterioration of my creatinine levels, albeit it is still within the high normal range. Will you pls let me know the ideal quantity of water that we should drink on the day of infusion and the rest of the week. I don't want to overwork my kidneys either. Also does water help reduce creatinine levels in the blood or is this indicative of a serious kidney damage problem?  Thanks and hugs ",
      "MessageIndex": 0,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125894/ideal-amount-of-water",
      "Title": "Ideal amount of water"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thanks Trato, Lynn and Helen. I've found the following very interesting article that could be helpful: health.clevelandclinic.org/.../",
      "MessageIndex": 10,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125894/ideal-amount-of-water",
      "Title": "Ideal amount of water"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Carolyn  The French school cares more about treatment and less about side effects. I need to wait for my appointment with my oncologist. Today he was not here and I don't trust his very young assistant. Hence, I shall wait till next appointment which is in 3 weeks. I'll try to contact a doctor friend and ask him. I'll also post a question as you suggested, many thanks.  Any thoughts are welcome.",
      "MessageIndex": 2,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125894/ideal-amount-of-water",
      "Title": "Ideal amount of water"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Yes the reflux still makes my throat hurt. I also think that Claritine can reduce the pain because much of it is allergic reactions. Why not consult your BC team? ",
      "MessageIndex": 5,
      "PostDate": "04/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122482/can-t-bear-this-sore-throat",
      "Title": "Can't bear this sore throat.."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Lying or sitting down for long periods intensifies the pain. So I keep moving every 15 mins or so and things are a bit better. Also the days that I drink loads of water my bone and muscle pains are much better. ",
      "MessageIndex": 3,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127077/don-t-think-i-can-cope-on-letrozole",
      "Title": "Don't think I can cope on Letrozole"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Yeah sure it has... and avoiding stress is also going to get you out of this mess soon. Together we can make it. Whenever you feel stressed out or angry pls get hold of your keyboard and vent. We are here for you and we will safely reach the other side of beating cancer. Just forget about statistics that don't take into consideration a host of very important variables. ",
      "MessageIndex": 9,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117857/npi-scale",
      "Title": "NPI Scale"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Ladies ladies, My experience is so different and made me swear that stats are meaningless. Five years ago I had a tiny breast tumor removed (no lymph nose involvement) and received radio afterwards. The stats showed 99% of cancer never to recur. My oncologists said that it was history and put me on Nolvadex. Then boom out of the blue my body developed lung and bone secondaries.  I am not here to scare you but I am simply asking you, rather pleading, that you forget about statistics. Please try to reduce stress by walking away from any loud conversation, troublesome relationship or even a stressful job. Please try to eat healthy by getting more fruit and veggie fibres and reducing dairy, alcohol,  and red meat. Exercise and meditate. Have fun and go on regular breaks and fun outings. Trust me this lifestyle beats all odds and all stats. Wish I had a time machine to go back to 2011 to lead such a life. Wish you all the health and happiness in life from the bottom of my heart.",
      "MessageIndex": 6,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117857/npi-scale",
      "Title": "NPI Scale"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Pepsicat, I'm on a combination of Carboplatin+Taxol+Avastin.  Have completed  5 cycles but my onco says that he will stop Carboplatin after the sixth cycle and carry on with the other two for a while. This is because it is not recommended to carry on with it for more than 6 cycles.  It is difficult to distinguish betwee the side effects of the three but I can say that as soon as it is administered I feel it eating up my throat. It also affects my vocal chords. I get bleeding nose and gums and they say it's because of it. Other side effects include hair loss and tingling feet.  Are you ER and PR positove and what about your her2?",
      "MessageIndex": 4,
      "PostDate": "24/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115391/starting-carboplatin",
      "Title": "Starting Carboplatin"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I had primary cancer in 2011 and I religiously took the hormone suppressant tablets for four years after which I found out that I had sevelopwd secondar cancer. There is no guarantee that these tablets work. Fingers crossed your disease will not return. My advice is to have lots of fun and less a healthy life with a balanced diet. To be honest I did none of these. So this is the culprit ",
      "MessageIndex": 2,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134788/stopping-letrozol",
      "Title": "stopping letrozol"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Sure my dear. These are common symptoms of stress and anxiety. Pls try to distract yourself running errands, working, partying, going to the movies, whatever. You know what works best for you. Hoping that things turn out fine for you my dear. Whenever you don't feel ok just drop in a word and you'll find all of us here for you. Take good care xxx",
      "MessageIndex": 3,
      "PostDate": "11/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123115/tiredness-and-aches",
      "Title": "Tiredness and aches....."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I had thicker bladder walls which probabaly made the storage area smaller. Don't know why this happened but we found out about it after an ultrascan. You need also to have your kidney functions checked. If both turn out fine then it's not that important and could be a rate side effect. ",
      "MessageIndex": 6,
      "PostDate": "28/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123981/bladder-irritation",
      "Title": "Bladder irritation?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I haven't has a similar experience but when I was diagnosed with breast cancer it was two weeks into the first term of uni where I teach. This would have caused so much disruption to my students so I told the dean as soon as I learnt about my BC. He asked about my preferences and we looked into all scenarios. I preferred to stay on and do the operation and radiotherapy which proved a heavy burden on my body.  The positive side is that I felt ethically received as a huge burden was offy shoulders leaving me enough peace of mind for my battle.  My advice is to go to your boss and inform him/ her of the prognosis. You need to explain whether you found out as part of a routine checkup or whether you had doubts before accepting the job.  This makes all the difference.  Good luck and all my best wishes for complete recovery.",
      "MessageIndex": 1,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117506/how-do-i-tell-work",
      "Title": "How do I tell work?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi jmc, With your operation only a few days away I think that it is only sensible to take extra care of yourself. You don't want to delay the operation and keep cancer cells multiplying. I would wait for a few days and see if things get better with your daughter as you can catch it if you simply inhale the germs. I would wait till the weekend and possibly spend a couple of days with them of they get better. Better safe than sorry.",
      "MessageIndex": 3,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118027/colds-and-visitors",
      "Title": "Colds and visitors."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Yes I agree with Julia and London. I once had a mosquito bite and developed lymphodema on the same arm. Whenever I bumped my bad arm or showered with really hot water this happened. So why take chances? ",
      "MessageIndex": 5,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123475/frozen-shoulder-cortisone-injection-lymphedema-risk",
      "Title": "Frozen shoulder, Cortisone injection, lymphedema risk."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Please ask them to check your blood count. If your white cells are low they may want to give you the WBC booster shot. Best of luck ",
      "MessageIndex": 12,
      "PostDate": "15/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48251/help---what-to-do-if-i-get-a-cold-during-chemo",
      "Title": "help - what to do if i get a cold during chemo?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I fully empathise with you. I got this right after my surgery in 2011 but was scared to do anything about it just like you. What I did was because I chose not to take any shots or medication especially on my bad side. So I depended on physiotherapy. What made the best results was swimming which I did daily. Afterwards my pain decreases by at least 50%. Then in a couple of years the frozen shoulder gradually disappeared on its own.  Good luck with whatever choice you make. ",
      "MessageIndex": 4,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123475/frozen-shoulder-cortisone-injection-lymphedema-risk",
      "Title": "Frozen shoulder, Cortisone injection, lymphedema risk."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi dear, 2mm is nothing and chemo & radio should do the job. Later on you may be placed on hormonal therapy. Just remember that the inner will and emotional wellbeing are far more important. Try to hang around your loved friends and family. Go out as much as you can and stay positive. These are the rules of the game to win. ",
      "MessageIndex": 3,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108426/feel-there-is-no-hope",
      "Title": "Feel there is no hope"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "My nurse has advised me to use a soft toothbrush. I found one branded \"Reach\" with long soft hairs. I use my electric toothbrush only every few days carefully aiming for the enamel to keep my teeth clean and White. Also use any sort of gentle preferably natural gargle 3 times a day. Always get rid of food remains instantly. I also use Signal sensitive. This way you can avoid most of the mouth ulcers. ",
      "MessageIndex": 1,
      "PostDate": "28/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109703/soft-head-for-electric-toothbrush-during-chemo",
      "Title": "Soft head for electric toothbrush, during chemo?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi LW, Xeloda is quite mild so no need to fret about it.  However, keep taking your temperature and no need to worry unless it goes up towards 38 degrees or if it goes chesty. In either case it would be wise to call your onco. Just make sure that you don't exert yourself. Also don't give your friend the flu ...lol Enjoy your stay and take good care. ",
      "MessageIndex": 2,
      "PostDate": "06/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117656/caught-a-cold",
      "Title": "Caught a cold"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I just need to know what is causing all these pains. Are we developing permanent arthritis or a similar old age disease! Or will this pain disappear once we stop the hormone blockers? ",
      "MessageIndex": 11,
      "PostDate": "03/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129892/joint-pain",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Justin In most probability it's nothing. But pls do go ASAP to your oncologist asking for immediate investigations. It won't hurt to be cautious.  Pls keep us posted and hoping that it is nothing serious.",
      "MessageIndex": 3,
      "PostDate": "28/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124144/male-breast-cancer-query",
      "Title": "Male breast cancer query.."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I add to your pains terrible heel pain that makes it very challenging to walk to the bathroom especially in the morning. My oncologist suggested acupuncture. I'll let you know if I get lucky.",
      "MessageIndex": 4,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129892/joint-pain",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Sorry to hear the news Taylor. Will you please ask for a full PET CT scan as it is the only accurate detector of cancer in the body. Our thoughts and prayers are with you and wud you all the best. Big hug",
      "MessageIndex": 14,
      "PostDate": "22/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117583/lump-on-rib-after-double-mastectomy",
      "Title": "Lump on Rib after Double Mastectomy"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I add to your pains terrible heel pain that makes it very challenging to walk to the bathroom especially in the morning. My oncologist suggested acupuncture. I'll let you know if I get lucky.",
      "MessageIndex": 19,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129892/joint-pain",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I just need to know what is causing all these pains. Are we developing permanent arthritis or a similar old age disease! Or will this pain disappear once we stop the hormone blockers? ",
      "MessageIndex": 26,
      "PostDate": "03/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129892/joint-pain",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Susien, I've been cold capping for 5 cycles and lost like 60% of my hair. Some others have been far more successful. I am to be partly blamed as I can't wait for more than 15 minutes after the session and remove it as I find the session psychologically agonising. I also have a small bladder and need to use the toilet during the session. Another reason is that I've not kept my hair covering the ape of my neck. It tangled a lot hence I lose much hair combing it. To keep most of your hair cut it as short as possible so that you can comb it using your own fingers. Use natural mild shampoo once or twice a week at most. Most importantly keep the cap a good 30-60 minutes before and after the actual session. Try not to interrupt the session by using the loo. Best of luck ",
      "MessageIndex": 1,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115778/hair-cuts-for-cold-cap",
      "Title": "Hair cuts for cold cap?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi London Lass Cry your head off my dear. Always remember that you're crying on our shoulder. Biiiiiiiiiiig hug xxx",
      "MessageIndex": 4,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127434/feelings",
      "Title": "Feelings......."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Maz Grade 3 means an involvement of a lymph node outside the breast itself.in other words it has metastised outside the breast. Don't worry also chemo is meant to keep it from spreading more. The good thing is that it was caught before spreading to other organs.  Hipe you're more relaxed and assured now keep well and stay tuned to this forum for advice and support. best wishes and hugs my dear xxx",
      "MessageIndex": 1,
      "PostDate": "07/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133210/metastatic-lymph-node",
      "Title": "Metastatic lymph node?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Thanks Helen and Snowys Mom. I'm relieved that Femara is the better brand.  After my primary breast I was using a generic brand of tamoxifin, which I'm skeptical could have been one of the factors why it had stopped working for me.  Take care",
      "MessageIndex": 3,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121818/what-brand-of-letrozole",
      "Title": "What brand of letrozole"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "hello ladies My chemo regimen has stopped woking and a new lesion grew. I'm  now on a new three drug protocol including letrozole.... hoping. It works. Will you pls remind me of the best and most effective brand? My oncologist has prescribed Femara.  Thanks ",
      "MessageIndex": 0,
      "PostDate": "21/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121818/what-brand-of-letrozole",
      "Title": "What brand of letrozole"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi P.G. I think that your husband has been through a lot and wants life to go back to normal including the previous ups and down of any relationship. He also feels that he has paid his dues by being by your side throughout your therapy. People want something back in return. I have secondaries in my bones and lungs. During the first four months my husband was supportive but since last month he is back to normal. He complains that he wants to lead a normal life and that he cannot keep on treating me like a fragile creature. He does not understand that my new diagnosis has battered me, At this point I am trying to uncover whether he is simply unable to accept the fact that I have a chronic and terminal disease or whether he is fed up. Once I get the answer I shall act accordingly.  What I advise you to do is to sit down and try to make him speak out loud. Be his counsellor and be there for him as he has also been through a lot. Find out if he wants to see you lead a normal life with its rights and obligations or whether he is truly fed up. It is a combination of both but if the fed up part makes a small part then let it go. We were all fed up with our own newly horns but loved them dearly.  My very best wishes that this will soon be resolved one way or the other. ",
      "MessageIndex": 6,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114022/how-to-tell-my-husband",
      "Title": "How to tell my husband"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Yeeeees!",
      "MessageIndex": 8,
      "PostDate": "25/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127678/stable",
      "Title": "STABLE........."
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Also check your levels of potassium, magnesium and calcium. Letrozole can lead to deficiencies especially of calcium ",
      "MessageIndex": 2,
      "PostDate": "24/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132351/is-letrozole-really-to-blame",
      "Title": "is letrozole really to blame"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Letrozole is a hormone blocker that keeps estrogen levels as low as those of elderly ladies. Hence the hair thinning and the muscle and bone paiN. Not sure that anything can counter that. I use Kerastase ampules that dont seem to be making much of a difference. But possibly things could have been worse without them. Would love to hear from others who may have had a better solution ",
      "MessageIndex": 1,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135250/letrozole--hair-loss",
      "Title": "Letrozole -hair loss"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "On the flip side from the other unlucky 10% of the BC patients, those with metastatic BC do not receive the death sentence. We live like chronic patients who are on medication for life. Some live for a number of years so they may not be any different from heart or diabetic patients.  Just think of the very healthy who die of a car accident. All of us will eventuAlly die so let's take each day as it comes. I am no longer scared of death but now I am better at planning my kids' future and finances.",
      "MessageIndex": 19,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114365/could-we-give-some-hope-to-people-like-me-please",
      "Title": "Could we give some hope to people like me please?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi Optimistic You haven't filled in your profile yet. Number of lymph nodes is not that important. It does not necessarily indicate that your cancer is aggressive. If anything it may indicate that it has been there for a long time unchecked and freely spreading. What really matters is the success of the treatment. Stay focused on this as your goal and you'll be fine. Btw whY was your pathology diagnosis?",
      "MessageIndex": 9,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119107/worrying-again",
      "Title": "Worrying again"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Hi \"Strong\" Emi, Don't you worry, we have all been through this rough journey. In order to emerge successfully out of this you need to pull yourself together. You have to convince yourself that this is not a battle, but a rough journey with the end destination safely defined. You are lucky to test positive for both hormones as it gives you an extra weapon to combat the disease. All will go well at the end and trust me that you will emerge as a totally different person. Also, hopefully your children will mature and the disease will contribute to their upbringing things that we were unable to. My son turned from a hopeless student to a bookworm, trying to please me. My darling just promise to look at the bright side since this illness does have a good side to it. Encourage your body to exorcise the disease and use all the support that you can get from your family and friends, as well as the Macmillan nurses and helpline. Stay in touch through this lovely forum and update us on your progress.   Lots of love ",
      "MessageIndex": 1,
      "PostDate": "24/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108316/just-been-diagnosed-with-hre2-and-er-breast-cancer",
      "Title": "Just been diagnosed with HRE2+ AND ER+ breast cancer"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "On the flip side from the other unlucky 10% of the BC patients, those with metastatic BC do not receive the death sentence. We live like chronic patients who are on medication for life. Some live for a number of years so they may not be any different from heart or diabetic patients.  Just think of the very healthy who die of a car accident. All of us will eventuAlly die so let's take each day as it comes. I am no longer scared of death but now I am better at planning my kids' future and finances.",
      "MessageIndex": 4,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114365/could-we-give-some-hope-to-people-like-me-please",
      "Title": "Could we give some hope to people like me please?"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Liver function tests are not necessarily indicative of liver cancer. They are routine tests that are used to see if the organs can tolerate medication. Please stop going to the Internet as it has caused all of us to worry unnecessarily. Stay with us and we shall walk you safely through this. Hoping that you get to see your doctor soon. Keep us posted. ",
      "MessageIndex": 6,
      "PostDate": "01/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115727/scary-times-ahead",
      "Title": "Scary times ahead"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "Sorry you have to go through this alone. I fully understand how you must feel as I am feeling so guilty putting my family through this ordeal. At one point I thought of moving out to spare them all this. I still keep pushing away my close friends but I am sticking to only two of them. The good news is that you will not be totally useless during chemo. The first 2-3 days are usually the worst so I notmally get everything on order (groceries, laundry, housework, etc.) a day or two before my weekly drip. Then I am useless for a couple of days after which things start getting better.  Later chemo sessions could get more difficult so I urge you to consider pushing the sessions to Fridays so that someone can join you during weekends if the need arises. We're here for you so pls always stay in touch with updates. Big big hug ",
      "MessageIndex": 1,
      "PostDate": "26/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111028/living-alone-and-having-chemo",
      "Title": "Living alone and having chemo"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "This thread has hit a chord. I have to admit that I need help from friends and family, but oftentimes I can't help feeling so guilty for putting my family through this agony. My husband has always been so demanding and it feels weird seeing him looking after me. I am seriously contemplating moving out for a while to look after myself as I have recently been getting angry when people who were previously unkind to me suddenly show sympathy. I am OK with my loved friends helping but not with sympathy from people who have never been neither nice nor close to me. Living alone could be a blessing for sensitive people like me. I just hope that my family agrees to me moving out for a while as my BC is metastatic and i shall be on therapy till the very last day of my life.  ",
      "MessageIndex": 19,
      "PostDate": "29/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111028/living-alone-and-having-chemo",
      "Title": "Living alone and having chemo"
    },
    {
      "AuthorID": "Baki",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/baki",
      "Content": "I fully agree with Helen. Pls do ask for help. People don't know how to deal with us and are scared to pry. After 4 long months I realised this truth. Apart from physical help we are here for you with support and tips.  Lots of love and warm hugs ",
      "MessageIndex": 3,
      "PostDate": "26/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111028/living-alone-and-having-chemo",
      "Title": "Living alone and having chemo"
    }
  ]
}