{
  "AuthorID": "Bambina",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bambina",
  "Posts": [
    {
      "AuthorID": "Bambina",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bambina",
      "Content": "I'm sorry to hear your news honey...my mum was diagnosed with breast cancer 5 years ago (2003)she has looked after my son since he was 6 months (2005) until recently. She had a mascectomy and 12 lymph nodes removed. I went to every chemo and radiotherapy session with my mum, helped with the housework and just generally tried to keep her spirits up and carried on with life as normal, I think normality helped the most, my mum has never been in denial and pretty much accepted she had cancer to the point of shaving her hair off ready for chemo. Her spirit/determination/strength got her through her breast cancer, she has never given up and never fell to pieces... just by simply being there for your mum will help her, making her feel comfortable ie 'no mum don't worry about the baby, I will sort out other arrangements, you just concentrate on getting better' because she really doesn't need any outside stress while she's going through this and like a typical mum she will be saying 'but Holly rely's on me to look after baby, what's she going to do'. So in short Holly, just be there for your mum when and if she needs you. Lots of hugs xxxxx",
      "MessageIndex": 1,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10739/how-can-i-help-my-mum",
      "Title": "How can I help my mum?"
    },
    {
      "AuthorID": "Bambina",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bambina",
      "Content": "That's fantastic news Holly... keep us all updated with mum's progress xxx",
      "MessageIndex": 5,
      "PostDate": "24/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10739/how-can-i-help-my-mum",
      "Title": "How can I help my mum?"
    },
    {
      "AuthorID": "Bambina",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bambina",
      "Content": "Mum goes back to oncology on Tuesday, she will find out if it has spread to her liver and/or lungs. I will let you know what the plan of action is after the appointment. Lots of hugs Anna xxx",
      "MessageIndex": 24,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "Bambina",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bambina",
      "Content": "Just wanted to say I'm thinking of you and hope you can resume your chemo again soon. My mum is under Guy's and St Thomas' and she has had phonecalls that she just hasn't understood (She's hard of hearing), drives me nuts!!! They do have a brilliant cancer info unit though, so if there is anything you are unsure of in future please give them a bell... if you need the number just ask. Best wishes, Bambina xxxxx",
      "MessageIndex": 17,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "Bambina",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bambina",
      "Content": "My mum has secondary bone cancer and is due to start radiotherapy pretty sharpish, so you may well bump into each other. Mum lives in Brockley. Glad to hear your last Chemo is soon, you can start to look forward to recovering. Mum said Radiotherapy was a doddle compared to chemo, hopefully you will feel the same. Lots of hugs, Anna AKA Bambina xxxx",
      "MessageIndex": 19,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "Bambina",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bambina",
      "Content": "Dad informs me today that he just wants to ensure this doesn't happen to anyone else, not too fussed about suing the hospital, but if that is what it takes to highlight their shortcomings then so be it xxxxx",
      "MessageIndex": 3,
      "PostDate": "13/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10746/i-don-t-believe-it",
      "Title": "I don't believe it!"
    },
    {
      "AuthorID": "Bambina",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bambina",
      "Content": "We discovered last week that mum was wrongly diagnosed in 2003, let me explain! 2003: Mum was diagnosed in 2003 with aggresive breast cancer, had a masectomy and aggresive chemo etc, she was told she couldn't take Tamoxifen because she was allergic to it. They told my dad on the quiet that mums cancer was so aggresive there was no point giving her Tamoxifen and she had 50% chance of survivng 5 years, 10% chance of survivng 10 years... fast forward... 2008: Mum was diagnosed with bone cancer in her spine, arm and ribs, she went into hospital to have her arm pinned, mum has lots of scans and is told she has cancer in the lining of her heart and lymphs in chest... was told they would hit her hard and fast with chemo, bone strengthening, bone trial drugs etc, outlook is very grim...mum gets a phone call (Thursday) the day before chemo is due to start, the orthopaedic consultant took a biopsy (4 weeks earlier) when pinning her arm, her cancer isn't aggresive so she can have chemo in tablet form (brilliant). Mum and Dad go to see consultant (Tuesday) where he apologises profusely and says that mum never had aggressive cancer in the first place and if her original consultant would have given her Tamoxifen she wouldn't be sat opposite him now! Her consultant cannot comprehend how her original consultant got it so wrong and to be honest nor can I! I know a few people on this site have been failed by their doctors but I really can't believe they can get it soooooo wrong! Tis true what Penny says never believe what they tell you cos they have and will continue to get it wrong. Well dad's now looking into taking them to court and I don't blame him!",
      "MessageIndex": 0,
      "PostDate": "12/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10746/i-don-t-believe-it",
      "Title": "I don't believe it!"
    }
  ]
}