{
  "AuthorID": "BarneyBoo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/barneyboo",
  "Posts": [
    {
      "AuthorID": "BarneyBoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/barneyboo",
      "Content": "Hi, thanks for replying.  I feel so fed up with it all.  I have cut down since feb but haven't been on a strict diet.  My BMI is currently around 30.2, its just all around the worse place - tummy..  You just want to move on with everything and I feel stuck at the moment.  I have increased my exercise dramatically.  I walk most days for 2 hours with my dog.  I have been running and also joined a gym.  Am going most days and working hard.  I know the answer is to strictly diet so am starting today with a new outlook.  Thanks for your advice, I will look at the 5:2 diet (have ordered the book from Amazon).  I weigh the same as before treatment (lost 2 stone during chemo) but its gone back on me around my middle. Good luck at your appointment, 11kg weight loss is amazing, well done.x",
      "MessageIndex": 3,
      "PostDate": "05/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180645/diep-question",
      "Title": "diep question"
    },
    {
      "AuthorID": "BarneyBoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/barneyboo",
      "Content": "Hi,thanks for the advice. You sound very like me and your tip to write things down help. I have relaxed about eating this week as I am feeling so fed up with everything but I know thats not the answer. My BMI is above 30 though whatever way you look at it so I still have work to do. I just expected to go the appointment and be booked in. I never even though about weight so it has thrown me a bit,but I know its for my own good. Hope your appointment goes well and thank you so much for replying I really appreciate it.",
      "MessageIndex": 5,
      "PostDate": "10/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180645/diep-question",
      "Title": "diep question"
    },
    {
      "AuthorID": "BarneyBoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/barneyboo",
      "Content": "Hi everyone,am new to this it site. Found my breast cancer end of July 2017,took till early sept to diagnose after many biopsies,lumpectomy.Had chemo Sept17  finished Jan 18. Had right breast removed feb 18 and finished herceptin injections Sept 18. Treatment has bought on the menopause and a lovely weight gain round my middle. I am now looking at Diep reconstruction but saw a consultant in feb who said I needed to lose 1-2 stone,to come back when I lost a stone and he would book me in. He was very nice about it and I have to agree my tummy area could do with weight off but I have cut down since then and really upped my exercise but have literally just shifted 4lb. I am at a gym and have lost some body fat and gained muscle but dont look any different.its really getting me down as I expected to be recovering by now and feel stuck at this point. Has anyone any experience of having to lose weight before diep? Or any tips to help lose weigh please.x",
      "MessageIndex": 0,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180645/diep-question",
      "Title": "diep question"
    }
  ]
}