{
  "AuthorID": "beachlover",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beachlover",
  "Posts": [
    {
      "AuthorID": "beachlover",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beachlover",
      "Content": "I also am due my 5th chemo nxt week but have been having problems with my arm,saw  oncologist this week(not mine) and he said they would have to use my other arm as my chemo arm won't take any more.It was red swollen and very lumpy and he said if I was his his patient he would stop at 4(am supposed to have 6 fecs) so will be interested to see what my oncologist says when I see her on Weds.I still have to have another op as my margins weren't clear and then 3 wks of radiotherepy so goodness knows when I shall be back at work.I just can't wait till its all over as it seems an age since I was first diagnosed(april) and just want to get my life back.i am also going through an awful divorce with no support at all from ex partner which doesn't help either. Any way good luck with your 5th and hope you don't feel too bad afte wards, take care xx",
      "MessageIndex": 1,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31261/coping-with-chemo",
      "Title": "coping with chemo"
    },
    {
      "AuthorID": "beachlover",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beachlover",
      "Content": "I am due to go for my first chemo today.Have an appointment with the wig lady first but have opted to try the cold cap even though I'm having FEC.I am getting quite anxious now as I sit here waiting for my friend to pick me up.I think its the fear of the unknown.I have explained to the children that I might be grumpy/tired etc but kknow I have to get through this nxt 4 mnths the best I can.Found this site to be a great help just to see how it affects different people different ways, so I shall be writing here often to shrae my experiences.Must go now as its almost time to go.    ",
      "MessageIndex": 0,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/29111/st-chemo",
      "Title": "!st chemo"
    },
    {
      "AuthorID": "beachlover",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beachlover",
      "Content": "Thanx for that.I am now on day 12 of my first cycle and at the moment still feel ok,You said that hair starts to grow back when you start Tax-what is that? On my notes it just said 6xFEC .Did you lose your eyelashes and brows,and when did the body hair start to come out? Glad to hear that you are doing well a year on,its good to hear positive stuff.My sister goes for her results today as she was diagnosed the day after my op and had a masectomy 2 weeks ago,so I have my fingersa crossed for her  Thanks for the advice, xx.",
      "MessageIndex": 2,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/29111/st-chemo",
      "Title": "!st chemo"
    }
  ]
}