{
  "AuthorID": "beacon73",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beacon73",
  "Posts": [
    {
      "AuthorID": "beacon73",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beacon73",
      "Content": "Yes I do trust them but you always worry about delays...still no date for CT scan and its been a week since he stopped my treatment. I was due to start Docetaxel tomorrow.  Great you have been given the all clear a year on : )  x",
      "MessageIndex": 3,
      "PostDate": "16/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169871/enforced-break-in-chemo-worry",
      "Title": "Enforced break in chemo worry"
    },
    {
      "AuthorID": "beacon73",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beacon73",
      "Content": "HI all, I was diagnosed with invasive ductal triple neg BC in July and was due to have 3 x FEC then 3 x Docetaxel but after 3 FECs my oncologist suggested I have a break from chemo and move to surgery. This is because I have been so poorly on FEC. I've been hospitalised every time neutropenic or with a fever. He says it would be good to give me a break and have the surgery now. Ive been on 7 days of filgrastim injections each time and prophylactic antibiotics but still ended up in hospital. My dose was reduced for the 3rd one but made no difference. They even took my PICC line out on Friday. I'm waiting for a follow up staging CT scan before I see the surgeon to discuss the surgery. I am stage 3 - its 30mm in my R breast and in my lymph nodes. I also have indeterminate lesions in my liver but they didn't do further scans on that and pressed on with chemo. I am keen to know if the lesions have gone (then they were cancer) or if they're still there and innocent.  Another thing is that I had the BRCA gene test done and the results won't be back until 19 Nov wish (they take 8 weeks) so I'm not sure the results will be back by the time they want to operate. I think the surgeon will want to wait. Has anyone got any experience of having chemo stopped? MY breast care nurse says it happens but I'm very nervous about it. I bloody HATE chemo and what it's done to me but I know it's the only treatment for TNBC. I will have the docetaxel after surgery then radiotherapy. ",
      "MessageIndex": 0,
      "PostDate": "15/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169871/enforced-break-in-chemo-worry",
      "Title": "Enforced break in chemo worry"
    },
    {
      "AuthorID": "beacon73",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beacon73",
      "Content": "HI Sarah, I;m in a similar boat. I had my mammogram, ultrasound and biopsies yesterday and was told it's malignant just by looking at the scans. I have a large 2.5cm lump in my R breast and my sentinel lymph node is enlarged - it's either enlarged because it's filtering out the cancer in the breast or it has cancer in there too. We will find out on Weds when we go back for the biopsy results. I've been told I will be consenting to surgery (in about 2 weeks time) at that appt and that it could include axillary node clearance (which sounds the worse most painful bit and scares me rigid). I am 45, no kids and married to a doctor who is an absolute legend.  Let me know how you get on.",
      "MessageIndex": 3,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164518/waiting-for-biopsy-results---breast-cancer",
      "Title": "Waiting for biopsy results - breast cancer"
    },
    {
      "AuthorID": "beacon73",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beacon73",
      "Content": "HI Jenny & Sarah, I am pretty scared, not so much of it being fatal as I think it's so survivable these days but the actual operation and treatment. I have literally had enough operations and bad news. Me and husband got married 4 years ago and have lost 2 babies late in pregnancy so were just looking forward to our lives together with our animals but one dog died in Dec of cancer and the other one is being put to sleep this Monday coming for cancer. Then I have my treatment plan and surgery being spelled out to me on Weds. They told me on Thurs last week that it is malignant and the biopsies are just to determine what type of cancer it is so they know how to treat it so I was left in no doubt what I am coming in to on Weds afternoon. My tumour looks quite large though - radiographer was measuring it at about 2.5-3cm on the ultrasound and my lymph is huge too. I have been told I will be consenting to surgery on Weds. What isn't yet clear is if they need to do chemo but they said it's likely as I am young. I wont want to lose my hair and this is really upsetting me. I am in total and utter shock that this is happening and keep crying. Big hug Sarah, lets hope you have better news than me. I had mentally prepared myself as much as I could for bad news but it was still like an out of body experience when I was being sat down in one of those rooms with sofas and a box of tissues on the table! I felt like I was in a Macmillan advert and this isn't my life. I am so fit and healthy as well.",
      "MessageIndex": 8,
      "PostDate": "21/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164518/waiting-for-biopsy-results---breast-cancer",
      "Title": "Waiting for biopsy results - breast cancer"
    }
  ]
}