{
  "AuthorID": "Beckie3889",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beckie3889",
  "Posts": [
    {
      "AuthorID": "Beckie3889",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beckie3889",
      "Content": "Lonefox, This is only a quick reply but just wanted to say thanks for your reply to my post on this thread. Out of nine nodes only one had cancer. Docs said this is good news and not to be alarmed. I start Chemo within the first 10 days of January but have not been given an actual date yet. They mentioned if I would like to try the cold cap but I don't think this is for me. I cant even go outside without wearing a hat because of the cold so I dont think I will cope with the cold cap. I've decided im cutting my hair short at the weekend and hopefully this will make it a bit easier for me for when my hair falls out. I was told I will be having 6 treatments. 3 of one drug and 3 of another but can't recall what they are and treatment will be for aprox 4 months. I will then most likely be having a double mastectomy in about 6 - 7 months time.",
      "MessageIndex": 10,
      "PostDate": "20/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45340/new-to-all-this",
      "Title": "New to all this ....."
    },
    {
      "AuthorID": "Beckie3889",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beckie3889",
      "Content": "Hi Lucy, I'm 30 also and was last week diagnosed with Breast Cancer on the wednesday and had to go back to the hospital the next day to have my sentinel lymph nodes removed to see if  it has spread. Everything is happening so quickly I'm finding it hard to get my head around it all. I get my results for this tomorrow morning and i'm pretty scared. I've been told i'm to start Chemo ASAP after I get these results and then after the Chemo I need to have a mastectomy but doc advises to have a double mastectomy. I also have been asked if I would have the abnormal gene test done as My mum and her three sisters have all had breast cancer also so it looks as though it may be a genectic thing. I'm thinking of getting my hair cut short after christmas and this terrifies me more than anything else. I have very long hair and about 10 years ago when I did have it cut short I absolutely hated it. I'm dreading getting it done but I know my hair is likely to fall out. On the plus side I have been looking at some lovely wigs and have already seen one I really like and its in the sale so think I am going to buy it. I don't think I could bare going outside without a wig. I also think having the wig will make it easier for my three young children as I don't want their friends to take the mick out of them because their mum doesn't have any hair. Beckie x",
      "MessageIndex": 8,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45340/new-to-all-this",
      "Title": "New to all this ....."
    },
    {
      "AuthorID": "Beckie3889",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beckie3889",
      "Content": "On Friday the 18th May i had a mastectomy and node clearance. A temporary FULL breast implant was then put in to save skin for a delayed reconstruction which I will have  after radiotherapy. I was discharged from hospital tuesday just gone (four days after op) and by Friday (yesterday) My almost non exsistant boob had blown to bursting point so had to have fluid drained. I had to book this with Xray as I had to have it with an ultra sound because of the silicone implant I had put in. 5 1/2 large syringe fulls later and I was feeling a bit better but by the time I got home I could already see fluid was collecting again. Right at this moment my boob is again at bursting point. Infact worse than before but I can't get a referral from my breast care nurse for the Xray section untill monday as no way of getting hold of her. I'm not sure what to do as I can't wait until then as I feel the liquid is going to have to burst out from somewhere. I'm not in pain thanks to meds but its extremly uncomfortable. Do you think I could go to A&E with this or is it not classed as an emergancy. Im scared of getting an infection which I have been told Im at high risk of getting and scared ill lose the silicone implant. Don't know what to do. Surely its not normal to get this much fluid after just one day.",
      "MessageIndex": 0,
      "PostDate": "26/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50233/seroma-after-mastectomy-with-temp-breast-implant",
      "Title": "Seroma after mastectomy with Temp breast implant"
    }
  ]
}