{
  "AuthorID": "BeeJay95",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
  "Posts": [
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Thanks Heather77, I'm so pleased you're doing so well.  I too am having the LD flap recon (with an implant) - which I realise is a big op but will give the best result in the longer term. Thanks for sharing your advice - I will force myself to take it easy so I have the best chance of a good recovery. Barbara X",
      "MessageIndex": 5,
      "PostDate": "25/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98052/mastectomy-with-recon-date-looming",
      "Title": "Mastectomy with Recon Date Looming"
    },
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Hi All Well my date for mastectomy with recon is booked for this Thursday. And I'm feeling quite calm. I'm not sure whether its because I have such confidence in the medical team, who have been amazing so far, or I'm in denial !!  Anyhow, it's happening Thursday and that's that. I told hardly anyone when first diagnosed but obviously had to once I knew I would be out of action for a few weeks. And the more people I tell, the more it seems that this operation is almost routine - everyone seems to know someone who's had it done and are really happy with the results. Which gives me even more confidence. The next concern will be the pathology results, but I'm not thinking about that yet. No point worrying about what might never happen.   I know this journey isn't over for me yet and it is guaranteed that I will have some serious meltdowns over the next few days and weeks, but onward and upward. I'll try and keep you informed of my progress for anyone else going through a similar situation. Bye for now Barbara x",
      "MessageIndex": 0,
      "PostDate": "25/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98052/mastectomy-with-recon-date-looming",
      "Title": "Mastectomy with Recon Date Looming"
    },
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Thanks Gibby They would have taken more tissue with me but I've only got small boobs so that would have left me with next to nothing! So instead it's all going and I get a nice new one. Best of luck with your path results, let's hope that's the end of it for you. Take care Barbara X",
      "MessageIndex": 6,
      "PostDate": "25/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98052/mastectomy-with-recon-date-looming",
      "Title": "Mastectomy with Recon Date Looming"
    },
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Thanks Helen :) X",
      "MessageIndex": 8,
      "PostDate": "25/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98052/mastectomy-with-recon-date-looming",
      "Title": "Mastectomy with Recon Date Looming"
    },
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Hi All Just thought I'd update you now I'm back home after my mastectomy and LD flap recon last week.  The op went well. I was fairly calm in the lead up but then had a complete meltdown as I was on my way to theatre. The anaesthetist was fabulous at looking after me and even gave me a cuddle to comfort me before I got on the bed. I can't remember any pain when I woke up and the painkillers seem to have kept on top of it since then. I have had a few sharp pains and some discomfort from the drains but that's got less every day. Day 5 and I'm moving slowlyround the house and using my bad arm fairly well but very carefully.  I've  still got 2 drains in, but hopefully at least one will come out tomorrow at my check up. The swelling has gone down quite a bit in the last 2 days which has reduced the tightness under my arm. I'm resting a lot and finding that despite sleeping well at night I'm needing 2 more naps during the day - it's great! All in all it hasn't been bad at all. The care and kindness in hospital has been amazing and from what I can see under the dressings, the result looks pretty damn good! If my other boob needed doing I wouldn't hesitate. If you are awaiting this type of op, don't worry, it isn't anywhere near as bad as you think. And the care you will get is wonderful. One tip is that I was offered a catheter for after the op, which some people decline, it was a god send! Nothing weird or unpleasant about it and no way did I want to be getting out of bed or shuffling on to bedpan for the first 18 hours afterwards.  Best wishes all Barbara x",
      "MessageIndex": 0,
      "PostDate": "01/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98284/mastectomy-with-ld-recon---complete-and-back-home",
      "Title": "Mastectomy with LD Recon - complete and back home"
    },
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Yes, I'll keep up the exercises which I'm sure will be easier when the tubes are out. Felt a bit weird to start with , although not painful, but my movement is feeling more free after just a few days! Everyday is another step to getting better",
      "MessageIndex": 3,
      "PostDate": "01/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98284/mastectomy-with-ld-recon---complete-and-back-home",
      "Title": "Mastectomy with LD Recon - complete and back home"
    },
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Hi Issingbass So sorry to hear your news.  I too was diagnosed with high grade DCIS. I ended up having a mastectomy (with LD flap recon) 8 weeks ago followed by further surgery 3 weeks ago to get clear margins because it was so extensive. I consider myself extremely lucky that they caught it so early. I too wanted to deal with it all quietly and told very few people, my Mum still doesn't know. It's really throws you emotionally and looking back I knew I was reacting oddly to the smallest things and not thinking straight - not surprisingly, of course. And I did a lot of crying on my own. But you get through it however you need to. And you will get through it. Being matter a fact helped me deal with it better I think, and the fact that the surgeons/consultants were matter a fact gave me confidence that this was all going to be okay, as it is just 'standard procedure'. One time my breast consultant did show his feelings was telling me I had to go back for more surgery - he looked devastated and so I was devastated, but that was because he was so disappointed for me. They are real people doing a job - an amazing job. I get the results for my latest op this Friday and feel confident that it will be fine and if not, then they will have a plan and I'll get on with whatever comes next.  Don't get me wrong, I can still have a meltdown on my own every now and then, but everyday is a day closer to us all getting through this. Also, I should add, the mastectomy and recon was quite heavy duty but well worth it - the Plastic Surgery team have been awesome from the start (and it's not finished yet) and I'm glad my breast tissue is all gone so I don't have to worry about it.  I half wished they'd done the other boob too, and if it comes to it, I'd do it all again. Take care and keeping reaching out to this amazing support network and you will get through this. Barbara x",
      "MessageIndex": 4,
      "PostDate": "27/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100426/dcis---hospital-surgeon-choice-advice-please",
      "Title": "DCIS - hospital /surgeon choice / advice please ?"
    },
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Hi Patsy plum That is unacceptable behaviour particularly considering her job and your situation - perhaps you should mention it to the PALS in your hospital. She was obviously having a bad day, but that is no excuse. If you have any concerns over your treatment I would ask my Breast Care Nurse in the first instance. I am new to all this and go to see about my mastectomy tomorrow - its very confusing trying to take it all in and understand it. I keep making lists of questions to ask.  I am, however, pretty comfortable with the decision to have a mastectomy - to me that means there is zero chance of cancer in that side - my concern is whether to ask for the other removing as well. Try and not let this isolated incident upset you and look to get your questions answered to put your mind at rest. Take care Barbara x",
      "MessageIndex": 3,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97777/confused-and-upset",
      "Title": "Confused and upset"
    },
    {
      "AuthorID": "BeeJay95",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/beejay95",
      "Content": "Hang on in there Heather, You have come through so much, you are incredible. Try not to worry about what tomorrow brings - it could all be fine and you will have wasted a day being sad and anxious. I hope it goes well and will be thinking of you. Barbara X",
      "MessageIndex": 5,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97735/quadrantectomy-and-ld-flap",
      "Title": "Quadrantectomy and LD flap"
    }
  ]
}