{
  "AuthorID": "BettyS",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bettys",
  "Posts": [
    {
      "AuthorID": "BettyS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bettys",
      "Content": "I was diagnosed with DCIS in April, and had a single mastectomy a few weeks ago, with a sentinel lymph node biopsy (which was clear)  and immediate reconstruction using an implant. I am seeing the oncologist on Wednesday, and she thinks I should have radiotherapy.  Has anybody had radiotherapy after having an implant, and if so, what did they do?   Can they do the radiotherapy with the implant in place, or do they need to remove it, and put another one in later?   Although I have complete confidence in the experts, any advice or sharing of your experiences is very welcome.",
      "MessageIndex": 0,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50870/radiotherapy-after-implant-reconstruction",
      "Title": "Radiotherapy after implant reconstruction"
    },
    {
      "AuthorID": "BettyS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bettys",
      "Content": "Thanks Kate. This is helpful, and I will ask the BCN to put me in touch with someone.  I don't want to make a decision on this in a hurry. Everything moved so quickly after the initial diagnosis, but now the mastectomy has been done, and I am still not back at work, I have more time to think and speak to others.  Betty",
      "MessageIndex": 5,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50870/radiotherapy-after-implant-reconstruction",
      "Title": "Radiotherapy after implant reconstruction"
    },
    {
      "AuthorID": "BettyS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bettys",
      "Content": "Enter your message...Lulu many thanks, this is very helpful and reassuring.  The DCIS was non-invasive, but was widespread and close to the muscle, so that may explain why radiotherapy is recommended.  I was quite alarmed by the thought of flap reconstruction, especially when they thought after the biopsy that  it was non-invasive DCIS, so when the plastic surgeon offered me an implant I accepted immediately; he may have been prompted by the BCN.  This does mean that I need a reduction on the other side, but I am happy with that.  I will find out more tomorrow. Thanks again.",
      "MessageIndex": 4,
      "PostDate": "19/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50870/radiotherapy-after-implant-reconstruction",
      "Title": "Radiotherapy after implant reconstruction"
    }
  ]
}