{
  "AuthorID": "BiBi 44",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
  "Posts": [
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Hi Muldoon glad you’re through your treatment. You don’t mention Herceptin, the treatment for HER2+. Did you manage to get that without chemo? I kind of thought they came together. You should probably discuss whether you should be having that, even now. It’s a jab in the thigh every 3 weeks. Most don’t notice too many side effects, although it’s a bit cumulative & you feel more tired towards the end of the year of treatment.  You don’t lose your hair, although mine grew more slowly during treatment, and it shouldn’t affect your lungs. If you really didn’t  want chemo, have you done a lot of complimentary things to compensate like green juices, meditation, detox & dietary changes?i would think they might be helpful in your position & a lot of people swear by them. Hope you start feeling like your old self soon, if you aren’t already xx",
      "MessageIndex": 1,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159023/stage3-her2-positive-breast-cancer-refused-chemotherapy-after-mastectomy",
      "Title": "Stage3 her2 positive breast cancer refused chemotherapy after mastectomy..."
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Frilly 2cm & under is stage 1 & very treatable. The bit you’re in is the worst emotionally & once treatment starts you will feel a lot better. I just breathed a huge sigh of relief when I woke up from the op & thought ‘its gone’. I found relaxation apps were good to stop your mind running riot (Glenn Harold is good about £3 on the App Store). Also read about what you can do to help your chances eg diet,exercise etc as it gives you some control back over your life. Going through cancer treatment is odd, you can’t quite believe it’s happened to you & it’s simultaneously normal & totally abnormalat the same time. You will be amazed how much support you get from friends (virtual & real).i found email exchanges from people who had been through it really helpful in the first few days. Do you know anyone that’s had it or a friend of a friend? Good luck with your next appt. the first few weeks are a real whirlwind & it’s hard to sleep, hence the relaxation apps. Lots of love xx",
      "MessageIndex": 26,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158007/just-diagnosed-with-breast-cancer",
      "Title": "Just diagnosed with breast cancer"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "I found having the last dose of steroids before 2pm helped with sleep on FEC. If the indigestion is not responding to things like gaviscon & ranitidine you might want to ask the GP for omeprazole or lansoprazole. Most of us were on it after FEC & it worked a treat. Hopefully your mum  feel better soon x",
      "MessageIndex": 8,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158048/mum-has-started-chemo",
      "Title": "Mum has started chemo..."
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "[Edited by Admin]",
      "MessageIndex": 6,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142750/finishing-treatment",
      "Title": "Finishing treatment.."
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Hi Phaedra I read stuff about depression during my treatment & was determined to dodge that bullet. [Edited by Admin] There is also some info on some of the other posts about what you can do to reducing your chances of getting depression.  The main thing to remember is that it takes time to recover. I thought I was better 3 months after treatment finished, but a year later I realised I was still improving. If you’ve had chemo you’ve probably forgotten what ‘normal’ feels like.  You do think about it quite a lot to start with but gradually it fades into the past & life takes over. It all seems like a (not so great) dream now (I am a year post treatment). The only time it plays on my mind now is the week before annual mammo.  I am still visit this blog from time to time because I review leaflets for Macmillan. Lots of love & well done for getting through treatment BBx",
      "MessageIndex": 5,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142750/finishing-treatment",
      "Title": "Finishing treatment.."
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Panagram sorry to hear your story.  The stress of dealing with your horrible neighbours probably contributed to getting the BC.  Most people have some major stress in the 1-2 years before diagnosis.  My dad died for example.  We are really pressurised to take these hormonal treatments, but you need to know what your risk is to properly weigh up the risk/benefits. If you had a small low grade BC with no nodal spread then your chances of getting to 10 years would be very high. Even if the % reduction in recurrence is quite high, it may only amount to a small difference in the real world & you may decide the effect on your body is not worth it.  I just want quality of life & couldn’t stand the side effects so stopped.  Yes, might well not be the sensible thing to do, but I do feel like a human being again & i’m enjoying my life again.  I do a lot of natural things to block the ER receptors instead.  I’m not telling you to stop, but just make sure you have the right info to make your decision.  In my case tamoxifen allegedly made 30% difference, but that was only 1 less person in 100.  I traded that for my life back. Good luck & lots of love BBx",
      "MessageIndex": 9,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143226/i-don-t-understand-my-prognosis-what-my-future-is",
      "Title": "I don't understand my prognosis/what my future is"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "So sorry to hear you have to go through that. I had two ops & I found out later that 40% of people need further surgery. It was like a punch in the guts to get that news, just as I had healed & was beginning to drive again etc. I think I was almost more upset than when I was iriginally diagnosed, if that was possible! Like someone else said, you do come to terms with it. It’s not ideal, but you don’t want to leave any cells in there. Will you need chemo now as well? Chin up. You will eventually get through this nightmare. All the best. xxx",
      "MessageIndex": 9,
      "PostDate": "19/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166347/second-operation",
      "Title": "Second Operation"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Hey Pointer I’m glad you’ve come through it all now. We do eventually get our heads round even the worst news. I remember after my op I was ‘up(down?) graded from stage 1 to stage 2 & grade 2 to grade 3. Talk about sh*t day. Honestly people who say ‘breast cancer is a good one to get’ have no idea how stressful the reality of it all is. Just a quick thought. Make sure they do an Oncotype DX if they’re recommending chemo. Lots of people don’t need chemo after that test & it is available on the NHS. Chemo is doable but very damaging to your body, so if it’s not completely essential good to avoid. All the best. You sound like you have a good attitude to it all ... just get on with it & then you get your life back. I’m 2 years post treatment now & it all seems like a weird dream, like it didn’t happen to me, even though I know it did. xx",
      "MessageIndex": 14,
      "PostDate": "29/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166347/second-operation",
      "Title": "Second Operation"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "NN17 try not to panic.  My tumour was upgraded after surgery meaning chemo & another op.  It's so devastating, I really feel your pain. It knocked me right back & I think I felt worse than I did when I first got diagnosed. They details of the tumour often change when you get the results back, it's not them being incompetent, it's just some tumours aren't visible on mammogram. Re cold cap. The chemo drugs are very harsh & the cold cap is not guaranteed to work BUT there were 4 of us using it when I went through chemo.  3 lost hair, but still looked perfectly normal. I think I lost 50% of my hair, but was never bald. DEFINITELY worth a try.  It also grows back a lot faster & more controllable after chemo finishes if you cold cap. [Edited by Admin]. I don't believe there is a tablet to save your hair.  It's the absolute worst part of it all in my view. I would think it might well change the stage, but it's only one factor they use to decide your treatment, so please try not to get too upset. Big hug & sorry you're having such a tough time. Have you asked them about freezing some eggs?  They should be able to advise you about that.  There is a young women's breast cancer network if you want to talk to some others your age.  You will be mainly fine to look after your son, so don't worry.  Chemo is vile, but it's kinda better than you expect in a weird way. Lots of love xx",
      "MessageIndex": 2,
      "PostDate": "07/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139531/grade-of-cancer-changed-after-surgery",
      "Title": "Grade of Cancer changed after Surgery"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "This was the research I took in, if anyone’s interested. The relevant bit is right st the end in the paragraph with references 38. 39 & 40..",
      "MessageIndex": 11,
      "PostDate": "30/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168900/estriol-cream",
      "Title": "Estriol Cream"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Hi Robera  I have estriol & testosterone cream which totally dies the job. Provided it is ultra-low dose, research shows no increase in systemic oestrogen levels hence being safe for ER+ BC. I used it every day for two weeks & everything returned to pre-BC condition (without going into too much detail ha ha). My doc also showed me a diagram which shows that estriol does not metabolise to dangerous BC causing compounds, unlike oestrodiol & estrone. It all looked a little complicated, but I got the point. Now just use if there is any discomfort. So nice for normal service to be resumed. I work in a GP surgery & they won’t give any form of oestrogen to pts with a history of BC, so don’t be surprised if GP hasn’t heard of it. I went into mine with the research showing it was safe, plonked myself down, burst into tears & said sex life so uncomfortable it was making me miserable.  She read it & then said ok. xxxx ps my dose is 0.03 of oestriol. Apparently you also have testosterone receptors ‘down there’ so that also helps if you’re not willing to try oestriol.",
      "MessageIndex": 9,
      "PostDate": "30/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168900/estriol-cream",
      "Title": "Estriol Cream"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Sozz that didn’t attach. I’ll try again :-) https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3862044/ I totally agree Tess! It’s very unglamorous. I had lunch with some ladies from the tennis club, all 50 something, & the topic came up. Seems loads of people have the issue, even without BC. One of them, who is a gynaecologist, suggested it & said it would be safe for me (she knows my history). Balance activ moisture + are also good x",
      "MessageIndex": 12,
      "PostDate": "30/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168900/estriol-cream",
      "Title": "Estriol Cream"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Helen have invited you as a friend (I think! Haven’t done it before). I’ll PM you the link x",
      "MessageIndex": 19,
      "PostDate": "01/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168900/estriol-cream",
      "Title": "Estriol Cream"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "I agree with Caro on juicing green leafy veg, the darker the green the better eg cavelo nero better than lettuce. I would also add that milk thistle and detoxing might help. By detoxing I mean avoiding as many chemicals as you can, as they’re mainly dealt with by the liver, so look at your house cleaning products, make up, body lotions and consider filtering water. You can also do a liver cleanse. Good luck with everything xx",
      "MessageIndex": 5,
      "PostDate": "17/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159554/can-we-help-improve-liver-function",
      "Title": "Can we help improve liver function?"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Really pleased for you Robera.It’s just a shame that the default option is ‘suffer in silence’, when something could be done about it so easily. I got radiation fibrosis & was just told ‘you have thickening’. It was only because I researched it & found that it could be greatly relieved by physio that something got done about it & at my own cost. Feel so much better for it, but seems that the need for physio will be ongoing as it’s a progressive thing. Why didn’t the oncologist say ‘you have some thickening, I will refer you to physio’.  Thanks goodness for sites like this where we can help each other to find a way through the aftermath x",
      "MessageIndex": 24,
      "PostDate": "03/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168900/estriol-cream",
      "Title": "Estriol Cream"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "That made me laugh & you're really most welcome.  We’ve all been dealt a bum hand in life with this BC thing, so we’ve got to share stuff that can make our lives easier. The other thing I asked about was whether it could affect your endometrium (uterus lining) because i’ve been on Tamoxifen & I certainly don’t want any more stimulation in that area. GP said topical application is ok. I’ve been told off for recommending other websites on here, so won’t put a link in, but Liz O’Riordan has written about sex after BC in a very candid manner. Might be worth a look. She’s medically trained, specialises in BC ironically. Hope I don’t get in trouble again for that xx",
      "MessageIndex": 15,
      "PostDate": "30/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168900/estriol-cream",
      "Title": "Estriol Cream"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Pas de problem. Bon chance!x",
      "MessageIndex": 10,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158939/tamoxifen-nolvadex-d-and-hair-lost---need-comments-please",
      "Title": "tamoxifen(Nolvadex-d) and hair lost - need comments please"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Hi I definitely had hair loss on Tamoxifen but my oncologist claimed it was nothing to do with the drug. Funny because the leaflet in the pack says hair loss is a side effect. Some people have found that changing brands can help a lot. Personally I reduced my dose to 10mg & that stopped it. There is some research supporting the fact that lower dose is just as effective with less side effects, but my oncologist said she only prescribed lower doses to patients with other issues. Obvs i’m not an oncologist, so maybe discuss it with yours if it’s really bothering you. x",
      "MessageIndex": 6,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158939/tamoxifen-nolvadex-d-and-hair-lost---need-comments-please",
      "Title": "tamoxifen(Nolvadex-d) and hair lost - need comments please"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Hey Charlene Mine is TEVA branded. For me, 10mg is better than none, which is why I take it.  Obviously the recommended dose is 20mg. I found the hair loss angle of chemo really difficult & losing my hair again was a deal breaker for me. Obviously doing anything other than the standard dose has to be balanced against the risk of recurrence. Each one of us has to make up our own mind what’s right for us. To be fair I do a heap of alternative stuff to (hopefully!) balance the lower dose eg broccoli sprouts, loads of cruciferous veg, phytoestrogens, DIM etc. If you google ‘Chris Woollams + Tamoxifen’ they have quite a lot of interesting stuff to say on Tamoxifen & alternatives. Also the research, if you’re interested, can be found by googling ‘scholarly articles + low dose Tamoxifen’. You can make your own mind up x",
      "MessageIndex": 8,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158939/tamoxifen-nolvadex-d-and-hair-lost---need-comments-please",
      "Title": "tamoxifen(Nolvadex-d) and hair lost - need comments please"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Hi Linda I had really bad mouth ulcers when I had mine fitted & was really worried about being sick after the anaesthetic. I had vomited a lot after my lumpectomy. I insisted on it being done under a local & it was fine. It is slightly odd to get used to, but the slightly chokey feeling goes after a day or so. If your hospital doesn’t give you numbing cream to use before they access it, Emla cream from boots works just as well. Although having the port put in is an additional op, it’s a bonus once you have it as the chemo all goes into a large vein where the blood’s moving fast & you don’t get damaged arm veins. It doesn’t need dressing & you can do sport or whatever activities you want to. One odd thing is that they want to keep it in for a year. I wanted to get rid of mine as soon as chemo was finished, but had to push for that to happen. I was trying to move forward with my life & there is, of course, a risk of clots with any central line. Good luck with everything xx",
      "MessageIndex": 5,
      "PostDate": "13/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/157177/inserting-port-under-general-anaesthetic",
      "Title": "Inserting port under general anaesthetic"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "That’s interesting. It must be a Marsden thing then. I asked why & they said ‘just in case you need more chemo’, which I thought was shockingly pessimistic. They told me not to work about recurrence, when I asked for stats, but wanted to leave the port in! Hope you’re well Toxo. We’re in Dubai but there’s a sandstorm so stuck in our room x",
      "MessageIndex": 7,
      "PostDate": "13/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/157177/inserting-port-under-general-anaesthetic",
      "Title": "Inserting port under general anaesthetic"
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Frances it's perfectly normal to be a bit jumpy after treatment & worried about every little thing. [Edited by Admin]. You will eventually put this all behind you, but for most of us it was such a shock when we got diagnosed because we felt perfectly fine. It's that shock factor which makes us worry about everything else. Have a good Sunday xx",
      "MessageIndex": 6,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139026/npi-score-feeling-a-bit-confused",
      "Title": "NPI score. Feeling a bit confused."
    },
    {
      "AuthorID": "BiBi 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bibi-44",
      "Content": "Yes low & moderate are the same programme. You're still low risk, you haven't been promoted x",
      "MessageIndex": 1,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139026/npi-score-feeling-a-bit-confused",
      "Title": "NPI score. Feeling a bit confused."
    }
  ]
}