{
  "AuthorID": "Birdsoafeather",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
  "Posts": [
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Hi everyone and thank you for the December chemo link.  I have my 3rd FEC tomorrow then start my first T just after Christmas.  A bit apprehensive as side-effects may be different but good to read the tips and everyone's experiences so far.  Warm wishes to everyone in the lead up to Christmas.",
      "MessageIndex": 27,
      "PostDate": "03/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172565/december-2018-breast-cancer-chemo-chat",
      "Title": "***December 2018 Breast Cancer Chemo Chat ***"
    },
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Thank you Scriptfan.  Really appreciate that, and yes will get some lollies made :-)",
      "MessageIndex": 182,
      "PostDate": "19/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172565/december-2018-breast-cancer-chemo-chat",
      "Title": "***December 2018 Breast Cancer Chemo Chat ***"
    },
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Hi Whitby, My hair started to fall out on day 17 of first EC.  I was going to try and hang on to it but the back of my jumpers were full of hair, on the pillow, inside hats and then when I was preparing food, hair kept getting in that!  That one decided me and so i had my head shaved to grade 3.  Strange at first but I have got used to it and yes the shorter washing hair time is a plus. I had 3rd EC yesterday and did feel the need to go to bed in the afternoon and doze to Spotify music and Podcasts.  Felt heady and sleepy but managed to eat the recommended fatty dinner, sausages, chips and baked beans for me this time.  I'd also got from the library Mama Mia 2 so hopefully this week sometime.  A friend of mine said she thought the film should be prescribed by the NHS so I thought I'd give it a go! I've really found that getting in a walk every day (except day of chemo) even if just 20-30 minutes really helps and I found a gentle yoga dvd for cancer patients on the livebetterwith website which I try to do when I can.  And of course drinking loads and loads of water / drinks - sometimes so hard to get those 1 1/2 litres down but think it does really help the more you can manage. Good luck with this cycle. Best wishes to all.",
      "MessageIndex": 46,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172565/december-2018-breast-cancer-chemo-chat",
      "Title": "***December 2018 Breast Cancer Chemo Chat ***"
    },
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Hello everyone,  Warm wishes to everyone whose going through this.  I'm on my 3rd week of 3rd FEC  now so am in the 'feeling better' week.  I haven't had too many side effects on FEC and haven't felt sick at all.  I had blood on tissue when blowing nose on first cycle but not in my 2nd and 3rd.  I also had some mouth ulcers but Gelclair or Biotene toothpaste and mouthwash seemed to sort those out.  Constipation was the worst this cycle.  Senna tablets worked the last 2 cycles to sort this out but this time, I needed some Movicol for 3 days as well to get back to (almost) normal.  Do now have some piles but not too bad.  Drinking enough liquid is tough sometimes but I've found I can drink quite a lot if I heat up 1/3 cup of apple juice and 2/3 water in the microwave.  My favourite home-blended juice is apple, carrot, fresh ginger and apple juice which I blend up then put through a sieve (I don't have a proper juicer but this works).  Ginger's such a good ingredient to help with the strengthening of immune system isn't it so I hope it all helps. I have also had a red rash around my mastectomy and lymph node removal scar which comes back during each cycle but this has been checked and I'm told I'm not to be concerned.  As always, it's about keeping an eye on things and contacting the nurse / emergency help line if things get worse.  I always panic when something new comes up but next time round, I know what to expect. I have worried  about my weight going down too much as I was told if it drops too much, they would need to change my dose but the pattern does seem to be that I go up to almost my pre-chemo weight with the help of the steroids (I think) at the beginning of each cycle but then over the next week or so, I lose almost half a stone, but then in the 2nd half of the cycle, I gain weight again with the recommended diet of as much healthy fruit and veg as possible but also lots of cream and butter and mayonnaise added to foods too, as well as some Complan added to porridge.  Oh and yes, also I have had the flushed red face each time following the steroids. I feel the drugs are building up now as I'm getting slight headaches,  more towards the end of the day, but then sleep helps, and I keep saying to myself the drugs need to build up as it means the chemo is doing what it's meant to be doing.  I have been wearing a wig out of the house but find it a little uncomfortable so the big woolly hat came out yesterday which has a nice soft inside and means I can leave the wig at home. I start on Docetaxel (1st of 3 sessions) just after Christmas and am nervous about this as SEs might be different.  I've bought some dark nail varnish to protect the nails ready for that, and at least I should be feeling good for Christmas day.  Really really nice to be over half way there now though so focusing on that as much as I can. Good luck to everyone, especially in the lead up to Christmas, really good to share worries and tips for coping, and also great to hear when people are getting to the end of their treatment too :-).",
      "MessageIndex": 151,
      "PostDate": "18/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172565/december-2018-breast-cancer-chemo-chat",
      "Title": "***December 2018 Breast Cancer Chemo Chat ***"
    },
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Thanks TheScriptFan.  Ok thank you for the advice.  I appreciate it. I hope your dry throat is a temporary thing and things improve now that you've finished chemo.",
      "MessageIndex": 2,
      "PostDate": "15/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171668/biotene-for-dry-mouth---wondering-which-to-buy",
      "Title": "Biotene for dry mouth - wondering which to buy?"
    },
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Thanks so  much for your reply.  Good to know that the toothpaste helped.  Hopefully mouthwash will have similar effect. Thanks again.",
      "MessageIndex": 5,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171668/biotene-for-dry-mouth---wondering-which-to-buy",
      "Title": "Biotene for dry mouth - wondering which to buy?"
    },
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Hello there, I'm new to the online community so hoping I'm posting to right place.  I've had surgery for breast cancer and had my 2nd (out of 6) chemo session yesterday.  Although it's always scary as you don't know how your body's going to react, I wasn't so nervous the 2nd time just because it wasn't all completely unknown this time.  One thing I did want to ask the group is about which product is best to get for dry mouth.  I'm only getting dry mouth at night (and snoring!) so I was recommended Biotene and to use an atomiser to spray it in to mouth at bedtime, but on the Biotene website, I could see toothpaste, mouthwash, and gel, but no liquid so I'm wondering what to use.  Does anybody know?  Thanks so much for any help and wishing you all a good day, whereever you're up to in your treatments :-).",
      "MessageIndex": 0,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171668/biotene-for-dry-mouth---wondering-which-to-buy",
      "Title": "Biotene for dry mouth - wondering which to buy?"
    },
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Thank you Leolady56.  I am on the Chemo group now as well.  Thank you.",
      "MessageIndex": 6,
      "PostDate": "16/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171668/biotene-for-dry-mouth---wondering-which-to-buy",
      "Title": "Biotene for dry mouth - wondering which to buy?"
    },
    {
      "AuthorID": "Birdsoafeather",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/birdsoafeather",
      "Content": "Dear JSx, This is now a few weeks since your post so hopefully you have had some progress with finding out about your rash and getting good advice from the GP / nurses? As the other ladies said, rashes can be for all sorts of reasons and it is scary not knowing what causes it.  About 18 or so days into my first cycle, I had a rash appear around my breast scar and under my arm.  When I went for my 2nd chemo, the hospital photographer was asked to take a photo of it for the records etc.  I was given antibiotics in case it was an infection and was told to keep an eye on it and call the emergency help line if it got worse again.  I didn't have any pain or itchiness though and it did fade and mostly went away.  I'm coming to the same day in cycle 2 now so keeping an eye on it in case it gets worse again though it has pretty much gone. Wishing you well.",
      "MessageIndex": 3,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171255/strange-red-lump-and-rashes-on-breasts",
      "Title": "Strange red lump and rashes on breasts"
    }
  ]
}