{
  "AuthorID": "Blossom.",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blossom_2e00_",
  "Posts": [
    {
      "AuthorID": "Blossom.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blossom_2e00_",
      "Content": "Dear Anne, Thank you for your reply, the side effect you had sounds really awful, like you say, one way to lose weight, but not very pleasant at all. I cannot discuss anything with my oncologist, as she signed me off on my first check up after finishing my radiotherapy. In fact I have only seen her twice and that was briefly. In my reply to S.... I have said that I now have an appointment with a lymphoedema nurse, so we shall see what she has to say. I was offered Tamoxafen,but decided not to take it because of some of the known side effects and my family history, so was offered Arimidex instead. Thanks again for taking the time to write, take care, Blossom",
      "MessageIndex": 4,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10866/arimidex-and-breast-swelling-and-tenderness",
      "Title": "Arimidex and breast swelling and tenderness."
    },
    {
      "AuthorID": "Blossom.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blossom_2e00_",
      "Content": "Hi, Many thanks for your reply. I have now been referred to a lymphoedema specialist nurse, and I will be seeing her this week. It was my breast cancer nurse who originally diagnosed the lymphoedema in the breast which had been operated on. As I understand it, Arimidex can cause swelling in the feet, hands, arms and legs. So why not the breast. The good breast, seems much bigger, now I know that the other one is now much smaller due to the lumpectomy, and maybe I am just making a comparison without realising it. ...but sometimes it feels tender too. Like when I was pre menoupausal, and due for a period. Arimidex is a hormonal treatment so therefore it is possible that, it is the medication, but no body seems to know for sure. I am probably getting paranoid, at every twinge and ache in the good breast, the Arimidex is also having other side effects, but again these have not been officially diagnosed as being the Arimidex. Once again many thanks for talking to me, Take care, Blossom",
      "MessageIndex": 3,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10866/arimidex-and-breast-swelling-and-tenderness",
      "Title": "Arimidex and breast swelling and tenderness."
    },
    {
      "AuthorID": "Blossom.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blossom_2e00_",
      "Content": "I wonder if anyone has had side efffects with Arimidex, now from what I have read there are lots, but in particular, breast swelling and tenderness. This is in the \"good\" breast as well. As it is an hormonal treatment, it is logical that it could affect some women this way, but cannot find much in side effect information. I am due to have my first mammogram since my op, in April 2008 and I am obviously very anxious re the results. The affected breast has scar tissue which is very hard and tender, and lymphoedema. Can Arimidex cause lymphoedema, as well as the radiation. Would love to hear from you all . Blossom",
      "MessageIndex": 0,
      "PostDate": "23/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10866/arimidex-and-breast-swelling-and-tenderness",
      "Title": "Arimidex and breast swelling and tenderness."
    },
    {
      "AuthorID": "Blossom.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blossom_2e00_",
      "Content": "Hi Sheels, Thank you for writing, How have you gone on at the hospital today, and your pre op assessment. Has the cancer re occurred, and do you have to have another lumpectomy. Do hope that you were able to get more information as to what is happening and what your options are. I have had my first assessment visit today with the lymphoedma nurse, she was really good, I am all taped up now. Having my first mammogram since the op, on monday, and I too am nervous re the results. Do let me know how you are, I think the Arimidex has many side effects that we are not told about. Take care, with love from Blossom.",
      "MessageIndex": 7,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10866/arimidex-and-breast-swelling-and-tenderness",
      "Title": "Arimidex and breast swelling and tenderness."
    },
    {
      "AuthorID": "Blossom.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blossom_2e00_",
      "Content": "Dear Alison, Many thanks for your reply. See other replies, my breast that was operated on, is very tender, hard scar tissue and lymphoedema. However, it is the good breast that iscausing me concern. I have discussed it with my breast cancer nurse and she does not think it is the Arimidex. She examined me and said that she could not feel any lumps, but then the other lump could not be detected by examination, only via a mammogram. I am due my next mammorgram next week, and very anxious re the results, but since all this, I think I am becoming paranoid, where pehaps before I would not have bothered. A very brave decision, to have the good breast removed, and I do hope that everything is going okay, take care, love Blossom",
      "MessageIndex": 5,
      "PostDate": "25/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10866/arimidex-and-breast-swelling-and-tenderness",
      "Title": "Arimidex and breast swelling and tenderness."
    }
  ]
}