{
  "AuthorID": "Blue67",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blue67",
  "Posts": [
    {
      "AuthorID": "Blue67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blue67",
      "Content": "Pleased to hear that you're op went well & you are recovering. I had my LD flap 9 weeks ago & know what you mean about the drains. I found them the worst part of the whole procedure. As for the food, I completely lost my appetite in hospital as the food was so revolting. I was in on Christmas day, so it was the first time in my life that I didn't have a Christmas dinner. Funnliy enough, we're having our family Christmas dinner this Sunday (better late than never). I don't know what your arm movement is like. I could barely lift my arm at first, but I can lift it right up now. Look forward to your update. Sally. X",
      "MessageIndex": 4,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47363/finally",
      "Title": "Finally!"
    },
    {
      "AuthorID": "Blue67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blue67",
      "Content": "Hi, I have had breast cancer in both breasts, so I've had lymph nodes removed on both sides. The second time was last year and I was told by my consultant that I musn't have injections in either arm. I've had several blood tests taken from my foot in the last year. This had been done while I've been in hospital for one reason or another. I need to have a routine blood test and none of the phlebotomists at my local hospitals ( I've tried 3) will do it. Two hospitals said 'we don't do feet' and the third said 'we're not insured to do feet'. There must be other ladies out there who can't have bloods taken from either arm. How do they get on? Any advice.",
      "MessageIndex": 0,
      "PostDate": "29/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111190/blood-tests-in-foot-due-to-node-removal-on-both-sides",
      "Title": "Blood tests in foot due to node removal on both sides."
    },
    {
      "AuthorID": "Blue67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blue67",
      "Content": "Thanks everyone for your positive comments. I had a really bad night last night and didn't sleep at all. As I said before, I'm a very positive person and I know that once I've got my head around this I will get my fighting boots on. I'm not going to google TNBC anymore. I'm going to take a leaf out of nanny marys book. I've got it and knowing what it is etc. isn't going to change that. I'm going to put myself in the oncologists hands. Unfortunately, I suffer from crippling anxiety to the point where I hyperventilate and pass out and one of my 'things' is 'what if'. But as nanny mary said, what if I got run over by a bus. Positivity got me through this last time and it will again. Yes, I have aggressive cancer but what it doesn't realise is, is that I'm aggressive too when I'm pissed off, so come on cancer, piss me off! Thanks Ladies, Sally. XX",
      "MessageIndex": 9,
      "PostDate": "30/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89093/breast-cancer-round-2-triple-negative",
      "Title": "Breast Cancer Round 2-Triple Negative"
    },
    {
      "AuthorID": "Blue67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blue67",
      "Content": "Hi everyone, I was diagnosed with DCIS three years ago and had a mastectomy and reconsruction. Three weeks ago I was diagnosed with invasive grade 3 cancer in the other breast. I had a lumpectomy and sentinel node biopsy last week. I've been back to the consultant today and have been told that the lymph nodes are clear, but it is triple negative breast cancer. I've got to have six months of chemo and then radiotherapy.  I've been researching TNBC and have filled myself with dread. Has anyone got anything positive to say about TNBC. I did look on the TNBC forum but it doesn't seem to be used much. I'm a very positive person, but I can feel the positivity draining away. Sally.",
      "MessageIndex": 0,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89093/breast-cancer-round-2-triple-negative",
      "Title": "Breast Cancer Round 2-Triple Negative"
    },
    {
      "AuthorID": "Blue67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blue67",
      "Content": "Hi Kate, I had a mastectomy and reconstruction on 21st December 2011, so I'm 2 years down the line. I went into hospital on the 21st and came out on boxing day, so I spent Christmas day in hospital, which I admit I didn't cope very well with. I can honestly say that I had hardly any pain. I was a bit sore and had four drains in which were uncomfortable. Once the drains were removed (the 26th), I felt fine. I felt very tired for the first 2 weeks. I was given a list telling me when I could hoover, do house work, drive, etc. and I stuck to it, because I didn't want to end up in hospital. Over the next 3 weeks I gradually did more around the house and started to go further afield, walking or on  buses. I started driving after 6 weeks ( a struggle as I really missed driving, but was determined to do as I was told). My main problem was not being able to lift my arm. Exercise is paramount in getting movement back. Do the exercises that the physio gives you and ask for physio therapy. My physio therapist brought me back to life. Once I could fully lift my arm, I finally felt normal again. My advice is to take things slowly, don't over do it and exercise, exercise, exercise. You will come though this and will feel proud of yourself  for doing so. Everyone is different, but after 6 weeks (so you're looking at the end of January) I was back to normal and getting on with my life. I wish you all the best for the 20th and hope you have a restful Christmas. Sally. X",
      "MessageIndex": 11,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68308/mastectomy-on-20th-december",
      "Title": "mastectomy on 20th December"
    },
    {
      "AuthorID": "Blue67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blue67",
      "Content": "Hi everyone, I had my portacath fitted 10 days ago and had first chemo session 4 days later. Apart from the intitial bruising and soreness, it's healed well. Yesterday, it started to sting alot. It's stinging virtually all the time and seems to have risen closer to the skin. I can clearly see and feel it. Anyone else have a smiliar problem and should I be worried. Thanks, Sally.",
      "MessageIndex": 0,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91050/portacath-pain",
      "Title": "Portacath Pain"
    },
    {
      "AuthorID": "Blue67",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/blue67",
      "Content": "Oh thanks everyone. That's put my mind at rest. I didn't realise that I would see it so clearly. I phoned my chemo nurse earlier and left a message. I will be able to see her at my local hospital on Wednesday so I will pop along just so she can look at it, but your replies have put my mind at rest until then. Thanks, Sally.",
      "MessageIndex": 4,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91050/portacath-pain",
      "Title": "Portacath Pain"
    }
  ]
}