{
  "AuthorID": "bobby84",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bobby84",
  "Posts": [
    {
      "AuthorID": "bobby84",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bobby84",
      "Content": "Hi, this is a bit of rant but I need to get it out.  I'm 28 and about a year ago noticed an area on my left breast that felt harder than the rest. I went to the gp and the breast clinic, had an ultrasound and was told it was normal thickening and nothing to worry about.  Then just after we moved house in April I noticed what looked like blood on my pjs and sheets. Didn't know where it was coming from for a while but then as it became more like every day I noticed it was coming from my left nipple. I got an appointment at the breast clinic and was told, it was still normal and nothing to worry about. I'm a bit bad for googling things so I had a suspicion that one sided, brownish/blood stained, spontaneous discharge accompanied with a 'lump' wasn't all that normal. Anyway he did give me a slide to provide a smear of the discharge which I did and last week got an appointment back at the breast clinic. Thinking it was a bit soon to be told it was nothing but believing what I'd been told I went, alone, not expecting to be told it was bad news. I was told at the very least its DCIS but cover quite a large area and I'll need a mastectomy. There's a possibility though that its spread out of the ducts and I'll need chemo first. I had core biopsies taken from the thickened area and from a couple of slightly enlarged lymph nodes. I also had a mammogram which showed areas of calcification.  I'm going back on Wednesday for the results but now my mind is going mad thinking what if it's spread? what if it's been silently growing in other places and there's nothing they can do? I've been reading things but everything I read seems to be stories of women who found it too late and it had spread to bone etc, I'm getting so freaked out. I just don't know enough to know what to reasonably expect. The only family history I have is my mum's cousin who died from breast cancer at 40 but I don't know any more about her. ",
      "MessageIndex": 0,
      "PostDate": "14/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51549/new-and-scared",
      "Title": "new and scared..."
    },
    {
      "AuthorID": "bobby84",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bobby84",
      "Content": "Hi everyone, Thank you so much for the support. I'd also like to take this chance to appologise for offending anyone, I was really panicking and freaking out but that was no excuse to be insensitive to other people's situations and for that I'm sorry. I had my appointment on Wednesday and was told the biopsies they took last week, from breast and lymph node, were all negative for cancer (mega relief). I still have DCIS and it's pretty wide spread so they want to go ahead with a mastectomy. First, though, I have to go for a sentinel node biospy to make sure, if there are micro cancers, it hasn't spread to lymph, so I guess I'm not out of the woods yet. I forgot to ask while I was there how often they get positive SNB when initial core biopsies were clear, anyone know? I asked about having a bilateral mastectomy but was told I need to speak to the psychologist first, and try and get seen by the geneticist for testing. It seems they might be reluctant to do both sides but I feel like it might give more peace of mind. If it happens in the other breast it might be invasive before I even notice it.",
      "MessageIndex": 10,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51549/new-and-scared",
      "Title": "new and scared..."
    }
  ]
}