{
  "AuthorID": "Bobs4cfc",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bobs4cfc",
  "Posts": [
    {
      "AuthorID": "Bobs4cfc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bobs4cfc",
      "Content": "I know this is an old post but I am in a similar position although different. I am due to have my last chemo 6th July. My consultant wants me to have my operation around 5 weeks later however I have my holiday (which was booked before diagnosis) during this time and tbh I need this holiday mentally and emotionally and for my children this is what has had me getting through all of this. If I do the surgery after I get back it will be 9 weeks from last chemo. Is this too late with TNBC? My breast cancer nurse is saying the 3 weeks difference may have the cancer spread although MRI shows tumour has disappeared.  I'm adamant I'm going on this holiday. How long did you have ur op after chemo and will the 3 weeks really have it come back or spread? xxx",
      "MessageIndex": 18,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107774/delaying-radiotherapy-for-a-few-weeks---could-it-be-detrimental",
      "Title": "Delaying radiotherapy for a few weeks - could it be detrimental?"
    },
    {
      "AuthorID": "Bobs4cfc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bobs4cfc",
      "Content": "Insurance will just refund costs (I only have flights booked as staying with family) so will not be able to afford new flights plus the holiday will have to be completely rescheduled then and no available time as will then have to do radiotherapy so we are looking at November etc and that's not a summer holiday x",
      "MessageIndex": 22,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107774/delaying-radiotherapy-for-a-few-weeks---could-it-be-detrimental",
      "Title": "Delaying radiotherapy for a few weeks - could it be detrimental?"
    },
    {
      "AuthorID": "Bobs4cfc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bobs4cfc",
      "Content": "The cost moving the holiday is just too much. This holiday was booked before and when I have seen how much cancer has effected my girls to then turn around and say no holiday will just make them even worse. I understand what you are saying but what if I do stay have the surgery and still the worse happens I have no memories with my girls or they with me. Before I started chemo I spoke with surgeon consultant and explained about the holiday said I was adamant I was going sgevsaid she would make that a case and if anything may mean an extra chemo - now this isn't an option. Just feels like they tell me what suits them xx",
      "MessageIndex": 20,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107774/delaying-radiotherapy-for-a-few-weeks---could-it-be-detrimental",
      "Title": "Delaying radiotherapy for a few weeks - could it be detrimental?"
    }
  ]
}