{
  "AuthorID": "Bongo 56",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
  "Posts": [
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I find the CiPLA brand suits me. I haven't gain weight but loosing it seems even harder than pre Letrozole days.",
      "MessageIndex": 13,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82168/letrozole-are-dreadful",
      "Title": "Letrozole are dreadful"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I don't think the full impact has really happened for me and I have completed my treatment. Chemo, mastectomy and rads and now on hormone tablets. Like your wife I have appeared strong all the way through my treatment and I am sure it helps. It certainly isn't 'business as usual' throughout treatment ( or after) but feeling positive did help me. With your support your wife will be able to work her way up the mountains she needs to climb. This is a great website with loads of support. She will need some pjs that button down the front for hospital and for duvet days that she is bound to need. Don't feel shy about asking for help, your friends will be more than happy to know they are doing something to help. My favourite help was friends calling in for a drink and natter, hubby always said he loved to hear me laughing when they visited. When your wife feels up to joining us she will find support and answers to her questions from those of us who already have that Brownie badge and others who are at a similar stage in their journey so they can support each other. I know it is really early but do look at booking a place on the Look Good Feel Better sessions ( see discussion post) they are fantastic and the goodie bag is great too. Take care",
      "MessageIndex": 3,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72268/nervous-huband",
      "Title": "Nervous huband"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kiera. One of my toe nails went ping after 12 months and my fingernails are brittle at the ends. This is probably the last of the chemo nails and the new growth is looking strong and healthy. I used dark polish throughout chemo on fingers and toes and still have them painted - this is my treat to myself! I also have had a couple of bald patches above my ears and thankfully hair is growing back there too! Take care",
      "MessageIndex": 2,
      "PostDate": "22/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81669/16-months-post-chemo-and-still-nails-coming-off",
      "Title": "16 months post chemo and still nails coming off"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Here are 7 ways to recycle those no longer needed bras.  In the past I have sent mine to the address in Shropshire.  Can anyone add to this list? http://myzerowaste.com/2010/04/seven-ways-to-recycle-your-bra/",
      "MessageIndex": 0,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74819/recycling---bras",
      "Title": "Recycling - Bras"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi DeeDee. I take cocodamol ( and a laxative!) for pain relief. My friend is a distric nurse and she told me to be careful with ibrubrufen (Woops not sure on spelling) as it can cause ulcers and she said to always take it with food. My GP has given me an ibrubrufen gel that I apply directly to the areas of pain. This works well. I try to use my hands as much as possible to stop them seizing up, I find knitting helps to keep my fingers supple. Take care",
      "MessageIndex": 12,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72370/letrozole-and-side-effects",
      "Title": "letrozole and side effects"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi it all sounds normal and it is very early days. Mum will have a follow up appointment with her surgeon soon. If too much fluid builds up and becomes painful it may need draining. Again this is quite normal and being left with as little moob whilst the Seroma drains itself by slowly re plumbing the lymph system. I had my mx in October , tell Mum to do her exercises religiously especially if rads are her next treatment as she will need to be able to raise her arm above her head during the zapping. Soft vests are great. Personally I prefer to wear soft bras and camisoles that hold a falsie rather than a bra as I still find them uncomfortable after a few hours. Hope my ramblings help. Take care",
      "MessageIndex": 1,
      "PostDate": "06/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77820/post-masectomy---skin-puckering",
      "Title": "Post Masectomy - Skin Puckering"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have had Teva for about 4 months and I have the usual aches and flushes but they are manageable. Next month I have a different brand. Sandoz. I usually collect 2 months worth at a time but asked for 1 month and an IOU in case I don't get on with the new brand. In the last week or so my wrists have become a lot less painful so perhaps my body is getting used to the tablets. - who knows? It will be interesting to see which brands are more 'comfortable' I like the Teva as they come in a calendar pack with days written on.",
      "MessageIndex": 9,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72370/letrozole-and-side-effects",
      "Title": "letrozole and side effects"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Yvonne. Have you ever belonged to a slimming club? Think of it like a bad day of a diet and the leader will tell you to put the day behind you and start afresh in the morning leaving the baggage behind. We all try to be so brave that eventually something has to give and today was that day for you. You may well find that after this little blip your family will understand more about how you feel and may make future discussion easier. I've got all the Brownie badges and still don't think of myself as being ill I'll keep taking the Letrozole and practice the everything's fine face! Do you meet up with other forum members? I can't recommend it enough. Our little group is growing in number and we surprise ourselves with how much we have in common with each other. Chin up tomorrow you will be posting supportive messages for another member. Big hugs",
      "MessageIndex": 6,
      "PostDate": "05/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77773/very-very-bad-day",
      "Title": "Very very bad day"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Gill Welcome to the forum nobody want to join. You are at the hardest part - the waiting and the unknown. I started chemo on my birthday and rather than feeling down it felt good to 'get started' I have had chemo, mastectomy and starts rads in a few weeks time. I am now taking Letrozole so am on a similar path to you. Feel free to ask any questions you will get honest and supportive answers from your new friends. The best advice is listen to your body and keep well away from google! And I forgot remember to spoil yourself with little treats ( or big ones) Alison🎀",
      "MessageIndex": 4,
      "PostDate": "23/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67494/just-diagnosed",
      "Title": "Just Diagnosed."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi. I had a mastectomy last October. It is not a painful procedure so long as you don't over do it when you get home. My scar is very neat, I think my surgeon must have come top of the class in needlework! I didn't have immediate reconstruction and don't think I will have a reconstruction, but, will see how I cope in the summer when wearing less clothing. Take care",
      "MessageIndex": 18,
      "PostDate": "13/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74945/feeling-so-down",
      "Title": "FEELING SO DOWN"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "At long last I am off to see some sunshine!  I have adapted 2 of my 'normal' costumes to take my prothesis.  I did buy a special piece of fabric that cost £6.50 then decided I could adapt one of my soft sports type bras.  I have cut the cup part from the bra and sewn it into my costume - fingers crossed it works!!!!! To everyone on the chemo journey - I was at that stage last year - no hair, no holiday, no sun with out slapping factor 50 all over me.  The year does got quickly and soon it will be your turn. Portugal here I come...",
      "MessageIndex": 0,
      "PostDate": "19/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79900/swimsuit",
      "Title": "Swimsuit"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have just bought an Amoema prosthesis from eBay I paid under £40 for. £135 prosthesis (new). If you go on the Amoema website there is a chart where you can use your bra size to work of what size prosthesis you will need. They also offer a sample testing service. They are based in Southampton and I have I friend nearby who has invited next to stay with her and she will take me for a private fitting. Good luck",
      "MessageIndex": 24,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75715/prosthesis-after-lumpectomy",
      "Title": "Prosthesis after lumpectomy"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Well done! and you've managed to look at your scar! it took me a while to look at mine - hubby was expecting a huge circular cut!  like you I have all my lymph nodes out so scar runs to my armpit - it looks really thin and neat - hope yours will heal as well as mine.  Make the most of being spoilt - don't recover too soon.   My surgeon told hubby no housework for me for 5 years! his face was a picture!!!!!  SHE has a wicked sense of humour.",
      "MessageIndex": 2,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71440/had-my-mastectomy-today",
      "Title": "had my mastectomy today"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Emma There is very little to worry about pain wise, remain blasé I had my MX in October and had very little pain. The nurses will probably ask you to rate your pain on a scale of 1-10 and this will determine the pain relief they offer. Remembering to carry the drain around with you is the most frustrating part ( take a bottle shaped gift bag with you to the hospital to make it easier to move about) getting comfortable at night may take a few experiments, there have been previous discussions about heart shaped pillows. Compared to a c section and hysterectomy this operation is no where near as painful.I hope you remain calm and surgery goes well. Treat yourself to some new soft front fastening pjs that will be easy to remove whilst you regain your mobility. Take care Alison🎀",
      "MessageIndex": 6,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Emma. The drain bottle always needs to be below your wound as my hubby reminded me when he found I had placed mine on the bedside table so I didn't need to bend down and pick it up! School girl physics went out the window. I had also been hanging it on my drip stand in hospital and the nurses didn't notice/ realise. This op much wpeasuer than c section and drain much easier to look after than a screaming baby! Alison",
      "MessageIndex": 8,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have just bought an Amoema prosthesis from eBay I paid under £40 for. £135 prosthesis (new). If you go on the Amoema website there is a chart where you can use your bra size to work of what size prosthesis you will need. They also offer a sample testing service. They are based in Southampton and I have I friend nearby who has invited next to stay with her and she will take me for a private fitting. Good luck",
      "MessageIndex": 9,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75715/prosthesis-after-lumpectomy",
      "Title": "Prosthesis after lumpectomy"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Binny. Whatever it may be you are having all the necessary tests, a poster earlier this morning was told by her GP to wait and see! Don't over think, easier said than done I know but with these tests you will have a very thorough check of your whole body _ this will help you to stop worrying every time you have a twitch or twinge. Will be thinking of you, these scans are very sophisticated, I saw my skeleton projected on the wall, I looked nice and slim! Chin up, don't let your imagination run riot. Bones are classed as very treatable - last May I couldn't get out of bed or dress myself without support, after chemo and Letrozole I am managing to do so much more and this month have returned to my role as Brown Owl!",
      "MessageIndex": 7,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70597/need-some-help-here-girls",
      "Title": "Need some help here girls...."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi. Hang on in there and keep doing exactly what you are already doing. I remember feeling like I had a hangover without the fun of the previous evening! I couldn't be bothered to read, hubby would offer me the newspaper and I felt my eyes couldn't be bothered to focus - I was due for an eye test but had read to wait until chemo finished, presumably fuzzy eyes go with a fuzzy brain. When you do start to feel better don't start doing too much, use this time to let your body prepare itself for the next session. You next target is to make sure your blood test shows you are fit for treatment no 2. I used to be a very busy person with lots of commitments, since the start of my journey I have looked at what is important and have started to put myself first and what was hardest of all was asking for help. My friends have been fantastic. Keep up the good work. I always felt better once I had taken my last steroid. Hope this helps. If all else fails play candy crush! ( see silly o'clock)",
      "MessageIndex": 3,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70771/headache-afterfec",
      "Title": "Headache afterFEC"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Wow Gill that sounds a lovely idea and presumably the drain stays with you I had to remember to pick my bag up every time I moved. Got in quite a pickle when I got up from the swivel chair without the drain! Alison",
      "MessageIndex": 10,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Anne. Emend seems to be the Rolls Royce of anti sickness drugs. They come in a pack of three, you take first one an hour before chemo and the others on days two and three. I then went on to domperedone on an as and when needed - my nurse said that sickness was not compulsory and only to use the domperedone if needed rather than take 3 per day. Just a thought - I used to get soooo constipated in first few days and wonder if that could be linked to the headaches? Might be worth trying prune juice, fresh oranges, figs... Then don't go far from a toilet!",
      "MessageIndex": 7,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70771/headache-afterfec",
      "Title": "Headache afterFEC"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Ruby It is interesting to see differences in where we are all treated. I had a mastectomy on 19th October, started Letrozole the following week (slight risk of clotting so didn't start before operation). My rads will start on 10th December and if all goes to plan will be finished before the New Year. I am now on week 5 of the Letroxole and am finding my wrists feel stiff first thing in the morning. I am hoping that no more side affects will appear. Good luck with the decision making Alison 🎀",
      "MessageIndex": 9,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66700/further-surgery-for-wider-margins-and-more-lymph-nodes-to-be-removed",
      "Title": "Further surgery for 'wider margins' and more lymph nodes to be re"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Emend is brilliant. I ended up with some spare tablets and when I asked about disposing my oncologist told me they were VERY expensive! This may be the reason some people are not given then. However, knowledge is powerful, so go ahead and ask for them. Ideally do this in advance of your next treatment as the first one needs to be taken an hour before chemo. Hope this helps",
      "MessageIndex": 5,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70771/headache-afterfec",
      "Title": "Headache afterFEC"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Lizane I felt exactly the same as you have described, in fact my feet and legs were so swollen I had to go out in my slippers as I could not get into any of my shoes. My red blood cell count was low when I had my mx 6 weeks later and I ended up on a course of iron tablets so that might be worth asking about. This is just another step in the process and now 3 months later all I have is the pins and needles in my fingertips and that is getting better every day. I hope you are soon noticing an improvement in these side effects. I'm sure chocolate is a good source of iron? If it isn't it will make you feel good anyway! Or maybe a glass of Guinness? Hope it helps knowing that it is 'normal' to feel like this Take care Alison💝",
      "MessageIndex": 4,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69107/is-this-normal-chemo-is-over-but-3-wks-after-and-feeling-worst-than-during-i-think",
      "Title": "Is this normal.... Chemo is over but .. 3 wks after and feeling worst..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Have you tried a variety of different manufacturers? It is the coating ingredients that seem to give the side effects .. I have found a brand of Letrozole that suits me ( CiPLA) in fact I am now worrying that it isn't working as I have very few side effects! You can't win!!!!!",
      "MessageIndex": 3,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78713/anastrozole",
      "Title": "Anastrozole"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kath. It is probably the steroids, I remember having to take what seemed like a huge number of tablets with Taxotare doses. Sleep when you can. I remember being wide awake in the night, I downloaded the Daily Mirror app it is free Monday to Friday and is uploaded at about 5 am each day. Candy crush is another popular time waster that I discovered via this forum, some members are on spectacularly high levels in the game. I can assure you that it will get better, so, sleep when you can and try taking the steroids earlier in the day. Take care",
      "MessageIndex": 2,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74412/can-t-sleep",
      "Title": "Can't sleep."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I waited 6 months before using permanent colours and all went well. Good luck it does sound lovely to say \" I'm going to the hairdressers!\"",
      "MessageIndex": 2,
      "PostDate": "18/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78407/hair-colour",
      "Title": "Hair colour"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Alfieval. I had mx with full node clearance. I didn't have any problems pain is minimal and easily controlled with regular painkillers. Within 2 weeks I was driving and took my daughter to Birmingham to watch Disney on Ice. Please don't add extra worry about things that may not happen to you. Plan a few treats for yourself - a spot of retail therapy maybe? Some new pjs that button down the front, soft vest tops or soft bras will all be needed after your operation. Just think after your op the little blighter will no longer be with you ! Stay positive and don't worry about things that may not happen. This is only a short period of your life, albeit a not very nice part. Last year was hard but now I'm planning my summer holiday, I'm back at work part time and I've discovered just how many great friends I have. Take care",
      "MessageIndex": 25,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kelly Wow you manage to keep your wig on for longer than I manage. After a few minutes I used to give up and revert to a soft headscarf or hat. Now I have a full covering of silver ( not grey\") short hair I am happy to go out without any covering up. In fact I love having short hair and don't plan to grow it as long as I used to wear it ( shoulder length bob). I can assure you you will not be stared at, in fact my hubby loves my new style. If it's good enough for Jessie J it's good enough for me! Give it a try, you will find it really does help with the temperature control. I finished my chemo 2nd September and only have a few pins and needles in my fingers now, even this is getting better daily although I still struggle with buttons on my blouse. I remember thinking why should the side effect seem to be getting worse now I have finished chemo! Good luck Alison",
      "MessageIndex": 8,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69107/is-this-normal-chemo-is-over-but-3-wks-after-and-feeling-worst-than-during-i-think",
      "Title": "Is this normal.... Chemo is over but .. 3 wks after and feeling worst..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi alfieval. After struggling with the excercises given to me buy the physio ( standard ones as per Breast Cancer Care leaflet) I asked for some gentler exercises I could do on on my bed. These are so much easier and I have gained loads more movement in my arm. Remember if you don't ask you don't get! Hope this helps. Take care",
      "MessageIndex": 19,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Joanne and welcome to the group none wants to join. You have found the right place for support, up to date knowledge and information, friendship and most importantly a place to let of steam with friends who really do know what you are feeling. The start of the journey is the hardest, it's a bit like riding a bike it's starts with a few wobbles before you quickly learn to peddle up hill. You will get lots of replies from forum members that are at the same stage as you and corn others who have completed treatments. Just a couple of tips always say yes please when help is offered people want to be useful and don't not use Google it is not the place to go searching. Take care sounds like a good excuse to treat yourself you some new pjs! Take care",
      "MessageIndex": 2,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Alfieval. Feel free to friend me. I hope I give practical and positive support on this forum. I have had a hysterectomy and Caesarian section and can assure you a mastectomy with full lymph node removal is virtually pain free. Discomfort yes but there are lots of helpful tips on here. Someone suggest a heart shaped pillow to use at night. I have grade 4 with secondaries in my spine and almost all of my lymph nones were affected. If you met me today you wouldn't know there was anything wrong with me. In fact someone told me I look about 46 - not bad considering at 58 I'm only 3 years young than their mother! Keep smiling it can be done and is easier to do with a smile on your face. Do you have Facebook? If so look for Little Daisy Mae. Her father has reported on her daily progress when she was born at 25 weeks weighing less than 2 pounds. It is very humbling to see the weeks of heart ache they went through. Take care and the kettle is always on at my house",
      "MessageIndex": 36,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "",
      "MessageIndex": 3,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69107/is-this-normal-chemo-is-over-but-3-wks-after-and-feeling-worst-than-during-i-think",
      "Title": "Is this normal.... Chemo is over but .. 3 wks after and feeling worst..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Mudge. Yes chemo is very doable. The D is Taxotare that I took for 3 cycles, it isn't fun and the effects can take a while to work their way through your system. I am assuming the other drug is the C in FEC. To up your survival by 5% with chemo sounds worth the treatment. A bit like dieting \" no pain no gain\". Good luck with the decision making",
      "MessageIndex": 1,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71070/chemo-decision-yes-or-no",
      "Title": "Chemo decision. Yes or no?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "During my radiotherapy session I had an appointment with the lymphoedema specialist. He told me to make a visual check of both arms by holding them in front of me and starting and the wrist compare each arm for difference in size. You would expect your dominant arm to be slightly larger. He then told me I could self refer at any time I became concerned. I would suggest you act sooner rather than later as what you are describing sounds like the checks he told me to carry our before referring myself. Hope this helps. He also gave me a few simple exercises to pump the arm to improve circulation. Take care",
      "MessageIndex": 2,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77970/swelling-of-arm",
      "Title": "swelling of arm"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Sorry should say I have previously uploaded a copy",
      "MessageIndex": 5,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77970/swelling-of-arm",
      "Title": "swelling of arm"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Maggie I think you may find a copy of the leaflet I was given by the hospital ( or George if you smile sweetly at him,) Basically whist grasping and ungrasiping your fist raise and lower your arm from your elbow, this works like a pump for the circulation. Hope it helps. Xxx",
      "MessageIndex": 4,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77970/swelling-of-arm",
      "Title": "swelling of arm"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi  Just think - in less than 3 weeks time you will have finished your chemo.  A few tears and tantrums are part of the treatment.  I am sure you will emerge from your bedroom with a smile on your face - we are so go at pretending the the world that all is well.  Either that or you will become the Candy Crush champion if you hibernate for the next few weeks.  Sending you a big hug  xxxxxx",
      "MessageIndex": 1,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74817/can-t-stop-crying",
      "Title": "Can't stop crying"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Yes it is possible BUT very much depends on what you do and how well you cope with the chemo. My consultant told me about a city banker she treated. She has her chemo on a Thursday and took 2 days holiday returning to work the following Monday. She had a wig in same style as her own hair and nobody knew she was having treatment. However, that is probably an extreme example. I managed to work from home for a few hours on 'good' days. I think you need to rest as much as possible during chemo, your body has a big fight ahead of it and you need to work with it by sleeping, resting eating and drinking lots of water. Hope this helps",
      "MessageIndex": 1,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78116/chemotherapy-and-work",
      "Title": "Chemotherapy and work"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Nanny Mary   So please you have perked up a bit - a full roast cooked for you!  Its amazing what out other halves can do when they put their mind to it!  Mine is a dab hand at the washing - if fact he keeps washing everything in sight!!!! Take care - as my mother in law used to say 'it won't always be dark at 6' - quite apt with the recent clock change",
      "MessageIndex": 5,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74817/can-t-stop-crying",
      "Title": "Can't stop crying"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I live in Stourbridge and have started my journey at Russell Hall Hospital. My consultant is fantastic. I have just finished my 6 rounds of chemo and am due to see her tonight to discuss the next step in my treatment. I have found this forum so supportive and hope that I a, now in a position to offer support to others who are behind me on this journey Take care Alison",
      "MessageIndex": 8,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "My next step is mastectomy in 6/8 weeks time subject to the results of my MRI scan as I have secondaries in my spine. Seeing the oncologist on Tuesday so will know more then. My consultant is lovely, I have every faith in her. Take care Alison",
      "MessageIndex": 10,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Wow that was super efficient! Now you need to enjoy the New Year celebrations and try and put the appointment at the back of your head for the next week. Whatever you do keep well away from Google, it is not your friend! I know both pieces of advice are hard to follow, but, you have taken the first step now and don't have very long to wait for your appointment. Take care Alison💝",
      "MessageIndex": 12,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69051/nervous-for-my-tests-on-tuesday-trying-too-keep-busy",
      "Title": "nervous for my tests on Tuesday. trying too keep busy"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg. I will be thinks of you tomorrow. With your great sense of humour I'm sure you will make the ward lively. AND when your \"young men\" come to visit you will have all the nurses fussing around you. Take it easy, make sure you are given your physio exercises before you are discharged. The best bit is you won't need to worry about comfy bras! Love and hugs. Xxxxxx",
      "MessageIndex": 5,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75024/op-day-tomorrow",
      "Title": "op day tomorrow"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have had a couple of mastectomy related bargains from ebay. I paid £4.99 including postage for a brand new Amoena summer dress with built in shelf bra with fitting for a falsie/s.  I have looked on their web site and the current equivalent dress is around £50. I also manage to find a falsie for swimwear and a new prosthetic boob that is a better fit than the one I was fitted with at the end of last year - that was £35 rather than £135.   The day I went for my fitting I was rather silly really - I didn't realise I needed to take a bra with me - I was still wearing soft vest tops! AND they cancelled the clinic but forgot to phone me so I sat waiting for over an hour before they realised and went to find the BCN who was covering on the ward as they were short staffed. I love ebay! has anyone else had any bargains?",
      "MessageIndex": 0,
      "PostDate": "09/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76450/ebay---bargains",
      "Title": "ebay - bargains"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Perhaps the doctor mention you would be seen within a week, it is supposed to be a rapid response. The speed could be that the unit is quieter over the holiday period. Be thankful you took the phone call my hospital gave hubby my message and I hadn't told him anything! Alison",
      "MessageIndex": 19,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69051/nervous-for-my-tests-on-tuesday-trying-too-keep-busy",
      "Title": "nervous for my tests on Tuesday. trying too keep busy"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Katy There is nothing to worry about. The machine is only interested in your chest area and feels like you are in a donut. It's the MRI that encloses you. Thinking of you. Radiotherapy is very manageable the travelling is the tiring part. My hospital gave me a voucher so I only needed to pay £1 parking charge each day.",
      "MessageIndex": 2,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74485/ct-scan-for-planning-assessment",
      "Title": "CT scan for planning assessment"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Yvonne. You are expecting too much from yourself. It is almost a year since I started my treatment and 4 months since radiotherapy completed my journey ( except for Letrozole and the fun that brings with it). I am still shattered if I do too much. My definition of too much has changed too! I plan rest days where I do as little as possible on other days I plan one commitment only. This is the new me, the old me that dashed from here to there with my finger in lots of pies has gone for ever. What I have learnt is to pace myself, enjoy my friends and rest when I feel tired. Can you knit? I found that really useful as it made me sit down and gave me something to think about. I knitted blankets and cardigans for the charity Preemies UK following an peal by the parents of a very premature baby born locally. She has her own Facebook page. Little Daisy Mae Her dad kept a daily log of her ups and downs it's worth a read it will bring a few tears!!!! And if all else fails there is always Candy Crush!!!!! You are doing so well keep up the good work. Enjoy being a lady of leisure.",
      "MessageIndex": 12,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75880/when-will-i-be-me-again",
      "Title": "When will I be \"ME\" again ???"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "None of my friends have nominated me! My Mum was 80 last week and I organised a small party for her - she asked her friends to give donations for Cancer Research. I opened a Just a Giving page and with the Gift Aid we raised almost £200. My Brownies held a Fund Raising evening this week and they raised another £200. It's good to see Facebook doing something 'good' so much better than the dreadful neck nominate that took people's lives",
      "MessageIndex": 10,
      "PostDate": "21/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73959/selfies-and-donations",
      "Title": "Selfies and donations"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Caroline The mastectomy isn't as bad as you are imagining. I only had 1 drain and I used a bottle gift bag to carry it around in , it might be worth taking one into hospital I had to use a carrier bag I had packed to send dirties home in. Make sure you do your exercises especially if you need radiotherapy as you will need to be able to raise your arm during treatment. Don't let the operation spoil your Christmas! 🎅 Alison",
      "MessageIndex": 8,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67331/chemo-tomorrow",
      "Title": "Chemo tomorrow"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Here is another bargain - summer nightdress with support shelve - brand new - size small http://www.ebay.co.uk/itm/AMOENA-Naomi-Pocketed-Nightdress-Slip-Black-Size-34A-/321397530953?pt=UK_Women_s_Lingerie&hash=item4ad4c92149",
      "MessageIndex": 1,
      "PostDate": "09/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76450/ebay---bargains",
      "Title": "ebay - bargains"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Karen. Where do you swim? It sounds like just the sort of exercise I could cope with. I live in Stourbridge. Hi Flute you have achieved so much in such a short space of time. I suppose it's a bit like you now have time for everything to sink in and the emotions are kicking in. You have certainly been on auto drive for the last year. Time for some 'me time' the kettles always on if you are passing - give me some notice and I will make us some scones with clotted cream. Take care",
      "MessageIndex": 4,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76041/i-feel-so-alone",
      "Title": "I feel so alone"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Thanks Karan It's a bit far to travel for a swim. I will ask around now I know sessions exist. Thanks for responding. It sounds a fun way to exercise and socialise. Take care",
      "MessageIndex": 9,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76041/i-feel-so-alone",
      "Title": "I feel so alone"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Hilary Another of Dr A's patients? I've sent a friend request. It would be good to meet up",
      "MessageIndex": 12,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76041/i-feel-so-alone",
      "Title": "I feel so alone"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Please don't worry yet. If the outcome is not good you might like to friend me. I do have secondaries in my spine BUT I was experiencing back pains that were so bad I could barely get out of bed! Let's hope it is something simple like they have suggested. Take care and try not to self diagnose and keep well away from google. Take care Alison 🎀",
      "MessageIndex": 1,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69954/more-waiting-more-tests",
      "Title": "more waiting. more tests."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Anne Like you I wasn't told about any foods to avoid, however, I went off yoghurts during my chemo  - it is a standing joke in our hour that pudding - yoghurt!  I think it may be the ones with live bacteria that are to be avoided - its a bit like the list of foods to avoid when pregnant.  I have also seen take aways mentioned in previous discussions.  I had a craving for pate whilst on chemo - I bet that was on the to be avoided list too!  It is so interesting to hear all the different guidance given by staff around the country.",
      "MessageIndex": 5,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71109/yogurt",
      "Title": "Yogurt"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Gill I was advised to massage my hand and I did this every time I applied hand cream. By the end of my sessions I needed to use a mild steroid cream as I had some red veins that looked like I was sticking two fingers up! I had my chemo before surgery so had the option to use either hand, but I tried to use my right hand as I am left handed and managed to do this. Hope the next session is easier Alison🎀",
      "MessageIndex": 1,
      "PostDate": "04/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69369/fec-and-sore-veins",
      "Title": "FEC and sore veins"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi jemp. Sorry can't help with natural remedies but hope I can assure you that second FEC will probably be similar to first session, hopefully it. Isn't be better as you will be prepared for the mouth ulcers. I was given Difflam mouth wash this has a mild anaesetic. I was told to use it as a gargle if my throat became sore. I also had Difflam in a spray for sore throats. Hope I have helped to reassure you that round two is doable and you will be armed with the tools to deal with the side effects Take care Alison🎀",
      "MessageIndex": 6,
      "PostDate": "06/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69369/fec-and-sore-veins",
      "Title": "FEC and sore veins"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Chris You are at the start of your chemo so it is bound to be daunting. Have you been given Emend for days 1-3? I understand that it is a very expensive drug, presumably that is why it is only used at start of each treatment. I think the only advice I can give is listen to your body, sleep whenever you feel the need, eat what you fancy and don't worry if you really don't want to eat much. I had some days when I ate very little, on other days I could have eaten the table leg I was so hungry! This forum is a great place to meet new friends who know exactly what you are going through. I have gained my chemo and mastectomy badges and start work on my radiotherapy badge on Monday. Chin up you can do this, you are probably past the worse part of this cycle. Have a look at previous postings for lots of tips. Have you tried pineapple to help with the vile taste in your mouth? Take care, spoil yourself with little rewards ( or big ones) every step of the way Alison💝",
      "MessageIndex": 21,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68377/2-days-into-chemo",
      "Title": "2 days into chemo........."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg There is no 'normal' during chemo sessions. Listen to your body, rest, sleep or housework! If you run out of housework you can pay me a visit!!!!!! It is probably the steroids that are making you hyper, when they finish you will probably feel like sleeping , I used to nap in the day then be wide awake at silly o'clock. I loaded my ipad with the daily mirror ( free) and often read it at 5am, I have never been so up to date with celebrity gossip! Take care, look after yourself, don't do too much, easier said than done at this time of year. Take care Alison💝",
      "MessageIndex": 2,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68297/cemo",
      "Title": "cemo"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Morning Andrea. Someone came with me to each chemo session partly for company and mainly as a second pair of ears and eyes. I had mx after chemo then rads 6 weeks later. I drove myself to these appointments, it was about a 45 minute drive each way plus allowing extra time to find a parking space at busy times! ( early morning appointments are best if you can cope with the early start). In my area we have a charity that will drive you to these appointments so that might be another possibility for you to explore. Rads is by far the easiest part of the journey especially if you can rest after each session. Hope this is helpful",
      "MessageIndex": 1,
      "PostDate": "16/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81324/driving",
      "Title": "driving"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I had a great afternoon at this session - it took months of waiting but was well worth the wait - I came out of the room looking 10 years younger!   Each goodie bad is matched to your skin tone and we had 3 beauticians demonstrating and helping us with the 12 steps to making us beautiful.  The how to make eyebrows look realistic was very useful.  Benefit is about to launch a new eyebrow range as they are now one of the new sponsors of this charity - will investigate and report back next month. My daughter has her eye on the perfume! Dorothee watch this space I am going to try and sell it on ebay to boost your sponsorship money for you Moon Walk. Here is the link to find your nearest location: http://www.lookgoodfeelbetter.co.uk/workshops-and-advice/dates-and-locations If you are fortunate to live near several locations you may find a centre with a shorter waiting list. I was fortunate to share this experience with a great friend I have made through this forum - Happy Birthday Gillie B   Would you like to see my before and after pictures?",
      "MessageIndex": 0,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71850/look-good-feeling-better",
      "Title": "Look Good Feeling Better"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Here are the before and after shots.   For anyone wondering about hair regrowth - I finished my chemo FEC T on 2nd September I lost it very quickly (after 1st FEC) but it did start to grow a few wisps whilst on the Taxotare.  Last onto I had my first trim to tidy up around my ears and back which the hair dresser said was groaning back better than the top.  When I looked at the floor I was expecting to see a few stry hairs, however, she had quite a pile of trimmed hair.  I have gone from mousy blonde to silver grey and now have some curls behind my ears, I have had 'stair rod'' straight hair all my life - who knows a pair of straighteners may be on my birthday list. My daughter has coloured my hair with a 6/8 wash colour (£2.59 from Home Bargains) and I am pleased with the results although it doesn't last long as I don't bother with a shower cap so it gets washed every day. I'm going out for a meal tonight so am going to try my new make up skills and get dressed up - hubby will think he has a new woman!              Your turn next Gille B",
      "MessageIndex": 11,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71850/look-good-feeling-better",
      "Title": "Look Good Feeling Better"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Thanks Kammy - my daughter commented on how happy I looked. Enjoy the session - unless you want to be 'the model' don't sit at the top of the table! Alison",
      "MessageIndex": 14,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71850/look-good-feeling-better",
      "Title": "Look Good Feeling Better"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi smitten. I am the same age as you. I had a works pension that I have cashed. I now have a lump sum and a monthly payment. Anyone over 55 can cash in a private pension. I might not get as much as I would when reaching retirement age but need the money now and my financial adviser found me a better scheme where my daughter will benefit on my death as well as my hubby. Not a cheery subject but it has been a great help as I can't work as much as I used to before cancer struck. Hope this helps",
      "MessageIndex": 9,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74315/returning-to-work-and-it-isn-t-the-same",
      "Title": "returning to work and it isn't the same"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "How kind! short of baking you a cake they did you proud!   Hope you are going to use your new skills to make yourself beautiful for tonight's celebratory meal. Enjoy the rest of your Birthday",
      "MessageIndex": 2,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71850/look-good-feeling-better",
      "Title": "Look Good Feeling Better"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "This is a hard call. As you are staying in this country I would suggest discussing this with your BCN or oncologist. A holiday may be just what you need as something to look forward to. So long as you listened to your body and rest/ sleep when you need to. The trouble is we all like to be super woman, however I would think if you promised to let your family wait on you hand and foot you would probably cope with the holiday. Until you have started your chemo you won't know how you are going to cope. My surgeon told me about one of her patients who travelled to the West Mids on a Thursday for her chemo, took the Friday as holiday and returned to her high flying post in the City on the Monday and nobody knew she was having chemo! Well I think my rambling is really saying we are all different in how we cope. A holiday as a short term goal sounds good. Presumably if you and hubby didn't go at the last minute everyone else would still go and occupy the cottages? Take care Alison💝",
      "MessageIndex": 2,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69290/holidays-during-chemo",
      "Title": "Holidays during chemo."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "It could be the nail varnish - could you try it on a family member to see if they have discolouration after using it?   Alison",
      "MessageIndex": 2,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70216/yellow-nails",
      "Title": "Yellow nails"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Anne The best advice is listen to your body, sleep when it tells you to no matter what time of the day. Please think about your health before your school. I have been a chair of governors for too long so know how hard and dedicated head teachers are. This could be a good development opportunity for your deputy? The other advice is to keep away from Google and paint hand and toe nails black - you will find lots of info re this on previous posts. Your pupils will think you have become a goth! Take care Alison💝",
      "MessageIndex": 6,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69169/back-to-work",
      "Title": "Back to work?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kim  I was given Difflam mouth wash and told to gargle with it if my throat felt sore.  You can also buy it as a throat spray - I find it really good an use it as soon as my throat feels dry.   I think it is a case of eating as little and often and accepting the fact that everything is going to fast like cardboard for a while!  Chin up as everyone says this is doable and chemo is be far the worst mountain to climb on this journey!   Not much consolation now but like childbirth you forget the bad bits!!!!! Take care",
      "MessageIndex": 5,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71735/first-chemo",
      "Title": "First Chemo"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Oh dear this is a viscous circle - the more she worries the less likely it is to lower!  In the scheme of things a week is neither here not there.  Some surgeries loan blood pressure machines - perhaps taking at home when she is relaxing may give a better reading? Big hug for Mum",
      "MessageIndex": 1,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71853/mom---surgery-date",
      "Title": "MOM - Surgery date"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "The scan results this time round are probably for the surgeon - is Mum having a mastectomy?  Her main results will come after the mastectomy.  Don't get too worked up about this operation.  Pain control is fantastic and easily managed - I was given a self administering pump so I was able to give myself a dose whenever I felt I needed it. On a practical level it would be good to make sure Mum has front opening nighties / PJs and for when she comes home.  It is now 5 months since my operation and when I am really tired at the end of the day it is an effort to get clothes off from over my head. Wish I could give Mum a big hug and reassure her she is going to be fine.",
      "MessageIndex": 3,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71853/mom---surgery-date",
      "Title": "MOM - Surgery date"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Amazon have a selection of books for children to help them deal with cancer in a parent or themselves. Some have the Look Inside facility there is one call something like the hare who lost their hair it is written by a BC survivor who has a three year old when she was diagnosed. There are books to suit early years to teens. I hope this is helpful. I have started it as a new thread so that any suggestions are easy to locate. I hope this is helpful. Alison",
      "MessageIndex": 0,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70322/books-to-help-children-understand",
      "Title": "Books to help children understand"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I used dark colours including Prussian blue - my daughter was very impressed with my choices. I found a mobile nail technician who google how to care for nails of cancer patients before she visited me. She also gave me a fantastic pedicure and painted my toenails to match. She suggested I used oil twice a day and gently work into my cuticles ( almond, avocado) . I did not wear open toed sandals all summer to protect my toes. My neighbour lost all his finger and toe nails during his chemo ! Enjoy the'Goth' look. Alison",
      "MessageIndex": 7,
      "PostDate": "20/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64862/before-i",
      "Title": "Before I ........"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Lou. I asked my oncologist and she told me there is no medical evidence to suggest the need to avoid food high in eostrogen. I try to avoid processed foods, sweets and biscuits but have not totally eliminated them from my diet.",
      "MessageIndex": 2,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75728/er-breast-cancer-dairy-or-soya",
      "Title": "Er+ breast cancer, dairy or soya ???"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Maria. Welcome to the group no one wanted to join. Everything is very new and raw for you at the moment and this first part is the hardest waiting for your team to sort you individual treatment plan. You will find lots of help, advice, support and up to date knowledge from 'experts' who are further along this bumpy journey. One important piece of advice. - keep away from Google it is not helpful. Someone is always around to respond even at silly o' clock! Take care, let friends and family help in any way they offer don't refuse any offers of help even if you think you can manage. In the last year I have had so many visits from friends that have helped to keep me cheerful and take the strain from hubby for a few hours. He always says it's good to hear you laughing and joking with your visitors. Take care",
      "MessageIndex": 3,
      "PostDate": "28/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77394/first-day",
      "Title": "first day"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I suppose the holiday periods have made the wait a little longer. Could you phone your GP and ask them to chase your referral and explain your change in symptoms Take care Alison🎀",
      "MessageIndex": 22,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69806/do-docs-play-down-cancer-until-they-get-biopsy-results-or-can-they-tell-just-from-the-scans",
      "Title": "Do docs play down cancer until they get biopsy results or can they..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Wow Christmas has come early!!!!  Great news - I wish my employer had paid my holiday I accrued.  Im back at work and have to take all my accrued leave before Christmas - sounds good in theory but means I can't keep up with all I need to do!!!!!",
      "MessageIndex": 15,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85836/yay",
      "Title": "YAY!!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Anne. You might be interested in my scenario. I have secondaries in my spine and am on Letrozole tablets. My joints ache and I now have a local pain killer cream for this. However after 5 months the side effects are improving slightly. I take Adcal tablets and hate the tutti fruity taste! I also have an injection of demozifab ( think this is the spelling) every 4 weeks to boost bone growth. My oncologist told me this is often given 6 monthly for osteoporosis. This time last year I had very bad back ache and was having physiotherapy, little did I know that this was linked to the lump in my breast. When I started chemo in May I struggled to get out of bed, dress, even get on and off the toilet. As soon as I started chemo my movement improved. The Letrozole tablets are my best hope of keeping the mets contained. So to me a few pains in my joints are a small price to pay. I manage the pain with cocodamol tablets and a laxative to counteract their side effects.... Sounds like the song about the old lady who swallowed a fly!, like me I am sure you will be carefully monitored. Hope this helps.",
      "MessageIndex": 3,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74829/generic-anastrazole---any-brand-better-than-another-and-right-old-moan",
      "Title": "Generic Anastrazole - any brand better than another and right old..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Clare My only child is at university and this morning she set off for her year abroad France this semester and Spain in the next semester. Here university have been very supportive they have said they will pay her fare home when ever she needs to visit me. Her friend was offered similar support last year with train fares to return home each week end. It might be worth him investigating. I finished my 6 rounds of chemo yesterday and see my breast surgeon on Monday to discuss the next steps. This is great site for positive help, support, tips and hugs. I have found many helpful tops and seeing your post made me join as I felt I could add a helpful tip for you. Take one day at a time, spoil yourself with small treats! Alison. 💝🎀💖",
      "MessageIndex": 12,
      "PostDate": "04/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64227/feeling-sad-and-alone",
      "Title": "Feeling sad and alone :("
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "My daughter is an only child like you. She is also having to deal with her university studies which require her to spend this academic year abroad. Grace has told very few people about my illness this gives her the support she needs without the need to make it common knowledge. Give your mum lots of cuddles, remember it is the small thoughtful acts that can mean the most. This site is a great support for you and your mother, here you will find friends who can give you advice based on their experiences. Is mum having chemotherapy? Perhaps you could paint her nails with a black polish ( see earlier discussions) and maybe do yours as well as a sign of your support. You tube is great for learning how to tie headscarves, use make up to fake eyebrows... As you both make your way along this journey you will both discover who your real friends are. Chin up you and mum will make a great team Alison 🎀",
      "MessageIndex": 10,
      "PostDate": "17/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67198/just-been-told-by-mum-she-has-breast-cancer",
      "Title": "Just been told by mum she has breast cancer"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kim My surgeon would not do a double mastectomy, at the time I was upset / peeved, however, on reflection I can see why she refused.  I was fortunate that my MX was on my non dominant side, so have not been too reduced in my mobility whilst recovering. I am not triple neg but am at stage 4.  I think you need to take the advice of your team who will offer you the best treatment plan for your body.  it is early days, take one step at a time, there is still lots of time to discuss options.  I'm coping well with my lop sided body and doubt if I will go ahead with reconstruction next year.  This is a journey that needs taking in small fairy steps - it will still get you to the top of the mountain! Take care",
      "MessageIndex": 3,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70879/should-i-go-for-a-double-mascectomy",
      "Title": "Should I go for a double mascectomy?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I know what you mean about being a control freak - I'm cringing listening to hubby load the dishwasher wondering what he will chip or smash next! then I realise how ungrateful I am and keep my mouth shut!!! (very difficult)",
      "MessageIndex": 6,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70879/should-i-go-for-a-double-mascectomy",
      "Title": "Should I go for a double mascectomy?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Heather Mine is from The Broadway Pharmacy  01384 394856   However, I think they may be having problems sourcing it - I need to call them in the morning Second 'best' is Teva Alison",
      "MessageIndex": 1,
      "PostDate": "14/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79662/letrozole-side-effects",
      "Title": "Letrozole side effects"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "All the advice you have been given is exactly what I would have responded. Tomorrow I will have gained the full set of T shirts. Chemo 3xFEC 3 xTax followed by mastectomy, Letrozole (I'm post menopausal ) and tomorrow is my 15 th session of radiotherapy. I now have monthly injections to strengthen my spine and the Letrozole to limit any further damage. It is all very doable and with a young family you really do need to,accept all offers of help, if you decline people don't always offer again My friend turned up one Sunday and did all my ironing for me whilst we nattered. Neighbours cooked for hubby whilst I was in hospital and another friend will knock the door and take our dog for a walk. This is a great place to be honest about our feelings and a place where occasionally we are told to pull ourselves together and prepare for battle! Just look at your children and that will give you the strength you need. I dreaded my MRI scan, I visualised my daughter's wedding that I intend being around for whenever she finds Mr Right! ( she's 20 so hopefully not for a few years) Take care Alison🌺",
      "MessageIndex": 4,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Thanks for this link. I have been looking for suitable bras as my operation is approaching. I would be delighted to make a donation to McMillan if you would consider posting to me. Alison",
      "MessageIndex": 1,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64538/free-to-a-good-home",
      "Title": "Free to a good home"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I hope Friday goes as well as it can - here are my suggestions: Emend is a great anti sickness tablet - expensive but brilliant - ask if you don't get it prescribed - you need to take the first an hour before chemo Steroids - take the last one no later than 4 pm unless you like being awake all night! Paint your nails black - there are lots of threads in these discussions (fingers and toes) Sleep / rest / listen to your body Ask for mouth wash - I was given Diflam and told it contained a local anaesetic and gargle with it as soon as my throughout felt sore Dont refuse any offers of help - friends may not offer again if you say no first time Pineapple is good for a sore mouth - again lots of links in previous chats Candy Crush - very addictive and good when awake in the middle of the night an ipad or tablet is really useful to while away the hours - the Daily Mirror is free to download on week days and is available form around 5 am No sunshine without factor 50 sunscreen And finally remember you have a great support network here on this site - someone is usually around at any hour f the day or night! Take care",
      "MessageIndex": 6,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74096/chemotherapy",
      "Title": "Chemotherapy"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Chris I have 3 friends who also have this dreaded disease and they are the best people to talk to they know what I am feeling and I can discuss anything with them knowing they understand what I am feeling. Have you been to one of the Looking Good feeling Better sessions? they book up really quickly, I am looking forward to mine in February ( Q E in Brum) and imagine it will give me an opportunity to make more friends. I suppose we have to put ourselves in our family and friend's shoes - what would we feel or say if it were one of them? You have lots of friends here where you can discuss your feelings with people who know exactly how you feel. Take care Alison 💝",
      "MessageIndex": 18,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Rebecca Where would I receive this request? Sorry to sound thick! I have logged in and can't see anything and have not received an email Alison",
      "MessageIndex": 7,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64538/free-to-a-good-home",
      "Title": "Free to a good home"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kim. I have learnt to bit my tongue every time I hear something break when hubby loads the dishwasher or puts my best socks in the tumble dryer! It's weird being bossed rather than bossing! I do have yo day hubby is really good at reading my face. When he tells me I look pale I know it is time for bed! You never know you might like the fuss and attention. My breakfast was laid out for me today as I copped for an 8.30 appointment for my radiotherapy, not much fun with schools back, it took me twice as long to get there today. Never mind last one tomorrow morning and another early start - I don't get up that early to go to work! Take care Alison💝",
      "MessageIndex": 7,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I was told that 8 is the most responsive to hormone treatment, so that is a positive sign.",
      "MessageIndex": 2,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75050/hormone-positive-receptors",
      "Title": "Hormone positive receptors.."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi I had 3X FEC followed by 3X Taxotare. And like you had a variety of side effects including veins in one of my hands. I had my mastectomy 3 weeks ago and it is not a painful operation - presumably veins in your legs could be used if necessary. You might find it useful to increase the amount of iron rich foods in your diet before your operation, my red blood cell count was a little low and they retested me after my operation with a view to giving me a blood transfusion. 'Luckily' I managed to get away with a month's supply of iron tablets. I am now on Letrozole and will start radiotherapy in a few weeks time. I am hoping that all my sessions will be completed by Christmas. As Highland Mum said you have completed the most challenging part of the treatment already I wish you well as you progress on this beastly journey Alison",
      "MessageIndex": 2,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66925/life-after-fec",
      "Title": "Life after FEC"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi You have found the right place for support by joining this forum. You will find some excellent practical advice from 'experts' who are already on this vile journey and others who have completed theirs and are living a new 'normal' life. I wished I has the support from my sister, she fell out with me 17 years ago! A normal healthy diet with lots of fresh fruit and vegetables and avoiding processed foods is a sensible start. Your sister is at the hardest part of the journey - the unknown! Once her treatment plan has been drawn up and she starts her treatment you will both feel relieved that the battle to kill the cancer cells has begun. The best advice that I can give is keep away from google stick to sites such as this one and breast cancer care. Once her treatment has been sorted you will find lots of tips on this forum, it is also a great place for your sister to access when she is feeling low, she will find lots of 'sisters' and a few brothers who will boost her moral. Like your sister my cancer had spread into my lymph nodes. Encourage her to remain positive breast cancer is curable / treatable. Big hugs to you both Alison💝",
      "MessageIndex": 2,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68130/in-shock-supporting-my-sister-how-can-i-help",
      "Title": "In shock, supporting my sister, how can I help?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Karen. I finished my chemo Sept 13 At Christmas I started to you semi permenant hair colours. My hair dresser is now combing through low lights for me and the colour is starting to lift a bit now. I souls suggest asking your hairdresser for their advice. Hope this helps. I have uploaded a picture of my latest cut recently. Take care",
      "MessageIndex": 2,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76660/advice-on-dying-hair-1st-time-after-chemo",
      "Title": "Advice on dying hair 1st time after chemo"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Maggie a while ago I posted a copy of the info sheet / exercises I was given by my hospital's lymphoedema expert. I'm in Portugal at the moment so can't retrieve it for you. I was told to do this exercise regularly throughout the day:- Whilst opening and closing your fist raise and drop your affected arm from the elbow doing this for about 30 seconds each time. I was also told to compare arms side by side as a visual check, your dominant arm should be slightly larger. I hope this is helpful until you get a response from someone who has experienced lymphoedema.",
      "MessageIndex": 1,
      "PostDate": "30/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80438/lymphoedema",
      "Title": "lymphoedema"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Maggie. No I didn't have any swelling mine was due to poor movement and I have been having physiotherapy and now how much more movement and feeling ion my operation side, it's taken months to get this far but feels great now! Have managed a few swims in the pool too without loosing my falsie!!!!!",
      "MessageIndex": 4,
      "PostDate": "31/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80438/lymphoedema",
      "Title": "lymphoedema"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Maggie. Part way through radiotherapy I was given a routine appointment withe the lymphoedema nurse where he showed me the exercises and checks I should carry out. From then on I am able to self refer as soon as I have any concerns. I did make an appointment and he took measurements at various points around my arm and assured me I didn't have lymphoedema but did need physio. Keep going with the exercises until your appointment day.",
      "MessageIndex": 6,
      "PostDate": "31/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80438/lymphoedema",
      "Title": "lymphoedema"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Tracey. I am about to have an MRI and CT scan I already gave secondaries in my spine so this set of tests is to check for any movement. I am no expert but suspect the CT scan looks more at your organs hence the need for a full bladder? Secondaries can be controlled. Feel free to friend me. Take care",
      "MessageIndex": 1,
      "PostDate": "19/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84583/mri-ct-pet-scans",
      "Title": "MRI-CT-PET Scans"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I remember the hunger sessions where I could have eaten the table leg! Chemo is hard on our bodies and minds. Like you I had to be on the go every minute of the day and was determined to carry on 'as normal' but this just didn't happen. Don't fight the chemo you need to work with it and if it tells you to have a duvet day don't feel guilty. It sounds like you have a supportive team around you let them help. It is very hard for our nearest and dearest - there is no support for them, no rule book and sometime whatever they try to do for us it is wrong! My hubby has taken the dog out to keep out of my way as he realises tonight he can't do Anything right!! So remember this is only a very short time give chemo the chance to do its job. You will have days where you don't want to eat anything, I always ate what I wanted when I felt hungry and now 6 weeks after all my treatments I weigh the same as when I started this journey back in May last year. Chin up and remember Candy Crush at silly o'clock isn't for ever. Hope you have some plates left!",
      "MessageIndex": 5,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71965/so-angry",
      "Title": "So angry"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Judi my mx was in October and rads finished in January. I prefer to wear soft bras and change into soft vests early evening. I do wear a 'proper' bra for best!!!!! But defiantly no wires yet. I'm still tender under my armpit. Saw my lovely lymphoedema / radiographer today and he said the tissue will improved but will always be different. There are some fab soft bras around - I have some that have a pocketed lining that enables me to get my falsie inside ( genie bras from BHS or online). Like hair regrowth it all takes time to get back to something like our 'old self' It's still early days and comfort is important. Take care",
      "MessageIndex": 3,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76103/swelling",
      "Title": "Swelling."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg I feel better today knowing I have a start date and it is a bonus that it will finish before the new year. I am thinking of having a party on N Y Day to say good riddance to 2013. Have you got a soft cotton hat to wear in bed? I can hear my Nana telling me to wear a hat as we loose a lot of heat from our heads! I now have a lot of sympathy for bald men who must get very cold in winter. I started a new hobby a few weeks ago - 'comping' and have just discovered I have won an iPad. Not a bad first win! That really did cheer me up. The team at New Cross who scanned and marked me for my rads were lovely and made sure I was as comfortable as possible. Good luck as you make your way along this hateful journey, but, as you see from so many posts it is all doable and side effects listed are not compulsory. Alison. 🎀",
      "MessageIndex": 7,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67373/hospital",
      "Title": "hospital"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Emma I had chemo in May, mastectomy and all lymph glands removed in October and have just completed my first week of radiotherapy. I have driven myself to the hospital every day (45 mins) I have negotiated morning sessions as car parking is a lot easier. The staff are friendly and make the experience as pleasant as possible. I take a short dressing gown rather than struggle with the hospital gowns. I have not had any skin problems ( so far) and have used a cream my daughter bought in France ( Biafine) the radio therapist commented on how well my skin was coping - being fair skinned I did worry I might burn. The travelling is probably the hardest / tiring part especially if you get an early appointment, mine are at 8.45 next week with Christmas Day and Boxing Day off ( I have mores time off when working!) Hope this helps. I also had an appointment to see the physio to discuss how to detect / prevent lymphodaema. I hope your D sessions go well, my feet became swollen and I had to go out in my slippers! Have a good Christmas, hope the taste buds enable you to enjoy your Christmas dinner Alison💝🎅🎄",
      "MessageIndex": 4,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68753/radiotherapy-advice",
      "Title": "Radiotherapy Advice"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "My daughter paid 6 euros for the large tube of Biafine, from the pharmacy in France. I will see how it works out throughout my rads but after week 1 my skin does not look any different to what it was before treatment. I will comment again at the end of my treatment for anyone who may be interested. My hubby is inCornwall with my Mother, he has told her about me and explained why we didn't tell her sooner. After the initial shock she understood my reasoning. What a relief now I no longer have to be careful what I say to her on my daily phone calls. Think of me at my 8.45 am appointments this week, I'm dropping my daughter at the supermarket to do our Christmas food shop whilst I have my treatment. Hope I don't go home without her! Have a good and relaxing Christmas Alison",
      "MessageIndex": 6,
      "PostDate": "22/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68753/radiotherapy-advice",
      "Title": "Radiotherapy Advice"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I used to sleep on my side but have to sleep on my back now. I use pillows either side of me at hip level to stop me rolling over in my sleep. I have been doing this for almost a year now and have trained myself to remain on my back all night. I'm down to one pillow now. The fan we use in the summer time is already in use to help with the overheating during the night. How are you getting on Marg? Bet it's good to be home?",
      "MessageIndex": 7,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75203/getting-better-but-can-t-sleep-at-night",
      "Title": "Getting better but can't sleep at night"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "We are a funny lot! I too am in at zzz because my radiotherapy is being delayed because the CT scanner was fully booked until the end of the week. Sooooo on Monday hubby took the whole morning off work, we travelled to a new hospital after a long wait I had a short chat with the consultant, corrected her as to which side was to be treated, I then signed the consent and left! What a waste of time I could have done that at my last appointment with the oncologist. Like you I threw my dummy out of the pram! Chemo is doable so long as you lists to your body and say yeas please whenever somebody offers help ( even if you can do it yourself). After a good nights sleep I am sure you will be back on track Big hugs go you Alison",
      "MessageIndex": 3,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67373/hospital",
      "Title": "hospital"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg Glad the new day brought common sense. It did to me too. I have now had my scan and tattoos ready to start my rads on 10th December. I won't be finished before Christmas but should be completed before the year ends. Where are you having your treatment! There is so much positive support on this forum, you came to the right place. Alison",
      "MessageIndex": 5,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67373/hospital",
      "Title": "hospital"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Tracey. My GP has given me Phoroain gel it is ibuprofen for areas that ache, for me that is my wrists. Hope this helps you. When I mentioned it to my oncologist she just put it in her notes without suggesting anything to relieve the pain. Take care",
      "MessageIndex": 1,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72939/appt-with-onc-thursday",
      "Title": "Appt with ONC Thursday"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Rebecca. Your lymph nodes work like filters and hopefully they have stopped the nasty critters getting any further. I had all my lymph nodes removed during my mastectomy. Chin up you are doing so well. Tax is probably a little harder than FEC but you will probably find your hair will start to 'sprout'. So in answer to your question yes people do have a good prognosis. Don't panic take this one step at a time.",
      "MessageIndex": 1,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83743/breast-cancer-has-spread-to-nodes-panicking",
      "Title": "Breast Cancer has spread to nodes, panicking"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi littlegem Like you I am almost at the end of my treatment programme. I can hear my phone starting to ping who pith messages for NY already. I am being a party pooper and going to watch MamaMia (again) in bed. If I am still awake by the end of the film I will retire for the night, don't think I can face Garry Barlow wishing me a happy NY. Hope you continue to use this forum, I have learnt and been inspired by many of the regular contributors. Take care Alison💝",
      "MessageIndex": 6,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69165/bah-humbug",
      "Title": "Bah humbug"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "There won't be much hair to let down! I still have more hurdles, the cancer has spread to my spine so am taking Letrozole and will need regular blood tests and scans to check the Letrozole is doing its job. But it is time to party and book a holiday! Alison",
      "MessageIndex": 9,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67373/hospital",
      "Title": "hospital"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Lyndsey-Ann In my teens and twenties I had 3 fibernomas removed and often complained of pain in my breasts. This was put down to mastitis. I did find it was linked to weight gain and took this as a sign to get some weight off. I wasn't overweight but going a little over seemed to trigger the mastitis. I have heard from a friend ( a gynao surgeon) that his wife was advised to wear a Wonderbra to 'cure' her mastitis. This advice was from my breast surgeon who I have great faith in. So... Whist you are waiting for your results why not give it a try! Worrying always makes the pains worse. It's like when a period is late we convince ourselves we must be pregnant. Take care Alison",
      "MessageIndex": 7,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69575/breast-thickening-and-further-tests",
      "Title": "Breast thickening and further tests"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Suzy I am sure this 'news' was a big shock, however, your treatment was planned around your body's needs. Just a quick thought - do you have any insurance policies where you have filled in a family health questionnaire? If so you might need to notify the insurer of this disclosure. Take care Alison 🎀",
      "MessageIndex": 4,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66934/help-new-family-info-has-me-scared",
      "Title": "Help! New family info has me scared"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Toni Have you tried using black bail varnish? There have been a few discussions and useful links on this forum recently. I does seem to protect the nails ( fingers and toes). At bit vampy, but if it works it's worth it, my daughter thought I was quite on trend! Take care and hope you are able to complete your treatment Alison 🎀",
      "MessageIndex": 2,
      "PostDate": "12/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67022/incomplete-chemo-treatment",
      "Title": "Incomplete chemo treatment"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi M65. The only time I had side effects like that was when I has give iron tablets. Black stools is often a sign of too much iron. If the pharmacist suggested contacting your oncologist it might be an idea to go straight to the top! Chemo is unpleasant enough without these added worries. Take care",
      "MessageIndex": 2,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70574/fec---sorry-question-about-piles-and-black-stools",
      "Title": "FEC - sorry...question about piles and black stools!!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I am sorry to welcome you to the club nobody wanted to join. You are at the hardest stage, waiting to know your treatment plan. Try and enjoy your Christmas festivities as much as you can, I know that is easier said than done. The only advice I can give at this stage is keep away from Google. You have found the best place for practical advice and support from people who do know exactly how you feel Take care Alison💝🎄🎅",
      "MessageIndex": 1,
      "PostDate": "23/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68826/shock",
      "Title": "Shock"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Vanessa. Wow you are doing really well, with three young children to care for as well as focusing on your recovery. Do you do the exercises from the sheet given by the hospital? These are designed to get your arm working again. Radiotherapy is fairly straightforward, especially if the hospital is close by. You are right to keep an open mind until you have discussed the options with your oncologist. Take care. Alison💝",
      "MessageIndex": 1,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70227/recovery-expectations-from-mastectomy-with-immediate-reconstruction",
      "Title": "Recovery expectations from mastectomy with immediate reconstruction..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi. Poor you this sounds very uncomfortable. You could try Udderly Smooth cream. I was given some by the hospital (amazon or chemists) it was developed to prevent cow's udders from cracking! It worked a treat on my very dry feet, knees and hands. Hope this helps",
      "MessageIndex": 1,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72274/dry-peeling-sore-skin",
      "Title": "dry peeling sore skin"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I look like I have been potato picking! BUT the oil under the nails has done its job and next manicure will see the end of all the dirty look. You are not very far behind me Caroline so won't be long for you",
      "MessageIndex": 10,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74862/brittle-nails",
      "Title": "Brittle nails"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Karan. Have you tried nail clippers rather than scissors? Sounds like a good excuse to treat yourself to a pedicure? I have been having pedicures since my diagnosis and all nails are firmly in place. I had my chemo last summer and alway made sure my toes were covered over. My neighbour caught his toe and the nail pinged off during his chemo so I decided on the mantra 'prevention is better than cure'. My finger nails looked like I had dirt under them I think it was probably dead skin, my friend suggested I put nail oil between the nail and finger tip. This worked a treat, in fact I am hoping that my next manicure will mean all my horrid chemo affected nails will be gone. I would suggest letting someone else cut your toe nails as I know my nail technician has had to be very careful with mine so they stay put! Hope this helps.",
      "MessageIndex": 20,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74862/brittle-nails",
      "Title": "Brittle nails"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I look like I have been potato picking! BUT the oil under the nails has done its job and next manicure will see the end of all the dirty look. You are not very far behind me Caroline so won't be long for you",
      "MessageIndex": 25,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74862/brittle-nails",
      "Title": "Brittle nails"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Thinking of you, Friday will come round quickly now. You don't have long to wait now. Will think of you on Friday, are you taking someone with you? Please don't read too much, I am sure that one step At a time is the best way to deal with this 'problem'. Take care Alison PS the ipad and this forum are not the best combination!",
      "MessageIndex": 4,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70023/really-scared",
      "Title": "Really scared!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Angela I have just had 6 chemo sessions. The first 3 were with FEC and the worst side effects were the loss of hair and tiredness. In comparison to taxotere, that I have seen described as FEC's 'Ugly Sister', it is manageable. I was able to continue working throughout my chemo ( I was able to work from home and when I felt up to it). I hope my experiences will help you make your decision. Take care Alison",
      "MessageIndex": 1,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65059/to-chemo-or-not",
      "Title": "To chemo or not"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Hope a mastectomy is very doable - it is not a particularly painful operation. So long as you follow doctor's orders and rest when you are tired and do the exercises you are given you will be surprised how quickly you heal. I am now lop sided and coping better than I thought - in fact I can laugh and joke about it.  The other day hubby was getting on my nerves and I told him he was getting on my tits - my 20 year old piped up no he is getting on your tit!!!!!!! There are some very pretty and sensible mastectomy bras, sleep wear and summer tops available and it's amazing how only you will know the difference when you are kitted out with a false! Let us know how you get on ",
      "MessageIndex": 2,
      "PostDate": "17/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72022/getting-masectomy-this-week",
      "Title": "Getting masectomy this week."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Allme. Have a look at Facebook - Julie's Art - baby and children's canvases. She sells her art work on eBay and is always busy with commissions. My great niece Faye is in the gallery once on her own and another with her mummy. I'll stick to my knitting I can't draw for toffees!!!!",
      "MessageIndex": 5,
      "PostDate": "02/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76059/job-v-self-employed-as-shattered-n-stressed-all-the-time",
      "Title": "job v self employed as shattered n stressed all the time!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Karan. Have you tried nail clippers rather than scissors? Sounds like a good excuse to treat yourself to a pedicure? I have been having pedicures since my diagnosis and all nails are firmly in place. I had my chemo last summer and alway made sure my toes were covered over. My neighbour caught his toe and the nail pinged off during his chemo so I decided on the mantra 'prevention is better than cure'. My finger nails looked like I had dirt under them I think it was probably dead skin, my friend suggested I put nail oil between the nail and finger tip. This worked a treat, in fact I am hoping that my next manicure will mean all my horrid chemo affected nails will be gone. I would suggest letting someone else cut your toe nails as I know my nail technician has had to be very careful with mine so they stay put! Hope this helps.",
      "MessageIndex": 5,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74862/brittle-nails",
      "Title": "Brittle nails"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Snap I have been treated by an all female team. Just love the glamours outfits my surgeon wears!",
      "MessageIndex": 11,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82368/did-anyone-else-develop-a-teensy-consultant-crush-during-their-treatment",
      "Title": "Did anyone else develop a teensy consultant crush during their treatment..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Mel. Loosing your hair is such a horrible sign the chemo is working. Personally, I got hubby to shave my hair when I got fed up of finding it on my dinner plate, pillow and stuck in between my fingers when I showered. I think you will be surprised how you look, my hubby said it was very sexy!!!! I spent a lot of money on my wig and wore it about 4 times. It was hot and itchy! Hats and scarves were much easier and topless around the house. A tip I learnt was keep a hat by the front door so you don't shock the postman!!!!!! I found my hair started to sprout when I went onto Taxotare. 12 months after the topless look I now have a neat pixie cut that has been highlighted and I love my new short style. Wishing you well with your decision making. Take care",
      "MessageIndex": 1,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "HiCathy. Have a look on the Amoena website they have sun dresses and tops with built in padded shelf and will take a prosthesis. They are not cheap but are so comfortable. I have bought a scrappy top and wear it instead of a bra as it is so much more comfortable. Have a look on eBay I have had 2 Amoena sundresses for less than £20!",
      "MessageIndex": 2,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76661/tissue-expander",
      "Title": "tissue expander"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Anne. Yes you do need to be very careful in the sun. I suppose that beautiful sunshine in a March is not 'normal' you were not given the factor 50 advice. I had my chemo last summer and didn't venture out without sunscreen, sun hat and covered shoulders as I am quite fair skinned and burn easily. How is your hair? Is the cold cap working?",
      "MessageIndex": 6,
      "PostDate": "21/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73944/sunshine",
      "Title": "SUNSHINE!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have sent a friend request. I have a daughter who is probably similar in age to you (20) and she is an only child so I probably know how you are feeling. Glad you want to do everything to make this ghastly situation as comfortable as possible for you Mum. Once her treatment starts you will feel better know the beast is being tackled Alison",
      "MessageIndex": 8,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67337/is-it-selfish-of-me-to-tell-my-mum-if-my-grandma-she-can-beat-it-too",
      "Title": "Is it selfish of me to tell my mum if my grandma she can beat it too..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Jude Take one step at a time, everyone reacts differently. My best advice is to make sure Mum has lots of rest and you both approach this with a positive 'I can do it' attitude. Mum will be given lots of leaflets to bring home at the start of each stage, they are very informative. Take each treatment as it comes, do your research ( not google) bit at a time. Members on this forum have been a great support for me, I have learnt more from this site than from my oncologist. Alison",
      "MessageIndex": 6,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67337/is-it-selfish-of-me-to-tell-my-mum-if-my-grandma-she-can-beat-it-too",
      "Title": "Is it selfish of me to tell my mum if my grandma she can beat it too..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have members form both sides of my family that had breast cancer BUT this does not mean my cancer is genetic, in fact my consultant told me it was highly unlikely as it would have occurred before I reached 40! I'm fast approaching 60 so she suggests that it is not something my daughter needs to be tested for yet but like all women she should check herself regularly. Take one day at a time and give your Mum lots of love and support, it is great to have a daughter that cares Alison🎀",
      "MessageIndex": 3,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67337/is-it-selfish-of-me-to-tell-my-mum-if-my-grandma-she-can-beat-it-too",
      "Title": "Is it selfish of me to tell my mum if my grandma she can beat it too..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Mo Thinking of you tomorrow. Although it's not a 'Walk in the park' this operation is not painful.  The theatre team will look after you with even extra care.  The anaesthetic  will be fine - one minute you all be chatting to the theatre staff the next 'minute' you will be in the recovery room.  Within hours I was sitting up having a cup of tea and sandwiches.  The nil by mouth was the hardest part!  Bug cyber hugs - you will be fine, let us know how you get on.  Have you got a little bag you can use to carry your drain in?  I used a gift bag meant for a wine bottle.  Others have used over the shoulder bags - saves leaning it behind when you get up to the bathroom!",
      "MessageIndex": 2,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70884/op-tomorrow",
      "Title": "Op tomorrow"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Jude I have sent you a friend request and have not heard from you. Hope things are going well for you and Mum. I am looking forward to seeing my daughter next Sunday it's only a short visit but better than nothing. take care Alison (Bongo 56)",
      "MessageIndex": 9,
      "PostDate": "23/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67337/is-it-selfish-of-me-to-tell-my-mum-if-my-grandma-she-can-beat-it-too",
      "Title": "Is it selfish of me to tell my mum if my grandma she can beat it too..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kiera I wish I could give you a huge cuddle! I am sure you don't look disgusting, beauty comes from within. I have been a member of this forum for the last 6 months and have read many accounts of 'men' running away from our situations. This doesn't make it any easier for you, hopefully in the not too distant future you will look back and think thank goodness I'm not with that ****** any more (use your own adjective). You could talk to your BCN who will be able to direct you to local support groups. You could also find a Looking Good Feeling Better course. I am sure that you will get many replies and tales of similar ******* I had my mastectomy in October and am just about to complete my rads on Wednesday. I have been left with a very saggy boob and for the first time in my life wished I had been less well endowed! just remember there is always someone worse off than you. Hold your head high, you are a survivor and who know what is around the corner... Put the kettle on and have a cuppa, bar of chocolate, or whatever is your favourite comfort food. Then hit the shops a new handbag always make me feel better! Chin up you can deal with this, Alison🎀",
      "MessageIndex": 1,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69415/i-can-t-cope-anymore",
      "Title": "I can't cope anymore"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Stoksie. Letrozole does an excellent job even though it has it's side effects. I would ask for a scan because you are getting yourself worked up and that automatically makes the pain worse. Unfortunately GPs have budgets! Their diagnosis is a bit woolly. I went to my GP with back pain, the first he told me to take cocodamol and it might be shingles. The second time I returned I was told the base of my spine was out of line and was referred to a physiotherapist. When she saw me she immediately said I had the spine of a 70 year old (I am 57) and gave me exercises that were so painful / impossible to do. On the third visit to the doctor I showed her the puckering around my nipple and was referred to the rapid response unit. Unfortunately for me the cancer had spread to my spine. So what I am saying is go with your gut feeling, ask for a scan and this will put your mind at ease. The aches and pains associated with Letrozole are part and parcel of the treatment , however you have noticed a change in the side effects and I think you have given it long enough. I hope my story hasn't made you feel worse but has given you the support to become more assertive with your GP. Take care",
      "MessageIndex": 1,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70575/bone-scan",
      "Title": "Bone scan"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Welcome to the club nobody wanted to join! You have found the right place for advice, support and the occasional rant! We are all such good actors and manage to put on a brave face in front of friends and family when underneath we are petrified. I had my mx in October, it is not a particularly painful operation and the nurses will offer you pain relief. In my hospital they asked me to grade the pain from 1-10 and this determined the medication they administered. Have you been out and bought yourself some new pjs? I chose some soft ones that buttoned up the front for easy access. Take a small bag (gift bag for bottle of wine) to put your drain in when you move around. Some people in previous posts have said they have been provided with a bag made by volunteers. The helpline may be able to give you dome guidance to support your daughter's reaction. I sometime feel it must be harder for those closest to us as they don't get much support and have so many emotions to deal with. And in my hubby's case he has had to learn how to use the washing machine! He still struggles with the induction hob and timers on the oven!!! Bless him!",
      "MessageIndex": 1,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76324/just-joined-op-on-12-may",
      "Title": "Just joined op on 12 may"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kiera I promised you a better response than mine and along comes Marg. Look at her posts about NYE they will make you smile and realise there is a better life without cheating rats! We need a 'Like' button Alison",
      "MessageIndex": 4,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69415/i-can-t-cope-anymore",
      "Title": "I can't cope anymore"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "What a great circle of friends we all have, can you imagine the noise if we all met up! Alison",
      "MessageIndex": 7,
      "PostDate": "05/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69415/i-can-t-cope-anymore",
      "Title": "I can't cope anymore"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg I love you post. This shines a different light on going out and letting your hair down! I personally prefer to go 'topless' especially now I have a full covering of hair, it is so liberating and I get lots of compliments. I will be keeping my hair in a short style from now on, it is so easy to wash and dry. Thanks for the smile you gave me! Take care Alison💝",
      "MessageIndex": 1,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69216/new-year",
      "Title": "new year"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Wow how much did you drink on NYE? Me topless/ bra less would be a site for sore eyes, it might even clear a crowded beach! At 57 and one boob I would cause quite a freak show! you have managed to make me chuckle again today - what a shame you don't live in the West Mids. I hope your will soon be confident to go out without hat, wig or scarf, it is so liberating and people do not stare as I thought might happen. What colour is your hair now? Mine is coming back silver rather than chemo white. Wishing you well and hope you continue to make me chuckle Take care Alison💝",
      "MessageIndex": 8,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69216/new-year",
      "Title": "new year"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Judith. I don't think you can if you are using an ipad. Same as it won't let you write in paragraphs! If you are using a computer above the text box you will find an icon to enable you to browse for photographs. Hope this helps and sound like a new fun thread. All my friends avoided nominating me! However I did upload a picture of Me after my Look Good Feel Better session at the QE. This is a fantastic free session and you come away with a goodie bag of make up and skin care. My daughter is coming home from uni on Thursday and I suspect she will have a rummage and I will find a half empty bag! Hope this helps",
      "MessageIndex": 9,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74789/party",
      "Title": "party"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Morning Marg. So pleased to hear your party was a roaring success ! There is a charity that recycles bras, I'll see if I can find the information and will start a new thread. Must get up now I can smell bacon cooking - I don't suppose you fancy a full English yet!",
      "MessageIndex": 13,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74789/party",
      "Title": "party"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Wow John that is so lovely! And how kind to take time to reply to this post. My husband has turned into a 'rock' and thinks I look lovely with my Jessie J hair cut. What a shame this isn't like Facebook and we could all 'like' you post. Thanks again Alison",
      "MessageIndex": 28,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69415/i-can-t-cope-anymore",
      "Title": "I can't cope anymore"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg You will soon have enough to go topless. I finished chemo in September and have been confident to be seen in public without covering up for over a month now. I felt more self conscious in my wig not to mention the heat and the itching on the back of my neck. I have a friend who has alopecia and has worn a wig all her adult life, I really feel for her. Hope your treatments go well. I am on session 11 of rads tomorrow, so far so good, this has been the 'easiest' ride of the journey so far. Take care Alison💝",
      "MessageIndex": 3,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69216/new-year",
      "Title": "new year"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Russ You didn't mention the black nail varnish! Made me smile when you commented on wigs and scarves. Here are my suggestions to increase your list:- I have not seen anyone mention Udderly Smooth hand cream I was given this by my chemo nurse along with the Difflam mouth wash. The cream is great for dry hands, feet, knees and any other areas that dry out. The cream was developed for cows to prevent their udders from cracking! I would add hand massages to the list ( and pedicures) as this seemed to help calm my hand where the drip was inserted and they are very therapeutic. Holland and Barrett sell natural deodorants as ordinary ones should be avoided after hair loss. My best advice is to say yes please to anyone who offers to help out and most importantly listen to your body, sleep whenever you need to. Alison",
      "MessageIndex": 7,
      "PostDate": "06/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65590/lists---what-do-i-need",
      "Title": "Lists - what do I need???"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I used soft bras or sports bras when I came out of hospital. A front fastening one is much easier to get on and off. Don't rush to buy proper bras, however you will need on before you go for you prosthetic fitting. I still wear my soft bras as they were comfortable during radiotherapy and even afterwards as I am still a little swollen and don't want to wear anything tight. I started a discussion with links for the genie bras I wear they come with a pocket to take a small foam liner Nd I can get my prosthetic breast in there too. Hope this helps. I also found lots of mastectomy bras on amazon - I am quite an unusual size so have to shop around, they are returnable meaning you can try them on at home. Sainsburys also have a good range of soft / sports bras and think it is one of their 25% off promotions at the moment ( also great for pjs). Happy shopping!",
      "MessageIndex": 2,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72264/mastectomy-bra---daft-question",
      "Title": "Mastectomy bra - daft question"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Lindsey. Welcome to the club no one wanted to join. I don't post very often these days. I'm from the class of 2013 so have all the T Shirts!!!!!  I'm sure you will find all the support you need here on this forum but as I was first to see your post I wanted to respond.  Here are some important tips:   if someone offers to help say yes please even if you don't need it yet, if you decline they probably won't offer again! paint you finger and toe nails black ( or other dark colour) this will protect the nail bed - there are lots of threads in this forum history loosing your hair is probably inevitable, I didn't like my wig and wore hats and pretty scarves - again lots of helpful posts.  My hubby told me I looked beautiful without hair so this boosted my confidence. if you go 'topless' around the house keep a scarf or hat by the front door - I forgot once and wondered why the delivery man was staring at my head! finally keep away from Google it is not your friend.   the waiting game at the start of diagnosis is the hardest, once you have a treatment plan you will start to feel in control.   take care and welcome to this really supportive forum   Alison",
      "MessageIndex": 1,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88123/just-been-diagnosed",
      "Title": "Just been diagnosed"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Lindsey. Welcome to the club no one wanted to join. I don't post very often these days. I'm from the class of 2013 so have all the T Shirts!!!!!  I'm sure you will find all the support you need here on this forum but as I was first to see your post I wanted to respond.  Here are some important tips:   if someone offers to help say yes please even if you don't need it yet, if you decline they probably won't offer again! paint you finger and toe nails black ( or other dark colour) this will protect the nail bed - there are lots of threads in this forum history loosing your hair is probably inevitable, I didn't like my wig and wore hats and pretty scarves - again lots of helpful posts.  My hubby told me I looked beautiful without hair so this boosted my confidence. if you go 'topless' around the house keep a scarf or hat by the front door - I forgot once and wondered why the delivery man was staring at my head! finally keep away from Google it is not your friend.   the waiting game at the start of diagnosis is the hardest, once you have a treatment plan you will start to feel in control.   take care and welcome to this really supportive forum   Alison",
      "MessageIndex": 16,
      "PostDate": "10/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88123/just-been-diagnosed",
      "Title": "Just been diagnosed"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "That's the one it makes me giggle every time I read it. Especially as still hung the next day / going topless! We all love you Marg xxxxxxxxxx",
      "MessageIndex": 10,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74789/party",
      "Title": "party"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Niche You can buy 'modesty inserts' for you low cut summer clothing - they are in one of the mastectomy specialist catalogues, they will also add a pocket to your swimsuit for the prosthesis.  I have just bought some genie bras that have a lace topping that looks like a camisole  (pics on bra discussion).  Hope this helps and have a super holiday - I can't wait for mine in July!",
      "MessageIndex": 32,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70913/breast-reconstruction",
      "Title": "Breast reconstruction"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg. Have a brilliant Boobie party! Go topless if you feel comfortable, it's your party. I'm sure by the end of the night when you are draped around your 'dream boys' you won't have a care in the world. Enjoy your party, wish I lived nearby and could join you. You are an inspiration to everyone on the forum. In a few days time you will be able to burn all your bras. Take care and upload some pictures.",
      "MessageIndex": 3,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74789/party",
      "Title": "party"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "For all new forum members perhaps George could repost Marg's posts following her New Year's Eve party where she totally changed the expression \" letting your hair down\" when she left hers behind!!! Hope the hangover was worth it Marg. You are a star",
      "MessageIndex": 5,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74789/party",
      "Title": "party"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi. You have come to the right place. I'm sure Gillie B will respond soon she has completed a similar journey. I'm sure it's hard with a young child - I hope you are getting lots of help? Chemo is doable but does have a wide range of side effects, they don't last forever and does a fantastic job. Have you tried the black nail polish tip? Remember to say yes please to any offers of help. My visitors would empty the dishwasher, do some ironing, walk the dog... Take care",
      "MessageIndex": 1,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74399/coping-with-chemo",
      "Title": "Coping with chemo"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "My hair dropped out within 2 weeks of my first FEC session. It got to the stage where I couldn't prepare a meal without dishing up hairs! My hubby persuaded me to let him shave it with his clippers and it felt so much better. I have a wig that I find hot to wear. I wear hats and scarves when I go out and have never felt that anyone is staring at me. At home I tend to go bare headed , remembering to leave a hat by the front door for when unexpected callers knock the door. I forgot this once and wondered why the delivery man had a funny expression on his face. I am a Brown Owl and have had to explain my treatment to them. I compared myself to Jessie J and they now think that Brown Owl is cool! My hair seems to be growing back during my last 2 taxotere sessions I feel this may be due to leaving my head uncovered most of the time. You will know when it is the right time for you to face the clippers - we are all different! Think of the time it will save! There is always a positive for every negative Alison",
      "MessageIndex": 4,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64580/ec-and-hair-loss",
      "Title": "EC and hair loss"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I went to the dentist yesterday who asked me about dates for chemo and radiotherapy as she said she could not do an extraction within 6 months of treatment. Has anyone heard of this and know why this is so? Thankfully I only needed a scale and polish! Looking forward to your replies Alison😱",
      "MessageIndex": 0,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70000/dentist",
      "Title": "Dentist"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marie. I have been on Letrozle since November. Like you I have secondaries in my spine and am having demozifab injections. Have you had a different brand of Letrozole this month? I have found I have less side effect with TEVA manufactured tablets and now ask for this make when I take my prescription into the chemist. I haven't felt weepy but certainly ache more with some brands. I hope this may help. Having a 17 year old is hard work, my daughter was quite trying at that age. She is now a loving and caring 20 year old. Take care. Feel free to friend me",
      "MessageIndex": 1,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75555/letrozole-does-it-make-you-depressed",
      "Title": "Letrozole , does it make you depressed."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Thanks Marg. My oncologist did talk about teeth at my first appointment as I am having treatment for my spine. I had literally just been for my check up so could assure her that teeth were ok. Alison",
      "MessageIndex": 3,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70000/dentist",
      "Title": "Dentist"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Claire. I think that is a question for your oncologist. I started a post about my trip to the dentist yesterday. She said she wouldn't be able to do an extraction for 6 months. I would be interested to hear what response you are given. Poor you a tooth out and chemo doesn't sound like much fun. Hope you are keeping your spirits up Take care Alison💝",
      "MessageIndex": 1,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70036/chemo-therapy",
      "Title": "chemo therapy"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "OMG! I'd better be careful! On Letrozloe and injections that weaken bones but on plus side have daily calcium supplement. I will ask my oncologist for more information on this situation. Not that I plan to have any dental work - I hate going to the dentist! Thanks A Ison💝",
      "MessageIndex": 5,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70000/dentist",
      "Title": "Dentist"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Wow Marg you have done so well! My advice would be listen to your body, I'm sure your brother in law will have a great celebration whether or not you attend. The most important think is to let your body prepare itself for the next chemo session. I am sure everyone will understand your reasons for not attending. Hope this helps you, don't be made to feel guilty you have been a star this week. Take care Alison💝",
      "MessageIndex": 1,
      "PostDate": "28/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68998/tired",
      "Title": "tired"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Well done Marg Enjoy a peaceful evening doing something very special with your youngest. We do have to put ourselves first at this time, something us mothers are not very good at doing! Alison🎅",
      "MessageIndex": 4,
      "PostDate": "28/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68998/tired",
      "Title": "tired"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi DaftBird Put your feet up and rename yourself Lady Muck!!!!!  I do think it is very important to listen to your body, sleep when you need to sleep etc.  Don't feel guilty   Take care",
      "MessageIndex": 1,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79694/how-do-you-find-your-mojo",
      "Title": "How do you find your mojo?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I tried several centres in my locality and as you rightly state they are booked months in advance, some don't run a December session making waiting times longer. Have you tried the QE in Birmingham? That had the shortest waiting time for me. Take care Alison",
      "MessageIndex": 2,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69102/looking-good-feel-better-lgfb",
      "Title": "Looking Good Feel Better LGFB"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Well done Marg bet you looked stunning! What size did you choose to become? 48 is a spring chicken! Are you going out to the bar again tomorrow?",
      "MessageIndex": 4,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75814/4-days-post-op",
      "Title": "4 days post op"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Dianne Welcome to the club Nobody wanted to join! There is so much warmth, support and encouragement on this forum, you have gained lots of sisters and a few brothers who know exactly how you are feeling. Whatever time of the day or night you will usually find some else is around to respond to your posts. You must have a good GP to direct you here Take care Alison💝",
      "MessageIndex": 9,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69029/living-in-fear-while-in-remission",
      "Title": "living in fear while in remission"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "What fantastic news a week end of celebrating?",
      "MessageIndex": 28,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71079/bone-scan",
      "Title": "Bone Scan."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Binny. Thinking of you, I have been through it all and had a double whammy on my birthday, first chemo in the morning and bad news in the evening. Feel free to friend me. Letrozole is my main ammunition. Chin up and hope you don't need the tissues. Big hugs xxx",
      "MessageIndex": 4,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71079/bone-scan",
      "Title": "Bone Scan."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi bevb47 yes I had rads at New Cross. The staff in the team are really lovely.  You will be given a form that you show at the desk and your parking ticket is swiped and the cost was £1 per day.   Each day you ewill be given the next day's appointment, be prepared for some early or late appointments.  I'm assuming you re one of Dr A's patients?   i live in Stourbridge and often meet up with a couple of forum members you are welcome to join us. We always select somewhere with good food and yummy cakes! Hope rads goes well, I took my own dressing gown to wear rather than having to struggle with hospital gowns.   Take care alison  ",
      "MessageIndex": 3,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88960/last-chemo-friday",
      "Title": "last chemo friday"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I feel for you and admire your determination to explore all avenues. However, please don't spend too long on your choices. My breast cancer spread into my spine before I started treatment. I am now looking at cancer management rather than a cure. Alison",
      "MessageIndex": 33,
      "PostDate": "27/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "The Dr A I meant is a she ( oncologist)!   Take something to read/ do in the waiting area. There is a refreshment 'shop' in the waiting room.  Sandwiches are good and hot drinks available.   although a bit of a pain getting up early I preferred early appointments as there was less chance of them running late!   alison",
      "MessageIndex": 5,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88960/last-chemo-friday",
      "Title": "last chemo friday"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I think 8.30 is earliest appointment the car parking is better then too!",
      "MessageIndex": 7,
      "PostDate": "28/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88960/last-chemo-friday",
      "Title": "last chemo friday"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "What fantastic news a week end of celebrating?",
      "MessageIndex": 13,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71079/bone-scan",
      "Title": "Bone Scan."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Binny. Thinking of you, I have been through it all and had a double whammy on my birthday, first chemo in the morning and bad news in the evening. Feel free to friend me. Letrozole is my main ammunition. Chin up and hope you don't need the tissues. Big hugs xxx",
      "MessageIndex": 19,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71079/bone-scan",
      "Title": "Bone Scan."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Louise. I went before the sale started but the assistant gave me the internet promotional discount. The items are expensive so I do wait for their sakes. The fitting for a prosthesis was well worth the visit. I now feel much more comfortable and have a much better natch than the hospital fitting I had soon after my MX. I love the Valetta strappy tops they are so comfy.",
      "MessageIndex": 2,
      "PostDate": "14/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79077/amoena-fitting-service",
      "Title": "Amoena fitting service"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I visited the HQ for Amoena last week when I visited my friend in Southampton. I had a full hour with a personal fitter who was very helpful and kept bringing out more forms until we found the right one that looked and felt good. She also fitted me with a comfortable bra and swim suit. I would recommend a visit. Hope this is helpful",
      "MessageIndex": 0,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79077/amoena-fitting-service",
      "Title": "Amoena fitting service"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Sarah The title of your post sums up my response. It is early days and it does take a while to get used to the terminology. When I have down days I think of a friend we made on holiday. He was the victim of an IRA car bomb over 20 years outside the army barracks he was working at. He lost both is legs and part of his right hand. It does help to put our problems and feelings into perspective. At least it is only our nearest and dearest who see our body change. Take care, let time and support from so many lovely people on this site, friends and family help you to discover the new you. Alison🎀",
      "MessageIndex": 4,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69935/early-days",
      "Title": "Early days"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Emma. I'm in the stage 4 group with mets in my spine. This was diagnosed alongside my breast cancer. I stEted chemo last May followed by mx and rads. I am now on Letrozole, a daily Adcal tablet to boost my calcium levels and every 4 weeks I have an injection of demozifab ( I think that's the right spelling!). I use co codamol to control the pain and take. Daily laxative to counteract the side effects of the pain killers. So long as I take it easy I can manage many activities. I don't bend down, stretch or lift any more than I have to. I know when I have done too much - usually hubby tells me I am looking pale and he makes me go to bed. I now sleep on my back - I used to put pillows either side of me to make sure I couldn't roll over in my sleep. I have a portable 'Back Friend' that I take out with me so the I am comfortable when sitting in 'strange' chairs. Feel free to friend me. Remember this can be controlled just listen to your body. I'm watching BBC2 's lambing programme. Wow it's amazing!",
      "MessageIndex": 7,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74173/it-s-back-and-this-time-it-s",
      "Title": "It's Back! And this time it's..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Emma. I hope the new medication works, especially if you have to sacrifice your G and T! Are you on tamoxifen / Letrozole? I have an injection every 4 weeks to boost bone growth have you been given this? And Adcal tablets? Mine are tutti fruity flavour and I can't say they are very appealing. Keep your spirits up. Remember there are some wonderful drugs to control the little blighters",
      "MessageIndex": 24,
      "PostDate": "30/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74173/it-s-back-and-this-time-it-s",
      "Title": "It's Back! And this time it's..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Sally google should be avoided on this occasion.  I can't offer any advice but will ask Gille B to respond.  Like me she was from the class of 2013 and pops her head I to the forum every now and then.  Gillie has become a good friend through this forum. We sussed from postings that we lived near each other and shared the same oncologist.   chin up, you know chemo works   alison",
      "MessageIndex": 1,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89093/breast-cancer-round-2-triple-negative",
      "Title": "Breast Cancer Round 2-Triple Negative"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg. It is still very early days so hang on in there. Feeling a bit low could be the effects of the anaesetic - it is a lot for your body to cope with. I'm sure you will feel better when you have seen your consultant tomorrow. Do you have any of your sleeping tablets left? They seems to cheer you up before your operation!!!! It's hard getting comfortable when you first come out of hospital but I promise you it will get better very soon. Chin up you are amazing. Big hugs xxxx",
      "MessageIndex": 1,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75360/fed-up",
      "Title": "fed up"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Emma Of course I responded. You have inspired so many along this vile journey. I always read posts but now only reply if I am one of the first to read a post or where I can add value to posts. I haven't had a reconstruction and at the moment I don't think I am going to bother so this excludes me from many of the discussions. Gillie B uses me as her if Alison can do it so can I!!! We have so much in common, live close to each other and both love cakes, chatting and crafts. I visited my friend and her 8 month old grandson today, I looked at him and had a few sad thoughts. if I ever become a grandma I'll never be able to pick the baby up... It won't stop me from giving it lots of love and cuddles and if I am ever fortunate enough ( my daughter prefers dogs!)",
      "MessageIndex": 13,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74173/it-s-back-and-this-time-it-s",
      "Title": "It's Back! And this time it's..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "There are a few more stages to get through there's the Simon Cowell where it stands up without gel and I have reached the Harry Styles ( one direction) look where even more hair stands up on end! I have always wanted curly hair and now I have curls behind my ears. BUT my hairdresser has managed to give me a pixie cut that is easy to maintain. Keep smiling. Thank goodness for G&J!",
      "MessageIndex": 4,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76610/and-now-i-ve-got-sideburns",
      "Title": "And now I've got sideburns!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "This one follows the Harry Styles!  Jessie J shaved her had last March - I use her as my bench mark when looking at my regrowth.  Im still at the Harry Styles stage - especially first thing in the morning!!!!",
      "MessageIndex": 8,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76610/and-now-i-ve-got-sideburns",
      "Title": "And now I've got sideburns!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Wow Yvonne great news and good to see you so cheerful! This site is fantastic there is always someone there to give a cheery response. Keep taking the tablets!",
      "MessageIndex": 4,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75315/a-massive-thank-you-to-every-one-xxxx",
      "Title": "A massive thank you to every one xxxx"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Snap! I was told that the scale of 1-8 is level of responsiveness to hormone treatment with 8 being most receptive. I hope this helps and I'm sure a fuller response will follow from other forum users",
      "MessageIndex": 1,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71955/er8-pr8",
      "Title": "ER8. PR8"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marie. I have tried a few brands and I find Cilpa the best for me. No sweats and very few aches. I've only tried Sandox from your list. Personally I would try each brand month at a time rather than be stuck with 3 months of the same brand. I noticed an improvement within 2 weeks. I now give the chemist lots of notice so they can get the right ones for me. Good luck with th experiment. I'm not sure they will take back or exchange what you have been dispensed. Take care",
      "MessageIndex": 1,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79056/letrozole-question",
      "Title": "Letrozole question.."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Emma. I have been thinking about you and it's good to hear you sounding positive. The injection is demozifab, not sure that is the right spelling, I have hp the injection every 4 weeks. Keep smiling we are on the wobbly path together. Big hugs",
      "MessageIndex": 26,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74173/it-s-back-and-this-time-it-s",
      "Title": "It's Back! And this time it's..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I hope tomorrow goes well for you - it is up to you whether you take anyone with you - I didn't tell my hubby anything until I was diagnosed, i don't think I could have faced the fussing, but that is me and we are all very different. Alison",
      "MessageIndex": 20,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Joanne If you enter silly o clock to the search bar you will come up with suggestions from the class of 2013. Candy Crush came out tops and some forum use rest reached really high levels. In fact it's their faults that I started playing the addictive game. The Daily Mirror can be downloaded for free on week days and is usually available from around 5 am! Let's hope some more suggestions come flying in. Take care",
      "MessageIndex": 4,
      "PostDate": "14/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78184/sleepless-nights",
      "Title": "Sleepless nights"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "One step at a time is the best advice. I have had the 6 chemo sessions, lost my hair, bought a wig I hate wearing so has only been worn a few times. I prefer to wear hats and scarves when out and leave my head uncovered at home. It is really liberating! My hubby likes the Jessie J look! I have my mastectomy on Saturday and start let role the following week. Support from friends and family is so helpful, especially the new friends you have here on this forum - they do understand what you are going through. Remember, there is always someone in a far worse position than you. This is not the best journey to be on, but, this treatment going to help us. Thinking of you Alison",
      "MessageIndex": 3,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65910/fec-taxotere-then-letrozole-how-do-you-do-this",
      "Title": "FEC, Taxotere then Letrozole how do you do this?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi I'm 57 so a little older.  From my experience BIG lumps have to be shrunk by chemo before a mastectomy so the fact that this is to be her first procedure is a positive sign.  Samples will have been taken at her first biopsy and they have to be 'grown' in the lane before all the tests results are available.  More will be carried out after the MX. This is the best place I have found for help, support, guidance and a good rant and weep - there is always someone who will come along a give you a boost - we even manage a good laugh at times! I had my second mama gram 18 months before I was diagnosed so don't let your Mum beat herself up about missing her first session. Love to you both",
      "MessageIndex": 2,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71419/feel-like-we-ve-been-left-in-limbo",
      "Title": "Feel like we've been left in limbo :("
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Rebecca Your updates are so inspiring. Great news ( except the pain) wishing you a speedy recovery from your latest surgery. Alison 💝",
      "MessageIndex": 1,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66583/oophorectomy-and-port-removal",
      "Title": "Oophorectomy and port removal"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi I have just returned from a visit to my oncologist and asked her about my 'prune fingers' She said it will take time and is caused by the taxotere. In some cases it does not go completely. She told me to be careful with hot water as I might not be able to feel how hot it actually is. I have noticed this with my feet when I have a bath. I have been knitting throughout my chemo and I think this has helped to keep the circulation in my fingertips. Hope this helps, looks like it is another waiting game we have to play! Take care Alison",
      "MessageIndex": 3,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64799/numbness-in-fingers",
      "Title": "Numbness in fingers"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Wendy. I put the post! Glad you found some bargains! Where did you get your micro bead prosthesis? It sounds interesting. I love their Valetta strappy T Shirts they are far more comfy than a bra. Hope others do as well as you did the quality is excellent.",
      "MessageIndex": 1,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79231/brilliant-comfy-post-surgery-sportswear",
      "Title": "Brilliant comfy post-surgery sportswear!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Paul. The waiting at the start of this ride is the hardest part. Hopefully Russ will come along soon to give you some male support. I went for my first appointment on my own as I didn't want to alarm my husband. I was hoping that I had developed another non cancerous lump - I had the first 2 removed when I was 18. However, in my hear I knew this time it was different and suspected the worst. We are all different and have different ways of coping. All I know was my weight losses at Slimming World were so good my best friend asked me what my secret to the weight loss was!!!! Take care and let us know how you get on. Hopefully your mammogram won't be too painful with less to be squeezed!!!!! Take care",
      "MessageIndex": 11,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77013/breast-cancer-in-men",
      "Title": "breast cancer in men"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi there is at least one male member of this forum - hopefully he will spot your post and respond. Sorry I can't help much more than this it's getting late!",
      "MessageIndex": 1,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77013/breast-cancer-in-men",
      "Title": "breast cancer in men"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have noticed lots of forum members discussing special cushions made by volunteers for their hospital, now someone has made it into a business... ",
      "MessageIndex": 0,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70371/special-cushions",
      "Title": "Special Cushions"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have been thinking about you and willing you to return to the forum. Here you are back to your chirpy best! With more mobility. Letrozole may cause a few minor side effects BUT it does a fantastic job controlling those little critters! Looking forward to seeing you on the television. Big hugs xxxxxxx",
      "MessageIndex": 8,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81209/sheep-and-cancer---now-on-tv",
      "Title": "Sheep and Cancer - now on TV!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Katie What a lot of questions! I don't suppose Mum will have all the answers yet!  At the start of this journey we don't have the full picture of the actual cancer - tests are carried out after Mum's biopsy.  Like you Mum I decided to have a mastectomy in the hope that I gave myself the best chance and to make sure that I would not need further surgery.  I had a fairly large lump so had chemo first to reduce its size and improved the chances of the surgeon being able to remove the entire mass.  Radiotherapy is like the cleaning up process - mopping up any stray cells that may have been left. My daughter is a little older than you (20) and when I was first diagnosed I kept it from her a she was about to start her exams at the end of her second year at university.  Grace came with me to one of my chemotherapy sessions and the breast care nurse was able t answer her questions.  I loved it when she snuggled up in bed with me and asked the questions she wanted to ask. You will be able to give your Mum so much practical support, Grace helped me to look my best when I went out by doing my makeup and styling my wig.  She can now cook a brilliant Sunday roast AND best of all cleans up afterwards.   I hope this helps, I'm sure much of this is still very new to your Mum and she probably doesn't know all the answers.  If you look at our recent posts you can see that we are a very caring and supportive group that will help you and Mum with many of the practicalities she is going to face in the next few months.   I am sure my daughter would be happy to friend you on Facebook.  Take care, give Mum lots of hugs and support.   Take care",
      "MessageIndex": 3,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70902/mothers-breast-cancer--can-anyone-answer-my-questions",
      "Title": "Mothers breast cancer- can anyone answer my questions?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi. Are you taking hormone inhibitors? These can cause joint pains, however, for your peace of mind I would suggest going back to your GP and ask for bone scan. Another thought - have you been given any physiotherapy exercises? It's so difficult working out what causes these side effects. Sending you a big hug.",
      "MessageIndex": 18,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75874/severe-shoulder-pain",
      "Title": "Severe shoulder pain"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi. Are you taking hormone inhibitors? These can cause joint pains, however, for your peace of mind I would suggest going back to your GP and ask for bone scan. Another thought - have you been given any physiotherapy exercises? It's so difficult working out what causes these side effects. Sending you a big hug.",
      "MessageIndex": 3,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75874/severe-shoulder-pain",
      "Title": "Severe shoulder pain"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Mina. Have you been taking the anti sickness drug Emend for the first 3 days? It is a very expensive anti sickness drug and from previous discussions it seems not everyone is offered this drug. It worked well for me.",
      "MessageIndex": 2,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75240/feeling-sick-for-6-days-post-chemo",
      "Title": "Feeling sick for 6 days post chemo"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Kate I had a single mastectomy with all lymph nodes removed in October.  I was driving after 2 weeks - advice I was given was if not in pain I could drive.  It is not a painful operation, there is some discomfort and the drain is a bit of a nuisance - especially when you forget to pick it up before you move. You will need to be totally spoilt over the Christmas period - no heavy lifting (except a wine glass) Is someone else cooking for you over Christmas? there are several current discussion posts that will give you lots of information.  the main advice is to do your exercises and listen to your body! Hope you and your young sons have a great Christmas - this operation is very doable - BUT remember to milk the sympathy!!!!!!!!!!!!!!!! Alison",
      "MessageIndex": 1,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68308/mastectomy-on-20th-december",
      "Title": "mastectomy on 20th December"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Wendy. I teach in Adult Ed and returned on a phased return 2 months after my radiotherapy. The works doctor was very supportive and listened to me before sending his recommendations he also asked my permission to request. Full set of my medical notes. On my second visit he had my notes in front of him and he explained lots of my procedures and was in no rush, in fact I stopped him from telling me too much information. I have also had a visit from the occupational therapist to review and thing I need such as a light touch keyboard because my fingers are still a bit numb from the chemo. As soon as I started my phased return I went back to full pay. I am very luck as my boss is so supportive and won't let me over do anything and allows me to work from home for done of my hours. Don't rush back it is very tiring and you need to decide if you are working to live or living to work!",
      "MessageIndex": 7,
      "PostDate": "06/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77064/teachers-out-there",
      "Title": "Teachers out there?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Mudge Welcome to the group no one wanted to join! This is a great source of support from people who do know exactly how you are feeling. It's good to hear that you were detected quickly, this part is the hardest - the waiting to get started Take care Alison",
      "MessageIndex": 2,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68001/first-post",
      "Title": "First post"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Rebecca I hope the sun is shining for you today.  You were the first person to inspire me through this forum and your fantastic blog.  I do hope that your despondency had something to do with the shitty weather we have been experiencing?  How about pouring your self a glass of your favourite tipple and look at your blog?- this will remind you of how inspirational, kind, supportive and generous you are.  We keep getting kicked a little further down the mountain, but with support we brush ourselves down and continue to climb. Chin up you are a fighter, Take care",
      "MessageIndex": 6,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71781/is-cancer-not-enough",
      "Title": "Is cancer not enough?!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Mollydog I too have just started this drug and am hoping it doesn't thin the new hair that is just starting to grow! Alison",
      "MessageIndex": 1,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66449/side-effects-of-letrozol",
      "Title": "side effects of letrozol"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi. I suffer with overheating at night. I have a fan by my bed and have it on the lowest setting all night. This and a glass of iced water with a straw in helps me to return to sleep quickly. I have started to look at the clock and I seem to sleep for a max of 2 hours before waking a again. I have returned to work but only for a few hours a week, my social life has pm roved since I have been off work and I am happy to return to work on reduced hours. I have been able to cash a private pension early ( anyone over 55 can do this) so can afford to slow down a little as I get very tired and have resigned myself to my new life that runs at much slower pace. I was always dashing around with several part time jobs, school governor and Brown Owl. I now have time to smell the roses!",
      "MessageIndex": 6,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75562/back-to-work-next-week",
      "Title": "Back to work next week"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "My Mum is 80 next month - I gave her my old iPad at Christmas - My daughter told me I was wasting my time BUT she is using it and enjoying it too. Yes this is a great site for inspiration - Ive learn of new ways to vent my anger! Love to Mum",
      "MessageIndex": 12,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71581/feel-like-a-fraud-on-this-site",
      "Title": "Feel like a fraud on this site"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "What a great tip! I have cut up an old soft bra to hold my falsie in a swim suit and that worked perfectly. Don't bin any bras they can be recycled to a variety of charities - I have added a list in an old post, I just googled recycle bras and about 7 charities were listed. Waste not want not!",
      "MessageIndex": 1,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82150/don-t-throw-away-your-old-bra-s-recycle",
      "Title": "Don't throw away your old bra's!! Recycle"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Well done Emma. That is the tallest mountain to climb on this journey. I had a beautiful bouquet of flowers for my last chemo - from the hospital not hubby! ( we have health insurance) I am going to my Look Good session tomorrow afternoon and then to see oncologist - she will think I look better! Perhaps I'll do a before and after shot!",
      "MessageIndex": 1,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71693/last-chemo-tomorrow",
      "Title": "Last chemo tomorrow!"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Ann. You have come to the right place for support, help, rant and even a giggle or two! As everyone has already said you are at the hardest part, the waiting. Once her treatment commences you will feel more in control. Big hugs to you both xxx. P.S. Are you from the Midlands?",
      "MessageIndex": 4,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71066/mom",
      "Title": "MOM"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Mumofthe year  6 weeks seems to be the magic number of weeks they allow for recovery between each stage in this journey.  Use this time to prepare some meals for the freezer, paint your nails black (lots of great advice on this forum) find a factor 50 sun protection cream,  and you may wish to investigate the cold cap method if you would like to try and save your hair.   There have been lots of discussions over the value of cutting long hair into a short style before starting chemo - that is something I wish I had done! Good luck with the next part of this journey - the forum is great - there is so much support from 'real experts' Take care",
      "MessageIndex": 9,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74692/diagnosis-to-chemo-starting-worried",
      "Title": "diagnosis to chemo starting...worried"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Vicki. It seems to be the recovery time between all procedures. You sound well prepared. I couldn't see the point in paying for a trip to the hairdresser when it was going to fall out - I have been married to a Yorkshireman for too long!!!!!! My hair started to fall out after the first session, and my scalp itched like mad, my hair ended up in a tangled clump that I couldn't brush out so I got the scissors and chopped it out. Hubby then clipped it all off and it felt so much better. I didn't wear my wig very often - it was too hot in the summer. I have a huge selection of hats and scarves. My favourite was from eBay. As George said yesterday there are lots of people making money out of us and as soon as you google chemo and hat / scarf the prices double!!!! I did buy a half wig to wear under hats and scarves, so that some hair shows. I now have a short hair style and vey much doubt I will grow it long again. Take care. Search some older posts using key words you will find links for hats, scarves, nails....",
      "MessageIndex": 12,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74692/diagnosis-to-chemo-starting-worried",
      "Title": "diagnosis to chemo starting...worried"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Vicki. I'm not in Yorkshire just married to a Yorkshire man (Wakefield) One thing you will learn during this is patience!!!! I started chemo on my birthday (May ) mastectomy in October and rads December/ January. I worked through chemo and returned on phased return just as full sick pay ended. My sister in Law is a head teacher in South Kirby. Take care, and a chill pill. I am enjoying having time to do all the lovely things I never had time to do when I was working too many hours every week. This week I am decorating eggs for my Easter tree. Last week included 2 lunches and an evening meal with friends. As they say ' take time to smell the roses!' One of my friends has decided to slow down since spending time with me especially during chemo, she says she realised she enjoyed just sitting and talking without dashing around like a lunatic. Hope this garbled message makes sense.",
      "MessageIndex": 15,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74692/diagnosis-to-chemo-starting-worried",
      "Title": "diagnosis to chemo starting...worried"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "",
      "MessageIndex": 2,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77001/i-ve-had-such-a-bad-day",
      "Title": "I've had such a bad day"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Soniraeb  Yes Letrozole is fantastic, it is controlling my cancer that had already spread to my bones.  A year ago when I started my horrendous journey I found it really hard to dress myself, get out of bed etc.  Now I am able to do so much more and have returned to my part time job.  When I am back at work I am able to 'forget' I have cancer and feel like the old me for a few hours!   I had a mastectomy and don't regret my decision - in fact I don't think I will go for a reconstruction when I have my first year appointment with my surgeon.  I have found a comfortable 'falsie' and a range of tops with a built in shelf to take the false - so much more comfortable than an bra. What ever decision you take we are all here to support you Take care",
      "MessageIndex": 1,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78687/pre-surgery",
      "Title": "Pre surgery."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I am taking Letrozole and have aches, especially in my hands. I am only on my second month so hope the side effects don't get worse the longer I take it. I try to keep my hands busy and they do seem to improve throughout the day. I have started to knit in the evenings and this does seem to help. I keep reminding myself that it is these tablets that are fighting the remaining cancer cells. Alison🎀",
      "MessageIndex": 1,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67979/medication-after-chemo-and-radiotherapy",
      "Title": "Medication after chemo and radiotherapy"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I started a link Special cushions ( about 14 pages back) there was an article in the Daily Mirror. Someone also found a valentine's day heart cushion in Home Bargains for £1.99. I hope you find something. I put pillows either side of me to prevent me rolling over in my sleep. In a few days you will work out a strategy to suit you. Chin up you are on your way down the mountain now.",
      "MessageIndex": 6,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71441/feeling-rough-at-minute",
      "Title": "Feeling rough at minute"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Woops lost what I had just written! We are all entitled to bad days, like you I was up very early this morning reading the newspaper on my ipad at 5 am. I gained weight during chemo especially around my middle. Now 12 months on I am ready to get rid of this wright gain and have joined weightwatchers on line. I'm on Letrozole so loosing the pounds may take a bit longer. Gillie B had a great tip to count down your radiotherapy sessions. Fill a large jar with small chocolate bars, one for each session. When you get home after each session eat one! If chocolate doesn't float your boat you could have a long row of wine bottles. Travelling to and from your sessions is the tiring part. Have you stocked up on Simple shower gel? Huge hug hope you update us tomorrow. Can you knit or crochet? It's very therapeutic and stops me from nibbling food.",
      "MessageIndex": 3,
      "PostDate": "20/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77001/i-ve-had-such-a-bad-day",
      "Title": "I've had such a bad day"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I have had my swelling drained twice. My consultant then suggested I let my body deal with it and not to have it drained unless it became painful. I started wearing my post mastectomy bra that compressed the area and I am sure my boob shaped lump is going down every day. Exercise is also supposed to encourage the body to remove this fluid. Alison",
      "MessageIndex": 1,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67385/bruising-after-lymph-node-removal",
      "Title": "Bruising after lymph node removal"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Good morning Mandy. I didn't tell my Mum about my diagnosis - she was recovering from a massive heart attack herself and lives 250 miles from me. She knew I had a bad back and thought that was stopping me from travelling. We kept her in the dark for as long as possible. Lots of friends told me I should tell her but I always responded by telling them she couldn't do anything to help and would worry herself so much and probably make herself more ill. You sound like you have a good coping strategy and now you have found a great set of sisters and a few brothers who DO know what you are going through and can support you with tons of practical tips, commiserate with you when you want a rant and celebrate every time you reach a milestone. Where do you live? You might find other members in your locality to meet up with and chat face to face. Take care",
      "MessageIndex": 3,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77258/is-how-i-am-feeling-normal",
      "Title": "Is how I am feeling normal?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg. Chin up you are doing so well and have made the journey easier for so many of us with your wonderful inventive ways of celebration. I'll never forget your New Year's Eve party! Sending a huge hug and hope it helps you. Much love",
      "MessageIndex": 1,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79509/treatment-overload",
      "Title": "treatment overload"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I've just read this in today's paper. • WOMEN with at least 15 moles on their skin are 35% more likely to be diagnosed with breast cancer than those with none, a US study from Indiana University suggests. I've got lots of moles...",
      "MessageIndex": 0,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78077/moles",
      "Title": "Moles"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi These are symptoms that your Mum is likely to get, IF she does then Unfortunately many foods taste like cardboard! Frozen pineapple has been suggested on previous posts. Diff lam mouth wash is good and might. E given to your Mum by the chemo nurse. I was given a pot of cream called Udderly Smooth and my daughter massaged this into my feet and knees as drying skin is another possible effect. You Mum is fortunate to have such a caring daughter Alison",
      "MessageIndex": 1,
      "PostDate": "12/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65792/chemotherapy-and-metal-taste-in-mouth",
      "Title": "Chemotherapy and Metal Taste in Mouth"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Thinking about you today. Sending big hugs from Cornwall xxx",
      "MessageIndex": 9,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77181/freaking-out-slightly",
      "Title": "Freaking out slightly"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I bought an Amoena one from eBay it is lighter and is shaped for the water to run through it. To be honest it is my fav and I wear it with a vest top that takes a falsie as I find wearing bras uncomfortable. Looking forward to hearing how you get on in the pool. I'm off to Portugal next month and am planning a practice run before I go. BUT have to find a cossie I can fit into first!!!!!",
      "MessageIndex": 3,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77606/swimming-with-prosthesis",
      "Title": "Swimming with prosthesis"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Sorry I can't offer a scientific reply but as a post menopausal ER + I am taking the hormone Letrozole. Oestrogen is present in lots of foods so perhaps this might be the reason.",
      "MessageIndex": 1,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75131/understanding-the-reason-why-i-might-be-on-tamoxifen-when-i-ve-had-a-full-hysterectomy",
      "Title": "Understanding the reason why I might be on tamoxifen when I've had..."
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Flower24. I'm from the class of 2013 too.  Firstly my comiserations to you and your daughter and her loss.  please pick up the phone and visit your GP and get this lump checked out ASAP.  hopefully IT will be something other than what you are dreading.  I'll be thinking of you and hoping that you won't have to face another round of treatment.  Take care, a huge ciber hug to help you pluck up the courage to make that call.  I've delayed a trip to the dentist for almost a week knowing I had a very loose tooth, now I've been I feel so much better and it wasn't as bad I thought it would be.  I'm sure you posted on here for us to give you positive encouragement.   XXXX",
      "MessageIndex": 2,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85395/i-m-feeling-scared",
      "Title": "I'm Feeling Scared"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "I am HR + and on Letrozloe as I am post menopausal. I don't have too many hot flushes and have learnt to manage them. I have a summer weight duvet and have a glass of cold water by my bed to sip if I wake in the night. During the day I wear layers - it helps to cover the missing boob too! I have secondaries and was told this was my best tool to fight the mets. It is just another thing to adapt to in this new routine",
      "MessageIndex": 1,
      "PostDate": "28/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70992/hormone-receptive",
      "Title": "Hormone receptive"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Well done for completing your first session. Silly O'Clock is a problem. My ipad was a saviour. There are many Candy crush fans on here with incredibly high levels of achievement. I also downloaded the Daily Mirror newspaper it is free mo. To Friday and appears at around 5 am. The only other tip is to take the last steroid at around 3/4 pm. Were you given Emend? It is a fantastic anti sickness tablet BUT I understand it is very expensive so may not be offered as standard by all hospitals. Take care and remember to listen to your body",
      "MessageIndex": 1,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79469/first-chemo-over",
      "Title": "First Chemo over"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi I didn't tell my husband anything in the hope that it was just another lump (I have had three removed in the past) he 'found out' when the hospital phoned for me and told him when my appointment with Professor C was!  As you can imagine he was a total wreck by the time I for home.  We kept the news from our daughter until she had completed her second year exams at uni.  The uni have been so supportive - she is on her year abroad now and they have paid for 3 trips home so she can come home during term to see me.  ",
      "MessageIndex": 5,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71060/newly-diagnosed-with-dcis-queery-invasive",
      "Title": "newly diagnosed with DCIS queery invasive"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Marg. Great decision, I have a few aches and pains that can be controlled by pain relief gel. Hot flushes are something I'm sure you can cope with. IF I can do it I'm sure you can too. Go girl!",
      "MessageIndex": 4,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73459/hormone-treatment",
      "Title": "hormone treatment"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Jane. Your comments reminded me of the time I was having an argument with my hubby and I told him he was getting on my tits my 20 yr old chipped in saying \" no he is getting on your tit!\" Bless her!",
      "MessageIndex": 6,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75241/don-t-forget-to-laugh",
      "Title": "Don't forget to laugh"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Mudge. Wow you have really made full use of this forum and are fully prepared to let the battle commence! Have you looked at the posts relating to painting your nails black ( fingers and toes). Basically this is to protect the nail bed from light / chemo. If you font fancy the goth look some people cover the black with a different coloured top coat. I would also suggest you use a nail oil and put this in your cuticles and down between nail and finger tips. I was given some waterproof dressings after my mx would these be helpful when bathing? I hope all goes well for you. Take care,",
      "MessageIndex": 4,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71604/starting-chemo---tips-and-advice-please",
      "Title": "starting chemo - tips and advice please?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "You are doing better than me on Candy Crush - I'm only on level 41.  Like you I have  supportive hubby and lots of friend who visit regularly - its good to have a laugh and natter with them. Wish I had thought about vanilla slices - I did have a few apple donuts with fresh cream and when I felt up to it I made fresh scones with clotted cream for my visitors - perhaps that's why I had so many!",
      "MessageIndex": 10,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71604/starting-chemo---tips-and-advice-please",
      "Title": "starting chemo - tips and advice please?"
    },
    {
      "AuthorID": "Bongo 56",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bongo-56",
      "Content": "Hi Patricia You have come to the best place for support - I wish I had found this forum as soon as I was diagnosed.  You will find lots of helpful tips, shoulders to cry on and support from others who are further on their journey. A supportive and loving family makes this horrible journey a little easier.  I am a Brown Owl and had to tell my 'girls' (age 7 - 10) they have been very caring and thought Brown Owl is cool having hair like Jessie J! Take care, you have found a new group of friends Alison",
      "MessageIndex": 3,
      "PostDate": "14/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65855/coping-with-diagnosis",
      "Title": "coping with diagnosis"
    }
  ]
}