{
  "AuthorID": "Boobybird",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/boobybird",
  "Posts": [
    {
      "AuthorID": "Boobybird",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/boobybird",
      "Content": "They have a duty to adapt the workplace for you if you are sick. Can you threaten to work from home instead? Or maybe just 2-3 days a week from home? But I do know that, as an employer, they have to accommodate you; look up the Equality Act 2010 and how it defines a disability. Hope that helps x",
      "MessageIndex": 3,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147931/need-some-advice-regarding-my-job",
      "Title": "need some advice regarding my job"
    },
    {
      "AuthorID": "Boobybird",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/boobybird",
      "Content": "Gosh this could be me!!! After a lifetime of supporting everyone else, when it came to my turn forget it. I have no support from family or friends whatsoever, and medically I feel I am on a conveyor belt ready to be spat out at the other end. If I ask any questions I get the feeling they think I am being awkward - it's as if it is their tumour and they know what is good for it and I am just the vessel within which the tumour resided. It's horrible and a far cry from \"person centred care\". AND I can even relate to the deaths, lost my dad August 2014 from sepsis and my mum at the end of January this year having looked after her through a particularly nasty cancer journey. ",
      "MessageIndex": 1,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140453/is-it-just-me---i-m-just-ranting-really",
      "Title": "Is it just me? - I'm just ranting really ;)"
    }
  ]
}