{
  "AuthorID": "Bosley dog",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
  "Posts": [
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Amanda, I know exactly how you feel. I finished all my treatment in may and have has aches in joints since then, had to have a bone scan as they think it might be arthritis. I also have pins and needles in my right fingers and the doctor tells me it is carpel tunnel but won't give me the steroid injection till I have the results back re the bone scan. I seem to have gone from someone who never had anything major wrong with them to the wreak I now feel I am. I know I should be positive but sometimes it is hard when you ache and stiffen up all the time. Carol",
      "MessageIndex": 2,
      "PostDate": "30/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97118/something-else-now",
      "Title": "Something else now"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi JJ I found a hot water bottle at my back really helped in fact 4 months after chemo I still use it in the evening as I still have back ache but not as bad as during the chemo.  Hope you find some relief.",
      "MessageIndex": 4,
      "PostDate": "14/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98648/fec-and-back-pain",
      "Title": "FEC and back pain"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "That is wonderful news, I have managed to get sandoz and am over the moon with this, fingers crossed we both see an improvement.☺ Carol",
      "MessageIndex": 1,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106143/letrozole-femara-brand",
      "Title": "Letrozole..... Femara brand"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi I think it is safeto say it is the steroids, I remember when I took them the day before chemo I never slept that night, would be downstairs on the couch listening to the short stories on radio 4 iPlayer. That was a life saver for me during chemo as I could listen to them and not think about anything else for a short while. Hope you are resting if not sleeping and taking good care of yourself. Best wishes carol  (one who has been there and is out the other side, but still struggling with the sleep issue)",
      "MessageIndex": 1,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97546/fec-and-sleep",
      "Title": "FEC and sleep"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi pearldrops, I was on exemestane for about 6 weeks but have been taken off them and am now going on to tamoxifen, I have really bad joint pains so am having a two week break to settle everything down before I start the new tabs. I should have had Anastrozole in the first place but had very bad diahorea for about 12 days so they took me off them and put me onto the exemestane. I am not saying the tabs gave me diahorea but they changed them just in case. I am hoping the tamoxifen will not affect my joints  and everything will settle down. I would speak to your oncologist and see what they say.  My cancer was also on the right side but the joints really affected are my hands and knees, strange isn't it how they affect different parts on different people. Take care and do speak to the oncologist as we are having to take these tablets for at least years we do need the best quality of life we can get. Carol",
      "MessageIndex": 1,
      "PostDate": "23/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99022/exmestane",
      "Title": "Exmestane"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Papa smurf. I was exactly like you in October 2014, had a routine mammogram and lump found and operation to remove lump three days later then had to wait more than three weeks for the oncotype DX test which said I needed chemo. Like you I was scared and unsure what would be happening, but here I am now over 18 months later still going strong. One good piece of advice I can give you is to always post any worries or concerns on here because this site is full of ladies who know exactly what you are going through and have come out the other side. Hope today goes well. Take care Carol",
      "MessageIndex": 2,
      "PostDate": "14/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106593/scared-about-today",
      "Title": "Scared about today"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Lynne I had chemo after having the oncotype DX test. I was not told the score just that it came back as a high risk of the cancer coming back so the oncologist said I would be better having the chemo. I did not question it as I thought they must know what they are doing and also as it costs quite a bit they would not put me through it if I didn't need it. The surgeon had said I was borderline and as the test was now available on the NHS they would send my sample off. I am glad they did because I don't think I would have been given chemo otherwise. I know chemo is the pits but it is something we can get through and the positive at the end is no cancer. Hope this helps Carol",
      "MessageIndex": 3,
      "PostDate": "31/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100664/oncotype-dx",
      "Title": "Oncotype DX"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi GnJ Thanks for the info, will check the blister pack and also ring the up next week. Carol☺",
      "MessageIndex": 2,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102933/letrozole-from-manx-healthcare",
      "Title": "Letrozole from Manx healthcare"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Kismet1 Thanks for that information, I am only experiencing really bad hot flushes and mainly at night with the usual stiffness so will keep an eye on things to see how they progress.  I am going to speak to the pharmacist where I get my prescription made up to see what brands they have so I will now for the next one. Hope everything thing settles down for you. Take care Carol",
      "MessageIndex": 5,
      "PostDate": "28/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102933/letrozole-from-manx-healthcare",
      "Title": "Letrozole from Manx healthcare"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "I know exactly what you mean, my hands are so bad but I have been told I might have inflammatory arthritis in the hands and wrists, funny though I never had any problem with them before. I am on exemestane and on the oncologists advice have come off them for two weeks but can't see any difference so am going to start them again tomorrow also going to start taking fermented cod liver oil tabs as suggested in one of the earlier discussios and see how I get on. I also have problems with my hips and had thought the cancer had spread, but thankfully it had not, the inflammatory arthritis or suspected arthritis showed up on the bone scan, I know I should be pleased but when you can't stand up and walk normally for a few minutes after being sat down it is not much fun. I did start on Anastrozole in may while on radiotherapy but had a very bad bout of diahorea which lasted about 10 days so stopped taking the Anastrozole and am now wondering if the tablets triggered something and that is why I am having problems with my hands.  I had lots of aches and pains during chemo but put them down to the chemo and fatigue now I hav no idea and am not sure the doctors do either. We will get through this and hopefully with all our bits of information help each other. Take care everyone Carol (bosley dog)",
      "MessageIndex": 5,
      "PostDate": "27/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98138/joint-pain-update",
      "Title": "Joint pain update"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Is this the first after treatment? Because here in Macclesfield you get your mammogram results within the hour and have a chat with the bcn to make sure everything is OK. I had my first one last month and all is OK I am glad to say",
      "MessageIndex": 4,
      "PostDate": "18/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102634/mammogram-results",
      "Title": "mammogram results?"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi everyone I am on letrozole and have just started a new packet yesterday but a different brand, this one is from Manx health care and I wondered if any of you have had it or on it now and can let me know what side effects to expect? Many thanks Carol",
      "MessageIndex": 0,
      "PostDate": "26/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102933/letrozole-from-manx-healthcare",
      "Title": "Letrozole from Manx healthcare"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi linz1230 You will find radiotherapy a walk in the park after chemo, take it from one who had her second chemo on the 23rd Dec last year and had a very quiet time as I was on fec  also. The biggest bug bear with radiotherapy is going back and forth to hospital for 15 days, the treatment takes minutes, it's the setting up of the machine which takes the time. I did not suffer any side effects during radiotherapy other than tiredness, it was a few days later I had very bad sunburn under my breast which causes me discomfort for about a week. Take care Carol (bosley dog)",
      "MessageIndex": 8,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98216/chemo-advice-please",
      "Title": "Chemo advice please"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Everyone, Sorry it is side on, not sure how to sort that out. this is me ready to go out to my husbands christmas do 2015 after all my treatment had finished.  I did not go to the 2014 do as I had had my head shaved on the 23rd dec after my second chemo session and it did not come back properly until march/april 2015.  I know it is tough but believe me when i say it is doable.  I just wanted to let you know you are not alone and we all know exactly what you are going through/. take care everyone Carol (bosley dog)",
      "MessageIndex": 16,
      "PostDate": "04/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103209/i-m-not-me",
      "Title": "I'm not 'me'"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi All owl, I think I must have been one of the lucky ones re nails as I 4 which started to go black with thumbs and first fingers and these split and flaked off but the other ones were OK. That was a couple of months age and just when I thought they were growing normally again I have noticed one of my thumb nails has gone black down one edge. My hair is very slowly growing back and when it first started to grow it had a mind of it's own and was growing up both sides on the top and at one point I thought I was going to have a quif up the middle, it has sorted itself out now but as I said is very slow in growing. The plus is I don't use much shampoo or conditioner on it.  Carol",
      "MessageIndex": 6,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97780/neddys-moaning-cows-club",
      "Title": "neddys/moaning cows club !!!!"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi all, just spent the day with friends and Jackie mentioned she had seen some info on tumeric made into a paste and a tiny bit taken a few times a day helps with aches and pains in joints and I wondered if anyone else on here had heard of it or even takes it ? Thanks  Carol (bosley dog)",
      "MessageIndex": 0,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97774/tumeric-and-aches-and-pains",
      "Title": "Tumeric and aches and pains"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Thanks dreamthief Will check it out and thanks all for your comments, it really helps. Carol (bosley dog)",
      "MessageIndex": 6,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97774/tumeric-and-aches-and-pains",
      "Title": "Tumeric and aches and pains"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "H I Judith Thanks for your reply and Bosley dog was my cairn/yorkiecross who I sadly lost last September after 13 wonderful and very faithful years. I use to tell people he was a cairn in a rottweiler coat as he would always have the first and last word. I will check out the link dreamthief added and see what is said, as anything which helps with the aches has to be a good thing. Thanks again Carol",
      "MessageIndex": 5,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97774/tumeric-and-aches-and-pains",
      "Title": "Tumeric and aches and pains"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Vonnie  I take my adcal as soon as I wake up and then take my letrozole with my breakfast and other than being very stiff at night and the odd hot flush in the night I seem to be OK. Carol",
      "MessageIndex": 2,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102527/night-or-morning",
      "Title": "night or morning"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Connie I take my adcal as soon as I wake up and then take my letrozole with my breakfast and other than being very stiff at night and the odd hot flush in the night I seem to be OK. Carol",
      "MessageIndex": 1,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102527/night-or-morning",
      "Title": "night or morning"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Heidi I to had stage 3 and had 6 rounds of chemo, 3 fec and 3 doctaxel and must say by the time I was getting to to end of the last dose I could hardly stand it. I use to have the chemo on a Tuesday morning so knew I would be alright for a couple of days then go downhill for about 4days and then start to come out of it but the last one took so much out of me ,as you said it was a build up in my system which was why it took longer than to come round. I remember the Saturday after the last chemo I had crawl upstairs to bed as I felt so rough, looking back on it my hubby and I can laughter at it now, it shows how much we can take when we have to. Be strong and you will come through the other side stronger for it. Thinking of you Carol (bosley dog)",
      "MessageIndex": 1,
      "PostDate": "10/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97512/still-feeling-ill-after-last-chemo",
      "Title": "still feeling ill after last chemo"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Heather Thanks for letting me know, I had my aches before the tablets and was told that was from the chemo so thought they would ease, I had been worried as the aches were in my hips as well as knees and shoulders but had a body scan and all is OK cancer wise but they think I have inflammatory arthritis in my hands and wrists, never rains but it pours sometimes doesn't it? Am going to start taking fermented cod liver oil tablets next week to see if the joint improve, it is a case of elimination isn't it to see what works and what doesn't.  Will see how I get on, I also put a discussion on about tumeric and aches in the joints and had a few replies as well as dreamthief has given me a link to check out, so now will go and do my homework. Thanks again, hope all is going well with you. Carol (bosley dog)",
      "MessageIndex": 2,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97775/exemestane-and-aches-in-joints",
      "Title": "Exemestane and aches in joints."
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi all, I am on exemestane and found it has made my aches in joints worse, so my oncologist suggested I come off the tablets for about two weeks to see if the aches lesson or not, my question here is do any of you know how long do the effects of the drug stay in the body as I stopped taking the tablets on Saturday and wondered when I should start to feel better? Thanks  Carol (bosley dog)",
      "MessageIndex": 0,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97775/exemestane-and-aches-in-joints",
      "Title": "Exemestane and aches in joints."
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "I too would like to add my Christmas and new year wishes to one and all, like you Vonnie this site has helped me through a very tough year and I hope it carries on helping everyone who shares our journey . Merry Christmas  Carol (bosley dog)",
      "MessageIndex": 1,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102528/christmas-wishes",
      "Title": "Christmas Wishes"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi 58petals I am at the other end of your journey, I was diagnosed with stage 3 after a normal mammogram last October, had a lumpectomy and nodes checked, then had a wait of three weeks to find out if I had to have chemo or not and the answer to that one was yes. So started chemo on the 1st of Dec and had to have 6 sessions which took me through to mid march when I had  few weeks off before I had my 15 sessions of radiotherapy. The downside was I lost my hair so was a bald headed coot for Christmas the upside to that was I saved quite a bit on shampoo conditioner and hairdresser fees. I won't lie it is though but as you can see from this site there are a lot of us going through exactly the same as you so if you only take one thing from here it is you are not alone and there will always be someone to chat to about the different stages you are going to go through. I don't know where you are moving to but my experience of the NHS and MacMillan have all been very good. Take care. Carol (Bosley dog)",
      "MessageIndex": 3,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97842/diagnosed-yesterday",
      "Title": "Diagnosed yesterday..."
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Angie, I finished my chemo treatment in march and rads in may and have now been on four different tabs due to the stiffness. Tamoxifen did not agree with me at all, I could not cope with the added problem of mood swings. I am now on letrozole, I am still stiff at night and my ankles, knees and hands are bad during the day. I am giving these tabs a few months as I am not go back to see the oncologist until April. But if I cannot cope I will come off them as the % benefit to me is only 4-6% and at the end of the day the most important thing to me is quality of life.  It is possible the aches will settle down so here's hoping we are in that group. Take care Carol☺",
      "MessageIndex": 3,
      "PostDate": "05/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102071/muscle-stiffness",
      "Title": "Muscle stiffness"
    },
    {
      "AuthorID": "Bosley dog",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bosley-dog",
      "Content": "Hi Ajem I had chemo then radiotherapy and started taking anastrozole but had diahorea for 12 days so stopped taking the tabs along with some indigestion tablets I was on because the doctors could not say which had caused it. Anyway that was in may and I didn't go to see the oncologist until two weeks ago when they put me on Exemestane. What I am trying to say is the radiotherapy did not give me any side effects other than very dry skin under my breast and so far the tab are giving me hot flushes (what joy especially at night) and a very dry mouth. Everyone is different I know and it depends on the tabs they give you. The side effects from my chemo have been far worse than these so far so in that respect I am able to cope with them, hope this helps. Carol (bosley dog)",
      "MessageIndex": 1,
      "PostDate": "22/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96839/radium-and-hormone-tablets",
      "Title": "Radium and hormone tablets"
    }
  ]
}