{
  "AuthorID": "Bozzie5",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bozzie5",
  "Posts": [
    {
      "AuthorID": "Bozzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bozzie5",
      "Content": "Good Morning All I haven't been online for a while and am hoping someone can give me some help with a few issues I am dealing with at the moment.  Please forgive me if it has already been well documented and I haven't seen it.   I am 2 years BC in July, struggled on Tamoxifen since Aug 2015 to now.  I had a hysterectomy in September 2016.  I have struggled through all my symptoms feeling and telling myself that its better than heavy periods and risk of ovarian cancer, so was worth the op.   Symptoms I have are Hot flushes, headaches, aching bones, (especially elbows, wrists and ankles) bloating, swollen feet, nausea when hot flashes, weight gain, not to mention irritability and mood swings.   SLEEP DEPRIVATION - IS THE WORST - LEADING TO CRIPPLING FATIGUE. So my question to any of you lovely ladies and on line community can you offer me any help or guidance to get me through this or help me with anything that could settle down the symptoms.  Lots of people have suggested herbal, holistic remedies but I am unsure as the next person says 'oh no do not take that as estrogen based or trigger' I am going to the GP this pm for the first time about this.  I know everyone has a back story and copes with things.  I have tried so hard but I am truly struggling to work, be a mum, a carer (For my Mother with Alzheimers) and a wife. So if anyone is on line now and can give me any ideas to ask the GP (as it took me three weeks to get this appointment for 5 mins) I would be eternally grateful. Many thanks Maria ",
      "MessageIndex": 0,
      "PostDate": "31/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126063/menopause-after-hysterectomy",
      "Title": "Menopause after Hysterectomy"
    },
    {
      "AuthorID": "Bozzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bozzie5",
      "Content": "Good luck for today. Keeping everything crossed. Let us know how you are x  Maria x Bozzie5",
      "MessageIndex": 4,
      "PostDate": "09/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99651/is-it-back",
      "Title": "Is it back?"
    }
  ]
}