{
  "AuthorID": "Breasty-besty",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/breasty_2d00_besty-",
  "Posts": [
    {
      "AuthorID": "Breasty-besty",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/breasty_2d00_besty-",
      "Content": "Hello, I’m after some advice and reassurance. Finished treatment (surgery, chemo, radiotherapy) a month ago for HER2+, ER/PR- grade 2 IDC. Had one positive node and primary tumour was 45mm. Having ongoing herceptin until Jan 2020. I’ve had almost constant headaches for the past 1.5 weeks. This is something I’ve never experienced before. It isn’t debilitating - I can still do things - but I feel a bit unwell/nauseous and the constant headaches are getting me down. It’s not due to caffeine/lack of caffeine, dehydration, tiredness or any other cause I can pinpoint. Herceptin was delayed last week due to the headaches and I saw the on-call oncologist on Friday morning. He did a few tests (checked vision etc) and ordered a head CT to be on the safe side, but indicated that there were no worrying signs from his physical examination. (I’m coming to the question now, promise!) The oncologist had no idea when the CT scan would take place (said he requested it happen ASAP). What sort of wait would be typical for the NHS in England? How long after that would I need to wait for results? Is there any benefit in trying to arrange a scan privately? My rational brain tells me it is almost certainly a strange virus or something else equally innocent causing my headaches. However, I can’t seem to get past the anxiety that it is due to brain mets. I know it sounds silly - I feel foolish even writing it down - but I can’t seem to stop worrying about it (which probably isn’t helping the headache)! Any advice or experience with this? Thank you in advance for any and all suggestions!!!",
      "MessageIndex": 0,
      "PostDate": "13/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179642/ct-scan-for-brain-mets",
      "Title": "CT scan for brain mets"
    },
    {
      "AuthorID": "Breasty-besty",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/breasty_2d00_besty-",
      "Content": "Thanks Sal! My blood pressure was checked and is a little on the low side but was deemed to be acceptable. I should have added that I’m otherwise fit and well (aged 33). I’m sure you’re right and it’s nothing to worry about. Good luck with your treatment and managing the bone mets!!! Xox",
      "MessageIndex": 3,
      "PostDate": "13/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179642/ct-scan-for-brain-mets",
      "Title": "CT scan for brain mets"
    },
    {
      "AuthorID": "Breasty-besty",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/breasty_2d00_besty-",
      "Content": "All excellent suggestions. Thank you all for being rational and highlighting all of the many far more likely explanations. I’m far calmer about it now :) xox",
      "MessageIndex": 6,
      "PostDate": "13/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179642/ct-scan-for-brain-mets",
      "Title": "CT scan for brain mets"
    }
  ]
}