{
  "AuthorID": "bridienme",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridienme",
  "Posts": [
    {
      "AuthorID": "bridienme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridienme",
      "Content": "Hi Terri I, too, am new here.  Found out today that I have breast cancer.  As far as my shocked brain could take in this afternoon, a cancer is graded by the amount of non-cancerous cells versus cancerous cells found in a tumuor.  I have been diagnosed with grade 3 cancer and was told that this means there are more cancerous cells than normal cells.  Our health authority is brilliat (South Tees) and I went to my doctor with the lump discovery on the Thursday, got a call from the breast clinic on the following Monday and was giving an appointment for two weeks later.  The wonderful thing was the one-stop clinic that did everything in one day, ultra-sound, mammogram and core biopsy.  Although scared I feel extremely positive that this has been caught early.  Ultrasound today seemed to show that there was no lymph node involvement.  I have opted for a mastectomy as I want it all gone.  Was told that they will take 1-4 lymph nodes when they do the surgery and if no cells are found then I can get away with just chemotherapy and not have the radiotherapy. It's scary but I am considering that this is the first day of my recovery.  It's been found and now we will fight the bugger.  xx",
      "MessageIndex": 9,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/20703/breast-lump-and-scared",
      "Title": "breast lump and scared"
    },
    {
      "AuthorID": "bridienme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridienme",
      "Content": "Hi Terri I, too, am new here.  Found out today that I have breast cancer.  As far as my shocked brain could take in this afternoon, a cancer is graded by the amount of non-cancerous cells versus cancerous cells found in a tumuor.  I have been diagnosed with grade 3 cancer and was told that this means there are more cancerous cells than normal cells.  Our health authority is brilliat (South Tees) and I went to my doctor with the lump discovery on the Thursday, got a call from the breast clinic on the following Monday and was giving an appointment for two weeks later.  The wonderful thing was the one-stop clinic that did everything in one day, ultra-sound, mammogram and core biopsy.  Although scared I feel extremely positive that this has been caught early.  Ultrasound today seemed to show that there was no lymph node involvement.  I have opted for a mastectomy as I want it all gone.  Was told that they will take 1-4 lymph nodes when they do the surgery and if no cells are found then I can get away with just chemotherapy and not have the radiotherapy. It's scary but I am considering that this is the first day of my recovery.  It's been found and now we will fight the bugger.  xx",
      "MessageIndex": 24,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/20703/breast-lump-and-scared",
      "Title": "breast lump and scared"
    },
    {
      "AuthorID": "bridienme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridienme",
      "Content": "Hi Sharon I had my mastectomy October, 26th 2009.  It wasn't a hard decision as I was diagnosed with grade 3 lobular (downgraded to grade 2 after surgery).  I only had to ask one thing......do I want to keep a diseased breast which could be responsible for the shortening of my life or was it better to have the mastectomy and get rid of the cancer.  It was a no brainer really.  I remember the first thing I thought when I came around from the antaesthetic and I also  remember having a huge smile on my face when I realised my cancer was gone....I was cancer free. I was scared to death of looking at my scar and had a real good cry but a year later I a have a tissue expander in place ready for breast reconstruction to my right breast and a risk reduction mastectomy and implant to my left.  I am soooooooooo chuffed with the progress so far.  The shape of the breast with the tissue expander in it is already fabulous and I feel like posing about.  I haven't been this pert since I was 13 lol.  Can't wait to get the bag of flour on my left looking as good as the right.  Yes, you will be missing a breast for a short while but there is so much to be done and it looks amazing.  Missing a breast is worth enjoying a full life.  Everything crossed and prayers being said that you will see light at the end of the tunnel soon Jill",
      "MessageIndex": 63,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "bridienme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridienme",
      "Content": "hi kaz i have been offered a risk reduction mastectomy to my left breast as my cancer was invasive lobular which has a slightly higher chance of developing in the remaining breast.  It's exactly what it says really a mastectomy to reduce the risk of the cancer developing in the other breast.  'This time they will keep the tissue and use a double implant for left and right.  Tissue expander is working a treat and so proud of my new boob xx",
      "MessageIndex": 21,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "bridienme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridienme",
      "Content": "I had my mastectomy October 2009 after I was told my core biopsy showed a grade 3 cancer but when my breast tissue was analysed it was grade 2.  No lymph node involvement, no radiotherapy or chemotherapy so I am incredibly lucky.  I am in the first stages of reconstruction with a tissue expander being put in late August.  The result is amazing and in the new year I will have implant in my right breast and a risk reduction mastectomy and implant in my left breast.  There is light at the end of the tunnel.  The journey has been hard and worrisome but it's a battle well worth fighting.  I am very concerned about your posting regarding your consultant cancelling your op and can imagine how scared you are.  Can I just advise that you go to the Macmillan support centre at your local hospital and talk to somebody face to face.  I am sure they will help you as much as they can with your questions and worries.",
      "MessageIndex": 18,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    }
  ]
}