{
  "AuthorID": "Bridgets-21",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridgets_2d00_21",
  "Posts": [
    {
      "AuthorID": "Bridgets-21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridgets_2d00_21",
      "Content": "I have also found this group really supportive. It's reassuring knowing there is a vast network of people that are knowledgeable and experienced what we are going through, who are able to support us with our difficult and varied problems. Thank-you x",
      "MessageIndex": 1,
      "PostDate": "25/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91529/group",
      "Title": "Group"
    },
    {
      "AuthorID": "Bridgets-21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridgets_2d00_21",
      "Content": "I had 3 weeks radiotherapy and it started to get sore in the last week. I got intrasite gel from the bcn for my blistered nipple and it's great stuff. Cooled the burns straight away and made it bearable too. All healed after 7 days! Still tender but not red raw and no infection. Hope this helps x",
      "MessageIndex": 7,
      "PostDate": "24/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91800/last-radiotherapy-tomorrow",
      "Title": "Last radiotherapy tomorrow!"
    },
    {
      "AuthorID": "Bridgets-21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridgets_2d00_21",
      "Content": "Hello everyone, I have Ehlers Danlos Syndrome (Hypermobility type) and have always had subluxations and sprains that add to my joint pain. I had a stage one breast cancer diagnosis November 2014 followed by surgery on New Years eve in 2014. In the spring I had three weeks of Radiotherapy, then started on Tamoxifen. I have noticed that over the last year that my joint pains has increased and become more debilitating for me; making personal care and dressing a real struggle for me. I am posting my PIP application today because of the further difficulties I have. I was advised by my lovely Breast Care Nurse to apply for it and my wonderful surgeon is happy to be contacted by them. Saw the oncologist last week who said the radiotherapy has caused scar tissue that is hardening the tissue area it treated. I keep getting cording too as I am struggling to manage regular massage of the area. The oncologist said I need to keep massaging the breast tissue and rib area to help breakdown the scarring. I'm really struggling with this as I've problems with my other shoulder too. Some days I can't raise either arm to wash or dress myself. I also have major problems with concentration and memory retention which has increased ten-fold over the last year. This has caused me to loose my previous job in senior admin and I'm now a receptionist and admin assistant role, with a drop in salary which has caused financial problems I don't need. Has anyone else had similar problems?",
      "MessageIndex": 0,
      "PostDate": "25/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108347/radiotherapy-scarring-and-tamoxifen-problens",
      "Title": "Radiotherapy Scarring and Tamoxifen Problens"
    },
    {
      "AuthorID": "Bridgets-21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/bridgets_2d00_21",
      "Content": "I had a lumpectomy and sentinel nodes removed new years eve 2014. Had painful cording under my arm and below the breast on my chest wall. I've been massaging the areas with Aveno cream several time a day, which was very sore to do but now the cording has gone from both sites. I am still massaging mornings and evenings over the whole area as I had a huge seroma and along scar sites. It's still sore but not as bad as before, the seroma has reduced immensely and it has also softened the scars. Hope this helps.",
      "MessageIndex": 1,
      "PostDate": "08/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92482/cording",
      "Title": "Cording?"
    }
  ]
}