{
  "AuthorID": "Brook72",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
  "Posts": [
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Westiegirl, I had a full clearance just over two weeks ago. I had chemo and then a mastectomy, the sentinel node tested positive despite chemo so I went ahead with the full clearance. It was quite painful to begin with and I have a strange sensation down the back of my arm now. The movement has come back fairly quickly, the exercises they give you really helps. Cancer was found in two more of the nodes taken so I’m glad I had it done. I’ve got two kids and I’m worried about lymphadema but I felt I needed to know that I’ve done everything I can to stop the cancer returning. You’ll make the decision that is right for you. Stay strong.",
      "MessageIndex": 3,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141192/partial-or-total-lymph-node-clearance",
      "Title": "Partial or total lymph node clearance?"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Westiegirl, I had a full clearance just over two weeks ago. I had chemo and then a mastectomy, the sentinel node tested positive despite chemo so I went ahead with the full clearance. It was quite painful to begin with and I have a strange sensation down the back of my arm now. The movement has come back fairly quickly, the exercises they give you really helps. Cancer was found in two more of the nodes taken so I’m glad I had it done. I’ve got two kids and I’m worried about lymphadema but I felt I needed to know that I’ve done everything I can to stop the cancer returning. You’ll make the decision that is right for you. Stay strong.",
      "MessageIndex": 18,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141192/partial-or-total-lymph-node-clearance",
      "Title": "Partial or total lymph node clearance?"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Cherries worked for me, the sharper the better! Sometimes the taste in my mouth was so bad I was physically sick! I found that eating a few cherries before I ate or drank anything helped. They're not a cheap fruit though! ",
      "MessageIndex": 1,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137977/taste",
      "Title": "Taste"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Mazda, I’m starting radiotherapy tomorrow and wasn’t intending on putting any cream on until after the treatment. My treatment is at 2pm so I was going to shower in the morning as usual. There seems to be lots of different advise about the cream - I was told to use E45 only - I mentioned R1 and Aloe Vera and I was told not to waste money on it! The radiotherapist said that if your skin is prone to burning it will happen whether you use an expensive one or not. I got the impression that you gently shower the cream off before the treatment the next day. I must admit I felt I was making a bit of a fuss with all my questions about the cream! Xxx",
      "MessageIndex": 15,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi all, hope you have enjoyed the weekend. I’ve had 3 sessions now and I’m feeling more confident. The hardest bit for me is getting my arm in place as I’ve had a full node clearance and my shoulder is still very stiff. My skin is fine, I shower in the morning and put E45 on and then put E45 on again in the evening. I’ve been trying to drink lots of water too. I’m hoping that this time next week my skin will still be happy! I hope that treatment for everyone goes smoothly next week. Take care xxx",
      "MessageIndex": 21,
      "PostDate": "10/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi all, I have also got 2 more zaps before the Xmas break. My skin is still ok, slightly pink after showering but it cools down. My stiff shoulder,  following node clearance, has been the biggest concern for me but the lovely radiotherapists always seem to get it in the correct position eventually. I do get quite tired in the evening but I do think that’s a lot to do with busy days with xmas coming up. I think the distraction of xmas preparations has help me not overly think the treatment. Xxx",
      "MessageIndex": 47,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Ah Shey, you are almost at the finish line. The driving conditions as well as the xmas traffic has definitely made the journeys there more stressful. Glad that you mentioned the throat thing, I’ve got a feeling as if there is a lump in my throat, thought it was because I had to stretch my neck and head back. Plan for a big slump tomorrow - have your pjs, a blanket and a good film at the ready! Take care xxx",
      "MessageIndex": 53,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi all, I had my last zap yesterday. The tiredness/relief set in within an hour of getting home and so I spent the rest of the afternoon watching Xmas films. I was told that the tiredness and sore skin would peak between 7 and 14 days after finishing treatment so I will take it easy for a couple of weeks now. I hope that you are all ok and the end of your treatment comes to an end soon. Roll on 2018!!!",
      "MessageIndex": 51,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Thank you for reassuring us Jill, fingers crossed we won’t have any problems xxx",
      "MessageIndex": 17,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Thank you Dreamthief for starting this thread. My radiotherapy is starting on Wednesday so it would be lovely to hear from others going through it too. Xxx",
      "MessageIndex": 1,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Sheyjay, please do keep in touch and let me know how you are getting on xxxx",
      "MessageIndex": 3,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Just thought I would check in with you all. I’ve had my 8/15 sessions today, I’m so glad it’s Friday and have 2 days off. My skin has started to go pink around my collar bone as having superclavicle treated as well as chest wall, the breast area seems to be fine. I’m feeling ok, perhaps a little more tired in the evening so have started to put my pjs on a bit earlier than usual! Sorry to here that some of you have got the lurgy, hope that you feel better soon. Enjoy the weekend xxx",
      "MessageIndex": 34,
      "PostDate": "15/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143718/december-radiotherapy-club",
      "Title": "☢☢☢ December Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Bananabambs, I've got a son your age so I felt that I wanted to reply to you. I'm really glad that you came to a recognised forum for support. I think that what you can feel are probably small little cysts, my brother had them when he was your age a they just dispersed over time. I think that you should definitely get them checked out though. On several occasions, when I have attended the breast clinic, there have been young men there getting checked out too. Have you got someone that can go to the GP with you?",
      "MessageIndex": 5,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/151452/lumps-in-chest",
      "Title": "Lumps in chest?"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Joanne, I had a full node clearance about 2 months ago now. I will be honest and tell you that it was more painful than the mastectomy for me because it affected both my shoulder and arm. My advice would be to keep taking the painkillers regularly and try to keep doing the exercises. I didn’t have a drain after and got a small swelling under the scar but that went down after about a week. I have had a couple of small grazes/cuts on my finger since, I use antiseptic wipes and then cover with a plaster to avoid any infection risk. You will feel a relief when those infected nodes are removed. I hope the rest of your treatment goes well xxxx",
      "MessageIndex": 3,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi there, I was diagnosed in March 2017. - Her2 positive (28mm tumour) and 1 lymph node involved - I’ve had a mastectomy, full node clearance, Fect chemo, radiotherapy, a year of herceptin, implant reconstruction and I’m now on Tamoxifen. Like you I was so scared about the impact that it would have on my family and children but we’ve got through it. After a while (and it’s hard at the beginning) You will learn to take one day at a time, to live for each day and not waste precious time worrying about what could happen. If im honest I still worry about what the future will bring but I’ve learnt to keep busy and distract myself when I start getting these thoughts. Try to get outside for a walk each day, even when it’s a struggle to put one foot in front of the other, you will feel so much better for it. It not easy but you will get through it. Big hugs xxx",
      "MessageIndex": 3,
      "PostDate": "11/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169570/her2--lymph-node-involvement",
      "Title": "Her2- lymph node involvement"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Rockfan, my children are exactly the same age as yours. All through my treatment I have tried to explain the treatment I'm having as I was concerned that if I didn't they would google everything. Despite this I still find them looking at me and wondering if I'm telling the truth! They are very clever at picking up on if you are having a bad day and say 'are you sure you are ok' - sometimes it can be very draining putting on a brave face for them can't it?",
      "MessageIndex": 3,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137892/new-to-online-community",
      "Title": "New to online community"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Alison, I had a picc line put in after my 3rd chemo as the veins in my hand got more more and more painful and seemed to disappear when the cannula went near them! It was the best decision I made and chemo was so much more bareable. I was very anxious the day I had it put it but I really shouldn’t have worried - the nurse was amazing and I didn’t feel anything as they numb the area. I would recommend it to anyone having chemo if they have a choice. Xxxx",
      "MessageIndex": 3,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143208/picc-line-or-not",
      "Title": "PICC line or not?"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Scaregirl, I had 18 weeks of chemo (FECT) I'm still on Herceptin and had a mastectomy 5 weeks ago. I have two children 15 and 17. Like you I was terrified and wondered how I would cope but you will. I did get various side effects along the way but you will be given a bag of goodies to help relieve them. My kids did worry but I tried to reassure them that the side effects were perfectly normal. I did loose my hair but bought an amazing wig. The kids don't want to see me without it on so I wear a hat in the evening and take it off just before I go to bed. I hope this helps a little. Good luck for Wednesday - it's doable. Xxx",
      "MessageIndex": 2,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139069/starting-chemo-october",
      "Title": "Starting chemo October!"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Yes, you are having the same I had but you are lucky as you are being given Perjeta - I think this has only recently started being offered for primary bc. I have read the outcomes of this treatment are really good. Good luck.",
      "MessageIndex": 5,
      "PostDate": "01/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139069/starting-chemo-october",
      "Title": "Starting chemo October!"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Helen, I had a mastectomy in August 2017 with an immediate expander implant. A few weeks ago I had the expander replaced and an implant in the other side. I was an A cup and have gone up to a C cup. I’m so pleased that I had it done as I now look even. The incision was only 6cm long and in the bra crease, it has healed really well and I’ve had no problems. I’ve got to wear a sports bra for another 3 weeks but I’m looking forward to choosing some new pretty bras that are not padded!! I would definitely recommend having it done. I hope that helps a little. Best wishes xx",
      "MessageIndex": 3,
      "PostDate": "16/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168082/symmetrising-surgery-to-healthy-breast-with-na-implant",
      "Title": "Symmetrising surgery to healthy breast with NA implant"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Hides, I had a node clearance just over 3 weeks ago now. The movement in my shoulder is improving but the back of my arm is still uncomfortable and sore (just like having sandpaper being rubbed on the skin!). The scar is feeling very tight and my armpit is numb. The lovely ladies on this site told me that it can take more than 6 weeks before it starts to feel more like normal. I think it’s a case of being patient I’m afraid. I hope that reassures you a little xxx",
      "MessageIndex": 3,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141716/recovery-after-surgery",
      "Title": "Recovery after surgery"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Lizzie, I had Fect chemo back in March 17. I was terrified too, like you I found the nights horrible and suffered from lack of sleep. However, the chemo wasn’t as bad as I thought it would be, imagine a hangover for a couple of days without the fun from the night before! The T part at the end wasn’t so great, I felt very achy (usually only for a day or so) and got mouth thrush but they will give you medication if you do suffer from side effects. You can do this! Take one day at a time and try not to dwell one the bigger picture, before you know it the chemo will be over. The key is distraction, watch lots of rubbish tv, go for walks and try to spend time with friends when you feel up to it. Unfortunately we learn to cope - you’ll do it! Big hugs xxx",
      "MessageIndex": 2,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152621/night-terrors",
      "Title": "Night terrors"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Boudicca, like you the cancer in my lymph node could not be seen on the ultrasound. I had chemo and then a mastectomy, following the surgery the lymph node tested came back positive.    You may have seen from my previous posts that I had a full node clearance last week. I'm feeling sorry for myself (unusual for me) because despite taking painkillers I have terrible pain in my shoulder where the nerves had to be cut and my upper arm is numb.  I am, like you, worried about lymphedema. However ..... despite all of this I chose to have it done as, like Ronstar said, need to know I have done everything possible to 'remove' the cancer. It's all about making decisions that you are happy with I think. Stay strong. ",
      "MessageIndex": 5,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140457/axillary-clearance-or-radiotherapy-what-to-do",
      "Title": "Axillary clearance or radiotherapy, what to do??"
    },
    {
      "AuthorID": "Brook72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/brook72",
      "Content": "Hi Peanut, I’m also Her2 and ER positive. I was diagnosed in March, has 6 sessions of chemo (Fect), a mastectomy with expander implant, I then had a full node clearance and have just finished 15 sessions of radiotherapy. I’ve had 13 of 19 herceptin injections too and I’ve been taking Tamoxifen for 2 months. It is all doable and the key is to take one day at a time. I think the scary thing is that when you are first diagnosed you read that the her2 positive is very aggressive but luckily they do have treatment to try to zap it and recently there have been some new ones out there like Perjeta which you may be offered. Let us know how you get on xxx",
      "MessageIndex": 4,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146297/her2-and-er-positive",
      "Title": "Her2 and ER positive"
    }
  ]
}