{
  "AuthorID": "browneyes43",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/browneyes43",
  "Posts": [
    {
      "AuthorID": "browneyes43",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/browneyes43",
      "Content": "Hilton In south derbyshire, 6 miles south of Derby x",
      "MessageIndex": 10,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39218/geographical-locations",
      "Title": "Geographical Locations"
    },
    {
      "AuthorID": "browneyes43",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/browneyes43",
      "Content": "Hi Mia   its great to hear you sounding so positive about your treatment plan. Your situation sounds so much like mine - at the moment they are saying my main lump is stage 2 but I am aware that could well change following the mastectomy when they are able to really have a look at it.    I am curious though regarding you being node negative and you still getting the belt and braces with regards treatment. Am I right in assuming this is because you are younger and premenopausal. Initial test of my nodes are negative and I will be having sentinal node biopsy during mastectomy.When ever I say to BCN that I want the full works even if node negative she says they will give me only what I need. I am assuming this is a catch all phrase as two consultants have said they will treat me aggressively due to my age (43). I have been told I will be having tamoxifen whatever.   Hope you have a great Xmas   Karen xx",
      "MessageIndex": 6,
      "PostDate": "23/12/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34095/d-day",
      "Title": "D day"
    },
    {
      "AuthorID": "browneyes43",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/browneyes43",
      "Content": "Forgot to say, surgery is booked for January 4th, outpatient appointment for results/treatment plan is booked for Jan 13th",
      "MessageIndex": 7,
      "PostDate": "23/12/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34095/d-day",
      "Title": "D day"
    },
    {
      "AuthorID": "browneyes43",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/browneyes43",
      "Content": "Hi ladies   thought I should check myself in as now that I am official off sick I don't seem to have time to do anything as I am so busy galavanting with my friends who are insisting that I become a lady that lunches/shops til she drops. Who am I to say no. In fact I don't know if I will find time to go back to work given my new social life!   The mastectomy drain came out today - yippee!! Not that I have let it stop me too much with going out as wore in my Radley shoulder bag (as my friends know I wouldn't just use any old bag). Problem is when I set it down I was always walking off without it and getting yanked back.   I am getting results and treatment plan next thursday but dont really give it any thought. I used to worry self to bits about things and then I couldn't get to sleep. Mad things like nuclear war. then I realised what was the point of worrying about things that I can't change and now that is how I approach most things in life. I can't change what is going to happen next Thursday so going to have as good a week before hand as possible. Ask me again on Thursday tho!!!   My wound was covered with clue and looking good. I was looking at bio-oil today but was under the impression that it shouldnt be used for the first 6 weeks post op as it can affect the healing process. I am not bothering either with a bra or the comfy. It feels quite liberating not wearing a bra and I am not worried about gravity and the remaining boob going south. I must look a bit of a sight tho as I was quite big busted so the asymmetry is so obvious although friends say unless pointed out they wouldn't notice. I tell them thats why they are my friends!   Whilst not looking forward to further treatment I am very pragmatic about it all. As I said I cant change it so just have to get on with it. This was helped by the breast surgeon initially saying that when the breast is gone so is the cancer (yes I know that cancer cells have likely spread already and these also threaten me). I think the surgeon comment is quite positive in that the most obvious thing that was threatening my life has gone. I guess I am quite fatalistic in that from what I have read, nobody knows who will be treated and who will or will not develop further disease. so I just have to take whatever is on offer. I feel that this is a wake up call that I am not getting any younger and am looking at family history of diabetes and heart disease.   If chemo is on the plan, which I believe it will be given my age and potential size of tumour, I will arrange to visit the headstrong service at Chesterfield hospital (I live in south derbyshire. I am not overly concerned re loss of hair as again thats the factual practical side of me. I had recently grown my hair long but had it cut short just before Xmas. My reasoning was if no chemo it would still be so much easier to maintain in hospital and recovery etc and if chemo, it wont be such a shock to my system when it does start to fall out. In order to prepare the kids and not worry them about how I feel about it, I have said that I would like them to shave my head. For all that I have said above, I know that will be a significant and upsetting time as the BC will be in my face all the time. I think ,y logic in 'how upbeat I am' at the moment is that I know that I am going to have physical and emotional bad times but I hope that if I start from a high place I wont fall as far.   Anyhow, its Friday night and I have red wine and chocolate awaiting. Hope you have a good weekend and I will keep you posted. Love   Karen xx",
      "MessageIndex": 17,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34095/d-day",
      "Title": "D day"
    },
    {
      "AuthorID": "browneyes43",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/browneyes43",
      "Content": "Hi all   I have been having shiatsu for the past 6 months before my bc diagnosis and hope to continue with this through my coming treatment (told yesterday that I will be having FEC x 6 starting in the next few weeks - gulp!!). I was thinking about reflexology, again before diagnosis, but have read some conflicting personal reports on t'internet regarding holistic treatment recommendations. The reflexologist I have in mind is highly experienced so will discuss with her.   I asked the Onc whether he was happy for me to go back to work and he simply said 'horses for courses' - some people work all the way through whilst others can't work at all and that I will have to see how I am. So glad that gives me the option as my GP wrote out another sick note for 2 months when I only asked for 2 weeks so I will be back to discuss options. I think I will see how I am after the first cycle and get an idea of my good and bad days. I think I will be quite busy in the build up to the first treatment with hospital appointments and looking at alternative headwear. I am lucky enough to live near to a headstrong service with no waiting list so thats where I am off to next weds. Obviously not forgetting my role as a 'lady that lunches'. I am finding that I am sleeping lots at the moment and after the kids have gone to school I am going back to bed until after midday.   Hope you managing to sleep Mia and not overdosing on hot cocoa!!   love Karen xx",
      "MessageIndex": 21,
      "PostDate": "27/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34095/d-day",
      "Title": "D day"
    },
    {
      "AuthorID": "browneyes43",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/browneyes43",
      "Content": "Hi Mia my name is Karen and I was diagnosed with BC on Dec 10th 2010 my 43rd birthday. I am booked in for a mastectomy and dont have a clue yet what my plan will be apart from the fact that when completed I will be on Tamoxifen. I attend Derby Royal Infirmary breast unit and I have to say that they have been fantastic including surgeons, nurses and support staff. They have been honest and open with just the right amount of empathy which hasn't been patronising. I have to say its been a GP (not my usual one) who was very dismissive when I said I wanted to go back to work if and when i am able. I know that it 'hasnt sunk in yet for me' but to tell you the truth I am glad about that at this moment in time with the run up to xmas and a holiday planned prior to the diagnosis.  (thank heavens for antidepressants tat I have been on for a few months), I know that the realisation will come on the op day. Good luck for tomorrow - I hope that its all positive regarding treatment plan and that you get the answers you want. Karenx",
      "MessageIndex": 3,
      "PostDate": "21/12/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34095/d-day",
      "Title": "D day"
    },
    {
      "AuthorID": "browneyes43",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/browneyes43",
      "Content": "Hi Mia   sorry not to have posted sooner. At 5pm on Mon Jan 3rd I got a call from hospital to say that there was no bed for me the next day so op cancelled!! Apparently the bed had all been taken by swine flu medical beds with the hospital on the highest alert. Suffice to say I made a bit of noise to my gp and hospital and I had the mastectomy on Friday 7th Jan, out the next day. Surgery was done by oncoplastic breast surgeon and I can see that when the swelling subsides in the next few months that the scar will be quite neat and well positioned. It is quite long but then I did have a lot of boob to remove! Its held together with glue so no dressings to contend with and it was so nice being able to have a shower  16 hours after surgery the next morning. I have a drain in but today the drainage has dramatically reduced so hopefully can be taken out in next few days. If husband had his way, he would wrap me in cotton wool and out fragile stickers all over. I must admit that I realise that my physical recovery will not be as good as last major op (caesarian) 13 years ago, even at 43 years old. I need to check when results and treatment plan will be due to later op date so either 13th or 20th Jan. I am premenopausal and have been told I will be on tamoxifen for 5 years. Also was told to have mirena removed just before xmas, very bothered by this as it was for gynae probs and these have returned very quickly. I think I will be broaching hysterectomy when this is over especially due to tamoxifen side effects.  Holiday was okay, in that it was warm and just me and hubby. It was, at the end of the day a waiting game so didnt enjoy it as well as I would have without impending operation. Do you know what your treatment plan is?   Hope you had a good xmas and new year (as best as you could :-) ) Karen xx  ",
      "MessageIndex": 11,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34095/d-day",
      "Title": "D day"
    }
  ]
}