{
  "AuthorID": "BuntyFl",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/buntyfl",
  "Posts": [
    {
      "AuthorID": "BuntyFl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/buntyfl",
      "Content": "Last year I was told by my oncologist to wait for the flu jab until after chemo as the chemo would stop it working anyway.  I had mine 3 weeks post chemo.  Hope this helps xx",
      "MessageIndex": 7,
      "PostDate": "14/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114834/flu-jab-and-chemo",
      "Title": "Flu jab and chemo"
    },
    {
      "AuthorID": "BuntyFl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/buntyfl",
      "Content": " I was told quite categorically by my surgeon only to ever use a good quality electric shaver. I did ask if you could have laser treatment as I find it difficult to even get an electric shaver in after surgery But this was not recommended either. Definitely no eppilating or waxing in case of infection.",
      "MessageIndex": 7,
      "PostDate": "13/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114800/underarm-waxing",
      "Title": "Underarm Waxing"
    },
    {
      "AuthorID": "BuntyFl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/buntyfl",
      "Content": "I had a sick note from my Doctor to cover the full 18 weeks and also agreement with my employers that I would work when I could, as it was I only had 45 days off in total last year which covered 2 operations and the chemo.  I found that I could go back to work 2 weeks after each surgery and needed 4/5 days clear after each chemo.  Work were fantastic, but then I did try to do my best by them too.  I was also lucky as I work in an office on my own so could avoid every one else's germs when my immune was low.  If you work in a \"germy\" type area it could be a problem in itself.  Work should not ask what days you are having off so they can cover, you are not to know this until the time, they should find an alternative work round.  Are you able to work from home?  I did have access to my computer from home which helped me keep in touch when I could.  My hair was long too, I got a good wig from a charity wig bank and everyone complimented me on my new style, a lot of people never realised what I was going through, I preferred this to scarves for the same reason you mention.  Good luck with your treatment, I hope it all goes well xx ",
      "MessageIndex": 4,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107552/work-during-treatment",
      "Title": "Work during treatment"
    }
  ]
}