{
  "AuthorID": "Busababe",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/busababe",
  "Posts": [
    {
      "AuthorID": "Busababe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/busababe",
      "Content": "Hi Jules thanks for the reply, not sure what HER2 is yet but no doubt will be able to look that up on here !! When I had my second opp the surgeon just said he would need to go back in and take a bit more, it was a nurse who said that he will probably be doing an axillery clearance ! I was cross that he had not indicated that when he spoke to me and now we wait for the results to see what happens next. Waiting is the hardest part as you said, very true. Thanks for the encouraging words. Chris x    ",
      "MessageIndex": 4,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23422/second-breast-opp-and-axillery-clearance",
      "Title": "second breast opp and axillery clearance"
    },
    {
      "AuthorID": "Busababe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/busababe",
      "Content": "Sarah thank you very much for the response, I am amazed by some of the stories on here, so many positive people, I have tried to keep very positive from the start but am not having a good day today, very weepy and my partner does not cope too well with tears, he just leaves me to get on with it. The waiting for the results is the worse bit, last time we were seen quite quickly this time the appointment is a good while after the opp, trying to keep positive about that using the stupid reasoning that they see everyone with the bad news first !!! thanks again   Chris",
      "MessageIndex": 3,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23422/second-breast-opp-and-axillery-clearance",
      "Title": "second breast opp and axillery clearance"
    },
    {
      "AuthorID": "Busababe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/busababe",
      "Content": "hello all, I'm new to this site in that I only joined tonight but have looked at the site for advice and info several times. I was diagnosed with Breasy Cancer in September, had my first opp on 23rd October which involved a \"wide local incision\" removing a 1 cm ish lump and surrounding tissue and a \"sentinal node\" procedure. When I was first diagnosed my nodes were clear but they thought they would \"take a look\" and probably \"cherry pick\" one node while they were doing my breast opp. When I got the results approximately 10 days after the opp I was advised that they took 2 nodes and both were positive and that they would need to go back in and take more, I was also advised that the lump was 3cm and the surrounding tissue was also positive so they would need to go back in and take some more and I was graded as Grade3 very aggressive. I was also told I will now definately be having Chemo and also Radiotherapy. 27th November I had my second opp and axilleray clearance and am still in a bit of a state of shock as I felt really well after my first opp and back at work after 2 weeks, and was totally convinced that I would just be told I needed Radiotherapy. This time I have felt really rough and won't be going back to work for a little while yet and still very sore and swollen  and still wearing my bloody PJ's ! I am waiting for the next results due next Tuesday when hopefully I will be told that it has not spread elsewhere and when I can start my Chemo.  ",
      "MessageIndex": 0,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23422/second-breast-opp-and-axillery-clearance",
      "Title": "second breast opp and axillery clearance"
    },
    {
      "AuthorID": "Busababe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/busababe",
      "Content": "hi Helen   thanks for the response, I didnt even know you could refuse the clearance ???? maybe that was not an option to me when they looked at my first opp results. there are a lot of positive people on here and that is very encouraging, even though some of the info is pretty scary and a lot to take in when things aren't as straightforward as you first think. Chris    ",
      "MessageIndex": 6,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23422/second-breast-opp-and-axillery-clearance",
      "Title": "second breast opp and axillery clearance"
    },
    {
      "AuthorID": "Busababe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/busababe",
      "Content": "yesterday started to get pains under left armpit and not sure if this is normal and whether it's the case of those Lymph Glands working harder as the others have gone ??",
      "MessageIndex": 7,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23422/second-breast-opp-and-axillery-clearance",
      "Title": "second breast opp and axillery clearance"
    },
    {
      "AuthorID": "Busababe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/busababe",
      "Content": "thanks for the response, glad that your news was good that it had not spread elsewhere, I will find out next week how many nodes they took and whether it has spread and hopefully when my Chemo should start xxx",
      "MessageIndex": 10,
      "PostDate": "10/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23422/second-breast-opp-and-axillery-clearance",
      "Title": "second breast opp and axillery clearance"
    }
  ]
}