{
  "AuthorID": "Butterfly523",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/butterfly523",
  "Posts": [
    {
      "AuthorID": "Butterfly523",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/butterfly523",
      "Content": "Hello TigerEve, I was on Letrozole for 5mths but My Onc took me off 2 wks ago as I suffered very quickly with joint/muscle pain and a swollen foot, amongst other things. Ive been put on Exemestane as an alternative. My Onc advised they are steroid based and will obviously take about 4-5 wks to get in my system properly but I feel a little better on this even after just 2wks. maybe this could be a suitable alternative? But I'm sure there are quite a few options available out there, I didn't realise this was available as I had also searched the internet and this one never showed up on alternative searches. I am sure your Doctor will be better informed, will be thinking about you :)) Julie x",
      "MessageIndex": 17,
      "PostDate": "11/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75972/letrozole-manufacturing-problem",
      "Title": "Letrozole manufacturing problem?"
    },
    {
      "AuthorID": "Butterfly523",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/butterfly523",
      "Content": "Good Evening TigerEve, I'm sorry to hear you have suffered for so long without being offered an alternative, I would push your Oncologist to try something else for you. I m quite active and do strength training like body pump and weight lifting but the Letrozole gave me so much pain I couldn't continue, I found it so hard to turn myself over in bed at night and agony getting down the stairs. I haven't had any weight gain and I'm hoping I won't with the exemestane either. I have read post that other ladies have gained weight, I'll keep my fingers crossed ;)) But now even after just 2 wks I do feel much better, I still have horrendous night sweats seriously don't know where all the water comes from I sleep on 2 bath towels with another towel pushed up under my top as I just soak the bed completely... I wake up with pools of water in my eyes ... Very sexy , but I guess it will get better with time,I'm not letting it stop me getting on with my life. I'm back into my training again and I'm off to Egypt for 2 wks in the morning so hoping the sun will ease my bones ;)) I'm 7mths post op, I was on tamoxifen for 2mths then my oncologist tested my blood to see I'f I was post menopausal as I'm almost 52yrs old, that's when he put me on Letrozole, I had really good clear margins so he decided not to give me chemo, I do tend to panic a little as I found a lump in my other breast last week but after having another mammogram it was nothing to worry about... Guess I will always have the doubt ... \" did they get it all\" Thanks for your email, I'll keep it .. Thought it might me nice for the other ladies to read the comments. Hope to speak to you again before I leave, if not hugs and kisses hoping your meds get sorted out. Julie xxx",
      "MessageIndex": 21,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75972/letrozole-manufacturing-problem",
      "Title": "Letrozole manufacturing problem?"
    },
    {
      "AuthorID": "Butterfly523",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/butterfly523",
      "Content": "Yes, would be nice to know how long it was before the hair thinning started, but as you say the joints are a lot easier. Julie x",
      "MessageIndex": 22,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75972/letrozole-manufacturing-problem",
      "Title": "Letrozole manufacturing problem?"
    }
  ]
}