{
  "AuthorID": "calador",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
  "Posts": [
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "hi peterawake, The request  for me from the oncologist to the GP asked for Letrozole . Femera,. but the GP refused point blank He said they were all the same and sent Cipla, the cheapest because he runs his own pharmacy. I managed to get Accord by going to a nearby chemist ,(he wasn't prepared to source Femera, )but I have to get a monthly prescription for Accord  from the GP's surgery and it doesn't always come through to the chemist so I have a wasted journey. I would be really grateful if anyone can explain if you can ask for your own prescription so that you can try other chemists if necessary.I have given up on the GP.   I have a yearly review meeting with the oncologist due on March 8th, but find all my questions seem to get muddled because I am so nervous. Can anyone au fait with the system help me about prescriptions.. and just a bit of input from me..If you are on Accord keep checking that it's ingredients don't include Tetrazine. They haven't up to now, Cipla did when I was prescribed it,but these companies keep moving around with take overs and I want to stay with Accord as long as it is still based in the U.K. Don't get me wrong I have terrible painful hands, but Accord hasn't given me side effects I can't cope with. However it isn't getting less in its side effects as I had hoped after seven months, so I am trying to stay on top of the Letrozole debate,    Lots of Love to  you and everyone .",
      "MessageIndex": 9,
      "PostDate": "17/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176576/letrozole-femara",
      "Title": "Letrozole/Femara"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "hello peterawake Thank you so much for your post re. Femera. As you may have seen on the Letrozole site many of us are concerned about this. My G.P also refused point blank to prescribe Femera to me despite the oncologist requesting it. I have had accord for seven months, but there was a hitch when it went out of supply for 12 days and I had to have Cipla..the cheapest which has tatrazine in the coating. I, too, am considering paying for Femera as i cannot now turn the car ignition key unless I use both hands, and groan if I accidentally bang my hands on anything. Yet i still wonder if Femera would be better, as I have a friend who had the same pain in his hands when his brother died, and he thinks it is an immune response to stress. I developed trigger finger pain before I started on Letrozole and the mind does have a strong effect on the body.  So if you do take this course, please,please  keep us posted if there is any improvement., as I hate the feeling of weakness and how hard it is to get up for work in the morning. I have my first annual meeting on March 10th following surgery and radiotherapy and now Letrozole, so am hoping my son will come with me to ask the oncologist some important questions ( my mind goes blank when I go into a waiting room) and I will discuss it with him, and post his comments to everyone. We are completely with you and good luck if you go ahead. my thanks again.",
      "MessageIndex": 1,
      "PostDate": "14/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176576/letrozole-femara",
      "Title": "Letrozole/Femara"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "hello Raychw, I am an older woman..way past menopause, and I had the same worries. However the operation was at 8.a.m, and after I had recovered and spoken to the surgeon, my brother and sister in law took me home where i cooked supper for them, and slept really well as there was someone in the house with me (essential i think for the first night). Walked upstairs, made tea , etc with no trouble. I later had seroma, which can happen to anyone, but was told to let it re absorb naturally, which it has done by gradually subsiding . I think providing you are in good health, leaving hospital as a day patient is a good idea, because there is less risk of infection. I had had my shower ultra cleaned before the operation, showered gently each day, and made a good and peaceful recovery at home. But would probably not want to do it without family support.",
      "MessageIndex": 6,
      "PostDate": "07/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156680/mastectomy-op-help",
      "Title": "Mastectomy op help"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "thanks fern2018, I will look up the anti cancer book. I have looked at Radical Remission which may be of use only if you have been given a very bad diagnosis Also there was a book called Killing Cancer by a Hollywood stuntman, not given long to live, who sold his house and he and his wife toured the world looking at herbal cures in villages, personally I found Fear by a buddist Thich na Hahn who was nominated for the Nobel prize, very helpful in facing the cancer word. Yes, the radiotherapy was really o.k. I felt I was doing something positive.Was worried at the thought of it due to lymphodema  etc. but, no cording etc. now six months on,it didn't hurt, I used creams and water gel Rad1 and Rad 2 and sailed through it. Met lots of lovely people in the waiting rooms  It goes very quickly once you get to half way. See if you can get appointments to miss the rush hours and thank you again for your post and comments. Lots of luck. and hugs.",
      "MessageIndex": 18,
      "PostDate": "10/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169437/is-anyone-trying-fasting-restricting-calories-before-chemo-to-reduce-side-effects",
      "Title": "Is anyone trying FASTING (restricting Calories) before chemo to reduce..."
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "Hi Fern2018, you have done an amazing job in trying to help yourself through treatment. Congratulations. Fasting can't have done any harm in moderation because for centuries people have followed this for health and detox. I haven't seen the U.S.A research into fasting and wish we could have some enlightenment on alternative treatment as I have been looking at ways of helping myself now that I am through radiotherapy and on hormone tablets. The radiotherapy went very well.I was able to work all through , and had no fatigue. The tablets are not so good for me. I hate being on them due to hand pain,mood swings,  itching, slow movements and feeling old with none of my usual energy.  One view is to not eat high protein food like beef eggs etc, and rely on carbs when hungry. This was on an American site. I believe completely in the work the doctors do. I am certain they want to save lives, and the advice always is to follow a balanced diet. Yet we have all these other  published reports from Universities (like the asparagine scare.) The oncologists say \"no alcohol\" ; my surgery doctor said \"have what you enjoy...yes a glass of wine even\" I went to the funeral of my very special friend on Friday and drank three proseccos..then was mad with myself for drinking them. At the moment I am overdosing on black grapes due to looking at an American site. They can't harm me ,apart from the fructose, and it gives me a feeling of taking control a little, but is it foolish.?  I am sure other ladies on this wonderful site will have shared my thoughts and anxieties, and it would be good to know if there has been any new trials or successes in diet alongside conventional  treatment to give us hope. We aren't being un-coperative or difficult. Just very fed up most of the time and trying not to feel like a helpless victim. Thank you very much again for your post, as it has focused on the issue of diet. And very much love and good luck to everyone",
      "MessageIndex": 16,
      "PostDate": "10/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169437/is-anyone-trying-fasting-restricting-calories-before-chemo-to-reduce-side-effects",
      "Title": "Is anyone trying FASTING (restricting Calories) before chemo to reduce..."
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "It is available in the u.k. My local surgery gave me a prescription after I told them that the oncological dept of theJihlava hospital was so impressed with the way it protected the skin, that they decided to use this product on patients having radiotherapy focused on the head and neck and said that in their experiences it was evident that it significantly improved the quality of oncological patients and the hospital saved on the cost in regard to having to have dressings etc. treating other cancers they stated that when R1 and R2 were used as a preventative from the beginning of radiotherapy there occurred almost no post radiation reaction during the entire treatment and the few which occurred were not difficult.  I used it and had only what I think might have been an allergic rash after the treatment, but no real discomfort and would recommend the treatment with confidence. A treatment to cover about 15 sessions costs approx £89 and can usually be obtained by a chemist, or ordered on line. Good luck with everything. Radiotherapy is brilliant now, targeted only to the right areas, and was the most effective and easiest part of my treatment. It will be alright.  Love and hugs x",
      "MessageIndex": 5,
      "PostDate": "12/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174497/r1-r2-creams-for-radiotherapy",
      "Title": "R1 R2 creams for radiotherapy"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "Hi Clare, Sorry late answering. I have just finished radiotherapy, and was told they would only zap the right hand side of my chest although I had a double masectomy. because the left hand side was clear for lymph nodes, and I think they felt they had caught everything with surgery. So the radiologist will tell you if you ask which area they cover I was able to get R1 and R2 and it has been marvellous. No change in skin colour at all..slight burning feeling under the armpit near lymph node removal, but pretty well o.k. most of the time. I think it is even worth buying the R1 and R2 just for peace of mind for anyone just waiting to start. It is used  for head and neck cancers, in a Swedish hospital as they were so pleased with trials of it. I have a sensitive skin with psoriasis so was full of fear. Now 15 days later very relieved. met some lovely people, radiologists very clever at pinpointing target, and not upsetting other areas, Will miss the camaraderie in a way.  So go for it. I should never have been so scared..it didn't happen.   Love to all.",
      "MessageIndex": 38,
      "PostDate": "06/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "thank you Leolady, I hope you are not stepping off for good as I have learnt from your posts, and they have always been uplifting.",
      "MessageIndex": 119,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "Hi,  I have had a couple of weeks now away from treatment, and feel strange, because still can't wear a bra so can't wear anything pretty for the sunshine. Left side healing well after the double masectemy, and  right side skin also good thanks to the accuracy of the radiologists and R1and R2, but right armpit where lymph nodes area treated still very sore and sensitive . Would love to put a summer dress on without feeling like a flat chested boy so would Enhancing your Recovery help and what does it cover. ? and ,please, does anyone have any suggestions for wearing a bra ( I have sent for knitted knockers but they will take a while) Has anyone tried wearing a bra on top of a silk cami for instance.? The bras are good from M & S ,also Royce and Amoena but they have so many gaps for the fillings to move out and itch and the bras seem to move enough to irritate. I looked up gel dressings, but wasn't sure about what to order in cms for an armpit and can you wear them under dress sleeves. Very aware I am so lucky to have a break from appointments and fear, so realize these concerns are trivial and a bit ashamed of posting them.  my thoughts are always with the ladies on this journey....  I will be back in the fight in September. Keep fighting.!",
      "MessageIndex": 120,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "thank you,scriptfan. If it is alright with you I am going to copy this onto my phone (if possible) and carry it around with me.  It is so nice to be told it is alright to hurt. .and so we keep on going. There are new things out there everyday. I am researching Flaxseed at the moment, but I realize there is no magic bullet...........yet.. There will be I am sure one day. love to everybody.",
      "MessageIndex": 5,
      "PostDate": "06/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/175920/for-anyone-whos-struggling-3",
      "Title": "For anyone whos struggling <3"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "hello Bonnie, Just taking the chance to reassure you. I had double mastectomy, radiotherapy  etc.last year then told just to take Letrozole as I was all clear, at least for a time. So should have felt less worried. But I was seeing double when tired..two cars instead of one if I tried to drive ..and terrified it might be a brain tumor. Saw an optician who could find nothing wrong and my G.P said he thought it was caused by tiredeness anxiety and stress but, to be sure, he arranged a brain scan.    it came back as all clear...so we had a lovely Christmas instead of all the family being worried. So it is a good example of why it is worth seeing a GP or oncologist when concerned. There are loads of other reasons why we have pain but because we are cancer patients it is very difficult to stay rational.( I was spooked because a hairdresser told me that breast cancer always went upwards  (not true) but it added to my dread ) . My advice would be to see a doctor, and with all my heart I wish you well.",
      "MessageIndex": 3,
      "PostDate": "13/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179558/secondary-scare",
      "Title": "Secondary Scare"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "Hi MammaP, Thank you so much for your story. We all on this brave site try to put on a happy face, but we must all have our bad days  no one knows about. That awful feeling first thing on waking, the unstoppable tears at a funeral when a dear friend dies. ,I,too, am a fighter..my life has been  eventful including two husbands who both died of cancer ,heartbreak with children's troubles and still trying to be there for them, and I am still working full time and  lying about how old I am. (don't ask!). I had double mastectomy last year, now on Letrozole, but as they don't test women over 70 unless you ask, I had a very late discovery of the disease (wish I had known you can ask for a test.)  so  5 large lymph nodes all infected ,breasts removed but at risk of recurrences so very fearful. Your amazing story has given me strength to keep going. I didn't realize that with recurrence they will still try to treat you, Your detail was inspiring, So every time I feel fed up I will remember your story and carry on flying the flag. I hope that you can feel the warmth and love on this site and wrap it round you.  I often think that there are many unsung heroes on our site, including the Macmillan team who run it., and people with hard to handle life events, So thank you and stay strong.  Much love.",
      "MessageIndex": 7,
      "PostDate": "17/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176595/two-cancers-four-tumours-and-a-gsoh-just-saying-hello",
      "Title": "Two cancers, four tumours and a GSOH! Just saying Hello!"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "hello Lindsay, You can't imagine the waves of appreciation and love we all feel for you. Like everyone else I was helped so much by your posts when I first joined a year ago,and since then, when trying to post myself and being so short of the time to do it with all the other things going on ,I have realized how much time and effort you put in to help so many of us.  I also completely understand the need  you now feel for 'me time'. I went to the funeral of a friend a few weeks ago whom I had known for fifty years..now I am the last of the four of us ..and feel the loss terribly remembering the shared holidays in the sun as two couples and the heedless time gone. I am considering giving up my work to have time to appreciate the coming spring, feed the garden birds, read books, grow herbs.meet up with the children (who all have their problems in this modern age )and to be able to sit down in the afternoon for half an hour without guilt for all the jobs waiting to be done. (I have ironing waiting which has been climbing a wall for two months now!). and Letrozole gives me no incentive to start ironing.! So with all my heart I wish you and your family some good times together and a peaceful year. You really do deserve it.",
      "MessageIndex": 13,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178934/shout-out-to-lovely-leolady56",
      "Title": "Shout out to lovely Leolady56"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "Hi WhatHappened, many many thanks  again for your support. Off to work now (late) but will click friend request when back home.  MEANWHILE..     TARTRAZINE      in CIPLA .. THIS IS BANNED IN NORWAY AUSTRIA AND GERMANY AND THE U.K. FOOD STANDARDS AGENCY CALLED FOR A VOLUNTARY PHASE OUT OF E102 (Tartrazine) by 2009.      SO WHY ARE WE BEING GIVEN THIS (check the side effects)  IT IS POSSIBLY MADE IN INDIA . (they do not have our regulations. Will try to check it out) so perhaps we aren't neurotic females.  I don't want to be branded as a trouble maker, but we go through loads of miserable moments very bravely and I don't see why we should have to have drugs containing a colourant banned in other countries, so does anyone have any other thoughts. Love to you all",
      "MessageIndex": 15,
      "PostDate": "14/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174409/supply-of-accord-letrozole",
      "Title": "supply of accord (Letrozole)"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "hi What Happened, I did love your post. It made me smile for the first time in days..especially the \"secret group\" . Unfortunately my doctor insists that they are all letrozole, but his practice's pharmacist, who was sympathetic, did manage to put\" accord only \"on the prescription she passed onto the local chemist. He has been pretty good about supplying Accord, but refuses to order femera unless I pay privately (over £100) a month. My oncologist had given me a prescription for Letrozole-Femera\" but both the doctor and the chemist totally ignored that and the oncologist did say a lot of doctor's won't supply it because of the cost. I am worried about the time gap in getting Accord because of the macmillan nurse telling me it leaves your body after a week, but then a Tenovus nurse said \"after all you can have diarrhoea and lose the drug for days and it isn't the end of the world So who do you believe? I have tried a local Boots, but they say they have to take anything they are sent and can't specify a brand, so I am waiting now another week  as Accord Customer Services said the wholesalers should be getting another delivery soon. Where is the delivery from ..India? or is it still based in barnstaple. who knows. Meanwhile the local chemist is saying why not accept Manx instead of Accord. I said \"never heard or it\". He said \"because it is Letrozole \" I despair and wish I could get him and my doctor onto\"\"just letrozole\" because like you I now have painful hands and can't start the car unless I use two hands, and can't open a pull can...all physical things not neurotic female imagination..  How do you cost out the sort of misery the side effects have on us(Incidentally re trigger finger (which I also had post radiation)...the first finger next to your thumb is believed by the Chinese to be your stress finger.!) . Enough. I will keep trying to become part of the \"secret group\" of ladies, or at least keep to Accord. Love and hugs and thank you.  As LeoLady said the letrozole problems rumble on ......but waffling helps a lot!",
      "MessageIndex": 7,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174409/supply-of-accord-letrozole",
      "Title": "supply of accord (Letrozole)"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "thank you so much mistymoley. It is so comforting to receive common sense when there is a feeling of panic. I will certainly try to stay on letrozole, but the facts on survival are interesting. I had five lymph node removals on the right side as they were many centimetres and each one had been infected.  My doctor has already refused to give me anything except Cipla,because he runs his own practise as a business with it's own pharmacy and Cipla is the cheapest, so I am still trying for accord first , as the BC nurse did say the drug was the same but the colourants different.  I do agree that treating yourself and putting your comfort as a priority is good for us...I love a log fire and a crumpet...and red wine...and thank you again for the support. It means a lot. Will post if I find any new information about letrozole.",
      "MessageIndex": 3,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174409/supply-of-accord-letrozole",
      "Title": "supply of accord (Letrozole)"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "Thank you Marie-Francoise. Sorry I am late saying this as I have been rushing around, but it is interesting  to know how others are coping. and my best wishes also to you for good health. It was kind of you to post.",
      "MessageIndex": 8,
      "PostDate": "08/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174409/supply-of-accord-letrozole",
      "Title": "supply of accord (Letrozole)"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "thanks seaspirit44 and WhatHappened. Still no Accord available. Advised by BC nurses, and chemist not to let the Letrozole out of my system (5 days off and it is half gone 10 days completely gone.) A week since my last tablet and had an unopened packet of Cipla from my doctor's surgery, which I had turned down,  so took  tablet on friday night..not much difference at first except for a headache on waking which I hardly ever have and later awful pain in my hands which were very claw like and walked up to bed with difficulty So took 2 capsules of max strength for cold and flu which has paracetemol, caffeine, and  phenyleptine and less pain today ( Sunday)  but very stiff in the joints and especially knees...groaning on the way down to look in a cupboard or clean the log fire.    I have just compared the leaflet details in the Accord packet and Cipla.  There are different coatings. Accord has 5 including talc..Cipla has 6 and the extra one is Tartrazine (E 102).  The chemist had said he could get Manx which is new. I rang their office and asked where they were based ......India.  Now with Accord and Actavis changing ( I can't find out which has taken over the other)  I am just confused, and wish someone professional would investigate. I only know that sometimes it isn't the doctor's fault that we can't have Femera. They have guidelines from NICE to \"remember to order the cheapest \"   We are lucky to have Letrozole but yes...\"Oh for those happy carefree days\" (seaspirit44) Better news next week and good luck for all of us. We can win.",
      "MessageIndex": 13,
      "PostDate": "13/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174409/supply-of-accord-letrozole",
      "Title": "supply of accord (Letrozole)"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "hi everyone, I need help. I started taking Accord (Letrozole) five months ago and was very scared of the side effects reported, but was lucky to only  (hu.only) have painful hands, brain fog, emotional reactions to even minor problems, etc all of  which made me feel not myself at all, but were manageable I could still work, even although I am in the older age group.   I need to do this as I have a son who is in financial trouble and also being busy is a great distraction from unhappiness.  So I was determined to stay on the drug but wanted to avoid Cipla or Activis because of the bad reports on our site. Now,today, my pharmacist says he can't get Accord and offers Teva or something called Manx . Macmillan nurses have given me phone numbers for Novartis and Accord, which I will ring tomorrow but have warned me that after 5 days half the benefits of the drug leave the body and after ten days it is gone completely so I mustn't wait too long or all the effort to stay on it will be wasted. So,please, has anyone any information about the alternatives, is it worth, even if I could afford it, buying Femera privately (some people don't get good results even from this). I think Accord has been bought up by Activis, so is it still being made here in the U.K. Any contribution would help as I am beginning to lose the plot and feeling fearful again, just when I had settled down after the treatments. (The radiotherapy was really much much easier than I had imagined..I am going to post details later ,) but this drug is hard to handle. Happy New Year to all the brave people on these forums......we are still fighting. Good luck in the New Year.",
      "MessageIndex": 0,
      "PostDate": "07/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174409/supply-of-accord-letrozole",
      "Title": "supply of accord (Letrozole)"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "hello ShazH, I had a similar experience. Double masectomy in June 2018, and a request from my surgeon to the radiotherapy dept for radiotherapy to be implemented. Was told it would be in about six weeks time. After 8 weeks my son rang the nurses to ask what was happening. They said it would be alright I would hear soon. After 11 weeks apparently the surgeon asked how I was getting on and there was a big flap and an urgent phone call to go to the hospital immediately when they realized I was still waiting. They said I was still \"within the window\"..just. Apparently you should be having treatment by 12 weeks. It takes at least two weeks to have tests, so I was scraping through the time limit. My son says now he wishes he had been more forceful, but we trusted the nurses, and also I was very sore on my skin so  in no hurry to start irritating it.  So our advice is to push hard for an appointment....my fears of the radiotherapy were unfounded. I used R1 and R2 water gel (look online doctors can get it ) which was brilliant and had no problems. Radiotherapy nowadays is very accurate and only targets the right area. It was the easiest part of my cancer journey.    So now I am waiting for my annual check up but anxious in case the delay has been dangerous. So anxious that my surgery doctor sent me for a brain scan because I was getting double vision. He said at the time he thought it was simply anxiety but he wanted to be sure. He was right. The scan was o.k. (some good news)  . but I wouldn't want you to make the same mistake. So push really hard for an appointment NOW and you will be glad you have done it.  Lots of luck and loads of hugs",
      "MessageIndex": 6,
      "PostDate": "31/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174643/timescales-for-rads",
      "Title": "Timescales for rads"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "Does anyone have any experiences of the effects of Femera and Letrozole?",
      "MessageIndex": 0,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158704/hormonal-treatment-differences",
      "Title": "Hormonal treatment differences"
    },
    {
      "AuthorID": "calador",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/calador",
      "Content": "I read this letter and every word helped. thank you.",
      "MessageIndex": 668,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159720/thought-for-the-day",
      "Title": "Thought for the Day.."
    }
  ]
}