{
  "AuthorID": "CaptainHaddock",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/captainhaddock",
  "Posts": [
    {
      "AuthorID": "CaptainHaddock",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/captainhaddock",
      "Content": "Hi, has anyone had any scans since finishing Herceptin?  My Health Care At Home nurse said I should be offered a scan at the end of Herceptin because I was concerned to know how they can check whether the cancerous cells have all gone.  I know you get regular mammograms but what about on the side of the mastectomy because they obviously can't do a mammogram on that side.  Several people have asked me if my cancer is in remission - how do I find out? p.s I did have scans before chemo started to check whether it had spread e.g. bone scans but they showed nothing anywhere else.  Maybe I'm hoping for an all clear that can't actually be given?! I'd be very grateful for other people's experiences.",
      "MessageIndex": 0,
      "PostDate": "16/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42513/scans-after-herceptin",
      "Title": "scans after Herceptin?"
    },
    {
      "AuthorID": "CaptainHaddock",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/captainhaddock",
      "Content": "Such a relief to read these posts - I've just come back to the forum having not posted for a long time, specifically to see if anyone mentioned joint pain and aches.  I finished chemo mid June and radiotherapy last Friday and started to get joint ache in the middle of my radiotherapy.  Like some of you, I feel really old and decrepit especially in the morning when I can't even walk properly; but worst for me is in the night when, bizarrely, my forearms ache so much that I could almost want to cut them off at the elbow and end up having to take painkillers.  I've been on Herceptin since May, but I also had Docetaxol so I wasn't sure which was the culprit.  I also get completely numb/dead ring fingers.  None of this helps my insomnia!  I was beginning to think I had done so well with my chemo, but I've actually been worse since finishing!  I'm hanging on to my finger nails but they've gone really horrible in the last couple of weeks too.  What I'm hoping is that this doesn't last until I finish Hercepting next April cos I'll have gone mad by then.  I'm going to try tonic water and  all the other advice, but THANK YOU all for reassuring me that I'm not mad or paranoid. Flissx",
      "MessageIndex": 37,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "CaptainHaddock",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/captainhaddock",
      "Content": "Thank you so much for your replies Cat and Theresa - it really does help to know that others are suffering the same (sorry that sounds awful, like I'm hoping others are suffering too - I really don't mean that!!). You're totally right, Theresa, we sound EXACTLY the same!!  Each night I think 'I'm not going mad, I definitely didn't sleep on either arm so why has it happened again'.  I've taken to trying to sleep on my back again like I did after my mastectomy but I don't fall asleep easily on my back.  I've wanted to take the sleeping tablets the dr prescribed when I was first diagnosed but because I've had to drive  25 miles early in the morning every day to the hosp for my radiotherapy I was worried I'd still be tired when driving.  It gets so depressing being awake from 3 or 4 in the morning and falling asleep at about 7 just in time to get up! I too asked about it and the onc said he had heard of people having pins and needles but had never heard of anyone having aching arms - why do I seem to learn more from people on these forums than from the experts?!  He made me feel like a bit of a hyperchondriac. I then asked the BCN and she just said that the onc would have prescribed something if he was concerned - but what about the fact that I am concerned?!  Like I said, it's just good to know that I'm not imagining things or being a hyperchondriac!  I just hope it ends as quickly as it appeared.  I too like my G & T's and had not noticed that they made any difference so I'm not sure the T on its own will, but I'll give it a try.  I don't think I can get used to T without G though!  Thanks so much for your reply. Fliss x",
      "MessageIndex": 40,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    }
  ]
}