{
  "AuthorID": "carolep",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolep",
  "Posts": [
    {
      "AuthorID": "carolep",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolep",
      "Content": "Thank you that makes a lot of sense..yes I have sponsors and another of my friends that has been touched by cancer is the hairdresser that is doing it .It was going to happen on the 30th of September whets she is having her mcmillion biggest coffee morning..and she's hired lots of stuff and hopes to raise more than sha an.   did last year ...another thing you May  be able to to give your feelings on....My friend who's starting chemo was thinking of doing it too ..so that when her children see us maybe it won't be so hard..Om not in a position to know how they would feel.but maybe you do ?.XXXX",
      "MessageIndex": 199,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "carolep",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolep",
      "Content": "Hi all  I have read the comments and I know I have not had cancer . I am doing h brave the shave this month and now I am not so sure . My reasons were not to shave my head so I \"know what it's like\" I lost a friend last year to this horrid cancer and now another close friend will start her Chemo on the 12 Sept . my reasons for doing this is she is so so scared and hates the thought of loosing her hair.   I mentioned to her that If I shaved then when we're out maybe just maybe she'll cope with the 'looks she's most worried about \"  And if people want to pay at the same time then may be a good thing .?   I was there everyday my friend was ill untill the end and I would never ever want anyone to think I know what it's like only the suffered knows that. I would like your thoughts on this...If I could still run I would do another sponsored run but knee injury won't let me . I just want you all to know that I have no idea what you are all going through and would never do this and think I do ...bless you all you are sooooooo brave xx ",
      "MessageIndex": 193,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    }
  ]
}