{
  "AuthorID": "carolineD45",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
  "Posts": [
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi Elaine, I am sorry hear you are having difficulties to stay positive - it is just very hard to to through all this - not knowing whether things will work, and what's next. Although not in exactly the same situation as you, I am on letrozole, and I was told letrozole has been shown to be very effective in dealing with er+ breast cancers. Perhaps just give your BCN a call, or the help line here, to help you feel a little better. The helpline is very good. What is the plan for you - are they going to do surgery at some point? Is the letrozole bein used to shrink the cancer ahead of this? Wishing you the very best Caroline",
      "MessageIndex": 1,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57192/letrozole-as-1st-treatment",
      "Title": "Letrozole as 1st treatment"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Oh I am so sorry to hear your mum is going through this, and it must very hard for you to see her in so much pain. Everybody's experience with Taxatere is different. I see some resemblance in what your mum is going through and my experience earlier this year. So perhaps it helps you to read what I went through - and from my nurse specialist I understand that this is not uncommon: My experience with Taxatere was also severe bone pain, which set in about three and a half day after each Taxatere chemo treatment, and would last for about 7 days. Then it would subside and the world seemed to be a much better place again. It must have been so hard for my family to see my in such pain. I managed the pain with paracetamol, ibuprofen and (prescribed) stronger pain killers. This took the edge of it. In my case the pain was in my bones - not constant, but at random times I would feel as if little gnomes with very sharp pointed boots were kicking me very hard in the legs. Not something I had ever experienced before. The painkillers affected my digestive system and I was very constipated which was very painful (which was resolved with Movicol). In this pain-week I was not a happy person (understatement). But my nurse specialist did assure me that the pain was temporary, and she was so very right. And then by the time of the next chemo session, with the aid of strong steroids I would be totally bouncy again. So I hope your mum is getting through this ok - my warmest wishes go to you and her. Caroline",
      "MessageIndex": 3,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44163/taxotere-pain",
      "Title": "Taxotere pain"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "I have had mine removed. My story is a little different from yours though: I had a second primary BC, which was also er+. The oopherectomy was done at the same time as my second mastectomy, with keyhole, so that part of the operation was quite quick, with just a two tiny scars :-) I had no problems after the operation from that. I had had chemo for my first BC in the early part of the year, followed by first mastectomy in march, then radio. I was then o n tamoxifen, as before all this treatment I was not post menopause, though chemo stopped periods permanently. Then in autumn i discovered another primary in second breast, so as that was also er+ like the first one, my surgeon suggested oopherectomy was done. (i guess tamoxifen did not stop me developing that second tumor). I am now on letrozole, which I hope will keep me safe. I recommend you read th Macmillan literature on oopherectomy. Having no ovaries and suppressing further oestrogen production with letrozole you will be at risk from osteosperosis. I am taking vitamin d and calciumtabletsforthis (prescribed by oncologist). Also you should have a bone density scan (dexa scan) after oopherectomy, and then more every two years,to keep track of the health of your bones. In my cases didn't have to think long about whether to have the ovaries removed or not (because of the second primary). Your case is different though - I hope you come to a conclusion that works for you :-). Remember there are always the Macmillan people at the other end of the phone, and it may be a good idea to discuss this with them too. Very best wishes, Caroline",
      "MessageIndex": 8,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51350/anyone-had-ovaries-removed-as-a-precaution",
      "Title": "Anyone had ovaries removed as a precaution?"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Very sorry to hear your husband is going through all this. If this helps at all, there is a story of a man in Suffolk who went thruogh this last year that your husband might find interesting to read: http://news.bbc.co.uk/local/suffolk/hi/people_and_places/newsid_8797000/8797488.stm very best wishes, Caroline",
      "MessageIndex": 5,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/37136/men-with-b-c",
      "Title": "men with b/c"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi Lorna Wishing you the very best of luck for tomorrow. Hope it all goes very smoothly for you. You'll be sound asleep for part of the day at least, with no worries or pain :-) . Warmest wishes Caroline.",
      "MessageIndex": 1,
      "PostDate": "13/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47106/mx-tomorrow",
      "Title": "MX tomorrow"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi Tracey, I have had two primaries too. First one in autumn 2010. Then a second one autumn 2011. Mine were both er+ so I had ovaries removed at second one. Happy to pm if you want some more info. They told me it is highly uncommon to have two. Very best wishes, Caroline",
      "MessageIndex": 11,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53121/diagnosed-with-breast-cancer-for-a-second-time-in-opposite-breast",
      "Title": "Diagnosed with breast cancer for a second time in opposite breast"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi Annie Well done you for going on holiday! Will be sending positive thoughts in your direction tomorrow, and hope your meeting with onc will be ok. Do tell your onc how you are feeling. Is there any complementary therapy available at your hospital that you may try? (eg massage, reflexology, counselling etc). That helps some people, so worth asking. Just something to help you relax. Treat yourself to something nice. Hugs Caroline",
      "MessageIndex": 17,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52189/terrified-of-onc-appt-tomorrow",
      "Title": "Terrified of ONC appt tomorrow :("
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi Annie Well done you for going on holiday! Will be sending positive thoughts in your direction tomorrow, and hope your meeting with onc will be ok. Do tell your onc how you are feeling. Is there any complementary therapy available at your hospital that you may try? (eg massage, reflexology, counselling etc). That helps some people, so worth asking. Just something to help you relax. Treat yourself to something nice. Hugs Caroline",
      "MessageIndex": 2,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52189/terrified-of-onc-appt-tomorrow",
      "Title": "Terrified of ONC appt tomorrow :("
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi, I did not have an injection, but had my ovaries out instead after I had a second primary within a year of finishing chemo and radio and being on tamoxifen for first primary.... I am now on letrozole, for which you need to post menopausal, and hopefully that will keep me clear. My second primary was grade 3 too, and no chemo for me, sounds like same sort of Reason you mention. Happy to pm if you want more info. I was premenopausal before all this happened. Caroline",
      "MessageIndex": 1,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53966/has-anyone-been-brought-into-early-menopause-by-injection",
      "Title": "Has anyone been brought into early menopause by injection."
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Wishing you the very best with your upcoming treatment. . I ve had two bone scans. Just closed my eyes and imagined I was lying on a far away beach in the sunshine. It helped me relax and I almost fell asleep. Perhaps you can do something similar :-) I did not try the microwave option for dinner though :-) well done for thinking of that one - a good laugh does help coping - so thank you for sharing that one too :-) Warmest wishes",
      "MessageIndex": 2,
      "PostDate": "17/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49967/my-results",
      "Title": "My results"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Well done on completing your taxatere treatment, and what excellent news that it appears to have shrunk the tumours! That's an advantage if doing chemo first - you can see hat t really works :-). As for the finger nails, yes, that's a side effect of taxatere. I had 4 lots of tax and it really affected my nails. I managed to keep them on, but there were plenty of people on here and on the breast cancer care forums who lost their nails, even a few months after finishing chemo. But your nails will grow back. I am just over a year post chemo, and my nails are fully recovered. But while they were painful I had to be very careful, could not open a tin, or do anything that required pressure on the finger tips. Playing a string instrument was definitely not possible, sadly. I hope the fec will be a little better for you. Wishing you he very best.",
      "MessageIndex": 3,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49434/very-sore-fingernails",
      "Title": "Very sore fingernails."
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "This is my experience: My first biopsy was very painful - it felt like I was shot in my breast three times. So like you, i was very very worried when I had to have a marker fitted. I told the nurse and the radiologist I was very worried, and how much pain I had had. Well... They were ever so kind and very gentle with me, and it did not hurt at all! The man who did it explained that because the fitting of the marker was with ultrasound guidance, they could also see whether that area was numbed before putting in the marker (coil). Such a relief. I hope your experience with having the coil fitted will be like mine :-). Wishing you well. Caroline",
      "MessageIndex": 1,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51241/coil-marker",
      "Title": "Coil Marker"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "I had my first mastectomy just over two years ago. Never having had surgery before, I was in fear of the worst.... I could not believe there was life after the operating theatre... I still remember waking up afterwards, feeling an odd sense of relief :-). I was also very pleasantly surprised that I had so little pain after the surgery (mastectomy with reconstruction with implant and lymph nodes out over five hour surgery in total). I was on the ward overnight, with two other ladies who had had breast surgery too. When the nurse came in asking who wanted pain relief, they were both desperate... I felt like a fraud as I did not need any, so just requested some too as I did not want to be missing out. Paracetamol times two. In total contrast was my second mastectomy less than a year later (how unlucky to get BC twice) - I was much less worried about the surgery (phew). But the pain afterwards was much worse - and I required several lots of morphine and an extra night in hospital. Happily the pains subsided soon :-). And I am still here :-) Caroline",
      "MessageIndex": 22,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57911/recent-diagnosis-has-left-me-stunned",
      "Title": "recent diagnosis has left me stunned."
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Concerning the impact of radiotherapy, as others said before, we are all different, and you cannot tell in advance how your body will be affected by it. I was off throughout (but I had had chemo before, so was very tired from that still too). As you are preparing questions - here is some information which may help you think of more to add to your list: Question to ask your oncologist is how many weeks you will have radiotherapy, and whether it will be five days a week, or less. Plus whether you can select the time of day that you are booked in. From experience I know that having an appointment first thing I the morning is good - that way you get it over and done with quickly, and don't have to watch the clock the rest of the day until your appointment. Bear in mind also how far the hospital is from where you live - and whether appointment time can avoid having travel time in rush hour... But then again you may not be able to pick your time, as they may already have booked that to others. An early appointment is good, as during the day there may be small delays, which build up to larger delays later in the day. You may find that you are spending a lot of time in the hospital during radiotherapy. Plus there are the regular checkups by your oncology team throughout this (ask how often). I hope this helps a bit. Do write down all your questions, and take the list in with you - then trite down the answers as you go along, because by the time you walk out of the meeting you may have forgotten half . Very best wishes, Caroline",
      "MessageIndex": 4,
      "PostDate": "27/04/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60115/time-off-work",
      "Title": "time off work"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi Rebecca, Remember that you always have the option to go to another hospital for your reconstruction, if you think your current surgeon can't offer you the results you need. There are some hospitals who offer a much wider range of reconstructions than others, and iris worth finding out if there is another place which could help you get the result you want. Your current surgeon may even be able to point you elsewhere. Good luck, Caroline",
      "MessageIndex": 10,
      "PostDate": "30/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53721/reconstruction-surgery---help",
      "Title": "Reconstruction surgery - help!"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi, it is worth checking with your hospital re parking charges for oncology patients, and also to phone the Macmillan helpline to see if there is anything that they can suggest about financial support. In some hospitals they can now give herceptin as an injection to some patients. Worth checking with your oncology team about that. Reduced the time you need to be there :-) Good luck",
      "MessageIndex": 13,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75455/no-financial-help",
      "Title": "No financial help!!"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi, it is worth checking with your hospital re parking charges for oncology patients, and also to phone the Macmillan helpline to see if there is anything that they can suggest about financial support. In some hospitals they can now give herceptin as an injection to some patients. Worth checking with your oncology team about that. Reduced the time you need to be there :-) Good luck",
      "MessageIndex": 28,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75455/no-financial-help",
      "Title": "No financial help!!"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Hi Shelley, I am sorry to read you ct scan being so strange and worrying. You are supposed to be recovering from all your recent treatment, not having more stuff like this t deal with. Big hug. I hope you can find something distracting to do and enjoy, while the doctors figure out what is happening., and what to do about it. Just rotten stuff this cancer business. Wishing you the very best, Caroline",
      "MessageIndex": 6,
      "PostDate": "04/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53915/worrying-scan-results",
      "Title": "Worrying scan results"
    },
    {
      "AuthorID": "carolineD45",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolined45",
      "Content": "Well done - I hope the chemo will go smoothly for both of you. Wishing you both the very best. Have you seen any of the articles about Andrew Tokely, who was diagnosed with breast cancer a few years ago, and had to go through surgery, chemo and radiotherapy too. He was interviewed by a number of newspapers a little while ago, and gives a lovely positive spin on things. Perhaps worth checking out - just to know there are other men in this situation. I hope that helps. In his latest blog he writes that he is feeling well, and long may it continue. :-) Caroline",
      "MessageIndex": 9,
      "PostDate": "08/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56915/men-and-breast-cancer",
      "Title": "Men and Breast Cancer"
    }
  ]
}