{
  "AuthorID": "Carolw330",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolw330-",
  "Posts": [
    {
      "AuthorID": "Carolw330",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolw330-",
      "Content": "Hi Marie Thanks for information I’m still waiting for a scan to see if have clot or not.  In meantime have been injecting stomach once a day with blood thinner and taking painkillers every 4 hours. Arm still uncomfortable, nurse is due tomorrow for taking blood and flushing line.  When I rang about my PICC line trouble I was advised if no scan done to have nurse take blood from other arm and not use PICC line.  Next chemo due Wednesday if no scan done I’ve to have it administered in my other arm not PICC line. Don’t know why scan taking so long something to do with radiology department waiting 4 days so far. Meanwhile have to put up with discomfort until scan and then have to put up with blood and chemo being done in other arm. Until scan done not sure what to do but will ask about central line. Carolw330 ",
      "MessageIndex": 12,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143208/picc-line-or-not",
      "Title": "PICC line or not?"
    },
    {
      "AuthorID": "Carolw330",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolw330-",
      "Content": "I had a PICC line inserted recently in my arm which was not pleasant to have my 12 weeks of chemo once a week.  Initially it was ok it was done on a Tuesday with the first chemo administered on the Wednesday.  I was fine on the day after chemo but on the Friday noticed my arm had swollen and was red.  I rang the help line and they suggested I went to hospital as it was in the evening.  I attended the hospital which was 25 miles away my daughter took me in.  I was put into a bed and left for  many hours eventually a doctor came to see me and stated he didn't think I had an infection but may have a small clot which was causing swelling and a scan would be performed on the Saturday morning.   Blood pressure was taken regularly and I had an injection into my belly to thin blood to help with any clot.   On the Saturday morning I was visited by a consultant who told me no scans were done over the weekend and he would discharge me with some self administrating needles to inject my belly to thin blood and I would be contacted on Monday for an appointment to come in for the scan.   I have managed injections and am now awaiting appointment for scan, however on Tuesday the district nurse is due at home to take blood from PICC line and flush out before my next season of chemo on the Wednesday. I am conscientious of the PICC line all the time and have difficulty sleeping it is sore and uncomfortable plus sometimes I have a slight pain at the top of my chest, on reading about PICC lines I understand they are convenient for administering chemo and taking blood etc but feel the details were not fully explained when treatment was decided. I know chemo treatment is not easy and as far as side effects I am not doing too bad at this early stage but find myself very low and wanting to have the PICC line removed due to the pain and awkwardness when doing simply things and trying to sleep.  I am awaiting phone call for scan and trying to stay positive.  I am TNBC stage 2 and chemo is my only option.  Going to hospital didn't really solve anything all I did was spend a night in hospital with ill people one of the nurses was full of a cold so my need to avoid infection took its test.  If this is how I feel after one session Im wondering how I will be with further treatments as altogether I have to have 12 so another 11 to go.   Initially I wondered if to have chemo or not but my oncologist persuaded me this was my best course of action as gives me a better chance. I just wish it was my 12th session and I was finished with it all everyone keeps telling me it will soon pass and its only 3 months but they don't know how I'm feeling and how I just want to go back to being me and normal. Carolw33 aged 65",
      "MessageIndex": 10,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143208/picc-line-or-not",
      "Title": "PICC line or not?"
    },
    {
      "AuthorID": "Carolw330",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolw330-",
      "Content": "Hi Marie Francoise On with my treatment now have done 4 sessions of chemo out of 12 weeks so a third way through so far have not been too bad feel a bit nauseous in the morning and get tired sometimes but otherwise feel fine, my hair has started to come out a little clump each day, still have some hair and its not looking too bad for now but have a wig appointment in January its the same day as my chemo which is every Wednesday on the 10th January.  District nurses come on a Tuesday to take blood and flush my line and I go every Wednesday counting the times ticking off each session so have 8 to go.  Trying to stay positive sometimes I feel a bit low and have even been known to have a little cry to myself but onwards and upwards I am fighting this and looking forward to when all over so I can book a nice holiday something to look forward to. My nails are ok at the moment, may be different types of chemo. Thanks for kind words and support good to know I am not alone there are many of us out there fighting cancer.",
      "MessageIndex": 16,
      "PostDate": "23/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143208/picc-line-or-not",
      "Title": "PICC line or not?"
    },
    {
      "AuthorID": "Carolw330",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carolw330-",
      "Content": "Hi  (im TNBC stage 2 had a lumpectomy excision and lymph node removal all negative( Nurse came today and took blood from my other arm not picc line tomorrow I am to have chemo in other arm also until I have had my scan.  Radiology rang me up and had an appointment for scan on 15th December I told them this would be too long to wait as need to know what is happening in my picc line arm so I can continue with everything.  They stated they would ring back later to see if can get better appointment which they did and it is tomorrow so having chemo at one hospital at 11am and scan at another hospital at 2pm they are about 8 miles apart. Once my scan has been done I will know if it is a clot or just my arm settling down with having Picc line in so hopefully will be sorted before my next chemo session next week. In the meantime swelling has gone down a bit managing to do injections in belly and taking painkillers every 4 hours and feel better but arm still uncomfortable will have to wait and see what happens I just hope the scan results don't take as long as getting the appointment. Not doing too bad at moment just wondering how I will be in the long run, some people sail through chemo and even continue going to work and others have bad side effects and are very ill.  Hopefully I will be ok and not have any bad side effects everyone keeps telling me I'm doing really well I'm keeping positive and am fighting on.   Does help being able to go on this forum and vent my feelings with people who know exactly what it is like, thank you all for your help in coping. Carolw330",
      "MessageIndex": 14,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143208/picc-line-or-not",
      "Title": "PICC line or not?"
    }
  ]
}