{
  "AuthorID": "carol2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
  "Posts": [
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "thankyou sandie for your advice, i did post a reply to you but dont know if i put it in the right place, my hair has now been cut very short(no3) its still coming out but dont notice it any more and to be honest dont really care, im having it cut again today, i have got used to wearing my wig and wear skarfs around the house. My attitude has changed thanks to you, i now think if people dont like seeing me its there problem not mine. The hikman line was put in last week and have now had my 2nd chemo, as my imunity was so low last time i have to have injections from day 5 for 5 days and i feel so much better this time. My husband has been doing the injections for me infact he does everything for me, i dont know what iwould do without him. Im now thinking more to the future and have just booked a holiday to greece in september, i am going to get better and go. Thanks for your help hope i can help you in some way, hugs carol xxxx",
      "MessageIndex": 4,
      "PostDate": "08/03/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10708/ploblems-with-viens-after-having-breast-surgery",
      "Title": "ploblems with viens after having breast surgery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi its carol again, I have just finished my course of FEC with no real problems, everyone saying how well i looked and i really did feel well. Nearly 2 weeks ago i had my 1st taxotare and have felt terrible ever since, my mouth and nose is full of sores, tongue has ulcers and have never felt so tired, for the first time ever i stayed in my night clothes for a week My toes are very sore and i generally feel bad,I am due for my next chemo next week and am dreading it. Has anyone else had anything like this and if so have you any tips to make life easier please. On the good side the top of my head where i lost my hair it seems to be growing back. Hope everyone else out there is fine, love and hugs to all of you.xx",
      "MessageIndex": 5,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10708/ploblems-with-viens-after-having-breast-surgery",
      "Title": "ploblems with viens after having breast surgery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Jane-Ann, I had lump and 29 glands removed in Dec2007 they also removed 29 glands and found cancer in 4 of them, i was told risk of numbness and swelling, i am still numb under my arm,part of my boob and down my arm, i have to look when i put on deoderant as i cant feel it, i also get strange feeling like an itch but cant feel myself scratching it, its all very strange, i am also swollen, i have spoke about it to nurses and told it will come back butcould take ages, that why you cant shave under that arm as you wouldnt feel if you cut youself. I cant comment on the nipple as i havnt had that, but still speak to a cancer nurse because as they say we are all different and best to be on the safe side. I have had problems with chemo but today i had my last, so only radio to go i start that at Guys 25th june for 5 weeks, i wish you all the best and hope everything goes well for you. Keep intouch i have found everyone so great on here and the chat room is good not all doom and gloom gets really funny sometimes and we all unserstand howeach of us feels. Sending hugs to you love carol 2 xx",
      "MessageIndex": 3,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Jane-Ann, Radio is going ok, on Wednesday my appointment was supposed to be 4pm but at 9-12 in the morning (me thinking i would have a layin) i got a phone call from Guys asking if i could get there earlier at 12 it was a mad rush but i made it, and at least i didnt have to struggle in rush hour. Like you my arm went completely dead but apart from that it all went ok. They have managed to rearrange my appointments so most of them are earlier, which will be alot better, exept for next monday 7th when i have to go to St Thomas at 7-30 in the evening, but it wont be to bad as my husband can go with me that day. I am feeling tied but i think thats still from the chemo and travelling. At first they said 4 or 5 weeks but now it is only 3 so have my last 15th July. I cant wait till its all over its been along time since last Nov when i found the lump. Hope it continues to go well for you. Please keep me posted. I live near Dartford so its the same end of the country as you. Sending hugs Carol2",
      "MessageIndex": 10,
      "PostDate": "29/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hello Jane-Ann, thanks for letting me know about the chillow, do you know where your daughter got it, it seems a good idea suppose could also be used for sunburn (not that we are allowed to get sunburn, but im going to Greece in september so it could happen). I agree the people who do the radio treatment dont seem that sociable, they just want to get you in and out as quick as possible. Did you know that we shouldnt use deodorant on the affected arm, i didnt and when i told a nurse that i was getting sore under the arm, she told me i shouldnt use it while having treatment. Hope your treatment is going well, i have 8 left then i have to have another CT scan as when i had the last one before chemo they saw something on the lung, they arnt that worried about it, doc said if its gone then it was cancer if its still there its a cyst, but its less than 1cm, after that a colonoscapy (prob spelt that wrong) as they saw a thickening on my colon, but once again not that worried as i have ibs and they think thats what it is. After that im off to greece for 4 weeks and really cant wait. My cousin lives at Lydd and she uses the Maidstone hos. Please keep intouch and let me know how you are getting on Take care, hugs Carol2",
      "MessageIndex": 12,
      "PostDate": "03/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Just want to say a big thankyou to everyone who have sent such kind words of support, it has really ment alot to me knowing there are so many of you out there who really care. Starting to feel abit better now. Have to go to Guys tomorrow for pre chemo bloood (thats if they can get any) and see Doc, then hopefully back on Friday for my last chemo, but will have to see if they can get it in a vein. I will now have to see about changing my dates for radio and also how many as each doc has said different amounts It could be 15, 20 or 25 each doc has said different, but dont mind as i can now see an end to it all. Hope to come back to chatroom now im not a misery, lots of love and hugs to you all and thanks for everything. Carol xx",
      "MessageIndex": 14,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi JG thanks for your best wishes and hugs, hopefully if i manage to have chemo on Monday the radio should now start 25thjune and end beginning august i cant wait. How are things going with your husband hope you are both ok. Love and hugs to you both Carolxxx",
      "MessageIndex": 22,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi everyone, first of all i want to say a huge thankyou to everyone of you who have supported me and put up with me and my miserys, its really meant alot to me and helped me to keep going. Well after all the delays i finally went to Guys today (dreading they wouldnt be able to get chemo in my vein as hickman line now out) it was a great feeling when at the 1st atempt they got it in. at last that part is over, i know the next couple of weeks im going to feel like s--t but i really dont care now, they have also warned me that as everytime my temperature goes high im likely to end up in hospital as last time it went to 38.9 and i didnt do anything about it, stupid i know,wont risk that again, so i am prepared for that, but i feel great only radio to go now and then i can look forward to going to Zante in Greece, we normally go in May and Sept but as we couldnt go in May we are hoping to go for 4weeks, cant wait. Now i can go in the chat room without thinking wont do it tonight as im a misery, just hope all of you are soon on the road to recovery, if i can be of any help to any of you,please remember i will always be here for you. Unfortuately i cant get to Alisons to meet everyone finances wont allow it as its going to cost a fortune back and forth for radio 25 times but hope if any of you live down this way would love to meet you, i live between Woolwich/Bexley also have a caravan at Selsey West Susex between Bognar/Portsmouth. Once again thanks to all of you, please keep intouch, sending lots of hugs and love Carol2 Its a really strange feeling, feel like elebrating but havnt any booze so hope if anyone has any please have a drink for me, many hugsxxxx",
      "MessageIndex": 25,
      "PostDate": "02/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Thsnkyou for your kind words, sending you and your family many hugs. carol2 xxx",
      "MessageIndex": 3,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "hi everyone, after your replys i felt so much better, that was until i got a phone call from the Doc at Guys. Yesturday i went there for pre chemo blood test and to see doctor, she said that as my line was still infected i would have to have it taken out before chemo, that worried me abit as the reason the line was fitted was because my veins wouldnt let blood out or chemo in. I had to have blood taken some from the line and some from vein, thats a laugh because they have never been able to take it from the line (no-one knows why) so am always used as a pin cushion, anyway the nurse tried but nothing would come out, so next came getting from veins, they tried and tried and eventualy out it came. It was then arranged for me to go back to Guys tomorrow have the line out and then somehow have chemo. From there i went to St Thomas for my pre radio assesment that went well and was due to start 25 lots starting 18th June. I was really tired and just slept when i got home. Today i decide to give myself a good kick up the bum,and realised there are so many people worse of than my and that with only i more chemo to go it will all be over soon. About 4oclock today i got a call from the Doc at Guys shen said they had the results from blood and that as the infection is still so bad (now i know why i have been feeling so bad)they want me therwe tomorrow take line out,I cant have chemo now i have to wait a week or two and they want to admit me to hos, i told her i cant stay in Guys as it would be to far for my family and that can i go to my local hospital at Sidcup she dithered abit then said she didnt know if they could deal with it, also perhaps they could give me more pills. I put the phone down totally confused. My husband phoned her back as i was upset, all we know is tomorrow my line comes out, i could be staying in Guys(which i am not) or my local hos, i might be on a drip, or pills or they could give me an injection to see me over the weekend then hos. If Guys had done something 3 weeks ago when i went for my last chemo this would all be over i told them about it being infected and they said as it had dried up it was ok. Yes it had dried up but the infection had gone further down the line andnow its harder to clear up i have been on pills for it for 10 days now. All i hope now is that if the line comes out they will be able to get chemo in and that i wont have to wait to have another line in. Sorry to be such a bloody misery but right now am feeling really fed up, just when you think things are getting ok something crashes you down. I do keep telling myself i am well of compared to alot of you and i shouldnt be moaning, i think about people on here alot. thanks to anyone who reads this think i just needed to moan. Will let you know what happens when i know. Lots of hugs and kisses to everyone and thanks for putting up with me. lots love carol2xxx",
      "MessageIndex": 4,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "hi Penny knowing my luck if i do go to guys ill be on the 10th floor. Think its the thought of being in a room on my own and (now dont tell me of) not being able to have a crafty cig, i know i shouldnt but when i was first diognosed the doc told me not to give up only cut down as there was enough pressures without withdrawal from cigs, and as i have been undr alot of pressure owing to granchildren who i havnt seen for 9yrs being badly abused and a court case coming up i had enough to contend with. (the children who we warned socialservices about in 1994 but who wouldnt listen to us) i will tellyou about that sometime. Anyway enough of that, thanks again will speak soon. Bet you wish you had never contacted me, im a pain in the arse lots love carolxx",
      "MessageIndex": 8,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi JG, hope everything went well for you at Hospital today I was thinking about you both, when i got off the train at London Bridge i did wave but didnt see you also i sent a big hug to both of you, hope you caught it. I still have the infection so chemo has been put back again until Monday, which means radio has to be put back, but never mind it is the last chemo so cant really moan. Please let me know how your husband is. Sending many hugs, hope to speak to you in the chatroom sometime love carol 2",
      "MessageIndex": 16,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Debbie, thanks for that, hope you will soon be feeling much better and back to yourself, we all miss you here. Im sending many good wishes and hugs to you and hope you will soon be well and back home love and hugs carol2xxxxxxxxxx",
      "MessageIndex": 16,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Jane-Ann, At last its nearly over,its been along time since November when i first felt the lump, this illness realy takes over your life doesnt it, all we seem to do is go to hospital for this or that. I cant wait for tomorrow when i walk out of St Thomas hos for hopefully the last time. I still have to see the oncologist at the local hospital in the next couple of weeks then the CT scan to check the spot on my lung has gone, ( they say if its gone then it was a cancer and if its still there its a cyst and nothing to worry about) also they saw a thickening on my colon and want to check that again, but i think (well i hope) its IBS. I am abit worried i know its nothing but at the same time dreading having it done incase i get more bad news, silly i know but i cant help it. Anyway im glad you will be finished by Friday, i will be thinking about you all week, we need to decide a time to have this drink on Friday then we can both raise a glass at the same time. I am really happy that it will be the end of a horrible time for us both. Has your arm and boob settled down yet, mine is still numb and abit swollen, but as long as we have got rid of the cancer i can put up with that. Really want to shout out loud WEVE DONE IT,ITS ALL GONE now to start having a life again. Hope we can still keep intouch, i have sent you a private message with my phone number incase you ever feel like a chat. Congratulations Jane-Ann for getting through this and beating the horrible thing. Hope to hear from you, many hugs, Carol2 xxxxxxxxxx",
      "MessageIndex": 18,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "i have written a new blog about how i feel, have tried to write it again but havnt the energy, i have also tried to transfer it on to the forum but havnt a clue how to do it, help please from anyone who knows how to do it. Hope to speak soon in the chat room, love and hugs to everyone, carol2",
      "MessageIndex": 0,
      "PostDate": "20/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Oh Penny, what would i do without you, you always seem to be there saying all the right things, as i said before i think you are an amasing lady.I should really have got intouch with the hos before but thought the reason i was feeling so bad was a combination of chemo pills and infection. I know i need more medication but i am the worlds worse for going in hos ive been like that since i was a child,i had my apendix out when i was little and because my mum was late visiting me i escaped and my mum found me on my way home, boy did i get a telling of, since then i always seem to plan my escape route, if i can see an exit im ok if not i panick, last time i went in with an infection i was worse than a kid and really cried quite embarrising when your 58yrs,anyway i know i will be for the best as i feel so rough and as they said i could end up with septisema. As far as Del letting you know thats an even bigger laugh hes only just learnt to turn the computer on ha ha. If i have to go in i will try and let you know. If i cant i will be intouch as soon as i escape. Thanks for being there for me Penny and sorry for being a misery im not usualy like this, i dont usualy let things get me down, thats how i know im not well.I am sending you lots of hugs and hope things continue to go well for you. Hope to speak to you soon lots of love and hugs carol2 xx",
      "MessageIndex": 6,
      "PostDate": "22/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Bambina thanks for your kind thoughts, I really hope your mum is ok, please give her a hug from me. I m due to have last chemo on Monday so hope it happens this time, its all the delays that get you down. Its put my radio back a week but it should start 25th june, not sure if its 4 or 5 weeks. I live between Woolwich and Bexley are you anywhere near there. Perhaps 1 day i might even bump into you and your mum at Guys. I know what you mean about your mum being hard of hearing my mum is also and it drives me nuts, she insists shes not deaf. Best wishes and hugs to both of you. Carolxxx",
      "MessageIndex": 18,
      "PostDate": "29/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Jane-Ann, Hope you are OK and radio going ok. I have 5 more to go but am getting really tied with all the travelling, last night my appointment was 7-30pm at St Thomas thats alot more difficult to get to than Guys and we didnt get home till 10pm, tomorrow im back at Guys. I also use Simple body wash and Aqueous cream. How many have you got left to have? My arm and boob is still numb but at the same time it has a funny feeling that i cant really explain. I also love greece we have been to Zante 14 times and have alot of Greek friends and it will be good to see them again i have had lots of calls from them since i have been ill. Not long now for you and me then we can celebrate getting though this, hope you ok ,and i hear from you soon, hugs Carol2xxx",
      "MessageIndex": 15,
      "PostDate": "08/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Thanyou Kate for your kind words, its so good to know that so many people are here for each other in the good times and the bad, this site has helped me so much when i have been feeling down. I am so glad its over but at the same time really worried that they will find something else on the scan, i am more worried now than i was at the beginning of treatment, but have been told that this is normal, i see onclogist next thursday when she will arrange date for ct scan, I just want to get it over with by the time i go to Greece in september. I hope every thing goes well for you with your chemo and that you will soon be walking out saying its gone i beat the bugger.I will be thinking of you on friday, do you know how many chemo you have to have and have you got to have radio. My thought are with you and wishing you a speedy recovery. Once again thankyou for your support, many hugs love carol2xx",
      "MessageIndex": 21,
      "PostDate": "17/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Thankyou Debbie for your kind words and support, and for understanding how i feel now treatment has finished, i want to shout from the rooftops i beat it its all gone, but have this nagging fear that when they do the scan they will find something else, also i am not the person i used to be infact not sure who i am at the mo. I do feel that i am more tolerant and understanding, and dont worry about silly things now, life is to short to worry about trivial things. I also appreciate my family and friends more and the friends i have made on this site. Oh dear im rambling again. Its a strange but great feeling not to be spending all my life with travelling back and forth to hospitals taking temperatures ect. Rambling again. Hope everything continues to go well for you Debbie and thanks for all the support you have given me. You were really missed while in hospital, hope one day to meet you round the selsey area, love and hugs to you carol2xxx",
      "MessageIndex": 22,
      "PostDate": "17/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Penny, just got back from Guys Hos doc said infection bad but would let me home if i promised i would get straight to hos if my temperature goes up or i dont feel well, she has given me 2 weeks strong antibiotics. I will definataly do it as last week it went up to 38.9 and i didnt go in naughty i know, wont do that again. Had line taken out, that wasnt to bad as she numbed my boob first, got a couple of stitches but thats all. My son Michael came with me and Del (husband) started to go to work but because i was upset last night said bugger work and came home. Im now going to pack and go to the caravan in West Sussex for weekend. Nice and peaceful, but have alot of entertainment, tomorrow its Alvin Stardust, whoopi doo. Once again Penny thanks for being there for me and sorry for being a pain. If you ever need a shoulder I am here for you, im a good listener.Hope you continue to keep well. Sending lots of love and hugs. Will speak soon carolxxxxxx",
      "MessageIndex": 10,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Jane-Ann, i will be thinking of you on 25th, i have to be there at 4pm so it will be a pig trying to get home from Guys in rush hour, but cant really complain its for the good. Hope it all goes well for you, do you know how many times you have to go.Hope to speak soon, sending many hugs, carol 2 xx",
      "MessageIndex": 8,
      "PostDate": "18/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi Bambina, I am now due to start radio at Guys on 25thJune its been put back because of delay in chemo, hopefully now i can have it on Monday, that is if this infection and the cold i now have is ok and that they can get it in a vein, when does your mum start her radio. Cant wait for it all to be over am getting pretty fed up with it now, but shouldnt really complain there are alot of people worse of than me. I live between Woolwich/Bexley but my husban grew up in Brockley in Cranfield Road, the house is still there. Hope every thing goes well for your mum please keep intouch and let me know, lots of hugs carol xxxx",
      "MessageIndex": 21,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi John, Thankyou very much for your kind words, i have read the story about the donkey and found it very comforting. You are a very kind man and your prayes are really appreciated. Thankyou, sending hugs carol",
      "MessageIndex": 23,
      "PostDate": "30/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "carol2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carol2",
      "Content": "Hi hope you are are feeling much better now treatment is over. I am ok exept for the nasty burn i have just under my neck bone, its really sore. I went to the onchologist last week and was told to keep putting the cream on it and keep out of the sun. Have you had any bad burns. I spoke about worrying about the spot on my lung and she has agreed to me having another CT scan to make sure everything is ok, that will be next Tuesday 5th Aug at 3-30, please think positive thoughts for me as i am abit nervous about it. Hope everything is ok with you. Will let you know how i get on, many hugs Carol2",
      "MessageIndex": 28,
      "PostDate": "30/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    }
  ]
}