{
  "AuthorID": "Carrotmuncher",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carrotmuncher",
  "Posts": [
    {
      "AuthorID": "Carrotmuncher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carrotmuncher",
      "Content": "Thank you all for your very kind words - I'm sorry I've been so tardy in replying.  I've been visiting my sister for a few days - my mum is late stage alzeimers and my dad died of lung cancer the year before last, so our poor family are going through it a bit!.   It's comforting to know that I'm not the only one struggling to cope, and it's not all in my head.  It seems I may still have a way to go yet though, which is a little disheartening.  Onwards and upwards! Love to you all. Sandra",
      "MessageIndex": 5,
      "PostDate": "22/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65956/struggling-with-recovery",
      "Title": "Struggling with recovery"
    },
    {
      "AuthorID": "Carrotmuncher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/carrotmuncher",
      "Content": "Hi there, I was diagnosed with breast cancer in October 2012, and have since had the lumpectomy, FEC chemotherapy and radiotherapy, which finished at the end of June.  I found all the treatments hard going, and was signed off work half way through my chemo.  I returned to work at the end of August, on a phased return, working just three half days a week.  Since then, I haven't felt able to increase my hours at all, and am struggling to cope, not only with work, but with all daily chores such as cooking, cleaning and shopping.  I feel very guilty about this, as though its down to a lack of moral fibre.  I'm taking a whole raft of vitamins and supplements to try to increase my energy levels, and try to make sure I get some exercise, so I don't really know what else to do.  I live on my own, which doesn't really help.  Even my teeth feel tired.  Brain appears to have been decommissioned. Is this in any way normal? ",
      "MessageIndex": 0,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65956/struggling-with-recovery",
      "Title": "Struggling with recovery"
    }
  ]
}