{
  "AuthorID": "catsrme",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/catsrme",
  "Posts": [
    {
      "AuthorID": "catsrme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/catsrme",
      "Content": "Hello, You're right of course, and everyone handles their fears differently. I've withdrawn, which isn't like me at all. I guess I feel that I can't control this, but I really don't want IT to control me. The staff at the NNUH Breast Clinic were so kind and empathetic and answered my questions honestly. I really appreciated that. I do hope that today's visit for results has left you feeling confident and positive about treatment. I noticed that you have a different surgeon to me, all seem to have an excellent reputation. I just want to get on with this now and I'm guessing that you probably feel the same. As many others have noted, it's the waiting that is so difficult. Gill X",
      "MessageIndex": 10,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166824/surgery-waiting-time",
      "Title": "Surgery waiting time"
    },
    {
      "AuthorID": "catsrme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/catsrme",
      "Content": "Thanks so much for getting back with some positive information. So, size isn't everything. That's a relief, my main concern was that these cells had appeared and then multiplied so quickly between the mammogram in November 2017 and last Friday. You're right, I'll only really know what I'm up against when I go for the CNB results. The waiting is the worst part, (I hope), and of course, my imagination is running away with itself. I've been a ward volunteer at the local hospice for over 20 years and should have gone in this morning, but don't feel that I can face going back quite yet. Yes, I'm just across the border, in South Norfolk. Hugs gratefully received. X",
      "MessageIndex": 3,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166824/surgery-waiting-time",
      "Title": "Surgery waiting time"
    },
    {
      "AuthorID": "catsrme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/catsrme",
      "Content": "Just read your profile, you've certainly been through the mill. You're absolutely right about my feeling overwhelmed. I went to the breast clinic fully expecting my usual harmless, annoying but only a cyst result. I'm just grateful that I've found this very supportive community to pick me up and answer all the daft non-medical but important to me questions that I know I'm going to ask once the CNB results are back. Dreamthief is brilliant and I really needed to hear that stuff about size. I had to look away from the screen when the radiologist did the measurements during the ultrasound. Not the most sensible approach on my part. From now on I'm going to want all the facts, good, bad or indifferent. Can't be fighting in the dark. So sorry that your original Oncologist messed up. You made choices based on his knowledge/experience, as many of us would have. Onwards and upwards. X",
      "MessageIndex": 4,
      "PostDate": "26/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166824/surgery-waiting-time",
      "Title": "Surgery waiting time"
    },
    {
      "AuthorID": "catsrme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/catsrme",
      "Content": "Hello Lesley and all those of you who've taken time out to respond. Lesley, I emailed twice and suddenly lost both emails. Either my tablet or, most likely, my brain playing up. Lesley, so very sorry that after nursing and losing your beloved husband, you now have to face being a patient yourself.. Puts my worries into perspective. I'll have everything ",
      "MessageIndex": 8,
      "PostDate": "28/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166824/surgery-waiting-time",
      "Title": "Surgery waiting time"
    },
    {
      "AuthorID": "catsrme",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/catsrme",
      "Content": "So pleased to have found this forum. I had thought that the large, mobile, unattached lump I found in my left breast close to the armpit a couple of months ago was just another cyst. I've had so many over the years. My GP thought so too. I had a mammogram in 2017 and the radiographer said that It looked as though I had a cyst. I wasn't recalled, and as I couldn't feel anything, had thought no more about it. Attended Norfolk and Norwich breast clinic yesterday and cancer was discovered. 2 CNBs were taken and I have an appointment with the consultant on August 31st. I've been told that I'll need surgery, but obviously don't know what treatment is likely to follow.My surgery will be 5/6 weeks as of yesterday. That seems such a long time to wait, particularly as the lump is huge and I could have had cancer, without realising, for some months.I'm 63, never smoked, just have the odd glass of wine and have no family history of BC. Still in shock, and cant help imagining this ugly, evil, thing making its way to other areas. Is my waiting time for surgary too long, does anyone know? Has anyone been treated for BC at the Norfolk and Norwich Hospital on the forum?Apologies for sounding so panicked. Might have to cry now, as I haven't done that yet ! What I'd really like to know, . I I",
      "MessageIndex": 0,
      "PostDate": "25/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166824/surgery-waiting-time",
      "Title": "Surgery waiting time"
    }
  ]
}