{
  "AuthorID": "caz1965",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
  "Posts": [
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Hiya all, I was just reading all the comments.............i was diagnosed with BC in 2010 and most of what i have read from you guys , hits home with me.  I feel like because it was quite a while ago when my life turned upside down.....everyone seems to think i am all BETTER now!!!!! I am far from better, i wake up everyday thinking is it gonna come back or a couple of weeks ago i felt a mass in the same breast and i was totally panic. I dont even know whether to say i HAD cancer or i am still going through it. all i know is that i have survived this long with it. My apperance has totally changed and my personality is not the same.   Even though i have people around me ........i still feel alone in this CANCER world.  I know i shouldnt say this ...........but after reading all that you have put and feeling the same way....i know i am not alone at any stage of treatment or healing. Thank you all for your words Caz x",
      "MessageIndex": 9,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63421/all-done-so-what-am-i",
      "Title": "All Done ... So what am I ??"
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "hiya Sus, By the sounds of things everyone feels more or less the same what ever the cancer they have had or got. I think because our whole world is turned upside down when diagnosed and we cope and fight. Then when everything is over and done with and we try and get on with our lives, we have that cloud over us thats left just hanging there. And it will probably be there for the rest of my days.  Thats the only way i can explain how it feels.........just a big lonely cloud over me that wont go away. Its does help on this site....to know that we are not alone.....that other people feel and experience the same. Just wish i could blow the cloud away and for it never to come back........but no-one knows whats around the corner do they. Caz x",
      "MessageIndex": 11,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63421/all-done-so-what-am-i",
      "Title": "All Done ... So what am I ??"
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Hello June, I dont know if you can call it MANAGING the feelings......i think its a case of just getting on with everything on a daily basis. I find i feel most alone when i stop doing stuff, because then i suppose i have time to reflect on whats happened. For me its the not knowing whats going to happen....never in a million years did i ever think i would have BC. No-one in my family haas ever had cancer so it was a total shock.......now all the ops and chemo and rads are over, i am on my own and have time to think about stuff.   I try not to show my feelings in front of my family, mainly because i know they wont understand. Wow......i am a right moaner tonight......its one of those days and its coming upto my checkup and mamogram Take care Caz x",
      "MessageIndex": 13,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63421/all-done-so-what-am-i",
      "Title": "All Done ... So what am I ??"
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Susie, To be honest i havent really met anyone that i have kept intouch with from my hospital jaunts, just old friends and family. So thats been abit hard because i havent had anyone around me that knows what i feel.......in some ways thats a good thing but doesnt half feel lonely at times.  Dont get me wrong i have a wonderful family and a supporting partner, but they all think i have the hump or i am not in a good mood when i go quiet....but thats how all of this cancer lark has left me. i used to be happy go lucky but have now turned into a quiet unsocialble, tired, moaning old fart!!!!!!!......well thats what it feels like anyways. Just wish that one day i could forget about cancer and just live life as i did before, but i know its never gonna happen.......cancer has come into my life and it wont ever go away, even if it isnt there physically its there mentally xx",
      "MessageIndex": 15,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63421/all-done-so-what-am-i",
      "Title": "All Done ... So what am I ??"
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Hiya purple fox and Julie You are not odd at all, its nice to hear someone in a positive frame of mind......perhaps i am the odd one!!! lol.  I am not normally moaning or down, just now and again it creeps up on me and i get all down about things.  Yesterday was one of those days. I am feeling alot better today and like you i am glad i am alive and feeling sort of normal.  I found out yesturday that a friend of mine passed away due to cancer.   I hate cancer and what it does to the person and their families.  I hated it before i got it and now hate it even more now that i have had it. But like everyone else on this site we just have to keep going in hope of a cure of all cancers.  Thanks guys for today and last night Caz x",
      "MessageIndex": 18,
      "PostDate": "13/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63421/all-done-so-what-am-i",
      "Title": "All Done ... So what am I ??"
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "its been a year since i had my last chemo and nearly a year when i started my radiotherapy.  I have put on 2 stone in weight and gone through my menopause. feeling tired all the time and have lost alot of confidence. Just wish i could stop thinking about the \"Cancer\" and if i will come back and whish i could feel more confident about the way i look. has anyone else or is anyone else suffering the same as me? would love to hear from someone.",
      "MessageIndex": 0,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49217/low-confidence-issues-0",
      "Title": "low confidence issues :0("
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Thank you Chrissie, I know i am not alone, but sometimes feels that i am. it was great to hear that you didnt have to have Chemo. I think its just a case of getting my head around stuff, but its hard.",
      "MessageIndex": 2,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49217/low-confidence-issues-0",
      "Title": "low confidence issues :0("
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Hiya Chrissie Yes the word CANCER feels you with dread, evey emotion comes over you, i cant fault anyone who took care of me or the treatment that i had. I just feel that i am still battling. Just want to feel like my old self again. I know what you mean about people dont understand because they are not going through it, what seems to them something petty, is a big deal to me ie:- my hair, my weight, the way i look! Just wish it would all return to normal, but i know it wont. Am so sorry to hear about your mum, but you are a different person and you have more options open to you. ",
      "MessageIndex": 4,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49217/low-confidence-issues-0",
      "Title": "low confidence issues :0("
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Hiya Amanda I was diagnosed back in 2010, have had a lumpectomy and lymphnodes taken out and then had chemo and radiotherapy. It all ended last year the end of april. I know how you are feeling, i went through so many emotions. you sound a very possitive person. I can only go by what my experiance has been and no matter, what you will get through this. I have four children the youngest being 10, i found it hard to tell them because i didnt know many answers myself about what i would have to go through or what the outcome would be, Just be as honest as you can with them and they understand more than you think. I am still not 100% but am trying and i am sure you will too, you CAN do this and will come out the winner!!!!!!! Carol x ",
      "MessageIndex": 21,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48753/scared",
      "Title": "Scared!!"
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Diagnosed a year ago with Breast Cancer, had two ops and had chemo and radio therapy. On Tamoxifen now. Had my first Check up today and all is good, but still feeling low, my confidence has gone down and the feelings of insecurity is more than ever. I have a great family network and a wonderful partner but still cant seem to stop feeling down. I hate the way i look ie: Hair and putting on weight. What i would like to know is if anyone else has felt the same and how they combatted the feelings, Thank you Caz",
      "MessageIndex": 0,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41971/low-confidence-help",
      "Title": "low confidence help"
    },
    {
      "AuthorID": "caz1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz1965",
      "Content": "Thank you for your message, its made me feel not so alone. Love and hugs back to you :0) x",
      "MessageIndex": 5,
      "PostDate": "02/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41971/low-confidence-help",
      "Title": "low confidence help"
    }
  ]
}