{
  "AuthorID": "Caz718",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
  "Posts": [
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Good luck tomarrow hope it all goes well for you, you find it easier once it starts. For me I have a quite day the day after chemo and then im rough on 4 and 5 and then ok again. I think your Devon break would be good but dont think your onc will want you to go abroad as there is no nhs if you are taken ill(I have had a week in this country but they wernt that happy about it) Take Care   Carole",
      "MessageIndex": 3,
      "PostDate": "10/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51449/1st-chemo-tomorrow",
      "Title": "1st chemo tomorrow"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "To be honest I still cant beleive I have cancer, within 4 weeks I have gone to my doctor with a lump to being told it was cancer to having an op last Wednesday. When you get told you think its the end of the world and you are going to die:(( Then you come on here and start reading and relise its not a death sentance and their are always others worse off than you. On the whole I dont feel ill its only when I go to hospital that it all becomes reality. Getting my results on Friday and then we will know what we are dealing with and where we go from here. To be honest I havent shed many tears, there were some when we first found out a few today but everyone handles things different",
      "MessageIndex": 3,
      "PostDate": "11/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48878/hi-everyone",
      "Title": "Hi everyone"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Im back for my results tomarrow after my op last week. I too would hope that I get told or guided into whatever treatment is needed, it seems to me reading through all the posts on here that things seem to vary depending on where you are treated. Ive read loads and it dosent seem that there is a 'one size fits all' situation and everybody is different but from what Ive seen from the paperwork I have here from my hospital is that you will be given the % figures if it something that might not be necessery for you to have. Have you got a bcn you can talk to about it? Caz",
      "MessageIndex": 6,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48921/confused",
      "Title": "Confused......."
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "I had my 3rd lot of chemo using the cold cap last Monday. So far I pretty much have a full head of hair, I had it cut to shoulder lenght at start. I have found that when I give it the first wash after chemo(I try to leave this as long as poss) I seem to lose some then, yesterday I thought I was going to lose the lot as it just seemed to be coming out in my hands, I dident brush it and just left it to dry and tried not to fiddle with it, then in the morning it had setttled down and only seem to be losing a few hairs so im hoping it will hold out, From what I have read on here people seem to get the strange feeling and pain in scalp and im hoping if you dont get that that you dont lose it   Caz",
      "MessageIndex": 4,
      "PostDate": "08/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51392/hair-falling-out",
      "Title": "Hair falling out!"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi I have been reading this with interest, im also called Carole, had mamagram and scan and biopdy on Monday and was told I had a cancer tumour on Friday. Pre op on Wednesday and then lump removal on the 4th April With whatever treatment to follow later. Like you sturggling to get our heads around things, my husband also lost his job last week, took our 2 dogs out for a long walk after finding out yesterday. Had a very sleepless night last night all sorts going round in my head. I have long red hair and im worried about losing it. Trying to stay positive and just find out as much as possiable at the moment Caz",
      "MessageIndex": 20,
      "PostDate": "24/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48221/new-to-this",
      "Title": "New to this"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Had my first chemo today and it wasent nearly as bad as I expected:)) The cold cap machine was reluctent to work which delayed things a bit but was only uncomfortable for about 2 minuites then just felt like I had a cold wet flannel on my head, im going to bite the bullet this week and have a bit og lenght cut off my hair to give it a better chance:)) Glad I have the line in as they were 'fishing' to get a couple of peoples veins. I have developed a problem with the dressing and have to have a different sort and the district nurse in to change it for a week as it is a bit raw. Chemo all went in fine, sent home with 3 different lots of anti scikness to take, so far feel fine but I know its early days. Had my lunch there and a nice chicken salad and new potatoes for tea, so far have drunk a litre and a half of water plus tea and coffee, only problem need to wee lol she had to unplug me 3 times so I could go lol and its red ha ha. Hopefully I will get a good nights sleep as ive been lacking for a couple of days with the problem with my line and getting worked up about today Caz",
      "MessageIndex": 0,
      "PostDate": "21/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50090/1-down-5-to-go",
      "Title": "1 down 5 to go:))"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Thanks for that. I got really shouted down on her by someone not long after I was told I had cancer by someone who was saying we should all give up meat and dairy. I try and eat a good diet meat veg and fruit, I dont do fish unless its in batter. I have propley put on 3 stone during my Chemo and rads and am now on Taxiofirm I was over weight before I started as im a picker with a sweet tooth, going to try and lose some weight in the new year as it is really the only thing getting me down at the moment. Having Herceptin every 3 weeks now but feel prettty good and positive about everything:)) Good luck everyone and enjoy life   Caz",
      "MessageIndex": 8,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55784/soya-or-not-her2-report-after-meeting-dietician",
      "Title": "Soya or not? HER2+ Report after meeting dietician"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "I think that somebody wrot on here to take pain killers before you have it to put the head ache at bay before it starts:))",
      "MessageIndex": 7,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49690/cold-cap",
      "Title": "cold cap???"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Im so pleased to hear so many good results. Im desparate not to lose my hair:(( I missed my appointment with the wig woman on Monday as I was having my line put in, I have chose a couple of wigs off a website and she is getting them for me to try on the 28th I hope I wont need them and will be using all the tips I have read about. I got a supply of Tressame Nuturals but my hair dosent like it that much, I have some conditionor from Holland & Barret that smells of mint so hopefully that will be ok. My husband has got my sewing maching out and im going to try and make something over the weekend to wrap round my picc line, we dont half have to go through alot with this thing Caz",
      "MessageIndex": 24,
      "PostDate": "18/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49690/cold-cap",
      "Title": "cold cap???"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi Im having my first chemo on the 21st and im desparate to keep my hair so I going with the cold cap. If you search a couple of pages down there was another post about using the cap with loads of tips. Caz",
      "MessageIndex": 5,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49690/cold-cap",
      "Title": "cold cap???"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "I was told the stray cell thing was a 1 in 4000 chance so im still prepared to try the cold cap, im having FEC also. I think like everything to cold cap imformation varies from hospital to hospital Caz",
      "MessageIndex": 12,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49690/cold-cap",
      "Title": "cold cap???"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi I went onto Citaloprim during last summer whilst I was having Chemo(I have been on it in the past also) and am now a few months into 5 years of Tamoxifen my onc seems quite happy that im on them this is such a hard thing to get through if  a tablet can help us get through im happy to take it   Caz",
      "MessageIndex": 1,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58513/tamoxifen-and-citaloprin",
      "Title": "Tamoxifen and Citaloprin"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi I have just finished my chemo and still have my hair thanks to the cold cap. I had thick hair half way down my back and had it cut to shoulder lenght. It does make the chemo about an hour and a half longer and you need a nurse that understands it to put it on, your hair need to be wet and they then conditonor put on. You may find that if you like to wash your hair often you wont be able to cope. For me I followed the following tips which is why it has worked so well for me dont wash your hair for 2 days before chemo and then leave washing as long as possiable after(I did 5/6 days) use a gentle shampoo I used dove, no hair dryer or strightners be very gently with your brush and use a silk pillow case, For me I coulent of stood losing my hair, had my last chemo 3 weeks ago only losing the odd hair now and waiting to dye it again Caz",
      "MessageIndex": 9,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53563/a-cold-cap---did-it-work-for-you",
      "Title": "A Cold cap - did it work for you?"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi I had my picc line put in on Monday due to my rubbish veins and am going to have it for a year apparently as my chemo starts on Monday, then radio therepy followed by Hecpein. The district nurse was goign to come every day to dress it but was happy to show us how to do it ourself(well my husband) so we dont have to be waiting around for her in afternoon's as im working mornings. Anyway, has anybody come up with a way of covering them up, I have been given various bits of tubi grip(the line is just above my elbow on the inside of my arm) itsthe annoying end flapping about which you are supposed to keep clean, cant just have it hanging there, I have got a mp3 player holder from a sports shop and also some ankle warmer things, its a really awkard place as you dont want anything tight and things just seem to slip down, I tried the dogs vet wrap last night and that dident work very well either:(( I look forward to ton's of ideas and may have to dig the sewing maching out to see if I can do anything with velcro. Caz",
      "MessageIndex": 0,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49927/picc-line-cover",
      "Title": "picc line cover?"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Im trying with a scarve tied round it at the moment, because its a long time im going to have to look at it, you have given me some other ideas for going on with. When we were in the hospital resturant having breakfast today there was a rep in there talking about picc lines, must of been trying to sell stuff to the hospital, I nearly turned round and said something to her, I would of though they would of come up with something better by now cover wise Caz",
      "MessageIndex": 3,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49927/picc-line-cover",
      "Title": "picc line cover?"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi   I finished my chemo last summer and used the cold cap as for me losing my hair was just too much. It dose make the day longer but you are normally hanging about at the begining while they mix up yor treatment anyway ant then they start the countdown time after they have given you the two drugs that make you lose your hair. Tips I learnt off of here before I satrted were if you have very long hair have it cut shorter mine was half way down my back and I had it cut to shoulder lenght, you need to be very gentle with your hair, use a mild shampoo and dont wash it for a couple of days before treatment and then leave it as long as possiable after I tried to go 4 or 5 days. No hair dryer or streightners and dont rub it dry. A silk or satin pillow case will also help. Be gently when brushing or combing. My hair was very thick and although sometimes in the shower it seemed like loads was coming out if you dident know you would never know I was having chemo. On the chemo front take all the anti sickness you are given and you will also have a number to contact if you have any problems, do this streight away if you are ill in any way(in my case constapasion0 as they can give you something to sort anything out dont be a marta rest when you need.   Caz",
      "MessageIndex": 2,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57563/cold-cap-any-advice",
      "Title": "Cold cap? any advice"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hope it has all gone well. im now 16 days after my first chemo have an annoying mouth ulcher but apart from that ok. I used the cold cap and so far so good dont seem to have lost any more hair that normal:)) Caz",
      "MessageIndex": 15,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50496/first-chemo-tomorrow",
      "Title": "First chemo tomorrow"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi I have had 3 round of fec chemo so far, as I dident know how I would react I took the week after my first chemo off I work 5 hours a day in an office, but I really dident need it. I have my chemo on a Monday and take Tursdays off and then work the next 3 days, I do find Fridays hard as this is the day I feel ill and Saturday also, then the following 2 week are ok before it starts all over again   Caz",
      "MessageIndex": 12,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51452/will-i-be-able-to-work-through-treatment",
      "Title": "Will I be able to work through treatment?"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "its up to you but judging by my re-growth you might be better off leaving your colour in rather than damaging it with the removal thing and leaving it strong to start with. Im only having FEC so dont know about the effects of the other, here are the tips I have picked up off of here. Dont wash your hair for a couple of days before or after chemo(i have cut right back on washing mine) use a really mild shampoo and conditioner, I have been using Dove No haIr dryers or straighteners be REALLY gentle wiht it dont rub with towel or brush often or hard use a silk pillow case Hope this helps Caz",
      "MessageIndex": 4,
      "PostDate": "05/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51260/hair-colour-dilemma",
      "Title": "Hair colour dilemma"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi I was going to ask which chemo you are having and weather you are going to use the cold cap? as has been said some chemo your hair will just fall out pretty quickly and you have no chance of saving it. My hair is dyed a bit off my natural colour mostly to cover the gray I have had 3 lots of fec chemo with the cold cap and so far it is fine, I had it cut from half way down my back to shoulder lenght to give it a better chance, it hasent grown atall so if you dont lose your hair there shouldent be much root regrow only in my experiance though,   good luck   Caz",
      "MessageIndex": 2,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51260/hair-colour-dilemma",
      "Title": "Hair colour dilemma"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi It was my understanding from my surgeon/onc that you cant have chemo in table form if it is hr2 but im no expert Caz",
      "MessageIndex": 2,
      "PostDate": "19/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50031/question-re-chemo-timing",
      "Title": "Question re chemo timing"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "HI Amanda, I went to the doctors with a lump lass than a month ago and had cancer comfirmed by a biopsy, had a wse on Wednesday and waiting for the results and my treatment plan on 13th:)) I too only heard the word 'cancer' and though it was a death sentance, but the more you read the more you find out how treatable it is. Take one day at a time, go to the middle of nowhere and have a good scream if thats what you need to do. There are lots of people on here to talk to and loads of useful imformation, I started a blogg as I thought it would help me:)) All the best Carole B",
      "MessageIndex": 8,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48753/scared",
      "Title": "Scared!!"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Thanks for taking the time to answer:)) I work 25 hours a week, 5 hours a day, I know everyone is different but seems like I may be ok starting off but will need time off later, my employers have said they will only be paying me 2 more weeks sixk(I will be having 2 weeks now) so its going to be a toss up between working while im feeling well enought or going on ssp:(( We really are going through enough without having to worry about money too. Im dont normally wear make-up, I have been given a pamper day thing from the hospital so will go along and try to make the best of myself. Im going to ask about my wig when I go next and hopefully get one im happy with, im going to look into the cold cap more, I have already been told its easier with the chemo if your hair is shorter so hopefully after I get the wig sorted I can be brave and have my hair cut off:(( Thanks again Carole",
      "MessageIndex": 5,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48963/feeling-gutted",
      "Title": "Feeling Gutted"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "I have been to doctors and am having blood tests and my anti depressants have been changed to Venlafaxine which is supposed to help more with the hot flushes so will see how it goes. I do get exercise with my dogs so get out and have fresh air, so hopefully things will get better Caz",
      "MessageIndex": 11,
      "PostDate": "03/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74480/so-tired",
      "Title": "So tired"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Thanks for all your replys Im starting to get my head round it, just worried about looking a freak in a bad wig, I know its truely stupid to be so worried about my hair, esp as I dont actually do anything with it and havent been to a hair dresser in years my husband colours it for me to cover up the gray bits. I think once ive got the wig I will be ok I hope. The things you have all said about the after effect and working has helped I just need to get it all streight in my head so I know whats happening to me then I know I will be ok, thats what I keeps trying to explain to my husband and he cant understand:(( He just says I shouldent worry but I need to know about everything. One other thing that has occured to me is the bleeding more thing, I bruise really easy anyway(still have horrendus ones from the op) and sometimes get nose bleeds which are really difficult to stop and I find these distressing its something that im going to have to speak to them about as it one problem I could do without really on top of everything else Carole",
      "MessageIndex": 8,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48963/feeling-gutted",
      "Title": "Feeling Gutted"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Hi all Im two years on from being told I had bc, I have had lump removed, chemo, radiotherapy and 6 months of Herceptin and am now into my second year of Tamoxifen, I now seen to be suffering badly from tiedness. Some days im fine and have energy and others are like today, yesterday I got up a 12 and went to bed again at 9.30, when the alarm went off for work today I was exhusted I rang in sick and got up at 12 again and have had no energy all day again. Its starting to get me down now, I have rung the doctors and am seeing the nurse tomorrow, the house looks like a tip as I have no energy to do anything, I work part time only 5 hours a day, I dont do anything that could make me as tired as I feel, is anybody else feeling like this? Caz",
      "MessageIndex": 0,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74480/so-tired",
      "Title": "So tired"
    },
    {
      "AuthorID": "Caz718",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/caz718",
      "Content": "Just back from my post op check, I knew my nodes were clear from the day of the operation and was told today that they had got clear margins. My tumour was 25mm grade 3 and fast growing so I have to have chemo:(( I had convinced myself that I wouldent need it, I know its the most stupid thing to be upset about but  I have had long hair all my life and an dreading losing it and going out in public, yes I know there are good wigs and if the worse I have to go through is losing hair I should be greatful but it dosent feel like it at teh moment, but my head isent being very reasonable at the moment. Bickering with my husband over stupid things too isent helping. Back on 26th to discuss everything and get dates I suppose, im going to be having 6 cycles and then radio threapy. To those of you that have had chemo how did you cope with going to work? I know everyone is different but trying to get things sorted in my head. Carole",
      "MessageIndex": 0,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48963/feeling-gutted",
      "Title": "Feeling Gutted"
    }
  ]
}