{
  "AuthorID": "ceecee152",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
  "Posts": [
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "That also sounds interesting about the sea kelp, thank you. I think I'm going to leave the hair colouring for good now.",
      "MessageIndex": 19,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you, good to hear it may let up within a few months. Here's hoping!",
      "MessageIndex": 3,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Is anyone else noticing hair loss while using Letrozole? I've been on it for 15 months and I reckon I've lost about a third of my hair thickness. Older ladies in my family tend to have thinner hair anyway but I'm thinking this is connected to the Letrozole? My other treatment was lumpectomy and 3 weeks radiotherapy just over a year ago with a clear mammogram last November.",
      "MessageIndex": 0,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Yes susie, I also had the hot flushes to begin with, but they gradually settled down and now, after just over a year, it's unusual to get one.",
      "MessageIndex": 11,
      "PostDate": "04/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Hi Pattitsa, thanks for your reply. The best thing I do is to have a very soft perm on the crown of my head every now and again which seems to help and Ive stopped getting it dyed to help the condition hopefully. But I have to say it's still thinning and I have another 16 months to go. I'm going to keep on keeping on. :-) Best wishes for your recovery and stay well.",
      "MessageIndex": 17,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you. I'll investigate the Regain. Interesting about the hair colour. Luckily I haven't had to have chemo, just the radiotherapy so mine's still the same colour. :-)",
      "MessageIndex": 4,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you maggie. Interesting because you say it's designed for decreasing levels of oestrogen which is precisely what Letrozole does to you. I'm also noticing that my skin \"drinks\" moisturiser! I'm going to buy shares in Nivea and others. :-)",
      "MessageIndex": 7,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Hello Lou, I've been taking Letrozole since December 2014 so about16 months. I already had arthritis in my knees, wrists and hands so if there is any increase in pain I'm not too sure whether it's just normal or whether the Letrozole is aggravating it. I did notice an increase in my joint pain generally for a few months, probably 4 or 5 but I decided to persevere and it did settle down after a while. I've also had a knee replacement this year and there didn't seem to be any complication related to the Letrozole. But I know others have had some problems. Seems to be an individual thing. Good luck.",
      "MessageIndex": 9,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you Mags and everyone, there seems to be a range of possible remedies. I'll let you know how I get on.",
      "MessageIndex": 15,
      "PostDate": "04/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Hi there, I have been on Letrozole after lumpectomy and 3 weeks radiotherapy some 3 and half years ago. Have had 3 clear mammograms so far. My hair thinning sees to be getting worse and I still have 18 months before I'm off it if all goes well and I stay clear for the full 5 years. I'm wondering if my hair will thicken up after I stop the Letrozole. I'm coping at the moment with a clever hairdresser who layers my hair carefully and does a light perm on my crown to give it some body. Anyone out there who knows if my hair will go back to normal I'm wondering? Thanks in anticipation and hugs to all.",
      "MessageIndex": 0,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160754/letrozole-hair-thinning",
      "Title": "letrozole hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you Leolady 56. I will look for the sea kelp tablets and see if it makes a difference. My hairdresser is my best friend at the moment! If she has to be my permanent best friend I'm still glad of the Letrozole rather than the possible alternative of the cancer coming back. Good luck with your treatment and many thanks for the helpful suggestion.",
      "MessageIndex": 4,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160754/letrozole-hair-thinning",
      "Title": "letrozole hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you for the info Leolady. The outcomes of the trial will be interesting! Enjoy the babysitting and Wimbledon. Sadly Wimbledon is only 2 weeks!  :-)",
      "MessageIndex": 10,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160754/letrozole-hair-thinning",
      "Title": "letrozole hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "OK, so don't go tripping up any steps! Nice to hear someone hasn't got thinning hair. :-)",
      "MessageIndex": 13,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160754/letrozole-hair-thinning",
      "Title": "letrozole hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you so much. Another question for the oncologist then. I was treated at The Marsden. Where did you get the info about 10 years rather than 5?",
      "MessageIndex": 7,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160754/letrozole-hair-thinning",
      "Title": "letrozole hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you Dreamthief. Well it's good to know that my hair might come back. Even so, I'm glad to have been on the Letrozole as it's given me a certain amount of security that my oestrogen fuelled cancer continues to be arrested. Many congrats to J for getting to the end of her 5 years. Best wishes for continued good health. ",
      "MessageIndex": 3,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160754/letrozole-hair-thinning",
      "Title": "letrozole hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you. I will certainly look into that. Best wishes back to you too.",
      "MessageIndex": 8,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160754/letrozole-hair-thinning",
      "Title": "letrozole hair thinning"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Strong96 I'm so sorry you're in such pain. Is it all your joints or just your knees? Pain in any joint is so awful because every time you move or put any weight or strain on them it hurts more. Maybe the doctors can sort out some pain killing remedy while you have your chemo? I have my pre-operative assessment tomorrow for the knee replacement so I'll ask them about it too. As I have arthritis in several places I think any chemo I might need in the future will be painful but it was the thought of damage to the replacement that was worrying me most. Nothing is simple with this condition is it? Good luck with talking to the doctor and maybe getting the severe pain sorted out.",
      "MessageIndex": 5,
      "PostDate": "20/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102651/chemo-effect-on-knee-replacement",
      "Title": "Chemo effect on knee replacement"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Hi everyone, I am due for knee replacement surgery in January. I had a stage 1 grade 2 oestrogen receptive tumour removed October 2014, nothing found in lymph nodes, followed by three weeks radiotherapy and am now on Letrozole for five years. Had a clear mammogram last month. Orthopaedic surgeon not keen to do the surgery because if I ever need chemo he said it can affect the cements they use and cause problems but I want to go ahead. Has anyone had chemo after a knee replacement? Did you have any effects on the new joint? The breast care nurse at the hospital said she doesn't know what the fuss is about and thinks it will be OK.",
      "MessageIndex": 0,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102651/chemo-effect-on-knee-replacement",
      "Title": "Chemo effect on knee replacement"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Hi Isingbass, first I hope you don't need chemo, and second if you do I hope my ortho surgeon was just being overcautious. He did not seem very keen on doing it until I had a clear mammogram one year after the treatment so I've been waiting since last June since I saw him for a date for the knee replacement. Certainly the breastcare nurse wasn't of the same opinion but it would be nice to know! I'm trusting to luck and sending you lots of good wishes and luck for Tuesday.",
      "MessageIndex": 3,
      "PostDate": "20/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102651/chemo-effect-on-knee-replacement",
      "Title": "Chemo effect on knee replacement"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thank you trainj, that's encouraging. My surgeon is the chief ortho surgeon at this particular hospital so may be being ultra cautious. Fingers crossed! Hope you have a good Christmas.",
      "MessageIndex": 7,
      "PostDate": "20/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102651/chemo-effect-on-knee-replacement",
      "Title": "Chemo effect on knee replacement"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Hi Gilly and everyone, and thanks for all the replies. Well the YES moisturiser arrived just now and I'm going to use it tonight and see how it goes. It's recommended to use daily for a week and then every 3 days so I'll start tonight and see what happens. A big plus will be if it doesn't sting when applied inside! I ordered just the 100ml tube of VM moisturiser which does not have an applicator. According to the website YES (WB) lubricant is available on prescription now and it acts as a moisturiser too. The one I ordered is YES (VM) moisturiser. www.yesyesyes.org/.../  Watch this space!  :-)",
      "MessageIndex": 15,
      "PostDate": "27/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thanks Lou and Carolyn. I got online today and found quite a bit of info. There are several creams available but many seem to have chemicals and parabens in them. There is one called \"YES\" which is supposed  not to have those ingredients, organic plant based ingredients, a range of products, only natural ingredients, made in the UK, and users seem to be happier with it so I've ordered a small tube to try. (Even KY jelly has glycerine and parabens which can cause problems for you on a regular basis.) I'm feeling fine this morning but I did use the steroid cream last night and I don't really want to do that. Here are the links I found when searching. Replens was prescribed by my GP but it stung when applied and I had some spotting so stopped it. But it is successful with some women. http://www.boots.com/en/Replens-MD-Vaginal-Moisturiser-35g_923464/ KY jelly is a lubricant and not a moisturiser. Commonly used by doctors when they do an internal examination and for sexual intercourse, but it's not a long lasting moisturiser. I'm not sure if they make a moisturiser. https://en.wikipedia.org/wiki/K-Y_Jelly YES do a range of products including a moisturiser as well as a lubricator and the user responses are encouraging. I just noticed today that you can send for a sample on this link but I already ordered the small tube of moisturiser so I'll let you know how I get on. https://www.yesyesyes.org/nhs/     What we women have to do to live without the soreness and the dreaded itch! :-)",
      "MessageIndex": 4,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Useful hints. Thank you Kate. I do normally wear jeans or trousers but I stick to cotton ones. Pyjama/nightie evenings are a good idea. We don't need to be dressed up for telly or a good book do we?  :-)",
      "MessageIndex": 8,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Good luck Lou. I hope it works for you. If you're very sore inside it might sting a little bit the first time but only a minute or so. Let's hope it's the answer long term. x",
      "MessageIndex": 20,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Hi everyone, I'm 68 and I've been on Letrazole for 18 months after lumpectomy and radiotherapy in Dec 2014/Jan 2015, with the only side effects being occasional hot flushes and dry skin. But in the last few months I've developed a sore, itchy vagina. My GP tested for thrush and other infections and found nothing. She diagnosed vaginal atrophy most likely made worse by the lack of oestrogen in my system from the Letrozole and said the normal treatment would be oestrogen cream which obviously I mustn't use having had an oestrogen receptive tumour. She prescribed Replens vaginal cream but it gives a burning sensation inside and I started to spot a little so I stopped using it. She also gave me Dactort steroid cream to use sparingly and occasionally if the itching is driving me mad, but that's also uncomfortable and I'm not keen on using a steroid vaginally. Does anyone else have the same problem? If so what do you use? I'm finding that inserting KY jelly at night seems to relieve it for a couple of days so maybe that's the answer although it's only a lubricant and not a moisturiser like the Replens. I'm widowed and so sex life is not a problem thank goodness. I imagine it would be pretty painful. Would be glad of any thoughts on this.",
      "MessageIndex": 0,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Thanks Misty, I'm also cautious, mainly because I had an oestrogen cream prior to a hysterectomy and pelvic floor repairs a few years back. I had to stop because of bleeding. I knew there was a tiny chance of breast cancer using any oestrogen product but went with the advice. 2 years later my oestrogen receptive breast cancer was found. Probably a coincidence but a bit un-nerving when it comes to taking even the slightest chance which is why I'm looking for an alternative.",
      "MessageIndex": 10,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Seems to be working. Used  \"YES\" every day for 7 days and now using every 2 or 3 days depending on when the itch returns! I do recommend it but next time I see my GP I'll ask if the moisturiser is available on prescription (the lubricator is) as it's £9.99 a tube. But I'd still consider it worth paying if not. I worked out a tube will last at least a month or more. I'll also check on her opinion of the ingredients. If she doesn't OK it I'll get back to you all. Good luck with the itch and best wishes everyone.",
      "MessageIndex": 21,
      "PostDate": "10/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Hi Vivvy, thanks for your reply. I'm so glad for you that you can use the oestrogen pessaries. That's the obvious answer if you can take them. Letrozole doesn't seem to disagree with me so much so I'm happy to carry on with it. It seems to be an individual thing as to whether your body can tolerate it. I also have osteo arthritis in my knees and hands but it was already causing me problems before the cancer. I had a knee replacement last January. They did tell me at The Royal Marsden that I could change to another anti oestrogen pill if I had a bad reaction, but all seems tolerable except this horrible vaginal problem. Good luck Vivvy.",
      "MessageIndex": 5,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "OK, so I used the YES moisturiser last night. It's a bit like KY jelly in consistency so a bit messy, but it didn't sting and I'm feeling comfy today. Panty liners are a must the following morning after use. So far, so good.",
      "MessageIndex": 16,
      "PostDate": "28/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "So I'm now Day 6 with the YES vaginal moisturiser and it feels like a miracle! No soreness or itching now. I'm a bit wary of the next few days because after 7 days you are supposed just to use it every 3 days or 2 if needed so I'll see how that goes. I like that it's organic, no nasty chemicals. The only disadvantage is that it's more of a soft gel (like KY) than a cream so can be a bit messy to use, but that's a minor issue compared to the discomfort I was having before.",
      "MessageIndex": 18,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112430/letrazole-side-effect",
      "Title": "Letrazole side effect"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "I'm in my 3rd year of Letrozole now, and the best way I find to cope is to take regular paracetamol WITHOUT FAIL! I don't wait for pain to kick in and I take 2 in the morning, mid afternoon and before bed every day. It does take the edge off the pain but the stiffness which I already had with arthritis (had one knee replacement and due for another) remains the same. I also already had arthritis in my hands so I can't really tell if the Letrozole worsened it any more than not taking it would have done. I read today that there will be trials for women with ER positive tumours to take Letrozole or a similar drug for 10 years as it may decease the chances of cancer coming back. I think there's a forum on here about it too. Also statins may prevent a recurrence by 39% so that's being investigated. (Links below) My initial reaction was - nooo, not more side effects! But actually I soon realised I can live with side effects and cancer returning would probably mean I don't live. It's a bit of a no-brainer really. https://www.theguardian.com/society/2016/jun/05/breast-cancer-drugs-decade-study-aromatase-inhibitors www.theguardian.com/.../statins-breast-cancer-death-research",
      "MessageIndex": 6,
      "PostDate": "03/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129892/joint-pain",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "I'm in my 3rd year of Letrozole now, and the best way I find to cope is to take regular paracetamol WITHOUT FAIL! I don't wait for pain to kick in and I take 2 in the morning, mid afternoon and before bed every day. It does take the edge off the pain but the stiffness which I already had with arthritis (had one knee replacement and due for another) remains the same. I also already had arthritis in my hands so I can't really tell if the Letrozole worsened it any more than not taking it would have done. I read today that there will be trials for women with ER positive tumours to take Letrozole or a similar drug for 10 years as it may decease the chances of cancer coming back. I think there's a forum on here about it too. Also statins may prevent a recurrence by 39% so that's being investigated. (Links below) My initial reaction was - nooo, not more side effects! But actually I soon realised I can live with side effects and cancer returning would probably mean I don't live. It's a bit of a no-brainer really. https://www.theguardian.com/society/2016/jun/05/breast-cancer-drugs-decade-study-aromatase-inhibitors www.theguardian.com/.../statins-breast-cancer-death-research",
      "MessageIndex": 21,
      "PostDate": "03/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129892/joint-pain",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "Of course it will be at the back of your Mum's mind, but she will be wanting to think that others are not anxious for her and letting it spoil her or their Christmas. We were preparing for my son's wedding in 2014 when I was diagnosed and had a small tumour removed 3 weeks before the wedding. After the wedding I had 3 weeks radiotherapy and so far so good. Only my sons and a few close friends knew and I sailed through the wedding knowing that my son and his beautiful bride were the centre of attention and not me with my problems. I was also widowed before my cancer but I knew my family were there for me. It's amazing what you can face in the knowledge that your kids will back you. Let your mum know you care, but don't make Christmas all about your anxiety for her. It may not be cancer, it may be a tiny tumour easily treated, no-one knows yet. Cross each bridge with her as you come to it. And have a great Christmas!",
      "MessageIndex": 7,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120065/breast-lump-over-50",
      "Title": "Breast lump over 50"
    },
    {
      "AuthorID": "ceecee152",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ceecee152",
      "Content": "If your Mum does shield you from anything, sometimes we do this to shield ourselves from having to discuss things we don't necessarily feel like discussing until we're ready. I found I needed to do a lot of thinking before I talked to people because I felt I didn't want to suddenly be defined by my cancer. I am so many things besides being a person who had a cancer op and radiotherapy. Sometimes it's good to hang onto that and not be confiding in people about everything even though they are those who you know care. It's occasionally enough to be dealing with your own thoughts and worries and coming to terms with what's happening without having to deal with someone else's feelings, despite the fact that you know how much they care. Sorry, long sentences! But being there, listening, and then doing normal stuff together is the best thing to do until you know what, if anything, your Mum is up against. ",
      "MessageIndex": 12,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120065/breast-lump-over-50",
      "Title": "Breast lump over 50"
    }
  ]
}