{
  "AuthorID": "Charlotte2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charlotte2",
  "Posts": [
    {
      "AuthorID": "Charlotte2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charlotte2",
      "Content": "I have just been told I have breast cancer and I'm having a hard time accepting it. I'm 8 weeks pregnant and being seen at the Royal Free in North London. They told me they will operate in two weeks but I'm finding the idea of waiting till then pretty scary as there doesn't seem to be anything I can do to help myself in the meantime? It feels very surreal to have been told I have this serious illness when for now I feel and look completely normal. I really hope I can keep the baby as it the only thing keeping me going at the moment, they say it should be ok and I can have chemotherapy after the first trimester is over. I really feel like I need to talk to someone who is going through this or who has come of the other side of a similar situation as for now it is very lonely. I'm dreading telling my bosses at work and my family, there is a history of breast cancer in the family and this is going to be a real blow for all of them. If anyone has any tips on how to take my mind off this for a few hours, how to sleep would be good! Or even better if I could meet up with someone for a chat I think it would really help. At the moment I'm feeling pretty lost. Also any tips on breaking the news to family would be appreciated. Thank You",
      "MessageIndex": 21,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10975/new-to-site-and-pregnant",
      "Title": "New to site and pregnant"
    },
    {
      "AuthorID": "Charlotte2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charlotte2",
      "Content": "Dear Sally, Thank you so much for your response it's very comforting to hear that you and your baby are doing well. I met Dr Jones for the first time yesterday and she certainly seems to know her stuff and I do feel I'm in good hands. I look forward to the days when I can manage to forget about all this for a while I'm sure they will come eventually it's just all very new and hard to absorb at the moment, I think I'm still at the \"why me?\" stage which isn't particularly useful. I need to find some courage to face this but I'm just not sure how though you're right the baby does help. I just don't feel sure it will be ok yet as it's so early just 8 weeks. Anyhow thanks again for your kind words and the offer of hearing me rant it's good to know I can pm if I have a question or need to talk I really appreciate it! I'm sure things will start to get a bit easier soon. Best Wishes C",
      "MessageIndex": 24,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10975/new-to-site-and-pregnant",
      "Title": "New to site and pregnant"
    },
    {
      "AuthorID": "Charlotte2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charlotte2",
      "Content": "Thank you for your very kind advice, it is good to hear that you were also told that chemo after the first trimester is ok, it seems so strange that the baby can carry on fine while we have to deal with all the side effects, though I'm not really sure what to expect from the chemo except feeling rough and my hair falling out. It's going to be hard talking to my family as I find my parents a bit difficult and I'm very close to my sister who will be very scared by all this but maybe this experience will bring us all closer in the end and as you say I'm going to need the support. I think you're right and it will get a bit easier to deal with day by day I am so looking forward to having a good nights sleep again at some point, in the meantime I will take your advice and try and rest up a bit. Thanks again for taking the trouble to reply to my post it really means a lot to me to have some support at the moment as I don't really feel ready to tell friends about it and I'm a bit afraid of how they will react. C",
      "MessageIndex": 25,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10975/new-to-site-and-pregnant",
      "Title": "New to site and pregnant"
    }
  ]
}