{
  "AuthorID": "charrey123",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charrey123",
  "Posts": [
    {
      "AuthorID": "charrey123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charrey123",
      "Content": "mini_moo Hiya I've finished my 6 sessions of chemo (yes!), but since moving onto Docetaxil for the last 3 sessions, I've noticed my nails are changing appearance. I have put up with pain in my fingertips and toes from the last time round. I've noticed the nails aren't so much sore now, but half numb and feel dry. So going through a lot more hand cream than I would normally. But it's my nails that are concerning me. They are going dark pink then yellow, bit like blood vessels popping underneath first of all. The white tips of my nails are spreading downwards, so I now have massive white tips. Got some brown areas too in one or two nails, not very attractive. I'm worried they may just fall off, as.The 'yellow' bits look like the nails are starting to come away from the pink bits. :-/ I caught my longer thumb nail doing something. Usually this would be painful and you'd notice. But i didn't notice and it didn't hurt. Same for stubbing my little toe - hardly any pain when usually this would be sore. yes, it was tender, but not really painful. Shall I see the GP? Is this normal? Will my nails return to normal? Getting rather worried about them. Don't even like to show them. Think I'll cut them right down tonight so that I don't catch them and pull them off! Hi, I'm 2thirds way through 18 week paclitaxel and all my finger nails are lifting. I've now been told this happens( not told before only about hair loss ) but have read several posts that day they will grow back after a few months. Just be careful of infection. PC",
      "MessageIndex": 17,
      "PostDate": "30/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55047/nail-problem-from-chemo---urgent-advice-please",
      "Title": "Nail problem from chemo - urgent advice please?"
    },
    {
      "AuthorID": "charrey123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charrey123",
      "Content": "Crystaljuju Losing nails is very normal and common after Docetaxol. No need to see your GP. It is a documented side effect which you should have been informed of. Keep the nail bed clean and dry. They will be sore for a few weeks and especially when the nail first comes away. Julia x Thanks for your reply, do you think the nails will grow back?",
      "MessageIndex": 13,
      "PostDate": "28/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55047/nail-problem-from-chemo---urgent-advice-please",
      "Title": "Nail problem from chemo - urgent advice please?"
    },
    {
      "AuthorID": "charrey123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charrey123",
      "Content": "SaxxyD Hi mini_moo I too have had what you are experiencing from chemo...your nails look like you have had a really bad french manicure :-/ Where you are seeing the different colours you may see that part of the nail will come away. Put strong clear nail varnish on and see if you can hang onto your nails for as long as possible to allow the new growth to get as far down your nail. Sorry to say but i have lost all 10 nails and one of my toe nails. But please don't be alarmed as they do grow back. Mine have got a ridge on them where the bad nail fell off and the new growth is. I would cut them level with the tops of your fingers to help avoid breakage. Keep them moisturised too as this will help. Remember everything that chemo takes away will come back so before you know it you will have lovely nails again xxx Any other questions just ask away xxxx so glad you have said that as my nails are All coming off during my chemo.",
      "MessageIndex": 10,
      "PostDate": "28/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55047/nail-problem-from-chemo---urgent-advice-please",
      "Title": "Nail problem from chemo - urgent advice please?"
    },
    {
      "AuthorID": "charrey123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charrey123",
      "Content": "mini_moo Hiya I've finished my 6 sessions of chemo (yes!), but since moving onto Docetaxil for the last 3 sessions, I've noticed my nails are changing appearance. I have put up with pain in my fingertips and toes from the last time round. I've noticed the nails aren't so much sore now, but half numb and feel dry. So going through a lot more hand cream than I would normally. But it's my nails that are concerning me. They are going dark pink then yellow, bit like blood vessels popping underneath first of all. The white tips of my nails are spreading downwards, so I now have massive white tips. Got some brown areas too in one or two nails, not very attractive. I'm worried they may just fall off, as.The 'yellow' bits look like the nails are starting to come away from the pink bits. :-/ I caught my longer thumb nail doing something. Usually this would be painful and you'd notice. But i didn't notice and it didn't hurt. Same for stubbing my little toe - hardly any pain when usually this would be sore. yes, it was tender, but not really painful. Shall I see the GP? Is this normal? Will my nails return to normal? Getting rather worried about them. Don't even like to show them. Think I'll cut them right down tonight so that I don't catch them and pull them off! Hi, I'm 2thirds way through 18 week paclitaxel and all my finger nails are lifting. I've now been told this happens( not told before only about hair loss ) but have read several posts that day they will grow back after a few months. Just be careful of infection. PC",
      "MessageIndex": 32,
      "PostDate": "30/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55047/nail-problem-from-chemo---urgent-advice-please",
      "Title": "Nail problem from chemo - urgent advice please?"
    },
    {
      "AuthorID": "charrey123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charrey123",
      "Content": "Andrea55 I have now been referred to a specialist. Whilst I was warned this could happen it has shocked me just how much my arm has changed shape and now my hand has also swollen up. Will be fitted with a compression sleeve but any advice would be appreciated on reducing affects. I was hoping to dodge this one but looks like my arm is going to be a problem now. Also next t chemo postponed due to having yet another tooth out this week so I'm pretty fed up!! I am trying to keep my spirits up whilst my body is falling to bits. I don't really recognise myself in the mirror anymore. Sorry just feel like a moan today Andrea x Hi sorry to hear you are suffering from this but apart from the massage tips I hope you have been given there isn't really anything more you can do. I was diagnosed with breast cancer in 1997 and have had lymphodema since then. I'm at present having chemo as my cancer has returned in my bones and now my liver. I hope you get on with your treatment and keep trying to be positive but I'm afraid once you get lymphodema you seem to have it for life. You will find it makes choosing clothes more and more difficult as you will find your swollen arm Will make a difference in what you can wear. Lots of Jersey tops in winter .Blouses are most definitely out I'm afraid.Sorry if this does sound negative but it's reality.",
      "MessageIndex": 19,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109161/lymphodema-in-arm",
      "Title": "Lymphodema in arm"
    },
    {
      "AuthorID": "charrey123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/charrey123",
      "Content": "better to still have a boob, whatever  colour xxx",
      "MessageIndex": 5,
      "PostDate": "10/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111626/green-boob",
      "Title": "Green boob!"
    }
  ]
}