{
  "AuthorID": "chellesimo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chellesimo",
  "Posts": [
    {
      "AuthorID": "chellesimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chellesimo",
      "Content": "Hi Linmo sorry for jumping in, as I can see you have had some really good advice. I felt I had to comment as your symptoms are so similar to my experience on letrozole.  I had been taking it for one year with achy legs and hips. Then my symptoms got worse almost over night. My hips and lower back were so painful, and I was struggling to even walk around my office at work without being bent over. I was shuffling around like an 80 year old woman and it was embarrassing. My GP thought it was sciatica and I had an X-ray which came back clear. Then I had an Oncology appointment, and my Dad had to take me in a wheelchair as I couldn’t walk.  My Oncoligist took one look at me and told me to stop the letrozole immediately. I took nothing for 2 weeks, and I was almost symptom free. I now take anastrozole, and yes I still get stiff and achy joints, but It feels like I have my life back.  Hope the steroid injection works, nothing worse when you are in pain. ",
      "MessageIndex": 7,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168250/awake-and-upset",
      "Title": "Awake and upset"
    },
    {
      "AuthorID": "chellesimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chellesimo",
      "Content": "Hi Mandy The brand I am on is called accord. I did not realise different brands could have different effects. I find some days are better than others. Tonight my feet are very painful and I have a job to stand.  when I first started taking it and having the zoladex injection, I was getting really bad head aches. I would end up having to spend days in bed. I'm now on a beta blocker to stop the head aches which seems to be working.  Thank you for replying, it's nice to speak to someone in a similar situation. Michelle ",
      "MessageIndex": 7,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106167/letrozole-and-zoladex",
      "Title": "letrozole and zoladex"
    },
    {
      "AuthorID": "chellesimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chellesimo",
      "Content": "Hi  I've been on letrezole and zoladex now for 18 months. I've been experiencing horrible side effects. My joints are very painful especially my hips and knees. My feet are also very painful. If I sit for too long I find it very difficult to get up and moving again. I've put on 3 stone in weight and I'm tired all the time. However the combination of the drugs has stopped the tumours from growing ( I have sarcoma of the lungs) so I keep on going.  I don't look at the needle. The last one left my stomach black and blue with a huge lump. It depends on the nurse that's doing it on how painful or bruised I get. ",
      "MessageIndex": 5,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106167/letrozole-and-zoladex",
      "Title": "letrozole and zoladex"
    },
    {
      "AuthorID": "chellesimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chellesimo",
      "Content": "Hi I have been having Zoledex injections now for 2 years. And I can honestly say that every time is different. Some times I don’t feel a thing, other times it hurts like hell. I think it depends on who is doing it, and which side for me, my right side is better than my left for some reason. I tend not to look, take a deep breath, and it’s over in seconds. It’s not nice, but hay it’s keeping me alive.  All the best ",
      "MessageIndex": 5,
      "PostDate": "03/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141483/am-i-a-wuss-to-fear-zoladex",
      "Title": "Am i a wuss to fear Zoladex?"
    }
  ]
}