{
  "AuthorID": "CherryCherry",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cherrycherry",
  "Posts": [{
    "AuthorID": "CherryCherry",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cherrycherry",
    "Content": "Hello, Bosco. Tomorrow is my last radiotherapy session (15x) and I had DCIS with a skin saving mastectomy in July with immediate reconstruction with a saline/silicone implant. I didn't have the LD flap, but I believe the implant is your main concern with the radiotherapy. Everyone is different, and if you're very worried you may want to speak to your BCN or surgeon. I asked for an appointment with both after radiotherapy was agreed, and both my surgeon and BCN were extremely helpful in giving good, rounded details about all the possibilities. The bottom line I got from this appointment was: no one can predict how their skin and their reconstruction will respond to radiotherapy. Even if you're very fair and prone to burning, or have sensitive skin... this isn't necessarily a sign you will react badly to the radiotherapy. I am fair skinned, freckled, and have very sensitive skin, and my radiotherapy team are now saying how good my skin looks. All I can tell you is my experience, which may not resemble yours in the end.  I had three tumours. One of them, which was only grade 1, was less than .5mm from my chest wall. I probably could have skipped radiotherapy if I'd argued for it, but as I fell squarely into the NHS guidelines for radiotherapy and my oncologist recommended it, I didn't want cosmetic issues to sway me. Believe me, I am a person who takes a lot of pride in my appearance and the idea of ending up with a ruined reconstruction was not pleasant to contemplate. But it was not even a question for me. I knew I wanted to come through this feeling confident that I had done everything I possibly could to prevent the cancer's return. So I agreed to radiotherapy and began 7 weeks after my mastectomy/reconstruction. Yes, the radiotherapy has changed the shape, size, and feel of my implant. HOWEVER, I have been fanatically doing my stretching exercises (which a physiotherapist will give you before you get your first radiotherapy treatment) and so far for me, it has helped. Sometimes the area of the implant feels 'tight' and I can see visibly that it has contracted against my chest, as if it's being pulled. So far, that is all - no twisting, dimpling, rippling, or lumps. And the more cream I use, the better it feels beneath the skin. The stretches have really helped loosen the tight feeling (although the main purpose is to prevent loss of motion and lymphedema). I don't know if size/shape change is permanent. This happened in my second week as well and then over the weekend the contracting relaxed and my implant looked like it always did. Then yesterday (Monday) after my treatment, it contracted right back. The effects are cumulative, as you know, so I will gladly keep you posted on changes after my final session tomorrow. Feel free to PM me. I'll be meeting with my surgeon soon, and will find out what comes next. I am sure I need more saline added, but as of now I don't know if this is an option or if I would just need another implant. Also... I am going to ask for a silicone only implant. This saline/silicone implant has always felt like a rock and I hate it, so for me another op may be less of a bother than for you if you're happy with yours. My skin looks much the same as always, although with a few broken capillaries across my chest where there has been sun exposure over the years. I used XClair cream, which I've had to beg and argue in order to get. It's expensive and I've found it difficult to convince my radiotherapy team to prescribe it. In the end I asked my GP, who prescribed it. My skin care routine is: wash with Simple soap, pat dry, apply XClair 3-4x day, and really slather it on straight after the session (while still in the dressing room) and again before bedtime. My skin will be red and itchy for a few hours after the session -- I have a wax bolus, which makes it more targeted and intense -- but by morning my skin looks totally normal. Whatever cream you use, keep at least two tubes to hand as you will go through it quickly and you don't want to run out! Anyway, I will keep you posted. Any questions, let me know.  Good luck. Cherry xx ",
    "MessageIndex": 2,
    "PostDate": "30/09/2014",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83481/mastectomy-ld-flap-implant-radiotherapy",
    "Title": "Mastectomy + LD flap + Implant = Radiotherapy"
  }]
}