{
  "AuthorID": "chillipepper1970",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chillipepper1970",
  "Posts": [
    {
      "AuthorID": "chillipepper1970",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chillipepper1970",
      "Content": "hi Jackie, I know how you feel, it's like a roller coaster into the unknown isn't it. I've so far had one of my first FEC-T, and like you at 12 o clock today I will be having my 2nd one. If I had to sum it up if would be a mix of bad morning sickness, chronic hangover and food poisoning. Try and eat a little before and if you like a cup of tea or coffee have it, if you're anything like me it will taste gross for a week or so after. Take some company or something to pass the time you may be in for hours. Suck boiled sweets as you get a nasty taste in your mouth and take a large bottle of water, it will flush the chemo through your bladder, don't want a bladder infection on top of everything else. Everything you eat on chemo day will proberly horrid for life, you will associate it with feeling sick, so don't eat your favourite food. I had the following side effects:- Spongy slimy tongue and mouth- brush teeth 3-5 times a day use corsodyl mouthwash. Tiredness - rest and sleep but try and stay in a routine. Sickness- take anti sickness drugs they give you, even if you don't feel sick. Eat anything with ginger or bland food little and often. Heartburn- was the worst thing, my oncologist prescribed meds to take next time. I also had constipation during the first few days then the oppersite for a few days after. I then had aches in my legs on week two but this too passed. My scalp felt sensertive on day 15 and my day 16 it was coming out in handfuls, I sobbed as my husband shaved off my long dark hair, but you do get used to it with the help of wigs and scarves. I felt back to my normal self by day 6, no more daily injections or drugs, taste came back too. Remember to plan fun stuff for week 3, I've been out for meals and Christmas shopping. Please don't worry, this whole cancer thing is tough but doable. I hope you get on ok, if you feel upto it, keep in touch, we can exchange tips xx Sara x",
      "MessageIndex": 10,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67331/chemo-tomorrow",
      "Title": "Chemo tomorrow"
    },
    {
      "AuthorID": "chillipepper1970",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chillipepper1970",
      "Content": "Hi, After researching all of the options I have decided to have the DIEP with my mastectomy.. I am infact having it in the morning. I have had all of my pre op, blood thinning injection ect.. And due to shortness of beds am at home, to return at 7am. I am having mine at Broomfields in Chelmsford., and attended a bra show and tell there, so amazing to see and talk to ladies who had ad it, they call it gold star reconstruction. It is a big operation, once up and running I will let you know how it all went. Sara",
      "MessageIndex": 3,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64269/advice-needed---diep-flap-or-not",
      "Title": "Advice needed - Diep flap or not"
    }
  ]
}