{
  "AuthorID": "Chodgy",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
  "Posts": [
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi jellytot83. Thanks so much. Very, very useful.",
      "MessageIndex": 7,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57102/chemotherapy-tips",
      "Title": "Chemotherapy Tips"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi What a rotten time to get your diagnosis but you are definately not alone out there. I was diagnosed a couple of weeks ago. The consultant told me I had 'common or garden ductal carcinoma'. Thats the DC in DCIS. Yours is in situ ( IS) & I think it means it's still in the duct & hasn't got into normal breast tissue. I'm having a lumpectomy on 3rd January. I will have to wait a couple of weeks after that to get the hystology results and then I'll have to see the oncologist to discuss what else needs to be done.",
      "MessageIndex": 1,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56203/intro---diagnosis-day",
      "Title": "Intro - Diagnosis Day"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi Lyndyloo. Well I went for my first chemo today and had the cold cap on. It felt a bit heavy and weird with a chin strap on and a hose going from the back of of it to the cooling machine. I got used to the cold after about 20 minutes and didn't get the 'ice cream headache' they warned me about. They sprayed my hair with water and smeared conditioner on before we started. It was so funny when they took it off - I had little icicles in my hair but I'd taken a towelling turban to put on & it soon warmed up. It's a bit of a pain having to sit with it on for 2 hours after the chemo has finished but it is doable. I will have it on again next time. x",
      "MessageIndex": 19,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57563/cold-cap-any-advice",
      "Title": "Cold cap? any advice"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi Lyndyloo. Me too. I start my FEC-T chemo on 22nd Feb and my oncologist has recommended I go for the cold cap. I wasn't sure either but I think I'll probably give it a try, after reading the comments here. The trouble is I'm a bit of a wimp when it comes to feeling the cold. Going with it wet & covered in conditioner is an interesting concept. Haven't heard that one before.",
      "MessageIndex": 7,
      "PostDate": "09/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57563/cold-cap-any-advice",
      "Title": "Cold cap? any advice"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi Lyndyloo. Well I went for my first chemo today and had the cold cap on. It felt a bit heavy and weird with a chin strap on and a hose going from the back of of it to the cooling machine. I got used to the cold after about 20 minutes and didn't get the 'ice cream headache' they warned me about. They sprayed my hair with water and smeared conditioner on before we started. It was so funny when they took it off - I had little icicles in my hair but I'd taken a towelling turban to put on & it soon warmed up. It's a bit of a pain having to sit with it on for 2 hours after the chemo has finished but it is doable. I will have it on again next time. x",
      "MessageIndex": 34,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57563/cold-cap-any-advice",
      "Title": "Cold cap? any advice"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi folks. I didn't see the histology report either. My consultant told me the results, later confirmed by the oncologist. I did get a copy of the letter they sent to my GP detailing my diagnosis, grading and HER status along with my treatment plan. I guess if it's good enough for the GP it's good enough for me. xx",
      "MessageIndex": 4,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58012/i-never-saw-results",
      "Title": "i never saw results"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi. I had cording after my surgery too. It was really painful and I was told that I would need physio if it didn't improve with the excercises. I persevered with them and in addition tried to maintain stretches for about 30 seconds. I woke up one morning after 7 weeks and realised it had eased a bit. It had virtually gone within another couple of days. Hope you get it sorted soon.         ",
      "MessageIndex": 2,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58866/cording-after-mastectomy-and-node-clearance",
      "Title": "Cording after Mastectomy and node clearance"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi. Oh how I feel for you. This is not like you at all but I can see exactly where you are coming from. As you know I am only at the beginning of this journey but you have been so brilliant to me when I have felt like my world was caving in - sending me great advice, hugs and positive vibes. Well now it's my turn. You hit the nail on the head when you wrote the words 'whole life changing experience' and you have been stoic throughout ( not sure that I've spelt it right but you get my drift). You've hit a brick wall & come crashing down with a hell of a bump but I'm sure it's just a blip and not a permanent state of affairs. I'm sure your workmates have not forgotten what you have been through but are just relieved to have you back. It's much easier for them to put it all behind them and carry on as though nothing has happened but you are the one carrying the battle scars around. Hopefully your GP has rung you back by now with some sound advice and you'll soon be your own 'bubbly' self again. I haven't shouted at my husband yet but the other day I did feel like kicking the cat (for all you animal lovers out there - just so's you know - I didn't) and shouted at her to get out from under my feet. I apologised, she forgave me & was just as purry as ever later on. Take care. Love, hugs and positive vibes to you. xxx",
      "MessageIndex": 3,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57080/fed-up-and-depressed",
      "Title": "Fed up and depressed"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Cheers for the replies. I havent got a date for starting my chemo yet and I guess it depends on what the time frame is between seeing the oncologist for the first time and the first chemo session. My cancer was hormone negative but Her positive so chemo first I think and then Herceptin. In theory there's plenty I can do at work at the moment until I start chemo but I do work in a care home so yes, mrsa, norovirus, chest infections etc , etc. I suggested half shifts for now - we usually do 13 hour shifts ( a killer when you're feeling well) but although my collegues say that's easily sorted, HR are not convinced. As for SSP - yes we could manage for a bit but that was my GPs point. His words were 'I can't sign you off sick to sit at home for months at the tax payer's expense'!! We'll see what the Onco & my BCN think on Tuesday.",
      "MessageIndex": 3,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57415/fit-notes",
      "Title": "Fit notes"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi. Well I'm 4 weeks post op and feeling ok for now. My sick note ran out yesterday and my GP has signed me back to work but has ticked the box 'altered hours' and 'amended duties'. However, work are not happy and say I should stay off sick until all my treatment is finished which, as my GP pointed out, will be months. I see the oncologist for the first time on Tuesday about chemo so I've taken annual leave for now. Anyone else had issues with work?",
      "MessageIndex": 0,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57415/fit-notes",
      "Title": "Fit notes"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Thanks everyone. My GP, in fairness, was concerned that I would lose out 'big time' financially and also that I would benefit from the mental stimulation of having something else to think about other than my cancer if I went to work on the days when I feel well. However, he is convinced that the only reason work have said for me to take the whole time off is because they can't be bothered with the hassle and that if he is willing to sit in front of his computer churning out sick notes on an 'as and when' basis then they should be willing to put themselves out too. I actually think that is a bit harsh as I'm pretty sure my friends at work care about my wellbeing - we have worked together for years. It doesn't alter the fact though that HR have told me to hang onto the fit note as they are not willing to accept it for now. GP had told me that once that fit note is in their possession and I turn up for work they have to pay me for my contracted hours even if they send me home again. The fit note is for 21 days and I'm sure I would benefit for a couple of weeks back at work when my weeks AL is up but I agree that it will be a different matter once my chemo starts. As you say my workplace is full of people with nasty bugs. I will just have to convince my GP of that.",
      "MessageIndex": 8,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57415/fit-notes",
      "Title": "Fit notes"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Thanks Gail. I shall definately ask the oncologist on Tuesday. I'm sure my GP will respect her decision. I also spent a good few years as a scrub nurse in theatres and appreciate how tough it can be on your feet for hours on end. Good luck with the rest of your treatment. I hope you get some good days soon.",
      "MessageIndex": 10,
      "PostDate": "01/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57415/fit-notes",
      "Title": "Fit notes"
    },
    {
      "AuthorID": "Chodgy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chodgy",
      "Content": "Hi jan56. Sorry you're having to go through this as well but welcome. I went through exactly the same in the middle of December. If your breast care team is anywhere as good as mine is they will talk you through everything stage by stage. They do give you an opportunity to ask questions and the only thing I asked them was how long I would have to wait for surgery and how long I would have to have off work!! I have since learned that, in the great scheme of things, work doesn't matter so much. The breast care nurse gave me her telephone number and told me to ring her if I thought of any other questions that I needed answered but they seemed to cover everything. She went through it all again at my pre op appointment anyway.  I've taken my husband along to all my significant appointments as I thought it would be better to have another brain there in addition to my half a brain! As to the grading etc, I didn't find out for sure until 2 weeks after the surgery when they had done thorough histology on the lump and I then had something definite to relate too. I had my surgery - wide local excision and sentinel node biopsy on 4th January and am going to start my chemo on Friday. Best of luck for tomorrow.",
      "MessageIndex": 1,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57949/had-biopsy-see-consultant-tomorrow",
      "Title": "Had biopsy, see consultant tomorrow"
    }
  ]
}