{
  "AuthorID": "ChoozySuzy",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/choozysuzy",
  "Posts": [
    {
      "AuthorID": "ChoozySuzy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/choozysuzy",
      "Content": "hi wendy its your mate sue xxx best thing i took in was a good book ( I thought) , but as others have said on here, I never read a word cos of all nice people you meet on the ward ... most of them I have kept in touch with ... I didnt take any nighties .. just a long pyjama top which i got from Debenhams, but I was out in same day so didnt really use it, most of us in the ward just kept the nightie and gown on that the hospital provided. The drain was a bit of a pain but my hospital provided a little jaunty bag to put it in so no one really knew what it was! Keep it touch pet xxxxxxxxxx   ",
      "MessageIndex": 10,
      "PostDate": "18/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48112/what-to-take-with-me-into-hospital-for-mx-lymph-node-clearance",
      "Title": "What to take with me into hospital for MX & Lymph node clearance ..."
    },
    {
      "AuthorID": "ChoozySuzy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/choozysuzy",
      "Content": "Hi there My husband submitted a claim last September and finally had a home assessment on January 4th but as yet there is no joy ... after many phone calls to Capita ( the outside agency supposedly helping the DWP) we are still no further on. We just keep being asked to phone back in two weeks. Its not good enough and there isn't a lot we can do about it. I would love to hear from anyone who has actually had a claim finalised. Hope everyone else has better luck than us.  ",
      "MessageIndex": 2,
      "PostDate": "19/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73850/has-anyone-tried-to-get-pip",
      "Title": "Has anyone tried to get PIP"
    }
  ]
}