{
  "AuthorID": "Christinax2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/christinax2",
  "Posts": [{
    "AuthorID": "Christinax2",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/christinax2",
    "Content": "Gosh Sharon, have you been spying on me? Just this morning I wrote an email to my cousin in Australia, saying the very same thing. I was saying how, when I was initially diagnosed, I wasn't sure how I felt, nor how I should have felt. I don't know as I'm any wiser now but I do feel closer to my feelings, if that makes any sense. At first I had so many mixed emotions but nothing felt real enough to decide how I actually felt and how I was going to deal with this blow. I kept expecting to get a sudden awakening, where everything would fall into place and I'd become this person with total insight and be able to answer all my own questions and those of my family too. The truth is, I never did get that sudden awakening but, a couple of months down the line, I now feel brave enough to share other peoples' experiences and find the answers I really want. I've now had experience of my own and know how my body and mind has reacted to them. I've felt the shame of believing that I must be the most vain woman in the world when all I could cry about was losing my hair, when my biggest worry was how I'd match a bandana with a dress to go for a meal for my sister's Birthday. I found out for myself that each session of Chemotherapy leaves me feeling a different kind of awful afterwards. I know how dreadful I felt when I was admitted to hospital and the lady in the bed opposite assumed I must be terminally ill, as she was. I almost felt guilty for not being, yet I wanted to ask her so many questions about her own condition just to find out how I should actually feel. I felt desperate to find out from an 'expert', so to speak. I felt so negative and so alone, despite my lovely family, yet here I am a couple of months on, feeling totally different. For six months I'd been telling my GP that he'd misdiagnosed me with Glandular Fever and just when I was starting to believe that it must have been Glandular Fever, I was diagnosed with Hodgkin's Lymphoma, at stage 2. People constantly told me that it was 'The best Cancer to have if you're going to have Cancer' and stressing how good the success rate is, so I ended up feeling guilty for feeling so sorry for myself when others have it so much worse. I almost felt like I hadn't got 'real' Cancer. The truth is that having Hodgkin's is by far the biggest thing that's ever happened in my life, regardless of how good or bad the expected outcome is. Everybody has the right to feel sorry for themselves, just as everybody has the right to stand up and fight this horrible disease. I do worry about how it affects my children, my husband, my parents, etc., but most of all I think about how it affects me and how to limit it's control. Initially I concentrated on the decisions Cancer makes for me; my hair, my fertility, my job, driving, etc. Just a couple of months down the line I'm now working through taking back the decision making and proving to myself just how much I can still do regardless of the condition. ABVD causes me to feel dreadful every other week but I still have the alternate week when I can kick it into touch and do whatever I want to enjoy living. (OK, well perhaps I can't go and get a hair cut, but at least I save money!!) I can't forget that it's there but I can concentrate on the things it can't take away from me. My confidence may have taken a heck of a knock but after forcing myself to leave the house during my good weeks I soon realised that people really do have more on their minds than staring at me in my bandana. I drove my daughter to and from school by myself this morning, the first time since I started my treatment and boy did it feel good driving home in the sunshine, roof down and no need to worry about my hair blowing in my face! It took much less time to get ready too, just jump in and out of the shower, no hairdryer, hairbrush, styling products, etc. I don't know whether how I feel now is how I should feel, but I know that I feel more powerful and a thousand times more positive than I did during the first few weeks. Nothing seemed real. 'Why me?' seemed such a ridiculous question to ask, but the one I constantly felt I needed to ask. I now know that I'm probably never going to get the answer to that one but it's not the end of the world if I don't. What I can answer is 'What now?' and as every day goes by, I'm gathering my own experiences of beating this condition. People constantly told me to think positive and my constant reply was that I couldn't control how I thought and I couldn't simply pretend to be positive. I now realise that I was probably just in shock and unable to really think anything - positive or otherwise. Even if we're told that we have an 85% chance of beating this, there's bound to be more than a glancing thought about that other 15% and I don't believe we should beat ourselves up for sometimes feeling this way. In my own experience, feelings get so much easier and positivity returns ten-fold. Initially I felt unable to get involved with forums, afterall, what would I know about Cancer when I've only just been diagnosed? What if I constantly say the wrong things? Now I know that everyone's experience is unique to them and by sharing other peoples' experiences we empower ourselves against the condition. I only joined this forum today, after lurking for sometime, but I can't begin to tell you how much I wish I'd done it sooner. I'm already feeling so much more normal, not to mention welcome and supported. For me, having Cancer is pretty much like childbirth. Nobody can prepare you for it, nobody can explain exactly how it feels, there's no right or wrong way to do it, but it feels a whole lot better to talk about it and know that there are lots of people out there who know just where you're coming from. After having my son 19 years ago, I remember suddenly having my own childbirth story and feeling I'd achieved something really special. I wouldn't ever choose to have Cancer but I do believe it gives me a kind of insight from which I can gain the strength to fight it. I'm sure going to use that strength to do so much more once I'm recovered. I'm no expert, but we all have our own way of dealing with it and however you're feeling at any particular time is absolutely fine. My feelings change on a daily basis but I no longer feel I have to justify them. I wish you all the best with your treatment and hope I've not rambled on too much. Best regards, Christina",
    "MessageIndex": 2,
    "PostDate": "22/04/2008",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10721/new-to-the-club",
    "Title": "New to the club."
  }]
}