{
  "AuthorID": "chs1978",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chs1978",
  "Posts": [
    {
      "AuthorID": "chs1978",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chs1978",
      "Content": "Thank you very much for your replies, I appreciate it greatly. I know at the moment they are changing a bit due to pregnancy and I intend to breast feed again best I can also. It was during my grandmother's 3rd pregnancy with my aunty that she first noticed a lump and this being my 3rd made me a bit more vigilant about my concerns. I will definitely take your advice and speak to my GP at my next appointment. I wish you both the very best, and thank you once again. x",
      "MessageIndex": 3,
      "PostDate": "07/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/11017/new-to-site-and-i-have-a-query-about-bc",
      "Title": "New to site, and I have a query about BC."
    },
    {
      "AuthorID": "chs1978",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/chs1978",
      "Content": "Hi there. Sadly, a number of years ago, I lost my grandmother to breast cancer. I know that there is evidence of genetic links, but I have a bit of a query about something. I am a size 34 K (although I'm pregnant at the moment and even when I'm not I can't get smaller than a JJ cup) and I worry that if there was anything sinister developing on my breast tissue that I wouldn't be able to detect it there early enough. Could this be the case or am I worrying for no reason? I was trying for a breast reduction on the NHS, before I fell pregnant. They have very strict criteria for our area and where other areas in the uk you may be seen by a consultant if your BMI is below 30, where I am it has to be 26, and no matter what I tried (for over a year!!) I couldn't get below 26.5 and they won't even take into consideration that my breasts probably weigh a stone and that's obviously going to mean I'll have a higher BMI than I'm supposed to! I had stated that one of the reasons for my wanting a breast reduction (apart from the physical and mental distress) was my worry about breast cancer and not being able to detect any lumps, but sadly the NHS weren't interested. Could I be worrying for no reason? Is someone with normal sized breasts more likely to notice something sooner (and there for potentially savin their life) than someone who is as unfortunate to have breasts as large as myself? Thanks.",
      "MessageIndex": 0,
      "PostDate": "06/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/11017/new-to-site-and-i-have-a-query-about-bc",
      "Title": "New to site, and I have a query about BC."
    }
  ]
}