{
  "AuthorID": "claire72",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/claire72",
  "Posts": [
    {
      "AuthorID": "claire72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/claire72",
      "Content": "Hi,  Me again, I've been told that my next surgery is to remove nodes as they have found cancer in at least one.  My last operation a lumpescomy and removal of 2 nodes was delayed on the day as I hadn't had the radio active dye and had to have this injected into my breast before they would do surgery explaining it was so they could see the nodes. I was told on the day that this usually happens the day before so my surgery was put off as long as possible so due had settled.  The next surgery is booked for the 7th and have all paperwork to go in for 7:30, however no one has mentioned going in day before for the dye, just wondering if this is not necessary or a mistake had been made, like it was the last time, is it usual to have dye the day before? Have people have had nodes removed without ?  Thanks again,  Claire ",
      "MessageIndex": 0,
      "PostDate": "20/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118429/radio-active-dye-during-lymph-node-removal",
      "Title": "Radio active dye during lymph node removal"
    },
    {
      "AuthorID": "claire72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/claire72",
      "Content": "hi,  I had mine on the 2nd November, I had dye the same day!  I am now known as smurf tit ! It is a very bright blue, a play doh colour blue and yes for a few days everything is BLUE ! There's no sign of the blue going, it's just getting more of a subtle blue !  Make sure you don't come out of hospital without dressings over the wound. I was sent home the first time without and had a few problems. It's important that you don't do too much ! For the first few days you might feel absolutely fine and it's easy to get sucked into doing more than you should !  I didn't drive and still not driving as had a few problems which are very unusual with first wound  opening up and I've just been in to have all nodes removed.  X X ",
      "MessageIndex": 4,
      "PostDate": "11/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119506/after-sentinel-lymph-node-biopsy",
      "Title": "After sentinel lymph node biopsy"
    },
    {
      "AuthorID": "claire72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/claire72",
      "Content": "Hi,  We are all in a bit of a post code lottery regarding how things are done, it appears to vary so much between different areas !  I had two nodes and a lump removed during the first operation, no wires and radioactive dye, most appear to have that the day before but mine was on day, so even that is different !  and came away with NO dressing and no stitches ! Just glued together! Although It wasn't enough !  The second operation I had all nodes removed, that was Wednesday ! I insisted on dressings and stitches and was told I would have drains in by one consultant and not by another,  I didn't know till I woke up which would be the case !  We all go through very different experiences for the same procedure , it might be worth talking to your consultant and finding out how they do things in your area.  X X X ",
      "MessageIndex": 7,
      "PostDate": "11/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119506/after-sentinel-lymph-node-biopsy",
      "Title": "After sentinel lymph node biopsy"
    },
    {
      "AuthorID": "claire72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/claire72",
      "Content": "Hi,  I had mine on the 2nd as well, exactly the same as you !  should have been at 9 am but eventually taken down to theatre at 4, I was rushed through recovery as there was only a ten minute gap between me being able to go home and having to stop in,  I was a bit shocked to see no dressings on the area and within minutes of getting home I was having to ring the hospital as bleeding badly ! But have been very surprised as I thought I would feel terrible and want to sleep it off in bed,  Day one went ok and took painkillers just in case. Today I've not really had any pain but as the day has gone on, I have got bigger and bigger on that side, it's very heavy and uncomfortable because of size ! It's stretching the skin so is feeling sore as well, but nothing compared to what I was expecting !  I too have felt really good and after reading some responses, I'm wondering if it's drugs during op that doing it ... Hoping I'm not goin to crash tomorrow !  Fingers crossed ! ",
      "MessageIndex": 23,
      "PostDate": "04/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117526/immediate-post---op-experience-lumpectomy-and-axillary-node-clearance",
      "Title": "Immediate post - op experience lumpectomy and Axillary node clearance..."
    },
    {
      "AuthorID": "claire72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/claire72",
      "Content": "Hi,  It's been one week today for me, and unfortunately I've been up at the doctors every day this week other than today ! I have another appointment in the morning at the doctors. I havnt been today, but that's mainly because I've been to the hospital instead ! I have had a lot of swelling so much so my wound has split 3 times and I was starting to get very concerned about it.  For the first time today I have been given clear advice regarding what to do, the breast cancer nurses are fantastic and I wish I had gone to them instead of my local doctors surgery ! But obviously that had to be my first port of call.  I am due for check up on the 17th where results and future treatment will be discussed, I was hoping that I could start radiation treatment about the beginning of December but now questioning if this will be possible ! Didn't really want to start the new year in that way but understand and now use this phrase so much \" what will be will be\"  I think I've been doing too much as well, but it's hard not to when you feel ok, I didn't start feeling off it until Monday ! So did a bit of stuff at the weekend ! Now thinking it might be that that brought me down on Monday ! Whoops !  I've had get well cards,  but prior to Monday didn't feel ill, so it's all a bit confusing. Makes it easier reading things on here as it's very comforting knowing someone else out there is going through the same thing !  Claire ",
      "MessageIndex": 27,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117526/immediate-post---op-experience-lumpectomy-and-axillary-node-clearance",
      "Title": "Immediate post - op experience lumpectomy and Axillary node clearance..."
    },
    {
      "AuthorID": "claire72",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/claire72",
      "Content": "I am finding all this very difficult, I was diagnosed 18 months after my husband if 18 years left me !  I had started another relationship but we have both been in long term relationships so has its ups and downs and demonds of the past ! He's looking after me but we don't know where it's going or what's happening ! It's not the easiest when you havnt known someone very long and you are still out to impress ! Hot flushes and sweaty body doesn't impress !  I havnt even started in the tablets yet and already been suffering from hot flushes / panic attacks ! It's very hard stopping in someone else's bed waking up in the middle of the night wet through ! I've been washing and drying sheets in same day hoping it's not being noticed ! But he's admitted he has !  I'm not sure I'm going to be able to cope with what's coming ! ",
      "MessageIndex": 15,
      "PostDate": "11/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119481/not-pink-and-fluffy-returns",
      "Title": "NOT Pink and Fluffy! RETURNS...."
    }
  ]
}