{
  "AuthorID": "clh1973",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
  "Posts": [
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "Hi Pat, I had the same surgery as you and I think you're doing amazing to even be back at work yet. My surgery was October last year and I still have uncomfortable days, though not bad enough to cause me any real problems. I cant really remember exactly how long it took me to be feeling better but it was definitely more than a month, probably more like 2 months. I cant say I was in pain particularly but I got a lot of weird sensations in my new boob because the LD flap kept contracting when it shouldn't. Still does it a bit now but did it loads at the time and was really quite unpleasant. Also got a lot of aching around my back scar and shoulder blades if I stood or walked for too long. Unfortunately it's just another case of being patient I'm afraid.  Good luck x  ",
      "MessageIndex": 2,
      "PostDate": "29/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50288/how-long-of-a-recovery-time-from-op",
      "Title": "How long of a recovery time from op ????"
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "Yes, I had all of the above but it will improve. I definitely agree with Kirsty about the exercises. I started my radiotherapy about 6/7 weeks after surgery (I had my chemo before the op) and unfortunately my movement was still really quite limited so I struggled to get my arm into the position required. It did not appreciate being forced into that position every day for 3 weeks and I ended up with a frozen shoulder so I would definitely reccomend the exercises. You really need to get it moving before the radiotherapy. I'm still having physio but getting there. I had a lot of discomfort in my back but I was advised to get my lovely man to massage the scar on my back which he did a couple of times a week and it really helped. I was generally really pleased with the appearance of my surgery. Just had one area on the scar that stuck out and was a bit unsightly but that improved loads with the massage- can't see it now. I was also very swollen around my back for a good while afterwards so don't worry too much about the appearance coz you're still early days. Still time for it to improve. What's next then? Chemo? When do you start?",
      "MessageIndex": 9,
      "PostDate": "31/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50288/how-long-of-a-recovery-time-from-op",
      "Title": "How long of a recovery time from op ????"
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "I had a port put in without sedation. It was ok. Not very pleasant but not painful, just a lot of pushing and shoving! Was still glad I'd not had the sedation although have to say I still didn't drive home, my dad gave me a lift! Good Luck x",
      "MessageIndex": 3,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55895/ports",
      "Title": "Ports"
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "Hi, I developed a seroma after my surgery. It wasn't painful just uncomfortable. Struggled to get comfy as couldn't lean back on it. BC nurse said could drain if wanted but would only refill and better to leave it unless gets really painful. I left it and mine gradually disappeared over a couple of weeks. Good luck with yours x",
      "MessageIndex": 4,
      "PostDate": "27/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51089/share-your-experience-with-a-seronoma",
      "Title": "Share your experience with a seronoma"
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "Hi, I had my nipple reconstruction done 3 weeks ago. Had full dressing on for 3 weeks. Had it removed yesterday. I've been told I can treat it as normal now and lie on it and stuff. Obviously you have to follow what your consultant advises but shouldn't be too much longer now. Regards x",
      "MessageIndex": 3,
      "PostDate": "24/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54470/nipple-reconstruction",
      "Title": "Nipple Reconstruction"
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "Hi, I had implant and with LD flap and I can feel all the edges of the implant. Mine still feels tight and tender and it's now 8 months since surgery. Don't get me wrong, it's not sore as such but I'm just very aware of it all the time whereas ordinarily you wouldn't be.  Doesn't bother me but was wondering if it would ever wear off. Very pleased with the look though and just to let you know Mary, I had radiotherapy post surgery and it hasn't altered mine at all so far. I know I could still develop contractures but been very positive so far so you never know, you might be 'lucky'. x",
      "MessageIndex": 3,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50700/implant-question",
      "Title": "implant question"
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "Hi Bella, I'm 39 ( was 38 when I had op) and was also fit, running twice a week and zumbaing once a week. I had the op you are having. I really agonised over which surgery to have but once I finally made the decision I have never doubted it or regretted it. I was in hospital for 5 days. I had 5 drains which were all out before I left hospital. Catheter came out really soon after surgery but can't remember when exactly. I had morphine drip which controlled pain well. I did develop a seroma after which was left untreated and gradually dissipated over 2/3 weeks. I also got an awful lot of tightening that I hadn't expected. The LD flap continues to act like a back muscle initially so every time I moved my new boob contracted!! It didn't hurt but was really weird and quite unpleasant, though not really sure why! However it gradually did it less and less. Still happens occasionally, usually if I'm really cold and shivering or if I'm putting loads of weight through my arm but doesn't bother me now I'm used to it. I had all my lymph nodes and developed cording and a frozen shoulder about 4/5 weeks after surgery which slowed my recovery down but was still worth it. It's now 14 months since I had my op. I had my nipple reconstructed in October and am having my tattoo done in January and as long as that goes ok I'd say they've done a great job. I'm really pleased with the outome. I'm hoping I never have to go through it again but if I had to I'd make the same decision. Good luck with your op. Hope all goes well and your recovery is smooth. Regards  ",
      "MessageIndex": 7,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55880/mastectomy-and-immediate-ld-flap-reconstruction",
      "Title": "Mastectomy and immediate LD flap reconstruction."
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "I've been on tamoxifen for nearly 18 months, am premenopausal. My first packet happened to be wockhardt and my oncologist said if I find one that doesn't give side effects stick with it so I just take the empty packet and say I only want it making up if they have this brand. So far every chemist but 1 has had it and have used lots of different ones. I didn't have side effects. Just had 2 occasions when felt nauseous for a few days so stoppeed the tamoxifen for a few days and then went back to it with no problems. Think I may be menopausal now, aged 39 as periods have disappeared. I chose to go dairy free when I was diagnosed so I have lots of Soya products and I've noticed I start to get hot flushes in the night if I've been away from home and not had my usual soya intake. As soon as I go back to it they settle again. Might be coincidence but might help someone! good luck x",
      "MessageIndex": 15,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51970/has-anyone-had-any-possive-experiences-with-tamoxifen-am-due-to-start-taking-it-and-am-absolutely-petrified-the-thought-of-taking-that-drug-hsas-scare-me-more-than-the-cancer-itself-any-possitive-feedback-would-be-much-apprec",
      "Title": "has anyone had any possive experiences with Tamoxifen????? Am due..."
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "I had mastectomy with immediate reconstruction using LD flap and implant and full axillary clearance. I went in 7.00 on a Friday morning, had my surgery that day and went home on the Tuesday. It was quite daunting going home so soon but managed ok, with lots of help. Managed to get all my drains out before I went home too. I have to say I didn't find it too traumatic. I don't want to trivialise it all but just wanted to say for others reading this awaiting surgery. For me having the immediate reconstruction was great and I've not had any issues with my new boob at all. I know I'm one of the 'lucky' ones and in the minority but if you're lucky enough to get an immediate reconstruction they do get some cracking results. Just awaiting new nipple now!! ",
      "MessageIndex": 7,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50454/hospital-stay",
      "Title": "Hospital Stay"
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "Hi Annabel, In my area they offered free complementary therapies at the hospital and hospice. I went for a massage on my good weeks in between chemo and felt much better for it. It might not be available in your area but worth an ask perhaps? I also had counselling after my treatment finished as thats when I started to struggle emotionally and I found it really helpful. I cried for the whole hour the first time but it's amazing how much difference it can make by being able to talk about whatever you want without worrying about offending/upsetting anyone. I'm coping much better now although I only have 1 child who is 15 now so don't think I'm being tested as much as you!!! Hope you find the counselling useful. Thinking of you x",
      "MessageIndex": 3,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50706/complementary-therapies-relaxtion",
      "Title": "Complementary therapies/relaxtion"
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "HI Caryn, I had mastectomy and axillary clearance and reconstruction after chemo. I had my surgery nearly 8 weeks after my last chemo. They said to me they leave a minimum of 6 weeks between end of chemo and surgery and then depends on bloods. I didn't have any problem with my blood counts coming back up so thankfully no delay other than waiting for a theatre slot! Best wishes",
      "MessageIndex": 3,
      "PostDate": "31/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50327/how-long-after-chemo-will-i-have-to-wait-for-axillary-lymph-node-removal",
      "Title": "How long after chemo will I have to wait for axillary lymph node removal..."
    },
    {
      "AuthorID": "clh1973",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clh1973",
      "Content": "I got mine from M&S (per una section, only 1 style, quite pricey) and primark-not very stylish but cheap and did the job. Also popular with other hospital patients-nurses kept commenting how many people had them!! However I had my op in October so it is a while since I got them. I would also say the primark ones are a smaller fit so I needed a size bigger than normal so I could get my arm in. Good luck x ",
      "MessageIndex": 4,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50509/pyjamas",
      "Title": "pyjamas"
    }
  ]
}