{
  "AuthorID": "cloverleaf",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cloverleaf",
  "Posts": [{
    "AuthorID": "cloverleaf",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cloverleaf",
    "Content": "Hi. I had my 6th (and last) dose of FEC a week ago. Like me, you have so far found the side effects not too bad. Personally, I found that the first 3 were OK and I coped with mild hangover-type feelings but was not too tired. After that I gradually got a bit more tired and the side effects were slightly stronger. However I have continued to work part-time. After my 2nd FEC, I noticed the veins in my treatment hand becoming sore, hardening a bit, and changing colour. Apparently this is not uncommon. The nurses decided to give me a PICC line - a catheter in my arm which stays in place until chemo is finished. This made evrything simpler and prevented my veins from getting any worse. My hair gradually started to fall out just after the 2nd chemo and is very thin and baby-fluff-like now.  I found that the steroids that I was given affected me and made me feel a bit spaced out and 'buzzy' - that's the only way to describe it, and I had to have my dose reduced and not take any after 2pm, as I was having trouble sleeping thanks to their effects. For the last few weeks I also have had indigestion and anything slightly spicy tastes extremely hot. My hearing was also affected since the last 2 doses - got a buzzing / humming in one ear but that has just disappeared now and am back to normal ( whatever normal is). I was not bothered by my hair falling out, and I decided to shave it off before it fell out itself. I think that helped me feel a bit more in control though. Each time about day 3 or 4 after chemo, I felt emotional and weepy. Not sure if this was the steroids or the chemo, but once I realised it was a pattern and I knew that I would feel better in a day or 2 then I coped fine. My periods stopped completely except for one massive period between cycle 2 and 3, which worried me at the time, but again is something that is quite common I was told.  i hope you can keep your life as normal as possible and that your side-effects are mild. Good luck.",
    "MessageIndex": 5,
    "PostDate": "25/10/2009",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/21812/fec-chemo-and-side-effects",
    "Title": "FEC Chemo and side effects."
  }]
}