{
  "AuthorID": "clover3",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
  "Posts": [
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "Hi, everyone i'm new to this. Writing this on my sisters behalf who was diagnosed with breast cancer back in May, because she as an active her2 she is receiving chemo before surgery and radiotherapy. The chemo she is having is FEC-T which is in two parts each part has three cycles. Tomorrow is her last one of part one, part two starts in three weeks. We have a long way to go. The reason I am sending this post is although we have other sisters and brothers, they have made it quite clear that they don't want to know (they did the same with me when I had cancer three yrs back) and she is divorced, so my point is that it's just us two, and I am struggling to keep her sprits up and to keep her thinking positive,  I think she needs words of encouragement etc from somebody other than me.  Can anyone help please.   All positive message will be gratefully received. Thank you in anticipation. ",
      "MessageIndex": 0,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    },
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "Hi Dreamthief, Thank you so much for your quick reply.   It's actually helped me as well,  so I know it will give her a much needed boost when she reads it.  Did J have a mastectomy as well? and if so, how long in time did the whole treatment take?  were hoping to go away for Christmas.   Hope both you and your wife continue to have good health,  K",
      "MessageIndex": 2,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    },
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "Hi Jo, .Thanks for reply. She having her last one of part one tomorrow.  Part 2 starts in 3 weeks and  that's 3x3 so it will finish around late Sept early Oct. We haven't got a surgery date yet, and after that she needs Rad No were not going abroad were staying in the UK.  We do have doubts on the possibility of us getting away, but it's nice to dream isn't it? Will take your advice about mentioning it to her oncologist it might help so thanks, and yes I will get her to join this. Thanks and best wishes  K",
      "MessageIndex": 8,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    },
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "Hi, we have 2 more sister's and 2 brother's who haven't acknowledged the diagnosis either, they didn't with me when I had cancer 3 yrs ago (mine was in my neck) I think they must have thought I said I had leprosy, because they have been no where near me since.  I am the same as you, very grateful to the people that did care (even some people I hardly knew) and I agree you do come out of it a lot stronger, Just like I know my sister will, because I will make that sure she does. All the messages will give her a much needed lift. Thanks for support and hope you continue to have good health. K",
      "MessageIndex": 22,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    },
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "Hi Rainbow Debs Here's a coincidence, my sister favourite song is Rainbow by Marmalade (1960's)  Sorry to hear you had a bad time and hope things are good for you now, and thanks for your support.  I only joined yesterday and the response has been brilliant, my sister will get to read all messages later today, and I know she will be touched by peoples kindness and hopefully like you it will make her stronger. Well done on becoming a patient ambassador. K x",
      "MessageIndex": 24,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    },
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "Hi prettyfedup Thanks for reply, Pleased that your friend is enjoying her life, I sure and I hope my sister will be doing the same in the near future.",
      "MessageIndex": 9,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    },
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "Hi Jo, As things  stand at the moment she defiantly having a mastectomy after Chemo. There are 2 lumps in the breast and also there are cancer cells in the lymph nodes. She has decided not to have reconstruction. At the present she is responding well to treatment.  We saw the oncologist yesterday, after examining her he told us that there was some shrinkage, which is very reassuring, as she has only had 2 cycles of chemo as yet.  Glad that you finally got your holiday, and if we have to wait till next year it's not the end of the world is it? Thanks for great sister comment ( oh am I going to make sure she reads that, time after time after  ......) K x",
      "MessageIndex": 11,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    },
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "HI I feel quite over whelmed with all the positive response's I've received, a big thank you to each and every one of you. She will get to read all of the messages later today and I know she will be as touched as I am.  She has her last of  part one fec today, and her first T will start in 3 weeks, which I know she is dreading, but after reading these messages, she will get strength from them, like you have said were all tougher than we think. Good luck with your treatment as well. K x",
      "MessageIndex": 21,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    },
    {
      "AuthorID": "clover3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/clover3",
      "Content": "Hi Dreamthief, My sister's is also on the left.  The hospital she goes to does both the pump and injection, but we don't know which one she's having yet, were not even sure on how they decide which one is most suitable, but time will tell. Haven't checked Chemo Club discussion as I didn't know about it, but now I do I will have a look. Hope your lawn takes a turn for the better. Thanks  K",
      "MessageIndex": 6,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135013/my-sister-needs-postive-messages-from-people-who-are-in-the-same-boat",
      "Title": "My sister. needs postive messages from people who are in the same..."
    }
  ]
}