{
  "AuthorID": "Coastal-lady",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
  "Posts": [
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "That's great news Jo ! So pleased for you ( apart from the admin hiccup!) do be kind to yourself during this recuperation period ... and as LondonLass says .. try to make a start on the exercises when you can, they made me feel like I was doing something positive to help get over my operation !  Onwards and upwards x",
      "MessageIndex": 4,
      "PostDate": "19/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127222/surgery-yesterday",
      "Title": "Surgery yesterday"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi AndyLou.. might be worth checking with your BCN before heading out to buy one ... my hospital policy was to give the soft cotton bags out for free when you got to the ward ...  Good Luck ! ",
      "MessageIndex": 8,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127108/mastectomy-on-wednesday-any-advice-tips",
      "Title": "Mastectomy on wednesday..any advice/tips?"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi everyone  Quick q if I may. I was diagnosed with stage 2 lobular BC in my left Breast last November. Since then I've had a mx (no lymph node involvement) & immediate recon, gave Chemo a swerve and went straight to 15 sessions of rads. I've been taking Anastrozole for the last 3 and a half months. I started with Accord brand but experienced sever joint pain - to the point where I could barely hold a pen & my 89 year old mother was getting out of a chair quicker thank I was. I also experienced severe rib pain. I switched to arimidex and the symptoms were much reduced. But last weekend the rib pain started again but this time on my RIGHT side. It's now v severe. And again I'm having problems getting out of a chair ( should I change my chairs ?!!) I'm pretty sure it's the ARIMIDEX but it is super painful & of course my normally subjective Brain has started to go into overdrive.I've started my phased return, but am now dreading long car journeys etc as I understand the OCCH Doc is quite unsympathetic. Anyway this is a long bc winded way of asking if anyone else has experienced the stabbing rib pain on ny version of Anastrozole plse ? I've been told repeatedly that I no longer have any cancer left after they removed my tumour- but with this pain, I'm imaging the worst ! Thanks for your help in advance.  ",
      "MessageIndex": 0,
      "PostDate": "20/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129171/rib-pain---arimidex",
      "Title": "Rib Pain - Arimidex"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi AndyLou.. I had mine just before Xmas.  I agree with Maxine.. also suggest front fastening bras too - I bought a couple from Amazon .. they were easier to do up initially, when arm movement is a bit limited.  I also bought a couple of blouses/shirts to button up the front - I normally wear t shirt type tops and they would have defeated me in the first few days! I also borrowed a couple of my husbands shirts to ring the changes. Cardigans are great too. I was given my little cotton bag for the drains. I also took in front fastening night shirt for the hospital stay. I also borrowed a travel kettle for the first few weeks .. we have a heavy kettle normally and when no one was at home I couldn't lift that to make a cuppa - it was invaluable when everyone went back to work or college and couldn't be my willing slave !  If you have access to an A frame pillow too .. that might help sleeping at night - i found sleeping on my back tricky and this helped me feel supported & less vulnerable.  Good luck for Wednesday ... I was very relieved to have it over when mine was done ... although it wasn't the Xmas present I'd really wanted, it's all healed now !  Oh one final thought - so try and do the arm exercises they give you.  They maybe tricky at first but pay dividends in the end.",
      "MessageIndex": 2,
      "PostDate": "17/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127108/mastectomy-on-wednesday-any-advice-tips",
      "Title": "Mastectomy on wednesday..any advice/tips?"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi everyone, thanks very much for your kind thoughts. I did reply yesterday but it doesn't seem to have posted !  As suggested, I have now called my lovely BCN whose advised getting it checked out so seeing the GP today. I checked back through my Anastrozole diary ( does this make me sad?) & almost 3 weeks after taking the Accord brand the rib pain started on my left side ... so I do wonder if it's that as I'm now 3 weeks into Arimidex. I'm v reluctant to get rid of that as although I still have aches and pains but apart from the rib pain, I can live with that. Although if they could get rid of the fatigue and hot flushes I'd be thinking I could cope with my new normal ! It's just v strange it's on the RIGHT side - so not treated by surgery or rads !  Thanks for the suggestion re magnesium and calcium etc ... I'm not currently taking any supplements as still waiting for a bone density scan. But I'll talk to GP about yst too As I'm so knackered anyway I wonder if I need Vit D as a help ... I'll update later. I really do apprwish coate your rhoughts.  ",
      "MessageIndex": 5,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129171/rib-pain---arimidex",
      "Title": "Rib Pain - Arimidex"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "So the GP thinks it's the Arimidex as my body settles into its new regime. I'll watch it like a hawk but hope the aches and pains do settle.  My GP wouldn't discuss any supplements until I have had a bone scan - which I get.  But to be ready to hit this hard when I have had it next month, I'd also be grateful for the details of the supplements mentioned plse !  Thanks again for everyone's replies. So kind of you to take the time. Onwards and upwards ! ",
      "MessageIndex": 7,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129171/rib-pain---arimidex",
      "Title": "Rib Pain - Arimidex"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Thank you ! ",
      "MessageIndex": 10,
      "PostDate": "23/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129171/rib-pain---arimidex",
      "Title": "Rib Pain - Arimidex"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi all, I had a mastectomy in Monday. Went as well as these things do until 2 drains came out yesterday. Up until then I hadn't had excessive pain, luckily, but now searing pain under my arm and round the back. I don't seem to have the same arm movement now either. Wondering if this is nerve reaction that will settle ? Feeling quite fed up about it really - any thoughts gratefully received  Thanks  Sarah ",
      "MessageIndex": 0,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120207/post-drain-pain",
      "Title": "Post Drain Pain"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Thanks for replying  .. Was debating doing that in a bit ... Was doing so well - too well probably. I just wasnt expecting this bit.  Thanks for taking timeout to help .. Really appreciate that. Will update later  Xx",
      "MessageIndex": 3,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120207/post-drain-pain",
      "Title": "Post Drain Pain"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi Helen, I spoke to one of the nursing team and they suggested it was reaction to drains being removed. I rested and took more painkillers and by yesterday morning things had eased, and continue today. I can now do exercises again and am trying to do as much as possible. So fingers crossed it was just reaction. Don't have the cording sensation you describe yet - but thanks for replying as that's now got it in my radar. Thanks for sharing your thoughts .. Hope you had a peaceful Xmas  Sarah xx",
      "MessageIndex": 5,
      "PostDate": "26/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120207/post-drain-pain",
      "Title": "Post Drain Pain"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi Rachel, I had a skin sparing mastectomy just before Xmas. I had one sentinel node removed & a reconstruction at the same time. Your bag list sounds about right .. I took some starbursts in too ! It was SO hot they gave me a small fan to have on my new side table to keep me cool - it was a lifesaver !! I had drains for a few days, and was given a cotton bag to carry them around in. I was concerned about dealing with them before I went in, but it was all very straightforward & I shouldn't have worried ! I didn't have any bras given to me, I took in a couple of front fasteners, and front fastening Jammies. I was allowed back driving after 6 weeks (I live in a rural area too, so this was a challenge - thank heavens for friends) , I was recommended not to lift anything heavier than a 2lb bag of sugar and no housework for 3 months.  I'll be honest with you, I found the enforced sitting down and healing very frustrating as I'm used to dashing about & multitaking. But I also didn't want the implant to swivel round and be left with a new boob at a jaunty angle while at the healing stage - so unusually for me I followed the advice to the letter. I, too, was told to keep up with the painkillers .. I had paracetamol (and codeine for a short time). I tried to do gentle walks as often as I could - but some days , the sofa & catch-up TV was the preferred option ( concentrating on books was tricky for a bit - so short articles and puzzles it was !)  !  Hope that's some help ... Good Luck !  All best wishes  Sarah ",
      "MessageIndex": 4,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124908/pre-mastectomy-and-implant-recon-nerves",
      "Title": "Pre-mastectomy and implant recon nerves"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "hi Ossy, plse don't feel ashamed .. you've had major surgery, you've had a huge shock .. and the reality may probably only just be setting in.i too go through phases of weeping, wailing and gnashing my teeth & I'm 6 months down the road since my mastectomy. I've had radiotherapy but feel guilty about feeling so down, when I know others have so much to cope with. But we all do things differently. We all have our own cancer, our own fears and demons. We've all had a brush with something we'd rather not have had to face. I'm on hormone treatment now for 5 yrs and some of my ups and downs I can put down to that, but a lot of it is the shock settling now active treatment has finished. Everyone is expecting me to go back to normal, but every time I look in the mirror I know it can never go back to how it was. And I find that hard.  So plse don't be ashamed. I have plucked up the courage to have a few sessions of counselling.  I think it's helping ... I'm reluctant to go down the anti depressant route .. but if i don't settle soon I may do that for a while. You may not want any of that at all - a coffee & chat with others who 'get it' might be exactly what YOU need.   Everyone's different. Plse find something that works for you... but above all plse don't feel ashamed. X ",
      "MessageIndex": 3,
      "PostDate": "12/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131657/just-feel-like-crying-all-the-time",
      "Title": "Just feel like crying all the time"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Ooh one other thing I meant to say, I found a travel kettle really useful too. I was on my own during the day when others left for work or Uni .. and we have the heaviest kettle - I discovered on the first day ! A travel kettle and a jug to fill it with did the trick & meant I could make my own cups of tea. A small sign of independence but it made a real difference ! Good luck x",
      "MessageIndex": 9,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124908/pre-mastectomy-and-implant-recon-nerves",
      "Title": "Pre-mastectomy and implant recon nerves"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Mine too on anastrozole (Accord)  !! Creaky knees & elbows ... sore ribs post radiotherapy.. sore calves... headaches .. lethargy oh and poor sleep ! I'm trying to ignore the weight gain ! Really hoping it settles soon .. 6 weeks in and pretty fed up with feeling like an old woman ! Due back to work soon and dreading it ... really not sure I'll cope without needing a granny nap in the middle of the day ! Someone plse tell me it gets easier .... ",
      "MessageIndex": 17,
      "PostDate": "04/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126196/aches-and-pains-still",
      "Title": "Aches and pains ....... still!!!"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi Pootlecav I do feel for you ... it's absolutely exhausting ... I was in a real state. I do hope you get some clarity soon ... I was just the same as you - interms of being a borderline case. I just couldn't make up my mind .. at 5 in the morning I'd decide to have chemo .. by 7am the same day I'd decided to give it a swerve. I felt chemo was such a big step, not to be undertaken lightly ... but I really didn't want it if I REALLY didn't have to, but was wracked with the thought of this awful disease coming back because I'd turned down a treatment option. . I have the utmost respect for anyone going through it .. if I'd have to have it, I would definitely have done so but being on the edge is a really terrifying place to be too. This probably hasn't been much help, but I just wanted you to know I'm thinking of you. Good Luck and if you feel able to, let us know what you end up deciding to do. Lots of love xxxx ",
      "MessageIndex": 24,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126323/help-oncotype-result-advice-please-x",
      "Title": "Help Oncotype result!! Advice please x"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "I had the oncotype test and went all round the houses trying to decide what to do if I came back in the middle ranking. It was a long two week wait - really messed with my head. I was told pre onco type testing that chemo could give me around 2% benefit. But I was very nervous about saying yes to it (i felt it wasn't something to enter into lightly) ... but I was equally nervous saying no. I was coming down on the side of saying yes to chemo toward the end of my deliberations, but ultimately, I was lucky that my results came back indicting I would have less than 1% benefit .. so the negatives outweighed any possible positives. It gave me the confidence to say no to chemo ( although I do have the occasional worry I may have made the wrong decision). I ended up with Rads after my mastectomy & am now on anastrozole.   I don't think this post is probably any help at all, but I just wanted to say I completely 'get' your dilemma and am thinking of you.  It's such a personal decision and whatever you decide will be right for you. Good Luck, whatever you decide. X",
      "MessageIndex": 4,
      "PostDate": "04/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126323/help-oncotype-result-advice-please-x",
      "Title": "Help Oncotype result!! Advice please x"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Good Luck to you both. I had my mastectomy just before Xmas ... now all healed and gradually  returning to the 'new' normal. Thinking of you both Xx ",
      "MessageIndex": 15,
      "PostDate": "17/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127032/panic-setting-in-before-operation",
      "Title": "Panic setting in before operation"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Hi all  Am on Arimidex, have been for about 15 months .. wondering if Turmeric/Curcumin capsules might help with the many, and sometimes severe, joint aches & pains .. (am reluctant to change to Tamoxifen as recently suggested by Onc as feel my body as been through quite a lot already) So for the time being I’m sticking with Anastrozole (Arimidex) but thought supplementing might help .. I’ve read a lot about Turmeric /Curcumin but am confused as SOME articles seem to suggest it can sometimes mimic estrogen (and my cancer seemed to love that!) but others suggest it doesn’t, and in any case the benefits to joint aches and overall well-being outweigh that .. I’ve read the NHS material and CRUK - and the jury seems to be out there too .. I’d love to hear this community’s views ..before deciding what to do .. my oncologist is v uncertain too .. he’s all about the science, but is willing to listen and think outside conventional treatment areas - this time his slight reservation is about the possible estrogen mimicry & has suggested looking into it further ..   Any thoughts (other ideas) gratefully received ..",
      "MessageIndex": 0,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160095/anastrozole-turmeric-curcumin",
      "Title": "Anastrozole & Turmeric/Curcumin"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Thanks Rachel, I appreciate your reply .. I might ring on Monday ..  i was thinking of taking it ( & or other supps) to try and offset the aches and pains .. I appreciate it won’t take the place of Arundex .. but might help with the side effects .. thanks very much for the pointers",
      "MessageIndex": 2,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160095/anastrozole-turmeric-curcumin",
      "Title": "Anastrozole & Turmeric/Curcumin"
    },
    {
      "AuthorID": "Coastal-lady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coastal_2d00_lady",
      "Content": "Whoops .. I do of course mean, Arimidex ! ",
      "MessageIndex": 3,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160095/anastrozole-turmeric-curcumin",
      "Title": "Anastrozole & Turmeric/Curcumin"
    }
  ]
}