{
  "AuthorID": "Cocopops1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
  "Posts": [
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "I had my first Fec-T on the 13th (unlucky for you cancer!)  Oncology told me that I would need to get any sick notes from my GP.   I called my Gp's office today to explain that I needed a sick note from the 13th until tommorrow as I'm feeling better and hoping to go back to work tommorrow.  They have my notes from oncology so they know when I had chemo etc.  I asked if my daughter could collect the sick note later today as the last place a want to be is in the docs with sick people while my ammune system is at its lowest.  Our hospital is currently on red alert and doctors are full of people with flu.  They just called back to say I have to come in and be seen by the doctor if I want a sick note!  I am so mad!! Told them so let me get this straight- you want me to come to the doctors while the hospital is on red alert and we have a flu issue in the island while I'm on chemotherapy and at my most subseptable to infection???  Wtf?   So angry right now - we are nearly out of beds at the hospital due to flu.   Called my bcn and asked her if she can get my surgeon to give me a sick note instead - hopefully he will be a lot more understanding ",
      "MessageIndex": 0,
      "PostDate": "21/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120044/angry-over-sick-note",
      "Title": "Angry over sick note"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "The receptionist was lovely she totally understood- it was my dr that refused and the poor receptionist had to call me back My bcn just called me to say she's got me one!  She even offered to bring it to me if my daughter couldn't collect it!   We don't have the NHS as such as I live in the Channel Islands - we have social security ",
      "MessageIndex": 4,
      "PostDate": "21/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120044/angry-over-sick-note",
      "Title": "Angry over sick note"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "I have been invited to one on the 4th April !  So excited as I have been waiting since December but they didn't have any over here for the last 6 months but now are being run my Macmillan",
      "MessageIndex": 9,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125836/look-good-feel-better-courses",
      "Title": "Look Good Feel Better courses"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "On my fathers side My grandfather had prostrate cancer and my grandmother had uterus cancer so maybe that's why.  on my mums side my Nan died at 60 of lymphoma, uncle had bowel and bladder cancer at 49 and my mum had skin cancer at 58 ",
      "MessageIndex": 3,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121309/genetics",
      "Title": "Genetics"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "I've had my second fec t so radiotherapy would be until May x ",
      "MessageIndex": 4,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121309/genetics",
      "Title": "Genetics"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Had my Genetic telephone counselling session yesterday - really wasn't what I was expecting!  I thought it was the lynch syndrome that they think caused my uncles cancer that we were going to be talking about.  We went though my family tree and who had which cancer (only me with BC)  I was then offered brca1/2 testing - was kind of a shock as my surgeon never said anything about brca when I asked if I could give this to my daughter- he said she had the same chance of getting bc as the rest of the population so I just presumed that was ok then.  Seems there's a higher chance of having a brca mutation with triple negative which I have.  Although the chances are still low.   So I'm going to be tested and if it's positive we are talking double mastectomy and hysterectomy to reduce the risk being offered.  Wtf???  On the plus side I have plenty of belly to make into boobs if it comes to it!!  Although I don't want to have brca fault part of me thinks is it better to have it then just chop off the boobs and hysterectomy then I will know the BC is gone for good or greatly reduced?   That probably sounds stupid but if I do have it then I would need to decide what to do before radiotherapy as mx after radiotherapy is more difficult apparently.  Umm I kinda like my boobs !!  Feeling confused  Test is just a bloods and results would be in April ",
      "MessageIndex": 0,
      "PostDate": "13/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121309/genetics",
      "Title": "Genetics"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "hi everyone  After an agonising 10 week wait I now have my BRCA results back!  NEGATIVE!!!!! Yippee  No more surgery and knowing that my daughter won't inherit this is so fantastic!!!  So now just 5 weekly paxiltaxol chemos left followed by 4 weeks of radiotherapy in the UK as we haven't got a radiotherapy dept in the Channel Islands. I can see the light at the end of the tunnel!!  Radiotherapy is gonna be hard as I will be away from my other half and my doggies but on the plus side I can stay with a relative in the uk and my mum will fly over to visit me.   Does anyone have private medical insurance and do they provide any sort of cover for relatives looking after you, for like travel to and from the hospital everyday, hospital parking and board ?  ",
      "MessageIndex": 0,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125929/brca-test-results",
      "Title": "BRCA test results"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Thinking of you JMC04 xx  If it's any consolation my BCN / surgeon will never give out results over the phone. I always get called in and the last time I got called in a few weeks ago after my scans I was terrified but it was good news not bad xx ",
      "MessageIndex": 21,
      "PostDate": "18/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118287/i-need-help-please",
      "Title": "I need help please."
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Hi Jojo  Following as I have been referred for genetic testing too.  I have a phone appointment next week first.   We have no Brest cancer in the family history but my uncle has lynch syndrome and had bowel  cancer spread to his bladder in his forties but after 50/50 chance of coming out the op he has been in remission for over 5 years.   My grandmother on the same side had lymphoma in her 50's and passed away in her sixties (just before my 21st birthday)  My mum has had skin cancer but caught early.   We all get screened for bowel cancer every 5 years due to the lynch syndrome as it increases the risks of most cancers but we have never been offered proper testing which my oncologist wasn't happy about so hopefully this will give us some answers as bowel screening every 5 years would not be enough anyway.   Xx",
      "MessageIndex": 16,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120880/genetics-testing",
      "Title": "Genetics testing"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Thanks all  Been in hospital today on a drip and had more anti sickness- feeling better Think it's the antibiotics mixed with my citalapram that's making me feel so bad as according to google you should never mix ciprofloxacin with citalapram!   Everytime I have taken my antibiotics I have felt so horrendous so told the oncologist and he has agreed I can stop them to see if that's the issue.  He's also given me some different anti sickness.   I couldn't even explain to him how I was feeling this morning but I never want to feel so completely disconnected, weird, sick etc again  Anyway back home again now xx    ",
      "MessageIndex": 7,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121144/fec-cycle-2-feeling-terrible-sorry",
      "Title": "Fec cycle 2 feeling terrible (sorry)"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Hi all  I had my second Fec on the 4th Jan and the first 3 days were ok.  Since then I have felt terrible and only just managed to log on here today as I felt so bad.  I've felt sick, tired, totally disconnected from the world and myself, depressed, nothing makes sence, everything tastes and smells gross, can't concentrate, feel like my brain has been taken over and doesn't work anymore, jittery, can't focus on anything , I just want it to stop now.  Knowing I have still another Fec to go is scaring me.  I don't know if it's messing with my antidepressants but I don't think I can do another one. Please tell me the \"t\" part won't be like this  ",
      "MessageIndex": 0,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121144/fec-cycle-2-feeling-terrible-sorry",
      "Title": "Fec cycle 2 feeling terrible (sorry)"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Hi everyone  just popping in to say hi and to wish you all well and hope you all have the least possible side effects!  I had my 8th weekly \"t\" today - only 4 more to go!  Still working everyday even go to work before chemotherapy!  I find if I stay at home I just sleep and think about cancer do working is like an escape and keeps me going!  It is tiring though.  Had my look good feel better  night last night and really enjoyed it!  met some amazing people and got some amazing products and even wore make up to work today as normally I can't be arsed lol .  Had some lovely comments too!  Anyway i was thinking can we have a monthly radiotherapy club too? I find the chemo one really helpful but I'm not so sure what to expect with radiotherapy and it would be nice to speak to others going through it at the same time .  I am expecting mine to start late May for 4 weeks xx ",
      "MessageIndex": 30,
      "PostDate": "05/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126095/april-breast-cancer-chemo-club",
      "Title": "* * * APRIL Breast cancer chemo club ****"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "We will definitely have to start the RT Monthy club then as there's lots of us doing radiotherapy in May! ",
      "MessageIndex": 35,
      "PostDate": "06/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126095/april-breast-cancer-chemo-club",
      "Title": "* * * APRIL Breast cancer chemo club ****"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Hi thank you both for answering it does really help.   Yesterday day 2 I noticed my face was flushed but today I look like a tomato!  I have taken some piriton as I read that the red face is a mild allergic reaction.  My temp is normal but I'm sitting here under 2 dovet covers as I feel cold.  Did anyone else get red face?? Xx ",
      "MessageIndex": 4,
      "PostDate": "17/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123431/weekly-paciltaxel",
      "Title": "Weekly Paciltaxel"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Thanks everyone xx  I was expecting to have no side effects however I have been feeling a bit nauseous (no where near as bad as when on fec) and I've been really tired and achy.  Also had mega red tomato face and chest on day 3 and 4.   I don't know if I'm tired from the T or if I over did it working full time for 10 days before I had my first T?  I am hoping to be able to continue working through T maybe on day 2 (steroid awake day) then day 6 and 7 but I'm thinking I will have to cut down and not work 8-5 as it's too much and my brain doesn't seem to work very well anymore.  It's so frustrating forgetting everything!!  Is anyone else working and how do you find it?  I even work the morning before chemo !  ",
      "MessageIndex": 8,
      "PostDate": "19/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123431/weekly-paciltaxel",
      "Title": "Weekly Paciltaxel"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Morning everyone  I had my first of 12 doses of  Paclitaxel yesterday and I'm feeling fine.  Just wondered on weekly when will any side effects kick in?  The chemo nurses say weekly is much more tolerable than 3 weekly and side effects minimal but I would love to know how others got on on it?   Thanks",
      "MessageIndex": 0,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123431/weekly-paciltaxel",
      "Title": "Weekly Paciltaxel"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Thank you Julia I'm so pleased you are cancer free x My doctor wrote to me about the blood test which he actually done looking for diabetes.  The letter just said that the blood test was fine but my gamma Gt was slight high (whatever that is) and it my be worth repeating the test in 3 to 6 months.  Didn't really take much notice of it until reading yesterday that BC can spread to the liver",
      "MessageIndex": 2,
      "PostDate": "01/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115727/scary-times-ahead",
      "Title": "Scary times ahead"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Hi everyone I'm new here. I made the stupid mistake of not going to the doctor as soon as I found a lump.  I was hoping it would disappear and now many months on I finally plucked up the courage to go to the doctors yesterday.  He found the lump no problem as its pretty big and has referred me as an urgent case to the Brest clinic.  So I asked him in his opinion what he thought is was, hopeing he would say it could be a cyst or something, but he was straight with me and said he thinks it is cancer.  Cancer!!! The word that just feels like a death scentance!  What if I have left it to late, what about my family, Why me??  Why am I so stupid??  What does this mean? Am I going to die?  Is this why I am always tired?  Is this why a routine blood test a couple of months ago came back with a slightly high reading of something in my liver?  Oh no has it already spread?  How do I tell my mum?  What if I get the call on Wednesday when we are going to my Nans fuernal?   So I'm gonna have a core biopsy? Ultrasound and mammogram - umm I don't do needles!!!!!! Scared  ",
      "MessageIndex": 0,
      "PostDate": "01/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115727/scary-times-ahead",
      "Title": "Scary times ahead"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Thank you everyone for your support!  I have had the call and the tests are scheduled for tomorrow afternoon.  It's going to be a hard day, specially as its my Nans funeral in the morning.  But I have to keep thinking that at least at this same time  tommorrow the tests and fuenaral will be over.  Trying to stay strong is hard x ",
      "MessageIndex": 13,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115727/scary-times-ahead",
      "Title": "Scary times ahead"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "I'm back - only had the ultrasound today.  The lump looks smaller than I thought as it's deep! It's only showing as about 2.5cm.  I have a mammogram and biopsy tommorrow and the results should be back by next Wednesday .  They will remove the lump whatever happens.  ",
      "MessageIndex": 17,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115727/scary-times-ahead",
      "Title": "Scary times ahead"
    },
    {
      "AuthorID": "Cocopops1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cocopops1",
      "Content": "Well the mammograms and biopsies are over!   They found 2 more lumps!  One was a cyst that has now been drained.  The original one has been biopsied and looks like cancer (3 docs have said that now) and the other looked like a cyst but couldn't be drained so may not be a cyst after all, but on the good side that one is small.  They have stuck markers in two of them do now it's back to waiting.  I am feeling a bit more optimistic after the initial shock of them finding more!   Can't believe I was so scared of the needles- think I'm over my phobia after what felt like loads of needles today xx ",
      "MessageIndex": 20,
      "PostDate": "06/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115727/scary-times-ahead",
      "Title": "Scary times ahead"
    }
  ]
}