{
  "AuthorID": "coffeebean85",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
  "Posts": [
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Wow Netty that's a lot of biopsies!! I guess they might want to biopsy my left arm as I have a small lump there. They might not even want to do a biopsy at all, who knows.... Just can't wait til it's over! Feeling a bit better now, am cheering myself up watching tv and listening to cheery music!",
      "MessageIndex": 26,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "It's just a scan. The woman said that its a six week wait as its an underarm lump, not a breast lump. I have plenty to keep me busy at work, but my job is also quite stressful at times. Feeling a bit low tonight, I'm sure I'll perk up tomorrow. x",
      "MessageIndex": 34,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Hi Missklo, Thank you so much for your reply. I am definitely going to insist on a referral. The ache I am experiencnig isn't constant, but I do feel it at different points in the day everyday. I also experience the breast shooting pains at least once a day if not more. The good thing is that I have no visible breast lump, just an underarm one which the doctor is pretty sure is just a swollen node. While it hasn't got any bigger it hasn't gone away either, but I'm \"glad\" it has remained the same size. As I have previously mentioned, however, my mum didn't have a visible breast lump either. It was even missed by a GP. I can't believe you had to wait 7 weeks for your appointment. My mum had to wait 6 weeks for her lumpectomy due to various errors, we were all so annoyed. When you had your scan/mammogram, how long did you have to wait for the results? Wishing you a speedy recovery hun. x x",
      "MessageIndex": 9,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Hello all, Well my GP was lovely  at my appointment this evening. He said he thinks everything should be ok given I am 25 but due to family history and being  \"worried (he) might be missing something\" he has referred me to the breast clinic. As expected, it's a non urgent referral but I'm glad something is being done.",
      "MessageIndex": 10,
      "PostDate": "12/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Thanks Netty. Much to my surprise I got a letter through this morning asking me to book an appointment online. The referral has actually gone through as urgent even though the doc said it would be non urgent, so not quite sure what has happened there. I'm glad because it means I get an appointment sooner but the word urgent is a bit scary. Appointment is on Tues 25th January. What will happen when I get there? I have no palpable breast lump (not that I can feel anyway) but I do have a small lump under my arm, along with the ache and pain I have been experiencing. Thanks xx",
      "MessageIndex": 12,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Thanks Netty you're so helpful. How long will you be there for? I'm just wondering whether to ask for half a day or a whole day off work. I'm a teacher and we have a new system where we have to 'apply' for days off (I will definitely get time off, my school are great about medical appoinments) but not sure whether to take a half day or a whole day. When my mum had her tests done she was there for over 3 hours but not sure if this is normal?",
      "MessageIndex": 14,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Hi Mia, Thanks for your post. Sorry to hear your GP was so dismissive with you. Mine definitely woudln't have been very sympathetic had it not been for my strong family history of breast cancer. I do check my breasts and the tissue in the left one feels a bit more rigid than the right.  I also have an area of breast tissue on the left that is quite tender to touch. However, this could be totally normal. I find it really hard to check for lumps as my breasts feel pretty lumpy anyway. I don't experience cyclical changes as I am on the pill. The appointment is now tomorrow, not Tuesday as originally planned. I am feeling really nervous and struggling to eat much as I have such bad nausea from nerves! Will just be glad when it's over. What was your referral appointment like? Did you get results that day? x",
      "MessageIndex": 22,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Thank you Netty. I feel ill with nerves! I have no idea if the clinic is one stop or not, so not sure if I'll find out tomorrow. x",
      "MessageIndex": 24,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Wow Mia that should say, NOT Netty! Not with it today! x",
      "MessageIndex": 27,
      "PostDate": "23/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Six week wait til ultrasound :( While this is \"good\" in that they obviously don't think it's serious (and also coz of my age), I am gutted I have to wait this long.",
      "MessageIndex": 32,
      "PostDate": "01/02/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Thank you maggie. Apologies I have taken so long to reply! Well the underarm lump is still there, but thankfully it hasn't got any bigger. The intermittent aching is still there too and I have started getting occasional stabbing pains in the left breast. They only seem to last a few seconds but are pretty unpleasant and enough to stop me in my tracks for a few seconds.  I haven't heard from the genetics clinic either but that's probably normal given that it has just been the festive period. I have booked another appointment with my GP about the aches and pains. I'm pretty sure it's nothing serious but I want it dealt with regardless, have had them since October!  Will keep you posted.",
      "MessageIndex": 2,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Hello again, I've decided to take the whole day. Even if things are fine it's going to be an emotionally exhausting day. Is it normal to feel this nervous about something I am pretty sure is going to be fine?? I keep feeling sick!",
      "MessageIndex": 17,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Hi all, I am a 25 year old female whose mum has just finished radiotherapy for breast cancer. I have quite a strong family history of the disease (my mum has just had it, her mum died of linked ovarian cancer, my dad's mum has had it and both great grandmothers died of it). I found a lump under my arm a few months ago. I had it checked at the GP last week who said it was not a breast lump (phew!) but a swollen lymph node.He did a breast exam and found \"nodularity\". I know this is a good thing, but unfortunately this is what they told my mum and she was diagnosed through a 2nd opinion (thank goodness!)  and susequent biopsy. I know I am only 25, but still can't help worrying. The doc's appointment wasn't pointless though, as  I have been referred to a regional genetics centre to see if it is worth doing genetic testing. However, despite beign told the underarm lump isn't serious, for the past month and a half I have had an intermittent ache under my arm which seems to be getting progressively worse. I mentioned this to the doctor and he didnt think anything of it. The ache also spans out onto the left breast. I am on the pill so do not experience cyclical changes. It has been particularly noticeable today and am thinking of booking another appointment (not about the underarm lump, but the ache). I know it could be a muscle strain, but surely that would have gone away by now. Also, I have strained muscles before and this doesn't feel anything like that. Sometimes it feels like an internal 'burning' sensation. Do you think it is worth booking another appointment? Or will I just look like a hypochondriac?! Thanks for reading :)",
      "MessageIndex": 0,
      "PostDate": "17/12/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Netty, thank you for your good luck wishes. Was your underarm ache constant or intermittent? Mine is more intermittent but it has been over 2 months now, I am fed up! I think the fact that I'm only 25 and the fact that the doc thinks the underarm lump is a swollen node (as supposed to a breast lump) means that I am not a good enough case to get referred for any tests. I am still waiting on a letter from the genetics people. I have booked an appointment at the doctor but I'm worried he'll just tell me it's muscular and to give it time to go away. If I didn't have such a strong family history of breast cancer I wouldn't be as worried. Netty, I hope you are on the road to recovery. x",
      "MessageIndex": 4,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Thanks Netty, you are going through a lot yet you are so helpful, I really am grateful.  My GP does know about my family history, but he has subsequently referred me to a genetics clinic rather than actually getting my left side checked. I'm pretty sure he didn't refer me to a breast clinic because he said the underarm lump is just a swollen lymph node.  He wasn't sure what would happen at the genetics place and was very vague about it all. However, he is nice and gave me lots of time at my last appointment which was good. I am just going to tell him that the aching hasn't gone and that I have since developed sporadic stabbing pains. He did do a breast exam and found no palpable breast lump but did note '\"nodularity.\" However this is exactly what happened to my mum, her lump was in the ducts and the tumour had started to spill out of there. I don't want him to think I'm a hypochondriac. Hope your chemo is going ok Netty and that the side effects aren't too nasty.",
      "MessageIndex": 7,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Oops meant to say how long WERE you there for not how long will you be there for!! x",
      "MessageIndex": 15,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Hi Netty, Sorry to be annoying and ask another question, but when you had your underarm ache did you also have an obvious breast lump? My underarm ache has been really bad today, making me feel totally drained! I am so worried the hospital are going to think \"oh how ridiculous, a 25 year old girl with no obvious breast lump.\" However, I do have the family history and small underarm lump...",
      "MessageIndex": 19,
      "PostDate": "18/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    },
    {
      "AuthorID": "coffeebean85",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/coffeebean85",
      "Content": "Hello, Well I'm back and no further forward!! I have been told that the underarm lump needs an ultrasound but that this has to be done at the main hospital in town (I was at a communtiy hospital today) in a few weeks. They admitted that I have to wait coz of my age and problems are rare at my age. This is a good thing but I was really hoping to leave with answers today! She said that my breasts feel nodular but that's \"normal for a young woman\". Again, this is good but doesn't give me any answers! Will just have to wait on a letter for the ultrasound appointment now. This will mean another half day/day off work and as I am a teacher this is going to look really bad. Oh well, onwards and upwards! x",
      "MessageIndex": 29,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34016/underarm-ache-won-t-go-away",
      "Title": "underarm ache, won't go away!"
    }
  ]
}