{
  "AuthorID": "CQ",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cq",
  "Posts": [
    {
      "AuthorID": "CQ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cq",
      "Content": "Thank you for all replying and for your prayers and good wishes. It really does help to know that there are people you can turn to who know and understand what you are going through. Emma, good luck for your op the 23rd, will be thinking of you! Let us know how you get on. Thanks again. C xx",
      "MessageIndex": 4,
      "PostDate": "09/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10734/advice",
      "Title": "Advice"
    },
    {
      "AuthorID": "CQ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cq",
      "Content": "I'm feeling very sorry for myself, which is not like me at all :-( I've got my second lot of chemo this Friday (4th July) and my hair has started to fall out! I felt so bad with my first chemo (13th June)it is fair to say I am not looking forward to the next one! I was sick for 24 hours and then felt constantly nauseous for the next 2 and queasy for another 4 days. I have never felt tiredness like it either and it wiped me out for a week, it took all my energy to have a shower and put on clean nightclothes!!!!!!! As for my hair, well I thought I was prepared for that, I had it cut short and layered the other week in preparation but now it is starting to come away in handfuls it's not so easy. I bought some scarves at the weekend which although lovely just want to make me cry. Although loved ones and friends are being fantastic and so supportive I am not sure how they can really understand what I am feeling at times. I'm so sorry for my negative ramblings, I thought writing it down might help. I hate feeling like this as much as I hate chemo!! Thanks for reading this. Caroline x",
      "MessageIndex": 5,
      "PostDate": "30/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10734/advice",
      "Title": "Advice"
    },
    {
      "AuthorID": "CQ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cq",
      "Content": "Hi, my name is Caroline. I am due to start chemo next Friday (the 13th) and although I have read up about it I would really appreciate hearing from anyone who has had/having the same treatment. I am having 6 courses every 3 weeks of FEC and Taxotere. My breast cancer was diagnosed at the beginning of April and since then I've had various scans etc and surgery to remove the lump plus 7 lymph nodes (cancer had spread to 3 of them). I am lucky following surgery I am now cancer free and my follow up treatment of chemo, radiotherapy and hormone treatment is to prevent it coming back as I am young at 38 (that's one positive out of all this I keep being told how young I am :-) which helps morale!) Throughout I have found the best way to cope and deal with it for me is one stage at a time. Once I know what test I have to have I read up on it so there are no surprises. This seems to work for me, although that doesn't stop me from feeling scared or having some down time it helps keep me calm and positive and feeling I can do this! Chemo though is different to tests and surgery! I am currently calm and positive but as the day gets closer I beginning to get a little anxious. I am also having a portacath fitted in the morning before chemo which again I have read up on and it doesn't sound too horrendous as I'm told you are sedated but even so.... However there is only so much you can read, what is really helpful is to hear personal first hand experiences and get advice from those who really know! Thank you! C xxx PS If one more person tells me how brave I am and how they wouldn't be able to cope I will bop them on the nose! :-)",
      "MessageIndex": 0,
      "PostDate": "06/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10734/advice",
      "Title": "Advice"
    },
    {
      "AuthorID": "CQ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cq",
      "Content": "Hi I am due to start 3 courses of Taxotere tomorrow (have already had 3 courses of FEC) but have read that the side effects from Taxotere are worse and can mean you losing your finger and toes nails, along with swelling of joints and general aches and pains. I know it sounds silly but I am more worried about losing my nails as it sounds really unpleasant. Plus I'm worried that having already lost my hair and then to loose my nails too I am going to feel freakish, I know that is really vain and in the scheme of things is nothing as they will grow back, it does upset me and scare me to be totally honest. Yet at same time I feel stupid for feeling this way too. I just wondered if anyone else had had Taxotere and how they found it and did they lose their nails and is there anything I can do to stop it! Yours, more scared having Taxotere than FEC but trying not to be silly, Caroline :-)",
      "MessageIndex": 0,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10768/taxotere---any-tips",
      "Title": "Taxotere - any tips?"
    },
    {
      "AuthorID": "CQ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cq",
      "Content": "Thank you for all responding to me! Had Taxotere on Friday and so far I am finding it definitely better than FEC, main and best difference being no nausea thank goodness!!!! Am feeling more optimistic about keeping my nails now and will just make sure I look after them as much as I can. Hope you guys are ok! Caroline :-)",
      "MessageIndex": 7,
      "PostDate": "18/08/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10768/taxotere---any-tips",
      "Title": "Taxotere - any tips?"
    },
    {
      "AuthorID": "CQ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cq",
      "Content": "Thanks to both of you for replying and your advice. Great tip about painting my nails I will try that! I will let you know how I get on. Cheers Caroline :-)",
      "MessageIndex": 3,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10768/taxotere---any-tips",
      "Title": "Taxotere - any tips?"
    }
  ]
}