{
  "AuthorID": "cricha",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cricha",
  "Posts": [
    {
      "AuthorID": "cricha",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cricha",
      "Content": "Hi everyone  I had a masectomy in march and thought i was coping very well until i got an infection in my wound. I thought after 4 months i had escaped without any problems until 4 weeks ago. I felt dreadful didnt want to appear too ill for the family as they have had a lot to cope with. I had a heart valve replacement 3 years ago and now have a mechanical valve.I am on warfarin for life now and it brings with it problems the biggest one being operations. It was very stressful pre op trying to get my warfarin levels at the right level for my op but all went well and i didnt bleed to death on the operation table as i thought i might lol. It wasnt funny at the time though. I have been suffering from panic attacks since my heart op but i was mamaging to cope until i got the news i had cancer now im back to square one. I hate being on my own and get very depressed. My daughter has just gone on holiday today for the first time in 5 years and after dropping them off at the airport i cryed all the way home. Its not that i dont want her to go as she is a single mother with two teenage girls and they have never been abroad together. I know she needs a rest after all she has been going through with me and my problems its just i dont know how i can cope without her here. I have grown to depend on her so much maybe she wants me to stand on my own two feet and be more confident but i feel so scared. She is only away for one week but it will feel like a lifetime to me. Am i being selfish i think so and i will try and get on with things as normal whatever that is just dont panic !!!!!",
      "MessageIndex": 0,
      "PostDate": "04/10/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/43055/am-i-being-selfish",
      "Title": "am i being selfish"
    },
    {
      "AuthorID": "cricha",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cricha",
      "Content": "H as anyone been diagnosed with breast cancer after undergoing a heart operation to have a valve replacement . I had my aortic valve replaced with a mechanical valve three years ago then in feburary this year i was diagnosed with breast cancer.This was more traumatic for me as i am on warfarin because of my valve. I had my op in march but i was advised not to have chemo as it would affect my imune system and be a danger to my valve. After four months i was taken into hospital again with an infection in my wound and had to have antibiotics. I had 140 mls of fluid drained off my wound then more antibiotics.I thought that was it until this week when i got a letter from the hospital telling me i had to have 3 blood culture tests on 3 following days because of the infection this has me very worried has anyone else had this test done. carol x",
      "MessageIndex": 0,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/43394/breast-cancer-after-heart-surgery",
      "Title": "breast cancer after heart surgery"
    }
  ]
}