{
  "AuthorID": "crittercarer",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/crittercarer",
  "Posts": [
    {
      "AuthorID": "crittercarer",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/crittercarer",
      "Content": "Hi, I haven't been diagnosed, so fel like a bit of an interloper..... I found a lump, probably about 5\" down from my collar bone. I went to the GP, who did a breast exam. She found it mmediately and said she thought it was normal for me. It's quite hard and not a discrete circle, but not prominent from the skin. I don't understand why, at the age of 32 I haven't felt it before? It doesn't change with my cycle or anything. I'm not even sure if it comes under the classifiction of breast tissue. I have no other changes in my breast other than little spotty things on my areola, but they have been there ages and I believe they are normal. Basically, I can't stop worrying. Do I get a second opinion and how??? Thanks and sorry for interloping!",
      "MessageIndex": 0,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54319/second-opinion---lump",
      "Title": "Second opinion - lump?"
    },
    {
      "AuthorID": "crittercarer",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/crittercarer",
      "Content": "Thank you all so much for replying. I just wasn't sure if still being cncerned was enough of a reason to ask another gp. The other thing was I wasn't familiar with that GP as my GP (who's opinion I really trust) is male and will not do breast exams (I'm fairly certain he wouldn't even with a chaperone) I was there today (not about this,although I really wanted to, but the appointment was for something else,so couldn't) and found another female GP who I like, so might see if I can make another appointment with her. Hopefully she won't just look at the other GPs record entry and decide before she see's it. Maybe, if I go back and ask again, they'll see how worried I am? I really hope you are all keeping as well as you can and staying strong. Thanks again, means a lot. x",
      "MessageIndex": 4,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54319/second-opinion---lump",
      "Title": "Second opinion - lump?"
    }
  ]
}