{
  "AuthorID": "cuppaTtime",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cuppattime",
  "Posts": [
    {
      "AuthorID": "cuppaTtime",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cuppattime",
      "Content": "Good morning my lovely, you sound like a very supportive friend indeed. I have just had a year stolen from me and couldn't have done it completely alone. With friends, you make some, you loose some and true friends stick with you, you sound like a true friend! Some days she will want company some days not, its hard to say as our journeys are so different but just a little text or email sometimes makes a world of difference, just to say hello, how ya doing, a knock on the door (you can always say I'm not stopping just wanted to say hi & do you need anything from the shops?) she will completely guide you so don't always wait for an invite. Give her chance to talk if she wants to talk about her \"cancer\" she will decide and guide you, don't do as a friend of mine did (who's off my Christmas card list ha-ha) she didn't want to email, text as she didn't have then to talk about \"cancer\" and thought I maybe dwelling too much on my little issue! So my advise is just be you, you sound as I said a great friend and she will appreciate whatever you do for her xxx",
      "MessageIndex": 5,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149505/advise-for-a-friend-of-a-breast-cancer-sufferer",
      "Title": "Advise for a friend of a breast cancer sufferer"
    },
    {
      "AuthorID": "cuppaTtime",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cuppattime",
      "Content": "Hello Kerry Firstly I hope all goes well next Wednesday for your mum and I'm sure it will, she will be in safe hands so try not t worry yourself too much, easier said than done I know. She maybe putting a brave face on it all and as your \"best friend\" you will know and understand her far more than anyone if she is. She's most probably dealing with it in her own way and not everyone goes into melt down, but I am sure just knowing that you are by her side probably gives her all the strength she needs to cope with everything. Yes many of us, tho mastectomy is a huge thing to come to terms with are glad when its over and tackle how to deal with it afterwards. Many choose re-construction, some have the opportunity of having it at the same time, others choose delayed and many choose to be comfortable in their own skin, so again just be by her side whatever her decision. You may find your mum isn't too bad after her operation, many of us say chemo is far worse! but she will have a list of what not to do so I'm sure she will appreciate everything, absolutely everything and anything that you do for her...You know her so well, don't ask is there anything I can do, if you think it needs doing just do it for her. Maybe rather than \"do you want me to pick up a pint of milk?\", walk in with the pint and say ive popped you a pint of milk in the fridge, small things mean a great deal. To support her practically will support you and her emotionally, all you need to do is listen and don't be afraid to ask her anything, also don't forget to ask away on her there are many lovely ladies that will be able to put your mind at rest no matter the question. You sound a great daughter and I'm sure she's as proud of you as you are of her. My thoughts are with you all, and good luck \"MUM\" for Wednesday x",
      "MessageIndex": 1,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156525/mum-s-surgery",
      "Title": "Mum's Surgery"
    },
    {
      "AuthorID": "cuppaTtime",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cuppattime",
      "Content": "Hello Helen, I feel your pain, believe me. I had unclear margins twice and extensive DCIS discovered. I was then in the dilemma that you are in right now as to what to do next? Do I put myself through a 3rd operation in the hope of clear margins? your answer to this tough question maybe is YES and I want to give it a go, so you go for it girl its your body, but if you have doubts???? I finally went on the guidance of my surgeon, basically throwing the ball back at him to help me decide. We sat there my husband and I with tears running down my face, just looking at him across the table which seem like everything was in slow motion, my husband looked at me and turned to the consultant and said, \"if it was your wife what would you be recommending?\"..... 'my decision'  was made there and then and booked to have my mastectomy done, but he asked me to consider delayed reconstruction which again I went with his expertise, but that was the right decision for me. I think to be honest I personally, as feeling so scared of the unknown, needed someone to make the decision for me, cowards way out maybe...  Mastectomy isn't easy to deal with, some ladies cope better than others I'm sure, I think I'm a non coper, but after going to a talk given by one of a team of plastic surgeons, the results can be great, yes its a new booby & she will be a sister not an identical twin (as the surgeon put it and made many of us ladies smile through the tears) but you will feel whole again. For immediate reconstruction you will fall asleep with two boobies and wake up with two which I would imagine is a little more easier to get your head around, but I honestly cant say as I really don't know but I'm sure some ladies on here will be able to reassure you. Big decisions to make so take your time to decide or if your like me get someone to help you make the decision but its got to be the right one for YOU, I don't regret my decision and I'm sure whatever you choose will be the right decision for YOU X",
      "MessageIndex": 5,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149955/second-surgery-following-lumpectomy-and-snb",
      "Title": "Second surgery following lumpectomy and SNB"
    },
    {
      "AuthorID": "cuppaTtime",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cuppattime",
      "Content": "Millie, to be honest we are very lucky to have identical twins even before surgery and I hope the photo's that your BCN will be able to show you will be the same or similar to the ones we were shown by the plastic surgeon, these were photo shots of their own work I believe and sitting in the room I can tell you the finished article if you weren't critical was hard to pick out. Yes we know it will look and feel odd to begin with but I was truly amazed at what can be done, I still have to decide on reconstruction and similar to your train of thought I was worried i'd end up with a teenager along side the old granny, so I can understand you thoughts on the sisters ha-ha, you have to have a little smile. The speed of things I agree is alarming but on the other hand when we are hit with this news would we want things to drag, its all scary stuff and I think we have a right to be scared. Good luck for your appointment on Monday you may not even need to go down this avenue at all, so I hope and pray that all goes well for you but do keep us up to date with any news. Time for a cuppa tea now ha-ha X",
      "MessageIndex": 7,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149955/second-surgery-following-lumpectomy-and-snb",
      "Title": "Second surgery following lumpectomy and SNB"
    },
    {
      "AuthorID": "cuppaTtime",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/cuppattime",
      "Content": "Are you a wimp? how dare you even ask that of yourself, this is a hell of a journey you've been on and still on, so I'd give you a hug if I could and say stand proud my lovely you are one brave lady. My journey has been similar to yours but without having to go through the Rads as you have had to endure. Friends, you make some and unfortunately even 'good' friends you loose some. Unless you walk in these \"ballet shoes\" (this certainly keeps you on your toes in a spin) friends and family cannot understand truly how it can destroy you, physically as well as mentally. So a wimp you certainly are not and I am so pleased that you are managing to get out there and back to doing things you love. Yes, generally we all get that \" you look well\" never really sure when they kindly say this to you as to what they think you should look like? but possibly the day you see them is a 'good day' they haven't seen you crawl up the stairs on all fours, so it is hard but we forgive their ignorance, they really have no idea. We are often our own worst enemies as often when asked by others 'outside the club' how are you?, we often say \"oh not too bad, thanks\" rather than saying I actually feel like ????  probably to save their feelings or even to stop ourselves bursting into tears.. I think its really just that people do not know what to say LIN, you are certainly not a WIMP, stay safe in the snow and big hugs x",
      "MessageIndex": 9,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/151431/you-must-be-nearly-better-now-what-a-whimp",
      "Title": "You must be nearly better now!!! What a whimp!"
    }
  ]
}