{
  "AuthorID": "D.Luong",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/d.luong",
  "Posts": [{
    "AuthorID": "D.Luong",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/d.luong",
    "Content": "Dear Group Members My mum broke the terrible news to me yesterday that she has breast cancer. I can't bare to think that I could be losing my mum. Being the mum that she is, she has had the lump for 2 years and kept it a secret from us. Of course there is an element of anger to find out why she left it this late but as a dedicated parent, I could understand why she did it and it is now irrelevant. We still don't know the extent because she only just had her ultrasound scan and biopsy this morning and results wont be due until next week. I can only sit around worried and feel helpless. My wife is being very supportive as I don't know how I will cope without her strength and strength is what I need now to also keep my siblings in the right frame of mind (I'm the oldest of four children). The doctor at the hospital has requested to speak personally to me and my siblings this Thursday. How do I prepare for that? My mum lost her dad earlier this year and we will be so devastated if we also lose our mum too. She is in her late 50's so she is not actually young anymore. How will she be able to cope with the treatments coming her way. We are such a close knit family due to our father walking out on us years ago which made us more closer than ever before and none of my mums side of the family live here in the UK. Shes supported us on her own all these years and running her own shop which will now have to close down this week. My youngest brother completes his phD this year and will earn his Dr's title. His achievements has often reduced my mum to tears as she feels her hard work was worth it. My 3rd brother's 30th birthday this weekend, how we do pull ourselves together to enjoy this moment? We had a big family holiday planned in 2 months time, now we don't know what will happen. I am shaking with fear and can only cry when my mum, siblings and 2 young children are not watching me. My main concern in all this is the fact she has now had the lump for around 2 years and I am very scared it is being addressed too late. How do I get strength to look after my family?",
    "MessageIndex": 0,
    "PostDate": "10/06/2013",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61363/mums-got-breast-cancer-i-m-really-at-a-lost",
    "Title": "Mums got breast cancer, I'm really at a lost"
  }]
}