{
  "AuthorID": "Daisy31",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
  "Posts": [
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "Thank god I'm not alone! Over the past week or so the arm they have been using for my chemo has become really sore. The back of my hand is sore to touch as is up my forearm. It feels like I have dimples in my arm totally random. I mentioned joint pain to the chemo nurses and was told I shouldn't get it with FEC only T. Will defo mention the pain when I get my tox call this afternoon. Xx",
      "MessageIndex": 11,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114770/tight-painful-veins-after-chemo",
      "Title": "Tight, painful veins after chemo."
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "Thank god I'm not alone! Over the past week or so the arm they have been using for my chemo has become really sore. The back of my hand is sore to touch as is up my forearm. It feels like I have dimples in my arm totally random. I mentioned joint pain to the chemo nurses and was told I shouldn't get it with FEC only T. Will defo mention the pain when I get my tox call this afternoon. Xx",
      "MessageIndex": 26,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114770/tight-painful-veins-after-chemo",
      "Title": "Tight, painful veins after chemo."
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "No none take was told at ultrasound that they were clear not sure if they are planning on taking them when I have my op. Xx",
      "MessageIndex": 9,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110115/new-diagnosis-but-already-knew",
      "Title": "New diagnosis but already knew"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "Hi  I found a lump towards the end of April and went to the doctor as you do! Had to wait till the 2/6/16 to see the doctor at the hospital. Went in had the chat with the doc who said that he didn't think it was anything serious and would only send me for an ultrasound. Went down for that and the radiologist went away to get the senior radiologist which I was unsure about but thought ok maybe they want a better look. She came in checked me out left breast and under both arms. I asked her what she thought and she said she was not sure that it wasnt something suspicious. Asked if I had a mammogram booked I said no she suggested that I needed one. Literally as I walked out the room I was met by the lady that did the mammograms taken upstairs and it was done. I was sat outside the room waiting to see the consultant and saw the breast cancer nurse walk into the room. Being a nurse myself and knowing who she was I knew it wasn't going to be good news. I went into the room and met the consultant to which I was told I'm sorry to tell you but you have breast cancer. It's only 22mm and very treatable this is the plan. Then I was taken for a biopsy and given an appointment for next Tuesday for the results of the biopsies taken.  I think that I already knew when I found the lump that it wasn't going to be an easy road call it gut instinct. So when they said that that's what it was I wasn't overly shocked if you know what l mean? I think everyone else has taken it harder than me. Don't get me wrong I still have moments where I think really?? Why me? What happens if I go on Tuesday and she says I'm really sorry but we made a massive mistake and you don't have breast cancer at all. And I seem to not be able to sleep or eat much either which is not like me at all!! So I know it is affecting me whether I want it to or not! Sorry for the long post just kind of needed to get it off my chest!! No pun intended! Daisy X",
      "MessageIndex": 0,
      "PostDate": "07/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110115/new-diagnosis-but-already-knew",
      "Title": "New diagnosis but already knew"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "Thank you ladies for all of your comments. For some reason today I will openly say I feel a bit rubbish. Tired sore uncomfy and feel like I want to cry! I think that I am quite convinced that it is some form of BC as I agree that they wouldn't tell me if they're not almost 100% sure. Most of the days since Thursday I've been totally positive about it all maybe it's the lack of sleep catching up on me! Xx",
      "MessageIndex": 5,
      "PostDate": "08/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110115/new-diagnosis-but-already-knew",
      "Title": "New diagnosis but already knew"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "So results from today show that it definitely is breast cancer. A grade 2. Seems to be oestrogen happy but herceptin negative which is a bonus I suppose.  Booked in for a WLE and (?) SNB on the 22nd. Then have to wait till the 4th of July for results of what will be removed. Then app on the 8th to see the oncologist with regards to the plan.   Honestly don't know hoe I'm feeling at the minute. One minute I'm ok next I'm wanting to tell everyone to go away but not so politely if you know what I mean! Thanks for all your replies and input it is very much appreciated.  Xxx",
      "MessageIndex": 7,
      "PostDate": "14/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110115/new-diagnosis-but-already-knew",
      "Title": "New diagnosis but already knew"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "Hi Alison Sorry to hear your feeling rubbish.  I found that when I was feeling sick if I lay on my right side and took some deep breaths then that took as a the nausea. As for drinking I did small sips rather than big gulps which again seemed to help me. Ginger nuts were my best friend for a while as well. Hope that helps a little and that you feel better soon  Xx",
      "MessageIndex": 2,
      "PostDate": "24/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115388/struggling-to-drink-recommended-fluids-after-chemotherapy",
      "Title": "Struggling to drink recommended fluids after chemotherapy!"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "Hi Tracey, I had my first tax last wed then my filigrastin injection on Friday. Was sore on the the Friday but spent most of the weekend in bed can't sleep with the pain gettin a max of like 3.5 hours which in turn is giving me a headache. Also struggling with the diharrea but can't decide if it's tax related or the fact that I'm on a four week course of antibiotics.  Decided that if I'm still struggling tomorrow I'm going to give my doc a call n see what she suggests. Feeling guilty as we have a four year old and my hubby has been left to do everything . It's nice to know someone else is going through this at the same time!! Lyndsey xx",
      "MessageIndex": 2,
      "PostDate": "10/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116101/1st-tax-and-herceptin",
      "Title": "1st Tax and Herceptin"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "I'm tried to send you a private message but can't figure out how!! Just two questions if that's ok? What kind of reconstruction did you have and how long will you have the drain for? Thanks Xx",
      "MessageIndex": 4,
      "PostDate": "07/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119325/no-radiotherapy-now-mastectomy-and-anc",
      "Title": "No radiotherapy now mastectomy and ANC"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": " I'm due to see the surgeon with my BCN tomorrow with the op hopefully beginning of Jan!! The joys of cancer hey?xx",
      "MessageIndex": 2,
      "PostDate": "07/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119325/no-radiotherapy-now-mastectomy-and-anc",
      "Title": "No radiotherapy now mastectomy and ANC"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "So I went for my planning scan for my planned radiotherapy only to get a surprise appointment with my oncologist.  Turned up for the appointment which was at 11. Didn't get taken in until quarter to 12, which didn't help my nerves. Was told by the oncologist that my heart on the ct scan is too far over so straight radiotherapy is not an option at all. My options now are ANC and the deep breath radio but they can't guarantee that my heart will move enough to not be damaged or a mastectomy with ANC.  Don't really want either but had to make a decision. Chose the mastectomy and ANC, but think it's now hit me that there are so many different options re mastectomy that are now open to me and I'm honestly scared that they will just give the option of having a straight mastectomy and I'll have to go back for reconstruction.  Can anyone give me any advice re having a mastectomy and what they did? Thanks Lyndsey  Xx",
      "MessageIndex": 0,
      "PostDate": "07/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119325/no-radiotherapy-now-mastectomy-and-anc",
      "Title": "No radiotherapy now mastectomy and ANC"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "Hi ladies, I'm due my 2nd T on wed. I had joint pain and not taste with the last T. Slept about 3 hours a night before the pain woke me. Then decided to get admitted to the hospital with a temp of 39.9 and a heart rate of 152. Spent 5 days in the hospital before they discharged me. I'm having a lower dose of T this time but apparently not by much. On the plus side got morphine for the joint pain so will hopefully not feel as bad as I did the last time. Hoping that this next T will be kinder to me! Lyndsey  Xx",
      "MessageIndex": 2,
      "PostDate": "24/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117029/2nd-t-this-week-how-is-everyone-else-doing",
      "Title": "2nd T this week. How is everyone else doing ?"
    },
    {
      "AuthorID": "Daisy31",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy31",
      "Content": "Hi Nicola My tumour was a grade 2 35mm and I was like you went back for my results and was told that it was ER7 HER -vet and can't remember the other one sorry. But that like you one of my lymph nodes decided to join the party too. I start chemo on wed for 6 sessions then have the option of joining a trial to have 2 weeks worth of radiotherapy rather than 4 to my breast under my arm and above my shoulder.  I took the decision to not have any more lymph nodes removed surgically, but that was my decision as I didn't want more surgery and would still of needed to have radio to that area anyway.  Hope that kind of helps. Lyndsey X",
      "MessageIndex": 1,
      "PostDate": "25/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112395/lymph-node-positive-what-happens-next",
      "Title": "Lymph Node positive what happens next??"
    }
  ]
}