{
  "AuthorID": "Daisiemoo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisiemoo",
  "Posts": [
    {
      "AuthorID": "Daisiemoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisiemoo",
      "Content": "You will find a lot of help, knowledge and reassurance even if like me you mostly read and don’t post much. I also went private after my initial diagnosis and first meeting with the surgeon, only because I have Bupa via work and could use the local private hospital and also choose my surgeon.  I am now having my radiotherapy again private on the recommendation of the oncologist as left breast masectomy so protection of my heart etc with a better machine than locally where I would have gone. My BCN is NHs and have seen them for my prothethis and are there for any queries I have, they are great. Hope your journey through all this goes well, but any concerns come on here or Breastcancerorg.com and not  Dr Google ( although Moose & Doc is a good site and was recommended to me at my diagnosis as like to have lots of info ",
      "MessageIndex": 17,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158007/just-diagnosed-with-breast-cancer",
      "Title": "Just diagnosed with breast cancer"
    },
    {
      "AuthorID": "Daisiemoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisiemoo",
      "Content": "Hi, I have this week finished my 15 sessions and I asked the radiotherapist about moisturising my back and she said no need as it will not go through, I suppose it depends on the machine they use. Definatly drink plenty of water / squash or similar, I had a 650ml water bottle which I made sure I drank 2 in the morning and 2 in the afternoon minimum unfortunately still did not stop me being hit by a wall with fatigue a couple of times. I worked through my treatment but did leave early some days like today as legs of lead and aching joints  (although this could easily be the Tamoxifen also ...) Listen to your body and rest if required, good luck and lots of hugs",
      "MessageIndex": 52,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "Daisiemoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisiemoo",
      "Content": "I started Tamoxifen RelonChem on the 17th May and started my 15 sessions of rads on the 22nd ( also came off my Fluexotine for my Reynolds on the 17th) so was not sure if the tiredness, headaches were for what! Headaches cleared up within 9days so that was the fluxotine probably, some fatigue so less hours at work, but one more rads to go yeh and then 5 yrs of Tamoxifen. I do occasionally get a gout in my big toe but seems more than usual so not sure if this is the Tamoxifen or not but paracetamol sorts it, apart from that at the moment all seems ok, well apart from hot flushes but they are manageable and last only minutes Hopefully no other problems will happen...",
      "MessageIndex": 11,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159160/tamoxifen-brands-uk-list-trying-to-find-one-that-suits-me",
      "Title": "Tamoxifen brands UK list? trying to find one that suits me!"
    },
    {
      "AuthorID": "Daisiemoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisiemoo",
      "Content": "When I started taking the Tamoxifen I took at night, but forgot one evening so took at breakfast time, first day ok 2nd day so nauseous and weary in the afternoon I had to get my partner to collect me from work. Went back to taking in the evening around 9pm when I have my last cup of tea and no nauseous feeling since, so evening taking it is- we have set up a system so my partner can check I have taken it when he makes his night drink somI don’t forget again",
      "MessageIndex": 15,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159160/tamoxifen-brands-uk-list-trying-to-find-one-that-suits-me",
      "Title": "Tamoxifen brands UK list? trying to find one that suits me!"
    }
  ]
}