{
  "AuthorID": "Daisy1975",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy1975",
  "Posts": [
    {
      "AuthorID": "Daisy1975",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy1975",
      "Content": "Hi Wanted to ask a few questions as I know treatment plans vary according to stage etc at diagnosis. My mum had FNA of lymph node at the same time as core biopsy as they obviously noticed it was abnormal. She was diagnosed with grade 3 invasive ductal cancer. We have no idea how long lump has been there as sadly it possibly began under a lump that she had been told was nothing to worry about (following ultrasound) 21 months earlier. It was rather large at time of biopsy though and the consultant when asked, said the size wasn't relevant because it was already in the lymph node so treatment plan based on that. What I am wondering is following a CT scan and MRI of breast and lymph nodes she is to begin with chemo first. Half way through they will repeat the MRI to see how it responding. I am now wondering what happens next. They say they'll have the MDT meetings to discuss but what happened to you ladies. They suggested it will be surgery after the chemo but will this be full auxillary node clearance too? I know (unless lumpectomy shows different receptor results to biopsy) that she won't have hormone treatment as she was only weak ER+. We see the oncologist on Monday so will go over the plan with them but was interested what others have been through or been told. Thanks Daisy",
      "MessageIndex": 0,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85881/ladies-with-lymph-node-positive-result-at-initial-diagnosis",
      "Title": "Ladies with lymph node positive result at initial diagnosis"
    },
    {
      "AuthorID": "Daisy1975",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy1975",
      "Content": "Thankyou both for responding.  Julia will you have full lymph node clearance or do you not yet know if any were affected? It's good to know that they can tell how many were affected due to scar tissue. I did wonder how they'd know following chemo. Very pleased to hear that your tumour has responded! George and Jackie - I'm unaware which lymph node they took the FNA from. I am assuming it was swollen and is why FNA was done. Would they be able to see on the US which position the node was in? I wasn't sure it would be that detailed. we are seeing the oncologist tomorrow regarding her treatment plan. The breast consultant seemed to want to relay information in simple terms which was frustrating. Didn't even mention the grade until I asked him. He mentioned chemo every 3 weeks for 6 weeks but did not discuss drugs as said that's for the oncologist to cover. I assume they'll have all te info on the FNA and if they saw many affected (although I am aware they don't always show up on US). I'm trying to prepare a list of questions.  If if someone has surgery first, when do they decide to do a CT scan? Does it depend on how many were affected? Thanks for all of your help. It really helps to chat to others in the same position. I know its my mum that has this terrible disease but I want to be with her every step of the way and need to know everything inside out. Daisy",
      "MessageIndex": 3,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85881/ladies-with-lymph-node-positive-result-at-initial-diagnosis",
      "Title": "Ladies with lymph node positive result at initial diagnosis"
    },
    {
      "AuthorID": "Daisy1975",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisy1975",
      "Content": "Thanks for sharing and your advice Ro. Hope your chemo is managable. Dreamthief - we saw the oncologist. the evening before the appointment my mum noticed that you could feel the lymph node under the armpit. Hadnt noticed before not sure if bigger or just a positioning issue. This worried me a little and I asked the oncologist if size had any relation to it spreading further And was told it has no bearing on it. They knew whoh node the could feel but of course not where in chain. Also could only feel kne but I know that's not any indicator of how many effected.  she has her CT scan this week and then an MRI on breast week after. Treatment two weeks time. She's habing the FEC-T - pretty standard I assume? We had been told it was weak ER+ by consultant last week but the oncologist said score was 5/8 so it's moderate and my mum will have tamoxifen. just wanted to update you. About to start a new thread with some new queriee. Thanks for all your inputs. daisy",
      "MessageIndex": 6,
      "PostDate": "18/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85881/ladies-with-lymph-node-positive-result-at-initial-diagnosis",
      "Title": "Ladies with lymph node positive result at initial diagnosis"
    }
  ]
}