{
  "AuthorID": "daisydot",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisydot",
  "Posts": [
    {
      "AuthorID": "daisydot",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisydot",
      "Content": "Hi Was diagnosed with breast cancer in October 2009 and then kidney cancer in may 2011. Have now found another breast lump, had scan and biopsy last week and get results tomorrow. Bit worried but calm and collected as ever! That's my way of coping with it. Only told my daughters and two friends, will tell everyone else if I need to! Keep fingers crossed for me !",
      "MessageIndex": 0,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59098/second-time-around-results-tomorrow",
      "Title": "Second time around? Results tomorrow"
    },
    {
      "AuthorID": "daisydot",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisydot",
      "Content": "Hello all I had my results yesterday which show that the lump in my breast is not breast cancer but a renal cell carcinoma metastases from the kidney. Having to get CT scan to see if there is any other spread. Pretty devastated at the moment. Apparently it is very rare for renal cell to spread to the breast. Trust me to get a rare one!! Treatment plan will depend on whether there is any spread to other organs. Will have to wait and see on that one. Knowing my luck it will have spread. Anyway am keeping positive for now. Best regards to everyone x",
      "MessageIndex": 11,
      "PostDate": "03/04/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59098/second-time-around-results-tomorrow",
      "Title": "Second time around? Results tomorrow"
    },
    {
      "AuthorID": "daisydot",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisydot",
      "Content": "Thank you all for messages. I will have ct scan next Monday to see if there is other spread and then a treatment plan will be determined. Saw my renal consultant last night and he is having the biopsy tested again to make 100 percent sure that it is a renal spread as he says he has never seen a renal cancer spread to the breast. More waiting but we get used to it don't we in this journey that we take. Of course if it is not renal then it must have spread from somewhere else. Not sure which one is better really. If he has not seen it before then guess there won't be much research but if not renal spread that means another primary somewhere. Am upbeat and staying positive. Been shopping today and had a bit of retail therapy. Why not I say! Thanks again and also thinking of all others on here who are going along the same road x",
      "MessageIndex": 17,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59098/second-time-around-results-tomorrow",
      "Title": "Second time around? Results tomorrow"
    },
    {
      "AuthorID": "daisydot",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisydot",
      "Content": "Hi all Feel a bit better about it all now - got my head round it and decided that there is no point in worrying for a week so will try to just put it out of my mind and see what next Tuesday brings. Not much else can do eh! As you say been there done that twice over and will fight again if I have to! X",
      "MessageIndex": 10,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59098/second-time-around-results-tomorrow",
      "Title": "Second time around? Results tomorrow"
    },
    {
      "AuthorID": "daisydot",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daisydot",
      "Content": "they have just rang me from hospital to say not to go this afternoon. Results back, discussed with Multi-disciplinary team and pathologist wants to do more tests on the biopsy. Got to wait until next Tuesday. Not sure what it means.Feel a bit more worried than I was before but will just have to wait until next week.Thanks to all for support x",
      "MessageIndex": 6,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59098/second-time-around-results-tomorrow",
      "Title": "Second time around? Results tomorrow"
    }
  ]
}