{
  "AuthorID": "daloni",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
  "Posts": [
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "Is it tits only? Or are you considering other women's bits?  I went for a meeting with the surgical registrar ahead of surgery for womb cancer in 2014. My entire family (two sisters and husband) came with me and they had to find a room big enough for us all.  The young surgeon explained carefully that the surgical team would be going in mid line, so with a cut from above my belly button to my pubic bone. My husband is a vet and piped up: \"Oh, good. We do it midline in dogs and they are up and running in two days\". I watched the surgeon rearrange his features into a suitable expression before saying \"It's not quite like that in women.\" I was at my daughter's school during chemo for some important school trip meeting. Really not feeling well, low blood cells so quite breathless and still healing from the massive operation, hairless and in surgical menopause so just using a headscarf to cover my head because a wig was just impossibly hot. I was sitting on a school child sized chair at a school desk, gently sliding on to the floor as the trip leader droned on about mobile phones on school trips. I just made it through the meeting without having to become horizontal. One of the teachers came up to me afterwards and said: \"I just wanted to say, I know exactly how you are feeling because I had morphine once.\" To my pride, I had the presence of mind to say: \"No. You have literally no idea and you need never to say that to anyone ever again.\"  Good luck with the gig.  Pip pip! ",
      "MessageIndex": 2,
      "PostDate": "05/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133040/my-annual-fund-raising-stand-up-routine---need-more-material",
      "Title": "My annual fund-raising stand-up routine - need more material !"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "Hi Bozzie5 I've popped over from womb cancer where hysterectomy is the mainstay of treatment so there is lots of experience of surgically induced menopause. I am sorry you have these horrible symptoms. It might be worth you having a look through one of the recent threads on this topic. Clicking on the highlighted text should take you there. It contains information that may be useful to you - and I hope will help you feel less alone. Night sweats and insomnia seem to be the fate of the middle aged woman but it sounds like you have them in spades after the surgery.  Good luck! xx",
      "MessageIndex": 5,
      "PostDate": "31/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126063/menopause-after-hysterectomy",
      "Title": "Menopause after Hysterectomy"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "PS I used mirtazapine as recommended in this thread for anxiety and depression - I hadn't realised it helped with hot flushes. A great drug but comes with some side effects such as making you want to eat eleventy billion hot cross buns. It was a bit of a battle to get through the first two weeks as they made me feel quite foggy headed until I was settled. But the blessed relief of sleep...I was on them for about a year but came off as they were not helping me sleep anymore and I did not want to increase the dose and risk increased dependence on them. But, as I said, extremely useful.",
      "MessageIndex": 6,
      "PostDate": "31/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126063/menopause-after-hysterectomy",
      "Title": "Menopause after Hysterectomy"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "Hi  This user is requesting friends all over. You can unfriend again. I will report this post to the moderators.  Thank you for highlighting it. I'm going to ignore my invite....",
      "MessageIndex": 2,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133961/friend-request",
      "Title": "Friend request"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "Don't panic, Cannon!  Go to your profile.  Click on the tab that takes you to your list of friends. Then click \"unfriend\".  And yes, it's amazing that someone is sitting at home, sending messages like this on a cancer site. It's disgusting. What is wrong with them? Thankfully, they are few and far between and we have some great moderators who help keep this site safe.  Xx",
      "MessageIndex": 12,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133961/friend-request",
      "Title": "Friend request"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "Or Daloni, even :-)  Don't worry. It shouldn't happen but I'm afraid it does from time to time. I'm glad you've been able to find the right buttons to get rid of this leach.  Sleep tight.  Xx",
      "MessageIndex": 17,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133961/friend-request",
      "Title": "Friend request"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "Hi  I've already alerted the moderator. I'm really sorry this has happened, Sue. I hope the admin team will be in touch with you directly via email in the morning. I'm one of the community champs - volunteers who work with the Macmillan team - and we usually weed out people early. I hope you won't let this put you off taking part in the community. ",
      "MessageIndex": 6,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133961/friend-request",
      "Title": "Friend request"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "I have. It's not so bad - and if you need help and you have a cancer centres nearby you can get help there. ",
      "MessageIndex": 1,
      "PostDate": "05/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126382/pips-application",
      "Title": "PIPS application"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "Hi Jill Try Eurotunnel or MIA Insurance. Both get good feedback over on the incurables group. Or alternatively just take your EHIC card (while you still can...did I say that out loud?) xx",
      "MessageIndex": 1,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128193/travel-insurance-categories-secondary-cancer-or-not",
      "Title": "Travel Insurance categories (secondary cancer or not?)"
    },
    {
      "AuthorID": "daloni",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daloni",
      "Content": "Hi  I saw your post and popped in from the womb cancer group. Are you post menopausal? Menstrual bleeding in woman who are post menopause always triggers a two week cancer referral but nine times out of ten it's benign. Do ask for pain relief. It's not routinely offered everywhere - quite barbaric but there you go. If you are in the one in ten, do come over and meet the women in the womb group.  Good luck!  Xxx",
      "MessageIndex": 2,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120774/hysteroscopy",
      "Title": "hysteroscopy"
    }
  ]
}