{
  "AuthorID": "dandelion54",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dandelion54",
  "Posts": [
    {
      "AuthorID": "dandelion54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dandelion54",
      "Content": "Hi Yvonne17 I have been on letrozole since May 2011 so just over 3 years now and I have really suffered. I am so tired all the time and even find myself falling asleep in the early evening. I get really stiff and painful joints and feel about 100 years old. I am 58 years old and when I talk to my oncologist about this she says its probably just me getting older! All this and the hot flushes seem to get worse. I battle all night long with the covers on and off and this only adds to my tiredness. However I want to fight as hard as I can and so I put up with it day after day and have no intention of giving in. I think that it helps knowing that others are having these same side effects and that we are not getting old or going mad. I have heard that sometimes different brands like Femara can have lesser side effects however they are apparently more expensive and so Gp's are reluctant to prescribe them. Good luck and hang in there. Jen",
      "MessageIndex": 5,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82168/letrozole-are-dreadful",
      "Title": "Letrozole are dreadful"
    },
    {
      "AuthorID": "dandelion54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dandelion54",
      "Content": "Hi Ella Waiting for results really is one of the hardest things ever. Once you have results even if they are not good at least you know what you are dealing with. It's the NOT KNOWING that's the hardest part. I have just waited 4 Weeks for my annual mammogram results and I just couldn't function at all. I don't think people, friends and family really understand what it's like. Keep your chin up and be strong. I really hope you get some good news.  Jen x",
      "MessageIndex": 2,
      "PostDate": "01/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90654/awaiting-results---recurrence",
      "Title": "Awaiting results - recurrence"
    },
    {
      "AuthorID": "dandelion54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dandelion54",
      "Content": "Hi Lennie Did you find a coffee group in Banbury? There is a breast cancer group that meets once a month. I might be interested in joining too. ",
      "MessageIndex": 6,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134859/coffee-support-groups",
      "Title": "Coffee support groups"
    },
    {
      "AuthorID": "dandelion54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dandelion54",
      "Content": "Hi Lennie Do you go to the support group at the orchard health centre I think?",
      "MessageIndex": 10,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134859/coffee-support-groups",
      "Title": "Coffee support groups"
    }
  ]
}