{
  "AuthorID": "danielleh",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/danielleh",
  "Posts": [
    {
      "AuthorID": "danielleh",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/danielleh",
      "Content": "Hi, i havent started chemo yet but heared that eyebrows and eyelashes also fall out so i went and got my eyebrows tatooed on, they look fab. And as for eyelashes the strips of false lashes are really good and could stick to skin so you could pop them on if ever you're going out anywhere or put abit of eyeliner on so your eyes dont look too bare. Ive also been worried about this and have been asking lots of questions, i met a lady who had alepecia (sorry cant spell) and gave me all of these tips, at least ours will grow back eventually. Hope this helps. XxxxDaniellexxxX",
      "MessageIndex": 3,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50811/hairy-question",
      "Title": "Hairy Question"
    },
    {
      "AuthorID": "danielleh",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/danielleh",
      "Content": "hi guys, ive written on here a couple of weeks ago with no reply so deleted it, so il try again. I had a lumpectomy on my right breast yesturday with a couple of nodes taken to be tested - really hope its not in them because im no good with anasthic. Spent all day yesturday vommiting and felt like i was on another planet, i didnt seem right to be sent home the way i was feeling. Feeling alot better today though after a good nights sleep, had a shallow bath earlier which made me feel better. Now its just a waiting game for my lymph node results (fingers crossed). Really scared of chemo and loosing my hair, have heared about the cold cap so im going to give that a try, does any of you guys know anything about it or have used it yourself? it doesnt sound very nice but i suppose its better than loosing hair. Cant un til this is all over so we can have a well deserved holiday.hope to hear from others going through what i am. XxxxDaniellexxxX",
      "MessageIndex": 0,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50813/had-my-lumpectomy-yesturday",
      "Title": "had my lumpectomy yesturday"
    }
  ]
}