{
  "AuthorID": "Darryl",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/darryl",
  "Posts": [
    {
      "AuthorID": "Darryl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/darryl",
      "Content": "Hi, is anyone out there suffering the side effects of letrozole? Mainly the fatigue, joint pain and depression? I finished my XRT last May having previously had FEC 75 and a wide excision. I'm now finding that the letrozole side effects seem to be getting a lot of joint pain and fatigue which is really hard to cope with especially as I am also having debilitating hot flushes which in turn seem to be giving me the spotty complexion of a teenager. I'vebeen on letrozole for over 3 months and instead of the side effectseasing as I was expecting, they seem to be getting worse. Has anyone had this problem? Did you change to another drug? and did the side effects from the new drugs affect you as much. I would take antiinflammatory tabs to ease the pains but unfortunately, the chemo gave me extensivepulmonary emboli so I'm now on Warfarin for life. Thanks in advance for any help I can get on this matter. The whole living with cancer thing is really getting to me now.",
      "MessageIndex": 0,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72370/letrozole-and-side-effects",
      "Title": "letrozole and side effects"
    },
    {
      "AuthorID": "Darryl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/darryl",
      "Content": "Thanks George and Jackie, I shall check the maufacturers at the 2 pharmacies I use and keep your advice in mind. I did have a bone density scan last autumn and will be getting an appointment for my next one when I see the oncologist in June. I only have a minimal osteopeania in my lumber spine so far, Darryl x",
      "MessageIndex": 4,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72370/letrozole-and-side-effects",
      "Title": "letrozole and side effects"
    },
    {
      "AuthorID": "Darryl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/darryl",
      "Content": "thank you Maggie, I don't feel so much of a wimp now knowing that there are more like me out there Darryl x",
      "MessageIndex": 7,
      "PostDate": "25/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72370/letrozole-and-side-effects",
      "Title": "letrozole and side effects"
    },
    {
      "AuthorID": "Darryl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/darryl",
      "Content": "Hi Rosie, many thanks for your reply. I shall be ringing the anticoagulant team again tomorrow to see if I can safely take Sage leaf again for the flushes. I was taking it before I developed the Pulmonary Emboli during chemo and it was helping a lot to keep the flushes at bay, but I seem to remember they didnt want me to continue with it as I was on Tinsaparin and then Warfarin to stop me developing more clots. My clotting times are now stable so hopefully they will say its compatible with the warfarin. Thanks for reminding me, I  had forgotten the help I got from sage, Darryl x",
      "MessageIndex": 5,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72370/letrozole-and-side-effects",
      "Title": "letrozole and side effects"
    },
    {
      "AuthorID": "Darryl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/darryl",
      "Content": "Hi Jints, like you I found the post XRT absolute exhaustion awful, frustrating, infuriating and felt worse than I had even when in hospital, in the middleof chemo, with extensive pulmonary emboli. It made a nightmare to live with as my patience disappeared along with my confidence and a little bit of my determination to get through it all and I got very down with it all.  Take heart though with this from a  from a 65year old teenager. Just ride along with your body for the next week or so then you'll notice the gradual improvement. I got the free DVD Get Active Feel Good produced by Macmillan/Boots.( ask for the Macmillan specialist pharmacist in your local boots or order it online.) Its gentle exercise and so good for getting you going again and restoring confidence. I started mine about 5 weekspost XRT, sitting at first then as I felt a bit better increasing the level. Just take every day as it comes, believe me , there is light at the end of the tunnel. I still get tired after doing a lot but I did theRace for Life 2 and a halfmonths after XRT and 2weeks ago(3 months post XRT) on holiday in Cornwall did some body boarding withmy daughter and grandaughter ,,,, without a wetsuit too !!!!!!!  love and hugs Darryl",
      "MessageIndex": 3,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63857/post-radiotherapy-exhaustion",
      "Title": "Post Radiotherapy exhaustion"
    },
    {
      "AuthorID": "Darryl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/darryl",
      "Content": "Hi, I too love my new regrowth, always coloured blonde ( to hide the grey) fine, straight and almost shoulderlenght pre chemo, its now coming thick and curly, very short and a lovely mixed shade of grey and white. All my friends and family like it and want me to keep this style. My daughter says I look like I'm growing older (I'm 65 going on 15) and leaving cancer treatment behind with attitude and style !! She went with me when I had it shaved when it started to fall out  and we shared laughter tears and a glass of wine with my hairdresser. My problem is the down that is growing on my face! I'm now on letrizole after chemo and radiotherapy, but I don't want a beard, can anyone help with ideas please?",
      "MessageIndex": 9,
      "PostDate": "19/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61571/hair-regrowth",
      "Title": "Hair Regrowth"
    }
  ]
}