{
  "AuthorID": "dash123",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dash123",
  "Posts": [
    {
      "AuthorID": "dash123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dash123",
      "Content": "Hi, I just want to ask has anyone heard of neuropathy breast cancer, In October i had an x-ray done and it showed i had a problem on my left lung and so i was sent to a lung specialist who sent me for a biopsy, Pet scan and Ct all came some their but not sure what. Anyway in 2012 i had breast cancer grade 3 carcinoma did all the right things and got the all clear until Jan 16 when i develop a mass in my other breast and that one was TN grade 3 carcinoma , in December a week before Christmas it was decided I was going to have the lump removed in my lung to see what it could be, a week after i had my operation I got a later saying they were still not sure what it is the consultant said it maybe lung or breast cancer again all he could say it was a carcinoma. So today I get a phone call from the consultant telling they still not sure but they had looked at my records over the past few months and he asked if i had any biopsy done of my breast that had TN because something had shown up as neuropathy which no one had told me about,  And now i have to wait for them to compare my old cancer slides to this new slide to see if they are matching to see what it is, They think I might have problem with the breast I  had TN and it could causing me to have neuropathy breast cancer. Just very confused at the moment just want to know what it is.",
      "MessageIndex": 0,
      "PostDate": "04/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146262/neuropathy-cancer",
      "Title": "neuropathy cancer"
    },
    {
      "AuthorID": "dash123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dash123",
      "Content": "Hi hope everyone are okay, I'm due to start my chemo on Thursday and I can't remember what food I can have and what food I need to avoid as I had chemo four years ago . I did see my chemo nurse this week but because I had chemo before she said we don't need to go into to much detail as I know the what going to happen. I remember soft cheese was one to avoid and to stay away from take-aways, and to make sure all food is cooked properly. I'm having 4xtc this time where i had Fec before which made me ill. I got some cranberry juice as if I remember right it helps. I know things have changed since my last chemo  Dash",
      "MessageIndex": 0,
      "PostDate": "26/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107128/best-food-to-eat-and-food-to-avoid",
      "Title": "Best food to eat and food to avoid"
    },
    {
      "AuthorID": "dash123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dash123",
      "Content": "Hi everyone  I have just been diagnosed with  breast cancer for the third time this time it has spread to my left lung  so now its classed as a secondary cancer its on the same size i was diagnosed with TNBC in 2016 I was first diagnosed  in 2012 which was a different cancer in my right breast. The only reason they found it is because i had an X-ray in October last year which showed something up. Since then I have had a Pet scan, biopsy and a CT scan plus a operation to remove the lump from lung a week before Christmas . I think what's making it harder is I had an x-ray done in April last year and it showed something faint up then and it was pasted over. I am now waiting to see the oncologist on the 29th Jan to discuss what will happen next which I haven't got a clue what the treatment will be. Its has also taken 5 weeks for the results to come back after i was told it will only take 10 after my operation to get the results. The reason for the long wait is they couldn't decide whether it was breast or a new primary lung cancer they had to compare my last cancer slide with my new cancer slide which why it took so long.  ",
      "MessageIndex": 0,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147957/its-back-for-the-third-time",
      "Title": "its back for the third time"
    },
    {
      "AuthorID": "dash123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dash123",
      "Content": "Just had a phone call from the hospital telling me my radiotherapy date has changed as they need to talk to my oncologist to discuss my treatment with him, I am triple negative grade 3  and its on the left side, they also said they need to look at my last treatment as I had breast cancer in 2012 on the right side which I have been on hormone tablets for Both lumps have been in awkward places .  Is this normal. What do the scans see when you go for your treatment plan. I went for the planning 29th April why leave it up to now to change things I was due to start on the 16th May and now its change to the 19th. They did say their was nothing worry about. ",
      "MessageIndex": 0,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109092/radiotherapy-date-changed",
      "Title": "Radiotherapy date changed"
    },
    {
      "AuthorID": "dash123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dash123",
      "Content": "Hi Silvercloud,  I decided not to have chemo after having one session of chemo this time and I'm still okay with my decision, the reason I stopped it is I got really ill and I couldn't put my body through it again plus I have had chemo before and it has come back again after only 3 years. This time round I'm triple negative where before I was positive so that meant I could have hormone tablets. Last time I had fec x5 as they stopped chemo no6 due to me getting blood clots on my lungs, This time I was having TC x4 and after one session I got a water infection plus neutropenic sepsis and ended up in hospital as A&E said they wouldn't keep me in . SO now I have know trust in chemo.  I am due to start radiotherapy on the 19th May all being well got to wait to see what the onglogist decide next week. Another reason I didn't want to carry on is I have a friend going through secondary cancer and she was having chemo every week to reduce the lumps but sadly it did for a while but now they have come back.    But only you can decided what you want to do No one can make that decision for you , I wish you all the luck with whatever you decide.   Dash xx",
      "MessageIndex": 39,
      "PostDate": "13/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108705/making-the-right-decision",
      "Title": "Making the right decision"
    }
  ]
}