{
  "AuthorID": "DaviniaV",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
  "Posts": [
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi I am sorry to hear about your diagnosis, I was diagnosed at 35, it was November 2013.   It is a total shock and the worst thing to ever be told but the very good news is that you have found it, it has been identified and so now you can treat it and kick it into touch.   I know that right now it feels like you are doomed but you are not, you will get through this, the statistics are in our favour and you are not alone.  You will cope because you just have to, you do not have to get through this bravely or gracefully, you just have to get through it and you will.  Its great you found this forum, it will help you so much, just to share your ups and downs, to ask questions and be re assured when its needed. Thinking of you Davinia x",
      "MessageIndex": 2,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72147/just-been-diagnosed-and-feeling-numb",
      "Title": "Just been diagnosed and feeling numb"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi Traci I had to wait a week too, whilst it feels like an awful long time with such a diagnosis hanging over you, in reality, you must try not to worry, nothing is going to change in a week, it feels awful to have this thing inside you when you just want rid of it but I was reassured that it just doesn't grow that fast so a week is nothing, don't worry.  It actually sounds like they are moving quite fast if surgery is in only a few weeks, in Paris, where I was treated, the wait was one month for surgery which again, I was reassured was no wait at all.. It does feel like a horrible nightmare, a complete shock, it really does suck that this has happened to us.  I agree that Google did not help me at all, there were so many negative things that I found, yet in reality there are truly more positives, breast cancer is treatable, the statistics are in our favour and you are young and otherwise healthy which goes in your favour when facing the surgery and treatment. I also had cells taken from my armpit, originally I was told that they were clear, however during the surgery they had found that it had spread ton one lymph node, the oncologist told me that this was nothing to worry about, it was no big deal in the scheme of things, it was removed and the chemotherapy hopefully kicked anything lingering into touch. Of course this is going to take some getting used to but you will come to terms with this and you will get through the treatment, in fact looking back now it really did go by so quickly! D x",
      "MessageIndex": 6,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72144/just-diagnosed-with-breast-cancer-need-support",
      "Title": "just diagnosed with breast cancer,need support"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi Traci I finished radiation 6 months ago and so, fingers crossed, I have finished the treatment although I am now at the point when I can start to think about reconstruction surgery which is why I came on this forum. I think that the best approach to the treatment is to deal with one thing at a time.  In my case the oncologist waited until after the surgery to tell me the next step in my treatment, I think it depended a little on what he discovered during the surgery itself regarding lymph node involvement. It is important that you are confident in your health care professionals and that you can put your trust in them.  Don't hesitate to ask lots of questions and if you are in any doubt, to seek second or even third opinions. D x",
      "MessageIndex": 10,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72144/just-diagnosed-with-breast-cancer-need-support",
      "Title": "just diagnosed with breast cancer,need support"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi George and Jackie Thank you so much I will definitely look through this.   D x",
      "MessageIndex": 15,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72144/just-diagnosed-with-breast-cancer-need-support",
      "Title": "just diagnosed with breast cancer,need support"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi Traci I am so sorry to hear of your diagnosis, I was diagnosed in November 2013 I was 35.  Its an awful shock to be told that you have breast cancer.   The good thing is that now it has been identified you can get into attack mode and get rid of it.  It helped me a lot to be in touch with other women who had been through or are going through the same thing so it is good that you have found this forum.  You are not alone. Having just been diagnosed I assume that the next step for you is to see an oncologist to discuss your treatment and perhaps you may have further tests and examinations as happened in my case.  Before my meeting I wrote down all of my questions and concerns and I also wrote down all the answers, its good to have someone who will go with you to the appointments as its a lot of information to take in. My treatment lasted just under a year but I can hand on heart say that it has not been the worst year of my life, I was a student in my final year of a fashion degree course when I was diagnosed and in spite of surgery, chemotherapy and radiation treatment I was still able to continue with my course, I only missed one week of lessons during the operation I also continued to run every other morning.  I graduated at the top of my class, won a scholarship for a masters program and won a fashion design contest in China which included a free trip!  All of this is not to brag about my achievements (although it was pretty cool!) but to let you know that it may not feel like it now but life will go on and you will get through this and those special three children of yours will be your strength to beat this. You are in my prayers, I will be thinking of you, don't hesitate to message me for anything at all. Davinia x  ",
      "MessageIndex": 3,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72144/just-diagnosed-with-breast-cancer-need-support",
      "Title": "just diagnosed with breast cancer,need support"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi When I started chemotherapy a friend of mine who had already been through the experience told me that each time she went for her infusion she would look at it, not as the enemy but as a 'healing ray of sunlight', I liked that a lot! This time will pass and it will be behind you so quickly.  From now, going forwards, each day that passes is another day of treatment behind you. Davinia x",
      "MessageIndex": 6,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72105/starting-chemo-today",
      "Title": "Starting Chemo Today"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi Jacky Thank you so much for your response, it is a big reassurance to me, I have the most negative reconstruction oncologist you could imagine and so after meeting with him all felt a bit hopeless!   I have been to my GP today and she is going to refer me to another surgeon, your message makes me feel a lot more confident! I wish you all the best Davinia x",
      "MessageIndex": 11,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71224/deciding-whether-to-have-reconstruction-or-not",
      "Title": "Deciding whether to have reconstruction or not"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi Kiera I just returned from a meeting with my oncologist, I was hoping it was to plan a reconstruction as I am post radiation by 6 months however I have been told I must wait a further 6 months and that my only option is to have the muscle removed from my back and this will be used on top of silicone to create a new shape.  I think this is the same option that has been offered to you? I am feeling so devastated, I had no idea that a reconstruction would involve so many procedures and mean losing an entire back muscle and risking restricted arm and shoulder movement, possibly permanently and back pain.  Sorry don't mean to sound negative, I have been super positive through the whole experience so far!  Losing one boob never bothered me, I was so happy to have the tumour removed but I think I dealt with it so well because I always thought that the one-boob thing was only temporary. Its such a huge decision to make, to go through life being asymmetrical, a little self conscious and not wearing strappy tops, my favourite dresses and bikinis really bothers me but then on the other hand is it worth risking movement in my arm and shoulder for?  And messing around with a perfectly healthy muscle?  I have asked the advice of so many friends and no one can give me an answer!  I guess we wont know until we have done it if it was all worthwhile?!   Like you, I was hoping to benefit from the advice of ladies who have already gone through this reconstruction so it was great to find your post and I am going to be following it in hope that people can shed some light on this!  My oncologist was almost discouraging, telling me that he didn't think a reconstruction would add anything to my life and that its not broken so don't try to fix it. The good news is that we do not need to make a decision immediately, we can take as much time as we need to decide!  In the meantime I am going to see my Doctor and get some recommendations of good surgeons in order to have a second and third opinion.  I would be happy to let you know how it goes! I wish you all the best Davinia x",
      "MessageIndex": 7,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71224/deciding-whether-to-have-reconstruction-or-not",
      "Title": "Deciding whether to have reconstruction or not"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Thanks Happibunny (Great name by the way, I wish I had been more creative now!) Its great to hear from someone who has gone through this procedure.  I live in France, so going to a meeting and talking with women who are sharing this boat is very difficult, so far I can just about manage the basics of the French language so deep conversations are a challenge!  This forum is all I have right now! So you have no regrets having gone through the procedure?  I would really like to know if the reconstruction was tougher than the mastectomy or which was the tougher experience for you?  I know we are all different but it would be good to have some idea so I can weigh up the pros and cons of one boob or two!   I wish you all the best Davinia x",
      "MessageIndex": 12,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71224/deciding-whether-to-have-reconstruction-or-not",
      "Title": "Deciding whether to have reconstruction or not"
    },
    {
      "AuthorID": "DaviniaV",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/daviniav",
      "Content": "Hi Kiera  Thanks for getting back to me.  I will definitely let you know what happens next.  I have an appointment at another clinic on the 22nd March and will make a decision after this.  I understand your decision and I to am leaning this way.  I do have one question, does the adhesive prosthetic stay in place?  I would be so scared of dancing around and it suddenly falling off! I will be in touch after the appointment in March! D x",
      "MessageIndex": 15,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71224/deciding-whether-to-have-reconstruction-or-not",
      "Title": "Deciding whether to have reconstruction or not"
    }
  ]
}