{
  "AuthorID": "DawnGreen",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dawngreen",
  "Posts": [
    {
      "AuthorID": "DawnGreen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dawngreen",
      "Content": "Hi All I have just picked up this tread on Tamoxofen and Radiotherepy.  I decided early on that I wouldn't read too much about Tamoxofen and the side effects. I have been having hot flushes since I finished my chemo so I'm hopping that they don't get any worse when I start Tamoxofen middle of Feb. At night I just throw off the quilt and then pull it back over when I feel cold I can cope with it at the moment. I have had my simulation ready for Radiotherepy which I start next Monday for 5 weeks, that I'm not looking forward to. I'm greatful for all the information that everyone has given and will be taking some of the advise and like me everyone has a positive attitude.  I have begun exercising again I go swimming twice a week and go for long walks (weather permitting). Jules - you seem to be at the same stage as me with regards to hair regrowth and how exiting it is. I hadn't thought about the olive oil but when I have a shower I always wash my head with sampoo and then massage my head with the conditioner, I don't know if this has helped but I always feel good and relaxed after and my hair is now growing. Good luck to everyone with whatever stage of treatment they are at. Happy and Healthy New Year to everyone. Dawn  ",
      "MessageIndex": 31,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23712/tamoxifen-it-sounds-awful-is-it-really-that-bad",
      "Title": "Tamoxifen It Sounds Awful Is it Really That Bad?"
    },
    {
      "AuthorID": "DawnGreen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dawngreen",
      "Content": "Hi Tess, my burns have been very sever and I have brilliant care from the radio therapy team nurse at my hospital. I have had to visit them every other day and they have applied intrasite dressing covered that with nu-gel then put a meliplex dressing over the top. My Husband has done the same in the evenings and on the day that I don't see the nurse. My burns are now healing really well and have just been told that they don't need to see me until next Wednesday, they have supplied me with all the dressings I should need and have given me a contact number should I need anything. I agree with you about the pain and same as you mine didn't occure until the last few days of treatment when I thought I was at the end. Still lets keep smiling we really are at the end. No side effects from the Tomoxifen yet lets hope it stays that way. I'm just looking forward to going back to work on the 16th March as I have been off for 8 months I wasn't allowed to work during treatment as I am a Higher Level Teaching Assistant and would come into contact with too many germs. Can't wait to get back. Hope all goes well for you. Dawn :)  ",
      "MessageIndex": 63,
      "PostDate": "03/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23712/tamoxifen-it-sounds-awful-is-it-really-that-bad",
      "Title": "Tamoxifen It Sounds Awful Is it Really That Bad?"
    },
    {
      "AuthorID": "DawnGreen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dawngreen",
      "Content": "Hi Everyone   Been a while since I was on the site. I finished 5 weeks of radiotherapy on 19th Feb was told to wait a week before starting to take the tomoxifen as my body was still radiating. How true I'm suffering with really bad burns and am back under the care of the hospital every otherday for then to treat them. Did anyone else have this problem? I has cheered me up to hear no-one seems to have any side effects everyone I know whos taking it have not problem at all. Lets hope its the same for us all. I don't manage to get on the site very often but will try and keep up with how everyone is and let you all know how I'm doing. With regard to keeping the weight down, eat sensibly and excercise when you feel up to it. Remember you are in control. Hope to hear from you all soon Dawn",
      "MessageIndex": 57,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23712/tamoxifen-it-sounds-awful-is-it-really-that-bad",
      "Title": "Tamoxifen It Sounds Awful Is it Really That Bad?"
    }
  ]
}