{
  "AuthorID": "Destinia",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/destinia",
  "Posts": [
    {
      "AuthorID": "Destinia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/destinia",
      "Content": "Hello Jayne and Fiona! You certainly have a lot more information than I had at the time and, of course, I'm writing from hindsight ...although I think that if I'd had (five years ago) the knowledge you have I might have looked into it further. My surgery was also very different as there were no lymph node tests before the final surgery.  It was explained to me beforehand that some nodes would be removed during surgery and sent for immediate testing before they decided how many would be removed in total while I was on the table.  So really the decision was taken out of my hands.  I later had about an hour's 'training', with others, in using the exercises to retain and regain shoulder and arm movement and I was given an elastic sleeve. However, I can give you some insight into what's happened since.  (I have been a bit circumspect in the past as I didn't want to frighten anybody.)  Since the surgery I cannot lift my arm above my head and sideways movement is also very limited.  I kept the lymphedema in check by wearing the sleeve all the time.  But a year ago I got a mosquito bite on the wrist of that arm, the bite became infected, the arm swelled up to ridiculous proportions (to perhaps seven or eight times its usual size) and I felt really ill.  I went to the hospital, where they elevated and drained my arm, pumped me full of antibiotics and lathered lotion all over my arm to stop the skin shedding.  It was then discovered that the extra weight of my arm had torn my shoulder muscles and I now have a 'dropped shoulder' ...but nothing can be done.  I also have steroid injections every six weeks or so to relieve the pain in my shoulder and movement is even more restricted. Although I have formed ways and methods to deal with the large Velcro sleeve which I now wear and with the restricted movement, I can no longer drive (I can't bend my arm to hold the steering wheel) and had to change my job.  (Luckily I work in a field which allowed me to do this.)  Other annoyances include not being able to shampoo my hair properly, not being able to do anything on the floor because it's difficult to get up again using only one arm and not being able to use the top cupboards in the kitchen except for lightweight things.  Getting in and out of a car is also a mission, I don't go anywhere where there are crowds just in case I get jostled and I sleep sitting up. I don't want to unduly influence anyone at all ...it's an individual decision.  But if I'd had the information you have and had an inkling of what could happen would I take that decision really seriously and expect answers to my questions?  You bet I would.  I know it's very difficult at the time - having been told that you have \"the big C\" is frightening enough and thinking clearly isn't easy but it would be great if every patient was given the full 'before-and-after' information before anything was done. And given what I know now would I have had the lymph nodes removed?  I honestly don't know.  Having them removed has definitely spoiled my life, but would I have survived if I'd kept them?  If given the choice I have the feeling that I would have said that I wanted to  keep them. All the best to you in your decision and my best wishes for the future. Dee.",
      "MessageIndex": 20,
      "PostDate": "06/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Destinia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/destinia",
      "Content": "Hello, pleased to meet you! Thank you for the advice, I wish I'd had the support you had, although I did have an elastic sleeve which I wore when I was at work. Unfortunately, my arm ballooned with fluid last year after I had a mosquito bite on my wrist which became infected, it was then that the weight of the fluid in my arm tore the muscles in my shoulder.  Since that time I have worn the heavier sleeve with the Velcro straps, which I tighten as the fluid works it's way back up my arm.  (My shoulder is where the pain comes from, I have an injection every six weeks which helps with that - I can't have repair surgery as any further 'ballooning' would destroy all the good work.)  Incidentally, and this is going to sound really odd, the best thing I've found to move the fluid when not wearing my Velcro contraption is a set of steps!  The steps have a bar at the top that is just the right height to reach up to and hold when I'm sitting on the sofa ...after an hour or so much of the fluid has drained back by gravity. I don't know if anyone will be interested in my other items of self-help.  One is a soft toilet roll which I tuck in my armpit to lift my shoulder to help with the shoulder pain, the other a tennis ball in a sock which I place behind my shoulder and rub against the kitchen door as a form of massage. They say that desperation is the mother of invention! But I'll definitely insist on seeing an MLD person, it would be great to be able to go back to the elastic sleeve, firstly to be able to drive again, secondly to be able to wear short sleeves without everybody asking me what I've done to my arm!  I'll also let you know how I get on ...and thank you so much for your interest and advice, it's such a help.",
      "MessageIndex": 13,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Destinia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/destinia",
      "Content": "Hello Kacang and everybody else. I am in tears as I write this, I'm so sorry for you all and wish I could give you a big hug.  Something which I have suspected for some time appears to be correct ...the surgeons have their way of doing things and are so important that the support and nursing staff (who know all about the dreadful things that can happen following surgery), and the patients, play a secondary role and are not listened to. The effects seem to be so varied following lymph node removal. You are right Kacang, do not take no for an answer.  As I said earlier in the piece, I wish I'd known enough about the surgery to ask more questions about lymph node removal. I also hope that the new cancer-fighting drugs prove to be as effective as they seem. When I was going through the surgery, chemotherapy and radiation therapy I couldn't help thinking that there must be a better way.  I know that the new drugs are very expensive, but when you think what a radiation therapy machine must cost to buy and run, as well all of the other costs for the current anti-cancer treatments, to have a drug-based regime must be better than going through major surgery and the after-effects. All of my best to you all, keep your chins up and do the best for yourselves ...you're worth it. Dee.",
      "MessageIndex": 16,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Destinia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/destinia",
      "Content": "Hello All! As someone who went through the whole gamut of treatment five years ago (breast removal surgery including lymph node removal, reconstruction, chemotherapy and radiotherapy) I wish I'd known the full story as far as lymph node removal is concerned.  Now I have severe arm lymphoedema for which I wear a large contraption of elastic with Velcro straps and the weight of the swollen arm has caused a torn shoulder muscle and a dropped shoulder.  As well as having restricted shoulder and arm movement, this is painful ...but there is no real treatment for any of it. If I had known any of this was likely to happen I would have asked questions, particularly about other options.  So I urge anyone going through the process to put yourself forward and find out all that you can. All of my best wishes to all of you. Dee.",
      "MessageIndex": 11,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    }
  ]
}