{
  "AuthorID": "DeusEx",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/deusex",
  "Posts": [{
    "AuthorID": "DeusEx",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/deusex",
    "Content": "This isn't really specific to breast cancer, so you might want to ask on the Chemotherapy group as well - there's a few people there talking about PICC lines.  I've had one because I had a bad reaction to oxaliplatin. It wasn't painful to insert but it took two attempts. They applied a local anaesthetic cream to my arm for a while before the insertion itself, which is similar to an injection. They did have difficulty getting it into the vein on the first attempt, so they used a heat pad on my arm to dilate the veins and gave me a mild sedative (half a lorazepam) to help me relax, and tried again after half an hour. The second attempt was easy. Then you get a chest x-ray to make sure the tip of the line is in the correct place - this is very important as it's going into the main vein leading into your heart.  I didn't get any problems with infection. I was able to use a waterproof cast protector from Limbo to shower with it, but baths weren't allowed. I had a district nurse come out to flush the line every week when it wasn't being used - this is just pushing sterile saline solution to keep the line open. It didn't really cause me any trouble and not having to worry about getting chemotherapy was great. I only had it for a couple of months. Getting it removed was very easy - they just pull it out and stick a plaster on you.  I never could persuade anyone to take blood through my PICC though - they still wanted to use needles, which was a shame as I'd hoped it would spare me that. Hope this is helpful!",
    "MessageIndex": 1,
    "PostDate": "14/10/2014",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84328/picc-lines",
    "Title": "picc lines"
  }]
}