{
  "AuthorID": "Diamonds",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/diamonds",
  "Posts": [
    {
      "AuthorID": "Diamonds",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/diamonds",
      "Content": "Hi sandmouse, I was put on Tamoxifen April 2010 after being diagnosed bc, this was to try and shrink 3cm tumor. Was still having periods, did not notice much change with being on Tamoxifen + also taking Fluxetine. Op WLE Dec 2010. Good prog. clear 5 glands/and margin, tumor downgraded 3 to 2 still offered Chemo which I refused, instead will take Zoladex injection every 4 wks, started in  Jan 2010 and also had Radio Feb/Mar 2010. Periods stopped right away! Then Hot flushes, awful, sweats pouring from face/neck flare up anytime of day, have not had a nights sleep since on Zoladex.  Mentioned this after Radio treatment finished, doctor said 1st few months on Zoladex is the worst.  Still getting sweats throught day/night skin clammy,  is it the combination of drugs ie Tamoxifen/Fluxetine/Zoladex, have also noticed more joint pain in top of legs and also hands, spoke with nurse on Fri 17th June (admin Zoladex) either I am putting on increased weight or retaining fluid, have also noticed more pain  in legs (calfs) swollen/very dry skin.   Will be seeing Onc in July to discuss op re having ovaries removed or staying with Zoladex, I do not know what to do, I get fed up taking all these drugs, but what is the alternative?  .We have just got to get on with it and soldier on!",
      "MessageIndex": 5,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39075/zoladex-tamoxifen",
      "Title": "Zoladex & Tamoxifen"
    },
    {
      "AuthorID": "Diamonds",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/diamonds",
      "Content": "Hi Mandy, I will let you know how I get on at my next Onc appointment re staying on Zoladex or getting my ovaries removed.  Did you know that a single Zoladex injection costs about £400 (but we are worth it) and if not more.  It will be interesting to see what Onc/Gp will advise in July,  maybe removing ovaries would be more cost effective re strapped NHS! I am worried like you, its not a nice prospect getting that jab every 4wks for two years and then going through the menapause naturally, when they want you to be oestregen free now and forever! Anyway, you look after yourself !    ",
      "MessageIndex": 7,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39075/zoladex-tamoxifen",
      "Title": "Zoladex & Tamoxifen"
    },
    {
      "AuthorID": "Diamonds",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/diamonds",
      "Content": "Hi Jane This was a very hard decision to make, I can be quite stubborn, but I based it on my the results after my op. ie (not spread to glands) I was offered chemo due to size of tumour, although surgeon told me I had gone from 10% life in the next 10 years to 85%, but by taking chemo and radio I would get another 6%., I asked surgeon & bcn what they would do, they could not advise me what to do, it had to be my decision. I did meet the Onc who offered 6 doses of FEC and to me there were more pros than cons ( I could get leukemia) and my onc said out of 15 people that get chemo, only one will benefit., he was not selling it to me.  The alternative was Zoladex inj every 4 wks for 2 yrs, i did not want that either.  So I refused them all. My BCN contacted me and said I should remember what the surgeon said, which was, microscopicaly they cannot tell that it has spread! I asked if I took chemo could it still comeback? they answered (yes). I had a week to decide what to do,  it was upsetting, I asked my husband and girls what to do also friends etc I refused chemo and opted for Zoladex apparantly they use this method a lot in Europe (Germany,Austria). I do not like it, but its to eliminate oestrogen and I get 2% more life! and a gradule menapause as opposed to remove ovaries and have it full on. Only two professional people think I have made the right decision, my GP who I had never met, and a Radiotherapy Doctor/Expert. Its a very hard decision to make you are young, you may want to blast it with everything or take a chance like me.  I remember now my BCN words  when I was first diagnosed (we cannot cure it we can only treat it)  Chemo is toxic! but I am taking chemo drugs (Tam/Zola) if your prog. is good and you have got a good % life go with your instinct its your body and your life!  Be positive with whatever you decide! GOOD LUCK XX  ",
      "MessageIndex": 9,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39075/zoladex-tamoxifen",
      "Title": "Zoladex & Tamoxifen"
    }
  ]
}