{
  "AuthorID": "Diddy23",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/diddy23",
  "Posts": [{
    "AuthorID": "Diddy23",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/diddy23",
    "Content": "Hi Stormy I empathise with your feelings. I had left mastectomy in March and my remaining breast is GG cup so also very lopsided. I'm learning to live with my new body but I can't say that I love it yet. I wasn't able to have reconstruction as I'm going to have radiotherapy after the chemo that I'm currently having. I have agonised over what to do and am leaning towards not having any reconstruction, but possibly reduction or maybe another mastectomy. I realise that its very early days still and its quite possible that I'll be able to learn to live with my right breast as it is and wearing a prosthesis if I fell like it, or just going lopsided. Problem for us larger breasted women is that the remaining breast needs a bit of support. I'm going for my NHS prothesis fitting next week so it will be good to see what they can offer.  At the moment I'm wearing a mastectomy bra with a Knitted Knocker prosthesis. This has been a godsend as its made from very soft cotton and is light - sometimes too light as it does ride up a bit! I can thoroughly  recommend it and anyone can order one from the Knitted Knockers website - its a charity run by volunteers and they will send you one or a pair for free. The other thing that has helped me is a Facebook group called Flat Friends which is a closed group (they also have a public group) for those who haven't had reconstruction - whether they have decided not to at all, or are thinking about it. It's so supportive and a mine of very helpful information about all aspects of breast cancer.  Hopefully in a few months you'll be feeling physically and emotionally better about the mastectomy. I'm still grieving my breast and have good and bad days, but I do feel a bit more positive now. Love xx",
    "MessageIndex": 14,
    "PostDate": "11/05/2016",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108078/had-left-sided-masectomy-last-week-so-sad-today",
    "Title": "had left sided masectomy last week, so sad today"
  }]
}