{
  "AuthorID": "Dignan",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dignan-",
  "Posts": [
    {
      "AuthorID": "Dignan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dignan-",
      "Content": "Hi  I’m very new to this forum. Apologies for the long post ! I was diagnosed 23 May with triple negative invasive ductal left side BC (no genetic cause). The size is estimated to be around 5cm but its not clear on any of the scans . The tumour seems to extend from the front (I can see it in the mirror) to very far back towards the chest wall.  Before the mri, ct and Pet scans my surgeon was going to give me a double mastectomy in July. But following all the test and scan results he and the oncologist decided to do chemo first to shrink it so the surgeon would be able to see a defined perimeter to the tumour. This is not to conserve the breast as I’m adamant I want  both completely removed and the surgeon agrees because the right side has calcification and both sides have huge numbers of cysts some of which are over 2cm and very painful . In June I had the sentinel node operation which came back clear but the mri and  pet scans showed 2 internal mammary nodes are affected but I don’t know what this means or how significant it is. Has anyone else had this on their scans ? I feel a bit unnerved that these nodes can’t be removed as you would do with the underarm nodes but my husband thinks they will be dealt with by the chemo and radiotherapy . i have had 3 rounds of EC and my 4th is next week. After that it’s 12 weekly taxols.  Early on The surgeon said he intends for me to reach my 80’s (we have a lighthearted relationship) but I haven’t actually asked him if my type of bc is likely to return. so after rambling on - has anyone else had their internal mammary nodes affected? thank you for reading my post ",
      "MessageIndex": 0,
      "PostDate": "22/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166638/internal-mammary-nodes---can-they-be-removed",
      "Title": "Internal Mammary Nodes - can they be removed ?"
    },
    {
      "AuthorID": "Dignan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dignan-",
      "Content": "Thank you so much for attaching the diagram it’s really helpful for me to visualise where the nodes are. I have 2 prominent internal mammary chain nodes affected which are near to where the tumour is - just below my left nipple. I don’t know very much more than that but I will ask at my appointment on 4 sept . I just want to fully understand the significance of these nodes. I get pains in the centre of my chest and I wonder if it’s my sternum but it could well be discomfort from the ",
      "MessageIndex": 2,
      "PostDate": "22/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166638/internal-mammary-nodes---can-they-be-removed",
      "Title": "Internal Mammary Nodes - can they be removed ?"
    },
    {
      "AuthorID": "Dignan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dignan-",
      "Content": "Sorry - hard to type on an iPhone ! it could be discomfort from the power port .  Thanks again for the lymphatic system diagram - it will help me ask the right questions at the appointment  x",
      "MessageIndex": 3,
      "PostDate": "22/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166638/internal-mammary-nodes---can-they-be-removed",
      "Title": "Internal Mammary Nodes - can they be removed ?"
    }
  ]
}