{
  "AuthorID": "dippydaisy",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dippydaisy",
  "Posts": [
    {
      "AuthorID": "dippydaisy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dippydaisy",
      "Content": "Hi Emma, I'm on the chemo stage at the moment. I had my first session of FEC on Thursday 24th August. I've got 2 more FECs then 3 lots of T to go. Then radiotherapy. How about you? Helen xx",
      "MessageIndex": 17,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137094/choosing-not-to-have-axillary-node-clearance",
      "Title": "Choosing not to have axillary node clearance"
    },
    {
      "AuthorID": "dippydaisy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dippydaisy",
      "Content": "Hi I'm in a similar position in terms of diagnosis. Following bilateral surgery and sentinel node biopsy it was found I had one positive node \"with macrometastases and extra capsular involvement\". Only 3 nodes were removed. I'm on the POSNOC trial and have been randomised to no treatment so there will be no further intervention to my lymph nodes. If I'd been randomised to the other arm of the study my options would be axillary node clearance or radiotherapy to the armpit.  I'm a bit confused about the extra capsular bit - it wasn't mentioned in my results appointment at all and I only spotted it in a letter to my GP which I'd been copied in on. I'm having chemo at the moment and hoping this will sort my lymph nodes out too.  I'm wondering if I should withdraw from trial and opt for radiotherapy but I'm not sure it's an option.  Good luck with your decision- I feel I'm making decisions that have horribly real implications for my future without all the facts. Hugs  Helen xx",
      "MessageIndex": 3,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137094/choosing-not-to-have-axillary-node-clearance",
      "Title": "Choosing not to have axillary node clearance"
    },
    {
      "AuthorID": "dippydaisy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dippydaisy",
      "Content": "Hi Suzi POSNOC is positive sentinel node adjuvant therapy alone versus adjuvant therapy plus clearance or axillary radiotherapy (catchy title!)  My understanding is that they feel they are overtreating younger women with only one node involved and consequently causing unnecessary lymphoedema etc.  I'm being treated at Royal united hospital in Bath but it's a national multi centre trial so should be available all over the country.  You are correct- you and your treatment team have no choice over which arm you are randomised too it's all done my computer.  Hope that helps Helen xx",
      "MessageIndex": 6,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137094/choosing-not-to-have-axillary-node-clearance",
      "Title": "Choosing not to have axillary node clearance"
    },
    {
      "AuthorID": "dippydaisy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dippydaisy",
      "Content": "Hi Emma, Hope the additional surgery goes well. I'll still be having chemo up until Christmas and radiotherapy after that. My ancient mother in law is there too at the moment so I know what you mean about a second home!!  Give me a shout sometime when you are in RUH perhaps we can go for a cuppa if you fancy it?  Helen xx",
      "MessageIndex": 23,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137094/choosing-not-to-have-axillary-node-clearance",
      "Title": "Choosing not to have axillary node clearance"
    },
    {
      "AuthorID": "dippydaisy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dippydaisy",
      "Content": "Hi Maz I'm 46, so a little bit older than you.  I wasn't expecting to have chemo from my earlier appointments - I'm not very happy about it but feel under a lot of pressure to do whatever I can to make sure I'm around for my kids (they are 10 & 12) for many years to come.  Hope Friday goes well Helen x",
      "MessageIndex": 11,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133210/metastatic-lymph-node",
      "Title": "Metastatic lymph node?"
    },
    {
      "AuthorID": "dippydaisy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dippydaisy",
      "Content": "Hi Maz73 It sounds like we have the same diagnosis at the roughly the same time - I've been freaking out over exactly the same thing metatastic lymph node!  I'm 2 weeks post bilateral surgery and have been told I need chemo too now but my oncology appointment isn't until 8th August which feels like forever away.  What have you been told about your other nodes? I've been told there's a clinical trial (something like POSNOCT, can't remember exact name) which is looking at treatment of positive nodes in younger women. I don't know if your treatment centre are part of the study but it might be worth a ask  Hope everything is going well with the house move preparation  Helen x",
      "MessageIndex": 7,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133210/metastatic-lymph-node",
      "Title": "Metastatic lymph node?"
    }
  ]
}