{
  "AuthorID": "Dixsey",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dixsey",
  "Posts": [
    {
      "AuthorID": "Dixsey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dixsey",
      "Content": "Thanks Leolady for your reply, I did read your interesting  profile. it may be that I dodged a bullet, not getting chemo/Herceptin, time will tell. The oncologist just referred me to Predict Tool, only a 3% uplift with Chemo and said for me risks outweighed benefits. The BC nurse said 'lobular doesn't respond as well to chemo' which I think is somewhat simplistic. To be honest IF I had been offered Chemo/Herceptin I would not have hesitated, for fear of reoccurrence. Interesting what you say about 'no longer beating yourself up...' You have hit the nail on the head, I am beating myself up for not pursuing a second opinion re chemo and imaging every twinge to be reoccurrence. Plus a fair amount of anger of being denied chemo. Nuts isn't it, all those ladies braving dangerous and unpleasant SE's on the chemo threads, here I am dwelling on 'imagined consequences of under treatment'.  Best wishes",
      "MessageIndex": 2,
      "PostDate": "03/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174127/lobular-breast-cancer-er-and-her2-pos",
      "Title": "Lobular breast cancer, ER and Her2 Pos"
    },
    {
      "AuthorID": "Dixsey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dixsey",
      "Content": "Dear Jac, Thanks for your reply, especially glad to hear all good with your one year check, such a relief for you and your family I did raise my fears of being denied chemo during my radiotherapy , I saw an absolutely lovely GP (doing sessions in RT, checking all ok) I voiced my concerns, asked her to write it in my notes, she listened and said to me 'but your cancer has been removed,'  Then at the end of RT I had an appt with the oncologist. This was not a good consult, his body language was almost of losing patience with me and trotting out of the Predict Tool again. I have become obsessive with reading scientific papers on lobular BC, not many are ER and HER 2 Pos. I did find one presentation at the 2018 San Antonio Conference, the conclusion being - 'there is a small sub group of Her 2 Pos, ER pos, lobular BC that may not benefit from chemo/targeted therapy' I tell myself I am in that group, I will be having my one year check in May/June, I hope to see my surgeon who was brilliant. The other pertinent fact in my case is that Her2 Pos are not offered Oncotype test, it is not validated for Her 2 Pos and not relevant. Oncotype is another useful tool for oncologists to use when considering adjacent treatment. As you can see I talk myself in and out of positive/negative thoughts. I need to stop reading and get out more! Thanks for listening it helps! Best wishes",
      "MessageIndex": 6,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174127/lobular-breast-cancer-er-and-her2-pos",
      "Title": "Lobular breast cancer, ER and Her2 Pos"
    },
    {
      "AuthorID": "Dixsey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dixsey",
      "Content": "Thanks Lindsay",
      "MessageIndex": 7,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174127/lobular-breast-cancer-er-and-her2-pos",
      "Title": "Lobular breast cancer, ER and Her2 Pos"
    },
    {
      "AuthorID": "Dixsey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dixsey",
      "Content": "Thanks, I have seen that thread, walking is a marvellous therapy. I live in Devon, between the moor and the coast path; so not near Bucks otherwise I would gladly join you.  Good walking",
      "MessageIndex": 9,
      "PostDate": "04/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174127/lobular-breast-cancer-er-and-her2-pos",
      "Title": "Lobular breast cancer, ER and Her2 Pos"
    },
    {
      "AuthorID": "Dixsey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dixsey",
      "Content": "Hello are there any ladies out there with lobular BC that is ER and Her 2 pos? Furthermore any who were NOT offered Chemo. many thanks P",
      "MessageIndex": 0,
      "PostDate": "03/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174127/lobular-breast-cancer-er-and-her2-pos",
      "Title": "Lobular breast cancer, ER and Her2 Pos"
    }
  ]
}