{
  "AuthorID": "DJ79",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dj79",
  "Posts": [
    {
      "AuthorID": "DJ79",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dj79",
      "Content": "In the interests of variety, and to clarify the motive/attitude of a 'shaver' who has since become a cancer patient (complete with chemo related baldness) I would like to offer an alternative viewpoint. Yes, I shaved my head to raise money for Macmillan. I didn't do it because I thought it was big or clever. I've had many relatives and friends who have experienced cancer, some have been cured and others haven't been so lucky, but Macmillan have helped many of them. When I shaved my head, I asked those I knew who were being treated for cancer or had been in the past what they thought- they were not offended, and the friends I had who were bald from chemo at the time said they saw it as a gesture of support. I didn't have it done in the pub being cheered on, but at a hairdressers (I had it done professionally in order to have as much as possible to send to the little princess trust). If you had looked into my eyes you would not have seen devastation or sadness, I felt neither, I just sat there til it was done and then went about my normal business (the salon added a large donation even though I politely declined their request for publicity photos). Not long after my hair grew back I was diagnosed with myeloma (incurable, rare and only supposed to happen to older people - I was 36). I knew the treatment would make my hair fall out - of the many consequences of that diagnosis, hair loss was the least significant to me. When I arrived at the point of baldness, it was still a side effect I found insignificant- the other side effects were much worse, even though many of them lasted a much shorter time. The ONLY issue I had about having no hair, was being made to feel that I should care about it when I didn't! I was offered a wig several times, offered counselling when I had what was left shaved off and asked if I was ok with my altered appearance or did I want to see a therapist. I appreciate that hair loss is a big deal for some, and I am sympathetic to anyone who finds this distressing, but I would be grateful if there was a similar amount of support for those of us who don't worry about being bald and don't like being made to feel we should.  As I will now have cycles of remission and treatment every few years (if I'm lucky), I don't want to spend one year in every few being told to care about being bald and I'm not at all upset by shaved heads (either for charity or by the many people who do this regularly as they prefer their appearance that way). If anyone wants to shave their head to raise money for Macmillan- thanks, you're helping fund the specialist nurse who has made this experience a lot better than it would otherwise have been. If anyone wants to shave their head to raise money for myeloma uk- thanks, you might be paying for the drug that means this cancer is no longer incurable. People who do things to shout 'look at me' will always do just that. Is it any better/worse if they leap out of a plane or run a marathon? They won't have a bald head, but if they're the unlucky person with a faulty parachute or who has a cardiac arrest at mile 23 they will create a lot of guilt for those who sponsored them. And some of us did it without shouting about it, but just sent a large cheque to Macmillan afterwards. Everyone is entitled to an opinion, I just wanted to show the other side. If someone could explain why after chemo Mother Nature thinks it's funny to make buying razors for leg shaving necessary several weeks before shampoo is required I'd be very grateful- hairy legs and a bald head?!? I was NOT amused!",
      "MessageIndex": 270,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "DJ79",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dj79",
      "Content": "Hi Jess In the interests of balance, I offer my views as both a 'shaver' and a cancer patient. I had my head shaved in August last year, and sent my hair to the Little Princess Trust. I raised over £1000 for Macmillan, and the was no harassment required to gain sponsorship. I decided to have my head shaved as I had a few friends who had lost their hair as a result of chemotherapy, I asked them what they though before I did it and they were all very supportive- one even thanked me for removing attention from her lack of hair when we went out! My hair grew back pretty quickly and was starting to look how I wanted it, and then in October I was diagnosed with Myeloma. The initial treatment made my hair thin, but the high dose chemotherapy and stem cell procedure made me completely bald.  When my hair started falling out in handfuls I asked the ward staff to shave off what was left. The nurse I spoke to suggested I might want some counselling and maybe a wig - I know she was trying to be kind, but she didn't seem to understand when I said 'thanks but no thanks'. I can appreciate that hair loss is significant to some people, but please don't put us all in together! (& having myeloma at 36, a bald head was the least of my worries!). In the end, in order to demonstrate my point, I directed the nurse's attention to the television- I was watching the Invictus Games (I had nursed some of the athletes whilst on tour in Afghanistan). I asked her why she thought I should be upset about my hair falling out - it was highly likely to grow back, and even if it didn't it is not essential to life. If people can lose limbs that will never grow back and go on to live very fulfilled lives, I won't worry about being bald and will try and follow their example. Having lost my hair to chemotherapy I remain in complete support of 'brave the shave' and don't find it at all offensive. Before I get pounced upon for feeling differently to some of the people who have posted previously, this is an entirely personal perspective and I don't expect everyone else to be the same. I do however think it's important to offer some positive feedback to the hardworking team at Macmillan for their efforts. Thank you",
      "MessageIndex": 258,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    }
  ]
}