{
  "AuthorID": "Dolly Mixture 2011",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dolly-mixture-2011",
  "Posts": [
    {
      "AuthorID": "Dolly Mixture 2011",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dolly-mixture-2011",
      "Content": "Hi I had my surgery on the 10th July and have the same diagnosis as you.  I have my first session of chemotherapy on the 21st August (FEC-T) - 6 sessions due my next one on the 11th September.  Within an hour of my first treatment I felt sick (but was only sick a few times (tablets are given to ease this) couldn't  face food, heartburn and sleepless nights,  after the first few days was ready to give up didn't think I could face it but it does get better and everybody has different side effects, over the last few days everything has gone back to normal and I am feeling good, no hair loss as yet but have been told to expect it.   There is no need to face this alone, there is lots of support on here anytime you may need it. Kath X",
      "MessageIndex": 3,
      "PostDate": "01/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64227/feeling-sad-and-alone",
      "Title": "Feeling sad and alone :("
    },
    {
      "AuthorID": "Dolly Mixture 2011",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dolly-mixture-2011",
      "Content": "I was diagnosed with breast cancer in June, had lumpectomy with clear margins in July and started my chemo in August 6 of Fec T.  I had my 4th chemo session on the 22nd October (Taxotere) and ended up spending 5 days in hospital with Neutropenia (Low White blood cell count).  About 4 days after Tax got a sore throat and on the 7th day still had sore through even though i had been taking antibiotics, got a rash on my chest and all in between my fingers which started to blister, apparently this was a reaction to the Tax, doctor told me it was an allergy to penicillen (how wrong was he).  What I really want to know is has anybody had this side effect and how did the Tax go for you, I am having my 5th Tax tomorrow after it being put back for a week and my 6th and final one on the 11th December. Kath x",
      "MessageIndex": 0,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67336/2nd-taxotere-tomorow",
      "Title": "2nd Taxotere tomorow"
    },
    {
      "AuthorID": "Dolly Mixture 2011",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dolly-mixture-2011",
      "Content": "Hi Sainikb Just reading through your list and agree with most of it, one thing I don't get is why you can't drink bottled water, that's all I have been drinking and about to have my 4th chemo.  Do you know why you can't drink it, and I thought if you were having chemotherapy you can have a flu jab, I have mine booked in for next week , Thanks x",
      "MessageIndex": 2,
      "PostDate": "06/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65590/lists---what-do-i-need",
      "Title": "Lists - what do I need???"
    }
  ]
}