{
  "AuthorID": "Donna71",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
  "Posts": [
    {
      "AuthorID": "Donna71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
      "Content": "HI, I have been taking tamoxifen for 4 months now and the most common side effect and the one I have the most is the hot flushes they happen a lot . Also I have some muscle pain in my arms but that's it. I have heard through doctors and others the manufacturer of the brand has a lot to do with the side effects. I use workhart brand and believe they are the ones with the least side effects. They all have the common hot flush side effects. Hoping it calms down soon the more it gets into my body. I had lobular cancer and had chemo and mastectomy and rads so some of the muscle pain may be from that but it didn't start happening until I started taking tamoxifen. All the best to you take care and hope you get on ok with it if not change brand x",
      "MessageIndex": 1,
      "PostDate": "12/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85726/tamoxifen---discuss",
      "Title": "Tamoxifen - Discuss"
    },
    {
      "AuthorID": "Donna71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
      "Content": "The anxiety of having my first follow up yearly mammogram and scan is now over. I have never felt so much stress going in its such a scary feeling. I'm happy to say that it all came back clear. I don't think the anxiety will ever go away fully or will it ?? Early days being thankful it has still not reared it's ugly head and move on ..onwards and upwards",
      "MessageIndex": 0,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99734/relieved-after-results",
      "Title": "Relieved after results"
    },
    {
      "AuthorID": "Donna71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
      "Content": "Your nurse will give you a hug don't you worry you have been through so much. It's your choice and your body you do what is right for you and the advice from your doctors. I wanted both taken off but they would only take the one with the tumor so I have the anxiety of the other one being affected but they said that was very rare. But I know I done the right thing. X",
      "MessageIndex": 3,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83696/last-chemo",
      "Title": "last chemo,"
    },
    {
      "AuthorID": "Donna71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
      "Content": "I was the same now I don't care about my hair and it's grew back very thick and curly. I have chosen not to have re construction as I was told my type of cancer could be hidden behind the implant. I'm quite happy with my prosthesis which to be honest I don't wear very often. I am adjusting to life without a boob I really don't think I could go through another big op. Will be thinking of you today x",
      "MessageIndex": 7,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83696/last-chemo",
      "Title": "last chemo,"
    },
    {
      "AuthorID": "Donna71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
      "Content": "Well done !! Your emotions will be all over the place especially tomorrow when it's finished. Hope someone's there to give you a great big hug aand as I remember after I finished mine I screamed yes I did it and cried like a baby. Now I have had a mastectomy and radiotherapy and still have days I can't believe what I have went through. So congrats and I wish you well xx",
      "MessageIndex": 1,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83696/last-chemo",
      "Title": "last chemo,"
    },
    {
      "AuthorID": "Donna71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
      "Content": "I started taking my tamoxifen during radiotherapy the radiographers told me too. I started radiotherapy 6 weeks after. Congrats on finishing chemo . I was so emotional after my last one and now everything has finished it has took me since July to get back into a daily normal routine Take your time one day at a time you will get there. All the best and take care xx",
      "MessageIndex": 5,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83679/after-chemo",
      "Title": "after chemo"
    },
    {
      "AuthorID": "Donna71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
      "Content": "The 5th chemo I remember it well. I had a breakdown in my doctors office and she said to me \" it's your 5th isn't it\" she said the chemo seems to peak at number 5 the pain everything is just awful I always told myself tomorrow will be a better day. All the best and take care it will get better xx",
      "MessageIndex": 5,
      "PostDate": "05/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87820/5th-chemo-vile",
      "Title": "5th chemo..vile"
    },
    {
      "AuthorID": "Donna71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/donna71",
      "Content": "Wishing you strength and fight the fight and keep strong in your mind. If you can a little advice which you probably will get a lot of is listen to your body rest when it tells you too. The nausea pills they give u and mouth wash I would advise to use this before each chemo just in case I found prevention better than dealing with certain things.  Keep strong and you will do just fine we find an inner strength from somewhere.  Big hugs xx",
      "MessageIndex": 2,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90562/starting-fec-t-today",
      "Title": "Starting FEC T today"
    }
  ]
}