{
  "AuthorID": "dorothy1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
  "Posts": [
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi, I also use the Plantur range, try Superdrug I find its cheaper by about £2 there, I use the shampoo and the tonic.",
      "MessageIndex": 14,
      "PostDate": "04/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108714/letrozole---hair-thinning",
      "Title": "Letrozole - hair thinning"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi, Lorraine1m. ,I have also finished treatment and my hair has grown back but its like a lot of fluffy cotton wool, I have had mine cut into a pixie style but the sides and back grow and the top doesn't, I just keep on using a conditioner after shampooing and hoping it will come right in time, mainly because that's what everybody keeps telling me.  Sorry I know its not much help to you but at least you know you are not alone.",
      "MessageIndex": 40,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100748/does-anyone-have-curly-chemo-hair",
      "Title": "Does anyone have curly chemo hair ?"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Thanks so much GillieB, I have to have weekly sessions of Herceptin and Doxatel over three months, and then radiotherapy, I am trying to be strong but sometimes I just want my life back you know.  I think its the fact that sometimes I feel so well and more like my normal old self and then suddenly wham its like being hit by a steamroller, I'm not the best of patients I'm afraid but your comments have helped a lot - I am an avid walker and that's what I miss the most, I always solved any problems I had whilst out walking, but I will try and stay calm and positive and look for that light at the end of what seems like an unending tunnel. Thanks again - believe me hugs do help hey. xx",
      "MessageIndex": 2,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78085/chemo-after-affects",
      "Title": "Chemo after affects"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi, P.J, I was diagnosed in October of 2013, had a mastectomy, chemo and radiotherapy and am now  on Herceptin, please don't worry you will see the oncologist on a regular basis, its really just to tell you how things are going and to listen to any worries you may have, if its any consolation I am also feeling very down and really I have no reason to, I think its just the enormity of being diagnosed and going through the treatment, when its all happening you deal with it as it comes but then suddenly and when you least expect it what you have been through hits you, stay strong and think positive thoughts, you have come this far and you can do it.  Good luck with your appointment I found it helps to write down any worries or questions you have that way you don't forget when you see the oncologist.   Try to relax and take good care of yourself hey.",
      "MessageIndex": 1,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98115/feeling-fed-up-and-down",
      "Title": "feeling fed up and down"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi, I have completed my 4 cycles of FEC, last one being on 6 June, so its a week or so now since the actual chemo and I am feeling so weak, arms and legs aching, want to go for a walk but don't think my legs will hold me up, due to start with Herceptin and Doxatel(sp) in early July, almost feel like just giving up, I am so tired of feeling unwell all the time,  I'm now 75 and feel I want to enjoy my life again. Help, I know  I'm being a real misery here, but is there really light at the end of the chemo tunnel..",
      "MessageIndex": 0,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78085/chemo-after-affects",
      "Title": "Chemo after affects"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi, I can only tell you from my own experience, I had a right sided mastectomy and lymph node removal and to be honest I wish they had done a double mastectomy, it would have been so much easier just to purchase padded bras, I find it quite uncomfortable with a prosthesis, firstly sewing in the pockets to hold it, then to get the right size and I always feel as though one side is flopping (the side where I still have a breast) whilst the mastectomy side is static, its been 2 years now and I still wish I had had the double.  Anyway whatever you decide has to be right for you, everyone is different, good luck and hang in there whatever you decide to do. xox",
      "MessageIndex": 16,
      "PostDate": "18/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113470/is-double-mastectomy-easier-than-prosthesis-24-7",
      "Title": "is double mastectomy easier than prosthesis 24/7"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi, No I've not heard of this one but would like to, after cancer treatment my immune system definitely needs a boost.",
      "MessageIndex": 1,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101117/new-keytruda-cancer-seeking-immune-boosting-drug",
      "Title": "New Keytruda cancer seeking Immune boosting drug"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Nothings right or wrong in this fight you just do whatever you have to do and what feels right for you, I've just had my first chemo treatment after mastectomy and lymph node removal - the best of luck, take it one day at a time, and listen to your body.xx",
      "MessageIndex": 3,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72879/had-wle-and-slnb-on-thursday-27th-get-pathology-results-on-11th-march",
      "Title": "Had WLE and SLNB on Thursday 27th. Get pathology results on 11th March..."
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi, I had the same problem with my nails, I used Sally Hansen nail hardener (its colourless) and also the cuticle cream, took a while but its worked and I've managed to save my nails and its not expensive either.,",
      "MessageIndex": 6,
      "PostDate": "23/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113737/nails-breaking-and-coming-away-from-nail-bed",
      "Title": "Nails breaking and coming away from Nail bed"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi and yes I went through the lot alone, mastectomy/chemo/radiotherapy and Herceptin and really its not that bad, you can stay in bed if you feel inclined, do what you feel like doing and yes sometimes it can feel a little scarey but I did it and I'm still here. You go for it girl, theres always someone on this forum to chat to, always someone going through the same as you, just take a deep breath and go for it you'll be fine - best of luck go with you xox",
      "MessageIndex": 16,
      "PostDate": "28/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111028/living-alone-and-having-chemo",
      "Title": "Living alone and having chemo"
    },
    {
      "AuthorID": "dorothy1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dorothy1",
      "Content": "Hi has anyone else out there had an infection in the mastectomy scar and surrounding area that doesn't want to heal, I've been in hospital on hard core antibiotics for a week, it sort of cleared it but obviously not quite because as soon as I was out of hospital it flared up again now my oncologist has put me on a 14 day course of co-amoxiclav I've been taking them since this last Saturday and if anything the problem looks worse not better - help, anyone had a similar experience because its really getting me down now, I was supposed to start my second round of chemo a couple of weeks ago but that's now had to be put on hold.",
      "MessageIndex": 0,
      "PostDate": "01/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74511/breast-cancer-complications",
      "Title": "Breast cancer complications"
    }
  ]
}