{
  "AuthorID": "Dosydo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dosydo",
  "Posts": [
    {
      "AuthorID": "Dosydo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dosydo",
      "Content": "I'm nearly 4 months post double mx with expander implants and RHS clearance. I was a little unprepared for the pain and nuisance post surgery.  The radiotherapy kicked off the pain and tightness all over again too. But I can now sleep on either side (with a residual sense of the implants as slightly out of control foreign bodies) and I am not taking any pain killers. Skin on boobs and underside right upper arm still numb, maybe always will be, and have to do stretching exercises regularly or it all starts stiffening again. If I have a bad night's sleep it directly affects whole area and scars start prickling again by evening. So, I rest when I'm tired if I can. Good luck! Just keep wading through it and make the most of any time you feel ok with some gentle exercise. ",
      "MessageIndex": 7,
      "PostDate": "21/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127263/numbness-and-nerve-pain-after-mastectomy",
      "Title": "Numbness and nerve pain after mastectomy"
    },
    {
      "AuthorID": "Dosydo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dosydo",
      "Content": "You don't need negative people around you, so give this 'friend' a very wide berth. You also don't want to be harbouring anger and stress, so just wanted to suggest two possibilities. It may be that this person has no experience at all of serious accident or illness, and being an unimaginative twit, genuinely can't see what it might be like. More fool them later on in life. Or, it may be they have personal experience of terrible accident/illness where the treatment is patchy or went wrong, and they're in denial or still angry themselves. Or maybe they're just evil. Whichever, don't let it get to you!  Your peace of mind is much more important than their fear or stupidity. ",
      "MessageIndex": 20,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127746/really-bloody-angry",
      "Title": "Really bloody angry !!!"
    },
    {
      "AuthorID": "Dosydo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dosydo",
      "Content": "Aargh sleeping on your back!!!  Now able to sleep on side as of about 3 weeks ago. I had 5 drains after a dbl mx and axillary clearance, last one came out 4 weeks after surgery.  I couldn't do the v pillow because if I didn't lie with my shoulders flat the muscles across my chest began to tighten. Found that the pillow had to be under neck and head only, not shoulders, to avoid a crick in my neck and headache. But pillows either side def helped to protect drains and made it feel more snuggly like lying on side.  I slept with the drains in carry bags to make trips to the loo easier without tangling the spaghetti. And learnt exactly where to sit on the bed so I could just lie down and not have to nudge up and down the bed painfully. Well-taped drains essential.  W-thing and cot mattress sounds well worth a go - wish I'd thought to try!  ",
      "MessageIndex": 8,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127529/5-days-post-op---tips-on-sleeping-with-drain",
      "Title": "5 Days post op - tips on sleeping with drain!"
    },
    {
      "AuthorID": "Dosydo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dosydo",
      "Content": "Hi LondonLass. Oh it's rubbish isn't it? On Tuesday I made my oncologist go through my Predict calculations of my 10 year survival chances. I'm post treatment. It's not bad, 70%, but I haven't told my husband which is a 1st for me. Been feeling unusually pensive. But today was talking to an old colleague about our disastrous Christmas - my mx, a failed family heart op and the death of a dear granny - all in 8 days. I burst out laughing while I was telling him and couldn't stop! I do feel better though, but slightly guilty! Life's crazy and often inexplicable. You could always distract yourself with some electioneering! I've found political twittering a great distraction, knowing that the whole world is crazy and inexplicable, not just mine. ",
      "MessageIndex": 16,
      "PostDate": "21/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127224/it-doesn-t-get-any-easier",
      "Title": "It doesn't get any easier....."
    }
  ]
}