{
  "AuthorID": "doublefoobie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/doublefoobie",
  "Posts": [
    {
      "AuthorID": "doublefoobie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/doublefoobie",
      "Content": "Hello there I wonder if anyone has had similar experience post chemo (4xEC and 12 Taxol/Hercptin and Perjeta) I finished chemo in November 2017 and Herceptin in August 2018 - and since then have only had one very small period in June.  But a couple of weeks ago I felt like I was ovulating again - but that then morphed in to what I think is my first ever bout of thrush. I've been to the GP and she gave me oral Canesten and some topical cream. I started that yesterday morning and feel better already. But what is worrying me is that I am spotting a little bit - not huge amounts but enough blood to notice.  I don't know if it is to do with the thrush or whether my body is trying to have another period - but either way I am not sure whether this is all down to post chemo weirdness or whether I should be a little worried.  If anyone has been through anything similar I'd be grateful to know.  Thank you! PS I am in my mid forties - in case that helps!",
      "MessageIndex": 0,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177311/menstrual-cycle-post-chemo",
      "Title": "Menstrual Cycle Post Chemo"
    },
    {
      "AuthorID": "doublefoobie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/doublefoobie",
      "Content": "Hello there Thanks to you both for getting back to me - it's much appreciated.  Yes, you're right I think i need to discuss it all with one of my medical team. One of the things I am finding hardest post cancer treatment is not understanding my body any more. Before diagnosis I knew what was normal and what wasn't, and could make a judgement as to whether I needed to see someone, but now it's all a bit of a mystery.  Thanks again!",
      "MessageIndex": 3,
      "PostDate": "04/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177311/menstrual-cycle-post-chemo",
      "Title": "Menstrual Cycle Post Chemo"
    }
  ]
}