{
  "AuthorID": "Duffnut",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/duffnut",
  "Posts": [
    {
      "AuthorID": "Duffnut",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/duffnut",
      "Content": "Hi,  I'm so sorry you have to be asking these questions. I know from experience how scary this time is. When we talk about \"spread\" it's not straightforward. Usually they check the lymph nodes under the arms to see if there's any sign of spread but those tests are indicative only - surgery is when they know for sure. Even it it has gone to some lymph nodes it's still considered local disease, highly treatable.   If they find lymph node spread then they're highly likely to order full body and bone scans just to check if it has spread outside of the local breast area. That is standard, it doesn't mean they think it has spread. Things will start to move quickly from here but this is the worse bit, I know it sounds daft but it gets easier once you know what's what.",
      "MessageIndex": 5,
      "PostDate": "16/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144826/girlfriend-has-been-told-she-has-a-mammogram-result-of-m5",
      "Title": "Girlfriend has been told she has a mammogram result of M5"
    },
    {
      "AuthorID": "Duffnut",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/duffnut",
      "Content": "Ludo I hope you get to read this. I was in exactly the same position as you with my onc saying I was too low risk to fork out for oncotype (which my surgeon had specifically said I must ask about.) Anyway after several arguments I persuaded him into it and it came back putting me just into the low end of intermediate; less than 2 % benefit so I didn't have chemo and am perfectly happy with that decision.",
      "MessageIndex": 12,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Duffnut",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/duffnut",
      "Content": "Hi Ludo, I'm a year on from where you are and I promise it gets easier. When I was first diagnosed, all through treatment and for months afterwards I seriously doubted whether I'd ever really fully enjoy anything again, whether I'd ever not think about it, whether I'd get my spark back. It does come, it just takes a bit of time.",
      "MessageIndex": 14,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Duffnut",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/duffnut",
      "Content": "Your surgeon behaved very badly. I personally found they don't fully explain things in the early days so you go along with it and then by the time you've re-assessed it's too late. I didn't fully appreciate why they were recommending lumpectomy and radiation for me, I was in shock and just numbly acceded to the plan. It wasn't until I researched following op but prior to rads that I realised the potential side effects of rads. By then it was too late. If it had been properly explained before the lumpectomy I would have pressed for a mastectomy to avoid radiotherapy. However, I realised that to get the the same long term benefit from a lumpectomy as a mastectomy I'd have to have rads so I did. My experience was also straightforward. ",
      "MessageIndex": 4,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144638/is-there-a-risk-of-over-treatment-for-early-stage-bc",
      "Title": "Is there a risk of over treatment for early stage BC?"
    },
    {
      "AuthorID": "Duffnut",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/duffnut",
      "Content": "I just wanted to say hi and then that I really empathise with you. Telling my elderly parents (more than a year ago now) was the single hardest thing I've ever done.  I would say your sister has to abide by your wishes - this is about you not her. The difficulty is that now she knows she probably feels very guilty for holding back this massive secret from the rest of the family. My brother knew I was going through the tests but my parents didn't. I later found out that he found that very hard. Your sister probably feels she's lying to them so her desire for you to share may be as much about her as you.  Having cancer is not easy. I told 5 people for the first 6 months because it was the only way I could cope and that worked for me. I don't think she's making light of your diagnosis, she just doesn't fully understand it. Before I got BC I believed the pink and fluffy brigade, I didn't realise what it really meant. To say it'll be over in a year is very naive. I finished treatment nearly a year ago but it's certainly not \"over\" for me; unless and until you've had cancer you have no idea. Wishing you all the best.",
      "MessageIndex": 1,
      "PostDate": "20/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147600/telling-family",
      "Title": "Telling Family"
    }
  ]
}