{
  "AuthorID": "Dursey",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dursey",
  "Posts": [
    {
      "AuthorID": "Dursey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dursey",
      "Content": "I have been on Tamoxifen for over a year. I am 62. I attributed a lot of symptoms such as fatigue and muscle cramps to Tamoxifen by my oncologist said that they were more likely side effects from the chemo. Weight gain and fatigue (from whatever source) are my two main problems at this stage. I don't think I can blame Tamoxifen for most of the weight gain -- overeating and lack of exercise have definitely contributed. Throughout my life I have had to work hard at keeping my weight in check. I think I just need to get my act together once more. On the fatigue front the approach I find best is to recognise that it is time to take a break during the day. I have started knitting for my grandchildren and I find this a very soothing and relaxing activity.",
      "MessageIndex": 76,
      "PostDate": "20/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23712/tamoxifen-it-sounds-awful-is-it-really-that-bad",
      "Title": "Tamoxifen It Sounds Awful Is it Really That Bad?"
    },
    {
      "AuthorID": "Dursey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/dursey",
      "Content": "I have been on Tamoxifen for over a year. I have suffered cramps in my calf muscles and in my toes from time to time. They go away for a bit and then recur. I also get them in my toes when I drive. My oncologist said that they are more likely to be as a result of the chemo.",
      "MessageIndex": 2,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30707/tamoxifen-and-muscle-cramps",
      "Title": "Tamoxifen and muscle cramps"
    }
  ]
}