{
  "AuthorID": "eesiboo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eesiboo",
  "Posts": [
    {
      "AuthorID": "eesiboo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eesiboo",
      "Content": "Hi there.  I am 37 years old and had the latissimus dorsi flap reconstruction with skin sparing mastectomy a month ago. I thought I would tell you a little of my experience as I wish I had asked the questions you asked.  I hope the following makes sense.  I also was extremely active, circuit training once or twice a week, gym, running, golf etc.  I was diagnosed with Stage 1, Grade 1 IDC and was offered mastectomy as my breasts are relatively small (34B) and my tumor was 3cm although not all of it was cancerous.  I had the horrible feelings and emotions of the waiting game but the 'cancer' didn't actually get to me too much.  I didn't hesitate on my mastectomy decision, I just knew it had to be done.  I also didn't give the op or post-op any thought - which now I realise I did not prepare myself for such a big op.  I was in theatre almost 6 hours and had two wonderful surgeons.  They took my nipple away also and were to reconstruct whilst in surgery but they run out of time. I came out with three drains.  They are the pits, at first they didn't bother me but by day 3 they were very uncomfortable and I had all three out after 7 days.  I did not have a catheter, nor a morphine drip, nor an antibiotic drip, but everyone are different.  I did not suffer horrendous pain with this op, it was manageable and I was pretty numb.  I was just very groggy, unable to move about much and very restricted.  I was also very doddery.   I was in hospital 5 days and when leaving it was very daunting being in the wide world again after being looked after so well and took some adjusting.  Make sure you have your pain relief when offered to keep any aches and pains at bay.  Also, don't expect too much of yourself in hospital, I took razors to shave my leg and alsorts of magazines etc .. I personally wasn't well enough to think about shaving my legs.  When returning home I had friends round everyday to help me shower, wash and dry my hair, get dressed etc. but very soon I wished to try to be independent, no matter how long it took me or how frustrating it was.  By day 6 I walked around the corner shop, that was my limit.  By day 9 I walked around a garden centre.  By week two I was walking around a shop most days just to get out and was pretty much only taking paracetamol at bedtime.  I was able to feel as though progress was being made with my exercises and I was improving so much each day.  I would imagine you will find things harder when picking things up as you have knee restrictions, I found that squatting has enabled me to be more mobile , unfortunately, I don't think you will be able to do that.  But it is amazing how we find ways to do things.  My left hand is doing everything now (I am right handed and right mastectomy) and I manage really well with it.   By week three I was slowly wiping sides down and pottering around, also I was alot more comfortable in bed as week 1 I was only able to sleep on my back, week two I could sleep on one side.   Every day that passed, I was ready for taking on the next day as every day the discomfort gets less and less.  Also by week three I was walking into town - about a 30 min walk and back again.  Now I am on week 4 I am so much better again.  My back is comfortable to lay on, my underarm feels alot better, all my scabs have gone and I spend two and a half hours every morning getting breakfast, washed, hair, dressed, making the bed (with one arm) rubbing cream into scars, exercises etc.  Its a slow process but it is my life and routine at the moment, and one thing I remind myself is to keep being patient. I could rattle on forever.  This op is a big op, there is no getting away from that but it is truely amazing how we adapt to using other parts of our body to compensate for what we cannot do, so do not worry too much about your knees, you will find a way.  If you ever want to talk to me or want my email, I will gladly give you my details.  I am only just realising that this op was the best option.  Up to now I wasn't sure all the post-op journey was worth reconstruction and mastectomy in one go, but now, I feel it is all done and the results are amazing and the scars are so neat.   Take care xxx",
      "MessageIndex": 3,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55880/mastectomy-and-immediate-ld-flap-reconstruction",
      "Title": "Mastectomy and immediate LD flap reconstruction."
    },
    {
      "AuthorID": "eesiboo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eesiboo",
      "Content": "Hi Nicky Wondered if you could help me?  I also had this surgery but I didn't have the implant just the ld muscle.  You said you are having lipo.  My surgeon said I may have this, from the thigh fat as - only four weeks post surgery - my breast has shrunk smaller than the other breast.  She said this would happen.  Do you know much about the procedure, for instance, how long we have to wait before they will do it and if any risks are involved.  Also, did you suffer spasms in your breast when you first had surgery, it isn't painful, just annoying.  Did you suffer with seromas, if so, for how long and did you suffer with cording?  Your comments would be greatly appreciated as I've not spoken to anyone else who has had this done and I feel completely in the dark. x",
      "MessageIndex": 4,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55880/mastectomy-and-immediate-ld-flap-reconstruction",
      "Title": "Mastectomy and immediate LD flap reconstruction."
    },
    {
      "AuthorID": "eesiboo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eesiboo",
      "Content": "Hi there Bella17 Please contact me if you have any questions, I will answer them as best as I can based on my own experience.  I suppose my advice to you would be to 'try' and relax as much as possible and enjoy Christmas.  I personally feel better knowing I have had a mastectomy and my breast tissue has gone. You are right, it isn't an easy op, but for me, 4 weeks on, although you can't imagine being 4 weeks on, the time does come and there is light at the end of the tunnel and there are plenty of women on here to support you and help you through this and I am under Derby Royal Hospital care and they have been absolutely amazing with me from the first day I walked into the door, through my op, post-op hospital recovery and through to supporting and looking after me now.   Lisa x",
      "MessageIndex": 10,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55880/mastectomy-and-immediate-ld-flap-reconstruction",
      "Title": "Mastectomy and immediate LD flap reconstruction."
    },
    {
      "AuthorID": "eesiboo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eesiboo",
      "Content": "Thanks for the info Nicky.  I have requested to be added to the Younger Breast Cancer Network (UK) facebook group.  I had physio today and I have a bit of cording down my arm and still a seroma so have a couple more hospital appts before xmas but other than that I'm apparently doing well and should be able to drive by week 6 (xmas).  I have also been told I may be able to return back to work beginning of january (7 - 8 weeks post op) as I have a desk job - fab news cos I have cabin fever lol !!",
      "MessageIndex": 9,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55880/mastectomy-and-immediate-ld-flap-reconstruction",
      "Title": "Mastectomy and immediate LD flap reconstruction."
    }
  ]
}