{
  "AuthorID": "Eiliscambs",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eiliscambs",
  "Posts": [{
    "AuthorID": "Eiliscambs",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eiliscambs",
    "Content": "Hi Lizzy I join everyone else in offering moral support on this emotional roller coaster you are experiencing.  Where are you living, perhaps I can offer to be a cancer buddy.  You  probably know that you are now or soon will be entitled to free prescriptions and will probably qualify for a blue badge.  Most units have a MacMillan Nurse and if yours does you will be introduced to her.  She and the receptionist will help you with organising transport.   I am a single mum and did a lot of my care alone, I am post chemo and a stem cell transplant, but still go into the unit every 8 weeks or so for bone strengthening infusions as my cancer has damaged my spine and hips. My son helped when he could when I was stuck in hospital for four weeks, however with three children under the age of 4  at the time it was a bit short and sharp, come in, pick up laundry go again to get eldest from school.  My daughter was miles away up the country, and just before I was diagnosed I had sent the youngest to his Aunt in Germany whilst he fought his depression.  When he came back he was as useful as a chocolate fireguard.  My mum was and still is away in la-la land, my sister is breeding her third brain tumour and my brother and his wife have been caring for her mother and father as they went into their declines and departures. However there was one not so close friend who just stepped out of the background ,  was there at all the crucial moments, and probably will be again if the need arises.  So you never know. Do you know what type of chemo you will be prescribed?  They all have different effects, some are easier than others. The other thing I can tell you is that if you need to talk while you are on the unit, other patients will talk with you, we  can be a very supportive group, sometimes :-) Anyway the offer to help is on the table if you are anywhere near Cambridge.  Keep in touch on here we don't bite.",
    "MessageIndex": 12,
    "PostDate": "23/06/2016",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110829/having-a-bit-of-a-wobble",
    "Title": "Having a bit of a wobble..."
  }]
}