{
  "AuthorID": "ejm1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
  "Posts": [
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello  It's a scary time when you are first diagnosed .. Sorry to hear it feels like a terrifying nightmare   I was diagnosed with BC in my right breast back in April 2015 and it took a good few weeks to conclude that my left breast was ok .. Scans, MRI, numerous biopsies .. The waiting was horrid - I always knew I'd need a mx and at first wanted a double - my attitude was 'take both off' but the more I reflected on it I begun to think differently and had a single with immediate reconstruction in Nov  Your mammogram worked in that it spotted the clacification which led to further exploration - which 'caught'the cancer and has led to treatment which should be effective  Your scan was clear in regards to your other organs which is good news  It must be hard to have gone back for more than one surgery and still be told you need a MX - has that doubted your confidence in the dr's/medical systems ability to accurately predict / detect any worries with your unaffected breast? You say your family want you to have a double and whilst I'm sure their views are important, ultimately it's your decisions .. For me it came down to being calmed somewhat by Dr's in regards to liklihood of occurance as well as concluding that I wanted one breast that 'worked' - I'm only 44  Will you be on any long term treatment that will reduce chances of reoccurrence?  There was another recent thread about a very similar issue with a lot of info and experiences shared .. You might find it useful to have a read of that  What ever you decide will be right for you - you know your body and your mind better than anyone else, take some time to explore the options and talk through ... Maybe with an inpartial person - isyour BCN being supportive ?  I wish you well for the future  Ellen x ",
      "MessageIndex": 2,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104547/terrified-mx-on-tuesday",
      "Title": "Terrified..MX on Tuesday"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Thanks Helen - will let you know where I get to with it  hope chemo isn’t being too awful to you, you will get through it and out the other side ..  Xx",
      "MessageIndex": 2,
      "PostDate": "14/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176543/mastectomy-tattoo-anyone",
      "Title": "mastectomy tattoo anyone ?"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Thanks for this ruby rose ive umm’d and ahhh’d about nipple tattoo - but have decided not to have one, but get a different bigger tattoo instead. i know it’s personal and different for everyone but for me I’m excited decided I don’t want to ‘pretend’ my reconstructed is like the other and so the mastectomy tattoo is a way of celebrating survival, marking the past 4 years and also celebrating my new boob - which is different but still cherished  I’ve found a couple of female tattooists in london that look good and am off to meet them ....  ellen x",
      "MessageIndex": 8,
      "PostDate": "03/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176543/mastectomy-tattoo-anyone",
      "Title": "mastectomy tattoo anyone ?"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi Just had my final (fingers crossed) bit of surgery - it was only  liposuction on my diep reconstruction so not too major - big surgery was  3 1/2 years ago i know I have to wait a few months for it all to settle down but have been thinking for a while of getting a tattoo - not a simple nipple but something lot to mark and celebrate the past 4 years ... I’ve  seen pictures on various websites  so I know im not alone but wondering if anyone has direct experience and can offer any advice / tips ?  I already have a couple of tattoos so also know what to expect but equally aware that tattooing over skin that’s had major surgery and radiation isn’t the same as regular skin and an also looking for recommendations for tattooists with mastectomy experience in north / east london?  Thanks all",
      "MessageIndex": 0,
      "PostDate": "14/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176543/mastectomy-tattoo-anyone",
      "Title": "mastectomy tattoo anyone ?"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Just to add what others have said, I had a very similar experience, about a week after rads finished I had skin breakdown under my boob - I went to see the care team at the radiotherapy department (just called up and asked to be seen and they said come intents day) and they gave me some special silicon type dressings which I wore under my bra and kept on at night - it stopped it rubbing and kept it clean, they fell off in the shower but I was given enough for a couple of weeks by which point it had healed - just had my 4 week check in with radiotherapy department today and all good  Speak to your team tomorrow and get some dressings, hope it gets better  Ellen x ",
      "MessageIndex": 3,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107836/after-radiotherapy",
      "Title": "After radiotherapy"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi Lucy   I had my diep /tram reconstruction almost 12 weeks ago ... I saw my surgeon last week and have been told minimum of 6 months before they will consider any further tweaks - partly influenced by having rads starting in a couple of weeks and then want a good few months after that for everything to settle down  I'd be interested in any responses you get - when was your op?  Ellen ",
      "MessageIndex": 1,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104216/stage-2-of-diep",
      "Title": "stage 2 of diep"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello tsmith Thought I'd share my experience as it sounds similar in some ways to your sister in laws  I was diagnosed with HER+ grade 2 invasive BC in April 15 - it had begun life as dcis and my senital lymph node was positive following biopsy. The principal tumour was 7 cm and there were spots of calcification in other parts of the breast, which indicated pre cancerous changes. I also had pagets which is a relatively rare form of nipple cancer.  I was 44 so a bit older that your sister in law and the future children / fertility questions were not an issue for me  I had chemo first then surgery, which is called neoadjuvant treatment - this is common in the UK for this type of cancer  - no chemo isn't nice, but I coped and worked through most of it with a few days off after each cycle and shorter working hours, I was very tired by the end and then had time to get strong again before surgery   Even though my tumour shrank to nothing I always knew that I'd need a mastectomy as my doctor explained that as there were multiple worrying bits of the breast I'd wind up looking like Swiss cheese is she tried to remove them all I had a very good response to the chemo - what is called a pathological complete response, there was no cancer left in any part of the nipple, breast or lymph nodes (11 removed) - its only by having the chemo first can this be measured, and therefore I know that my chances of reoccurring are greatly reduced. I find out next week if I need radiotherapy - my surgeon thinks probably not, again this is only possible if you have the chemo before surgery I started herceptin halfway through chemo and will carry that on for a full 12 months - my oncologist explained that for HER+ tumours herceptin is a game changer, and in the UK you can't have that without the chemo as that is where it is most effective  I hope some of this info helps - there are good effective treatments for HER+ cancers, with increasingly positive outcomes - this is what your sister in law and the family must hold on to, even though it's incredibly scary at this early stage  Take care Ellen x",
      "MessageIndex": 5,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103202/my-apologies-as-i-am-not-sure-if-my-question-crosses-all-groups",
      "Title": "My apologies as I am not sure if my question crosses all groups"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello Naz  I had this surgery in November '15 almost twelve weeks ago, mx on my right breast and immediate reconstruction after 6 rounds of chemo, I also had node clearance .. They took 11. I was due to have the diep procedure but once the surgery was underway they couldn't find good enough veins (chemo complication) so I wound up having tram - meaning they take some abdominal muscle. My op took over 11 hours and I needed blood transfusions the following day as my hb was low after the chemo  The first thing I would say is be prepared for serious pain in the tummy area and a slow recovery ... Your tummy feels incredibly 'tight' necessitating you walking in a bit of a stooped over way for a few weeks but this does ease. I felt like I'd been run over by a juggernaut, then a bus, then car ! Despite feeling like this I was out of bed on day two and within 2-3 weeks able to do moderate amounts of walking of up to 45 mins - but slowly. 8 weeks on I could drive, do a long 1 1/2 hour walk on news year day and now physicallyfeel about 80%. No pain, but still some discomfort and twinges and you have to do the exercises ... I'm thinking of starting some gentle Pilates in a couple more weeks to build up stomach strength again.  In terms of new boob - I would say 'work in progress' , but generally good. It was very swollen to start with (I also got a seroma and then an infection  but I think I was unlucky ... Both now clearedand all healed up). The good bit is it is made of me, it's warm and it's starting to take on the shape of the other boob - ie bit of natural droop. If you're having both done then it might be easier to get symmetry ... Certainly over clothes you couldn't tell the difference between mine. It will need further 'tweaking' - probably some liposuction to shape it more like the other as it's actually bigger, but hopefully it will reduce some more after radiotherapy that starts soon. Stomach scar wise I'm not that bothered .. Yes it's long but below bikini line(not that I'm a bikini wearer) and is already starting to fade - get some bio oil and check with nurses when its ok to start using  and my new tummy button looks good .. My stomach is also very flat as you effectively have a tummy tuck.  At the end of the day you'll make the right decision for you - for me it came down to being 44 and wanting a new boob that was a natural as possible and would last me without having to have it changed, re-filled etc...as can happen with implants - to be honest the first few weeks after surgery I wished I'd gone for the implant as I found the stomach surgery very hard - i am pretty active person who rode my bike every day and found the recovery process hard - but now as I'm getting back to full activity I'm more positive about it, I'm sure it's because the memory of the pain is starting to fade as well  I hope that's helpful - it's wound up being a long reply ! if you have any more specific questions feel free to ask and I really hope that what ever surgery you decide on goes well for you  Take care Ellen x ",
      "MessageIndex": 3,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104129/diep-flap-or-implants-how-to-choose",
      "Title": "DIEP flap or Implants... How to choose?"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi Naz  Re feeling -no do not have proper sensation, have some feeling on the top part of new boob, but can't feel about 70% and there is also reduced feeling in the tummy where nerves have been cut  I'd agree Marcia in saying that pain began to reduce after about 2-3 weeks and then after about 6-7 moved to discomfort, which I still have at times  also like Marcia I have never felt pain like it, hospital was pretty horrid and  was utterly shattered as they wake you every hour to check the new boob for the first 72 hours so was a complete mess of pain, tiredness and drugs - was also pretty tearful which I think was a combination of everything - if you've just finished chemo your physical and emotional resilience is probably diminished ... Mine certain wax  I also hadn't properly appreciated that I'd need further 'tweaking surgery' after, so had to get my head round that Am I pleased I chose this option? Increasingly so, though if you'd asked me that immediately afterwards or in the first 6 weeks I'd have said no ",
      "MessageIndex": 11,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104129/diep-flap-or-implants-how-to-choose",
      "Title": "DIEP flap or Implants... How to choose?"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi Julie  I finished treatment just over 2 years ago and lots of what you said sounds familiar, the article below was recommended to me and I found it really resonated... written by a clinical psychologist called dr Peter Harvey  Give yourself time, not only for physical healing but emotionally as well Hang in there - it does get easier, honest  Ellen xx http://www.workingwithcancer.co.uk/wp-content/uploads/2013/03/After-the-treatment-finishes-then-what.pdf",
      "MessageIndex": 8,
      "PostDate": "29/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145710/can-t-stop-worrying",
      "Title": "Can’t stop worrying"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Thanks Jane  Finally stopped after 16 days so will talk to oncologist or BCN at next check up  Good to hear it's not that unusual .. just a bit of a shock after 2 years  Take care  Ellen x ",
      "MessageIndex": 6,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138859/chemo-induced-menopause-and-then",
      "Title": "Chemo induced menopause and then ....."
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Thanks Jo Will talk to her, pleased yours seems to be settling and you don't need more surgery  Ellen x",
      "MessageIndex": 8,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138859/chemo-induced-menopause-and-then",
      "Title": "Chemo induced menopause and then ....."
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Thanks for the replies and suggestions  Will speak to my BCN / oncologist in first instance  xx",
      "MessageIndex": 4,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138859/chemo-induced-menopause-and-then",
      "Title": "Chemo induced menopause and then ....."
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi thought id join and say hello - has been helpful to read this in preparation ... Am having my treatment neo-adjudent so still have the pleasure of surgery to look forward to in the autumn had my first round of FEC yesterday - being called FEC is somewhat poetic isn't it ! The actual treatment was ok and the red pee is epretty impressive, good job they warn you about that one  i was feeling pretty much ok with just mild nausea till early evening  when took my first round of domperidone anti nausea medication - had exactly the opposite effect on me e.g. made the nausea 10 times worse in the space of 20 mins plus had the shakes and hot flushes - all pretty scary but my partner was great and very cool headed and she spoke to the chemo nurse and gp who were good and symptoms subsided in a couple of hours .... surffice to say won't be taking that one again and I'm just sticking with the other medication  (ondansetron)  & steroids (dexamethasone) for now, after it all calmed down I managed to get a few hours sleep and we're planning to head out in the sunshine for a little wander later  will keep on reading this for support - thanks to you  all, particuarly those who are further down the road than me  PS  cycling girl - nadjie ... I'm also a big cyclist .. Very inspiring to read you're managing to keep it up and amazing that you did the night ride during treatment .... I've have been worried that the would be no riding for me for the next few months which would be a double blow so definitely going to try and follow in your footsteps & wheel tracks  Ellen xx",
      "MessageIndex": 85,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello Haven't been on here for a while but wanted to check something out and always find such good people and sensible advice hereon Briefly : diagnosed aged 44 in 2015, her+ ... had neo adjuvant FEC & herceptin, then mx with immediate diep recon  It's just gone 2 years since my last chemo and almost to the day my period has re-started !! this is probably too much detail, and I apologise in advance,  but now have been on for 15 days,  it's like my body is trying to make up for missing so many ... Is common for periods to restart after so long and does it mean I get to have menopause number two in the future ?!? Oh joy - something to look forward to ... Thanks all Ellen  xx",
      "MessageIndex": 0,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138859/chemo-induced-menopause-and-then",
      "Title": "Chemo induced menopause and then ....."
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Thanks Birty - so far ok and have just managed to get through two pieces of toast and marmite which hopfully means it's settling  x ",
      "MessageIndex": 89,
      "PostDate": "06/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello all  Looking for some advice - finished chemo (fec-t) almost 6 months ago and really noticing my eyesight has deteriorated ...am sure I read something early on about this happening but also that you should also wait before getting it tested as it can improve once you finished ?  Anyone had experience of this? Im about to book strip to the optician as I think if it was going to get any better it probably would have done so by now?  Many thanks  Ellen x ",
      "MessageIndex": 0,
      "PostDate": "07/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107600/eyesight-after-treatment",
      "Title": "Eyesight after treatment ?"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Thanks for your replies - I've worn glasses for years but managed to avoid reading glasses, now having to take my glasses off to text! As its six months in I don't think it's going to get any better .... accepting defeat and going to book an eye test and probably will end up with vari-focals Ellen  X ",
      "MessageIndex": 4,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107600/eyesight-after-treatment",
      "Title": "Eyesight after treatment ?"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Birty, jannie, Maggie May & sister snail Thanks for the replies and encouragement about work and my bike ride - I'm touched that people took the time to reply - I  have no idea how I'm going to cope with the treatment and I know everyone is different, but to know some can and do work through it helps stay positive  I have taken a few days off this week to get my head straight and tell people what's going on .. That's been pretty tough but everyone has been great and I feel like I'm mobilising the troops!  going back to work on Monday, thankfully I have great boss who has said 'what ever you need'  so two weeks of more testing to see if it's just ductal or has progressed to invasive and then agreeing the treatment plan - as long as the doctor says waiting a week for the bike ride will have no impact on the treatment I'm going to do it  been sleeping better these past couple of nights which also help Many thanks and take care all and - Birty  hope your recovery from Monday's surgery goes well  Ellen x ",
      "MessageIndex": 37,
      "PostDate": "17/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92701/just-diagnosed-and-need-to-read-something-positive",
      "Title": "Just diagnosed and need to read something positive"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello all its 2.30 am and I'm awake reading this as I was diagnosed yesterday - I have Paget's disease which I'm told is fairly rare (lucky old me) form of breast cancer which starts on the nipple and is almost always a sign of tumours in the breast - so far I know I have an ducal carcrnomia in situ and have to have more tests th is week to work out if it might be invasive as the lymph node biopsy wasn't clear ... Then we can agree treatment etc ... But it's certainly going to include surgery and chemo though not necessarily in that order I actually found this thread yesterday morning as I was preparing myself to go and get the results which I was pretty sure we're going to be bad news ... I have so many questions right now and am not used to not being in control of things so it's going to be tough ... But it's been great to read and hear from so many people that there is light in what feels like a very long tunnel - I too really love the phrase 'treated to recovery' - am going to hold on to that and the wonderful and encouraging stories from so many of you im trying to decide what to do over the next couple of weeks in terms of work before I start treatment - do I keep on going? I think the routine will be good for me and whilst I'm a bit of a mess emotionally physically I'm fine, in fact I'm fitter now than I have been in years and on 2 weeks am supposed to be going on a 250 mile cycle trip round the outer Hebrides with my brother ... We cycled to Paris last year - if the doctor says it ok and delaying treatment for a week or so isn't problematic I'm tempted to still go as I think it'll be good for my soul  I have a great partner who I know is going to my rock over the coming months ... That's it for my long middle of the night rambling, I'm going to try to get back off the sleep now  thanks again everyone for sharing their stories, it really really does help  ellen x      ",
      "MessageIndex": 31,
      "PostDate": "15/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92701/just-diagnosed-and-need-to-read-something-positive",
      "Title": "Just diagnosed and need to read something positive"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi Lorraine  thanks for your message - more tests this week, MRI with dye stuff tomorrow morning, (yes on a Sunday - small blessings for living in centralish London with great hospitals locally) then more biopsies on Thursday and seeing Dr the week after for results and agreeing treatment plan  I got the impression they are going to say chemo first then surgery then more .. ? Maybe chemo or radiotherapy?  And yes the anxiety of not knowing is the worst bit - but did a 25 mile bike ride this morning and the sun is shining and I'm off to the theatre later, so hey ho, life goes on ... Hope your treatment  over the past year has gone well and you are coming out the other side  ellen x",
      "MessageIndex": 40,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92701/just-diagnosed-and-need-to-read-something-positive",
      "Title": "Just diagnosed and need to read something positive"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi nix You are right the recovery for diep recon is pretty long, I had mine early Nov - it hurt like hell and I was a bit of a mess, physically and emotionally for a few weeks after. My op took 12 hours and was only 6 weeks after I finished chemo so needed blood transfusions. They wake you up every hour for the first 48-72 hours to check the blood flow so I was also deranged through lack of sleep!!  To be honest for the first few weeks I regretted it - my new boob wasn't what I thought it was be, it was hugely swollen, I got an infection and then had a seroma which meant I needed to get the fluid drawn out by needle. It meant I had to go to the dressing clinic almost every day for a month. My tummy was incredibly painful as well as being numb where they cut the nerves - a contradiction I know. You are kind of bent over whilst your tummy stretches out and do a weird shuffle walk but that got a lot better by week 6 Now 5 months on I'm increasingly pleased with it, it's starting to look and behave like a boob, it's warm, flops naturally at night etc... is part of me and not plastic and silicon which is important to me. Hopefully it will last me forever without the need for any more major surgery though I might have some small alterations as its actually bigger than my other one and my surgeon has said they can liposuction it to make it a better match.  Recovery has been slow but steady, i made myself go out everyday, even if just for walk round the block a few times. I was back at work after about 3 months and am now able to ride my bike the 5 miles each way. I still have some soreness/discomfort in my tummy but it's getting better each week and I started yoga after 12 weeks to help re-build core muscles. To be honest one of the worst bits post surgery has been cording in my arm after the lymph node removal - but Physio has helped with that, and it is nothing to do with the diep. There's been a few threads in here recently about diep recon you might want to look up  - some people very positive others have had more complicated experiences ..  I'd be happy to send you a picture in private message if you would like  Hope that helps  Ellen x ",
      "MessageIndex": 19,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi teacher   you mentioned having been told you had cancer of the nipple, me too ... As you say it's pretty unusual and I was told it is sub category of breast cancer called 'pagets disease' ( not to be confused with a phone disease of the same name) Just thought I'd mention in case this dot hasn't been joined for you yet  Hope your treatment goes well  Take care Ellen x ",
      "MessageIndex": 5,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi teacher  Re pagets, was diagnosed almost a year ago and had what I now know to be classic presentation, what I thought was eczema on my nipple which got a bit better when I put moisturiser on it but didn't go fully go, so when it had been there for about 3 months I went to see GP who wasn't overly worried but thought it was worth investigating -  mammogram showed large tumor (which I thought was just dense breast tissue), senital nose was also positive, HER+ Had neo adjuvant chemo with herceptin, then mx with immediate diep recon, finished rads 4 weeks ago- positively had PCR so chemo was very effective and rads just belt and braces ..  I'm back at work and slowly getting back to getting on with life, been a tough old year but it's amazing what you can get through when you have to  Hope the rest of your surgery is ok, you get good clear margins, and can then get a clear treatment plan  xx ",
      "MessageIndex": 17,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi Larner  Yes I had the same ... Lost all of mine during FEC x3 but the regrowth began during taxol - I didn't believe it at first so my partner took some photos over a couple of weeks to prove it .. It  took a good few months, about 3, till I had a proper covering but now almost 6 months on from last chemo and just booked haircut number 2 ... The sides and back have grown faster than the top so needed a little trim to tidy it up  My eye lashes and brows grew back really quickly though .. Over matter of 2-3 weeks  Really hope it's the same for you and good luck for you last few chemos  Ellen x ",
      "MessageIndex": 1,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106398/hair-growth-on-taxol",
      "Title": "Hair growth on Taxol"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello all I'm booked in to have my mastectomy and immediate reconstruction in 3 weeks - by then I'll be 6 weeks post chemo having had 3 FEC & 3 T, I'm HER+ grade 2 plus pagets (cancer if the nipple)  and will carry on with herceptin till next summer  I know it's a big operation and have been told to feel like I've been hit by a train the first coue of  days but I'm only 44 and thinking long term gain over short term pain and discomfort  I'd be really interested in hearing from anyone who has had this procedure and their experience of recovery, any tips and things to look out for  Many thanks Ellen     ",
      "MessageIndex": 0,
      "PostDate": "14/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99871/diep-reconstruction---recovery",
      "Title": "Diep reconstruction - recovery"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Thanks to all of you for taking the time to replysorry for the delay, got a bad cold which knocked me out for a while but over the worst of it now  really helpful to read your experiences - one week to go .. ",
      "MessageIndex": 5,
      "PostDate": "30/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99871/diep-reconstruction---recovery",
      "Title": "Diep reconstruction - recovery"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "I bet you look great !! Wear it with pride and practice your best withering look if anyone so much as glances at you !!  xx",
      "MessageIndex": 2,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98939/work-with-head-scarf-on",
      "Title": "Work with head scarf on !"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello lujay It's good that you have found this site to help answer questions and provide support at this difficult time  I finished chemo in sep '15, started off on FEC but after the first 2 rounds the oncologists dropped the F and I had just EC, flowed by 3 T. Apparently this is becoming more common and I know some people who have been given EC from the start. My team explained that there is research into the effectiveness of F and that the indicators are that for many EC is just as effective with fewer side effects  I had neoadjuvant chemo (ie before surgery) and it was very effective with no cancer found in any tissue or lymph nodes post surgery - When I was diagnosed back in April had a 7 cm grade 2 tumour, plus other spots of calcification and my senital node was positive.  I know I have been lucky that the treatment has been so effective.  I really hope you also have a good response and the chemo isn't too rough on you.  Take care Ellen ",
      "MessageIndex": 3,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103215/confused-about-type-of-chemotherapy-for-breast-cancer",
      "Title": "Confused about type of chemotherapy for Breast cancer"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hello Carol Agree with everything said before, I had a picc line for my cho between June-Sep 2015 and it was very helpful for a range of reasons Just to add the nurses at my hospital (UCLH in London) taught my partner to do the weekly flushing and  cleaning ... Might not be for everyone but we found it very useful as it meant I didn't have to go to hospital weekly or wait in for the district nurse  Hope your chemo goes as well as possible  Ellen ",
      "MessageIndex": 5,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103567/january-chemo-club",
      "Title": "JANUARY CHEMO CLUB"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi cassa  I was diagnosed with pagets in April 2015 - I had what I now know is a classic symptom, eczema dry skin on the side of my nipple, - mammogram and biopsy followed and I had dcis which was her+ So had neo adjuvant chemo, mx &  diep recon and then radiotherapy ... Just finishing off herceptin injections  I don't think the pagets was a feature of the treatment particularly - and it had only been there for a few months before I saw the GP, pretty sure the tumour was there all along  Good luck with your treatment - if you have any questions feel free to ask  Ellen x",
      "MessageIndex": 5,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112660/padgets-desease",
      "Title": "Padgets desease"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "For me it was a series of biopsies - both the lump/tumour, the actual eczema/skin on the nipple and another of my lymph node ... I then had the pretty standard breast mri (front down with special mould for your boobs) and a full body ct scan when they put some radio active stuff in you first ... Took about 6 weeks from diagnosis to agreed treatment plan which surprised me as I thought it would be dinner but on reflection I understand as there are so many different types of BC and they tailor the treatment accordingly ... The waiting is tough but try not to let your mind go down worst case scenario and Dr Google ... Let the real Drs work it out  Ellen X ",
      "MessageIndex": 7,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112660/padgets-desease",
      "Title": "Padgets desease"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "A week in hospital after my mx and diep almost drove me mad so can't begin to imagine what 7 weeks must have felt like ... And with the disappointment, saddness and anger at all the complications and the results not being what you had hoped for - that's a lots to deal with  I was so disappointed with my initial result, couldn't stop crying for several weeks  - 4 months on I'm feeling better about my new boob but I know I had no where near as many problems as you ... not sure how I would cope  you sound a brave and courageous lady, I hope being back home helps your recovery ... And you take those stairs as slowly as you need ellen xx",
      "MessageIndex": 6,
      "PostDate": "12/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106524/back-from-hospital-after-diep",
      "Title": "Back from hospital after DIEP"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi always  Yes I was wondering if you were planning to go on your own or with someone else? I asked because whilst I went away during treatment I wouldn't have done it on my own ... I was with my partner and stayed with family so lots of people around for support, and plenty of opportunity for rest which was very much needed  xx ",
      "MessageIndex": 9,
      "PostDate": "01/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115590/can-l-fly-liverpool---dublin-after-all-chemo-s-have-finished",
      "Title": "Can l fly Liverpool - Dublin after all Chemo's have finished ?"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "As others have said I think it's very much person by person, I'm a Social worker but managerial and mainly office based now and was able to work through chemo and approached each one in a three week cycle - I had a supportive boss which took a huge pressure off.  I was tired by the end of cycle 6 and then took time off as I had surgery (mx and immediate diep recon ) and that needed most recovery time  ... I was back at work by the time I had radio and worked through that with a couple of weeks off after to sleep - 4 weeks on I am now back in every day but trying to do two short days a week  You've got to do what works for you and listen to  your body, work was important for me as it gave me a sense of control over my life when everything else felt out of control, and my brain was turningto mush with all the day time tv!!  but everyone is different and you shouldn't feel pressured to do anything that doesn't feel right for you, and things may change ... I certainly couldn't have made a firm commitment to do anything beyond the next week during chemo and each cycle was different  Good luck with treatment - it's not nice but it is doable and it does get better  Ellen x ",
      "MessageIndex": 5,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107552/work-during-treatment",
      "Title": "Work during treatment"
    },
    {
      "AuthorID": "ejm1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejm1",
      "Content": "Hi always baking Just to give you another view, not  to disagree with the advice given above as  everyone has to do what feels right for them - I  went on holiday for a week between cycle 4 and 5 of my chemo ... With agreement of my dr's  Only went to France to see my mum so not the most extrenous holiday but I flew without issue - things to think about :   if you did go who would you go with? what would you be doing - you will be tired and need to rest so don't plan too much, Is there a good hospital close by in case of any probelms ? What do your dr's / BCN say ?  There are other people in this site who have been away but it's a personal decision and everyone's different - for me it was important to lik after my emotional health as well as physical and the trip helped  Hope the rest if your treatment goes well and you get to enjoy your trip - sooner or later it will still feel great  Take care  Ellen ",
      "MessageIndex": 4,
      "PostDate": "29/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115590/can-l-fly-liverpool---dublin-after-all-chemo-s-have-finished",
      "Title": "Can l fly Liverpool - Dublin after all Chemo's have finished ?"
    }
  ]
}