{
  "AuthorID": "Ejmf",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejmf",
  "Posts": [
    {
      "AuthorID": "Ejmf",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejmf",
      "Content": "Thank you so much for your advice - and everyone else.... I am just at my wits end! having people listen and understand is a start to helping me.  I do feel like they aren't quite taking this very seriously and I feel as if my GP was happy to bush me off with a quick fix of Imodium. I don't think blocking me up is really the Answer.  Like yourself I've ended up doing lots of research and it sounds like my colon and lower intestines have gone into spasm due to the effects of the chemo. Doesn't sound too far fetched as the rest of my body did a few days prior. It also seems as if anything that touches the walls of my intestines e.g. Food and cold water is enough to irritate them.... this is leading me to believe that my digestive systems either had a huge reaction to chemo and that they are really inflamed and delicate. I'm struggling to get the oncologist to listen to this and maybe find a solution to help my insides  rather than just deal with the obvious problem of diarreaha. Not to self diagnose but maybe the onc looking outside the box at peritonitis would make more sense.  I am no managing to keep warm cups of camomile and Manuka honey tea inside me along with arnica tablets as recommended by a homeopathic dr so I'm hoping my symptoms might start easing off.  Feeling less helpless and desperate with so much support fro this wonderful community  Thank you xx ",
      "MessageIndex": 6,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121541/docetaxel-terrible-stomach-and-no-longer-coping",
      "Title": "Docetaxel terrible stomach and no longer coping"
    },
    {
      "AuthorID": "Ejmf",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejmf",
      "Content": "Feeling desperate now - hi guys I had my 4th round of chemo 11 days ago now but it was my first round out of 3 of docetaxel.  I suffered with really awful unbearable shooting pains and spasms all over my body and in my stomach on days 4-7ish. Luckily the onc prescribed me some Oromorph and diazepam which seemed to dull the spasms and pains a bit.... at the very least the Oromorph knocked me out so I could get some sleep. But it seems like one problem went and another arrived.... by the 7-8th day I started with terrible diarrhea when I had been previously been really constipated (sorry to be so graphic) since, I've barely been able to keep water in my body and I now haven't eaten for 4 days as anything that goes in comes straight back out and is very painful.  I feel like my intestines and colon are in spasm and really inflamed and it is the most terrible pain I've ever felt. I had an emergency appointment with onc yesterday and she suggested I might still be constipated as I was passing a lot of water. I was prescribed lactulose, buscopan and sena and told to eat as it will help push any blockage through. Since following the doctors instructions minus taking the sena I have been on and off the toilet for 11 hours now at least ever 2-5 mins. Again only passsing the food I had eaten that day and now just water. I have rung my GP and he suggests Imodium. Please is there anyone with any advice? I just feel like what ever I take makes it worse and I'm getting to the point of no longer coping.... the pain is constant and relentless. Sorry for such a long detailed post but I am absolutely desperate now for some help. Thank you :-( Emma",
      "MessageIndex": 0,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121541/docetaxel-terrible-stomach-and-no-longer-coping",
      "Title": "Docetaxel terrible stomach and no longer coping"
    },
    {
      "AuthorID": "Ejmf",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ejmf",
      "Content": "Hiya I had a single mastectomy in September and used a website called \"Nicola Jane\" I tried a couple of bras from there and the ones that I love were the \"soft T-shirt\" bras. They seemed to be really supportive and gave a really nice shape without being too rigid and making me sore. They also do them with a little lace Cami bit that sits really flat to your chest so you don't have to worry about wearing any tops or t-shirts that might accidentally gape open.  Good luck, I hope everything goes well  X ",
      "MessageIndex": 6,
      "PostDate": "02/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119030/single-mastectomy-bras",
      "Title": "Single mastectomy bras?"
    }
  ]
}