{
  "AuthorID": "Elaine64",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elaine64",
  "Posts": [
    {
      "AuthorID": "Elaine64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elaine64",
      "Content": "Hi, This is my first post. So many questions!!!! I had a bilateral mastectomy on 27th August with immediate reconstruction with implants. The swelling though is not improving, also I cant lie down as then it affects my breathing (it hurts, and restricts breath) I know its early days but a sleep would be good. Does anyone have any tips for me?? I did ask about the pain when I was at the clinic and they said sounds like I have maybe pulled a muscle after op too!!! I cant help but worry that the cancer is also in my lungs, or ribs - does anyone else have experience of any of these issues. Any insight greatly appreciated. Also I will start chemo in 2 - 3 weeks and get my nhs voucher for a wig next week !!! Cancer was also in 1 lymph node - they removed 6 to test so radiation is on the list too for later.",
      "MessageIndex": 0,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53137/anyone-else-had-mastectomy-with-reconstruction",
      "Title": "Anyone else had mastectomy with reconstruction?"
    },
    {
      "AuthorID": "Elaine64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elaine64",
      "Content": "Hi Yvonne,Thanks for the reassurance it sounds like you have had similar experience, which is reassuring. Its hard to stay positive all the time. :) Also I have never used a forum before..... isn't this whole experience so full of firsts!!!! ... Elaine xxx",
      "MessageIndex": 4,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53137/anyone-else-had-mastectomy-with-reconstruction",
      "Title": "Anyone else had mastectomy with reconstruction?"
    },
    {
      "AuthorID": "Elaine64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elaine64",
      "Content": "Thanks to Vanda & Helen, I too bought the V cushion to help the sleep sitting up. I think I maybe need them to up pain relief, I only have paracetamol and dicloflex. Tramadol made me sick when in hospital. I dont think it is unusual to have reconstruction with chemo - well nobody mentioned anything when it was being discussed pre op!!!! At that time though they did not expect me to be getting radiotherapy too. I think I am an impatient sort so I expected things to be improving after op..... the fluid build up is getting a bit bad also I have redness on the right side which is spreading, though to me it doesnt feel hotter than the left - its weird when the skin is numb!!! Back to hospital tomorrow anyway to meet with haematologist to discuss chemo. Thanks again, Elaine xxx",
      "MessageIndex": 5,
      "PostDate": "10/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53137/anyone-else-had-mastectomy-with-reconstruction",
      "Title": "Anyone else had mastectomy with reconstruction?"
    }
  ]
}