{
  "AuthorID": "EleanorNya",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eleanornya",
  "Posts": [
    {
      "AuthorID": "EleanorNya",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eleanornya",
      "Content": "Hello everyone, I am new to this site but I have been reading your posts and found them refreshing. I thought I would come forward and see your opinions on the rollercoaster cancer adventure that my Mum has had. She was diagnosed with breast cancer at the end of last year. The tumour looked small and they recommended a lumpectomy. After this, she was told it was removed with clear margins and no lymph node involvement. They were planning on radiotherapy and hormone treatment as the next step. However, as they discovered in the biopsy that it was a lobular cancer, they needed to do an MRI test just to ensure that the other breast was clear. Today we had the opinion with her consultant and her confirmed that the MRI results showed two small areas of concern. One on her left breast, and one on her right. Both are around or under 3mm. They also found a nodule on her chest. The doctor thinks this nodule may be a \"red herring\" but he wants to do a CT scan just to check. Now she will need another needle biopsy, CT scan and ultrasound. Speaking to the other ladies on here who have fought breast cancer - is this a time to lose hope? I am so frightened, I don't want to lose my Mother. Even though I am aware lobular cancer can appear in both breasts, I am worried that it may have spread. And has anyone else had a similar experience? Any stories which may give me some hope would be greatly appreciated right now! Thank you for reading this (I apologise this is so long) xxx ",
      "MessageIndex": 0,
      "PostDate": "30/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148603/lobular-breast-cancer---concerned-daughter",
      "Title": "Lobular Breast Cancer - Concerned Daughter"
    },
    {
      "AuthorID": "EleanorNya",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eleanornya",
      "Content": "Thank you :) Taken some time to breathe and calm down.",
      "MessageIndex": 2,
      "PostDate": "30/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148603/lobular-breast-cancer---concerned-daughter",
      "Title": "Lobular Breast Cancer - Concerned Daughter"
    },
    {
      "AuthorID": "EleanorNya",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/eleanornya",
      "Content": "Thank you all for the lovely words, you’ve all reassured me. I think it’s the waiting which is the hardest part, but the NHS have already scheduled in her tests for the end of this week which shows they are being very proactive. I just want to know what the next steps will be even if it means she’ll need even more surgery and chemotherapy. It’ll just be one step closer to her recovery.  Please keep all of your fingers crossed for my Mum! Lots of love to you all xxxx",
      "MessageIndex": 6,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148603/lobular-breast-cancer---concerned-daughter",
      "Title": "Lobular Breast Cancer - Concerned Daughter"
    }
  ]
}