{
  "AuthorID": "Elsie123",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
  "Posts": [
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "Good luck for tomorrow,  I'm the other lady tstock70 mentioned getting results tomorrow, not sure how I'm going to get through work in the morning as my apps not til 3pm xxxx",
      "MessageIndex": 9,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123656/awaiting-breast-biopsy-results",
      "Title": "Awaiting breast biopsy results"
    },
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "I'm due to start my chemo on 14th and have my pre chemo meeting tomorrow - if I ask for a PICC line then will they just let me have one fitted at some point before my chemo starts or will they insist I try having it in the back of my hand or wherever they choose to put it first? I really think if it makes life easier I would like one fitted, it's bad enough having to go through all this let alone have other problems which could be overcome if a PICC line can be fitted - can anyone advise me please? Thanks in advance Lynne xx",
      "MessageIndex": 13,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129647/picc-line---advice-please",
      "Title": "PICC line - advice please"
    },
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "Thanks as12, I shall ask tomorrow then and see what they say, knowing my luck so far there will probably be a wait, maybe they will see how I go the first time and take it from there, thank you for replying",
      "MessageIndex": 15,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129647/picc-line---advice-please",
      "Title": "PICC line - advice please"
    },
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "I had a PICC line fitted on Weds due to my veins protesting at the chemo cocktail, had an Oncology appt yesterday where I bumped into my BC nurse and I questioned my concern about how my BP would now be taken as they can't use my other arm due to lymph node removal, she said they could do it on the lower part of the arm with the PICC or on my leg. Today I had my pre-chemo appt and said to the nurse about where she would put the cuff and offered her my lower arm, she said \"it's ok we just put it over the PICC\" and proceeded to take my BP with the cuff directly over where the PICC is inserted - I had briefly read up on this before I went and didn't think it was a good idea, especially after asking my BC nurse the day before but I didn't like to question her as you assume they know what they are doing - has anyone else experienced this, or can give me any guidance for next time, it was horrible having the PICC inserted (apparently I have very thought skin!) and I don't want problems caused unnecessarily with it but don't want to do battle with the nurse next time either! Thank you",
      "MessageIndex": 0,
      "PostDate": "28/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134637/blood-pressure-cuff-and-picc-line",
      "Title": "Blood pressure cuff and PICC line"
    },
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "Thank you for all your replies, nurse didn't query reading so presume it was ok, I have since discussed with a nurse friend and been advised that it is best to use either the \"good arm\" (I don't have) or below the PICC insertion, she said the lines are quite robust so shouldn't get damaged but if the cuff is placed directly over the PICC it can be painful due to it digging in - which it was! So I shall request it is done on lower half of arm in future - like you say - my body!  I was given a card to then give to my GP to get a limbo prescribed for showering - why they don't just give you one when they put the PICC in I don't know, they know you need it! It was  a right faff toing and froing from the GP to the Pharmacy due to them not sending script to pharmacy - last thing you want to be doing is chasing around when you're already knackered! The limbo is easy to use, just a bit tight getting it over the PICC but it doesn't leak.  I am probably going to get a cover from livebetter - there seems little choice in the UK but can't put up with the tubi grip keep rolling up/down, it gets quite tight and uncomfortable like you say. Thank you for all your responses xx",
      "MessageIndex": 6,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134637/blood-pressure-cuff-and-picc-line",
      "Title": "Blood pressure cuff and PICC line"
    },
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "Hi toxophilite,  Yup have had 5 days of injections of Filigristam from day 5 of each cycle, but doesn't appear to be enough to bring my levels back up  this time my levels were 0.9 and been told they need to be at 1.0 or above so hoping the extra week means they'll be back up, nurse said once on Docetaxol they sometimes give them to you for 7 days so maybe if they do this for me I might not keep getting the delay - I am worried about the effectiveness with the delays! Lynne xx",
      "MessageIndex": 9,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136637/docetaxol-and-clexane",
      "Title": "Docetaxol and Clexane"
    },
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "After many weeks with pain in my lower \"good\" arm I have been diagnosed with a 5cm thrombophlebitis, caused by the first 2 rounds of FEC, had my third cycle through a PICC line (thank god I had that fitted!) fortunately clot isn't in same vein so PICC is still useable.   I am now on Clexane injections for 6 weeks (fun - not!) and cream to massage in, am starting my Docetaxol next week, I am now concerned about pain relief for the joint pain, I already suffer with leg/foot pain.  I was told by chemo nurse previously that I could alternate paracetamol and ibuprofen plus they could give me I think cocodamol but now I've read that the ibuprofen and cocodamol can interact with the clexane - I don't want to just be left with paracetamol (pretty useless for pain in my opinion) - anyone else been in the same boat? I'd like to be prepared beforehand.  Many thanks Lynne",
      "MessageIndex": 0,
      "PostDate": "25/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136637/docetaxol-and-clexane",
      "Title": "Docetaxol and Clexane"
    },
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "Lovely, thanks Karen,  I googled (as you do lol!) and wasn't sure on the cocodamol front I found something that said it may interact but like you say pharmacist or GP best port of call, fingers crossed it won't be too bad...... Lynne xx",
      "MessageIndex": 2,
      "PostDate": "25/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136637/docetaxol-and-clexane",
      "Title": "Docetaxol and Clexane"
    },
    {
      "AuthorID": "Elsie123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elsie123",
      "Content": "Thanks everyone for your replies, I have my pre-chemo on Tuesday (hoping bloods are ok  - had neutropenic sepsis in hospital for 5 days after round 1, delayed by a wk as neutropenic after round 2 and neutropenic again after round 3,  so delayed by a wk again this time - sigh!) will be requesting some form of painkiller be given to me when I go for my Docetaxol on Thursday. Fingers crossed. Enjoy the BH weekend  Lynne xx",
      "MessageIndex": 7,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136637/docetaxol-and-clexane",
      "Title": "Docetaxol and Clexane"
    }
  ]
}