{
  "AuthorID": "Elvy",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elvy",
  "Posts": [{
    "AuthorID": "Elvy",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/elvy",
    "Content": "Dear Aileen I'm very sorry to hear of the unexpected consequesces of your breast reconstruction. Did you ever find out what caused you to be rushed to the hospital with cellulitis? Was it an infection? Did the \"sunken valley\" develop before going to the hospital or after? Could you explain, please. I had a lumpectomy in 2001 on my right breast. After 7 years of camouflaging the \"valley\" in the top part of my breast with a bra, I have decided to go for reconstruction. Last summer I went for a consultation and the plastic surgeon concluded that the best thing to do would be a \"Latissimus Dorsi Mayocutaneous Flap\" for volume and skin replacement. Is that what you also had? My big concern now is just what I'm reading on these pages. Margie is in great pain, you have bad scars on your breast, and who knows how many other complications women have had from this operation. I joined this site because I wanted to find out from other women who have had LD reconstruction if the back (the area under the armpit where the surgeon will take the flesh) looks very bad after the operation. I never thought I would suffer from restriction of movement in my arm (maybe the surgeon had mentioned that as a possibility, but it didn't register with me very well). I wouldn't want to fix one part of my body but damage another. Now that I have read what some of you are going through, I don't know where to go to get honest, quantitative answers. I think I'll have to call the surgeon, or go for a second opinion, and ask what percentage of women develop problems after the operation. Well, I think I've answered in part my own question, but I would very much appreciate any advice on this matter. Hope your condition improves! Elvy",
    "MessageIndex": 3,
    "PostDate": "28/02/2009",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10861/anyone-had-problems-after-lat-dorssi-reconstruction",
    "Title": "Anyone had problems after Lat dorssi reconstruction"
  }]
}