{
  "AuthorID": "Emaline",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emaline",
  "Posts": [
    {
      "AuthorID": "Emaline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emaline",
      "Content": "Hi Touche.  The waiting game is awful and I know how you are feeling.  I got referred on 21st Jan and had a mammogram, scan and a core biopsy on 19th Feb.  The consultant told me I had a 3.5cm tumour with fast multiplying cells which scared the crap out of me.  Had to wait another 9 days for the full biopsy results....that was today.  I'm one of the lucky ones as they are pretty sure its a benign phyllodes tumour.  If I wasn't so exhausted from lack of sleep I would have jumped for joy. You have done the right thing by joining this site and hopefully it will help you as it has me get through the 'limbo' time.  I really hope you get good news but in the meantime if ever you want to chat please feel free to do so. xx",
      "MessageIndex": 10,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177266/appointment-tomorrow",
      "Title": "Appointment tomorrow"
    },
    {
      "AuthorID": "Emaline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emaline",
      "Content": "Thanks and yes I've read through the messages :).  The wait is almost over....only have to wait until 4:40pm tomorrow.  It's been the longest 9 days of my life as I'm sure it was with everyone else.  Today is my hardest day so far as I've been wishing for tomorrow to come but now it's almost here I'm not sure I want it to be but on the flip side all could be fine...well as fine as can be as all I have going round in my head like a stuck record is the cancer support nurse saying that even if it's benign it will more than likely need to be removed. I know worry doesn't do any good but my stupid brain keeps thinking that they know more than they were letting on.  I'm sure each and everyone has had the same feelings so I know I'm not the only one whose going/gone through this.   I must say though that joining this group has helped me get through these days.  Thanks.",
      "MessageIndex": 23,
      "PostDate": "27/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176093/cold-feet-the-tv-programme-not-the-things-on-the-end-of-your-legs",
      "Title": "Cold Feet (The TV programme not the things on the end of your legs..."
    },
    {
      "AuthorID": "Emaline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emaline",
      "Content": "Sorry if I've attached this to someones reply, I'm new here and not sure of my way round. I've found it a hard watch as I found a lump on 19th Jan, Docs on 21st (day before my 40th) and got referred.  Was told I would see someone within 2 weeks but the waiting list was long so had my appointment last Tuesday.  Initial results are 3.5cm tumour with fast multiplying cells.  I have 9 days wait from that finding to my next appointment.  She handled it very well in the programme and I feel weak compared to her, I find the waiting time I is the hardest.  However, even though i's just a programme it's something for me to aspire to and try to be strong without burdening my family too much with my emotions.",
      "MessageIndex": 14,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176093/cold-feet-the-tv-programme-not-the-things-on-the-end-of-your-legs",
      "Title": "Cold Feet (The TV programme not the things on the end of your legs..."
    },
    {
      "AuthorID": "Emaline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emaline",
      "Content": "I'm sorry as I feel like I'm taking over this thread but I wanted to update you with my results.....GOOD NEWS :)  No cancer cells in the biopsy results.  But with the irregularity of the shape and the rate it's growing they are going to remove the tumour and check it thoroughly .  They are pretty sure it's a benign phyllodes tumour and should be in and out of hospital on the same day (25th March). When I asked if it will look 'different' he said if you had the breasts of a 20 year old probably not but as my breasts are 40 years old there may be some miss shaping.  I felt like getting the puppies out as he hadn't even seen them before making this comment as they are pretty damn good lol.  When he did examine me I almost said to him 'not bad eh!!, I couldn't hold a pencil under them'......I think the good news and lack of sleep has got to me.",
      "MessageIndex": 25,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176093/cold-feet-the-tv-programme-not-the-things-on-the-end-of-your-legs",
      "Title": "Cold Feet (The TV programme not the things on the end of your legs..."
    },
    {
      "AuthorID": "Emaline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emaline",
      "Content": "Just after a little advice/reassurance from anyone who has been through this. I'm having a lumpectomy on Monday, they are pretty sure it's benign but due to the irregularity and speed of growth it has to be removed.  My concern is that since I last seen a specialist the tumour (which was 3.5cm) is now bigger and I can barely tell where the tumour ends and my nipple area begins. I would really appreciate any replies from others who have gone through this.  Also what would you consider normal recovery time?  I'm hoping to be back in work within a week. TIA ",
      "MessageIndex": 0,
      "PostDate": "22/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178566/lumpectomy-concerns",
      "Title": "Lumpectomy concerns"
    },
    {
      "AuthorID": "Emaline",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emaline",
      "Content": "Thank you for you replies.  I'm back home and all went well.  Like you spanglers they cut around my nipple to get to it which I'm very happy about as the scar will hopefully blend in.  I came to pretty quick and well and was curious to what they removed and jokingly asked if they had a photo of it, they told me it was still in the room in a sealed plastic container and if I really wanted to see it I could.  Not to everyones taste I know but I wanted to know what it looked like.  It was surprising how big it was and the shape it had formed but in some weird way seeing is believing....it's out, it's not growing in me anymore etc etc. I'm sure I will read this another time and realise I shouldn't have posted whilst still drugged up.   One more step to go, post op appointment a week on Thurs for final results but I have a good feeling :)  Oh and as for time off they done the routine 2 weeks sick note from the hospital but I have to see the GP before the end of that to see when I can return.....so much for a week off.",
      "MessageIndex": 4,
      "PostDate": "25/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178566/lumpectomy-concerns",
      "Title": "Lumpectomy concerns"
    }
  ]
}