{
  "AuthorID": "Emem",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emem",
  "Posts": [
    {
      "AuthorID": "Emem",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emem",
      "Content": "Hi Folks, Very new to this whole breast cancer thing - also very new to online forums. Have had my surgery - they took 10 cm tumour out 3 weeks ago & a lymph node clearance, with 4/24 having the nasty stuff. So I start chemo ( FEC-T ), tomorrow with Herceptin then apparently radiotherapy & hormone therapy. Trying to get used to all the terms & feel I've not done my homework. Anybody else in the same boat?",
      "MessageIndex": 57,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172565/december-2018-breast-cancer-chemo-chat",
      "Title": "***December 2018 Breast Cancer Chemo Chat ***"
    },
    {
      "AuthorID": "Emem",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emem",
      "Content": "Hi folks - I  find it really useful reading all the posts- I went for a short cut - which is falling out and am going for lots of scarfs. I'm on my 2nd cycle of FEC-T post mastectomy & full node clearance  and had a fairly dramatic time for number 2 ( 28th Dec). On my 1st cycle I'd been told I had great veins & the FEC was pushed through quickly.  This time most of my veins had collapsed. After 3 goes and a lot of hoaking they found one for the cannula but it all had to go very slowly and was painful with many stops & checks by nurses & doc. When it got agonising I got the full works curtains whipped round bout 5 nurses with all sorts of carts & syringes- concerned doc - they stopped totally then with two thirds of the last drug still to go. Big drama - didn't turn into what they suspected so that was good & they've convinced me to get a PICC line for next time ( any advice on that well appreciated).  Anyway the point of all this is he measured my arms to check for swelling in the cannula arm and told me with great (& I think inappropriate) delight that it was 1.5 cm smaller than my surgery arm - that means likely lymphedema doesn't it? I'm in holiday limbo with no idea of who to ask about this.....oncology helpline doesn't seem appropriate.....breast care nurse on Monday? Gp? Physio? Have the horrors of lymphedema- I know it might seem small beans in the scale of things but urrrgh. Ps also have a wound infection just over me from reduction on other boob- over the antibiotics but not healed yet & bit of hole in my boob - So not clear on whether to carry on the exercises or not. ",
      "MessageIndex": 222,
      "PostDate": "30/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172565/december-2018-breast-cancer-chemo-chat",
      "Title": "***December 2018 Breast Cancer Chemo Chat ***"
    }
  ]
}