{
  "AuthorID": "emma1978",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emma1978",
  "Posts": [
    {
      "AuthorID": "emma1978",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emma1978",
      "Content": "Thankyou Linda so much, you have made me feel so much better! I only know the horror stories so its nice to speak to someone who is fighting the horrible thing! The reason i went to the doctors was because a 'friend of a friend' had just been to a funeral of a 32yr old who died from BC. That shook me up and made me check myself which then i found the lump. The doctor said it wasnt anything to worry about but to get it checked. Next thing i know the GP said it is very bad news, I have BC and need a mastectomy. I just keep thinking i hope her very bad news was just that and not that the cancer (i hate that word) had spread. I dont mind losing my boob infact they can take both of them off if it means i will live till im old! Im going on Monday for my consultation which seems like years away, i sort of wish they had of just done the op there and then when they told me! I feel a little scared but am trying to stay positive, i only cry when everyone else cries! I have so many good friends and family all saying prayers and keeping their fingers crossed for me, so im very lucky. Unfortunately i dont have any children but i have 2 beautiful nieces age 2 and 5 month who i fully intend on seeing growing up! Do you mind me asking if you are still having chemotherapy? Thanks for mailing me and keep in touch, I just know that we will be emailing each other when were pensioners laughing at this time of our lives!!! Emma xxxxxxxxxxxxx",
      "MessageIndex": 9,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10721/new-to-the-club",
      "Title": "New to the club."
    },
    {
      "AuthorID": "emma1978",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emma1978",
      "Content": "Hi, i am also new to this site and just joined today after coming home from the hospital with news I have to have my breast removed next week as i have 2 small tumours. Im not sure if it has sunk in yet as Im trying to keep positive and everyone around me is desperately trying not to cry! I think i never thought it would happen to me as i am quite young and fit but it has soi have to deal with it. I dont have any children and that will be my biggest loss if i cant have any, then i will be saddened. Im more scared that when they do the operation they will find more cancer elsewhere. I just wish i didnt have to wait till next week, i feel like i just want it over and done with asap. I was wondering if anyone knew how soon after the operation the chemo will start and how often? Basically i dont know what is going to happen to me except i will loose my breast at the moment.",
      "MessageIndex": 6,
      "PostDate": "23/04/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10721/new-to-the-club",
      "Title": "New to the club."
    }
  ]
}