{
  "AuthorID": "EmmaF118",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmaf118",
  "Posts": [
    {
      "AuthorID": "EmmaF118",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmaf118",
      "Content": "Hi all. My names Emma and I'm new to this group. I'm hoping that there may be someone out there who can help me as I've got an important decision to make. I was diagnosed with breast cancer in December and due to the aggressiveness, I was put straight onto chemotherapy. I completed my chemo last week and am now in discussions with my surgeon about my upcoming mastectomy. I know that my cancer is very aggressive and a number of other factors mean that I am at high risk of getting cancer again in my other breast. I really don't want to go through this ever again and so have been considering having my unaffected breast removed at the same time, as a preventative measure. This is a huge decision for me to make and I was hoping there may be someone out there who has opted to have the \"good breast\" removed, just in case. If so, is there any advice you can give me? I realise that this has to be my own decision but am hoping to get some advice on the decision making process and perhaps how people have felt after going ahead with this. Any advice would be greatly appreciated. I should point out that I am 33 and have not yet had children, so this would be a big step. But one that I think may be worth taking? Thanks",
      "MessageIndex": 0,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49576/preventive-surgery",
      "Title": "Preventive surgery"
    },
    {
      "AuthorID": "EmmaF118",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmaf118",
      "Content": "Thank you all for your feedback and support. I plan to do some proper research tomorrow but it's really helpful to hear your thoughts. I'm unable to have reconstruction straight away due to needing radiotherapy after surgery. So I'm swaying towards having only the necessary surgery now, then having the other breast removed and reconstructed at the same time as my reconstruction for the original mastectomy. However, no final decision yet. This certainly isn't easy!! Thanks",
      "MessageIndex": 5,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49576/preventive-surgery",
      "Title": "Preventive surgery"
    },
    {
      "AuthorID": "EmmaF118",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmaf118",
      "Content": "So after a long year, I've finally finished my treatment for breast cancer and am slowly rebuilding my life. Chemo started at the beginning of January and my hair had fallen out 10 days later, I lost every hair on my body. My chemo ended in May and gradually my hair has been growing back. I've now got eyebrows, eyelashes and thick but short hair on my head. Sadly all other hair that a lady doesn't want came back too. My radiotherapy ended four weeks ago. I expected to lose hair on the armpit of the side that was being treated. However, I noticed that my other armpit had also gone bald. Bonus, I thought! But as time passes, I've noticed that hair elsewhere on my body is not growing back. Great, so I don't have to shave my legs. But my eyebrows are falling out again and the hair on my head which was growing really fast, has come to a stand still too. Is this normal?? I thought radiotherapy only affected hair on the area being treated. I'm now really scared that something is going wrong and I'll lose my hair completely again. Has anyone else experienced this? I guess after everything I've been through this year, it's not the end of the world, but I was finally starting to look human again and am really upset at the thought of this. I don't know what to do! Any advice, thoughts, or similar experiences would be greatly appreciated. Thanks  Emma x",
      "MessageIndex": 0,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53903/hair-loss-again---advice-please",
      "Title": "Hair loss... Again?? - Advice please"
    }
  ]
}