{
  "AuthorID": "Emmie76",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmie76",
  "Posts": [
    {
      "AuthorID": "Emmie76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmie76",
      "Content": "Hi Kerry, well today is the day I find out. Appointment is at 10.30am. I feel like I'm wasting everyone's time as it's most likely nothing but a fatty lump but then on the other hand the symptoms I'm getting do tend to point towards cancer. With the lump I've had an achy painful boob and shoulder/neck pain on the same side so whenever I read up about it I almost convince myself it is cancer then feel like I'm a hypochondriac. I can't really put into words how I feel because I just think to myself it won't happen to me and all this fuss is for nothing. Fingers crossed I'm ok. Emma xx",
      "MessageIndex": 6,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136737/new-and-nervous",
      "Title": "New and nervous"
    },
    {
      "AuthorID": "Emmie76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmie76",
      "Content": "Hi everyone my name is Emma and I'm 41 married with 6 kids although 3 are adults now. I have had a lump in my right armpit directly next to my breast as apposed to deep inside my armpit. I finally went to my appointment with my GP after cancelling 3 previous appointments think the lump would go away. I have been suffering with all over breast pain but no pain in the lump which is about the size of a grape. My GP referred me to the breast clinic and my appointment is Wednesday. Has anyone else here had cancer diagnosed from an armpit/underarm lump? Will I have a biopsy the same day? And how long does it take for the results? And should I insist on a biopsy even if they think the lump isn't suspicious? (I have read too many stories of ladies being told the lump isn't expected to be cancer only to be told after a biopsy that it is indeed cancer). I'm trying not to worry but have a very strange feeling about it and I'm not sure if I've talked myself into believing it's going to be bad news or if this is a genuine 'sense or instinct' that something is very wrong Emma x",
      "MessageIndex": 0,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136737/new-and-nervous",
      "Title": "New and nervous"
    },
    {
      "AuthorID": "Emmie76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmie76",
      "Content": "Hi Sal and Thank you so much for your comforting words. Why is it always at this time of night the worry peaks.... I don't know why I have suddenly started over thinking it, I was and to a degree still am calm about it, I just found myself needing someone to talk to. I am hoping I just have a lipoma or fatty lump although it seems I should be able to move it and it should be soft if that was the case, However my lump is hard and fixed and not painful. It also feels like it's attached to the breast tissue as if it's inside the breast but protruding into my armpit if that makes sense. I feel like I'm some crazy hypochondriac, making assumptions when I could potentially be completely fine. It's just this weird feeling something isn't right. I'm just grateful I have somewhere to vent and hopefully on Wednesday I can come back with good news. I never expected to be sent to the breast clinic at all, I expected my GP to say it's just hormones or something like that which is why I kept cancelling my appointments. I hope to hear from others who found lumps in their armpits who can tell their story. Thanks for the hug it's much appreciated",
      "MessageIndex": 2,
      "PostDate": "27/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136737/new-and-nervous",
      "Title": "New and nervous"
    },
    {
      "AuthorID": "Emmie76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmie76",
      "Content": "10.30am and I'll be sat in the clinic for my appointment. I have so many classic symptoms.... Armpit lump (right armpit) Painful achy boob Inverted nipple Shoulder and neck pain on same side I'm fleeting between I have cancer to this is a time wasting experience as I'm fine. I feel so nervous....  May I ask, even if they think it's a 'fatty lump' will they still biopsy? I've been encouraged to insist on a biopsy if they don't automatically do it, is that the right thing to do?  I don't want to cause an inconvenience but at the same time don't want to sit here wondering how they know it's just a fatty lump. I think I'm feeling so nervous because I feel like I'm going to have to go in demanding a biopsy if they don't decide to do it. I don't want to be an idiot at the clinic and look like a fool. Has anyone got any advice for the clinic? I know the procedure is mammo, ultrasound then biopsy. However I am scared of being sent away without a biopsy so I know for sure I'm ok as I know I will get stressed if they don't check the lump. Emma xx",
      "MessageIndex": 0,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136930/test-day-today",
      "Title": "Test day today!"
    },
    {
      "AuthorID": "Emmie76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmie76",
      "Content": "Morning Sal. Thank you for replying   I sort of think yes it could be BC but in another sense I am like, we'll hang on a minute woman you've gone into brain overdrive again, this is just a benign lump. Going through and insisting on a biopsy if necessary and getting the result that I'm fine would be a dream come true. Never again would I think about the 'lump'. I can then focus on getting some info on reducing the pain in my boob and try and get an X-ray with my shoulder and neck. However like you say I have it in my head that BC is a good possibility (expecting the worst) and if it turns out I'm fine then I will be overjoyed.  I wonder if this way of thinking is a minority issue?  Thank you for the lovely hugs. I'm lucky to have an amazing husband who'll be with me today. I actually didn't sleep too bad last night so at least I shouldn't be particularly emotional. Emma xx",
      "MessageIndex": 2,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136930/test-day-today",
      "Title": "Test day today!"
    },
    {
      "AuthorID": "Emmie76",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmie76",
      "Content": "Thank you all so much for the support over the last few days. My news is fabulous and I'm happy to report that after initially reporting to the worst consultant I've ever visited I was sent from his clinic to the breast clinic who took over and did the mammo and ultrasound scan who gave me the all clear. Such lovely nurse and doctor compared to the more morbid one I had to report to first, actually took the time to hear how I ended up there, what I had been feeling and the changes etc. They are 99% certain it's a fatty lump and he was there a good while making sure! Showed my mammo results to me and explained everything, no biopsy needed and I came away feeling a huge weight off my shoulders. Breast pain is still unexplained however. I don't have dense breasts, but I suppose I could be going through menopause. He did say to report to my GP immediately in the future and to keep an eye on myself for any changes. Next time I'll be asking to see a different initial consultant. He was very dismissive, didn't ask about family history or even check my left side.... very naughty. Just a good job I was treated like I was the only patient they had today in the BC. Sorry for the late reply but I had all my crazy lot over for dinner and wine. They had no idea why I was so happy, especially in comparison to what I could've been calling them about! I hope I did the right thing with not having the biopsy? I'm certain that he would've done it should the lump of been suspicious. I feel my mind has been put at rest now anyway. I wish you all lots of love for the future and a fast recovery.  ",
      "MessageIndex": 8,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136930/test-day-today",
      "Title": "Test day today!"
    }
  ]
}