{
  "AuthorID": "Emmz83",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmz83",
  "Posts": [{
    "AuthorID": "Emmz83",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/emmz83",
    "Content": "Wynneth Hi lamg Thanks so much for responding to my question.  I really appreciate it. So fantastic to hear you are cancer free my dear, I do understand that this was the absolutely right decision for you to have the chemo first.  They don't consider my cancer is fast growing and the second consultant I saw told me it had likely been growing for about 18 months up to three years !   As I'd had a clear mammogram in January this year, my initial fear when noticing the lump was that it had grown very fast if I was clear in January then had a sizeable lump by end of April !   However this is not the case, invasive lobular cancer is very sneaky and 'hides' and doesn't show on mammograms, although it was clear on the ultrasound, but it's full size and extent of spread was only seen on the MRI.  It has been sneakily growing and spreading for some time until I noticed a soft swelling on the top of my breast and a very slight change to my nipple.  Ultrasound hasn't shown anything in lymph nodes, but of course they will remove at least sentinel nodes, if not more, during the mastectomy and test them for cancer cells. All this is what has formed my decision to go for surgery first and then blast everything with chemo just in case stray cells have spread, although it's my understanding that if there is no cancer in the lymph nodes, it's unlikely to have spread.   This forum is wonderful, I've only just joined but have already been helped tremendously by everyone, I really appreciate it. Hugs Wynneth X this is amazing to see people sharing information, I wish I had joined when I was first diagnosed in oct 2016. It's been a long hard road but kept positive all the way through. I had the choice of chemo before operation but I decided on a mastectomy first as was stage 3 rapid growing so glad I made this choice, I had my lymph nodes removed but luckily was only in one of them. Had fertility treatment as not yet had children, then chemo then radio and have finally finished, it's a great feeling but had a rough time getting back to normal as fatigue has just kicked in, but getting some great advice on moving forward from my breast care nurse today. How are you coping ? ",
    "MessageIndex": 16,
    "PostDate": "17/08/2017",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
    "Title": "Offered choice of chemo before mastectomy or after - what would you..."
  }]
}