{
  "AuthorID": "Ethel Horner",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
  "Posts": [
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Yes blue tit I echo your last post entirely. Ethel x",
      "MessageIndex": 15,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62353/how-would-money-help",
      "Title": "How would money help?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi babs I'm 24 months down the line I think that your description is (sadly) normal. I've read a few good books 'the cancer survivors manual' and 'emotional support for bc' plus peter Harvey's brilliant article which helped me understand that the impact is enormous and despite what you expect/hope the road to recovery isn't straight forward. It isn't fireworks and non stop parties or even a sense of relief. Your mortality has been exposed and you physical and mental health challenged too. I don't know what to suggest just enjoy any bits you can and endure the other bits and it will start to get better. Ethel x",
      "MessageIndex": 2,
      "PostDate": "08/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74945/feeling-so-down",
      "Title": "FEELING SO DOWN"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Dorothee, I think of Annabel every day and follow her husband Simon's blog (simonhancox1). I was diagnosed at a similar time to Annie and my son was 10. Annies boys Will and Sam are younger than my boy Bill but I understood the fear she felt because of having children so young. Simon seems to be like the kind of dad/man who will make their lives fun and happy. My view (and its only my view I am more than happy for people to disagree with me) is that for the children there is so little to access. I looked into what was available for Bill when I was diagnosed but unless I was dying/terminal/dead there was nothing. It would have been really nice to do something for him. He really wanted to go to the legoland hotel and I scraped the £230 to take him (for a one night stay) but as we drove there on March the 17th there was a snow storm about an hour into the two hour journey and we headed back:( There are so many of us mums who would really welcome some support for our children, maybe not with a trip to legoland but something for them would make our journey a little easier too. I think other than a cure Annie would have wanted us to have some time for fun too?  Ethel x",
      "MessageIndex": 1,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62353/how-would-money-help",
      "Title": "How would money help?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Joanna my son was 10 when I was diagnosed in those first few months I lived In terror of my immediate death. The things that worked for me were: Someone told me to take control of anything that you an because you will seem to have so little as you go along the conveyer belt of treatment. I chose - no visitors, no cards, no chocolates! I didn't want things too different for my boy and I didn't want my front room to look like a funeral home either. I gritted my teeth and asked that anyone who wanted could make a donation to a Lego fund. So every time I had treatment op/chemo/rads my boy got a new Lego model. It was perfect for him and me because I knew he was happily distracted (he was gutted when my treatment was over - jackpot!). I told him the truth that I had breast cancer and that the treatment would be horrible but that I would probably be ok. Like the medics did with me I just told him about the next bit of treatment as it approached. I honestly thought I wouldn't last till Christmas and even felt that living in that heightened state of fear wasn't possible. I rang macmillan. I rang breast cancer care. I rang friends who had it too. I got a breast cancer buddy from breast cancer care. I got the medikidz book on bc for my boy. I told his school. I did whatever I could to get through the next few hours. I was on automatic pilot. I couldn't use these forums early on because I was too frightened to know anything. I used to put my fingers in my ears at appointments. So over two years now since diagnosis. My boy can't even remember anything significant about it! I asked him. For me if someone had said that 'most women don't die if breast cancer' it would have been something to console myself with but I don't think anything could have consoled me. It's only time and survival of each crappy treatment that does that. You do whatever suits you to get through this and you will get through it. You'll be in a different place to the one you were in before and you will know stuff that you didn't want to know but you will be ok. Now is the time to be as kind to yourself as you possibly can be. Ethel x",
      "MessageIndex": 28,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "This really is the nasty government isn't it. Ethel x",
      "MessageIndex": 14,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88234/breast-cancer-drugs-stopped-by-mr-cameron",
      "Title": "Breast cancer drugs stopped by Mr Cameron"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "The simple answer is we are all different - different sizes, ages, medical histories and add into that diagnosis too. The treatment is individually selected to address all the issues that are in the mix. Add into this the choices of different surgeons and oncologists and the treatments end up being different. I would ask your bc nurse or the onc or the surgeon to explain why - they will if you want to know. Well done your nearly through this chemo lark and it should obliterate any lurking gremlins! Ethel x",
      "MessageIndex": 1,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74394/difference-in-treatments-why-so-much-confused",
      "Title": "Difference in treatments. Why so much! Confused."
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi kitty, I finished rads three weeks tomorrow and can't believe how wiped out I feel. My BC nurse said don't think about going back to work for at least six weeks after. Six weeks! I feel like I have been hit with a sledge hammer! Plus I've got a lovely rad burn on my neck that looks and feels like I've been ironing my neck! I was really hoping to start recovering from the last 11 months of mx, chemo and rads but just feel shattered! And yes there's the view of my friends who think its all over. I understand that it can take a long time to recover. It would just be nice to wake up and feel like I've had some sleep. I was glad to read this post as I thought I was being useless! Ethel x",
      "MessageIndex": 3,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57939/wiped-out-after-rads",
      "Title": "Wiped out after Rads !!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Katy, what worked for me was wearing a sleep mask. I put it on and lay down and imagined I was on my favourite beach! Worked every time! Ethel x",
      "MessageIndex": 1,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74485/ct-scan-for-planning-assessment",
      "Title": "CT scan for planning assessment"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Well done you! You'll be amazed just what you can stand when you have too. Ethel x",
      "MessageIndex": 10,
      "PostDate": "02/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74485/ct-scan-for-planning-assessment",
      "Title": "CT scan for planning assessment"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi girls I worked a material headband that covered my ears and forehead! I kept all my hair and had no frostbite. Ethel x",
      "MessageIndex": 4,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63258/cold-cap-experience",
      "Title": "Cold Cap Experience"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Congratulations! Ethel x",
      "MessageIndex": 1,
      "PostDate": "11/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60533/semi-graduate-chemo-done-rads-done",
      "Title": "Semi graduate......chemo done, rads done......"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Bloody Internet, lost my post! in short there's is a relationship between preg/travel sickness and how you react to chemo. There's loads of drugs available that will help this time and make it better next time. There is no mdt who would want anyone to be affected like you are it was what stopped people carrying on with chemo in the past so they will add more stuff to help. You will have a contact number you can call? Ethel x",
      "MessageIndex": 1,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87947/post-1st-chemo",
      "Title": "Post 1st chemo!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Oh Anne, I am an advisory teacher and was told at diagnosis I would be off for a year. And I was! And I couldn't have been in work not only because of the physical side effects but because of what it does to your brain/emotions. I know how much you will need to be the one in control and leading from the front but now it's time for you to be first. Everyone in indispensable. (Sorry) the road ahead will be littered with obstacles which people here can help you with. Time will pass and you can go back to work when you're ready whenever that is but if it's longer than you'd like don't beat yourself up. Good luck ethel x",
      "MessageIndex": 1,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69169/back-to-work",
      "Title": "Back to work?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi tabitha I've been where you are. What I know is what your feeling now won't last. Waiting for test results is the worst aspect of cancer. Hopefully the little blighters won't have got too far. Your lymph nodes are the bouncers stopping unwanted guests from migrating out! The treatment is thorough and amazing so just hang in there kid and take one hour at a time it will pass I promise you. Ethel x",
      "MessageIndex": 3,
      "PostDate": "02/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58308/on-a-proper-downer",
      "Title": "on a proper downer :("
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi tabitha, the pathology report from your mx should stage and grade the tumour so best to give your a bc nurse a call and ask her to go through it with you unless your next appointment is the one that tells you that stuff.? Also call the helpline here or breast cancer care they will be able to help you too. You're right you are not alone take solace from others here it will ease the fear a little. Meanwhile just get through the next few hours. Ethel x",
      "MessageIndex": 6,
      "PostDate": "02/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58308/on-a-proper-downer",
      "Title": "on a proper downer :("
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi saxxyd I am keeping my fingers and toes crossed that the investigations you are having show NED. I too needed a bone scan to investigate bone pain and I lived with that terror of mets from December when it began until last week when the results came back ok. Ethel x",
      "MessageIndex": 5,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58105/postponing-more-chemo-have-i-made-right-decision",
      "Title": "Postponing more chemo...have I made right decision?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Phew!!!! Breath in breath out is my first bit of advice. Your head will be cabbaged for some time to come. You are trying to do what we've all done which is answer everything all at once. You will come to realise that for some of this experience your body will dictate your response and you'll need to find out what it tells you as you go along. My boy was just 10 when I got diagnosed and sometimes I couldn't hide my distress from him. I've just asked my now 12 year old what he remembers of my distress or me telling him. He can't remember!!! I told him the truth. That I had bc and that I would have lots of different treatment to make me better. I told him as we went along about each new treatment/operation. I also told my friends: no cards, no flowers no chocs, no visits because I didn't want my front room to look like a funeral palour and I wanted to keep things the same for him. I did ask that they contribute to a Lego fund and I bought him a model every time I went in or had chemo. He was gutted when I had my last chemo. I learnt in those early days to just do 'today'. You will do what you have to and work will manage whatever that is. Macmillan can advise on finance so talk to them. I used breast cancer cares helpline and buddy system. Someone who had been through it before told me to take control of the bits I could and let the other bits happen (hence my rules for friends). I found texting and daft apps got me through the waiting - there's lots of waiting. Be prepared to not cope, find out who your friends really are and find out what's important in life. There's lots of help here and as those great ads say don't do it alone, we are here to remind you it will be ok. Ethel x",
      "MessageIndex": 1,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72419/1st-post-high-grade-dcis",
      "Title": "1ST Post! High grade DCIS"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Thank you blue tit and saxxyd onwards we go squeezing life out of every day. Xxxx",
      "MessageIndex": 8,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58105/postponing-more-chemo-have-i-made-right-decision",
      "Title": "Postponing more chemo...have I made right decision?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi bonbonlarue, I'd like to ask you a couple of questions but not on the forum, would you friend me? Thank you ethel x",
      "MessageIndex": 46,
      "PostDate": "28/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85836/yay",
      "Title": "YAY!!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi debs, that sounds awful. My mx was a doodle in comparison. I'm sure that amount of pain isn't usual. Get moaning to those medics Hun! King wishes Ethel x",
      "MessageIndex": 1,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59596/5-weeks-post-mx-sent-node-removal",
      "Title": "5 weeks post MX & Sent. Node Removal"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi louise I'm sure someone with more knowledge on this 'front' will come by soon. But your post makes me feel better about my decision to have the remaining breast off and be done with them. Good luck for whatever you decide. Ethel x",
      "MessageIndex": 1,
      "PostDate": "29/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59211/i-have-a-dilemma-with-my-mastectomy",
      "Title": "I have a dilemma with my mastectomy"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi purdy, I'm sorry you're here but you are so you have to get on with it. This forum and breast cancer care seem to me to be the best for good advice and support. I was diagnosed in April 2012 and had a mastectomy, full node clearance, 8 chemo and 15 rads. My lad was 10 when I was diagnosed. What I wish someone hd said to me back then was 'most women don't die of bc today' because that's the truth and it would have given me something to hang onto in those early days. Someone also told me to take control where I could as the control in my life would disappear - it did. I asked friends not to send cards flowers or chocs but to contribute to a Lego fund. Every time I had an op or chemo or rads I bought my lad a Lego set of his choice. He was gutted when I finished my treatments! How fantastic for me! I can't advise on the treatment in your area but someone here will have been in your shoes and I'm sure will be along in a while to add their bit. For now, do whatever suits you it will be right for you. Concentrate on what's right for you and your girls and the next few months will fly by and you will still be here posting to a new girl too. Big hug to you. Ethel x",
      "MessageIndex": 3,
      "PostDate": "19/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60780/does-anyone-have-advice",
      "Title": "Does anyone have advice?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi bonbonlarue, I'd like to ask you a couple of questions but not on the forum, would you friend me? Thank you ethel x",
      "MessageIndex": 31,
      "PostDate": "28/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85836/yay",
      "Title": "YAY!!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Welcome, you will find lots of care and support from the mac family, do not be afraid you are not alone. Ethel",
      "MessageIndex": 7,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56673/hello-i-m-a-newbie",
      "Title": "Hello, I'm a newbie"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi dee, I had a right side mx may 2012. I was in surgery for over 4 hours. Back on the ward at midnight. The nurse helped me (and the two drains and the drip) to the loo and then left me!!!! I had no sleep it was a nightmare. At 7.00 am the surgeon was at the end of my bed telling me the tumor was much bigger than he thought!!!! Omg he frightened me to death. My sister was on the ward by 9.00am and, as I was told that my mobility would be an indicator of my discharge time, we proceeded to go back an forth to the cafe! I was home with only one drain by 5pm. Day 2 after I had codine prescribed by my gp for the pain. The bc nurse came before the op and advised on exercises to start straight away. It was uncomfortable but by week 2 I was driving with a cushion to stop the seat belt rubbing and by week 4 I had full movement and reach. I forced myself to do the exercises throughout the day. It wasn't too bad. The district nurse came to me at home and removed the drin after a week. I did get a lot of fluid in the cavity which was syringed out by the bc nurse but as the nerves are cut ifelt nothing. I have no feeling in my arm pit and don't anticipate this changing much. It really isn't as bad as you think it will be. In fact I am having my remaking breast of ASAP, rather than reconstruction, as I am so pleased with the result. If it was bad I wouldn't be! Your experience may be different I was 49. I'm 50 today! Last May I thought I wasn't going to see this birthday. Good luck Ethel x",
      "MessageIndex": 1,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58858/what-to-expect-just-before-and-coming-out-of-mastectomy-surgery",
      "Title": "what to expect just before and coming out of mastectomy surgery!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Lucy I had my mx (mastectomy) on the 13.5.12 and all my lymph nodes out (they were doing their job and stopping those critters going off on a wander around my body) and 8 lots of chemo and 15 radiotherapy and when that was all done and i'd had a rest ( a further 4 months) I went back and had my other breast off too (mostly because they were big and on its own it looked even bigger! You will be learning how different BC is for everyone including stuff about size, type, location. As you are young they will throw everything they can at you not because your bc is worse than anyone elses but because you will handle the treatment far better. It isn't nice but it should do the trick and mean you are here for many many decades to come. It also isn't an instant death knell by any stretch of the imagination. Do one day at a time, do whatever you need to do to keep control of your life. This treatment will take you to places physically and emotionally that you have never been before. It will change you -  that cant be helped but its (honestly) not all bad and we will be here to prop you up, point you in the right direction and hold your virtual hand, you are not alone! Breast cancer care have great support too so grab every bit you want to because the ride will be rocky and soon it will be you here typing that you are two years on from your mx! Ethel x ps my boy was 10 when I was diagnosed I told my friends - no card, no chocs, no visits (they weren't gonna sit and look miserable on my sofa and drink my tea and eat my cake) but could they make a donation to the 'lego fund'. I used that money to buy my boy a lego set every time i had an operation and chemo. It distracted him and I knew he happily looked forward to each chemo rather than dreading me feeling rough (and for me I've had worse flu its just the non-stop nature of it - it was like being travel sick for 24 weeks!! Actually a bit like I felt when i was pregnant). He was gutted when i finished my treatment (just what I wanted). I talked to him matter of factly and explained all the way through so he knew what was happening.  pps most women who have a breast cancer diagnosis die of something else unrelated - so be careful how you cross the road :D",
      "MessageIndex": 6,
      "PostDate": "08/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76379/30-and-just-diagnosed-with-breast-cancer",
      "Title": "30 AND JUST DIAGNOSED WITH BREAST CANCER"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Ah Wendy that was a nice post to read - thank you Ethel x",
      "MessageIndex": 9,
      "PostDate": "08/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76379/30-and-just-diagnosed-with-breast-cancer",
      "Title": "30 AND JUST DIAGNOSED WITH BREAST CANCER"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi both I was diagnosed with er+ her- p- stage3/grade3 lymph node involvement in April 2012. My son had turned 10 in the January. I had a mastectomy 8 fect chemo (portacath fitted) rads tamoxifen and five weeks ago the remaining breast removed. I wore the cold cap because it was the only time my son became distressed (the thought of me loosing my hair). So kept my hair. Last year he had no holiday, no fun mum! Yesterday I asked him what he remembered about it all - the diagnosis, the treatment, the operations. He said he can't really remember any of it very much! I am so pleased you will all understand. Today I'm packing the car and we are off to Somerset for four weeks as I'm making up for last year. I'll be able to go swimming and enjoy my time with my lovely boy ( and my sister who had a nervous breakdown watching me last year). What ever the future brings I have now and intend to enjoy it for as long as it lasts. So girls grit your teeth, be kind to yourself and you will get through! Ethel x",
      "MessageIndex": 2,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62844/for-anyone-about-to-start-or-going-through-chemo",
      "Title": "For anyone about to start or going through chemo....."
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi ladies I' have completed 4 fec and 1 tax and elected to wear the cold cap. I have kept my hair and just wanted to share my knowledge in case it helps anyone else. The good side is I have my hair which I have treated as I always have done. I wash condition, blow dry and get it trimmed every six weeks! Ok the downside to the cold cap: it elongates the time you have your chemo by many hours. This is because you have to have it on in advance of the treatment. It also needs to be worn after the chem has been administered. If the cap isn't tight enough and you hair not wet and sealed with conditioner it will be less likely to work too. I found that the extra support needed by the onc team isn't forthcoming as they are just too busy. I take my sister and she makes sure its all fitted properly. The other downside is the discomfort/pain when it is initially put on. I do start to panic but If I wait about five minutes the pain and panic passes. I am not vain but loosing my hair was the one thing that upset my ten year old. He was ok about me loosing a breast! Keeping my hair has just meant I haven't had the sympathy look when I pop out. It also meant I didn't need a wig which although are amazing are also irritating. On balance I'm glad I opted for the cold cap. But will be even more glad when I've had the last of these eight chemo!",
      "MessageIndex": 14,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53563/a-cold-cap---did-it-work-for-you",
      "Title": "A Cold cap - did it work for you?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "And if it helps mine wasn't my cup of tea either. Actually hardly any of the staff I met would I rate - how sad! My friend who was 'pampered' because she was on a trial had close, caring supportive care. But for me I'm glad they were so awful because when I was finished the full on treatment I was glad to get away from them. My friend struggled because they had become 'friends'. And really you'll be seeing loads of medics from now on in she is going to be one of so many!!! Good luck ethel x",
      "MessageIndex": 2,
      "PostDate": "15/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73570/can-i-change-my-macmillan-breast-nurse",
      "Title": "Can I change my Macmillan breast nurse?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi spudly, I agree with saxxyd. My two closest/bestest friends were horrendous during this last 11 months! For a time I was hurt, no for a time I was gutted and devastated, by their lack of care and thought for me. I had been their friend since 1989 and expected their support but it didn't come. One of them went to pieces and just cried at me and the other took umbridge that I didn't answer my landline ( I couldn't face picking it up for months). So 11 months on no contact unless I initiate it. With one of them (for the sake of my son) I have limited contact. I ruminated on my response for a while and came to the conclusion it was their loss and I had lost nothing. Other people came to my support. People from my past but also people in my present. My hairdresser was there to chide me when I was wallowing in self pity, neighbours supplied me with care, shopping and numerous jokes! The friend who had insisted that she came with me to the breast clinic for my initial consultation and had to hold my terrified ankle as they biopsies my breast and lymph nodes kept me sane in those early months of madness. I will be indebted to her as long as I live. My friend who had BC 8 years before walked miles with me. My sister massaged my feet through every chemo session. I lost two 'friends' but I cannot look back I choose to look around and forward. Every day is beautiful and I am so pleased to be here with the friends I do have. best wishes Ethel x",
      "MessageIndex": 2,
      "PostDate": "23/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59005/how-to-deal-with-how-people-react",
      "Title": "How to deal with how people react"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Diane, I'm still here (a year after diagnosis) and starting a phased return to work! Not what I would quite describe as fully recovered but I don't think I could be. I can't recommend a shampoo because I used a cheap stores own brand. I suspect there isn't any research that would demonstrate any shampoo or conditioners any better than another. I understand that the fitting of the cap is the key as it must be tight and touching all of your head. I wish your mum well and that you also take care. The impact on those who watch us can be devastating too. Be kind to yourself. Ethel x",
      "MessageIndex": 16,
      "PostDate": "24/04/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53563/a-cold-cap---did-it-work-for-you",
      "Title": "A Cold cap - did it work for you?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi spudly, I have found this site a real support over the months. There are many wise and caring people here who offer some knowledgable advice. I'm so glad your first experience turned out so well. We are now your 'cyber' friends so ya boo sucks to those who tested you before. Ethel x",
      "MessageIndex": 8,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59005/how-to-deal-with-how-people-react",
      "Title": "How to deal with how people react"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi I am -Ethel",
      "MessageIndex": 3,
      "PostDate": "30/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56394/anyone-on-the-metformin-trial",
      "Title": "Anyone on the Metformin Trial?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi lizane, I am impressed you're still in work! As soon as I was diagnosed I couldn't have coped. Your medical team will not let you be around so many young people as you go through chemo because of the risk of infection being so high. You too will soon become conversant with the language of bc rather than education. Hang onto the fact that most women don't die f bc and be kind to yourself. Ethel x",
      "MessageIndex": 1,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62112/about-to-start-chemo-a-question-or-two",
      "Title": "About to start chemo .a question or two..?..."
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi jmp, are you certain its arthritis? Have you had scans",
      "MessageIndex": 5,
      "PostDate": "14/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99826/hello-can-anyone-help",
      "Title": "Hello can anyone help?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "x",
      "MessageIndex": 10,
      "PostDate": "14/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99826/hello-can-anyone-help",
      "Title": "Hello can anyone help?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi jmp, are you certain its arthritis? Have you had scans",
      "MessageIndex": 20,
      "PostDate": "14/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99826/hello-can-anyone-help",
      "Title": "Hello can anyone help?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "x",
      "MessageIndex": 25,
      "PostDate": "14/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99826/hello-can-anyone-help",
      "Title": "Hello can anyone help?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Yes, yes, yes, yes yes you will. I know because it was so doable I did it again a year after! I didn't like being lopsided though. I was a 40ff! I wasTERRIFIED (and then some) about my first mx. It took me a long time to cope with everything. It wasn't until I got through chemo 9 months after the first symptoms showed that the terror subsided. There's no quick route to it being ok (because it isn't) but the girls here will hold your hand, hug you and care for you as you go through all if this. You are not alone we are with you. Just get through the next few hours that's all you have to do. Ethel x",
      "MessageIndex": 1,
      "PostDate": "17/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72022/getting-masectomy-this-week",
      "Title": "Getting masectomy this week."
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "More ok will you message me privately. Ethel x",
      "MessageIndex": 4,
      "PostDate": "23/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95766/cancer-spread",
      "Title": "cancer spread"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi macmillan finance will advise. When I asked I was told that I couldn't be discriminated against because of my diagnosis but that the insurance premium would be increased to reflect the risk. I hope that helps a little? Ethel x",
      "MessageIndex": 2,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63297/borrowing-money",
      "Title": "borrowing money"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Jenny are you being treated in Cov?",
      "MessageIndex": 2,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56661/any-on-near-nuneaton",
      "Title": "any on near nuneaton"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "I had 4 fec 4 tax chemo and wore the cold cap and kept all my hair! I used value shampoo and didn't do anything to look after it really. Saved me £60 on a wig, a cold head and that sad look from other people. The sad looks I got keeping my hair was bad enough! Ethel :)",
      "MessageIndex": 32,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57563/cold-cap-any-advice",
      "Title": "Cold cap? any advice"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi pauline, two years ago on May 13th I went in to have my first mastectomy. I thought I would die from the operation and even if it didn't kill me the cancer would be elsewhere and I'd be dead by Christmas! Terror doesn't even describe it. It took me months to get some kind of handle on the terror department -actually 7 months!!!! I'm not sure there's anything I could have done to alieviate the stress I felt. I'm telling you this because I want you to know that the treatment is al doable it's not very nice but it's what you need to get well and to have a long and healthy life. Ethel x",
      "MessageIndex": 7,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76324/just-joined-op-on-12-may",
      "Title": "Just joined op on 12 may"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "I had 4 fec 4 tax chemo and wore the cold cap and kept all my hair! I used value shampoo and didn't do anything to look after it really. Saved me £60 on a wig, a cold head and that sad look from other people. The sad looks I got keeping my hair was bad enough! Ethel :)",
      "MessageIndex": 17,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57563/cold-cap-any-advice",
      "Title": "Cold cap? any advice"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi 4 fec 4 t cold cap used and I kept all my hair x",
      "MessageIndex": 23,
      "PostDate": "02/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57563/cold-cap-any-advice",
      "Title": "Cold cap? any advice"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi I had a peer supporter via breast cancer care. In fact I had two because my diagnosis changed after surgery. Bcc match you with an equivalent not just diagnosis but I asked for similar age, similar breast size (it mattered) and someone with a child of similar age to mine at diagnosis. My peer supporter calls me as often as I choose and has been such a massive massive help. I grabbed every bit of support I could and it has all made a difference. It may help you (someone else here). Ethel",
      "MessageIndex": 3,
      "PostDate": "19/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57016/when-does-survival-start-officially",
      "Title": "When does survival start officially?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi 4 fec 4 t cold cap used and I kept all my hair x",
      "MessageIndex": 38,
      "PostDate": "02/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57563/cold-cap-any-advice",
      "Title": "Cold cap? any advice"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi all, I was thinking of the good things that came out of my diagnosis almost 2 years on are: --Great flat chest. --No more bras. --No more periods. --Fit into smaller clothes. --Can run without being blinded. --Found out who my friends really were (not the two 'best friends' I thought I had) --Realised the partner of 29 years had to go - he's looking for a house now - I will be so happy to pay him the 75k. --Spending time doing stuff that's fun. --Going on holidays loads because life is so short. --Joining a gym. --Not caring what other people think. --Caring about other people just a bit more than before. --Planning to respite foster care when ex partner moves out. --Buying my own car. --Spending good times with my sister. --Supporting other women through the nightmare. --Loosing weight - I look better than I ever have. --Not being bothered by trivia - or big stuff (as redundancies loom I don't give a......). --Loving my son (even more than I thought possible). -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------I had a grade 3 stage 3 massive tumour, a mastectomy , 8 chemo, 15 rads a portacath inserted (and removed, the other breast off (to balance me up), tamoxifen on-going. Life isn't perfect I am still coming to terms with all that cancer has brought me but there are so many positives too! Whoop whoop whoop! Ether x",
      "MessageIndex": 0,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71535/almost-2-years-on---the-good-things",
      "Title": "Almost 2 years on - the good things!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi girls, a week last weds I had a Portacath fitted and last weds the third fec chemo via the Portacath. I'm posting here just to share my experience and to inform anyone else whether this kind of line is for them. Until I had my diagnosis in April I didnt have any difficulty with hospitals or treatments and always felt confident and cared for. The massive involvement of medics since my diagnosis has left me feeling out of control and powerless and frequently in pain. I have had an mx and node clearance. During that op there was a real issue in finding a vien suitable to get into. In another set of circumstances having three handsome surgeons/consultants hanging off me might have been enjoyable but sadly there lack of vien accessing skills set me on the path of being highly anxious regarding this in the future. At my first chemo there were difficulties again. During the conversation above my head a Portacath was mentioned. I seized upon this and pursued anyone who could facilitate its insertion. And so a week last Wednesday I had one inserted under general anasthetic. For the first five days it was uncomfortable and I had a few anxious moments. But the perseverance has spectacularly paid off! Prior to its insertion my arm veins were painful following the chemo. After this weds dose if I hadn't been there I wouldn't believe it was the same medication going in! No discomfort or pain!! Any questions fire away Ethel",
      "MessageIndex": 0,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52322/portacath-experience-semi-permanent-line-that-is-under-the-skin-going-well",
      "Title": "Portacath experience: semi permanent line that is under the skin!..."
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Oh Emma, I'm gutted for you! I have read loads about bc over the last couple of years and know that the treatment to hold it back can be pretty good. I notice on the breast cancer care forums women who are still enjoying life 10 on from mets. So my fingers are crossed that yours will be a long and fun filled life. Ethel x",
      "MessageIndex": 5,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74173/it-s-back-and-this-time-it-s",
      "Title": "It's Back! And this time it's..."
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "the simple answer is 'pain' and its pain anywhere - hips, legs, back, shoulders, ribs, sides - anywhere! If you get pain go see your gp and remind the you have had treatment for bc. Ethel x",
      "MessageIndex": 7,
      "PostDate": "24/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96747/how-do-you-know-if-you-have-mets",
      "Title": "How do you know if you have mets"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Please contact me via a private message here. I do not like posting here. Thank you Ethel x ",
      "MessageIndex": 5,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97188/not-sure-where-i-belong-anymore",
      "Title": "Not sure where I belong anymore"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Oh dear :( this sounds like a question for he nurses on the helpline here or at breast cancer care. I know their knowledge, experience, advice and support would give you some help. Please give them a call and chat about your difficulties. I hope things get a little easier for you both soon. Ethel x",
      "MessageIndex": 1,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76276/chronic-diahorea",
      "Title": "Chronic diahorea"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi choccolovely, I'm a 40ff mx and was told that they couldn't offer a reconstruction to match but would reduce my remaining breast and reconstruct to match that. However I'm opting to have my breast removed. I was never someone who was defined by her physical beauty and 40ff just got in the wAy so the decision is easy. I'm yet to have the discussion with the surgeon but am confident the choice will be right for me. Ethel :)",
      "MessageIndex": 1,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57982/newbie---big-breast-matching-with-reconstruction",
      "Title": "Newbie - Big Breast Matching With Reconstruction"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Ali will you pm me ad id like a chat in private Ethel x",
      "MessageIndex": 6,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89038/got-results-of-mri-ct-x-ray-more-questions-still-no-answer",
      "Title": "Got results of MRI/CT/X-ray... more questions.. still no answer"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Thank you folks - its good not to be on my own x Ethel",
      "MessageIndex": 8,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57055/what-if-i-can-t-get-to-the-hospital-because-of-the-snow-for-rads",
      "Title": "What if I can't get to the hospital because of the snow for rads?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Isabella welcome to the new world that you didn't know existed and didn't want to belong to. You are here though and there are lots of girls who have walked the path ahead of you and are here to help in whatever way you need it. I'll send you a big hug for now ((((()))))) but am here listening to you too. Ethel x",
      "MessageIndex": 5,
      "PostDate": "19/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60775/new-to-the-group",
      "Title": "New to the Group"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "And from users of this site like me who don't post (for all kinds of reasons) Annie will be greatly missed by us too. Ladies your posts have been a real help to me (as Annie's were). The echoes of my experience are in your posts and they have helped me understand my own thoughts and feelings over these last eight months. I thank you all too. Ethel Horner",
      "MessageIndex": 6,
      "PostDate": "07/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56625/feels-empty-here",
      "Title": "Feels empty here"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi girls, after a mx, 4 fec t and 4 tax I've started tamoxifen (metformin trial but I think it's the placebo) I start first of fifteen rads tomorrow! I've been told it will be a walk in the park after all that treatment! My little smasher (age 10) is looking forward to spending some of his Lego fund money (collection from friends in leui of flowers/cards). I'll join with you and compare if that's ok. I was diagnosed in April but up until now have felt so terrified (that i was dying) that i haven't had the courage to post on here much. I'm just hoping for the best now. Ethel",
      "MessageIndex": 8,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56659/last-hurdle",
      "Title": "Last hurdle!!!!!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi All, I have had a mastectomy and lymph node removal. I saw the ONC on thursday who now wants to have the ovarian cysts(found via the cat/MRI scan - I didn't know I had them) scanned by a gynecologist before he starts my chemo. I have now gone back to being terrified that they'll find cancer in my ovaries. Is there anyone on here that this has happened to. I am so sick of being tested and then getting the results. There's no let up in the treatment, there's no stopping my brain going into over drive. Thank you for reading my post:)",
      "MessageIndex": 0,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50840/pre-chemo-tests-ovarian-cysts---now-i-am-terrified-the-cancer-is-there-too",
      "Title": "Pre chemo tests: ovarian cysts - now I am terrified the cancer is..."
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Thank you kitty cat for the welcome. The truth is I feel like I know lots of you from the class of April/may 2012 already from following you all for so long. I have learnt so much since that fateful day -about myself . I can't say that this experience has been that much fun but there are times now (even running to hours) when I forget! I never thought that would happen but it has (it's taken a long time though) Ethel",
      "MessageIndex": 12,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56659/last-hurdle",
      "Title": "Last hurdle!!!!!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Thank you eider for the welcome (I've felt like a bit of a stalker not posting). It was Annie's death that made me think that I should have the confidence to post. I know how much the posts from other women ( and annie) here have helped me. I hope that maybe I can be a help to someone else too. My first rad today was ( as expected for me) a walk in the park. Nothing can compare to the mx or the chemo for horrid treatment. I am in a much better place now, than at the start, but am aware that the journey continues. I am pleased that I have the support here, thank you. Ethel",
      "MessageIndex": 19,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56659/last-hurdle",
      "Title": "Last hurdle!!!!!"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi, yes it can develop anytime but particularly after rt. I had my first mx may 2012 and the other one (by choice) June 2013. And now my first arm is really 'cording'! I'm stretching it out throughout the day and hanging off my kitchen door lol but I'm back to see bcn on Tuesday so am going to run it past her. Ethel x",
      "MessageIndex": 2,
      "PostDate": "12/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62401/interesting-development---sudden-surge-in-cording",
      "Title": "Interesting Development - Sudden Surge In \"Cording\""
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Thank you for your responses. My neighbour offered to take me but in the end I drove her. I was just in a bit if a snow panic. Ethel",
      "MessageIndex": 11,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57055/what-if-i-can-t-get-to-the-hospital-because-of-the-snow-for-rads",
      "Title": "What if I can't get to the hospital because of the snow for rads?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi what scans have you both had for these symptoms? I don't want to frighten you but hip pain is a classic sign of secondaries. Different scans show different 'activity'. Doctors aren't always right. Ethel x",
      "MessageIndex": 2,
      "PostDate": "19/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85997/hip-pain-anastroloze",
      "Title": "Hip pain Anastroloze ??"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi lorraine, I always take my union rep! My head is great (she had bc the year before me) but I would never ever go in alone. I started as I meant to go on lol. A year before I was off for 12 weeks when I smashed my wrist in four places. I learnt from that phased return to plan it myself so I started with half a day a week and then two half days and then three etc. I also went in with a plan of which days. Good luck with the treatment. Take whatever control you can as all control goes into the hands of the medics! Take one day at a time. It's all doable, not nice, pretty nasty but doable. It's what it does to your head that's the real difficult one. Kind regards ethel x stage 3 grade 3 massive tumor loads of nodes involved. 8 chemo 15 rads mastectomy and prophylactic mastectomy, diagnosed April 2012 when I was 49! Lost friends and found others! Learnt a lot about myself. Live life with a new sense of what's important.",
      "MessageIndex": 5,
      "PostDate": "06/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77064/teachers-out-there",
      "Title": "Teachers out there?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi ladies, I've had 7 of 15 rads and am due at the hospital (4miles away) every day next week. I hate driving on the snow. What should I do? What happens if I don't get there, how catastrophic will it be to the treatment if there's a gap? your advice would be much appreciated. Ethel",
      "MessageIndex": 0,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57055/what-if-i-can-t-get-to-the-hospital-because-of-the-snow-for-rads",
      "Title": "What if I can't get to the hospital because of the snow for rads?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Thank you all I knew someone could help and you have. Ethel x",
      "MessageIndex": 4,
      "PostDate": "20/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57055/what-if-i-can-t-get-to-the-hospital-because-of-the-snow-for-rads",
      "Title": "What if I can't get to the hospital because of the snow for rads?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Annie\"s obituary notice has been published in the derby telegraph today if anyone from here would like to light a virtual candle for her there? Ethel x",
      "MessageIndex": 11,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56625/feels-empty-here",
      "Title": "Feels empty here"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Jenny, I am a 38ff omg! And I hate being so lopsided. Funny thing is that I prefer my flat side but can't bear to look at my one huge breast, which on its own looks enormous! I was never a woman defined by her breasts but the difference is stark. My prosthesis weights 2.5kg omg! And yes I weighed it! It fits into my little smashers cyce helmet a treat. I am not proud of this. I wasn't keen on my body before and now I would prefer them to take away the loner. It's difficult to sleep, it's going to be a problem to swim (I like swimming) ! The only positive is that cancer is gone - actually I am quite pleased about that lol. Ethel",
      "MessageIndex": 5,
      "PostDate": "21/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57078/body-image",
      "Title": "body image"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi studentmidwife I was diagnosed in April 2012 - you can click on my avatar (or anyone else's) and look at their activity it will show you just how normal your feelings are. It will also show you as kate says the treatment is horrid but doable. Most women don't die of bc now. Hang onto that for now. Facing your own mortality is a huge thing and that's what your doing (along with coping with a series of seemingly never ending shocks). There is lots of support - use Macmillan and breast cancer care they offer all sorts of direct support. Do whatever you can to get through today. Ethel x",
      "MessageIndex": 3,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61709/diagnosed-on-thursday",
      "Title": "Diagnosed on Thursday"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi I started with half a day and built up by increasing half a day each week. This seemed to work ok but even at that speed when I had got to 3 days I had to stall for another couple of weeks. Make sure you plan the days that suit you not school. I had broken my wrist 2 years before bc and that phased return was dictated by school because he didn't occur to me to plan it. This time I knew what would suit me best and went in with a plan. I'm back in full time now and it's ok! Ethel x",
      "MessageIndex": 3,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77064/teachers-out-there",
      "Title": "Teachers out there?"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Just like little rose says we are here to help. Do you what you need to do to get through each hour at the moment it will get better. Hang on to the fact that most women survive breast cancer. Ethel x",
      "MessageIndex": 2,
      "PostDate": "03/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58330/feeling-alone",
      "Title": "feeling alone"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Joanne, I suspect you are in shock. I remember those early months so well. I was terrified. I 100% thought I'd be dead within the year. You know how I felt but it gets better but for me it took months and months. In fact it was only when I got through chemo did I start to feel like I might survive. I stay on here so that I can occasionally be here to help other women and to show you that you will get through, you'll be different but you will enjoy life again. Be kind to yourself and just do the next few hours. Ethel x",
      "MessageIndex": 6,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78698/feel-so-alone",
      "Title": "Feel so alone"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi Rebecca I know what you mean. I do think that our periodic communications are helping those new girls here too. So I think a though the tunnel thread here would be lovely and we can pop in and show that there is a light to give hope here. Hi blue tit how's the metformin going (I have the real drug) I have no side effects!!! Whoop whoop! Ethel x",
      "MessageIndex": 11,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61000/14-months-later--",
      "Title": "14 months later :-))"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Thanks sue, 'welcome to holland' is a metaphor for life isn't it. So I'm up smelling the tulips and they are so so beautiful. Ethel x",
      "MessageIndex": 8,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61000/14-months-later--",
      "Title": "14 months later :-))"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi dorothee - what a lovely post! Thank you Ethel x",
      "MessageIndex": 20,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61000/14-months-later--",
      "Title": "14 months later :-))"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Hi to all you lovelies who I am so pleased to hear about. I'm 13 months post diagnosis and next month I am popping back in to have my remaining breast off. I lost friends made many more and learnt what was important. Today another friend had her mastectomy and called me from the ward. Being in this club gives is all an insight into a world we wouldn't have chosen but here we are and 'welcome to holland' (google it if you have a minute) . Meanwhile I am in Somerset with my 11 year old making memories for him. I've been for a five mile walk today with my lovely sister who has been my treasure. Whatever the future holds I don't know but for now I'm loving my life! Big hugs to you all (and a spiritual hug to annie40 & her family). Ethel x",
      "MessageIndex": 6,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61000/14-months-later--",
      "Title": "14 months later :-))"
    },
    {
      "AuthorID": "Ethel Horner",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ethel-horner",
      "Content": "Blimey that could be me writing that post! I don't ever feel full of vim and vigor anymore. I know as soon as it hits 5 I've had it. But I force myself to the local gym and really give myself a hard workout because I know lying around will not make me feel any better and the gym will make me feel virtuous! I also know it's time for me which doesn't involve work or domestic responsibilities. Exercise also means I have time when I'm not thinking and I really need not to be thinking for some of the day. This bc lark continues to test us eh! Ethel x",
      "MessageIndex": 1,
      "PostDate": "31/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74480/so-tired",
      "Title": "So tired"
    }
  ]
}