{
  "AuthorID": "Everhopefull13",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/everhopefull13",
  "Posts": [
    {
      "AuthorID": "Everhopefull13",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/everhopefull13",
      "Content": "Hello all, never expected to be here. I was diagnosed with invasive lobular breast cancer S2 end of January and am now almost 3 weeks from mastectomy and after meeting with my consultant told I’ll be having chemotherapy starting soon. I as yet don’t know what or when. I feel rather lost and anxious and thought reaching out to anyone in my situation might be help. Anyone going through the same? ",
      "MessageIndex": 0,
      "PostDate": "10/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177837/waiting-for-treatment-after-mastectomy",
      "Title": "Waiting for treatment after mastectomy"
    },
    {
      "AuthorID": "Everhopefull13",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/everhopefull13",
      "Content": "Hi there.  I really feel for you, it’s such a rollercoaster isn’t it, some days I can barely get my thoughts together but day by day we get there. Im healing really well and I found that physio has really helped me to get my strength and movement back. I remember in the early days post surgery feeling so uncomfortable and weak but all doing well so keep going. Having met with my oncologist and going through my case I start a course of 6 rounds of FEC-T chemo tomorrow! Yikes! None of this really seems real but you will find a strength and courage you never knew you had, reach out to friends and family and be totally open with you feelings, it’s all ok. I take each day as it comes now and although I’m anxious about my treatment I know how many other strong women like us keep going and support each other. Feel free to message me for any support I can give you, or just a listening ear. keep on keeping on. We got this, sending love and positivity.",
      "MessageIndex": 4,
      "PostDate": "07/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177837/waiting-for-treatment-after-mastectomy",
      "Title": "Waiting for treatment after mastectomy"
    },
    {
      "AuthorID": "Everhopefull13",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/everhopefull13",
      "Content": "Hi Granny59 , thank you so much for your reply. I’m healing very well and keeping up my physio which really does make a difference. Isn’t the waiting hard, I try n focus on being creative, art knitting and reading to quiet my mind and keep me busy, thank goodness for being left handed!  I will definitely check out that link! I hope that you are keeping well this weekend and thank you, it took me long enough to work out how to post here! It’s good to know there’s a community here! ",
      "MessageIndex": 2,
      "PostDate": "10/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177837/waiting-for-treatment-after-mastectomy",
      "Title": "Waiting for treatment after mastectomy"
    }
  ]
}