{
  "AuthorID": "Evie S",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
  "Posts": [
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Hi commoner Very sorry you find yourself on here but you have found the right place for great advice. You've already had some helpful advice but I thought I'd share my experience too in case it helps. I had a mastectomy and an immediate pre pectoral implant last May. I don't know if you are having radiotherapy but there is a risk that the radiotherapy could cause capsular contracture (hardening around the implant) and so some surgeons don't like to do implants before radiotherapy. Mine discussed the risks and we decided to go ahead with an immediate recon. I'll try to answer your questions: 1. I am also small but not quite so small as you - I'm a B. Unfortunately my surgeon put the wrong size implant in so at the moment I have one larger boob (I haven't decided whether to have it corrected). There are smaller implants available. I am using a prosthesis on the other side to even things up under clothes. Not ideal but I have got used to it as a new normal - but I don't wear it when I am playing sport. My new boob is firmer and a different shape to my other one, more round while my original sounds like yours, heading south! (I'm also 50). 2. I don't find my implant uncomfortable. I run and go to the gym without problems. My surgeon did the same pre pectoral implant for a lady who was a triathlete and wanted the least invasive implant so that she could carry on her sport. 4. You will still get mammograms on your remaining breast. 5. You don't have mammograms on your implant. I asked my team how I would know if I had a recurrence in the implant breast and was told that any recurrence would almost certainly be in the skin/tissue above the implant (not sure what is left, probably just skin) and so I would be able to feel it. I think it's a very personal decision and I wish you all the best for your surgery and decision. It depends what outcome you are looking for. Mine isn't perfect but it really doesn't bother me as much as I expected. I am very happy to answer any more questions on here or in a private message if that's easier Evie x",
      "MessageIndex": 11,
      "PostDate": "31/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148573/struggling-to-decide-about-reconstruction",
      "Title": "Struggling to decide about reconstruction"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Hi Sarah - I have been on Tamoxifen for a couple of months now. I too have an urge to eat constantly but I hadn't linked it to Tamoxifen - but what you say makes perfect sense as I think the grazing has got worse since I started. I'm afraid I don't have any tips to stop grazing - I don't have very good will power! xx",
      "MessageIndex": 3,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134762/tamoxifen-urge-to-constantly-eat",
      "Title": "Tamoxifen & urge to constantly eat"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Karen - that's really interesting about the sugar free diet. I'm going to look into that and get the books you mentioned. It is the sugar that I usually crave. For arthritis I wonder if you have tried cherry juice? I take it to help my sleep but it is also supposed to help arthritis and seems to help my husband. I get it from Holland & Barrett. Evie x",
      "MessageIndex": 7,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134762/tamoxifen-urge-to-constantly-eat",
      "Title": "Tamoxifen & urge to constantly eat"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Hi Boss 1967. I think what your neighbour did was amazing, shaving off her hair to make wigs - but I think that is very different to shaving hair to raise money. Others have explained far better than I can why the \"Brave the Shave\" is offensive to so many. There are so many other ways to raise money that wouldn't upset people who have been through chemo. Thank you everyone for commenting on this thread. I do appreciate that some people will have different views to most of us on this thread, but I don't understand why Macmillan are continuing with this fundraiser when so many people on one of their own forums are so against it. Does anyone from Macmillan read these threads I wonder? I would be very interested to hear Macmillan's side of this. Evie x",
      "MessageIndex": 284,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Silverglades - I think anyone can add to a Wikipedia page. I have just had a look - seems as if you need to set up an account. I have just been sent a survey asking how I thought Macmillan dealt with my complaint - has anyone else had the same survey? xx",
      "MessageIndex": 410,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Thanks Judy. I do hope you manage to make some personal contact with someone in Macmillan about this campaign. Hope you are recovering from your final surgery.  Evie xx",
      "MessageIndex": 302,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Very well put FrancesW. xx",
      "MessageIndex": 322,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "RebeccaT, when was your article published in the Sunday Times? Brilliant that you wrote the article and had it printed. Xx",
      "MessageIndex": 357,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "This is the reply I have received to my complaint about the campaign: \"Thank you for your email providing feedback about our Brave the Shave campaign. I do apologise for any upset we may have caused.   Before I begin I want to thank you for letting me know about you’re your breast cancer diagnosis. I understand that cancer affects everyone differently and it’s effects can be long lasting. If you ever need any information, support or even someone to talk things through with our support line is here for you. You can call our support line free on 0808 808 0000 (Monday-Friday 9am-8pm).   In your email to us you asked us why we run our Brave the Shave campaign. It began after we found that thousands of Macmillan supporters were choosing to shave their head and fundraise for Macmillan each year. Originally we launched this as ‘Shave or Style’, however from this campaign, we found that the majority of participants were opting to shave and so moved forward with that aspect specifically. We wanted to provide these supporters with a better platform in order to raise money, while sharing their fundraising activity.   Many people who fundraise though Brave the Shave want to show solidarity with people they know, who have lost their hair through their cancer treatment and feel that this campaign is one way of showing their support. It is through their generosity that we were able to raise £7.1m last year alone. This money is crucial in helping us run our vital services so that we can support more people affected by cancer. Despite this we do realise that this campaign is not to everyone's liking and I can only apologise for how it has made you feel.    Thank you again for taking the time to pass on your thoughts. I'd like to reassure you that all the feedback we receive is reviewed and is used to shape future campaigns as we want to ensure that they are as sensitive as possible. If we can be of any further assistance in this matter please don’t hesitate to contact us on 0300 1000 200 (Monday to Friday, 9am to 5pm) or by emailing feedback@macmillan.org.uk.  ",
      "MessageIndex": 405,
      "PostDate": "14/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Judyr58 - I'm so so sorry to hear your news and sending you hugs and strength. So pleased to hear though about your grandson - he will keep you going and positive. Love Evie xx",
      "MessageIndex": 416,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Hi Frankie First of all a big hug to you as you go through chemo. How lovely of you to keep donating your hair to the Princess Trust. I just wanted to share what I did when I went through chemo as I too couldn't face a shave. I tried cold cap twice but gave up after that as it didn't really work for me and gave me the worst headaches. It did slow the loss a little and I kept what little hair I had so that I had something, albeit very little, to stick out from under my headscarves (hope that makes some sort of sense). Only when I started to see new hair start to grow did I shave the few remaining hairs so that I didn't have a variety of lengths. I asked my husband to shave it and he found it heartbreaking to do. So when I see the \"brave the shave\" campaign\" it upsets me so much as I it brings back that horrible time for me. It is truly shocking that Macmillan are just ignoring all the comments on this thread and others. Surely a spokesperson could at least acknowledge what is being written. Evie xx",
      "MessageIndex": 466,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "I keep seeing adverts for the Brave the Shave fundraising campaign and was relieved to find so many agree with how I feel when I see these adverts. I think it's wonderful that people want to raise and donate but there are so many better ways, without causing offence to those who have lost their hair and suffered so many other awful side effects. I don't understand why Macmillan haven't stopped this fundraising idea when so many sufferers have voiced their views. x",
      "MessageIndex": 277,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Thank you Trish62 and Dreamthief for finding and posting that link. Would be good if other national papers took up the story too, so that the message gets out to the public. I'm quite sure that those who take part have only the best intentions, to raise much needed funds, and will be completely unaware of the upset they are causing. Even better if Macmillan would stop the campaign and come up with an alternative. ",
      "MessageIndex": 307,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "RebeccaT and Annie H - I agree with your comments. Sallyjo I also agree that anyone who raises money for cancer charities is doing a wonderful thing. However, what is hard to understand is why Macmillan isn't listening to all those who are upset by this particular fundraising campaign - 29 pages of comments. The use of the word \"brave\" is so wrong for so many reasons. As someone earlier said, we don't tape up our eyes when raising money for the blind. Annie - I do think those who shave their heads genuinely have no idea how sufferers feel - somehow we need to spread the word. I wonder if anyone has any contacts at the national newspapers?",
      "MessageIndex": 422,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Sorry Rebecca - I thought your article was published last year in the Sunday Times and I was wondering if we could somehow get them and others to publish more articles this year. But apologies if I am confused (happens often these days!) and articles have been published in national press this year - I may just have missed them.",
      "MessageIndex": 424,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Tebs - I've just found the Facebook page but haven't found the petition yet, where do I look? (technology not my strong point!) It really is unbelievable that macmillan continue with this campaign despite 31 pages of comments asking them to stop it, together with comments on their own Facebook page. I wrote to them last year too. I have just found another blog and have commented on there too - here's the link for anyone interested (hope it works) https://community.macmillan.org.uk/blogs/b/weblog2241/posts/brave-the-shave?CommentId=4dc27f94-9ee9-4d78-a087-51e3319ad472&source=login I wonder how we can get the press involved - does anyone have contacts?",
      "MessageIndex": 458,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "Hi Judy I'm so sorry to read about that experience and sending you some hugs. What a brilliantly written post, thanks so much for sharing that experience - if only Macmillan would read it and do something about this campaign. Charities supporting the blind don't suggest people walk around with blindfolds on to raise money - they would never be that insensitive. Come on Macmillan, please listen to the people you are supposed to be supporting.",
      "MessageIndex": 460,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Evie S",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/evie-s",
      "Content": "That would be great. She will be able to reach the right person.",
      "MessageIndex": 426,
      "PostDate": "30/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    }
  ]
}