{
  "AuthorID": "FC59",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
  "Posts": [
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "Hi DFishcake I've actually just been interviewed by the Communications Department at the Hospital Trust who are hoping to issue a press release very soon about the TAD procedure. It was during the consultation before my radiotherapy started that the doctor mentioned that,  in future, it was probable that people like myself who had had such a good response to chemo would not need to be offered radiotherapy. I decided to agree to it mainly as I'm HER2 + and was anxious to throw everything going at my cancer; I'd had a clear mammogram 8 months before discovering my tumour so am worried about how quickly it grew. I also feel very lucky to have been given perjeta neo adjuvantly.  As well as itchy skin I've got a very sore and angry looking rash from the radiotherapy, which is also itching like mad! I've just invented a contraption to lie my arms on in bed to ease my itchiness, which involves a couple of icy cold bottles of water!! ",
      "MessageIndex": 14,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141192/partial-or-total-lymph-node-clearance",
      "Title": "Partial or total lymph node clearance?"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "Hi DFishcake I've actually just been interviewed by the Communications Department at the Hospital Trust who are hoping to issue a press release very soon about the TAD procedure. It was during the consultation before my radiotherapy started that the doctor mentioned that,  in future, it was probable that people like myself who had had such a good response to chemo would not need to be offered radiotherapy. I decided to agree to it mainly as I'm HER2 + and was anxious to throw everything going at my cancer; I'd had a clear mammogram 8 months before discovering my tumour so am worried about how quickly it grew. I also feel very lucky to have been given perjeta neo adjuvantly.  As well as itchy skin I've got a very sore and angry looking rash from the radiotherapy, which is also itching like mad! I've just invented a contraption to lie my arms on in bed to ease my itchiness, which involves a couple of icy cold bottles of water!! ",
      "MessageIndex": 29,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141192/partial-or-total-lymph-node-clearance",
      "Title": "Partial or total lymph node clearance?"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "I am lucky enough to be treated in Newcastle where I was one of the first patients in the UK to be offered a TAD - targeted axillary dissection rather than a full lymph node clearance. A week or so before my wle and after 8 rounds of neo adjuvant chemo I had radioactive seeds inserted into where my 57 mm tumour had been and one lymph node that had had a 3mm tumour(luckily I had a total pathological response to the chemo). On the day of surgery I was injected with radioactive dye which would have showed up any lymph nodes which still had cancer in them. Instead of a total clearance I only needed 4 nodes removing. I've just finished 15 sessions of radiotherapy; I was told that I was probably being over treated and that NICE guidelines have not yet caught up with new developments in treatment.  On a different note- does anyone else taking herceptin have itchy forearms?? I've never suffered with sensitive skin before my diagnosis and was fine during chemo ( including the 4 lots of IV herceptin I had). Not sure if it's a coincidence or not but I'm being driven crazy with itchy painful pins and needles sensation in my arms. This added to the itchy rash on my breast from radiotherapy is making me very unhappy and irritable!! ",
      "MessageIndex": 12,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141192/partial-or-total-lymph-node-clearance",
      "Title": "Partial or total lymph node clearance?"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "I am lucky enough to be treated in Newcastle where I was one of the first patients in the UK to be offered a TAD - targeted axillary dissection rather than a full lymph node clearance. A week or so before my wle and after 8 rounds of neo adjuvant chemo I had radioactive seeds inserted into where my 57 mm tumour had been and one lymph node that had had a 3mm tumour(luckily I had a total pathological response to the chemo). On the day of surgery I was injected with radioactive dye which would have showed up any lymph nodes which still had cancer in them. Instead of a total clearance I only needed 4 nodes removing. I've just finished 15 sessions of radiotherapy; I was told that I was probably being over treated and that NICE guidelines have not yet caught up with new developments in treatment.  On a different note- does anyone else taking herceptin have itchy forearms?? I've never suffered with sensitive skin before my diagnosis and was fine during chemo ( including the 4 lots of IV herceptin I had). Not sure if it's a coincidence or not but I'm being driven crazy with itchy painful pins and needles sensation in my arms. This added to the itchy rash on my breast from radiotherapy is making me very unhappy and irritable!! ",
      "MessageIndex": 27,
      "PostDate": "31/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141192/partial-or-total-lymph-node-clearance",
      "Title": "Partial or total lymph node clearance?"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "Hi I was diagnosed in January with a HER2 + 57x58X21mm grade 3 tumour in my right breast with lymph node involvement in at least 1 node. I have since had neo adjuvant chemo ( 4 EC and 4 Doxetaxal, herceptin and perjeta) plus, three weeks ago, a lumpectomy and a procedure new to my hospital- TAD, targeted axillary dissection rather than a full clearance. This involved the insertion of radioactive seeds both in the tumour and the involved lymph node a week prior to my surgery and an injection of radioactive dye in my nipple the day of my op. I received my pathology results last week and am so relieved to be told I had had a 'complete pathological response' to the chemo. Virtually nothing left to remove of both original tumour and the 3mm cancer in the lymph node. My surgeon removed 4 nodes in total - the other 3 showed no signs of having had any cancer in them. I'm still having radiotherapy as planned,  although the surgeon said he would hope in the not too distant future guidelines would change for people in my situation as it's probably over treating.  I would appreciate any advice on how long I can expect to be bothered with the seroma I have developed. I've had it drained twice in 6 days ( 210 mls and 240 mls aspirated). I've  developed cellulitis and was actually admitted overnight at the weekend with this and a high temperature. Despite being drained yesterday it's starting to fill up again. How frequently have others had theirs drained??  Apologies for the long post! ",
      "MessageIndex": 30,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137094/choosing-not-to-have-axillary-node-clearance",
      "Title": "Choosing not to have axillary node clearance"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "Hi Suzie my surgeon is Henry Cain and I was treated at the RVI in Newcastle. I was the 5th patient to have this procedure. Mr Cain mentioned that it's been done in Birmingham too, as well as in the USA and Holland. I was told that there was only residual scarring and fibrosis where the original tumour had been, as well as in the affected lymph node. I feel incredibly fortunate that I have been able to access new targeted therapies, particularly perjeta, and responded as well to them; as Mr Cain modestly said, it's been the chemo that's saved me, not his surgery! My sister had breast cancer 16 years ago and the difference in our treatments is vast! Good luck! ",
      "MessageIndex": 35,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137094/choosing-not-to-have-axillary-node-clearance",
      "Title": "Choosing not to have axillary node clearance"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "Quick update on the TAD procedure I had in August. Finished my radiotherapy almost 3 weeks ago and apart from terrible itchy skin I'm doing fine!  www.itv.com/.../",
      "MessageIndex": 36,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137094/choosing-not-to-have-axillary-node-clearance",
      "Title": "Choosing not to have axillary node clearance"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "Please feel free to quote me too!",
      "MessageIndex": 333,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "I couldn't agree more with absolutely everything you have said! I have just completed 8 cycles of neoadjuvent chemotherapy and am having surgery on August 23rd followed by radiotherapy and herceptin. Losing my (very short styled) hair has been incredibly difficult to cope with; I hate how I look and how cancer has stripped me of my physical identity. Yes, I know it's only temporary, but it's such a visual reminder of being ill and the trauma of protracted treatment. I genuinely am unable to understand the rationale behind the 'brave the shave' campaign and find it quite distressing that others assume it's 'supportive'. I can not thank Macmillan enough for their tireless work and support, and to those who raise funds for the Charity; however I find this particular initiative totally insensitive and unnecessary. Apologies if I have offended anyone with my personal views, not my intention at all. It's been a tough few days dealing with the 'Uncle Fester' doppelgänger I see every time I look in the mirror and the less shaved heads I have to see the better .....",
      "MessageIndex": 288,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "FC59",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fc59",
      "Content": "Hi I'm currently due to have my second dose of T, perjeta and herceptin after 4 cycles of EC. Throughout my chemo I have managed to do at least 4 classes per week of Pilates or body balance and it has been really helpful. As well as keeping me reasonably fit it's just so good to do something 'normal' when my life has been turned upside down. I'm 57, a deputy head teacher and not a typical gym bunny ( could do with losing a good stone!) However I have surprised myself at how I've managed to keep going, although the T was tough for a few days! I'm due surgery and radiotherapy when my chemo finishes at  the end of July and I intend to keep exercising for as long as I feel up to it as I know I will be incapacitated for a while after my op. My advice is do whatever you feel you can and want to do - your body will tell you when to stop! Good luck! ",
      "MessageIndex": 10,
      "PostDate": "09/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131420/any-runners-here",
      "Title": "Any runners here?"
    }
  ]
}