{
  "AuthorID": "Felen",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/felen",
  "Posts": [
    {
      "AuthorID": "Felen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/felen",
      "Content": "Hi there  The guilt is something I really relate to. I am struggling with massive guilt over how I am putting people out, how much support I need, how much time I am getting from the medical side of things. I know it isn't rational but the feelings are there anyway. But you are absolutely not wasting anyone's time when you get even the smallest pimple of a lump or anything at all checked out. When it comes to something like this better safe than sorry is the motto.",
      "MessageIndex": 4,
      "PostDate": "25/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107106/a-bit-of-reassurance-please",
      "Title": "A bit of reassurance please"
    },
    {
      "AuthorID": "Felen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/felen",
      "Content": "Hi Julia thanks for that. I am on a huge learning curve here. I got the injection for white cell booster after my second chemo and a few days later I had the most intense chest and back pain that went on and on. I called 999 and got taken to a&e where I was given morphine after they ruled out heart problems. I just had morphine on tap. Nobody knew what it was until hospital oncologist came next day and said it was a common side effect of injection. So bad news is it will happen each time but good news is I will have morphine at home to deal with it. I certainly agree with you about Google. I read so much stuff but I had to stop. I couldn't sleep for thinking about all the things you could do or take. I am just trying to have a healthy lifestyle now. Thankyou for replying",
      "MessageIndex": 9,
      "PostDate": "26/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107119/breast-cancer-looking-for-advice-experiences-support",
      "Title": "breast cancer, looking for advice,experiences,support"
    },
    {
      "AuthorID": "Felen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/felen",
      "Content": "Hi everyone  I was diagnosed with breast cancer dec15. Lumpectomy Jan 16 Chemo started In Feb. I am part way through my 2nd cycle of chemo. I am really struggling with the fear of what chemo is doing to my body. I have been in and out of hospital with different side effects. Currently taking antiviral,anti fungal,antibiotics, laxatives. I have been neutropenic so got a booster injection for white blood cells 2nd time. Had severe pains from reaction to booster that only morphine helped. Skin on my fingertips all crinkly. Reading all sorts of stuff on the Internet and trying to make sense of it all. On top of all that I have this massive guilt about the amount of support I need from my husband and the medical side of things. I am 59. Is anyone else like me?",
      "MessageIndex": 0,
      "PostDate": "25/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107119/breast-cancer-looking-for-advice-experiences-support",
      "Title": "breast cancer, looking for advice,experiences,support"
    },
    {
      "AuthorID": "Felen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/felen",
      "Content": "Thanks dreamthief I am so grateful you you all for replying. None of my family or friends have any experience with cancer and that included me too. Now I am humbled by what people are experiencing and learning to cope with. Thankfully no ulcers but I did have oral thrush. I have learned more about my bowels than I have ever cared to. I have been admitted to hospital 6 times. I am scared by how vulnerable I feel. Like I am at the mercy of everyone. And I feel challenged by the need to speak up for myself when I feel unsafe. Most nhs staff are wonderful but I have come across a couple of crackers that frightened me. I am terrified of infections. And you have probably guessed I am a coward about pain and sickness.",
      "MessageIndex": 6,
      "PostDate": "26/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107119/breast-cancer-looking-for-advice-experiences-support",
      "Title": "breast cancer, looking for advice,experiences,support"
    },
    {
      "AuthorID": "Felen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/felen",
      "Content": "My hubby is called George too. He is being brilliant. I am amazed at how he has taken this on board and doing everything he can to help. You sound like you have had a horrific time of it with chemo. I am so glad you are doing so well now. Are you having radiotherapy too? It is good to have everyone to talk to. Thanks for replying",
      "MessageIndex": 7,
      "PostDate": "26/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107119/breast-cancer-looking-for-advice-experiences-support",
      "Title": "breast cancer, looking for advice,experiences,support"
    },
    {
      "AuthorID": "Felen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/felen",
      "Content": "Dear Fiona I agree with everything you say about it bringing us closer together. I can only love a man who is so self sacrificing and doing his all to help me through this. We are similar in that my husband was away with work too or worked excruciating hours so I was accustomed to a very independent lifestyle and raised the kids almost like I was a single parent. We really drifted apart. But now we are so close and he is with me every step of the way. I feel like cancer is a very selfish disease though because my main concern every day is to get through to bedtime feeling well. It's me me me. I know it's self preservation but it feels strange to be like that. I hope I revert back when this is all over! Thanks for your reply",
      "MessageIndex": 8,
      "PostDate": "26/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107119/breast-cancer-looking-for-advice-experiences-support",
      "Title": "breast cancer, looking for advice,experiences,support"
    },
    {
      "AuthorID": "Felen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/felen",
      "Content": "Hi Lou I was started on letrozole before my op to slow down tumour growth before op but what a mess I was. Like the menopause magnified by a 1000. Biggest thing was I cried all day long. I was such a mess oncologist stopped them. I am on chemo just now but I know that's on the agenda for me again and I am dreading it. I hope you go to gp. That pain must be alarming and you should get it checked. Love Helen x",
      "MessageIndex": 3,
      "PostDate": "28/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107163/help-what-are-these-throbbing-pains",
      "Title": "help what are these throbbing pains ?"
    }
  ]
}