{
  "AuthorID": "fhleisdeir",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fhleisdeir",
  "Posts": [
    {
      "AuthorID": "fhleisdeir",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fhleisdeir",
      "Content": "Hi I finished Herceptin in April and my nails still haven't recovered. Herceptin is known to affect your nails too as well as the chemo drugs. I just have to keep my nails very short otherwise they split upwards and end up very painful. I have tried nail hardening varnish but it just flakes off in sheets. I think it will just take time.",
      "MessageIndex": 3,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99735/toenails-and-nails",
      "Title": "Toenails and Nails"
    },
    {
      "AuthorID": "fhleisdeir",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fhleisdeir",
      "Content": "Hi I was diagnosed with breast cancer in January 2014 aged 48 years . Wide local incision followed by full axilliary clearance due to finding cancer in one of the nodes , 6 sessions of chemotherapy followed by 15 sessions of Radiotherapy and Herceptin for a year plus on going Tomoxifen. During chemotherapy I started to get problems with my legs. I reported it to the nursing staff who documented it but didn't make anything of it. Every chemo session made my legs worse couldn't get up from a chair. climb stairs or walk very far. I finished chemo in July 2014 and in the November tremendous pain started in my hips, pelvis and legs. The oncologist put it down to a rare reaction to the chemotherapy drugs and said she had never seen it before. I am now on the maximum dose of Pregabalin, take Morphine and Naproxen and still the pain is not controlled. I have now been referred to a Neurologist to see if they can give some answers, I have a M.R.I next week. I can not get up from a chair unaided, struggle to get into a car as my legs don't lift, climb stairs or walk very far and in constant pain. There has been no improvement since chemotherapy stopped. Has anyone heard of this happening as I can not believe I am the only one or understand how the oncologist hasn't seen it before. I am hoping that the Neurologist may give some answers. best wishes to everyone Tracey",
      "MessageIndex": 0,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99738/left-disabled-after-cancer-treatment",
      "Title": "Left disabled after cancer treatment"
    }
  ]
}