{
  "AuthorID": "figKip",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
  "Posts": [
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Hello everyone, Still no results! My initial sample failed to produce a result when tested 3x so a new sample was sent to the lab, these results are STILL not back so I’ve been waiting a really long time now... they may arrive this week (week 3 of waiting for 2nd time) the chances are my sample won’t produce ANY result so they have said they will treat it as HER2 negative. This really worries me!!! If it’s unknown I may not be getting the right treatment (chemo & herceptin) my onco was quite matter of fact about this but I’m a bit scared. Has anyone else had an inconclusive test?!!! Thank you xx",
      "MessageIndex": 2,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149434/anyone-had-a-non-result-from-fish-her2-test",
      "Title": "Anyone had a non-result from FISH (HER2) test???!"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Hello everyone  Has anyone else had a FISH test for HER2 that comes back with no result?  I’ve been waiting for these results since Jan 9th and on Monday I was rung by admin @breast clinic to say ‘good news it’s negative’ only to be told later that day when meeting the radio/onco consultant that it was not negative at all, there was no result and whoever rang me made a mistake!! My sample was tested 3x and pathology report says the sample was unsuitable to get a result. A new sample was sent this week from the lump removed in surgery but I’m going slightly crazy... another 2 weeks wait...  If this sample doesn’t work - i’ll be left not knowing if I’m HER2+ Or not and that makes me anxious - I really don’t want chemo but not knowing if I should have had it or not seems barmy... now I’m really mistrustful of the test, the result and who tells me what... Waaaaaa! The wait is really getting to me! I have a 5 yr old little boy who keeps you in the moment but it’ll be almost 6 weeks of no results soon!  Thanks for any insights or experiences x",
      "MessageIndex": 0,
      "PostDate": "08/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149434/anyone-had-a-non-result-from-fish-her2-test",
      "Title": "Anyone had a non-result from FISH (HER2) test???!"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Oh hugs for you Jac... I’m glad they were kind to you, quite understandable, it’s all too much sometimes. My 1st visit (for tattoos) was quite upsetting as I was wondering what was wrong with everyone else rather than me and everyone looked very subdued and i felt quite sad. (I have a huge empathy button!) I hope you have a restful w/end. X",
      "MessageIndex": 137,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148740/february-2018-radiotherapy-club",
      "Title": "☢☢☢ February 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Hi everyone - I will be in the March radiotherapy club (start 1st March!) so I have been reading your posts with interest! I have my ct scan tomorrow (bit nervous - can anyone talk me through it?) and had no guidance /leaflets about radio yet - do they do that at the ct scan? My first appointment to talk about RT is 25mins before my first zap so I want to be sure I’m well prepared!!  No deodorant and wash thoroughly with simple soap beforehand - no creams - is that everything?!  Thanks you lot, wonder if we glow in the dark once finished I have 20 sessions 5 of those are boosts.... High fives to you all xx",
      "MessageIndex": 110,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148740/february-2018-radiotherapy-club",
      "Title": "☢☢☢ February 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Thanks D, interesting you’re less whiffs, I shall keep a nose on mine & I might be lucky too!! Kate x",
      "MessageIndex": 116,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148740/february-2018-radiotherapy-club",
      "Title": "☢☢☢ February 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Hey @louis7 We are in radio synch! My tatts were ok, middle one was OUCH and not very impressed that they’re blue! Middle one quite large.. hmm feel a bit weird about them. Maybe they’ll fade in a few years!  I never did get my FISH result - onco about to call it a failed test & accept biopsy result of HER2 negative. My onco says nothing else to try as I don’t meet NICE regs for oncotype / endopredict test on NHS - I could self-fund but it’s£2.5k!!!!! feel really wobbly about this as chemo may have been helpful but I’ll never know... can’t afford that fee! Also if I’m going to do that I’ll have to pull the RT as chemo needs to go first... I think I’m just going to go for RT / Tamox and hope for the best... feel very weird & quite tearful today... Kate x",
      "MessageIndex": 136,
      "PostDate": "23/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148740/february-2018-radiotherapy-club",
      "Title": "☢☢☢ February 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Thanks for the speedy reply Jac :-) That's really helpful - a question about deodorant - can you wear it on the zapping side or do you have to leave that one to whiff?! cheers, Kate x",
      "MessageIndex": 112,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148740/february-2018-radiotherapy-club",
      "Title": "☢☢☢ February 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Hi lovelies, I’m on day 2 of Tamox 20mg - woke up today feeling really nauseous... sigh!  Any ideas out there to help with this? Will it last? Temporary? Take 2 smaller doses? Bleurrrhhg.  Had sickness with radiotherapy so this is a drag... can’t tolerate this for 10 years!! Kate x",
      "MessageIndex": 0,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154253/tamoxifen-nausea",
      "Title": "Tamoxifen & nausea?"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "@amae - hello! Good point - I felt really queasy with RT so could still be that but i didn’t feel like this in the week after RT before I started Tamox - I did have flu tho so could be that leaving my system again. Thanks x",
      "MessageIndex": 5,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154253/tamoxifen-nausea",
      "Title": "Tamoxifen & nausea?"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Hmm thanks both, Time of day ... took after breakfast... perhaps I’ll try 6.30pm like you tomorrow. Travel bands are a good idea too! Thanks so much xx kate ",
      "MessageIndex": 3,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154253/tamoxifen-nausea",
      "Title": "Tamoxifen & nausea?"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Hi @jacmatholmad How’s things going for you? I’m doing ok, nearly 2 months on Tamox and seeing a bit of a pattern. Insomnia nuts - even taking tab at breakfast hasn’t helped (trying melatonin now). Nausea seems to be bad for 2/3 days a week or so after my period - it seems to coincide with ovulation which may make sense as that’s normally when you’d get a spike in oestrogen...  No hot flushes yet, () had 2 cold chills tho, they were nasty!! Nothing would warm me up. Weird stuff eh? Fatigue intermittently catches me out, some days I’m whacked / again looks linked to hormonal cycle. Other than that I’m back to work very soon and pretty much ok with occasional emotional wobbles! Hope you’re ok! Kate x",
      "MessageIndex": 10,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154253/tamoxifen-nausea",
      "Title": "Tamoxifen & nausea?"
    },
    {
      "AuthorID": "figKip",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/figkip",
      "Content": "Blimey - 5 days in and I’m knackered! Nausea a little less bad from taking tamox at bedtime. Hoping the tiredness eases off - had to have a doze this afternoon- not easy with a 5yr old razzing about! Can anyone tell me how soon they started getting hot /sweats after starting tamox? I’m waiting to get first ones & wondering if it will be next time my cycle is due... Thanks xx",
      "MessageIndex": 8,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154253/tamoxifen-nausea",
      "Title": "Tamoxifen & nausea?"
    }
  ]
}