{
  "AuthorID": "Fiona-Marie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fiona_2d00_marie",
  "Posts": [{
    "AuthorID": "Fiona-Marie",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fiona_2d00_marie",
    "Content": "Hi Ivy56, I'm the flip side of your coin - a daughter who won't let her mother attend any appointments.  Even through I'm through most of my primary treatmement (just reconstruction to go) I felt it necessary to distance my mother as I knew it was important to give her information in small chunks that she could handle, rather than dump on her the enormity of the situation I found myself in which would have overwhelmed her far more than it overwhelmed me.  Appointments, being accompanied by my mother, were a big 'no no' for me - tried it once and it lead to too many questions (which is quite natural) with my mother struggling to understand things at a time when I needed to digest and move forward.  I was also very mindful and concious about the emotions and well-being of those loved ones around me and, as a mother myself, I wanted to protect my kin as much as possible.  I did explain this to my mother as it was important that she understood it wasn't personal against her, just something I needed to deal with on my own, my way.  I also implemented the Ring Theory of kvetching with her and my family which helped no end.  The main thing is that your daughter is assured and knows that she can ask for help as and when she needs it ~x~   ------------------------------------------------------------------------------------------------------------------------------------------------------------------------ Dx 10/08/2017, IBC, Left, 6cm+, Stage IIIB, Grade 2, 8/17 nodes, ER+/PR+, HER2+ (FISH) Dx 10/08/2017, PLCIS, Right Chemotherapy 19/09/2017-03/01/2018, Cytoxan (cyclophosphamide), Epirubicin (pharmorubicin), Fluorouracil (5-fluorouracil, 5-FU, Adrucil), Docetaxel (taxotere) Surgery 22/02/2018 Lymph node removal: Underarm/Axillary; Modified Radical Mastectomy: Left Surgery 22/02/2018 Clearance: Right, Anchor Mastopexy with Areola Reduction Radiation Therapy 23/04/2018-11/05/2018 Axillary, Chest Wall, Infra/Supraclavicular, Bolus Hormonal Therapy 17/01/2018-* Femara (letrozole), Zoladex (goserelin) Targeted Therapy 14/02/2018-* Herceptin (trastuzumab)  ",
    "MessageIndex": 6,
    "PostDate": "09/07/2018",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/163138/daughter-with-breast-cancer",
    "Title": "Daughter with breast cancer"
  }]
}