{
  "AuthorID": "Flash-1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flash_2d00_1",
  "Posts": [
    {
      "AuthorID": "Flash-1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flash_2d00_1",
      "Content": "hello everyone, I’m new to the group and awaiting results of a core biopsy.  I received my first mammogram invite appointment at age 53 nearly 4 weeks ago. After 3 weeks I received a letter asking me to return, problem was that the appointment had passed! I phoned to make another appointment which was scheduled for 5 days later. Longest 5 days of my life (mum died of breast cancer aged 50), but in the back of my mind I was telling myself it was because they had nothing to compare against, When I arrived for my appointment I was told that “my name was not on the list”. I calmly said, “well you had better put it on, I’ll sit here and wait” I was lucky, (think clinic had finished) and I was taken straight through for another mammogram then through to ultrasound. The radiologist said that the 2nd mammogram looked better (no idea what first showed)! But as she began scan a lot of clicking happened, she then said, I’m concerned about this mass which I was able to look at on screen, and asked if she could biopsy. She completed 5 core biopsies and inserted a clip, I was then asked to for another mammogram. Following this I booked an appointment which is tomorrow and left with a leaflet re biopsy and a form to complete for next visit. Sorry for the long thread but as many have, are and will have similar tests, is all of the above normal practice?",
      "MessageIndex": 0,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/163885/core-biopsy-results-tomorrow",
      "Title": "Core biopsy results tomorrow"
    },
    {
      "AuthorID": "Flash-1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flash_2d00_1",
      "Content": "Thanks Carolyn, it’s comforting to know everything process wise is standard. Now a short wait for results, but good or bad I can make plans again",
      "MessageIndex": 3,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/163885/core-biopsy-results-tomorrow",
      "Title": "Core biopsy results tomorrow"
    },
    {
      "AuthorID": "Flash-1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flash_2d00_1",
      "Content": "Thanks Lesley, my results are in today, I wasn’t clear in my post (sorry). I had to make the appointment before I left, that was last Tuesday, they only give results Wednesday afternoons so it’s been a lengthy wait but on saying that not compared to some. Not sure where you are on your journey but do hope all is going well!",
      "MessageIndex": 4,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/163885/core-biopsy-results-tomorrow",
      "Title": "Core biopsy results tomorrow"
    }
  ]
}