{
  "AuthorID": "FloGee",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flogee",
  "Posts": [
    {
      "AuthorID": "FloGee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flogee",
      "Content": "Hi Pat, You have come to the right place...and no matter what the results turn out to be you will always find support and understanding in here. You must still be very raw after losing your Mum..so your feelings are completely understandable. I was diagnosed last May and have had the chemo, a lumpectomy and now having a very short course of radiotherapy.  It all sounds so daunting at first, but ours is a path very well travelled and I take comfort from the fact that treatments are advancing all the time. I took part in a drugs trial during my chemo and am doing another trial with the radiotherapy..it helps me to think that, not only am I getting treatment, but by doing this, I might be helping to make things even better for others in the future. Come and join us in the main Chat room too - it's not all about the illness..a lot of it is good, old fashioned companionship and support. You'll find a great mix of carers and patients in there..there's a lot of laughter and the odd shared blub or two! Just click on the 'Chat' icon and jump right in! You are not on your own. Pat. There are hundreds of us out here dealing with the same or similar things. Hold tightly to our hands....together we can get through this! Flo x",
      "MessageIndex": 2,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45917/waiting-game",
      "Title": "Waiting game"
    },
    {
      "AuthorID": "FloGee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flogee",
      "Content": "Several of my fingernails now look like I've caught them in a closing door. Creaming them loads and hoping to save at least some of them. Such an attractive addition to the chemo-side-effect list! No one mentioned to me about using varnish on them. I have always varnished my toe nails and they seem to be fine so far. I've just completed chemo 4 of 6. My fingers are a little tender but not sore - so can still open most packaging, but I am careful how I do so! ",
      "MessageIndex": 25,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41180/losing-fingernails",
      "Title": "losing fingernails!"
    },
    {
      "AuthorID": "FloGee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flogee",
      "Content": "Several of my fingernails now look like I've caught them in a closing door. Creaming them loads and hoping to save at least some of them. Such an attractive addition to the chemo-side-effect list! No one mentioned to me about using varnish on them. I have always varnished my toe nails and they seem to be fine so far. I've just completed chemo 4 of 6. My fingers are a little tender but not sore - so can still open most packaging, but I am careful how I do so! ",
      "MessageIndex": 10,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41180/losing-fingernails",
      "Title": "losing fingernails!"
    }
  ]
}