{
  "AuthorID": "Flox2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flox2",
  "Posts": [
    {
      "AuthorID": "Flox2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flox2",
      "Content": "Hi Clemmie, As someone else posted, before you go for genetic testing, you get to speak with a genetic counsellor. They should explain the test to you full and discuss all the issues relating to it. Including how to discuss it with other family members. I was given a sample letter to give to my family if I wanted. I am in Ireland and here, a family member who has had cancer must test BEFORE any other family member can be tested. I don't know if it is the same in the UK. Good luck in your decision. It is a difficult one to make and there could be more difficult decisions IF you test and come back positive for a genetic mutation. I did so in 2007. Flo.",
      "MessageIndex": 7,
      "PostDate": "09/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10858/genetic-testing",
      "Title": "Genetic Testing?"
    },
    {
      "AuthorID": "Flox2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flox2",
      "Content": "Hi everyone, My 39 yr old BRCA2+ cousin was recently diagnosed with invasive lobular carcinoma in her right breast. They initially did a lumpectomy but failed to get everything so then, at her insistence, they did bilateral mastectomy with expanders and implants and also sentinel node biopsies. The tumour in her right breast was almost 5cm (despite an initial estimate of 8mm) and the left breast was clear but with some pre-cancerous activity. Her left side nodes were clear and they classed the right side as clear but they found ONE cancer cell in one of 6 nodes removed from the right side. The pathologist took weeks testing the remaining 5 nodes and said he found no other cells in any of them which is why they are saying all her nodes are clear. Initially, we hoped that, if her nodes were clear, she would not need chemo. But her surgical oncologist said that because of her young age, that he would HIGHLY recommend it. We also hoped that she might not need radiotherapy either because she'd had the BM and also because of the cosmetic impact it might have on her implant recon. But he said she would need this also. So she had gotten her head around having to have 'the whole shebang' and was even relieved that everything would be thrown at the cancer to prevent a recurrence and/or spread. However, she has just phoned me to say that she met with the medical oncologist today who says she will NOT be given either chemotherapy OR radiotherapy. No radiotherapy because her tumour was less than 5cm. And no chemo because she also has an inherited condition called HHT (Hereditary Hemorrhagic Telangiectasia) (or Osler-Weber-Rendu syndrome) which affects blood vessels. Because of the affect chemo would have on her blood, the consultant said the risk of a bleed, particularly gastro-intestinal, would be high and so chemo was not worth the risk. We are all surprised by this turnaround. And pretty worried. The hospital knew well in advance about her HHT and the HHT centre she attends for screening sent up her file and some info for her oncology team in the very early stages of her diagnosis. At no time did the HHT clinic say that chemo was not an option for her because of the HHT. She is putting in a call to the HHT consultant in her clinic tomorrow to get his opinion. She is also due to go back in two weeks to the medical oncologist to discuss things further. And to get her prescription for Arimidex which is all the post op treatment they have planned for her. :-( In the meantime, I am trying to get her as much info as possible on chemo with her condition (she has no access to the internet). If anyone knows of anyone who has HHT (or a similar blood vessel condition) and has also had chemotherapy, can you get in touch? If the usual cocktail of AC and Taxol is too hard for her to take, is there perhaps another chemo cocktail that might have benefit without being as big a risk for serious, or fatal, bleeding? If there is anyone here who may have access to Medical sites and journals that I cannot access - could you do a search for HHT plus chemotherapy to see if it HAS been done? And what rate of problems like TIAs, strokes, gastro bleeds occurred. For any of you who have had cancer (like me), can you remember how weird it felt after chemo and/or radio finished and you were sent back to 'normal' all of a sudden? I found this bit quite tough. I felt kind of abandoned after a year of high level care and supervision. Imagine what it would be like to have this straight after surgery, with NO other medication? I am really not comfortable about this at all and am really worried for her future. ANY help or advice at all would be really, really appreciated. thanks, Flo.",
      "MessageIndex": 0,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10937/help-cousin-with-bc-denied-chemo-and-radiotherapy",
      "Title": "Help! Cousin with BC denied chemo AND radiotherapy!!"
    }
  ]
}