{
  "AuthorID": "Flute",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flute",
  "Posts": [
    {
      "AuthorID": "Flute",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flute",
      "Content": "I am having a bad day today and am hoping that sharing may help. I am 12 months post surgery, 4 x chemo and 23 radiation sessions.I was diagnosed and treated overseas and never had anyone to talk to about my journey. I was the strong one for my two teenage daughters and my family was 4,000 miles away. Sadly following the end of my treatment my 20 year marriage ended and I returned home to England, with my daughters - after 10 years in Canada. I have managed to get myself a full time job working with special needs children and a home. Life as a single parent is tough. I am incredibly grateful that I have managed to get to this point but I just feel emotionally shattered. It seems that while I had purpose in getting well, getting a job and home my mind was busy enough. Now I have achieved those things I feel like I am crumbling. I feel so sad and so alone. I am a new member to this forum in the hope that maybe I can get and give some support. I have heard the term a new normal so often and it's true. I still feel very tired some days and I still find it hard to relate to people..it's a bit like a bubble feeling...I don't feel like I fit in at all. I am having some very tough days and just feel like crying. Will this ever get better?   Just reading some of the many wonderful posts and helpful replies on here has been such a revelation that there are so many of us on this journey. Thank you for an opportunity to share. ",
      "MessageIndex": 0,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76041/i-feel-so-alone",
      "Title": "I feel so alone"
    },
    {
      "AuthorID": "Flute",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flute",
      "Content": "Thank you ladies it has been a tough 12 months but I still feel lucky, it could have been worse. Your messages of love and support have really cheered me. I am still readjusting to life back home, so I guess it's understandable that everything still feels a little weird and hard for me to find my feet. Some days the tiredness and frustration and anger just come flooding out but it was probably helpful for the first time that I had people who could empathise when I ranted, so thanks :) I am trying to put a little time aside for myself and taking things day by day. Today was better so that's a good start. Now I need to figure how to edit my profile on here and see what groups are available. I have bitten the bullet and made an appointment with my doctor..who luckily for me is also a cancer survivor so I am hopeful that he will have some good advice and be a support. Thanks once again for caring, you have warmed my heart (unless it's the tamoxifen and hot flushes again!) xxxx",
      "MessageIndex": 10,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76041/i-feel-so-alone",
      "Title": "I feel so alone"
    },
    {
      "AuthorID": "Flute",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flute",
      "Content": "cancer is a life changing event for us all. It makes us truly reflect on what and who is important in our lives because we realise how precious it is. Coming home from a holiday pre-cancer always left me feeling the holiday blues and I am sure that is part of it. Maybe being away was also an escape from all the reminders of your journey - or maybe it is a reminder that you need to make some changes in your life now. It has made me very reflective and I realised that I had become a square peg that no longer fit in a round hole - I am not the same person that I was and much as I tried I couldn't become that same person - so I made changes that reflected the new me. Give things a little time and see how you're feeling. sending love xxx",
      "MessageIndex": 6,
      "PostDate": "27/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77293/moods",
      "Title": "moods"
    },
    {
      "AuthorID": "Flute",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/flute",
      "Content": "I can really empathise with how you're feeling. Whilst we are going through surgery and treatment people understand that help and support is much needed because they can see something is wrong physically, however I too have found life a lot more challenging since also finishing treatment. The comments about being \"better now\"  and \"looking well\" are very hard to take, especially when on the inside it doesn't feel like that at all. I think emotionally cancer is a lot harder to deal with than physically. My oncologist recommended the following book to me \"Picking Up The Pieces:Moving Forward After Surviving Cancer\" It truly helped me as it had lots of practical advice and experiences shared by people that are cancer survivors - and truly understand what we experience. I too am suffering with anxiety and some days feel almost paralysed by fear and coping. As a single parent with teenage daughters it's sometimes hard to be strong, especially now I am back at work full time and trying to juggle everything. I have only just joined this site and I am one year post-treatment. I am hoping too that maybe by sharing some experiences it will help me not to feel so alone.xxxx",
      "MessageIndex": 5,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75562/back-to-work-next-week",
      "Title": "Back to work next week"
    }
  ]
}