{
  "AuthorID": "Fonty55",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fonty55",
  "Posts": [
    {
      "AuthorID": "Fonty55",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fonty55",
      "Content": "Hi There Good luck with the op on Thursday and here's a to swift and full recovery. Hope all goes well with the lymph biopsy. I'll be having something similar in a few weeks time. Mastectomy and sentinel node biopsy. So, I feel your anxiety. This forum will help with anxiety as there are a lot of people (sadly) who have been through this experience and can share what they've learnt. Wishing you all the best. Just think, it will be over by the weekend and the healing begins. Fx",
      "MessageIndex": 1,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165669/apprehensive",
      "Title": "Apprehensive ....."
    },
    {
      "AuthorID": "Fonty55",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fonty55",
      "Content": "Hi there So sorry to read you're in the same boat, roughly speaking. But it's not all bad news – you will probably have been told the same thing I was, that this is treatable and you're not in danger. But, the treatment is far more invasive than the cancer. Here's where I'm at, if it helps in any way. I've been diagnosed with 4 x 2.5cms low/intermediate grade DCIS. I was first at Charing X and I had a second opinion at the Royal Marsden. Both concluded that mastectomy with immediate reconstruction is the best option to ensure I'm cancer free as quickly as possible. I'm small breasted (34C) and a lumpectomy would take half my breast away. The Marsden favoured a DIEP reconstruction, which is what I've opted for and will be having surgery on Oct 5th.The DIEP appeals because it's my own tissue (tummy tissue) and it will change in sync with the rest of my body. I can opt to have a nipple reconstruction and/or tattoo at a later date if I choose. There are two downsides to the DIEP. One, the surgery is about 8 hours long, that's 8 hrs under anaesthetic, which is really daunting. And two, the recovery time is much longer – and I'll need to take 6/8 weeks off work. I'll be in hospital for 5 days and will have difficultly walking upright for the first two weeks. If you choose to go down the DIEP route, you'll need to have a CT scan on your abdomen to identify the location of your blood vessels, essential for the intricate microsurgery. And, you'll be a better candidate for this type of reconstruction if you've not had any abdominal surgery before. You'll then be assigned a Breast Surgeon and a Plastic Surgeon. During my surgery, the two surgeons will be working simultaneously, one on the breast and one on my tummy. It feels like I've volunteered to be butchered in my sleep, but I'm trying hard to just focus on the fact that these people are experts and they take pleasure in perfection and just think about that moment I wake up and can have my first sip of tea. I'll also be having a sentinel node biopsy, and there is a possibility my mastectomy will be nipple-sparing. But personally, it would be a nice to have, but I'd rather be completely cancer free than have a nipple that might need to be removed a few weeks later if the tissue pathology isn't clear. Is your diagnosis following a mammogram/MRI/biopsy route? And, have you been advised about a sentinel node biopsy, and the small risk of lymphoedema? Like you, I won't know whether I'll need further treatment, possibly a three-week course of radiotherapy. I'll get my final results about 10 days post-surgery. I'm more than happy to try and answer questions and share my own experience with you. Good luck with your decision making. All best Fonty",
      "MessageIndex": 1,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168236/newly-diagnosed-with-high-grade-dcis",
      "Title": "Newly diagnosed with High Grade DCIS"
    },
    {
      "AuthorID": "Fonty55",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fonty55",
      "Content": "Hi Ruby Rose I see you have your oncology appointment on Monday (saw this on your profile). Good luck – wishing everything of the best and the news you get is all good. Fx",
      "MessageIndex": 23,
      "PostDate": "18/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166162/looking-for-mastectomy-buddy",
      "Title": "Looking for mastectomy buddy"
    },
    {
      "AuthorID": "Fonty55",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fonty55",
      "Content": "Hello Anyone else experience infections in your urinary tract, or strange stinging/prickly sensations around your urethra? I'm now two weeks into a five year course, and this evening developed these symptoms. I don't know whether it's the start of an infection I need to see my GP for (to get a course of antibiotics) or if it's a side effect of the Tamoxifen, as I've read the drug can affect the urinary tract. Your experiences and any advice very much appreciated. Thank you Fonty",
      "MessageIndex": 0,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170782/tamoxifen-and-urinary-tract-infections-utis",
      "Title": "Tamoxifen and Urinary Tract Infections (UTIs)"
    }
  ]
}