{
  "AuthorID": "foxy01",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/foxy01",
  "Posts": [
    {
      "AuthorID": "foxy01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/foxy01",
      "Content": "I'm scheduled to have SGAP reconstruction in September.  Like you I really struggled to find anyone who had had this type of reconstruction or any decent pictures.  I live in Berkshire and all of my cancer treatment was done at Royal Berkshire.  When it came to reconstruction I was only offered the Diep Flap but I wasn't very keen on having implants so I was referred to St Thomas' in London to see the only surgeon that does SGAP.  He told me that in the 6 years he had been doing this type of recon he had done approx. 150 surgeries.  He was able to show me photos and the results looked fantastic.  Have to admit though I do feel rather \"lonely\" as I'm kind of on my own!  Please send me a message if you want any more info from me. Gail Enter your message...",
      "MessageIndex": 4,
      "PostDate": "10/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79444/breast-reconstruction-with-gap-flap",
      "Title": "Breast reconstruction with GAP flap"
    },
    {
      "AuthorID": "foxy01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/foxy01",
      "Content": "Hi everybody, I'm due to have my reconstruction done in a few weeks time and would love to get some advice from all of you lovely ladies out there who have already been through this.  Firstly any good recommendations on what type of bra to get to take into hospital and how do you get measured??  Secondly, has anyone had lipomodelling on the unaffected breast for augmentation?  My remaining breast is very small with little volume (thank you children!) and I'm trying to get my surgeon to agree to increasing the size of this breast with lipomodelling rather than an implant.  So if anyone has had this done did you find it successful? Thank you all, Gail",
      "MessageIndex": 0,
      "PostDate": "08/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80885/bras-post-reconstruction",
      "Title": "Bras post reconstruction"
    }
  ]
}