{
  "AuthorID": "Freckles22",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/freckles22",
  "Posts": [
    {
      "AuthorID": "Freckles22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/freckles22",
      "Content": "Hi Lynne I had a lumpectomy 4 weeks ago today and it went really well, I arrived at the hospital at 7am, was in theater by 9am, was back on the ward by 11am and sat at home on the settee with a cupa by 1.30pm.   I have had no real problems since, a little sore at first and a numb hot sensation at times, but i've been back to work for 2 weeks now. I'm sure theres a chance of it coming back but theres also a chance of it not, life is one big chance, i'm just pleased that mine has gone and in four months time when my chemo is all over with i'm gona enjoy this life and my family.    Freckles XXX",
      "MessageIndex": 1,
      "PostDate": "18/11/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44538/newly-diagnosed-breast-cancer",
      "Title": "newly diagnosed breast cancer"
    },
    {
      "AuthorID": "Freckles22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/freckles22",
      "Content": "Hi LoneFox Your story is so similar to mine, I too found a lump in August and spent 4 weeks waiting for various appointments and results.  I was diagnosed with stage 3 breast cancer , had a lumpectomy and my lymph nodes were clear, I started chemo on Friday, 6 sessions 3 weeks apart so will be end Feb by time I finish, then 3 weeks of rt and then 5 years of tamoxifen...   I opted for scalp cooling which wasn't that bad.   I did last night felt really sick so was in bed for 6pm and slept right through till 7 this morning, still feel quite sick but I believe this is quite normal.  I am trying to stay positive through it all and find reading other peoples storys of great help as i no there are so many others going thorugh the same thing.. Freckles XX",
      "MessageIndex": 7,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44291/am-i-normal",
      "Title": "Am I normal?"
    }
  ]
}