{
  "AuthorID": "Funny girl",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/funny-girl",
  "Posts": [
    {
      "AuthorID": "Funny girl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/funny-girl",
      "Content": "Hello Misty, Don't let your PS talk you out of anything. If he can't help change him! I only had my expander in for weeks, not like you and I found mine to be uncomfortable especially at night. The port used to move around alot. I was told I could leave it in but I couldn't wait to get rid of it. You would need to have a CT scan of you abdomin to check that your blood vessels are suitable for the DIEP.Maybe you have already had one. My op took about 6 1/2 hours (best sleep I had had in ages). Woke up very sore and spent the next two days in the high dependency unit. The hardest thing was not being able to stand straight for about 2 weeks.  Big scar on tummy (46cm) but very neat.( I tell everyone I was attacked by a shark while driving off the coast of South Africa). Had a little bit of lipo to fill in the odd dent later on. I am numb but as time has gone on I can feel sensations under the skin. The expander was placed under the skin not the muscle. As the PS said we only need the skin to stretch. The fat density is a little uneven in places. (Mainly on the side of the flap going up to my armpit) but the remainder feels just like a real breast. It looked great before the nipple was reconstructed. I even contemplated just having a stick on nipple. My PS recommended the further surgery and I'm glad he did. Once it was all done it was like the icing on the cake. There are times when I forget it's not real! What ever you decide it is your choice. It's your body and you have to live with it. And if you end up with the breasts and stomach of a twenty year old - go Girl!!! Trish x",
      "MessageIndex": 6,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47243/chemo-at-home",
      "Title": "Chemo at Home"
    },
    {
      "AuthorID": "Funny girl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/funny-girl",
      "Content": "hi June, Will be thinking of you on Thursday. Don't forget a blanket and hot water bottle - the drugs are refridgerated so you are going to get cold. Trish x",
      "MessageIndex": 9,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47243/chemo-at-home",
      "Title": "Chemo at Home"
    },
    {
      "AuthorID": "Funny girl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/funny-girl",
      "Content": "Hi June Glad to see you are keeping your sense of homour. My reconstruction was mapped out by my plastic surgeon from day one of the mastectomy. The general surgeon saved as much of the skin as possible so it could be stretched later using a tissue expander. It only took about 7 weeks to reach the right size. Surgeon said I had very stretchy skin. (That's what having two children does for you) The expander was fitted Aug 2010 and I had a DIEP flap op in the November. So I now have the tummy of a twenty year old! Actually I don't tink my stomach was ever this flat. The finall result is amazing. Had some lipo to get the shape spot on, then nipple reconstruction and finally in Dec a tattoo. Now all done and I have my cleavage back. Can't begin to tell you the difference this has made to my self esteem. It's not an easy option but I am very glad I did it and haven't got implants. Let me know how you get on. Keep smiling Trish x",
      "MessageIndex": 4,
      "PostDate": "20/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47243/chemo-at-home",
      "Title": "Chemo at Home"
    },
    {
      "AuthorID": "Funny girl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/funny-girl",
      "Content": "Hi June, I had my Chemo treatments at home. It was soo much more convenient than going to the hospital every three weeks. The cycles take about two hours in total. When the nurses came round we would spend all the time chatting and drinking tea and coffee, the time flew over. I met some really nice nurses over the months. The best part about being at home is that you get to watch TV or listen to your fav music.   And when it's all done you get to curl up on the sofa  with a nice warm drink.  I too have had a MX but mine was way back in Aug 2009. Had Chemo, Rads and Herceptin(also at Home) I completed my reconstruction In Dec of last year. It is a rollercoaster but it will slow down eventually. Just be patient with your self and take one day at a time. We are made of strong stuff and you will get through this. Are you going to use Cold Caps while having treatment? I Did and did not lose any hair! I did lose it every where else lol. Good luck for Thursday Take care Trish x         ",
      "MessageIndex": 1,
      "PostDate": "18/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47243/chemo-at-home",
      "Title": "Chemo at Home"
    }
  ]
}