{
  "AuthorID": "furryfriend",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
  "Posts": [
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "Hello – I also had low white blood cell 1.4 after the first FEC, it is quite normal – don’t worry.  My second treatment was delayed by one week and during this time it naturally increased to 2.8. After the second FEC I was given a course of five injections of Filgrastin. On my third FEC the count was 1.7 and after treatment I was given another course of Filgrastin injections x 5. As I didn’t want to wait in for the district nurse or wait in the doctor’s surgery, I administered the injections myself. I was proud of myself as all my life I have had a phobia of injections. I had a little bit of stress to start with but the needles are fine, quite painless and very easy to use. They say Manuka Honey can help to increase white blood cell. Don’t know how true this is. Christine x",
      "MessageIndex": 3,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53922/pre-chemo-blood-results-are-low",
      "Title": "Pre chemo blood results are low"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "Hello Jackie, I felt reasonably well with my first FEC x 6 treatment. It did built up and by the fifth treatment, I stayed in bed for twelve days, only venturing out for the loo and food. The last FEC I had had enough but at the same time felt euphoric that I had completed it and got through. For me it was a challenge, however, some have little reaction or side effects to the treatment and breeze through. I went out most days - walked the dogs - ate what I fancied. I did put on weight and this was a tad depressing what with the hair loss and all. Don't worry the nurses in Chemo units are wonderful and are experts in finding good veins. This was my biggest fear and I didn't have any  really bad experiences. It is stressful not knowing what to expect. I finished my treatment November 30th last year and the time wizzed by. It will be over and done before you know. You will be fine and it's a great feeling coming out the other end - Christine XX",
      "MessageIndex": 13,
      "PostDate": "09/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58419/nervous-about-starting-chemo",
      "Title": "nervous about starting chemo"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "Hello Michele, Over the past few days I’ve been waking up at 5am in the morning  feeling sick and feeling a tad sorry for myself.  By mid-day I usually get a grip and try and enjoy the day.  It really is great to know that there’s someone out there that understands. As yet I haven’t had any major reactions to the Chemo – I think I have felt down because it’s completely out of my control and I can do nothing but go with it. Like you say the Chemo is a fairly short treatment and we will get better very soon. Be thinking of you on the 31st August – let me know how you get on. Big Hug   Christine x",
      "MessageIndex": 15,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52362/fec-and-hair-loss",
      "Title": "FEC and hair loss"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "Thanks so much Sue for your kind words. All the posts made such a difference  -  I had a good day today. I find that having a grizzle for a minute or so first thing in the morning, usually around 5am, is a release and I can then get on with my day. I don't plan on making it a habit and I'm sure it'll pass. Thanks again Big Hug Christine x",
      "MessageIndex": 16,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52362/fec-and-hair-loss",
      "Title": "FEC and hair loss"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "Hello, I was diagnosed with invasive lobular breast cancer in June 2012 and had the lump, grade two approximately one inch and a main lymph node removed on July 12.  As the lump was below the nipple I received cosmetic surgery with nipple realignment – really pleased with the outcome - an excellent and very neat job. The surgeon told me that I can go back and he will reconstruct the other, making a matching pair. On Friday the 10th August I started FEC Chemotherapy and at the moment, I feel very good apart from mild sickness that woke me up at 5am this morning.  I’ve just taken a sickness tablet so it should go soon. I really don’t know what to expect – hopefully it will be plain sailing :-) I wore a cold cap and hope to keep my hair even if it’s short term. If you can tolerate it for the first ten minutes it does get better - In fact I went to sleep with it on.  I am tempted to shave my hair off as  I have bought two lovely wigs that are much better than my own hair and natural looking too – so if my hair goes …I’m not too bothered. After the Chemo I will need three weeks of radiotherapy and five years of hormone therapy. Christine x",
      "MessageIndex": 3,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52362/fec-and-hair-loss",
      "Title": "FEC and hair loss"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "It's a very bad day for me today and I  feel like I’m losing the plot. I felt that I dealt with the diagnoses the surgery and all the other stuff really positively. But this morning I have woken with a cloud of doom. The Chemo is killing me psychologically and I am terrified of my second FEC on the 31st August.   I feel trapped and I want to get out but there’s nowhere to go.  I worry about what Chemo is doing to me and I am terrified to read the thread about sore veins. I feel weak at the thought.  This horrible feeling will pass and I know I will be mentally better tomorrow.  I do remind myself every day that it is preventative medicine and that I am being cleansed of any lurking cancer cells.  :-)  I take Diazepam on days of stress like hospital appointments – it helps a lot.   On a positive note for years I suffered from pain to the lower part of my back and soreness to my left side of my stomach and since taking the steroids / anti-inflammatory Dexamethasone 2mg tablets, I have no pain. Yippee. Christine x",
      "MessageIndex": 9,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52362/fec-and-hair-loss",
      "Title": "FEC and hair loss"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "Hello S, Thank you so much for your reply it really did lift my spirit. I have lived in Wales for the past six years and my family are in Kent. I have very little support here and I plan on having treatment in Wales and then return to Kent.  This has been a big wakeup call and it’s time to return home to my family and friends. You hit the nail on the head, it's been an emotional rollercoaster ride and my emotions have been building up and I’ve been doing a great job putting on a brave face . You are right, I need to plan ahead and do things that are enjoyable and fun - something that I haven’t done in the last few months.  I’ll be thinking of you tomorrow, the Picc line hopefully will make treatment less stressful.  I was surprised that the treatment was so quick – 30 to 40 minutes and painless. Tomorrow it will be one down and five to go. A Big Hug Christine x",
      "MessageIndex": 14,
      "PostDate": "14/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52362/fec-and-hair-loss",
      "Title": "FEC and hair loss"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "You look great and WOW you have eye lashes - Twiggy is a great colour and very natural.  I bought a blonde bob style wig with a fringe and  found it easy to wear as the fringe hides eye brows/lashes or the lack of them. Christine H x",
      "MessageIndex": 5,
      "PostDate": "12/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56804/twiggy-s-up-for-sale-my-wig--",
      "Title": "Twiggy's up for sale (my wig :-)) )"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "I totally agree with you, I too have had excellent care and will never moan again about the NHS.   I didn't hesitate I wanted the tumour out and didn't want to hang about waiting any longer than necessary.  I was terrified of the treatment namely the Chemo but I can't imagine delaying treatment. Especially delaying treatment for dubious and unproven therapies, better used to compliment conventional treatment. I want to get back to a 'normal' life - the quicker the better. Christine x",
      "MessageIndex": 4,
      "PostDate": "18/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54334/decision-what-decision",
      "Title": "Decision? What decision?!"
    },
    {
      "AuthorID": "furryfriend",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/furryfriend",
      "Content": "I am nearly the same age as you and have had similar treatment too.  In July I asked for a CT body scan as I had pain in my stomach, they found a 1cm something in my liver.  I then had a MRI liver scan to find a cyst and something that they cannot identify at this time. I am on my 3rd cycle of FEC and in December I will get another MRI and hopefully the results will not be life threatening.  I do not write on this forum very often but I do read it every morning. It allows me to have a bit of a grizzle and vent my emotions (30 seconds maybe) then get on with the rest of my day. I have found the advice help and kindest is second to none.  Helen mentions Diazepam, I take 2 or 3 tablets on chemo days – it helps a lot. Believe me I do understand how you feel. Please try and get the idea that you are 'a  gonna' out of your head. You are not 'a gonner'.  With regard to liver cancers, teaching hospitals in the UK are respected around the world and give the best treatment possible.  Even with the worse scenario, I could live a very long time. However, on a positive note I believe that it is another cyst.  Chin up – Thinking of you.  Christine x",
      "MessageIndex": 5,
      "PostDate": "05/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53968/soo-scared-and-not-sleeping-i-am-having-a-liver-ultra-sound",
      "Title": "soo scared and not sleeping i am having a liver ultra sound"
    }
  ]
}