{
  "AuthorID": "Fussyrobin",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
  "Posts": [
    {
      "AuthorID": "Fussyrobin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
      "Content": "Hi, as i was prone to mouth ulcers anyway, when i started my chemo (FEC-T) my oncologist prescribed aciclovier to be taken from day seven to day fourteen after each treatment. I was told to use salt water as a mouthwash or a shop bought one that was alcohol free but I found the proper shop bought mouthwashes hurt my mouth to much! I tried the pineapple but it made my tounge bleed and nip. When I felt nauseous I nibbled on a rich tea biscuit or sucked a barley sugar sweet...they really did help oh and I drank a lot of milkshake for the first week or so after each treatment, it seemed to soothe my mouth and it was about the only thing that tasted right :) I did get a couple ulcers but nothing I couldn't cope with which really surprised me as I was so worried that my mouth would be a real mess. I hope you find something to help you and good luck with the rest of your treatment xx",
      "MessageIndex": 4,
      "PostDate": "24/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70714/fec---natural-helps",
      "Title": "FEC - Natural helps?????"
    },
    {
      "AuthorID": "Fussyrobin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
      "Content": "Hi, sorry this is going to sound like I'm being childish but I just need to let it out!!! I have triple neg BC diagnosed in august last year, had chemo which finished in december and two weeks ago i had a double mastectomy. I have kept a positive attitude throughout and never ask anybody for anything. My partner, daughter and myself just get on with it and I feel we are doing a dam good job of it. I am the eldest of four and and right from the start of all this have been made feel guilty by my sister and youngest brother! They quite happily tell me that they have felt left out and jealous of all the attention i am getting. And they are sick of how every conversation ends up being about me. At one point my sister actually said they sometimes wished they had something wrong so people would take notice of them! I try telling them that I don't want any special treatment and hate that everything revolves around me. I try so hard not to make to big a deal of this but they still make me feel guilty. My mum and dad visit every day, despite being told they don't have to do this, I never ask them to do anything for me when they visit and I make the tea and tidy up afterwards. Not once have any of them visited and had to do anything for me regardless of how crap I felt. At christmas they all came round for an evening and my partner and myself laid on a good spread and ran about keeping them all supplied with drinks, but I am still made feel guilty for having cancer and how bad it makes them feel. I think thats why I am so fed up of it, they are all feeling sorry for themselves but my thirteen year old daughter is able to cope with it with no complaining!! My youngest brother doesn't visit much because he isn't \"coping very well\" with the whole cancer thing but hates that mum and dad talk about how well I am getting on and I quote \" I am sick hearing how perfect you are\". Sorry this is a bit of a rant and don't get me wrong my sister is very caring but I feel just terrible every time they feel bad because they are feeling left out. I think I am dealing with this whole cancer thing pretty well but the snide petty comments are really starting to bring me down and other than having a massive falling out with them, which is what will happen if I say anything about it, I hold my tongue! My partner is sick of it but I ask him not to say anything. It is something I feel I will just have to put up with and I am embarrassed to say that I feel like saying they should try being in my shoes but that is pretty mean. It has helped just to rant about it on here cos I know I will never actually say anything to them about it. Just feeling sorry for myself I suppose!",
      "MessageIndex": 0,
      "PostDate": "17/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73702/feeling-guilty",
      "Title": "Feeling guilty!"
    },
    {
      "AuthorID": "Fussyrobin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
      "Content": "Hi Jude You sound exactly like me!! Mind you I think we are very entitled to have a good moan, it dose you good! I think my family feel they are helping with their positivity, dont get me wrong I am being very positive and appreciate them trying to help but sometimes I just want them to say \"aww you poor thing it will get better with time\" instead of telling me chemos finished its behind us now. I want them to understand its a long slow process! I am the queen of moaners haha",
      "MessageIndex": 7,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70207/after-chemo",
      "Title": "After chemo..."
    },
    {
      "AuthorID": "Fussyrobin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
      "Content": "Hi, Alison, thanks for your reply, it helps to know that its not just me. I know it will pass and it is a small price to pay to beat the beast but it is kinda gettin hard to focus on anything as the side effects seem to be consuming me, mind you its taking my mind off the actual word cancer cos i am moaning about everything else lol I have been rubbing my nails and fingertips with savlon cream which is keeping them moisturised, never thought about using oil...do you mind me asking what kind you use? Thanks Linda x",
      "MessageIndex": 6,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70207/after-chemo",
      "Title": "After chemo..."
    },
    {
      "AuthorID": "Fussyrobin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
      "Content": "Hi, had my last T (Docetaxal) treatment four weeks ago...hurray :) The neuropathy in my fingers seems to be getting worse, my fingernails are awful looking, the skin is peeling from the soles of my feet, my muscles are aching and I am just knackered all the time. Is it normal for things to get worse once chemo is finished? I had three FEC then three T treatments and I feel quite lucky that they didn't knock me down to much. The FEC caused a vein to constrict which was very painful and during T my weight shot up and I ended up neutropenic after the first treatment of it but overall I thought I got through it really well. Just feel a little disheartened that the side effects seem to be bothering me more now the treatment is finished. Still have the joy of surgery and radiotherapy to look forward to but no point getting down about it....onwards and upwards :)",
      "MessageIndex": 0,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70207/after-chemo",
      "Title": "After chemo..."
    },
    {
      "AuthorID": "Fussyrobin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
      "Content": "Hi Tracey, Thanks for that, helps a lot to know it is normal! I talk to my family about it but they are of the mind set that chemo is over, the side effects will be going and we now focus on surgery and radiotherapy. They are trying to be positive and say what they think will help i suppose! But I was beginning to worry some of it was my imagination lol Take care Linda",
      "MessageIndex": 2,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70207/after-chemo",
      "Title": "After chemo..."
    },
    {
      "AuthorID": "Fussyrobin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
      "Content": "Thanks will have to give that a try. Enjoy Brownies, I loved going when I was young although the uniform is much nicer than the brown dress and brown knitted hat they wore when I went xx",
      "MessageIndex": 10,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70207/after-chemo",
      "Title": "After chemo..."
    },
    {
      "AuthorID": "Fussyrobin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/fussyrobin",
      "Content": "Hi, I finished six treatments of FEC-T in December. At my first chemo I got given a red book which the nurse filled out after each treatment and a small thermometer (although I did buy myself one of those digital ear ones) and in the book there is a page of possible problems, such as sickness, rash, pain etc. and they are colour coded : green is its ok, orange means call chemo nurse and check , and if its in red you must call straight away. It also tells you what your temp should be between and what you should do if it falls/rises. I got really bad indigestion and suffered from mouth ulcers so they gave me meds to take and they really helped. But taking your temp is really important especially from day 7-14 as this is when your immune system dips and makes you prone to infection.. For me there was a pattern.....first week after chemo i felt like i had a hangover which got slightly worse after each treatment. Week two i was afraid to go out incase i picked up any infection and week three i felt almost normal again and ready to face the next treatment. Take care and good luck x",
      "MessageIndex": 10,
      "PostDate": "12/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71779/is-there-a-set-formula-on-how-you-feel-after-chemo",
      "Title": "is there a set formula on how you feel after chemo"
    }
  ]
}