{
  "AuthorID": "Gaynor1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gaynor1",
  "Posts": [
    {
      "AuthorID": "Gaynor1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gaynor1",
      "Content": "Good morning Mrs D,  I also found the Bra Tops the most comfortable straight after surgery or none at all. I also found the stringy vests that you might wear under see-through blouses comfortable you know the ones that have a self supporting shelve or support vests . I got some from Primark. Going forward it will be the scar under your arm that you might find still uncomfortable for a to ensure your while so you will need ensure your bras are soft at the sides with no wires . I found some non wired ones in Tesco that are really comfortableand in fact I still prefer them now (6 weeks post surgery) as I still am struggling to find ordinary Bras that are cut low enough under my arm. ( I was a 34 DD/E - was as also had a therapeutic mammoplasty ie reduction / uplift. So now had to go out and buy a complete new set of bras). As far as getting a bigger size I'm not sure with lumpectomy but proberly just make sure there soft and won't irritate the scar.  Hope all goes well on the 22nd  best wishes x",
      "MessageIndex": 3,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96300/bra-advice-please",
      "Title": "Bra advice please."
    },
    {
      "AuthorID": "Gaynor1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gaynor1",
      "Content": "Hi,  I was wondering if anybody had suffered from severe swollen legs/feet after their chemo had finished and how they dealt with it. I had my last chemo 3 weeks ago and didn't suffer with this  throughout although I did suffer with a bloated stomach.  Well with my consultants blessing I came on holiday to Cyprus on Tuesday night. Well yesterday my feet/ legs really swelled , I did wear day docks on the flight and kept hydrated and did leg excercises while I was sat and no issues.that night. Could it be a delayed reaction?? I've tried to rest up and elevate legs and even slot with my day socks on last night. Seem a little better today.  Im not sure what else I can do and should I be concerned!!! thanks Gaynor x",
      "MessageIndex": 0,
      "PostDate": "08/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99626/swollen-legs-feet",
      "Title": "Swollen legs/feet"
    },
    {
      "AuthorID": "Gaynor1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gaynor1",
      "Content": "Hi, hope you don't mind me joining , I have been reading all your posts but only just realised i'd not actually joined!  I'm now through my 2nd TC (of 4) a different regime to most of you but I know most of you are on the T so understand the SE well!  I think generally, I have been quite lucky with SE but did suffer after the 1st dose - mainly with severe aches/ pains , mouth thrush & sores, lack of taste and stomach & digestion issues. However luckily no temperature spikes or infections. I feel for all those that have been suffering.  For those due to start T - I have been greatly helped this time round by taking an anti-histamine ( clarityn or other self brand ie tesco with loratadine) starting the day before chemo and for the next week . This has stopped the aches / pains this time around from the T and the gcsf inj I have 24hrs after my chemo. My onco also gave me a steriod tail this time for 5 more days (reduced to 2mg per day) this has helped stage of the hit by bus feeling on day 4 and generally less fatigued. I don't know if this has also helped with the aches/pains. ( might be worth mentioning to your onco). However,  I have unfortunately lost quite a bit of hair this time round (approx 50%). I have used the cold cap and it's mostly gone from my top/crown. I have been suffering from soreness on the top and feel as if I have a ring off tension round my head! Is this normal? Or is it to do with my SE ? I feel like I've permanently got something on my head.  My shedding does seemed to have slowed now I have had this heavy loss will this continue now or should expect more loss going forward through my next two treatments?  I had my first melt down yesterday since diagnosis and I think the hair loss has really hit me hard as my hair was me. I really feeling it emotionally. I do have a wig which I really like but  it's not me though is it! Even at home I feel really vulnerable as I feel naked with my now thinned hair.  Any help & support would be appreciated . Best wishes Gaynor",
      "MessageIndex": 88,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Gaynor1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gaynor1",
      "Content": "Hi i have just had my 2nd TC session (now day8) but have unfortunately lost quite a bit of hair this time round (approx 50%). I have used the cold cap and it's mostly gone from my top/crown.  However, I have been suffering from soreness on the top and feel as if I have a ring off tension round my head! Is this normal? Or is it to do with my SE ? I feel like I've permanently got something on my head.  My shedding does seemed to have slowed now I have had this heavy loss will this continue now or should expect more loss going forward through my next two treatments?  I had my first melt down yesterday since diagnosis and I think the hair loss has really hit me hard as my hair was me. I really feeling it emotionally. I do have a wig which I really like but  it's not me though is it! Even at home I feel really vulnerable as I feel naked with my now thinned hair.  Any help & support would be appreciated .        ",
      "MessageIndex": 0,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97653/hair-loss",
      "Title": "Hair Loss"
    }
  ]
}