{
  "AuthorID": "Giblets",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/giblets",
  "Posts": [
    {
      "AuthorID": "Giblets",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/giblets",
      "Content": "Hi, I have no pearls of wisdom to offer, but just wanted to say hello. I had bilateral LD on 1st September so very early days for me yet.... I am amazed that you report no pain or discomfort, my nurses enjoyed taking the mickey out of me for saying that i would rather have triplets than go through the first 10 days of post operation again. You have my complete respect! I did ask myself everyday 'why have I done this to myself?'... and each time the answer came back that how I looked/felt before left me with no option... and like you I cannot believe how fantastic i feel - I have a cleavage!!!! never had one of those before! So to anyone reading i would say, the op. can be painful (if you are a wooss like me!) but do it, it is amazing! In fact my favourite moment was a week after the op with my surgeon standing back admiring his work, he beckons my very 'manly' (old fashioned, very proud and protective bloke type) husband to come and look... at this point i have the two of them staring at my new breasts (not something i was used to) when my surgeon pipes up with: 'just look, aren't they fantastic!!' My husbands face was an absolute picture... I could see his mind working: what to do? this main is commenting on my wifes body... it was brilliant.  He finally responded by nodding and saying that yes they were pretty amazing! at which point i had to agree..... So good luck with your physio.... I hope someone can actually help you out... hope you didnt mind my piping up... xxx",
      "MessageIndex": 1,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/20255/ld-flap-stiff-back",
      "Title": "ld flap stiff back"
    },
    {
      "AuthorID": "Giblets",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/giblets",
      "Content": "Hi Sue, I had Bi-Lateral LD on 1st September (3 weeks ago today!). I have made a couple of very short journeys (naughty I know) and find my only real problem is getting into 5th gear, in fact it was far worse at this stage after my mastectomy's (this surprised me) when i was allowed to drive. I am due to see my surgeon next week (week 4) and can see no reason why he will not give me the official nod to drive again. I have asked a qualified friend of mine what the reasoning is behind the driving ban and she explained it was about  control of the car (which i have) and my ability to do an emergency stop which i perceive i can do (not sure of the damage it may do though, but then that goes for being a passenger too....). I too work full time (am planning to be off for 6 long frustrating weeks). My only advice (hopefully not patronising) is to give your body time to recover, it is a major operation and our amazing bodies do need to rest. So I can understand your dilemna, but do look after yourself and if you need to do take the time off... I have discovered the joy of siesta's - no idea how i will crack that habit when i go back to work, but i will worry about that later.... :-) Good luck in whatever you decide! xx   ",
      "MessageIndex": 4,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/18783/ld-flap",
      "Title": "LD Flap"
    }
  ]
}