{
  "AuthorID": "Gill34",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gill34",
  "Posts": [
    {
      "AuthorID": "Gill34",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gill34",
      "Content": "Hi Alison, I may be wrong but I don't think herceptin should be an issue as is not chemotherapy but a targeted treatment. It doesn't effect the immune system. Maybe one of the more knowledgeable members can confirm here ... I'm due mastectomy and reconstruction on 10th Nov, I'll be on number 4 of 18 herceptin by then and my nurse and surgeon have said this has no impact on having surgery. Don't delay unnecessarily in having yourself feel good, good luck. Gill xx",
      "MessageIndex": 5,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115904/reconstruction-after-treatment",
      "Title": "Reconstruction after treatment"
    },
    {
      "AuthorID": "Gill34",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gill34",
      "Content": "Hi, Just finished 9 weeks of paclitaxel. Head hair started coming back for me during this and have soft fluff covering, so you might not lose what you have. Stick with the nioxin, my sister is a hairdresser and swears by it, I'm starting treatment with it this week as she wanted to wait til I'd finished chemotherapy. Be interested however to see your results if you keep using.  I did however lose eyelashes and eyebrows on paclitaxel. You will prob need injections to boost neutrophils if they go too low. I did after second week but they kept high enough with these. Can give you a bit more bone pain, but manageable. Good luck Gill xx",
      "MessageIndex": 6,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116479/neuts-pacletaxo-and-hair-loss",
      "Title": "Neuts/Pacletaxo and hair loss"
    }
  ]
}