{
  "AuthorID": "Gillsw",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
  "Posts": [
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Hi Kat Glad that's over for you and you can mark it with a big tick - another step taken down the road. Hope your recovery is uneventful, just try not to do too much too soon, and enjoy being a patient. Gentle hugs x",
      "MessageIndex": 5,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71440/had-my-mastectomy-today",
      "Title": "had my mastectomy today"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "I've just had my 1 year post-diagnosis MRI and I'm pleased to say all went well despite being very worried about it. My tumour didn't show up on either mammograms or ultrasound so I have to have an annual MRI. Last year it really hurt my arm when they injected the contrast fluid, and I was freezing cold in the machine too, so thoroughly miserable when I discovered this would be an annual treat. I read Dorothee's post saying hers was a pleasant experience, so when I got there I told them about last time and they did everything they could to help. They said the cannula could have been pressing on a nerve, so this time gave it a good fast flush after fitting it, to simulate how it would feel with the contrast and all was fine, I didn't feel a thing. They also wrapped me up in a blanket, and as I didn't have any metal fastenings in my clothes was allowed to stay dressed from the waist down so was really cosy. Now I just need good results! Gills",
      "MessageIndex": 0,
      "PostDate": "29/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70996/mri-mammogram",
      "Title": "MRI mammogram"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Hi Tracey. I know your post was a long time ago and you've probably made your decision by now, but apparently tattoos can heat up with MRIs and cause burns, so maybe something to consider. Gills",
      "MessageIndex": 8,
      "PostDate": "28/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63719/tattoo-after-bc",
      "Title": "Tattoo after BC"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Lloyds pharmacy are still selling 200ml size Bio Oil for £9.99. Great value : )",
      "MessageIndex": 4,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82528/cheap-bio-oil",
      "Title": "Cheap Bio Oil"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Hi everyone This is my first post. I realised as soon as I started reading other posts that I should be truly grateful that my problem is miniscule compared with what others are going through, and believe me, I am. However, I would appreciate help from anyone who has the knowledge and experience to give it. I had bilateral breast implants 7 years ago. The right capsule started contracting after a year or so but my surgeon said not to worry. In January this year I was diagnosed with invasive ductal carcinoma behind my right nipple. I had a lumpectomy followed by 5 weeks of radiotherapy, after which time my breast was hard like a cricket ball, and painful. My breast surgeon has now referred me to a plastic surgeon with a view to replacing the implant, but he is very reluctant to do anything because healing will probably be impaired and contracture will almost certainly recur. He has agreed to have one go at releasing the capsule, plus nipple tattooing and reconstruction if there is enough tissue, but if this doesn't work I will have to have both implants removed. Having the implants gave me so much confidence and improved my self esteem enormously. I am extremely lucky that my cancer experience was minimal, but I don't want to return to how I was 7 years ago. Without a crystal ball I know it is impossible to predict the outcome of surgery, but there must be figures and percentages to show whether I am better off staying as I am, or whether it is worth taking a risk. Does delayed healing mean an extra couple of weeks, or never? Would capsulectomy reduce the likelihood of contracture? Would I be worse off afterwards, the same as now or possibly better? Sorry to go on so long, but I hope someone can help",
      "MessageIndex": 0,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67661/breast-implants-following-radiotherapy",
      "Title": "Breast implants following radiotherapy"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Mine's still blue after a year - a sort of blue shadow of where my nipple used to be! Gills",
      "MessageIndex": 5,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71304/the-blue-dye-used-in-the-sentinel-lymph-node-bisopsy",
      "Title": "The blue dye used in the Sentinel Lymph Node Bisopsy"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Hi Rebecca Thanks for giving such a full and frank explanation. I too have a radiation-zapped implant very much like your Bruce , without a nipple, and am trying to figure out what will be the best way forward as I hate it as it is. You probably can't contemplate any more surgery at the moment after what you've been through, but have you discussed long term plans to improve it? Gills",
      "MessageIndex": 14,
      "PostDate": "29/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70913/breast-reconstruction",
      "Title": "Breast reconstruction"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Hi Alison It is recommended that if possible all dental treatment is done in advance of chemo and radiotherapy, because a) when you're backwards and forwards to the hospital frequently you don't want to be bothered with (or have the energy for) dental appointments as well, and b) both treatments are designed to kill off cells so healing capacity is reduced. This is more relevant if the radiotherapy is given to the jaws, but still best to plan dental treatment around cancer treatment if possible. Saying that, toothache usually happens at the most inconvenient time, so just has to be dealt with whenever, and antibiotics given to combat infection. There shouldn't be any problem with a scale and polish though. Gills",
      "MessageIndex": 2,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70000/dentist",
      "Title": "Dentist"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Hi Chris, Kate and Judith Just happened upon your question about hormone pessaries. I've been taking Anastrozole (Teva) for about 18 months, and suffering from insomnia, night sweats and vaginal dryness, but I'd blamed that on my age (62). Mentioned it to the nurse when I had a smear recently (last one, hurrah!) and she suggested hormone pessaries but I didn't think I should take them when I read the small print about avoiding using if you've had BC. My GP said ask the consultant at my next routine check, which I did, and she said as the dose of hormones from them is very low, and locally applied, although there was a small risk, the benefits outweighed the risk. She did add I should use them sparingly, but the doseage information says one a night for two weeks then twice a week thereafter. I've just finished the first 2 weeks and the difference is quite marked, so I'll continue using twice a week then go down to once if I can, which I hope will be OK. It's lovely not to feel like a dried up old prune! My new prescription for Anastrozole is made by Syntron, so it will be interesting to see whether the side effects are the same. Good luck with tackling the GP. Gill",
      "MessageIndex": 5,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81203/anastrozole-depression",
      "Title": "Anastrozole & Depression."
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Hey, that's great. Before you know it that will be your own hair you're showing off. Onwards and upwards xx",
      "MessageIndex": 5,
      "PostDate": "21/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70564/wig-photo-attempt",
      "Title": "Wig Photo (attempt)"
    },
    {
      "AuthorID": "Gillsw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillsw",
      "Content": "Glad it's looking positive. Relax and enjoy x",
      "MessageIndex": 3,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70485/radiology-appt",
      "Title": "Radiology appt"
    }
  ]
}