{
  "AuthorID": "GillieB",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
  "Posts": [
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Radiotherapy does make you tired, (well it did me) part of it is driving to the hospital every day, especially after chemo when you had to rest and almost got out of the habit of certainly going out each day.   I finished mine 3 almost 4 weeks ago and though not as tired am still fairly tired.  Some days I wake up full of energy and clearly do too much then I am wacked for a couple of days, can still do things but have to limit myself.   So go with it, as the others have said drink plenty of water and rest as much as you can.   Once you get to half way it goes fairly quickly, then time to recover.    The most important thing is to continue to put the cream on this really helps to avoid your breast getting too sore and possibly getting blisters.    It is really important to do this. Good luck with the rest of the treatment.   x",
      "MessageIndex": 3,
      "PostDate": "23/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74079/radio-therapy",
      "Title": "Radio therapy"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Dooby, now I am no expert here, but just a thought, as this has happened to me in the past.  When you click on 'Start new message' or  if you want to reply to a message and you click on 'reply' you will get the box on your screen with the words 'Enter new message here' .     I have to delete these words first, if not my typing goes above this message and isn't seen! So if you haven't done this, try and delete 'enter new message here' and then type.    Worth a go. You can guarantee we will all give a big cheer when your first message comes through. Enjoy the rest of the bank holiday and looking forward to this been sorted for you. hugs",
      "MessageIndex": 2,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77271/can-you-see-the-message-below-as-im-having-difficulty-posting-still",
      "Title": "Can you see the message below, as Im having difficulty posting st..."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Love the 'inner smurf' wish I had thought of that!!!   x",
      "MessageIndex": 3,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75642/need-to-ask-a-silly-question-please",
      "Title": "Need to ask a silly question please"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Well Yvonne you have made me laugh,  intelligence has nothing to do with any of this  and certainly once chemo kicks in any that we do have goes out the window for a while!",
      "MessageIndex": 5,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75642/need-to-ask-a-silly-question-please",
      "Title": "Need to ask a silly question please"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Certainly not a silly question Yvonne, one we have all thought about.  It is the dye they injected you with to find the senital node, so it is internal rather than external so bathing will not make a difference to the dye.  Unfortunately it will go in its own time, I have mind cast in blue last July, and the majority had gone in a couple of months but one tiny bit was left by my nipple and that only went about 6/8 weeks ago, towards the end of radiotherapy. G & J made a joke about the' blue tits' in the garden, at the time,  so I went from looking at the blue tits to  glancing at the robin redbreast!      This still makes me smile today  when these particularly birds come to the feeder in the garden. It will faded but in its own good time, try and embrace it and know it was there are part of your treatment plan, part one done and dusted, time to recover before stage 3, so enjoy the reasonable good weather and concentrate on getting your strength, energy and positivity back for the next stage. Well done for getting through part one, sending you lots of hugs back.   x  ",
      "MessageIndex": 2,
      "PostDate": "22/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75642/need-to-ask-a-silly-question-please",
      "Title": "Need to ask a silly question please"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "I am so glad the forum and the lovely people on here helped.  You do seem to be having a long hard road here, but the team are doing there upmost to get your treatment right for you - we have to put our trust in them to do what they are trained, research for, and practised over the years.   The treatment plan will be just for you and will get you through this. You brave thing moving house, but new house, new year new start, so I too am hoping that 2014 bring you everything that you wish for with lots of bells on. Take care stay as positive as you can and sending your lots of lovely warm wishes and hugs.",
      "MessageIndex": 1,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69247/happy-new-year",
      "Title": "Happy New Year"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Brilliant news, and you comments are all inspiring to all, my 1st year mammogram is coming up at the end of July....      Time flies when having fun doesn't it!",
      "MessageIndex": 6,
      "PostDate": "28/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78856/first-review-mammogram---it-can-be-done---success-yippeee",
      "Title": "First Review Mammogram - It Can Be Done - Success! Yippeee"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Jude I am on a different treatment plan but also had my first chemo session yesterday.  The anti-sickness drugs I am on are EMEND for 3 days then Domperidone alongside Dexamethasone tables (steroid) for 3 days.    Only the Emend side affects list constipation and as I have only one more to take tomorrow I am hoping that natural remedies will be sufficient alongside drinking plenty of water.   The other two tablets I am on do not list constipation as a problem.   My chemo treatment is FEC/Emend.  So I am different to yours.  Don't know about you but there is so much information given yesterday difficult to get my head round it all, another step on that road I guess. You take care rest up this week, I have found eating little and often helpful yesterday and today, extremely tired though and slightly light headed, though these are side affects of EMEND,   How are you feeling today? and do you think that other side affects will catch us up over the next 2/3 weeks? or do they all manifest within the first few days of receiving chemo?   Take care and hope you get an answer to your original question GillieB",
      "MessageIndex": 1,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Jude I am on a different treatment plan but also had my first chemo session yesterday.  The anti-sickness drugs I am on are EMEND for 3 days then Domperidone alongside Dexamethasone tables (steroid) for 3 days.    Only the Emend side affects list constipation and as I have only one more to take tomorrow I am hoping that natural remedies will be sufficient alongside drinking plenty of water.   The other two tablets I am on do not list constipation as a problem.   My chemo treatment is FEC/Emend.  So I am different to yours.  Don't know about you but there is so much information given yesterday difficult to get my head round it all, another step on that road I guess. You take care rest up this week, I have found eating little and often helpful yesterday and today, extremely tired though and slightly light headed, though these are side affects of EMEND,   How are you feeling today? and do you think that other side affects will catch us up over the next 2/3 weeks? or do they all manifest within the first few days of receiving chemo?   Take care and hope you get an answer to your original question GillieB  ",
      "MessageIndex": 2,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Thanks for this little jude, it is good to hear from someone who has gone through the corridors and Russell's Hall and New Cross, as it is New Cross I think I am going for my rads.  I cannot agree more, I had a brilliant surgeon, great oncologist, and the breast nurses, after the first one who just didn't suit my personality I guess, were great.  My hair is white and has been for many years, started when I was 30, so I will be interested to see what colour, if any it comes back as.    Good to hear you are back at work every on phased is this recommended as I naively thought once treatment is over and a few weeks to recover life might be back to normal.  In fact I was confused last week when we met a couple who finished her treatment for breast cancer last year and her husband was talking about her stage of recover and how he didn't want her to start a new job because of this.      So I guess I am been fairly naïve but maybe best just to take each stage as it comes along and wait and see.  Anyway that is probably all I am good for right now.   I have decided to have a DVD day today, getting bored already will go for a little walk this afternoon and then that will be about that.    So can I say enjoy work, take care and thank you for the encouraging words xxxx   gillieb  ",
      "MessageIndex": 7,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Yes of course you can add me as a friend, do I need to add you as well or just one of use doing it ill be ok.  I like you are very tired and slightly restless, I am making a applique picture, so got all that out, and now can't be bothered so going to put it away, watch the telly and have cat naps I think is the order of the day.  I am with Russell Hall Hospital,  Dudley, I live in South Staffordshire.  And have up to now have nothing but praise for them.   Think I have decided to rest up as much as possible this week, see how next week is, and then hopefully can enjoy the third week before it all starts again.   Where are you been treated?   Gillie x",
      "MessageIndex": 4,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Well done Alison for getting through your 6 rounds of chemo, bet you are really glad it is all over.  I live about 5/6 miles from Stourbridge, so good there are some local people on this site, which is great.  Hope your meeting tonight went well and you come away feeling happy with the results.   Gillie",
      "MessageIndex": 9,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "ALL FINGERS AND TOES CROSSED MARG.   xxxxx",
      "MessageIndex": 9,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75024/op-day-tomorrow",
      "Title": "op day tomorrow"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Really glad you are home and the first treatment is over for you.  Drink as much water and fluid as you can, though you will spend lots of time on the loo.  But it does help to flush your kidneys and liver and bladder so less chance of bladder infection, it may help your headaches too.  I tend to drink green tea, which I used to hate, ginger or peppermint tea helps with sickie feeling, normal tea of course.  Pineapple juice as this can help your mouth and cranberry juice, and in third week vodka or gin small amounts with ginger beer, a good combination in my view...   Glad you are feeling good, rest as much as possible this week and keep a little diary and record how you are feeling, sleeping etc. which will help you plan for the next sessions and it is interesting how much you forget once you get to second and third weeks.   Well done you x",
      "MessageIndex": 15,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67331/chemo-tomorrow",
      "Title": "Chemo tomorrow"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Not sure what to do, woke at 5.00 am shaky but not shivery.  Temperature ok, thrown food at it as it felt a bit like I do when I am hungry, 2 Weetabix, 2 toast and marmite and 3 cups of tea, one glass of cranberry later no different.   So going to rest up and see how it goes, be helpful to know if this is a normal affect and if any of you have felt this.    Thanks x",
      "MessageIndex": 0,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64588/woke-up-feeling-shaky---3-days-after-starting-fec",
      "Title": "woke up feeling shaky - 3 days after starting Fec"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "It is the unknown that scares us, but once first session is over you know the actual treatment isn't so bad and takes just over an hour, well mine does, but I do sometimes have wait 3 hours after my appointment time to get into the ward to have it done.  I have learnt to take sandwiches and some snacks with me and a drink, a book or something to do is essential.  Although they do bring tea round if you happen to be there when the trolly is passing.  But your hospital maybe very different with not so long a waiting time.  I have learnt to live with this as they do not rush you when you are having your treatment and some people are in there for far longer treatments than me and probably you, so I know they give me the time when I am there. They will give you anti-sickness tablets and take those as suggested even if you don't feel sick, having the tablets is the reason you don't.  So important.   I also have steroids for 3 days which also act as anti-sickness and keep your appetite up, so again I stock up on snacks, drinks as I find these make me very hungry and I need snacks, albeit as healthy as possible to watch weight, but I do find fig rolls can help with any signs of constipation, and drinking lots helps this too.  I haven't particularly suffered with this.  But as kipper said we are all different and get different side effects and cope in different ways.  Peppermint tea, ginger tea and green tea are fairly refreshing and do help any indigestion or queasy feelings that you may have. My worst side affect apart from been, very, very tired, so short activity then rest or snooze, your body will tell you so listen to it, is my mouth has been very sore in the second week, some ulcers, taste buds disappearing, and a burning hot dry mouth, but lots of mouth washes you can get for this, ask you chemo nurse or your GP who will make sure you have no infections.  Difflam which you can buy over the counter at a chemist is great for taking off the soreness so you can eat and drink easier, this doesn't last long and the more of a routine I have got into the less I have suffered with chemo 2,3,and 4.  Buy yourself a soft toothbrush or a children's toothbrush and tooth paste if it gets too bad, this helps a lot and I use chrosdly (probably not the right spelling)none alcoholic mouthwash also over the counter. So really the best advise is to get tomorrow out of the way, keep a daily note of your side effects so you can plan for the next session, 'cos you will forget, read the normal side effects on all the tablets they give you this helps you not to panic if something is happening that you were not expecting, and as Kipper said report all back to the chemo nurse or oncologist they are very quick to change tablets etc. if necessary.  They will look after you, trust them. One really important piece of advice I got from this forum and I have had many, is to see your first 3 chemo treatments as climbing a hill, once y0u get there the next three are all down hill you are in a good routine.  I had my fourth session yesterday so definitely on the way to the end, of course I have had moments when it all seemed far too much, but you know it is doable and does go quickly, build in some treats for week 3, lunch or coffee with friends or family, visits, nails as kipper says, get them painted black, I do the week before, you will find little things suddenly mean a lot, but still get rest in this week before your blood test. Lots of warm wishes for tomorrow and let us know when you can how it went.   Everything crossed for you.",
      "MessageIndex": 3,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67331/chemo-tomorrow",
      "Title": "Chemo tomorrow"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Think the 'selfies' are great, but mine on my f/b and went naked - well on my head!  lol.   Amazing amount of money raised.    xxx     Keep going peoples. Gillie",
      "MessageIndex": 9,
      "PostDate": "21/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73959/selfies-and-donations",
      "Title": "Selfies and donations"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Thanks this is useful, I am taking anti-sickness as not good when feel sick, my weakness I am afraid and was one of my biggest fears.  All my 6 are FEC/ Emend, and I have very short hair anyway, so soreness may not be a problem, so think this weekend will be the shoring of that.   Unlike me I am keeping a small daily record of how I am feeling so I can answer the questions when I go back for end chemo and it will give me an idea of a routine for the next few months. I have been searching for foods to boost white blood cells this morning, found some that will make them stronger but not necessary boost them but will keep looking.  Some of the information is contradictory to what Macmillan info, so would prefer to follow Macmillan as in the short time I have been with them feel confident with the feedback I am getting from the others and the general info that is on the site.   So thank you for your best wishes and here is hoping you are having more good than not so good days x    ",
      "MessageIndex": 2,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64588/woke-up-feeling-shaky---3-days-after-starting-fec",
      "Title": "woke up feeling shaky - 3 days after starting Fec"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I was definitely told on more than one occasion not to eat live yogurt, there is a post on here discussions just that because I do love Greek Yogurt, and still haven't gone back to eating it, my onc said give it 6 weeks after last chemo to make sure levels are up.  Included in the food list was: take away food unless you really trust them, pate, offal, raw eggs, all the things toy can't eat when pregnant.  I even contact Yeo Valley to ask if there Greek yoghurt was pasteurised and explained the situation, they confirmed what the Oncologist and Chemo nurses said and suggested I don't eat them until I am through Chemo.  Clearly other people have had all these things, and have had no horrid consequences, and although I had Greek Yoghurt every day and really missed it I have not yet eaten any.  Once you look at the ingredients on the pot you will see why at this particular time.  I was also told not to handle raw meat so I bought myself those very tight fitting gloves, you know the ones medical staff use and they worked very well, I managed to get through chemo without having any sickness or tummy problems as I am sure those who were not given this advice did also. So it is down to you at the end of the day.   Good luck with it all sure you will sort it all out as flute_dog says it is about common sense and tailoring it all to you.",
      "MessageIndex": 7,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71109/yogurt",
      "Title": "Yogurt"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Brilliant, excellent, wonderful, fantastic, clever now run out of adjectives......     Well done it is good to lightened the mood - gotta have a laugh - better than crying xxxxx",
      "MessageIndex": 10,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78045/i-wish-i-d-felt-both-of-me-tits---adapted-from-pam-ayers",
      "Title": "I Wish I'd Felt Both Of Me Tits - (adapted from Pam Ayers)"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Caroline yes I have finished at the end of February, saw the Onc. the week before I had finished and don't see her again until the end of May.   Then go at the end of June for mammogram etc. as it will be then 1 year since diagnosis.    It is a very strange feeling as no further medication to help keep the little blighters away when you are triple neg. so although I had read of people dealing with this in very different ways I was determined not to let it worry me and get my life back on track.   Now great sentiments but not always easy, as Judith said a few wobbly days along the way, I think for me the first two weeks were strange, felt vulnerable and a little sad, though no idea why, my hair is growing well, I have better eyelashes than I had before!  I came to the conclusion that it was the after effects of getting through all the treatment and the realisation that it was all over, as you know I have always been positive and seen the humour in everything, that escaped me a little.    But now after more than a month later that feeling is fading fast. I realised I was just sitting for most of the day, thinking well I have to rest and recuperate, and was feeling worse not better.  So I made myself go out, taking my camera as my friend, didn't matter walking alone if I could use my camera gave me a purpose,  finding going out, walking, chatting, taking photo's I love my camera, has brought a new energy.   Yes it is a little scary as we have no backup medication but we have none of those awful side effects that other women have to deal with, we feel we are on our own to make sure we keep as healthy as possible.    So my only advice would be to give yourself some time to adjust to the fact that your hospital appointments are disappearing and not so intense, we have support still from BC nurses,  oncologists, GP's and the forum so we are not alone.   Then start to build up your energy and motivation, eat well, carry on with drinking  water, sleep well, (which of course means Candy Crush time is diminishing), laugh well and  love well.    And most importantly treat yourself.      I have attached (hopefully) a pic I took a couple of weeks ago, when we were having warmer weather, just up the canal path where I live. Take lots of care Caroline and Judith, Easter holidays are a coming, think about those Choccy Eggs and know that everything possible has been done by the medication professional to stop this happening again.  Lots of warm wishes and Choccy hugs.  ",
      "MessageIndex": 2,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74812/nearly-finished---what-s-next",
      "Title": "Nearly Finished - what's next?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Ok I didn't take the picture attached on the last post, clearly, in fact I think it may have come from Asbo Mick, I couldn't download the one I wanted to, it was too large!!!   ",
      "MessageIndex": 3,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74812/nearly-finished---what-s-next",
      "Title": "Nearly Finished - what's next?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "If only.......   but we can walk fast! This is where we have to use our imaginations, in my case, a lot. x",
      "MessageIndex": 5,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74812/nearly-finished---what-s-next",
      "Title": "Nearly Finished - what's next?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Wishing you well for your return to work today,  Enjoy x",
      "MessageIndex": 3,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69232/first-day-back-at-work",
      "Title": "First day back at work"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Well first half of message disappeared!!   Was just saying (I think - chemo brain)  just cut down a bit before your first one, as you do need to be very hydrated to plumb your veins up to make getting the cannula in.  Let chemo be your friend don't let it become your foe and you become the prisoner.  It is used to kick the little pesky buggers into touch, so welcome it and see it for what it is, 4/5 months of doing very little with the pay off of many more good times to come. Think that was basically it - who know good job I haven't had a drink....",
      "MessageIndex": 5,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69168/a-dry-new-year",
      "Title": "A 'dry' New Year!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hey everyone, I finally finished my 6 sessions of FEC yesterday, YIPPEE, but it is New Years Eve and I am not drinking at the moment, as my favourite drink currently is vodka, ginger beer and a slice of lemon, and you can't taste vodka when mixed - I will be toasting in New Year in with ginger beer and a slice of lemon and a visualisation of vodka.   And probably about 11.00 pm as I guess I may just be asleep by then, who knows, Though I did have two bottle of great vodka bought me for Christmas, they will have to wait....... So for those of you still going through chemo and those of you just starting, you will get through it, I found the hardest was the 4th and I still don't know why, but once got to my 5th knew it was coming to end, So the two hardest treatments (op and chemo) out of the way and just rads. to go in Feb.  So I am sending you all lots of love and wishing you everything that you wish for yourselves and your families at this strange but new normal  time for us all.  Look forward to the end, you will get there,  and start that list, as Grieg Trout suggests in the New Year.     Be positive x",
      "MessageIndex": 0,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69168/a-dry-new-year",
      "Title": "A 'dry' New Year!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Not sure if alcohol will make a difference or not in th4e first week of chemo, I usually leave it to the third week, but only minimal, I have turned into a cheap date.   I just figure I have enough toxins in my body this week and drinking water etc. to wash out the toxins so little point in putting more in and dehydrating me in the process.  But if yu know differently Kate or anyone else, you have a couple of hours to let me know.......",
      "MessageIndex": 3,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69168/a-dry-new-year",
      "Title": "A 'dry' New Year!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hey well done both of you for getting through your first chemo. I really found this the hardest as I didn't know what to expect.  Just a little tip, though remembering we all different, and I am only on 6 FEC.  6 days after ever one  of my sessions I have had 5 out of 6, my mouth has been really sore, and have had ulcers, this has happened every time, I can manage it to an extent now, and use a variety of mouth washes, Corsodly, as a regular wash,  when it is really sore I use Oraldene mouth ulcer wash, and Difflam is a wash that takes the burning sensation away so you can have some relieve.  I was given the tip of eating pineapple on this site and I have to say it really works well.  Yu may of course not get this horrid mouth, not every one does, but it has been my biggest side effect all the way through.  It doesn't last for longer than a few days, although the ulcers seem to stay longer, just the one little blighter that won't disappear until 2 days before my next round then it all starts again.  A soft toothbrush is also handy if this happens.  Lets hope it doesn't. I also found keeping a daily record of symptoms helped me plan for the next round, with food to get in, those moments when you are on steroids and want to eat the furniture, helpful to have snacks around!  Sure someone has also told you about painting your toe and finger nails with black nail varnish, helps maintain your nails throughout.  So lots of good wishes, lots of hugs and keep on truckin!    First one over always the worst.  ",
      "MessageIndex": 17,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68377/2-days-into-chemo",
      "Title": "2 days into chemo........."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "I too had a great afternoon, given we had snow in the morning and it was doubtful if we could go. Very glad we did, even if our OH's were not that appreciative of our beauty!!!    I can only urge people to sign up as soon as, as the wait can be long, but we had fun, meet some lovely women, and the therapist who give their time for free were great and very complimentary. Thank you Alison, for the good wishes, had a positive morning even if I was having another session of Radiotherapy.   I got there very early as think most people had decided to work at home, so traffic was very light given it was rush hour.... they put me through as soon as I got there to see the lymphedema (spelling sorry) guy and then straight into treatment - was out by 9.30 which was my original appointment time, they said they got me through as it was my birthday, how cool is that......  Anyway I am now rambling, so all of you out there who haven't gone on one of these sessions, sort it this week it is well worth it.",
      "MessageIndex": 1,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71850/look-good-feeling-better",
      "Title": "Look Good Feeling Better"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "I am certainly going to try, probably have to start this afternoon!!!",
      "MessageIndex": 3,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71850/look-good-feeling-better",
      "Title": "Look Good Feeling Better"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Jenny this is where Bongo and I went, the one she has talked about on this post.  You will enjoy it I am sure, and you get to keep all the goodies that you play with.  We had to wait 2/3 months for a session too, they are very popular but can only take 7 - 12 people at a time. Enjoy.",
      "MessageIndex": 18,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71850/look-good-feeling-better",
      "Title": "Look Good Feeling Better"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "problem yesterday, but looking at my other hand that they can't use the veins were really plumbed up, so all the intrusion has just broken the veins down a bit.  All repairable I guess.  All the setting on this has gone wonky sorry.     Just try and reduce and get your body as fit as possible before you start and be as positive as you can, sure this really helps.  Good luck, the worse is the operation in my view, so that is over, remember to keep a little diary of your first treatment as it helps plan for the rest of the chemo with shopping etc. as you will know what to expect your body to be like.  Take the tablet they give you before you feel you need them and make sure the steroid for the first few days the last one is taken before 4.00 pm helps you sleep better, but usually the first week I am up at silly o'clock but learnt to accept that and watched catch up tv on my laptop, and didn't worry about it, as I have the luxury of been able to sleep in the day when necessary, you will be back in a routine half way through second and certainly by third week.   What chemo drugs are you on?  I just had FEC for six weeks. Plenty of people on here to support you but feel free if you want to 'friend' me to ask more questions ,not a problem.  Take care and enjoy tonight.  x   Have a drink for me x",
      "MessageIndex": 4,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69168/a-dry-new-year",
      "Title": "A 'dry' New Year!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Marg all the advice is good, make sure you do get Emend though they are the best and really helped me through the sickness.    They give them to everyone, it was only when I said I lived on a boat that the Onc changed the prescription to give me Emend - all I can say is thank goodness for my lifestyle..... Hange on and think about your Granddaughter they are so important in all of this, my youngest Granddaughter (4)  everytime she saw me with no hair she would stroke my head and give me a big hug to help my hair grow back, now of course she thinks it is all her doing.... Stay strong big hugs xxxxx",
      "MessageIndex": 7,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78134/fec",
      "Title": "fec"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Whilst on 6 X Fec which finished at the end of December, my worst side effect was the ulcerated burning mouth and dry mouth, I have tried various potions but nothing really works for long, however I am now left with a very dry mouth as you all describe above, I am not on Herceptin I have been assuming it is left over from chemo but it is 7/8 weeks now since last one, soreness is hovering but antiseptic mouth wash seems to keep this at bay.     I asked about radiotherapy making this worse and was told by radiotherapist and oncologist that this is not the case, as I am seeing onc. on Monday I will certainly be bringing this up again, (as it is such a pain) I had to go to GP yesterday, forgot my bottle of water - big mistake and found my mouth was so dry I couldn't talk properly!!  He did fetch me a glass of water though which oiled the way for a while. Will let you know what Onc. says. Will be trying the Vaseline in the nose tip though this I am sure will help, thanks for this. x",
      "MessageIndex": 10,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72324/dry-mouth-after-ac-chemo",
      "Title": "Dry mouth after AC chemo."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Thanks Dawn, you are right about giving up coffee you will still be getting withdrawals from that, I will put my head into gear re: the ritual of rolling!  Though I really don't think pastry will cut it!!!  x  ",
      "MessageIndex": 7,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65089/stopping-smoking",
      "Title": "stopping smoking!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Thank you for this.  ",
      "MessageIndex": 1,
      "PostDate": "05/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65543/more-positive-thoughts-this-morning",
      "Title": "More Positive Thoughts This Morning !"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Thanks for this, I do have a stash of electronic ciggies but thinking about the chemicals in them are so unknown thought would try and go it alone..... I know why I slipped (well think so) feel normal this week, not my new normal but normal so as you say brain tells me it is ok, chemo again next Monday so will stop again.....  ha ha determined to crack it, so going to get a glass jar and put the money in so I can see it mounting up, a good motivator I think..  Oh I was a roll my own girl too, missing the actual act of rolling as well....",
      "MessageIndex": 3,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65089/stopping-smoking",
      "Title": "stopping smoking!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "I'm a smoker the day of my first chemo session I walked out and refused my first cigarette, and that was ok for the last two weeks until yesterday, when I had three, now I know enough about addiction to recognise this as a lapse and accept this in the greater scheme of things.  But I could do with some support, I cannot be the only one within this community who is going through this, or maybe I am!!!",
      "MessageIndex": 0,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65089/stopping-smoking",
      "Title": "stopping smoking!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi not much to add to what others have said, I too got a very sore mouth, and used Difflam and you can buy it or get it on prescription if you ask the chemo nurses or your GP and there is one for sore mouth as well as the one for the throat.  I carry the spray version with me so I can use it when out.  I also bought a very soft toothbrush and toddler toothpaste, as my normal toothpaste hurt.   Change your toothbrush regularly as well, women on here changed theirs for each chemo session, I didn't think of that but wish I had sure it would have helped.   Be careful what you eat no harsh foods which can scratch the inside of your mouth which can then turn into ulcers.  The chemo nurse also gave me a prescription for a mouth wash and for a gel which I could use which coated your mouth and protected it, the only problem with that is you cannot eat or drink for 2 hours after using it, which I found very difficult to do, however, both all of these helped loads.  Stay positive know that chemo even with all the horrid side effects is your friend as it is working for you to get rid of all those pesky cells that have brought us all together. One down which is good news.",
      "MessageIndex": 6,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71735/first-chemo",
      "Title": "First Chemo"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "paint my nails with black nail varnish to ease the affects of Chemo on my nails (is what I have been told) has anyone tried this? heard about it? or will any colour of varnish work as well.  G x",
      "MessageIndex": 0,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64862/before-i",
      "Title": "Before I ........"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "You know what I can be into black nail varnish - yesterday I had my hair clipped to a No1 cut in preparation for the big fall out, as my hair is pure white it looks in the right light like a white skull cap, and I have to say I love it, as do my family.  So why not black nail varnish to go with my new image.  I seem to be older than most on this community (64) but if I tell you my role models are the 'Fabulous Fashionistas' you will see why black nail varnish is the way to go.    So thanks for the tips really useful and I will set about getting it painted on.    hugs GillieB  x  ",
      "MessageIndex": 3,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64862/before-i",
      "Title": "Before I ........"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Well setting a trend eh! If I have learnt anything since last May it is that 'anything is possible' so why not, maybe it could be a good fund raising idea.   The   'Fabulous Maccynistas' afternoon tea - dressing up is great.   Remembering that 'Grandma's are Antique little girls' after all.   Thank you for the nail information I have forwarded this onto the Jess who is going to do my nails.   Keep warm and healthy    Gillie   'Sometimes you just gotta put them boots on,  and dance anyway'.",
      "MessageIndex": 8,
      "PostDate": "20/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64862/before-i",
      "Title": "Before I ........"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hello scribblinglady, what a great name,   Just wanted to pop along and say hello and I am sure someone will be popping along soon enough that can help you.  In the meantime take great care and make sure you get lots of rest.   xxxxxx",
      "MessageIndex": 1,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90962/understanding-discharge-summary",
      "Title": "understanding discharge summary"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hello Maria not a good day, but you have found a place where you will get all the support you need and advice from those of us that have gone before you and are travelling or travelled this roller coaster of a ride. The waiting now is the hardest not knowing what your treatment plan will be, you will need to put all your trust in your medical team to do the right thing for you and they will, it is all individually planned, for the best possible outcome for you. For a lot of women one of the hardest thing is asking for help and support from family and friends, however hard this is,  it is one of the best things to do, they too will be frightened and scared for you, and will want to help and support you but not necessary know what to do.  I too was grade 3 and had a lumpectomy last July which was followed by chemo and then radiotherapy, all this finished this last February, so here to tell you it is doable as all the women and men on here will tell you, you will find the strength and resolve to overcome this. You have already had great advice from others but be reassured that we are all here for you whatever the time of day, and no question is ever a silly question, because one of us would have asked that same question before. Sending you very positive thoughts        Gillie   xxxxxx",
      "MessageIndex": 5,
      "PostDate": "28/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77394/first-day",
      "Title": "first day"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Excellent news Clare time to celebrate tonight me thinks.......   lots of hugs x",
      "MessageIndex": 1,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78711/appt-today",
      "Title": "appt today"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "I can only agree with other comments, I had had a clear mammogram in March of last year, by May found lump and had a second mammogram to check it out...  the doctor I saw straight after to do the scan, said, you know what this is don't you?   the rest as they say is history, so they tell you in some way or other, again I was by myself as thought it was just a follow up mammogram - instead there for about 4/5 hours having all the usual  tests and 6 weeks down the line having surgery, after two weeks in Corfu I have to say.  At least this way when the results do come in you are prepared and ready to do battle. Big hugs",
      "MessageIndex": 11,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69806/do-docs-play-down-cancer-until-they-get-biopsy-results-or-can-they-tell-just-from-the-scans",
      "Title": "Do docs play down cancer until they get biopsy results or can they..."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "smiling because I have had a day out with OH to Victoria Christmas Fayre - and got two great items from a charity shop - cool.  ",
      "MessageIndex": 26,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85836/yay",
      "Title": "YAY!!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi 'keepingstrong' I too have had a sore nipple and shooting pains whilst on rads.  I am 16 down 4 to go. Radiotherapist told me it is because this treatment will mix the breast all up again, so though it was settling down after op. this will wake up the nerves again and can cause shooting pains.  This made sense to me, and in fact the numbness that was left in the top of should blade and back is starting to fade fairly quickly so seems as though she was right.  Because I am fairly small breasted I have left my bra off during this time, and wear those tight little vest like tops, easier to get dressed and undressed when there as well, so can't comment on wearing one too tight, though was told by them not to wear unwired bras for a while, so yet again my little lifesaver (uplift and separates) is off the agenda for a while...... Good job it is winter I can hide under jumpers. breathlessness at times, and very achy joints and an overwhelming feeling of tiredness and lack of energy, seems almost worse than chemo tiredness, as least that would slowly get better over the 2 weeks before the next treatment.  I really think this is due to the fact that treatment is everyday and I for one find this extremely boring and the unable to plan, as I never know the appointment time until the day before...  really frustrating, however for me it is the final treatment as I an triple negative, so no injections or tablets.   It was recommended to me to try and have a PJ day each weekend whilst on rads. I have managed that and it really does help with the slog of it all.  I am lucky no children living at home so easy to achieve. As KateG says don't be fobbed off ring your breast care nurse or ask to see oncologist and talk about breathlessness and pains to get the answers you deserve. Take lots of care you are getting through the sessions on the down hill slide now.   x",
      "MessageIndex": 2,
      "PostDate": "22/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72336/pain-with-radiotherapy",
      "Title": "Pain with Radiotherapy"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Congratulations Bongo for reaching the end of your 3 big procedures, as Dorethee says time for bubbly and celebrations.  Wear those T shirts with pride, you have done it with strength, determination and positivity.  Not only that you have supported others and given great advice on here, you know I have been hanging on your coat tails on this journey and I have had a great role model which only supports me through.  Celebrate and then celebrate some more.  Big, big hugs",
      "MessageIndex": 14,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "And you know Yasminjack56 you will feel better. These days of feeling rubbish will slowly disappear, just take your time and don't expect too much too soon.  I had my last FEC on the 30th December and I am really starting to feel more like me and starting to get out of the fog I found myself in with chemo.  I have just started Radiotherapy and I know it is early days and things are probably going to change but can only echo what everyone on her says compared to chemo it is a walk in the park. I too am triple neg. grad 3   there are several women on here that are triple negative so posting here will offer you great support on the rest of your journey. If you want to 'friend' me feel free.  Take your time and sending you lots of hugs.  x",
      "MessageIndex": 2,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71297/breast-cancer-triple-neg-grad-3",
      "Title": "Breast cancer triple neg grad 3"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "You know Canton I have read your posts before and you are always full of good advice and wisdom so you know you should ring the doctor or chemo care nurses, your temperature can be normal and you could still have an infection.   So make the phone calls tomorrow, it will no doubt all be ok but at least you will know x   find the chocolate and get off to bed and rest   x    ",
      "MessageIndex": 2,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65486/taxotere-side-effects-infection-question",
      "Title": "taxotere side effects: infection question"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Well done dorothy1 for completing 4 cycles of FEC not easy, I can completely understand how yu are feeling, I finished my FEC 6 in December and am feeling so much better now 6 months later, it does help that it is the summer and the sun is out.  I too felt tired all the time, and found walking too far difficult as I was so dizzy and out of breathe but it does pass, I found walking around indoors helped rather than just sitting.   As I live on a boat (a very small space) this didn't give me much walking space but did build up the confidence to go for smaller walks, I am now back with my walking group and keeping up with them.  You are only in the first week after your last chemo so give yourself another week at least and I really think you will start to feel better, age is not an issue here, I turned 65 whilst having rads. not the best birthday and not one I could celebrate as I had planned, but hey ho plenty more to come. Chemo is the hardest part of this journey and does make us feel rotten but you do know at the end of it all you will gradually get your strength back. Keep strong Dorothy you have got this far you can go the extra mile, it is miserable and boring feeling like you do, but the end is in sight. How many Doxatel are you having?   I guess 12 months of Herceptin. Go sit in the garden if you have the sun but make sure you use sun block and shade.  It won't last for ever. Sending you lots of hugs   xxxxxx",
      "MessageIndex": 1,
      "PostDate": "12/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78085/chemo-after-affects",
      "Title": "Chemo after affects"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Can only agree with the others replies, it is the pits the sore painful head.  I too bought a sleep cap which really helped with the pain, I also got a pair of quilted pillow liners for under the pillow case, this helped too.  Tell your sister it is temporary but it does hurt, maybe you could offer to gently massage her scalp. Sending you both lots of warm fuzzy hugs",
      "MessageIndex": 6,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77971/hair-loss---sore-scalp",
      "Title": "Hair loss - sore scalp"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Firstly Jenny you are not an idiot, this is a normal reaction that a lot of us, if not all of get at some point.  It is a hard journey we are on, and when we are active people  and used to been in control it is really hard to rest and allow out bodies to recover.  'Fraid the weather isn't helping at the moment either. When I was on chemo, I found I couldn't concentrate to do much at all, I still cooked each night, and did some tidying up but not a lot really, I watch a lot of telly, which does become boring, read and played candy crush, this thankfully is getting less now I have finished chemo.    It is boring, frustrating, annoying but there were times when I was too tired to feel any of these  things..    Your suggestion of writing down what you do  is a brilliant idea, it will show you what you are achieving, this will help I am sure.   I too was grumpy for a few days each cycle, a friend of mine knitted me a wild looking doll, which is my 'gumpy granny'  and if it was next to me at the sofa when my other OH came home from work he knew to tread carefully........   This all passes Jenny, for me it was about seeing chemo as my friend, it was making me better, the cancer wasn't making me ill the treatment was and this would pass, as it has. Be kind to yourself rest as much as you can this is all part of the treatment and is necessary. Take lots of care x",
      "MessageIndex": 3,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71965/so-angry",
      "Title": "So angry"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Daisyteabag - love your name. I am exactly the same, and frankly have stopped looking at the sites.   I finished treatment in February of this year, and felt very vulnerable for a couple of months, but have decided to get on with it, look to the future and be positive  -  as the experts don't know what feeds it, and can't offer any further treatment once operation, chemo and rads are over it does feel as you say in a' cage of hungry lions with a feather duster'   I am keeping a positive spin on it, eating well and doing what I can to be as healthy as I can.  The research for triple negative is limited compared to other forms of bc, but from what I understand their is trials starting and further research. I also post in the triple negative bc site on this forum and there are some very positive posts on there which is great.  Go for my yearly mammogram at the end of this month so looking to that to give me good news, of course which I really think will help.   You know we have got through this found our strength to fight it, that has to be good, and now we need to be as positive as we can be, as healthy as we can be, and get on with our lives.    xxxxxxxxx Gillie",
      "MessageIndex": 1,
      "PostDate": "01/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79019/triple-negative",
      "Title": "Triple negative"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Sandra, yes I am turning the scary feelings into positives again, but it does take time, remember it is four months since my Rads. finished, but energy is coming back and my head is in a good place too.   So don't be too hard on yourself it will take time.   No I don't take any supplements at all, have to say have never thought about it, maybe I should..... You are right you do think differently after diagnosis, I try not to be around negative people for instance.  I am lucky I left my job 2 maybe 2 half years ago and work for myself.  Had  very limited work over the last year but kept some which helped me focus on something other than treatment, but I could do it all from home, and could down tools for the 10 days after chemo, so as I said very luck.  My husband has decided to take early retirement at the end of September, and will be again doing some work for himself so I am hoping that between us we can have some more relaxation and fun days. So in a different situation regarding work than you, my only advice would be do not rush back you will wake up one morning and feel ready, but give yourself time and make sure you get a phased return.  I have got to the point now where I would take on more work, but have to say not looking very hard for it....   Time for you now, relax, give yourself time to breathe and get your confidence back, as Dorethee said learn to trust your body again. I travelled to Oxford Monday to meet two friend who I also work with, and explained what triple negative meant and one of them said well hope do you cope with knowing about reoccurrence,  as always most people assume treatment over all clear, and you know I didn't know what to say, because I guess I hadn't really thought about it!    Keeping positive and positive people around you and healthy has got to be the road to travel. Thanks for the good wishes, and enjoy the sun shine while you get your mojo back.    xxxxxx",
      "MessageIndex": 6,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79019/triple-negative",
      "Title": "Triple negative"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Judi moody I am a few months in front of you but had the same treatment as you and finished in February.  I am still in soft bra's as I cannot tolerate the underwire bra's yet.  In fact I have only been wearing bra's for the last 3 weeks up until then I was wearing little vest type tops.  I still have a slight swelling by my operation scar, so it could be your bra's BUT get it checked out, always best to know. Take care  x",
      "MessageIndex": 1,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76103/swelling",
      "Title": "Swelling."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Really good news on lots of fronts, thank you for posting, and yes radiotherapy will be easier as all those that have gone through tell us, I am only half way through chemo and have rads. to come, but will certainly have it done.   Keep strong",
      "MessageIndex": 2,
      "PostDate": "16/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67197/some-good-news",
      "Title": "Some good news!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "I got hooked on Jamaican ginger beer great in my gin, which I had on my third week. Also toddlers toothpaste when my mouth got really sore and I couldn't stand regular toothpaste.  Mouth wash Corsodyl none alcohol.   But maybe wait and see for this as your mouth may survive better than mine did.   Notebook to keep track of symptoms and food you can tolerate, as it helps planning and shopping for the following cycle. Good luck and keep positive. ",
      "MessageIndex": 7,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80859/shopping-list-for-chemo---am-i-missing-anything",
      "Title": "Shopping list for chemo - am I missing anything?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "HI M65  I had 6 FEC and this side effect is new to me, I really do think you should ring you Bc nurse, a nurse on this site or ask for another appointment with your oncologist.  But suggest you ring a nurse today, just so you know if this is an expected side effect for some.  Just because I didn't have this doesn't mean others haven't.    The only thing I can suggest is to try and change your diet and eat things that will eventually ease this problem, and drink loads and loads of fluids this will help too.  Talk to someone today this will ease your anxiety which won't help - sure all is fine but it does need sorting, it must be horrid to be suffering like this, on top of chemo.  Let us know how you get one.",
      "MessageIndex": 1,
      "PostDate": "22/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70574/fec---sorry-question-about-piles-and-black-stools",
      "Title": "FEC - sorry...question about piles and black stools!!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Yes I had the same, good news though I didn't lose them!   I made sure I put on a nail oil on everyday and dripped some between finger and nail.  Full of ridges which is normal, and brown at all edges, very sexy!    I didn't use polish for a fair time after treatment finished as I felt getting air to them was best.  Use washing up gloves when you do any cleaning and try and keep them as strong as possible.  They will recover slowly and the tingling and pinching will subside, keep massaging them I also used Udderly Cream which is great.    Well done for getting through Chemo Katee, another treatment ticked off. hugs x",
      "MessageIndex": 2,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88517/weird-nails",
      "Title": "Weird nails"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Whoops meant to say a thermometer, so you can take your temp. especially in the second week, when your are more prone to picking up infections. DVD's, books and magazines. xxxx",
      "MessageIndex": 8,
      "PostDate": "07/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80859/shopping-list-for-chemo---am-i-missing-anything",
      "Title": "Shopping list for chemo - am I missing anything?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I used a nail oil on mine and keep off the nail varnish now chemo is over (6xFEC) this does help my toe nails are strong but the oil seems to help.  Also keeps my finger nails stronger.  Might be worth a go. Suggest a visit to GP he may refer you to a chiropodist though as Kay says they only usually do this for medical reasons, but worth a visit to see if you can get a referral because of chemo.  It is a real pain but remember you can always paint them for the summer sandals but hopefully will all be sorted by the time the weather is good enough to break them out.....",
      "MessageIndex": 3,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74862/brittle-nails",
      "Title": "Brittle nails"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Chrissy can I suggest you look at Weight Watchers, I was on this before the Cancer, and lost 3 stone, and glad I did as I may not have felt my breast lump if I hadn't.  There portions are reasonable and it is all pointed so you can choose what to eat.    You know I do not consider your issue is small, it is your issue and it is important to you so can becomes an overriding problem and you are right it becomes an emotional problem as well as physical.  One thing I learnt on weight watchers those women and men who said 'well I don't eat much and I can't keep to the daily points needed' didn't loose as much weight as those who ate more.  Certainly I ate more in a day than I was used to and lost 3 stone in 11 months, so good and steady  - have to say that I put on 8 lbs. once I was diagnosed  my reaction was chocolate and lots of alcohol.  On its way now, the weight I mean.     We were told and it makes absolute sense that if you are not getting enough fuel in your body in a day your body will think it is starving and hang on to any fats to store food in case your input drops even more, so the more fuel in a controlled way gest burnt up as your body gets into a habit and know it won't starve.   Hope this makes sense... Worth thinking about maybe   Best of everything",
      "MessageIndex": 3,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65335/arimadex",
      "Title": "Arimadex"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "great news, enjoy and then enjoy some more.  x",
      "MessageIndex": 9,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69530/fantastic-news-and-thank-you",
      "Title": "Fantastic News and thank you"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "can I suggest Alaval that you read 'chemo works - don't give up' post currently on page one in this group.  I don't know the risk of you refusing chemo, I didn't feel refusal was an option to me, but I am grade 3.  I have only had one session of FEC and like Bongo tiredness, and the feeling that I was going down with flu was the worst but by the end of the first week was feeling stronger and sleeping less.  The second week I had an extremely sore mouth with ulcers which are just going now, so in hindsight this has been the worst side effect.    So not an easy decision for you can you put it off until you get the stats for recurrence?  My oncologist was able to access a computer programme and work out my stats for recurrence etc.  which I found really helpful, though I think my husband would have preferred not to know!!!  Maybe worth asking for this too. Good luck with this, whatever decision you come to it will be the best for you. wishing you the best of everything",
      "MessageIndex": 2,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65059/to-chemo-or-not",
      "Title": "To chemo or not"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I used a nail oil on mine and keep off the nail varnish now chemo is over (6xFEC) this does help my toe nails are strong but the oil seems to help.  Also keeps my finger nails stronger.  Might be worth a go. Suggest a visit to GP he may refer you to a chiropodist though as Kay says they only usually do this for medical reasons, but worth a visit to see if you can get a referral because of chemo.  It is a real pain but remember you can always paint them for the summer sandals but hopefully will all be sorted by the time the weather is good enough to break them out.....",
      "MessageIndex": 19,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74862/brittle-nails",
      "Title": "Brittle nails"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I used a nail oil on mine and keep off the nail varnish now chemo is over (6xFEC) this does help my toe nails are strong but the oil seems to help.  Also keeps my finger nails stronger.  Might be worth a go. Suggest a visit to GP he may refer you to a chiropodist though as Kay says they only usually do this for medical reasons, but worth a visit to see if you can get a referral because of chemo.  It is a real pain but remember you can always paint them for the summer sandals but hopefully will all be sorted by the time the weather is good enough to break them out.....",
      "MessageIndex": 4,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74862/brittle-nails",
      "Title": "Brittle nails"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I used a nail oil on mine and keep off the nail varnish now chemo is over (6xFEC) this does help my toe nails are strong but the oil seems to help.  Also keeps my finger nails stronger.  Might be worth a go. Suggest a visit to GP he may refer you to a chiropodist though as Kay says they only usually do this for medical reasons, but worth a visit to see if you can get a referral because of chemo.  It is a real pain but remember you can always paint them for the summer sandals but hopefully will all be sorted by the time the weather is good enough to break them out.....",
      "MessageIndex": 18,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74862/brittle-nails",
      "Title": "Brittle nails"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Marg how horrid for you with your hands and feet another one of those things that get tagged along with the chemo. I have use Udder Cream it is very good, got mine from Amazon, not that available in chemists.   However, whilst supermarkets are still open if somebody can pop out for you try the aqueous cream, it is fragrant and lanolin free, and what they recommend for Rads. so you will need to get some anyway.  It is about 4.99 for a large tub, you can also use it for washing instead of soap.   I would have thought this would be ok for now, and may give you some relief.   Maybe best to ask pharmacist where you purchase it from to be sure.    Good luck    and hope the hospital can add more tomorrow.  sending you hugs x",
      "MessageIndex": 2,
      "PostDate": "16/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73643/sore-hands-and-feet",
      "Title": "sore hands and feet"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "You may need something stronger that can be prescribed for you tomorrow, but hopefully it will give you some relief tonight, certainly has kept my radiation soreness at bay even the extra five booster treatments which were as red as a beetroot! What a great daughter you have.   xx",
      "MessageIndex": 4,
      "PostDate": "16/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73643/sore-hands-and-feet",
      "Title": "sore hands and feet"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Thanks Marg really glad it helped and that the nurse  didn't think you needed anything stronger, and that you had a better night.    Do you know why this has happened? hugs for a complete recovery and congratulations on getting to the end of chemo, well done.  x",
      "MessageIndex": 7,
      "PostDate": "17/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73643/sore-hands-and-feet",
      "Title": "sore hands and feet"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "As secondtime says it is not in your head, it is very tiring, if you are having it following chemo, it is probably only 3 weeks since that finished, and with chemo you are forced to rest and get into a habit of having one week when you do very little but rest, one week when you are feeling a bit more energetic and then a good week, suddenly you are expected to get up, dressed and ready to travel to hospital and have treatment and then travel home again, it is no wonder we find it tiring!  We all say after chemo it is a walk in the park but that doesn't mean it is not tiring and can be sore, keep putting the cream on at least twice a day if not 3 times, wear a little vest top rather than a bra and go naked as much as possible as it gets air to the site.  I was always told to drink as much water as possible. You will get into a routine but resting as much as you can will help. Take care of you, will all be over soon and you will wonder how you managed to do it all. Keep smiling",
      "MessageIndex": 2,
      "PostDate": "04/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77721/radiotherapy-only-day-3",
      "Title": "Radiotherapy only day 3"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hey, I too like to be prepared and organised as it helps me with any new experience.  I have to say at this point Tweedledee that I have only had one round of FEC chemo.  This is what I did.  I have the treatment on a Monday, so the weekend before I went to Lincoln to visit my son and family as my Grandson was 6 and a party was planned.  I ate and drank as normal, had a great Chinese takeaway which I was glad for as now can't have them, so I saw it as an indulgent and relaxing weekend to set me up.   I was terrified of been sick, so I bought a small pedal bin so I could use the inside bucket if necessary and as it has a lid it would be covered.... does this make sense.  I also bought nappy bags and had these under my pillow, by the settee, in my bag, in the car for the journey home, anywhere I thought I might need them.   Over the top probably but made me feel secure.  I bought ginger biscuits, ginger tea, ginger ale, and peppermint and green tea, Dettol,  alongside snacks, so I could eat little and often.  Bottle of water as they recommend you keep hydrated. Here is what happened.  Once home I slept for 3 hours, ate my dinner, slept  woke about 4.00 am ate Weetabix, slept, woke about 7.00 am ate toast.  This was the pattern for the next few days.  By the following weekend I feeling almost normal again.    I wasn't sick, very dry mouthed, light headed, wobbly for a few days, so get a stash of DVD's to watch, it is really important to take the anti-sickness tablets as instructed, I never felt sick with these, but a couple of times I was late taking them and started to have a queasy feeling which was taken off once had the tablets.  So peddle bin is still in the car, nappy bags keep turning up in places I have forgotten I had put them! What surprised me was the need to eat, think it may have been the steroids, I would eat then be looking for the next think I could consume.  I only had these tablets for 3 days so it doesn't last but glad I had plenty of fruit, and other snack to keep the hunger or greed (not sure which)  at bay.  Having grown up as a bad traveller suffering with travel sickness I have learnt to keep eating in these situation works for me.  I am now on week 3 so last night was the first night I have slept through without waking, I have seen this waking in the night as a positive I just get up and read or do something rather than lie there pondering....   I am lucky though I work for myself so can adjust what I do and how I do it so have the flexibility, which you may not have.  The tablets that can cause constipation I only had to take for 3 days, so I made sure I drank plenty of water, ate fruit and ate well which actually worked for me, though drinking plenty of water did mean I woke in the night.  A small price to pay though I think. The second week I got an extremely sore mouth, burning, dry and ulcers.  This is starting to ease now, I can recommend  Corsoldyl and Difflam mouth washes and Difflam spray.  Corsoldyl help prevent this happening and Difflam eases it once it has happened.  I carry the spray with me as when out these last few days I needed to use it and it was easier that using a mouth wash.  I won't bore you with the story of me in a church yard trying to use mouth wash so I could go and eat some lunch!!!  So a spray is helpful x    I also bought milk teeth toothpaste and a soft toothbrush, as normal stung too much. During this week I also had a visit to the hairdresser and had my hair clipped to a No 1 cut, and will be having my nail painted black this week too.  Because losing hair and nails was also a major fear for me, so feel I have done everything I can now on that score. I am just starting my third week before my next chemo and looking forward to a good solid week, get the shopping and meal planning for the week of chemo, prepare physically and emotionally for the sleeping and DVD week, not bad really how many times I have  dreamed of having the luxury of watching DVD's, telly and sleeping.  So if you manage to get to this stage of your reading Dee of my ramblings I hope a small bit of it helps you in your planning.    And remember the end result is so positive that we have to do whatever is necessary to embrace our 'new normal'. Stay positive and happy   Gillie xxx Sometimes you just gotta put on them shoes and dance!    ",
      "MessageIndex": 6,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64971/fasting-and-chemo",
      "Title": "Fasting and chemo"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Can only agree Dee really interesting study, though it must be hard to stick to, particularly if you are limited on your protein intake.  Would love to know more too. Cheers     ",
      "MessageIndex": 10,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64971/fasting-and-chemo",
      "Title": "Fasting and chemo"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "me again - I have been reading a book that was recommended on this site, finding it helpful and very interesting it is: 'Mind over Medicine' Anti Cancer - a new way of Life by David Servan-Schreiber Other reading matter that was recommended were:  www.millionwomen.org. showing link between HRT and Cancer   and   Cancer Care - Penny Brohn Best    ",
      "MessageIndex": 11,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64971/fasting-and-chemo",
      "Title": "Fasting and chemo"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Emmababes it is a choice, and the good thing is that it is summer and we are not surrounded by horrid winter bugs....     My OH had to go into hospital for an operation during one of my second weeks, and I was told by his  consultant and my OH  not to go in with him on the day.  But you know, I made the decision to go in with him, so you need to weight up the advantages, and disadvantages and make your own decision.    Gillie   xx",
      "MessageIndex": 6,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80284/risk-of-infection--chemo",
      "Title": "risk of infection- chemo"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi do hope your chemo is going well.   Sure you know the second week is the most vulnerable for you for catching infection, so as along as your friends Grandchild does not have an infection and then comes to see you all should be well, as others have said you and your visitors washing your hands is an absolute must,  I was also told to have my own hand towel. My BC nurse gave me a whole lots of instructions to follow and must admit apart from a dodgy pasty causing a stomach upset I was fine.   Here are some of them:  wear those skin tight gloves when preparing raw meat, fish etc. easily got from chemist or supermarkets.    Keep away from takeaways, unless you really, really trust them, pate, cream yoghurts, eggs unless well cooked, offal, and wash salads, fruit and veg.   Drink plenty of water and keep away from shop bought water in plastic bottles.  Sorry if you have already been told all of this!!!! I do know people who haven't been told any of this, and been fine, so it is a very much personal choice I guess.   Keep away from 'buggy' people and large crowds, during your vulnerable time, so seems to be if your friends Grandchild is well and healthy there is no problem, see her, enjoy it is always good to see a good friend.    Just be careful, better safe than sorry generally, but don't make yourself a prisoner, chemo is hard enough. Take care big cyber hugs      Gillie   x",
      "MessageIndex": 4,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80284/risk-of-infection--chemo",
      "Title": "risk of infection- chemo"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I too was told no plastic bottled still water, there is a chemical in the plastic bottle, that if exposed to the sun for too long can cause all sorts of problems, so now I use tap water only.  I bought a bottle which is BPA free from the supermarket which I carry around with me, as I still get a very dry mouth, and the starting of ulcers if my mouth gets too dry.  I finished chemo at the end of December. Hope this helps, xxxxx",
      "MessageIndex": 10,
      "PostDate": "28/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80284/risk-of-infection--chemo",
      "Title": "risk of infection- chemo"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "A very good question as I am just about to loose mine.  So be helpful to know how long this will be for.  So sorry JayRand that I can't answer your question, and just popped in to say hello and please do not  get too scared, visualise it growing back, it has started, it will continue be positive and see yourself in a couple of months with hair that you will be proud to show off, even if very short.  Keep on truckin', the main part of the treatment is over which is great news x  would love to know how long it did take to grow back, if you think to post when it does x",
      "MessageIndex": 2,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64620/how-soon-will-i-get-some-hair",
      "Title": "How soon will I get some hair?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Operation in July 2013 and still have a smurf patch though fainter, think I might miss it when it has gone, certainly can be a talking point!",
      "MessageIndex": 3,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71304/the-blue-dye-used-in-the-sentinel-lymph-node-bisopsy",
      "Title": "The blue dye used in the Sentinel Lymph Node Bisopsy"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Yu have titled your post, 'What the hell just happened?'  You have had a really rough start to the year with your diagnosis of cancer, surgery and now waiting for the next stage, it puts your body into a sort of suspension, I think, to start with as everything happens so fast, and just when you think you are dealing with it and beating it, your body goes into shock at the thought of starting something new and unknown.  So Janette pretty normal and I would suggest most if not all of the women and men who post on here have felt the same at some point during this journey. Radiotherapy does not hurt, it last about 10-15 mins, apart from the planning session which will happen before the treatment starts, it is tiring because it is every day, you will get into a routine with it all and get to know the lovely staff that will treat you.  If it is possible ask somebody to go with you for the first couple of sessions and see how it all goes, after that, I had 4 weeks of Rads. and made sure that every week I had a treat before or after treatment, I would meet a friend for lunch or hit the local (to the hospital) shops.  There are a lot of posts on here regarding radiotherapy, if you go to the search function you will find them. The staff will tell you what cream to buy to protect your skin and use it at least twice a day if not 3 times.  You will get through this, and have a found a forum full of great people who will be there to support you on this part of your journey. You take lots of care and know that all will be well.    Gillie    x",
      "MessageIndex": 1,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76102/what-the-hell-just-happened",
      "Title": "What the hell just happened?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Enjoyed your post margr20 and really glad you had a great time celebrating, its these things that keep us going.  Mind the thought of Bongo going topless did produce lots of images which also made me smile. x   Keep the positivity up both of you, keeps you strong, important right now, and wishing you both what ever you wish yourselves for 2014 with bells on.  As an aside I have been topless since the beginning, found scarves and wigs too hot and itchy, so wearing one all the time would be my worst nightmare.  Though wear a hat with eyes and ears on when it rains as nothing to stop the rain falling into my eyes and face!   Enter your message...",
      "MessageIndex": 5,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69216/new-year",
      "Title": "new year"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Thank you Margr - you know I was there too, and I wasn't hung over, given I didn't drink, had last chemo on the 30th so off the drink until at least 3rd week and then not so much.  A small price to pay, but it was good to read that others could.   Be positive for 2014 knock those scarves and wigs on the head.   ",
      "MessageIndex": 7,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69216/new-year",
      "Title": "new year"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Kipper, many, many, congratulations for posting this and getting through this journey so well, and with a positive end.   I guess anger got you through, we all need something to motivate us through as you say this crappy journey.  You have dealt with so much more than the cancer that nobody should have cancer is enough, but you have proved that it is possible to come through it all with a positive attitude, well done you. I finished all my treatment a month ago (almost) and have just come back from 4 days away with my OH and was wonderfully surprised how well this went in the form of energy - which I didn't think I had, but so easy to sit and think can't do that yet, and just proved that I can.  Mind still had a rest in the afternoon, to make sure I had enough in reserve for the evening.......  Wishing you all the best of everything  x",
      "MessageIndex": 7,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74263/brave-people",
      "Title": "Brave people"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Great news, Gail, Jackie AND George it certainly is reassuring to get these posts.  I am certain you will find plenty to do with the free time, though it may take time to decide what! Hugs and best of everything you wish yourselves x",
      "MessageIndex": 4,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65160/one-year-on--after-bc",
      "Title": "One year on- after BC"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Only to be read on Sunday 6th April! Shhh! Marg is sleeping.   Recovering from her topless boobie party, which I am sure was explosive.   Sweet dreams Marg. and tuck into a hair of the dog this morning.     Having a Vodie right now to toast you.  love and hugs   x  ",
      "MessageIndex": 4,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74789/party",
      "Title": "party"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "So sorry it must be horrid when that happens that is why I plan to have mine shaved then wear scarfs or wig before it completely comes out.  Have you got  a wig yet, or are you using scarf x  Some people have left their hair to settle and covered it over when out, some shave I think the choice is yours, two people have replied to my question on FEC and hair loss it you haven't read these maybe worth it.    So beachbabe another choice in this brave new world we all find ourselves in, it has to be what is right for you.  x  sleep tight",
      "MessageIndex": 1,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64580/ec-and-hair-loss",
      "Title": "EC and hair loss"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Sounds like you had a roaring time Marg.  Hair of the dog maybe......",
      "MessageIndex": 15,
      "PostDate": "06/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74789/party",
      "Title": "party"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi MelBed, this is such a good group to join, full of supportive and very caring men and women who will always take the time to come on and reassure you, answer your questions and just be there when you need somebody to talk too.   What I love the best about this group, although we know the diagnosis of those on here and little bits about their lives, if they want to share, we are all equal and we are all different.  There are no barriers between us in the conventional sense, and certainly no judgements are made. As Bongo said I have been on a similar journey to the one you have started and I am out the other side, I too was diagnosed with triple negative grade 3 breast caner, and I say was diagnosed with, because as far as I am concerned once lumpectomy was over the cancer had gone, and as my oncologist said the following chemo and radiotherapy was a mop up and preventative treatment.  Chemo is horrid but very, very doable, very hard with a 2 year old, you will need to get an army of friends and family around you to support your little one and yourself during this time.  What chemo are you on? I had 6 x FEC, and have seen Mrs Brown's boys, the comedy show in a different light since having this, in fact have just bought my Son a birthday card which says 'Happy Feckin'  Birthday' knowing he will see the joke.   (Well I hope so)   I found the first week the hardest with the chemo, very tired, not sleeping too well, due to the steroids they give you, one tip is to take them early and not after 3.30 - 4.00 pm this helps with sleeping.  I learnt to embrace the not sleeping and used it to catch up on my Candy Crush, catch up TV but I was in th fortunate positive to be able to sleep in the day if necessary.  This does pass and by the second week was sleeping through the night most nights.  The second week you do have to be careful of been around people with colds etc. and you re susceptible to caching whatever is going around, as your white blood cells will be low, though often it is your own bodies bugs that cause a problem as you are not fighting them off as you usually would.   By the third week I was more energised and going out but found I still needed to rest or go to bed early. Drink plenty of water, this of cause can then have the effect of waking you in the night too, but it is important to flush the toxins through your body, and before you next chemo drink water still as this will plump up your veins ready for the  next session. There is a lot more I could say regarding chemo but don't want to overload or ramble, be rest assured everything you are feeling is normal, keep a little dairy this will help you plan for the next session, for shopping, washing, cooking etc.  I managed to do all of those things throughout chemo even if I started the preparation for the evening meal at lunch time, so took it in stages, and tried to make things that would look after them selves in the cooking. The greatest advice I can give you overall is to keep a sense of humour, and see chemo as your friend it is fighting to keep you well and healthy so you have many more years with your little one. Having Grade 3 Triple Negative is scary, as there is no follow up treatment as there is with other types for 5 years, but your team will do everything they can for you so embrace it and Know you too will be through this before the year end.    Continue to ask the questions please 'friend' me if you think that will help as I am happy to share with you. Take lots of care MelBed and know that tomorrow is another day.    xxxxx",
      "MessageIndex": 2,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74399/coping-with-chemo",
      "Title": "Coping with chemo"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I too have triple negative breast cancer, grade 3.  However I am post menopause, but thought I would add some of my own techniques for dealing with menopause, as I went through this naturally but early in the scheme of things.  I started at 48 - The worse for me was the night sweats and once I had realised this was probably caused by   an adrenalin rush and the wet sheets through sweat went cold very quickly, and I seemed to have a fountain spurting out of the middle of chest, I set about strategies,  I kept a very large bath sheet by the bed, that could go on top of the sheets for the night, baby wet wipes sorted the fountain in a way but did help, also one on my forehead and a fine water spray can also help.  You can buy these but try making one with a very very fine garden spray, if it is possible to buy these.  Laying in bed was no use to me as I had all this spare energy, so I would get up read, drink tea, watch telly depending on the time, prepped for teaching, did some ironing whatever made me feel better, have to say ironing wasn't on top of my list, but did keep it down which took pressure off other days.  and wait for my sleepy head to appear, some nights it didn't so would be up when the rest of the family got up, I would be ok for work, but did need an early night the following night.  This I found for me was far less stressful than trying to sleep when my body clearly didn't want or need....    I eventually got into meditation as I found an hour of this early evening relaxed me enough and gave me enough energy when I got home from work before I needed to cook etc.  This often helped in the night wakes too. I felt I was lucky too, as my children were still at home, I had a good career which still had places to go, and in a fairly good relationship, though although got me through this stage up to a point didn't last forever!  So being younger I felt was a great advantage for the menopause, a lot of the time menopause corresponds with careers possibly at their peak, or waning, children leaving home so can be another step in what can feel like a downwards slope.  Though it isn't as we soon become to realise the older we get.  Though as things have changed economically children are not leaving home so early and with pensions changing careers are becoming longer.   What I am trying to say is see menopause as a natural part of our lives as women, yes you have started yours artificially but it would have happened anyway, and the side affects combined with the side affects and stress of cancer and treatment are a double whammy, but if you can take some control of  menopause  symptoms it may be easier to deal with it.  And remember the money you will save on all those personal items......  Sorry if I have rambled certainly got 'Chemo brain' today took me three attempts to spell symptoms and don't even ask how I got round 'adrenalin' so here is hoping it all makes sense and possibly useful for some.   Big hugs  ",
      "MessageIndex": 6,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65046/hot-flushes-and-menopause-after-chemotherapy",
      "Title": "Hot flushes and menopause after chemotherapy?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "I drove after two weeks, but had a problem with the seat belt rubbing the site, on my left breast.  A trip to Halfords and I bought  a strap you can attach to seat belt, usually for children to use, and it pulls the part that goes over you body slightly to the right, so it missed my op site.  Fine after that.  But only drive when you feel totally in control and can as others and mistymoley has said feel safe. Good luck x",
      "MessageIndex": 6,
      "PostDate": "05/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77747/how-soon-after-a-lumpectomy-is-it-safe-to-drive",
      "Title": "How soon after a lumpectomy is it safe to drive?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Oh well done for completing this, I will definitely read it, like you I am triple neg., grade 3 too.  Mind I am coming up (next week) to my 12 months anniversary of been diagnosed, so out the tunnel now.",
      "MessageIndex": 1,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78130/summer-reading",
      "Title": "Summer Reading"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi just thought would let you know bought and sitting on my kindle as I type.   Looking forward to reading it.    love and hugs   x",
      "MessageIndex": 2,
      "PostDate": "13/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78130/summer-reading",
      "Title": "Summer Reading"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hello this sound intersting, can you tell me what the clean 9 programme is - thanks.   xx",
      "MessageIndex": 2,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84143/clean-9-nutritional-cleansing-programme",
      "Title": "Clean 9 Nutritional Cleansing Programme"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Such GOOD news Binny, enjoy that larger you certainly deserve it.  This is also a lesson for us all, certainly next time I go for tests etc. I will think of you and realise that it is NOT always bad news, that a lot of us have come to expect. So thank you and I am sooooo glad it has all turned out as well as it has. Enjoy your weekend.",
      "MessageIndex": 24,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71079/bone-scan",
      "Title": "Bone Scan."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Such GOOD news Binny, enjoy that larger you certainly deserve it.  This is also a lesson for us all, certainly next time I go for tests etc. I will think of you and realise that it is NOT always bad news, that a lot of us have come to expect. So thank you and I am sooooo glad it has all turned out as well as it has. Enjoy your weekend.",
      "MessageIndex": 9,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71079/bone-scan",
      "Title": "Bone Scan."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Oh poor you, My ONC. suggested I used Voltaro Gel  for my arm and I have used that with no side effects and my 6 months after chemo is up this month. Might be worth asking your BC nurse tomorrow.   xxx",
      "MessageIndex": 1,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77995/heat-rub",
      "Title": "heat rub"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "sorry Sally I ended a little abruptly as my keyboard was playing silly games, and typing everything backwards, very interesting words.....but just want to say, Yes it is scary, it is lonely, and very unfair, but you know that you will get through this and find your positivity again. Big cyber hugs and use the forum, it helps it really does.",
      "MessageIndex": 3,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89093/breast-cancer-round-2-triple-negative",
      "Title": "Breast Cancer Round 2-Triple Negative"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi SaxxyD it is great to read your post, I was one of the class of 2013 so never met you, you are so right life does go on, I have got into crafting and enjoying that so much, never had the time before.   I too make some good friends on this forum and are still in contact and see some of them, often.  So congrats with your art and embrace it all. love Gillie",
      "MessageIndex": 4,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84334/life-does-go-on",
      "Title": "Life does go on"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Know the feeling, I can just about keep mine on my head again, now that hair is growing back....    Lost them even more when I couldn't do this!!!",
      "MessageIndex": 5,
      "PostDate": "26/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75811/doh",
      "Title": "doh!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Sally, as Bongo said I am from the class of 2013, can't believe it is now 2015.  I was diagnosed in the June, one day after coming back from a great holiday in Corfu, at least I had a tan.  Like you had a lumpectomy with clear margins and no spread to Lymph nodes, this was followed by 6 treatment of chemo - I had FEC which I found very handy when I got down as I could shout 'Fecking Fec' loudly which helped slightly.    This was followed by 4 weeks of rads, the last week was a booster week.  I was going to see oncologist every 6 months since, but now only have to go once a year This February will be the 12 month anniversary of the end of my treatment, I really can't believe that it has been that long, the good news in all this, depending on how you look at it is that there are no follow up hormone tablets etc. so once treatment is over it is over and you gradually start to get back to enjoying life again. You are right there is little information about TN not so much research has been undertaken in this area as it is a rarer form of bc, and grade 3, but it does seen that there are more women now been diagnosed with this type.   You have been down this path before so much harder for you to get through and to hang onto that positivity, but you know there have been many women on here that have got through the tn treatment and are now back to enjoying life to the full. The really good news here is that your lymph nodes were clear and they have now taken that nasty little critter out of your body.  So no more searching the web as you won't find much I know 'cos I tried, ask any questions you want and friend me if you think that would be helpful.",
      "MessageIndex": 2,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89093/breast-cancer-round-2-triple-negative",
      "Title": "Breast Cancer Round 2-Triple Negative"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Emma, since I read you original post on this thread, I have cried for you, screamed for you, and toasted you with a very good Gin,( Mr. Millers) if you are a gin person it is worth a try with just ice and lemon.   What I haven't done is pulled my hair out, to be fair it is only just growing back, so you mustn't either.  The shock of this must have been dreadful for you, and again I guess once the treatment is outlined for you, you will get it by the 'short and curlies' and go for it.   You are a strong women, you have shown that in your posts over the last year that I have been on here,  you have so many friend on here who are routing for you and filling the ether with good wishes, hugs and lots of love, take this on board, but use your anger to get the treatment started and take all the wishes, hugs and love to wrap yourself in when you need your comfort blanket. So here is another toast, with a Mr Miller of course, 'Emma may your road be less bumpy than you imagine;    xxxxx ",
      "MessageIndex": 22,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74173/it-s-back-and-this-time-it-s",
      "Title": "It's Back! And this time it's..."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "That is good news you will have a blast if your parties are anything to go by.  Gillie x",
      "MessageIndex": 11,
      "PostDate": "27/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77293/moods",
      "Title": "moods"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Bchilled are you talking about head hair here or facial hair?   As I have silky sideburns too, though definitely facial hair  like the soft downy hair babies have, but mostly on my left side only...     it goes right down to my jaw bone so definitely not head hair.....   I should be so lucky. I, as you have  had a look on google, naughty I know, but it can be  a common side effect of chemo.    Interesting but as you say it does disappear apparently -  at least my hands and feet aren't getting hairy on the full moon, not yet anyway! Take lots of care.    x   ",
      "MessageIndex": 6,
      "PostDate": "12/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76610/and-now-i-ve-got-sideburns",
      "Title": "And now I've got sideburns!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi AnneH I have just finished 6 x FEC and didn't experience this, but I did have indigestion for a couple of cycles, this is something I have never experienced before but took me a while to work out what it was, not saying this is what is causing your bubble, just a thought really. It is scary when these things happen to us, really do think you need to ring BC nurse or nurses on this community for the best advice. Good luck with the rest of your chemo treatment, you can always ask the questions on here. Hope it gets sorted for you. x",
      "MessageIndex": 1,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71245/strange-sensation",
      "Title": "Strange sensation"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "I was the same not knowing how it felt, but as indigestion tablets helped and took it away I assumed it was that.  The Cancer fighting Kitchen sounds a great book, could you give me the author please.  Choose a great wig, though saying that I never wore mine found it too itchy and hot so ended up going bald, as my head shape wasn't bad.  My hair started growing back after the 5th round of FEC, but know you are on a different drugs for the last 3 so may not be the same. Enjoy trying on all the various wigs and take pictures, have fun.",
      "MessageIndex": 4,
      "PostDate": "03/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71245/strange-sensation",
      "Title": "Strange sensation"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Sore mouth/gums/teeth happens as one of the wonderful side effects.  Try a good mouth wash or ask when youhave your next chemo for one on prescription.  I used a new toothbrush for every session of chemo, a soft one, and when my mouth became too sore I used childrens toothpaste.  Given they rang you re infection after your bloods, you might be useful to ring them back and tell them how you are feelings, if you didn't when they rang.  Really do think if there was a problem with your bloods they would have told you when they rang. Twice mine was delayed by a week each time, but nothing major, once my white blood count wasn't high enough for me to have the chemo and was told to rest as much as possible and drink more water, within 5 days and my next blood test they were up again.   Be guided by them. It maybe that you are having these symptoms because you do need to rest a little more and remember the drinking of the water.     With lots of good wishes for your next cycle.   x ",
      "MessageIndex": 1,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81465/infection-risk",
      "Title": "infection risk"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "This thread is so helpful, thanks.    x",
      "MessageIndex": 4,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71103/abbreviations",
      "Title": "Abbreviations"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Emma so very pleased that your current treatment is working so well and you are able to get back to what you clearly love doing.  You are such a strong women - I have as we all have,  been thinking about you often and sending you cyber hugs and positivity.  Will certainly be watching on the 26th, Hugs to you all.  xxxxx",
      "MessageIndex": 7,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81209/sheep-and-cancer---now-on-tv",
      "Title": "Sheep and Cancer - now on TV!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi can't answer most of your questions, all I know is when I started to go through menopause every bone, joint muscle in my body was painful, I struggled to walk up stairs to get to my office.  Went on HRT probably why I am on this site now - who knows.    Sure other people with experience of the treatment you are currently on will also advise on possible side effects. Keep strong  ",
      "MessageIndex": 1,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66990/arthiritis-or-side-effcts-from-meds",
      "Title": "arthiritis or side effcts from meds ?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Good news, relax and enjoy the holiday from treatment and especially the cinema. x",
      "MessageIndex": 4,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70485/radiology-appt",
      "Title": "Radiology appt"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "You did make me smile, thankyou.   Chemo brain, Oh chemo brain, I still use it as an excuse at times, and my last chemo was January this year,  so maybe I am still in time to be able to do that, though they do say it takes at least a year to a year and a half to get over the effects of it all, so would suggest you are still in the chemo brain bracket also.  lol   So use it as the perfect excuse for a while longer I would suggest....... Kind thoughts are coming your way    Gillie  x",
      "MessageIndex": 1,
      "PostDate": "15/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84408/chemo-brain",
      "Title": "Chemo brain"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "2nd FEC today which went ok even if I was there for 5 hours!!  Problem with bloods but doctor said to continue so all good. When I read the booklets from the hospital it tells me that I am most vulnerable day 10 - 14, asked the   nurse and she says it is day 7 - 10! Now my lovely husband who usually lets me get on and values my independence has gone all protective, now I totally understand this, I would be the same if the roles were reversed, but I know he would be happy if I stayed in on these days - this I will find totally frustrating! So advice please, any ideas which days and what do the rest of you do?  ",
      "MessageIndex": 0,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65343/which-days-are-the-most-vulnerable",
      "Title": "Which days are the most vulnerable."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "WOW this is exciting....   I started my FEC Sept 2013 and finished Jan 2014.  By the second I had lost all my hair, so good move to have it shaved off now, by the 3/4th Fec I had the fuzz!  Though you could only see it in certain lights and yes it did stay, though although it was winter I kept the scarves, wigs and hats off to let it breathe!!!!   I really was worried that like baby hair wearing something would rub it off, silly I know...  The growth at this point was fairly slow and it took until February/March time to have a short style and full head of hair with no scalp showing.     Now it grows so fast I  have to have it cut every month if I want it to stay in a sort of short style!    Good luck with the rest of your treatment and look after that Fuzz a very positive sign. hugs  xxxx",
      "MessageIndex": 1,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85657/feeling-very-lucky",
      "Title": "Feeling very lucky"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "This is so interesting, my story is I had a mammogram February 2013, which was told everything was  clear.   May 2013 I found the lump, so we are talking here under 3 months from the all clear to having a lump and finding I have triple negative grade 3. The doctor at the breast clinic who gave me the biopsy said there was no way this wouldn't have shown on the mammogram in February so immediately called for the scans.   Because I live on the border to two health authorities, the mammogram was in one and the hospital was in another!   So she said she would chase these and check them out.   Last week I went for my  check at the breast clinic (I finished treatment in February of this year) I asked if I was having a mammogram and she realised I had dropped through the loop and I wasn't booked in for one....     I did get one, but I also pointed out that I didn't think I would trust it after my experience last year, and as I hadn't heard anything regarding this after been promised I would. So basically a mess! Hoping to get a letter this week with the results, but intend to ring my breast care clinic tomorrow to see if they have sorted out my previous scans.  I really do want to see them, as I too think there maybe women out there who possibly were missed!    However I do take Swindon5 point about breast density, but do need to know, because if it was clear I clearly had a very fast growing cancer.   Be interesting to see how the rest of you get on, but I do feel we should push to get our scans back to make sure they were interpreted correctly in the first place. ",
      "MessageIndex": 6,
      "PostDate": "11/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81060/an-uneasy-question-to-ask-about-a-previous-mammogram",
      "Title": "An uneasy question to ask about a previous mammogram"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Thanks for this Russ.",
      "MessageIndex": 3,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65343/which-days-are-the-most-vulnerable",
      "Title": "Which days are the most vulnerable."
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Yes it does work Chelsea there are plenty of evidence on these forums to show that, I will be half way after my next chemo on Monday, it will soon go.  Plan the week after with food, easy to prepare and things that you like to eat, be prepared to sleep a lot and please, please take the anti-sickness tablets they give you even if you don't feel sick.  I have and up to now have managed not to be sick at all.  I did get in ginger tea and ginger biscuits just in case, though have enjoyed the biscuits, not something I usually buy, good for dunkin'.  Try and get somebody else to cook for you if possible. Remember the team that are supporting you want the best possible outcome so put your trust in them and try and relax.  I also suggest you get a good mouth wash as your mouth can get very sore and possible ulcers, I used Corsodyl once cleaned teeth  and Difflam when my mouth was sore which numbs your mouth and gives instance relief, pure joy.  Might be worth getting these in in case,  pineapple is good for this too, also little ice lollies. All this will be explained on Friday to you, also ask what foods you can or cannot eat.  Drink plenty of water, they suggest not bottle water but from a running tap. It is not the best Chelsea but all doable, lots of us are going through this, it does mean changing your routine and setting up a new one, but it is not forever.  Please 'friend' me if you want further chats. Lots of warm cuddles for Friday take somebody with you and take something to do.  Take care and positive.",
      "MessageIndex": 2,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65939/hi-am-new",
      "Title": "hi am new"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Sending you warm fuzzy cuddles but I can only agree with mistymoley wallow for a period, let it out then get up and do something different.    This works for me and has for many years with other things other than cancer.   Give it a go.   xx",
      "MessageIndex": 5,
      "PostDate": "25/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78698/feel-so-alone",
      "Title": "Feel so alone"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Joysilvercat Roller coaster is the right phrase for now, once you know the outcomes on Thursday you will feel more in control and know what you have to do to get back to those children at school.  It is such a shock when first diagnosed as most of us feel 'normal' before diagnosis and unaware what is happening to us.  It is very soon after your operation and General anaesthetic so you will still be feeling tired, so let your body dictate what you do.   You know for the surgeons this is a common operation and we have to trust our team that surround us at this time.  Be as positive as you can be see yourself back at school albeit maybe next academic year, but you maybe able to go back for the add day or two inbetween treatments if you feel this would help in your recover and fits with your upcoming treatment plan.   I am a very stubborn person and refused to see this as an illness, it was a cancer that had invaded by breast, it was taken out, and 3 lympth nodes so as far as I was concerned the cancer was gone.  It was the treatment that followed that made me feel ill, though this is temporary and you know it will end, though a long road to travel at the time.  I finished my chemo and radiotherapy this last February and am feeling fine now.  It is a physical and emotional journey you are on, as we all say on here it is dobable, be as positive as you can, keep your sense of humour,  eat well, drink plenty of water, and rest when your body tells you too.  A new routine for you and your family, but consider about all those lovely things you would like to do that are unable to do because of your teaching job, and take some time out to embrace these.  You take lots of care and keep in touch through the forum it is full of lovely people who know exactly were you are and how you feel right now.  Just a note it took about 10 months before my Smurf boob returned to normal, it fades rather than just disappears, for me anyway.  I missed the blue tinge once gone..... cyber hugs    Gillie  xxx",
      "MessageIndex": 1,
      "PostDate": "14/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82772/newly-diagnosed-and-already-on-the-roller-coaster",
      "Title": "Newly diagnosed and already on the roller coaster!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "You know Russ whenever you come on you are always so upbeat throw in a lovely quip that makes us smile,    I cannot help but think that as a man this must be harder in a lot of ways to deal with and not so much support for you, I do hope I am wrong.  I do not mean your family and close friends but others must find it hard to get their head around which I would think this would be harder for you.  Glad you are through your Chemo what is the next stage for you?    Are you having or did you have rads?   ",
      "MessageIndex": 3,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67385/bruising-after-lymph-node-removal",
      "Title": "Bruising after lymph node removal"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I seem to be following Louise around today on the forum, but again I can only agree with her comments.  I find that having one busy day I then had a quieter day and this works for me, and I finished all my treatment at the end of February.  So just to repeat the more you rest the more energy you will get back, keep drinking the water this helps too. Don't rush it will be better in the long run, and take lots of care of yourself, you are IMPORTANT. Gillie xx",
      "MessageIndex": 6,
      "PostDate": "06/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76243/tired",
      "Title": "Tired"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi Mandy, as G & J said it was a slap in the face your diagnosis so soon after losing your Mom. x Your Mom gave you her courage and strength to get through this, hard though it will be, she has given you love and all the memories that you shared, this is so important to hold onto during this time, she maybe not be physically around to hold your hand so to speak, but she will still be with you giving you the peace and confidence to get through this.  I too was fairly calm with it all and knew I would find all the necessary courage and strength needed, as we all do, panicking and been fearful does not help in my personal view only hinderers - you know enough to know that everything changes within a day so to take one day at a time. It is much harder, again in my personal view, for those around us, as they are scared and fearful for us and can't however hard they try know how it feels physically and emotionally.  Of course you will have days when it seems all too hard, mine came halfway through chemo, but you get back on your bike and plough through, and then suddenly it is all over. You know my Mom died over 10 years ago now and I still talk to her and ask those difficult questions and I always find a way through. So here is lots of love winging its way to you., You will get loads of support that you need from the women and men on here, as and when you require it, also lots of laughs, sign up for Micks page,' laughter is the best medicine'.  The sun is out here hope it is where you are.",
      "MessageIndex": 5,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77258/is-how-i-am-feeling-normal",
      "Title": "Is how I am feeling normal?"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hey this roller coaster is such a long one, and can understand you want to jump off, I had the same feelings during the treatment too.   But you know what they say 'jump back on the bike' not easy, but you have come so far, made us all laugh, which is exhausting in itself, so be kind to you, see it as a blip see the consultant, be honest and talk through everything.   'Keep calm on the roller coaster, and stay put.    You know it makes sense. Lots of hugs and love coming your way.  You can do this Marg.   xxxxxx ",
      "MessageIndex": 4,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79509/treatment-overload",
      "Title": "treatment overload"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi all, it is interesting and good to get the message across.  I agree that life does deliver things at the right time and that we tune in.  I have found myself whenever I am in a crowd watching people and thinking I wonder what type of cancer you or a loved one has been affected by.  I am pre-chemo, start next week, and currently feel great and those on my 'outer circle'  have no idea yet that I have breast cancer,   I think the scary thing is we do not know what is going on in our bodies unless we are very fortunate and find that lump!  I do hope San that things with your Mom settle, sure they will, but when is the question I guess.  Keep strong all of you we can and will  get through this.   Maybe then we will see why it has happened. x",
      "MessageIndex": 3,
      "PostDate": "03/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64277/breast-cancer-cancer-and-tv-shows",
      "Title": "Breast Cancer, Cancer and TV Shows"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Interesting, I was at the hospital on Monday with my husband, for results of various scans and tests.  He has to have an operation on his spine, going in through his neck.  Sounds far scarier than anything I have been through so far.  Fortunately this will not happen until after Christmas and my chemo will be over, just rads to go then, so will have time to concentrate on him.  Sure they all do it on purpose!!!!!",
      "MessageIndex": 7,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65815/staying-to-get-anxious",
      "Title": "Staying to get anxious"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi just wondered how you are feeling today, is your temperature still ok?   Let us know how it is going. ",
      "MessageIndex": 6,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77181/freaking-out-slightly",
      "Title": "Freaking out slightly"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Here is hoping the scan went ok and you are now on your way home, or at home having that comforting cup of tea or coffee. Sending you lots of hugs.  x",
      "MessageIndex": 10,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77181/freaking-out-slightly",
      "Title": "Freaking out slightly"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Caroline, sooo sorry to hear the news, glad your husband has hotfooted it back to  be with you at this scary time for you. I will PM you. lots of love and giant hugs  xxxxx",
      "MessageIndex": 12,
      "PostDate": "26/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77181/freaking-out-slightly",
      "Title": "Freaking out slightly"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Hi I have just tried Martyn Lewis travel insurance, Martyn is the BBC finance man, google him and there is a company called Stay Sure travel and offer insurance for pre known medical conditions including cancer, and say that if you have not had any treatment, check up or follow up for 2 years it will not affect your insurance, better than 5 years but still not brilliant.  Without making a false claim for holiday insurance I couldn't go any further but might be worth a look.   Age concern also offer insurance for over 50's with pre medical conditions but don't know what there terms are.   Helps this helps no where near this stage yet but was hoping to pop off somewhere next year later on. So be good to see what comes of this research.",
      "MessageIndex": 3,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65462/cancer-survivor-struggling-to-get-life-insurance",
      "Title": "Cancer Survivor struggling to get life insurance"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Karan, this is a horrid time for you not knowing what is happening and why, the lack of information is not good.  I am afraid I can't answer any of your questions - would your GP have the results of the scans? Might be worth an ask. Sending you lots of cyber hugs and hoping you get the answers quickly as this waiting around is not a positive place to be. Tomorrow is another day and you maybe able to get some answers if not from your GP ring the BC nurses again and push. xxx",
      "MessageIndex": 1,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81248/in-need-of-some-reassuring-words",
      "Title": "In need of some reassuring words!"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Oh well done for completing all your treatment.  I am 10 days away from doing the same and counting every day....  well I still need that conversation with the oncologist but have done everything they have asked of me, op, chemo and now rads. with an extra 5 day booster.   I have made the decision, at the moment not to read the cancer survivors handbook unless I need to, didn't want to put things in my head unnecessarily, I do know though that I won't just bounce back and will need time to adjust and recover.   Like you I have pondered about staying with the forum, but know that I won't go this route, it has been so supportive and helpful and I have met another forum user who lives 10 mins. away from me and talk to others, over the UK  that |I wouldn't want these links to go, and  will want to encourage and support old and new.  I have to say it has been a lifeline for me particularly at silly o'clock.    But I can see where you thoughts are based. So Kipper, (I have always liked your user name) you take lots of care, enjoy your new found freedom and be very kind to yourself and those that love you.   x ",
      "MessageIndex": 1,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71930/all-done",
      "Title": "All done"
    },
    {
      "AuthorID": "GillieB",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillieb",
      "Content": "Sorry you are plague by this horrid cough, I finished fec on the 30th December, and got a cough and a tight chest every session, turned out to be the anti-sickness, which they changed for me and it got slightly better.  I also had a runny nose one I couldn't control - difficult at times!  You need to ring your bc tomorrow at the very least your GP, but bc would be best.  As you can tell I am too awake at silly o'clock one of the joys of treatment.  Good luck I am going to watch catch up TV and or play candy crush, seems a favourite on here when sleep evades us. Try and relax and try and drink as much water which may help your throat and cough. Sending you night time hugs.",
      "MessageIndex": 2,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71641/coughs",
      "Title": "Coughs !"
    }
  ]
}