{
  "AuthorID": "Gillk",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillk",
  "Posts": [
    {
      "AuthorID": "Gillk",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillk",
      "Content": "As you say Oncotype test provides a pretty accurate % chance of recurance. My surgeon felt I would not need chemo but the oncologist asked if I would like to have the test. It came back medium risk so I had to make the decision. I opted to have chemo and am hoping that it will prove to have been the 'right' one. If the test had come back as low risk I would not have opted for chemo as the research suggests it is of little, if any benefit. I would wait for the Oncotype result and then make your decision. You may be able to safely forgo the chemo. I will keep my fingers crossed for you. ",
      "MessageIndex": 1,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108705/making-the-right-decision",
      "Title": "Making the right decision"
    },
    {
      "AuthorID": "Gillk",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillk",
      "Content": "Hi Carole, I had a similar scare. It proved to be a small cyst probably due to the scarring. Try not to worry, even if it did prove to be something I think it would be considered to be a local recurrence which I believe is very treatable.  Also, I know that it's not true that a painful lump cannot be BC, but a tiny lump that is so sore sounds like it could be a local infection. I will keep everything crossed for you. Let us know how you get on. ",
      "MessageIndex": 3,
      "PostDate": "25/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108364/another-lump",
      "Title": "Another Lump"
    },
    {
      "AuthorID": "Gillk",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillk",
      "Content": "Hi, Everones story is a bit different but here is mine. I had an immediate reconstruction. LD flap and implant, later uplift on other side to match!  I have been very happy with the results. It does not feel completely normal, some slight numbness and tight feeling. I can do every thing I could before, although I do feel the muscle contracting which is a bit odd. I am a keen swimmer and have canoed without any problems. I am concidering taking up riding again myself but am very out of practice and concerned about the aching legs and bottom not at all about my arms and upper body strength! If I remember rightly I drove after 3 weeks. I did my excersises religiously and it was more a case of remembering not to do too much rather than not being able to do things. I was in hospital for 5 nights. I could have gone home after 3 or 4 but I opted not to go home with drains and to stay until they were removed on the 6th day. I did have a bit of a hiccough and had to have a small skin graft because of necrosis (recognised complication) however it has only marginally affected the cosmetic result and I feel pretty comfortable now getting changed in the communal changing rooms at the gym. I do have a scar  on my back but it is not that noticeable and does not bother me. I had a nipple reconstruction and tattoo which I know some ladies don't bother with; but for me it has made me feel complete again. I even get surprised sometimes that the nipple does not change with temperature and have to remind myself that it's because it's not real!  I did not go back to work for months but that was because I went on to have chemo. As far as the surgery was concerned I would have felt happy going back to work as a special needs teacher, perhaps on a phased return, doing office work, after a month or so. But I would not have gone back to teaching proper for a couple of months.  I hope this helps somewhat and send you all my very best wishes for a speedy recovery.",
      "MessageIndex": 4,
      "PostDate": "13/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106542/latimmus-flap-reconstruction",
      "Title": "Latimmus flap reconstruction"
    },
    {
      "AuthorID": "Gillk",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillk",
      "Content": "Shows how it all retreats into the past, thank goodness. Forgot all about the diarrhoea and losing all my nails! Hope you escape some of them. ",
      "MessageIndex": 6,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98079/docytexal",
      "Title": "Docytexal"
    },
    {
      "AuthorID": "Gillk",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillk",
      "Content": "Hi, Anyone going through this chemo has my sympathy. I had FEC / D 2 years ago and as you are saying the doxetaxol really does knock you about. I had fever, bad shooting pains all over but particularly legs, racing heart from day 3 to day 7 or 8. Horrid rash on hands and face and very unpleasant mouth symptoms. Also absolutely exhausted by dose 3. The good news is I finished chemo at the end of October and was virtually back to normal by the end of November and very fit and well when I went back to work in January. Take heart from research that shows this chemo regime is the most effective. It was relatively easy to keep going on FEC but not with doxetaxol. I had to give in and let my husband do virtually everything. I hope you all have someone to look after you, you do need a lot of TLC when you are putting all your energy into coping with the side effects and getting better mentally and physically. Take care",
      "MessageIndex": 4,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98079/docytexal",
      "Title": "Docytexal"
    },
    {
      "AuthorID": "Gillk",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillk",
      "Content": "Hi Sally, I opted for a skin sparing mastectomy with immediate reconstruction using LD flap and implant. Despite a couple of complications, seroma at donar site and skin graft to small area of necrosis, I am very happy with the end result. I had an uplift on the other side so I now have boobs a good few years younger than the rest of me! I did not need rads though and I know this can affect the decision. Main pro is the good cosmetic result, I look in the mirror and am quite happy with what I see and I am now confident changing in communal room at the gym. I know it should not matter, we are who we are, but I was happy that the option I chose was available to me. Cons are the length of time it takes to get it all completed and risk of complications. I hope this helps somewhat. Good luck with what ever you decide. Take care.",
      "MessageIndex": 5,
      "PostDate": "01/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108605/treatment-optionsnot-sure",
      "Title": "Treatment OptionsNot sure"
    }
  ]
}