{
  "AuthorID": "Gillymay",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillymay",
  "Posts": [
    {
      "AuthorID": "Gillymay",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillymay",
      "Content": "Thankyou Swampy for your words of encouragement. I will just keep asking! I hope you get over your infection soon..what a sorry lot we are!!.Best wishes, Gill",
      "MessageIndex": 2,
      "PostDate": "03/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115746/mastectomy-now-face-chemo-and-radiotherapy",
      "Title": "mastectomy now face chemo and radiotherapy"
    },
    {
      "AuthorID": "Gillymay",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gillymay",
      "Content": "After ignoring a lump and it crusted and burst( I know stupid me) I had to go to doctor. I have a problem going out on own which didn't help which was why I ignored symptoms. At hospital had scan, needle biopsy and core biopsy also mammogram a few days later a c t scan. On next appointment with consultant was told scan clear just2 tiny nodules on lungs not to worry about and biopsies clear. I had op two and half weeks ago to remove breast and some nodes. Since then I caught infection and had 10 days antibiotics. On seeing the consultant 3 nighst ago the nurse drained some fluid off and sent to see if any infection. I woke up the first night after that with wet tee shirt where had leaked. The consultant now told me that he removed 7 of 12 nodes and there was cancer there. What was the point of the biopsy as that said they were clear. He c ould not remove the others as they were on a blood vessel so now I am waiting for chemo then radiotherapy.I am 66 years old and was sailing along until I had the latest news. I had been so pleased after the first results which gave me false hope. Now I am depressed and trying so hard not to be for the sake of my poor husband who helped nurse my mother and father and now he has got me. I feel like disappearing and keep crying.",
      "MessageIndex": 0,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115746/mastectomy-now-face-chemo-and-radiotherapy",
      "Title": "mastectomy now face chemo and radiotherapy"
    }
  ]
}