{
  "AuthorID": "gingerbud",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gingerbud",
  "Posts": [
    {
      "AuthorID": "gingerbud",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gingerbud",
      "Content": "Hi there Hope your wife is doing ok and you are coping with the news. It seems that the offer of scans varies from place to place. Some patients have them and others dont. My tumour was much larger (39mm) and I still havent had any scans! I have asked many times as I wont settle until I am as sure as can be that there is nothing going on elsewhere, however where I am being treated, they only scan if 4 or more lymphnodes are involved. Thankfully only 1 of my nodes were affected so I wasnt scanned. My onc is totally confident that there is no spread based on my pathology report and the minimal spread to the nodes. Another thing they will look at are the pre op results. I was told that if there was anything going on in the liver, my blood tests would be abnormal. Same with bones (calcium levels tend to be raised with bone mets). I also had a chest x ray which would have revealed anything suspicious in the lungs. As all tests were normal, this confirmed their decision not to scan. Apparently, another reason they dont offer scans to everyone is because of the risks that the radiation poses. Also, scanning can cause unnecessary anxiety as normal things like benign cysts on the liver, scars to lungs etc can cause panic as they cant be ruled out as cancer initially. Also scans only offer short term reassurance. They only offer a picture of what is going on on that day etc. I have finished chemo now and have finally convinced the docs to scan me to help reduce my anxiety levels so I can go back to work and get on with life with a 'clean bill of health'.    Hope your wife's treatment goes smoothly and treatment is successful. It sounds like she has caught it very early so has a great chance of a full recovery. All the best x",
      "MessageIndex": 8,
      "PostDate": "01/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30082/fiancee-recently-diagnosed",
      "Title": "Fiancee recently diagnosed"
    },
    {
      "AuthorID": "gingerbud",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gingerbud",
      "Content": "Hi Kirsty I would say to request a regular checkup which may or may not include a mammogram. It sounds like there is a strong family history of BC in your family so air on the side of caution. Have you considered having the genetic test for BC? I know someone in her late 30's who recently had a double mastectomy after finding out she is genetically predisposed to BC. I am only 32 and have been recently diagnosed despite having no family history so it can happen to younger ladies (I also know a 24yr old!). Best of luck- really hope you have nothing to worry about, Love Tina",
      "MessageIndex": 1,
      "PostDate": "15/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/26291/please-can-someone-shed-some-light",
      "Title": "please can someone shed some light?"
    },
    {
      "AuthorID": "gingerbud",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gingerbud",
      "Content": "Hi all My bcn mentioned avastin to me and told me to mention it next time I see my onc. Just wondered if anyone on here has been able to get this on the nhs/ privately and also, what their experiences of it were/ are?? Being triple neg, my treatment options are limited and so I'd really like to get hold of this drug!! Ive looked into trials and there are a few applicable to me- one using avastin so could go down that route if need be. Thanks in advance Tina x",
      "MessageIndex": 0,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30795/any1-tried-avastin-for-bc",
      "Title": "Any1 tried Avastin for BC ??"
    },
    {
      "AuthorID": "gingerbud",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gingerbud",
      "Content": "Thanks alot sue- I had a look online at the article. She had kidney cancer with widespread mets and had been admitted to a hospice before trying avastin!! It looks like I'll be having more chemo afterall (initially told it would probably be just rads after surgery) so I will be getting avastin to have alongside the chemo- whether we have to pay or the private health covers it. Good luck with the herceptin- are you on hormone treatments too? Fingers crossed it does the trick and you dont need to go down the avastin route :-) Take care x",
      "MessageIndex": 2,
      "PostDate": "27/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30795/any1-tried-avastin-for-bc",
      "Title": "Any1 tried Avastin for BC ??"
    },
    {
      "AuthorID": "gingerbud",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gingerbud",
      "Content": "Hi sarah Thanks for your message. This really is a nightmare and I am preparing myself for the worst next week. Any good news will be a huge bonus. I had a biopsy taken from the rash and based on my ongoing requests for scans, they got me an urgent CT scan yesterday and Im going for a bome scan today. I feel and look really well, my hair and lashes are growing back great and I just cant believe this could all be happening to me again and so bloody soon. I get all my reaults next wednesday so its going to be a difficult few days. This triple neg thing is awful- more research needs to be done instead of the focus just being on hormone positive BCs. I know we are in the minority but so many of us are so young and we deserve a fighting chance. The surgeons I saw yesterday were both very concerned but assured me that if it is the cancer back then it is 'only' a local recurrence and is treatable. The thought of more chemo fills me with dread- they said surgery would be an option but I suppose I'll know more next week once the results are in. I cant help thinking that if the taxotere- fec combo hasnt even done the trick then my treatment options are limited. Im just praying for a miracle and hoping the scans come back clear. How are you feeling anyway? Did you meet with a gynae last week to discuss fertility treatment options etc? How are you feeling? This really is an awful time- we should both be out ebjoying ourselves instead of all this. Life really can be so unfair :-( Keep in touch- I'll let you know how things go on Wednesday when I go for results. Please keep your fingers crossed for me. Love Tina xx  ",
      "MessageIndex": 2,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30430/rash-on-new-boob--onc-thinks-it-could-be-skin-mets--",
      "Title": "Rash on new boob- Onc thinks it could be skin mets :-("
    },
    {
      "AuthorID": "gingerbud",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gingerbud",
      "Content": "Hi All Just after some advice really. Diagnosed january 2010- 39mm triple neg grade 3 tumour, 1 node affected no vascular invasion. Finished chemo June 16th (Fec- Tax) and starting to feel and look more like me again. BUT soon after chemo finished, a rash started to appear around my Mx scar- initially thought it was due to over inflation of my expander or maybe an infection. Showed my consultant who was a bit baffled but said 'not unduly worried'. Took a course of strong antib's but rash has got worse. Saw my onc yesterday for 8wk follow up and she was a little more concerned. She said she doesnt really think it is  cancer as it doesnt look typical of skin mets/ recurrence- however she said it could be the cancer back and Im going for an ultrasound and maybe a biopsy today. To say Im terrified is an understatement :-( I always knew I was higher risk of recurrence due to the triple neg status but never in my wildest dreams did I think it could happen immediately after chemo! I am praying its just a nasty unexplained rash but the more I look at it, the more suspicious it looks. Several small hard lumps have appeared in the last fortnight and the rash seems to be tracking down my boob. Im oly 32 with no known family history- got a little boy aged 15mths old. Have got all sorts of fun stuff planned for the next few weeks and months to celebrate the end of chemo- going Vfestival next weekend and abroad the week after. Also got a big family holiday booked for Xmas and the new year. Im starting to worry that if the cancer is back already then the chemo hasnt even touched it and I might not even be here by Xmas! My hubby is getting annoyed at me for being negative but its hardly surprising Im scared after the last 6mths. Has anyone got any experineces of dodgy skin rashes around the mx scar- whether it turned out to be skin mets or otherwise Id like to hear from you. Thanks in advance Tina x",
      "MessageIndex": 0,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30430/rash-on-new-boob--onc-thinks-it-could-be-skin-mets--",
      "Title": "Rash on new boob- Onc thinks it could be skin mets :-("
    },
    {
      "AuthorID": "gingerbud",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gingerbud",
      "Content": "Hi Ladies Just an update... Sadly the rash is cancer :-( Looks like some of the little b**tards survived the chemo. Just wish I'd have had radiotherapy now as it may just have made the difference. Im having quite drastic surgery next week to remove the recon and the skin in the area and possibly some muscle if need be. Gutted to say the least. So far the plan is for radiotherapy after surgery as multiple scans indicate that it is 'only' a local recurrance that Im dealing with (phew!!). I imaging that chemo will be discussed afterwards though- just as my hair, brows and lashes are coming into their own too ! I suppose thats the least of my problems now though... Just wish the docs had biopsied the rash immediately instead of wasting several weeks. Thanks for your supportive posts Love Tina xx",
      "MessageIndex": 6,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30430/rash-on-new-boob--onc-thinks-it-could-be-skin-mets--",
      "Title": "Rash on new boob- Onc thinks it could be skin mets :-("
    }
  ]
}