{
  "AuthorID": "Gracie G",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gracie-g",
  "Posts": [
    {
      "AuthorID": "Gracie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gracie-g",
      "Content": "Hi Peggysgirl, Iam also waiting on date of chemo starting after having right side mastectomy and full nodule clearance. Hope you don't mind me asking did you consider the cold cap treatment.  I have been thinking about it however I am now thinking cut my hair short now and shave it off when chemo starts and hopefully use a wig sometimes.xx  Gracie G",
      "MessageIndex": 13,
      "PostDate": "04/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132915/i-ve-done-it-shaved-my-head-today",
      "Title": "I've done it! Shaved my head today..."
    },
    {
      "AuthorID": "Gracie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gracie-g",
      "Content": "Hi Dayityrose,  thanks for your reply it managed to keep my worries at bay for a while. So I went for my first appointment today and was given a treatment plan which starts on 3rd August, I asked about my CT scan results & the doctor said he had spoken to my Consultant earlier and I will have another scan in the next couple of days to check the liver however there was no mention of the esophagus on his report anywhere.  Really strange so I am going to phone BCN tomorrow first thing to see what is going on. Hoping for a good nights sleep tonight. XX  Gracie",
      "MessageIndex": 2,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134476/ct-scan-results--",
      "Title": "CT Scan results -"
    },
    {
      "AuthorID": "Gracie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gracie-g",
      "Content": "Hi, spoke to a breast nurse this morning explaining the situation. Apparently there is a thickening on the esophagus however they are not overly concerned at this point and will arrange for me to have camera down to check this out. An adendum has been added to my notes and forwarded to Christies. Treatment plan is actually less than BCN said it would be so that was a bit of good news and if all goes to plan last treatment would be 16th Nov. Then I would start on hormone tablets don't know much more about tat at this point. Hope you are keeping well. xx Gracie",
      "MessageIndex": 5,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134476/ct-scan-results--",
      "Title": "CT Scan results -"
    },
    {
      "AuthorID": "Gracie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gracie-g",
      "Content": "Hi all, got my 1st appointment today where I hope I will get my treatment plan for chemo & must say not as nervous or worried as I thought I would be. Spoke to BCN yesterday who has informed me CT scan as shown things on my liver & esophagus(hope that spell correctly)& I will need more test to investigate, she said she doesn't think it is cause for concern but need investigating. Now this is all I can think about, as anyone else had experience of this.  XX Gracie",
      "MessageIndex": 0,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134476/ct-scan-results--",
      "Title": "CT Scan results -"
    },
    {
      "AuthorID": "Gracie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/gracie-g",
      "Content": "Hi Lainy What a good idea, me and my husband apparently hear different things when we attend appointments.  I think I go into a bit of a trance and always say to him make sure you pay attention, we are yet to hear the same thing when we discuss it later. It does make me laugh though. Xx Gracie",
      "MessageIndex": 6,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134476/ct-scan-results--",
      "Title": "CT Scan results -"
    }
  ]
}