{
  "AuthorID": "Green Giant",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-giant",
  "Posts": [
    {
      "AuthorID": "Green Giant",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-giant",
      "Content": "Hi Mandy, I am new to the online community too and have just started my first blog. I am also 44 and had breast cancer back in 2004 on my right side, when I had a lumpectomy, chemo and radiotherapy. In September this year I had pain in my right breast too, which noone could explain so I had tests including biopsy and found out that the cancer had returned. Noone seems to be able to explain why it is painful for me either - but it has eased now. I can definitely sympathise with what it felt like during examinations. I also had some sharp pains after my biopsy which the breast care nurse explained could be due to the healing process after this invasive procedure. I had a CT scan which showed no spread and am just waiting for the results of my MRI scan tommorrow, to confirm the extent and position in my right breast and to see what is happening on the left side. (Hopefully nothing). I am likely to have to wait around 4 weeks for my (probably single) mastectomy and have opted for an immediate reconstruction (DIEP). An immediate reconstruction is one of the ways I can cope but everyone is different. I know what you mean about wanting to get everything started quickly.I have also considered a double mastectomy to prevent recurrence in the future, but this is a really big operation if I have immediate reconstruction and may effect the timings of chemotherapy which I am also likely to have. There is so much to think about - it is very hard. I hope you have good network of friends and family to help you. I am going to try to use the time I am waiting to sort other things out like hats and wigs, nice pyjamas etc, as well as having a bit of time out with my friends before the long haul of the treatment process. I find music and some yoga breathing exercises help with anxiety - but it might not help everyone. We will both be going through a difficult time so take good care of yourself. xxxx    ",
      "MessageIndex": 5,
      "PostDate": "16/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33201/the-wait-from-diagnosis-to-surgery",
      "Title": "The wait from diagnosis to surgery"
    },
    {
      "AuthorID": "Green Giant",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-giant",
      "Content": "Hi Mandy, I am glad you are getting good support from your family. Some friends just can't cope with this sort of thing and I agree you have to focus on the people that can support you the best. I have some fantastic friends too. Sometimes I feel a bit selfish knowing I am going to be asking them to help me with stuff but I think it is good for them to feel that they can help.  I had the results of my MRI scan last week which has shown one main tumour (lobular)  and a couple of extra small ones on the right side. All OK so far on the left side. To cut a long story short they have recommended I start with chemo first to shrink the main tumour to make surgery easier. I will find out more about this on wednesday, but probably a Taxane of some sort. Hopefully the chemo will start sooner rather then later and I will have surgery sometime next year. I have also been offered the option of trying a cold cap. I know that it is supposed to be very uncomfortable and may not work, but I think I will give it a go if it is a possibility after I see the oncologist on Wednesday. It makes me feel a bit shallow to be thinking about trying to stop hair loss but I would just like to give it a go if I can. Hope you had  great meal with your friend. Take care xx.",
      "MessageIndex": 13,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33201/the-wait-from-diagnosis-to-surgery",
      "Title": "The wait from diagnosis to surgery"
    },
    {
      "AuthorID": "Green Giant",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-giant",
      "Content": "Hi Tess, I can't tell you how great it is to hear from someone who feels exactly the same as me in relation to the hair issue. I know that everyone is different on this, but thanks so much for not making me feel like the only one and a bit of an idiot to give this a try. I also have the wig ready and we will see how we get on. Jacky xx",
      "MessageIndex": 17,
      "PostDate": "30/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33201/the-wait-from-diagnosis-to-surgery",
      "Title": "The wait from diagnosis to surgery"
    },
    {
      "AuthorID": "Green Giant",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-giant",
      "Content": "Hi Mandy, All our thoughts are with you. It will be a tough time and I am glad that you are feeling calm now. Good news on the genetic testing front. Look after yourself and get all of the support you can from your friends and family. We are with you (in spirit) during your journey and look forward to hearing from you when you are ready. Jackyxxx",
      "MessageIndex": 16,
      "PostDate": "30/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33201/the-wait-from-diagnosis-to-surgery",
      "Title": "The wait from diagnosis to surgery"
    }
  ]
}