{
  "AuthorID": "Green forest",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-forest",
  "Posts": [
    {
      "AuthorID": "Green forest",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-forest",
      "Content": "Very useful info Carolyn28. Can you explain how a lightweight implant might be better for a smaller cup size? I'm a 36 large A/small B cup, even finding a post-surgery bra to fit was a challenge as almost all of them were way too big!  Hope your appt went well.",
      "MessageIndex": 17,
      "PostDate": "05/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108926/mastectomy-tug-flap-reconstruction",
      "Title": "Mastectomy & TUG flap reconstruction"
    },
    {
      "AuthorID": "Green forest",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-forest",
      "Content": "mk2016  Hi there, Have you had the surgery? I literally got home from a TUG flap reconstruction this week. If it helps: 1. This is MAJOR surgery. 6 hours in theatre, 36 hours on your back with a catheter and morphine drip, 2 surgery sites (if unilateral), at least 4-5 nights in hospital and obviously some damage to the thigh/leg. Don't underestimate how much this will take out of you, if you are not feeling all that great I'm not sure it's the best option. I have had lots of different surgeries over the years, but never anything that has side-swiped me as much as this one did. You can go for a mastectomy and implant (to preserve the skin) first if you're not feeling good, and then do TUG flap a year or two later.  2. There is not a 100% success rate. I think something like 20% of people have to have a 2nd round of surgery within the first few days, usually to correct blood supply issues. I was one of them. In my case I was one of the very unlucky ones and the flap failed. I am otherwise healthy and only had DCIS so hadn't been through any radiotherapy or chemo to weaken my system, and the flap looked great until suddenly it went purple on day 3, which is very late, I was due to go home in the morning, because the vein draining blood from the breast got blocked and they couldn't get it working again in time before the tissue started to die. So if you have this procedure done, check your own flap at any opportunity and ask for a nurse/doctor immediately if you have any concerns. I have complete trust in the surgeons who did the work, who came in at virtually no notice on a Sunday to spend 5 hours trying to save it, but didn't manage. I think I was the first TUG flap they've ever lost, so it was a disappointment for all of us. I cried all night following that surgery, not surprising I guess. So now I have a temporary skin stretcher in place, keeping the skin while I recover and try and see what I want to do next. At the moment I'm just grateful to be home, but I never wanted an implant, and am too slim for any other flap options, so really only have the option of trying this again with the other thigh, which I can't imagine doing anytime soon, or going flat. 3. There are after-effects. It is too early to say what they are in my case, but I still can't sit comfortably for more than an hour or so, and only when semi-reclined. The back of my donor site leg is numb and despite it being a week after the first surgery I am still on a lot of painkillers, have very little energy, and washing and going to the toilet are challenging. 4. This is really expensive, skilled and complex micro-surgery. I asked how much it would be to do privately and was quoted £20K. While I know we don't (and shouldn't have to) pay as end customers in the NHS, and I do believe we have to find the best option for each of us, it is worth knowing this as it is one of the reasons why it may be difficult to be referred to have this surgery. But, if there really is nothing else suitable for you, persist! I hear that TUG flaps do give quite convincing looking breasts, but there won't be much, if any feeling, and sadly I only saw mine without bandages for about 3 seconds - it did look sweet, I'm sorry it had to go. I don't mean to put anyone off, I would have made the same choice again in my case as I really didn't have any other options, but if you do have other options or are not feeling 100% then I'd suggest not making this choice lightly. Hope this is helpful, I don't mean to be negative, just honest about my experience. I'd really like to hear other people's experiences, as I've got to decide if I want to go through this again.",
      "MessageIndex": 15,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108926/mastectomy-tug-flap-reconstruction",
      "Title": "Mastectomy & TUG flap reconstruction"
    },
    {
      "AuthorID": "Green forest",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/green-forest",
      "Content": "Brilliant news Carolyn28 and thank you so much for trying to find this out for me (and I'm sure many others) - you really are a Community Champion!",
      "MessageIndex": 20,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108926/mastectomy-tug-flap-reconstruction",
      "Title": "Mastectomy & TUG flap reconstruction"
    }
  ]
}