{
  "AuthorID": "Grey Bird",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/grey-bird",
  "Posts": [{
    "AuthorID": "Grey Bird",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/grey-bird",
    "Content": "Hello Ladies, I have just joined this forum as I would like to thank those of you who have posted on here. It was a relief to come across your posts and to realise that what I have been going through and the emotions I have experienced are quite normal given the unexpected circumstances.  I was diagnosed with DCIS in December after a routine mammogram. I wasn't worried when I was recalled for more tests and so it came as a complete shock to me when I was given my diagnosis. I spent the first few days in utter denial and if I forgot about the diagnosis for one moment (which admittedly was hard to do), the moment I remembered it again it would hit me like a slap around the face.  I must admit I shed a lot of tears especially when I was on my own but I feel this helped me to try to come to terms with it.  I had another 9 day wait to find out if I had DCIS in another area of the same breast. This wait was particularly stressful but luckily I was told it was benign. But to my horror I was booked in to have a WLE only 6 days later and in the week before Christmas. This  was yet another shock and had me rushing around like a headless chicken trying to get things done before the op.  No time is a good time for this to happen to anyone but December does not seem to be a good month as it was hard to enthusiastic about Christmas and New Year's Eve and to remain positive for those around me despite how I felt inside. But the worst thing is that I now have a three week wait before I find out if the operation was successful..... I have only told a few close family and friends about my diagnosis and no one has heard of DCIS or can relate to it, which is why I have found this website and forum so useful. I realise many of you have had far worse experiences than me and have a tougher journey to follow and I admire you all for your strength and positive comments on here. But I am still distraught about my own diagnosis as it was such a shock given that I tend to be a healthy person and someone who is usually very much in control of her own destiny! I am worried the operation might not have been a success and that I will require another one. I am worried the DCIS will develop in another area and will lead to me having to have a mastectomy. I don't want to have radiotherapy or have to take medication with horrible side effects. But none of this appears to be in my control. Agh! I look back at the day of my diagnosis and it's strange to think that on that day my life changed in many respects and I am now on a new and rather frightening journey. It certainly is a roller coaster of a journey and not one I would wish on anyone. I wish every on here the best of luck and a healthy 2015.",
    "MessageIndex": 0,
    "PostDate": "05/01/2015",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87932/i-didn-t-see-this-coming",
    "Title": "I didn't see this coming!"
  }]
}