{
  "AuthorID": "hairworries",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
  "Posts": [
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "A big big virtual hug from me too. This year has been a nightmare for me from beginning to end, deaths, sick elderly mother rushed twice to hospital, fracturing my leg, probate to do all on my own...there's so much I can't list it all and on top of that I was still suffering devastating depression from a broken relationship. I've felt so alone and then just when I thought I'd reached the light at the end of the tunnel breast cancer came along. I'm sure stress had a major part to play in it and most medical staff have agreed with me on that, even though there is no scientific proof as yet.  The trouble is we fight to keep going, fight to be the strong one that helps everyone else, fight to stay positive, and in the end our bodies can't cope with it any more. So yes do feel sorry for yourself, you've every right to feel that way. Now it's time to try and relax a bit (which it sounds like you are doing) even though that may bring with it a period of depression and grief. I keep telling myself it's getting to the end of a very very bad year, the worst year I've ever known, but soon a new one starts and it can only get better. Good luck with the consultant, I sincerely hope it turns out to be nothing at all, but think of it as a signal telling you to let go of everything and relax and appreciate yourself. I myself have achieved a little in this drama. I've stopped staying up half the night and now go to bed as soon as I'm tired, I've stopped pushing myself to carry on when I feel enough is enough, and I'm gradually learning to stop stressing and take each day as it comes. Big big hugs",
      "MessageIndex": 3,
      "PostDate": "14/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85820/feeling-totally-demoralised",
      "Title": "Feeling Totally Demoralised!"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I had a grade 3 cancer (lymph nodes clear) which worried me beyond belief and it was suggested to me from the start that I might because of this need chemo. I was horrified, always having believed that if your lymph nodes were clear you wouldn't have to do it. But after surgery, and if you are HER2 negative but ER positive with no lymph node involvement, they usually do further tests so that the oncology team can make a decision on chemotherapy based on the likelihood of recurrence and how much this would be reduced by chemo. They will take into account your hormone receptiveness, HER2 status (which I assume is negative), Ki-67 status (that's a growth factor that can make it aggressive), your age and various other things. I got to see the oncologist a few weeks ago and was told that I fell right in the centre of the \"intermediate risk\" group, neither high risk nor low risk, and because of this the decision on chemo was up to me. They told me it wouldn't benefit me much (only 4% reduction of risk) and based on that I decided not to go ahead with it because the risks inherent in it would almost outweigh the benefits. I was surprised - I'd been expecting because it was grade 3 that I'd come out in the high risk group. So you never know...hopefully you too will be able to make your own decision. I'm determined to change my diet and lifestyle and hope that this will be as much benefit as chemo might have been. Having made my decision to refuse chemo I could then start on hormone tablets and so far (touch wood) I've had none of the awful side effects that other people mention. Radiotherapy will come a little later because my wounds aren't fully healed yet. Yes if you have chemo you will still have radiotherapy but not until afterwards. Good luck.",
      "MessageIndex": 13,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85008/treatment",
      "Title": "treatment"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I had to reply to this because I too was diagnosed with breast cancer almost exactly two years after my partner walked out to be with a younger woman. I have heard endless stories of similar things happening, or cancer developing after the death of a partner, and I'm sure it has something to do with the shock, the pain, the fear and emotions that are impossible to deal with. Outwardly I coped really well but inside I was in pieces. Your Mum is lucky to have all of you who care so much about her and my advice from my own experience would be to try and remove any pressures surrounding her although I'm sure you're already doing that. When I lost my partner I'd just had a mammogram which was completely clear and then somehow in the  next two years I got not only DCIS but DCIS that had already turned into an aggressive invasive cancer. It's a terrible shock and just when you're trying to pull your life together and see a light at the end of the tunnel along comes the next blow. Life can be cruel. I feel for your Mum so much, I've been there and know what it's like, and I feel for you too because it's painful to watch someone you love suffering so much. However the good news is the cancer is early and sounds as if it will be fully treatable. So the light at the tunnel may have got a bit further away but it's still there. I actually wanted a masectomy because I'd seen the wonderful photos of women who've had reconstructed breasts (google reconstruction and show your mum the results). I was in the end persuaded to have a lumpectomy with a reduction in size of both breasts so they matched, and I'm really really happy with the results. It won't make her less of a woman. Tell her to think of all the celebrities who have implants and how the men all lust after them! They may even be able to do the reconstruction at the same time as the masectomy. It will depend on the hospital and surgeon. The other thing I should mention is that I used to think a masectomy would prevent cancer coming back, but I was advised by my surgeon (a very well reputed one) that statistics prove it makes no difference whether you have a lumpectomy or masectomy. There are however some circumstances when you are better having the masectomy, certain types of cancer, if the lump is too large oomparative to your breast size etc etc. Her surgeon will be the best person to advise her. I know several women who've had breast cancer in the past and who are now living normal lives again and have found new men without any problems. As they get older men seem better able to understand these things and maybe also we learn through this to pick more compassionate men. But I do understand. I too was desperate to feel confident again after my partner left and to feel I was an attractive woman. Just when I thought I'd got there (literally the first two months when I felt I had my life back on track) along came surgery and breast cancer treatment. It is a huge setback, but it's only a setback and life will become good again. Keep you chin up. It must be really hard for you too. Life does go on and your mother will eventually recover and be happy once again.",
      "MessageIndex": 4,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85874/my-mum-is-unsure-what-op-to-have",
      "Title": "My mum is unsure what op to have"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Your mum may just be respecting your privacy and doesn't realise you've been told that she took the call. Mums can be funny like that! I remember when my grandmother got cancer in her 80s and my mother told me that she'd never said the word cancer so my mother didn't mention it either - thinking it was going along with what my grandmother wanted despite the fact they both knew about it. She nursed her at home with her for a couple of years and cancer was never discussed between them. My guess is your mother thinks it's your affair and she doesn't want to intrude unless you invite her. I know it's hard to believe but she might have been worrying inside but trying to carry on and appear normal in order not to frighten you. Don't be too disheartened, our parents come from another generations and often don't behave the way we expect.",
      "MessageIndex": 1,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84267/i-m-so-disappointed-in-my-mum-i-feel-so-lonely",
      "Title": "I'm so disappointed in my mum, I feel so lonely."
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Yummy. That makes me laugh! I used to be called the \"tomato girl\" until the age of about ten (obsessed by tomatoes) and then I became the \"potato girl\" from ten onwards. Roast, chipped and jacket - with huge lashings of cheese, butter or mayonnaise (all that's had to stop now). They're a bit boring without the butter but humous can do instead.",
      "MessageIndex": 22,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Is there anyone who can answer this? Tamoxifen stops oestrogen attaching to hormone receptors so presumably does that for all oestrogens whether they are from the ovaries, from converted androgens, or from your diet. However Letrozole is more effective even though it would appear to just stop the conversion of androgens. OK if you're post menopausal you aren't producing oestrogen from your ovaries any more. But what about the many oestrogens in food? Presumably because they aren't androgens Letrozole doesn't eliminate them and they remain as oestrogens in your system. Any ideas?",
      "MessageIndex": 0,
      "PostDate": "09/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85578/letrozole-and-oestrogens-in-food",
      "Title": "Letrozole and oestrogens in food"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I have to disagree here. If you have a highly oestrogen positive cancer why would you want to consume foods that are overloaded with oestrogen? It’s illogical. We’re given tablets to get rid of oestrogen so what’s the sense in then replenishing it via our diets? The medical profession agree oestrogen is a problem (whether it actually causes cancer or just accelerates it is a matter of debate) yet they rarely tell you to avoid products that are high in it. The lower rates in South East Asia are not a genetic thing - when South East Asian women move to the west and live western lifestyles they get the same amount of breast cancer. Breast cancer rates are increasing dramatically, more men are getting it, children are going through puberty at younger and younger ages, average cup sizes for young women have increased from an A or B to a D+ and whereas you used to only be able to get a 32 bra in an A or B it’s now available in all cup sizes up to a G cup. Look at what the medical profession list as the risk for cancer - they are all related to a high lifetime exposure to oestrogen. OK we can’t change what we did in the past but we can change the future. I also suspect that some of us can tolerate high oestrogen levels better than others, just as some people can eat nuts with no repercussions and others can’t. But if you’re 100% positive for oestrogen it’s telling you something. I know three friends who had oestrogen positive breast cancer (they are the only friends I have who have had it) and as well as taking tamoxifen they all switched to plant based diets and avoided dairy. It’s now 26 years, 21 years, and 12 years after their diagnoses and none have had recurrences. One of those friends was told she only had 12 months to live if she didn’t do chemo! Yes there are some dubious websites promoting stupid cures for cash but the majority of nutritional websites have no financial interests - and let us not forget that the big pharmaceutical interests have huge vested interests in finding cures that aren’t natural - how else would they make their money other than by producing hugely expensive drugs? I have read numerous books on the subject and numerous scientific articles and my overall conclusion is that cutting dairy is sensible even if it’s not a cure. Myself I have nothing else I can do for myself. I’m taking all the medical advice, but also using the alternative approach to modify my diet. I am 7 stone (never been any higher), exercise all the time, took the pill for one year only, never touched HRT. So why did I get a highly oestrogen positive cancer? The only things I can think of are diet, alcohol and stress. Probably cancer is caused by a mixture of things, but eliminating some of them can do no harm. Immediately I had my diagnosis I stopped all dairy products (I used to eat a lot of cheese and cream), also stopped all refined carbohydrates and sugars, all red meat, and all alcohol. I now eat 90% vegetables and fruit with a portion of fish every day. What’s the harm in trying? I also feel so much better for it. I sleep well and my whole metabolism has improved. For decades I’ve had blocked sinuses and the doctor has tried one thing after another but never mentioned dairy. I’d read about a connection on alternative websites but never took it seriously. Then within a week of cutting out dairy my sinuses cleared for the first time in ten years. The foods we eat do matter. On the question of chemotherapy they wouldn’t want you to change your diet because chemo acts of the fastest growing cells in our body - the last thing they’d want is to slow down those cells because then the chemo would be less effective. That’s why they don’t start you on oestrogen lowering drugs until after chemo is complete. My oncologist actually told me that. But that’s chemo - what you do after is up to you. Just for the record I have switched to organic unsweetened almond milk for my coffee - it tastes fine. I have no vested interests in nutrition or dietary advice, I am saying this only because I believe that changing diet is a small price to pay for removing some (if not all) of the risk. I don't find changing diet stressful - instead I find it helpful in the sense that it's something positive I can do for myself rather than just relying on other people.",
      "MessageIndex": 12,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "6 stone! Amazing. You're obviously a very determined and strong willed lady.  Well done.",
      "MessageIndex": 39,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "My understanding is that Letrozole is given to postmenopausal women because their ovaries are no longer producing oestrogen, however they still have oestrogen in their bodies because androgens (which don't originate from the ovaries) get converted to oestrogen and the Letrozole prevents this conversion.  They could equally take Tamoxifen and indeed used to but it's not as effective. So dependent on whether you are premenopausal or postmenopausal your oestrogen comes via different routes. I'm not an expert on this but this is just my understanding from what I've read.",
      "MessageIndex": 16,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Another worthwhile book that was recommended to me by a nutritionist and yoga teacher is \"The Definitive Guide to Thriving After Cancer\" by Dr. Lise N Alschuler who is a respected naturopathic oncologist and survivor of breast cancer. She talks about diet but also mentions a lot more.",
      "MessageIndex": 26,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Hi Katharine I can't answer that except that they say Letrozole is more effective than Tamoxifen. I myself don't fully understand why. Maybe Tamoxifen reduces oestrogen but not by 100%? Unfortunately I'm not a drugs expert. Yes of course theoretically our oestrogen is blocked by these drugs, but there will always come a time when we'll have to stop the drugs and since lifetime exposure seems to be the key my own feeling is that it's better to cut down on oestrogen now rather than later. Oestrogen positive cancers have a habit of coming back late in the day (my friend's mother had hers return after 20 years) and at the moment we can't take hormone therapy for more than five years. That may change because there are of course new drugs coming out all the time, but at present five years seems to be the limit. I don't for one minute think I know all the answers, only what gives me peace of mind. I'm sure others will disagree and they of course should do what brings them their own peace of mind.",
      "MessageIndex": 29,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "JuJuxx I will try your stir fry recipe. It certainly sounds delicious. Nice to know someone is following a similar diet to mine. We can but try!",
      "MessageIndex": 30,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Thanks for confirming that G&J. Interestingly I have no fat on me at all and I'm post menopausal, so I assume my oestrogen (100% positive for both oestrogen and progesterone) must be coming from food rather than from fat??? Interestingly I was allergic to cow’s milk as a toddler. We lived in Ireland at the time and my parents had to import soy milk for me. Eventually I was able to go back to cow’s milk. But yes it does definitely produce mucous (at least in some of us) and I only wish I’d taken the advice of nutritional sites and cut out dairy earlier. For anyone who’s interested cutting out certain foods wasn’t as hard as I thought it would be. And I’m someone who has always HATED salad and green vegetables! The secret is to shop online so you don’t have to walk past counters loaded with muffins, trifles, cheeses, yoghurts and confectionary. I’ve made my salads exciting by using lots of seeds and pulses, lots of herbs and spices, and a good dollop of the best extra virgin olive oil or flax oil. Mainly kale, radishes, cabbage, celery, red onions, tomatoes, peppers, chillies, red kidney beans and watercress or rocket. I also drink lots of organic beetroot juice and carrot juice which you can buy online from supermarkets - get it bottled rather than in plastic cartons. Breakfast is fruit, nuts and ground flaxseed. For lunch I usually make a large salad to have with fish or humous, but sometimes have homemade lentil soup, and then for supper I have stir fried vegetables (mostly courgettes, mushrooms, peppers, aubergines and onions) with wholemeal rice, a Kerala fish curry (mainly ginger turmeric and coconut milk), a jacket potato, or occasionally eggs.  Snacks are nuts, fruit or berries. Absolutely no white bread of pasta (wholemeal OK). Still having a bit of coffee (with almond milk) but have mainly switched to green tea. I haven’t felt hungry once! I’m lucky because I don’t have to cook for anyone else and admit it must be very much harder if you have to provide family food. Eating out can also be tricky, but I’ve allowed myself an occasional piece of cake if it’s a special occasion. Stopping alcohol is the hardest bit but I started this new regime ten weeks ago and it’s getting easier by the day. I’m not trying to make people feel they should follow what I’m doing, far from it, I’m just giving details for anyone who might like to try it. None of us know the answers or the cures. Pills and chemo aren’t 100% cures, restricted diets probably also aren’t, but I feel very positive because this is something that’s in my own hands and something I can focus on and do for myself. If it doesn’t help my cancer it will at least help my general health!",
      "MessageIndex": 20,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "An interesting article. Not new but I doubt much has changed. Make your own mind up. http://www.foodcomm.org.uk/articles/milk_oestrogen/",
      "MessageIndex": 37,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I had to take antibiotics for a dental infection a few weeks ago and (for the first time ever) the dentist told me to take probiotics during the course and for at least a week afterwards. Probiotic yoghurt was suggested but as I've cut out dairy I went to the local homeopathic chemist and got a probiotic supplement. I shall now always do this when prescribed antibiotics.",
      "MessageIndex": 1,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84848/any-extra-tips-re-oral-thrush-please",
      "Title": "Any extra tips re oral thrush, please."
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I think this is the ketogenic diet - if you search that you will find a lot on the internet. Its main aim is to reduce carbohydrates, especially refined carbohydrate, and lower sugar intake. Eat small amounts of good protein, use good fat ie olive oil, and when you do eat carboyhydrates make sure they are wholemeal and not refined. It has been used a lot to treat epilepsy and some people suggest it's also good for cancer. I'm actually incorporating large amounts of it into my dairy free diet. I'm up for trying anything!",
      "MessageIndex": 32,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "My comfort used to be going across the road and buying a large bar of Galaxy chocolate every evening to have with a glass of wine. Now it's a small bowl of strawberries, blueberries and nuts with a glass of beetroot and ginger. Not quite the same but the real drawback is it takes a bit of planning and it's more expensive. What I'd love most in the world is a large trifle or tiramisu, but I'll now only let myself touch things like that if I'm out and it's a special occasion. Don't tell yourself you can NEVER enjoy the things you like again and then it's not so hard.",
      "MessageIndex": 36,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Thanks for all your replies - it's a massive help and encourages me a bit that nobody lost disastrous amounts of hair. If I can keep a good percentage of mine it would allow me to eventually have extensions to bring back the length. Anniegirl1 you say you were also told your risk reduction was 5% which is what I was told mine would be with FEC (slightly less with CMF). Could I possibly ask you if you were given an IHC4 score or an Oncotype score. Mine was 14 on IHC4 but they haven't really clarified whether that score already allows for Letrazole/Tamoxifen and radiation or whether with those it will bring the risk down further. I guess that's about equivalent to a 23 on Oncotype. I am already equipped with suitable shampoo and conditioner because having had my hair treated with keratin to straighten it I have to use the purest of pure hair products already! Anyway good luck to all of you and many thanks. And Anniegirl I will think of you on Thursday and hope it all goes well - I'm sure it will.",
      "MessageIndex": 8,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84241/cmf-or-fec-with-a-cold-cap",
      "Title": "CMF OR FEC WITH A COLD CAP?"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Gembo28 my heart goes out to you. That must be so hard for you being a hairdresser. I have had extensions before when growing my hair but only ever 16 at the most and they didn't seem to cause a problem, however they obviously couldn't be done until after chemo was complete. There is also a system they have at the Lucinda Ellery salon in London where they can thread them onto a mesh through which they also pull what is left of your own hair. The drawback is it costs a bomb - but in my case I'd remortgage the house rather than face short hair. Silly I know, but that's just me! I'm also looking at going the alternative route ie no chemo but changing my diet and lifestyle. I've already completely cut out all dairy, sugars, refined carbohydrates, meats and alcohol and am drinking several pints of organic vegetable juices a day. I've been doing it for 6 weeks so far and I guess it'll have to be forever.  I know people that it's worked for, but that isn't to say it's a solution for everyone because everyone's cancers are different. I'm still on fence re chemo, but I gather it couldn't happen for another few weeks so I have a while to think about it.",
      "MessageIndex": 12,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84241/cmf-or-fec-with-a-cold-cap",
      "Title": "CMF OR FEC WITH A COLD CAP?"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I am borderline for whether or not chemo would be of any benefit and the choice has been left to me. I have said I will only go ahead with it if I can find a way of keeping most of my hair. The hospital suggest that if I went ahead they'd like to use FEC however I've heard cold caps don't work very well with that regime. They are also prepared to offer CMF but I don't know how that works re keeping hair. I'd really appreciate hearing from anyone who has used a cold cap on either of the above two regimes (or on e-CMF). Thank you.",
      "MessageIndex": 0,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84241/cmf-or-fec-with-a-cold-cap",
      "Title": "CMF OR FEC WITH A COLD CAP?"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Thanks Katharine. It's good to hear that someone has kept their hair through FEC. Can I ask you what dosage you were on and which cold caps you used  since I expect this makes a difference? I wouldn't be so worried about hair loss during treatment if it wasn't for the fact I've only had short hair once and looked dreadful - even the hairdressers all despaired of it because it was so kinky and curly it was impossible to style. It's now very long and the weight means I don't have to spend any time dealing with it. So if I lost my hair it would be 3 years minimum before I felt happy with it again. If went bald for the duration of the treatment but then could have my previous hair back within a few months it would be a different story! But I know many people who have gone through chemo and are happy with their new short hair, so I'm sure what you say is generally speaking true. I've also been told that chemo would only reduce my risk by 3 or 4% at the most so it's a hard decision. I'm sure if it reduced it by 10% or more I'd find the decision easier to make. Thank you again for your response",
      "MessageIndex": 3,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84241/cmf-or-fec-with-a-cold-cap",
      "Title": "CMF OR FEC WITH A COLD CAP?"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Thank you everyone. I saw the oncologist again last Friday and a decision was reached not to do chemo. CMF would only have reduced my risk by 1% and FEC by 4%, but as I'm very highly positive for both oestrogen and progesterone it's hoped the hormone therapy will be sufficient. The choice was mine but the consultant seemed to think it was a sensible decision and the risks and effects of chemo might have outweighed the tiny amount of benefit it would have given me. There's no way of telling whether or not it's the right decision, and even if I get a recurrence the chemo wouldn't necessarily have prevented it, so I just have to cross my fingers and get on with life. Good luck to everyone and your comments have been much appreciated.",
      "MessageIndex": 17,
      "PostDate": "20/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84241/cmf-or-fec-with-a-cold-cap",
      "Title": "CMF OR FEC WITH A COLD CAP?"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Thanks George and Jackie Yes I'm aware CMF isn't often used in the UK these days but reading online it seems to still be used in Canada and some parts of the US when less toxic chemo is appropriate. When I asked the oncologist about it they said they could do it although it's not their normal regime and their first preference would be FEC. They didn't seem to have heard of e-CMF (which from what I can gather is the same as FEC except the drugs are given separately and consequently it might avoid so much hair loss). Thanks again.",
      "MessageIndex": 4,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84241/cmf-or-fec-with-a-cold-cap",
      "Title": "CMF OR FEC WITH A COLD CAP?"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Hi Jessie I'm about two weeks ahead of you in this nightmare. Tumor 2.2cm, Grade 3, lymph node negative and clear margins - so very similar. I had a lumpectomy and am about to start hormone therapy with radiotherapy later. I had an IHC4 test to see if chemo would be of benefit and it only gave me a 4% risk reduction so it was left for me to choose whether or not to do it. I have chosen not to because it's not without its own risks and the  benefit to me would be small. Although very fit and healthy I am a bit older than you and I believe age can have something to do with the effectiveness of chemo. I think you need more information. What type of cancer is it? IDC or lobular? Why did they do a masectomy rather than a lumpectomy? Why would they do MRIs and CTs (I was told they were pointless for early stage ductal breast cancer). Are you HER2 positive or Triple Negative in which case chemo would be a must do? I was very highly positive for both oestrogen and progesterone which means the hormone therapy should be very effective for me. I was HER2 negative. Assuming you aren't HER2 positive or Triple Negative have they done an IHC4 test or an Oncotype test? Those would normally be done for early stage cancer that is ER positive and HER2 negative without lymph node involvement. The result should tell you how effective chemotherapy might be. Grade 3 is only one part of the equation and remember that when you read the statistics for grade 3 they include all stages and some much larger cancers. In order to make myself feel positive I followed nutritional advice and have now spent two months on a completely changed diet. I have totally cut out alcohol, all dairy produce, meat, all refined carboyhydrates and sugars. My diet is 95% raw plant food and nuts and seeds, with a little fish every day. I also drink two pints of organic vegetable juice every day and have given up my beloved coffee and instead drink endless cups of green tea. It may make no difference at all but there's no harm in trying and it gives me something positive to focus on. It was tough at first but now it's quite easy and I don't crave dairy and sugar any more. Good luck today. I will be keeping my fingers crossed for both you and myself!",
      "MessageIndex": 2,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84669/pathology-report",
      "Title": "Pathology report"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Hi everyone. Anne bks I'm very much in agreement with you about stress/shock. I've always been really healthy so I couldn't understand at all why I got breast cancer particularly as on all the normal parameters I come out as extremely low risk for it. The most frustrating part of the whole experience for me has been the lack of anyone who will sit down and talk properly about what MIGHT have caused it. I know nobody can know for sure, but we all have lots of questions in our heads and each person is different so I would have hoped somewhere along the line there was someone who would go through your individual history and at least throw possibilities at you. But no, I've only been able to discuss it for two or three minutes and the answer I always get is \"it's just one of those things\". It isn't just one of those things, something must have caused it to happen, and it would be nice to discuss it even if nobody can give you the answers. At least if we have an idea why (and it can only be an idea) it gives us a better chance of trying to make sure the same doesn't happen in the future. I tend to go along with the theory that everyone has potential cancers within them and they only become dangerous when our immune system is low and can't deal with them. Like you Anne I can only put mine down to extreme shock, distress and emotional pain - plus the ensuing anger. I've coped with normal stress all my life but this was completely over the top and left me having the shakes and panic attacks (which I'd never had before) for almost a year - more anger and shock than everyday stress. It also caused me to drink far more alcohol than I'd ever done before. I used to very rarely drink, but during the worst period I was drinking a bottle of wine every other night to calm myself down. The timing fits perfectly. But I haven't been able to find anyone who will discuss it or what effect it might have had on my physical health. I will look out the book you mention and see if it can offer any help. I got my GP to do a full blood test two weeks ago and it confirms I'm now at the optimum level for just about everything they test for. I've been told no action is needed on that score. I was lucky in that my lymph nodes were clear, however I know that isn't 100% foolproof and because it was an aggressive cancer I know there is still a risk and I need to take care. Part of the reason I turned down chemo was because I've only just come through a very black period and I thought that to put myself back in it and back in physical ill-health would be so stressful I wouldn't be able to cope. For two months I'd felt better and felt my life was back on track and then just when I thought I'd found the light at the end of the tunnel breast cancer hit. Great timing! However - and this is surprising - I feel I'm coping emotionally much better with cancer than I coped with the dramas I went through that probably caused it. I feel that I have a little control over the cancer, not much but some, whereas previously I was put into a situation where I had no control at all. Chloecat can I ask you who is arranging all your tests and MRIs? Is the hospital prepared to do them even though you have refused all conventional treatment? I assumed that if you refused to go along with their treatment plan at the hospital you would then be on your own, but maybe I'm wrong. Good luck to all of us who're trying to work on our overall health, whether we've declined all or some conventional treatment or not. If we can keep fit and healthy there's always hope that somewhere along the line more answers will appear.",
      "MessageIndex": 91,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Hi Chloecat I've only seen this thread today because I wasn't diagnosed until late August, however I do want to say how much I admire you and how much I hope it all works out for you. I had a larger mass (2cm) of IDC and although I believe very much in the alternative approach I felt I should first of all get that lump removed and then use alternative therapies to deal with anything left behind and the future. I'd always wanted smaller breasts (I'm skinny and tiny so was out of proportion) and the surgery didn't worry me in the slightest, in fact it was cosmetically a bonus because I now have two much smaller neater breasts. I was also lucky in that I had no pain at all afterwards and didn't even need paracetamol. I've also done weeks and weeks of research and read loads of scientific papers, consulted nutritionists and holistic therapy practitioners, much like you. It was the only thing that kept me going in the initial period and I felt learning was a positive thing to do. I've also asked questions all along the way and taken nothing for granted. I am on Letrozole (again no side effects) and MIGHT agree to radiotherapy, however I turned down chemotherapy for which I was a borderline case. My cancer is an aggressive grade 3 for which I was told chemo would normally be given, but the oncologists were happy for me to make my own decision and in the end agreed that the small benefit it might offer me was almost outweighed by the risks in the procedure. I said from the very start that under no circumstances did I want to do it and I've stuck with that. Cancer cells are probably present in most people, but what goes wrong is our immune systems and then the malignant cells that would normally be killed get a chance to grow and thrive. If we can get our immune systems working properly we should be able to put things right without chemotherapy, but I guess it's always dependent on how serious things are, how much spread there is, and our own ability to alter our lives. I too am on a really strict diet and haven't swayed from it. No dairy, no sugars, few carbohydrates, no alcohol, lots of supplements etc etc. I'm really lucky because I'm someone that has never had a problem controlling my appetite and what I eat. It's fairly easy for me but I accept that some people find it much harder. I suspect oncologists know that in a perfect world we should be able to use diet and simpler methods to stop the spread of cancer, but such methods aren't in their hands and they'd rather be sure of treatment than leave it to the individual - some of whom might follow advice to the letter and others who wouldn't and would therefore put themselves at risk. Having said that there is of course a risk to doing nothing, and to refusing chemo such as I did, but even chemo doesn't cure and can only delay so I personally think it's a risk worth taking. I'm just a few years older than you, but if I were much younger I guess I might be more inclined to go the conventional route. In my early 60s I don't want to lose any of the good time I have left knowing that it might take years before I can again do all the things I'd planned - and by then I might be too old. I shall be following your story and hoping it all works out. Stable is good because it gives you time to think and time for new treatments to be developed. Here's hoping that soon they find an effective cure that doesn't involve nearly killing yourself in order to get better.",
      "MessageIndex": 87,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Everybody is right in their own way. We're all individuals and some cope better with one route and some with another. Some of us want to know all the facts and to try to work it all out while others cope better by leaving that side to the oncologists so that they can get on with their lives and forget about it (as far as possible). Everyone should do what suits them best and makes them happiest because happiness plays a huge part in recovery. Undoubtedly genetics has a huge part to play in it. Some people are geneticially wired in such a way that they are to varying degrees vulnerable and others seem to be able to do just about anything and never get cancer. However I don't think genetics GIVES you cancer, it just makes you vulnerable or if you're lucky might protect you. My own belief is that cancer hits us for lots of different reasons, maybe toxins in the environment, maybe something we eat, maybe alcohol, maybe stress, maybe a virus - just about anything that our immune system is unable to cope with. Then because the immune system can't flush the faulty cells out they instead start multiplying and become malignant. If we can get our immune systems back on track with luck we might be able to undo the damage and put things right again - but like everything it's a MIGHT not a certainty. Having said that the same is also true for chemotherapy, there's no guarantee you will be cured by it (I know some that have and some that haven't) and there is a risk that something else could go wrong along the way. Both approaches take dedication, neither are easy, it's just some prefer one and some the other and we should be prepared to allow people to to make their own choices. Yes I've stopped the alcohol now. I stopped it the day of my diagnosis and haven't touched a single drop since. I've stopped all meat except organic chicken, all refined carboyhydrates, all sugars except natural sugar in fruit, all dairy... and how I'd love a piece of chocolate!!! The bonus is that my whole metabolism seems to be working much better. For ten years I'd suffered awful sinusitis which the doctor couldn't get rid of. It vanished within a week of stopping dairy. I've also had an awful problem with constipation for ten or more years, nothing seemed to solve it, not even lots of fibre. But when I cut out refined carbohydrates that too vanished and I'm now regular as clockwork. Something is working and that can only be beneficial even if it isn't 100% of the answer. I wouldn't tell anyone to follow the alternative route, but nor would I tell them to follow the conventional route. I think we should all be aware of both and make our own decisions on whether to follow one of them or combine them. I think Kenstar there IS an answer, it's just that for the time being it's hard to pinpoint. Hopefully sometime in the near future we will all have a better idea of how we got this horrible illness. Chloecat do you have any particular supplements you are taking? I'm taking quite a few and would be interested to compare notes. Good luck all of us",
      "MessageIndex": 97,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "Wow Chloecat that's a very long list - it must take you half the day to take them all! I shall look into them and maybe add some of them to my regimen. Interestingly you must live fairly near me because I would have been under the West Midd except that I opted to go up to town to the Royal Marsden instead. My list is much simpler: Vitamin D 4000iu Pure Fish Oil capsules (not fish liver oil) Letrozole Calcium 800mg Turmeric Selenium CoEnzyme Q10 Kelp Vitamin C (high dose) Pro-Biotic Capsules Zinc Aspirin Glucosamine (sometimes) I also drink a pint of organic beetroot juice a day and have two huge tablespoons of organic milled flaxseed. I use organic flaxseed oil for all dressings and virgin olive oil for any cooking, which isn't much because I'm on a mostly raw food diet. I shall now busy myself looking up all the others you take and may add some more although room in my fridge is running out fast! Thanks for the info.",
      "MessageIndex": 99,
      "PostDate": "26/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I live in South West London and was also worried about my two local hospitals due to experiences my mother has had at them and word of mouth. When I was diagnosed I asked specifically to be referred to the Royal Marsden in Chelsea. I was seen there within ten days of diagnosis and admitted for surgery about two weeks later. It's a wonderful hospital and so different from the others. Although it means I have to trek backwards and forwards by train (over an hour each way) I'm sure it was the right decision and I don't regret it. The travel actually keeps me busy and makes me feel I'm doing something! The fact they are a cancer hospital also gives me peace of mind.",
      "MessageIndex": 3,
      "PostDate": "20/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84618/recent-diagnosis-of-breast-cancer",
      "Title": "recent diagnosis of breast cancer"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I have been on 2.5 letrozole for a year and a half and wonder if anyone has tried lowering the dose or maybe skipping a couple of days each week. In the space of one year I have gone from far denser than average bones to the verge of osteoporosis - despite taking calcium and doing everything I'm told to do. I dread to think what will happen after a further four years. I don't want to take biphosphonates. I've also had a problem with retaining any fat on my body - I was thin to start off and have lost half a stone which I cannot put back on whatever I eat. The skin on my face arms and legs is now hanging loose from fat loss. It's making me look and feel 20 years older than I actually am. I've seen some sites on the net that suggest anything over 0.5mg significantly reduces oestrogen so surely it's possible to get away with a little less than 2.5mg.",
      "MessageIndex": 0,
      "PostDate": "05/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106203/lowering-letrozole-dose",
      "Title": "Lowering Letrozole dose?"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "My recent cancer was also very high and not where I would have expected to have one, and I suspect that not getting an answer is probably going to end up causing you more worry than getting an answer. Why do you have to go to your GP? Can you not make an appointment to go back to see your breast cancer team since your previous surgery was quite recent? That would at least speed things up. I know these things tend to happen at the very worst times. I'd just finished the most stressful six months of my life and gone on holiday to celebrate what I thought was the end of it all, and then I came home to an immediate diagnosis of breast cancer. I couldn't believe my luck. It's ghastly having yet more stress just when you least need it. But as I'm sure you know waiting and wondering is the worst bit, so get the answer you need quickly and then you may with luck find out there's no need to worry. Even if it does turn out to be cancer at least it's in the breast and it can therefore be dealt with easier than if it were elsewhere. Good luck and I hope it turns out to be nothing at all.",
      "MessageIndex": 3,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85395/i-m-feeling-scared",
      "Title": "I'm Feeling Scared"
    },
    {
      "AuthorID": "hairworries",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hairworries",
      "Content": "I was only diagnosed in late August but what you're describing is what I'm expecting to happen. When you're going through treatment there are a lot of people you see on a regular basis who are looking out for you, and you yourself have to concentrate on your routine and what's going on. But then afterwards? I imagine most people find it hard and have to go through a long period of adjustment. It's a bit like grief when someone close to you dies - at first you're in shock and busy trying to deal with it, but often it's long long afterwards that the depression begins and just when you're lest expecting it. Unfortunately friends rarely appreciate how it works and tend to think that you should bounce back just at the point you're probably feeling your worst. I doubt many people ever feel quite the same again, but as others have said one day a new you will emerge and life will be fun once more. You can't rush these things and mustn't put pressure on yourself, just take one day a time and maybe find a counsellor. If it gets really bad maybe your GP might consider prescribing you some antidepressants for a short time. I reluctantly had to have them a couple of years ago in a crisis and they did the trick. I didn't feel hugely different but they took the edge of things enough for me to get through a bad patch. Good luck.",
      "MessageIndex": 14,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85669/feeling-sad-and-angry-after-having-had-breast-cancer",
      "Title": "feeling sad and angry after having had breast cancer"
    }
  ]
}