{
  "AuthorID": "hammie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hammie",
  "Posts": [
    {
      "AuthorID": "hammie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hammie",
      "Content": "Thank you, it's reassuring although a little heartbreaking that there are so many people to talk to about this. I also didn't want anybody other than my husband and mother to know but unfortunately that wasn't the case. We each told our bosses because we thought that I would be having a MRI this week so would need time off, my uncles know because my mother can't hold her own water hahaha and the worst of all my 14 year old son found a letter, didn't tell me and then brokedown in school. I had to talk to his teachers and then sit him down and tell him everything is going to be ok. One good thing came from that situation though, I discovered he has a girlfriend haha! I'm not so scared about the results anymore, I'm just very impatient x",
      "MessageIndex": 3,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/173161/waiting-waiting-waiting",
      "Title": "Waiting, waiting, waiting"
    },
    {
      "AuthorID": "hammie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hammie",
      "Content": "Hello everyone I was told last Thursday that I have breast cancer although I have to wait until Monday for biopsy results. How certain can a doctor be in their diagnosis before results? I'm not going to beat myself up thinking that the results could be negative because I mentioned to the doctor that maybe it was benign and she shook her head and looked at me with utter remorse. The weekend past was filled with worry, panic and stress which I understand is all natural. I kept reliving my appointment at the breast clinic, remembering the look on everyone's faces as I was passed around for tests. I was completely unaware what was going on as my husband and 2 year old daughter waited outside. It wasn't until I was taken into a private room and asked if I wanted my husband to join me, that I knew this was maybe not as straight forward as expected.  I was told that I needed an MRI and that I would receive a phone call to arrange it, the BC nurse actually said that I will be getting a lot of various phone calls this week however I've not had a single one. This is just making the waiting even more annoying. I take it it's routine to get the MRI following a diagnosis, did everyone here have one? It's been a tough week, trying to buy Christmas presents, get the decorations up (still not done it), I accidentally cracked my sink beyond repair, my eldest sons bedroom door fell off (following my daughters coming off last month) and many other things have made me feel a little defeated. On Saturday we are all going for Christmas dinner with the in-laws (who are unaware of the situation) and I'm just hoping that I don't crack up. ROLL ON MONDAY!!!",
      "MessageIndex": 0,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/173161/waiting-waiting-waiting",
      "Title": "Waiting, waiting, waiting"
    },
    {
      "AuthorID": "hammie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hammie",
      "Content": "Hi again all, thank you for being so amazingly welcoming. I went for my biopsy results yesterday, it has been confirmed as cancer which is also in my lymph nodes. The lump is measuring at 3cm so I have a preliminary treatment plan (based on results of upcoming scans) of roughly 6 months of chemo and 12 months of Herceptin. I think the plan is to try and avoid a mastectomy. I have a CT and bone scan tomorrow, and a MRI on New year's eve. I'm feeling surprisingly ok about the whole thing. I have taken Christmas and new year off work just so I can enjoy myself before all the treatment starts. Any advice for the upcoming treatment would be amazing xx",
      "MessageIndex": 11,
      "PostDate": "18/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/173161/waiting-waiting-waiting",
      "Title": "Waiting, waiting, waiting"
    },
    {
      "AuthorID": "hammie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hammie",
      "Content": "Thank you Sarah I have more than likely misheard what the doctor said, I was too busy trying to swallow the lump that was rising in my throat, but I feel better knowing that it doesn't need to be done before Monday x",
      "MessageIndex": 4,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/173161/waiting-waiting-waiting",
      "Title": "Waiting, waiting, waiting"
    },
    {
      "AuthorID": "hammie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hammie",
      "Content": "That's very kind, thank you Sarah. I have been quietly stalking a lot of online support groups for the past few days, just reading peoples stories and reactions but it really helps. It is very comforting to see how many people have been in the same situation and are still fighting fit now. I hope you are ok, I appreciate your help x",
      "MessageIndex": 7,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/173161/waiting-waiting-waiting",
      "Title": "Waiting, waiting, waiting"
    }
  ]
}