{
  "AuthorID": "HannahL",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hannahl",
  "Posts": [{
    "AuthorID": "HannahL",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hannahl",
    "Content": "So on the 26th February 2014 I was diagnosed with a fibroadenoma which was told not to worry about and I didn't. I've had a follow up appointment on 18th July which they said I was fine too but just to safe they referred me to a genetic clinic to check my family history for cancer. Recently I got the paper work to fill in with my family history of cancer. Foolishly I thought it was just my mother who had breast cancer (who died in 2007 when I was 15 from it) but I discovered that my great auntie (my mum's aunt) and my great auntie's aunt (my mum's great-aunt) also had breast cancer. They both survived the cancer but I was not aware of this history. Although if I would get breast cancer this would make me the fourth generation in a row to get it. Clearly it's not a direct maternal link but they are all still blood related (as in none of them married into the family). Should I be worried? Physically I take after my dad where there is no clear pattern, but mentally and the way I act I am very much like my mum. Has anyone ever had any experience like this? Has anyone been in my place, what did you do? My great-aunt is the only person left on my mum's side that is still alive and that I can talk to about these things. Obviously I will still send off my paperwork and see what they have to say but I just needed to get this off my chest (no pun intended!). If I'm at risk they'll invite me for a screening, if not, they'll explain this to me and my own GP. Thanks all, Hannah",
    "MessageIndex": 0,
    "PostDate": "15/09/2014",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82838/discovered-a-family-history",
    "Title": "Discovered a family history"
  }]
}