{
  "AuthorID": "HannyC",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hannyc",
  "Posts": [
    {
      "AuthorID": "HannyC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hannyc",
      "Content": "Hi All I'm new to this community as my mother was only diagnosed with this recently. She had breast cancer approx 12 years ago which she recovered from. Then 5 years ago she was diagnosed with type 2 to the lymph node. She also recovered from that. A couple of months ago she experienced some worrying symptoms of confusion and inability to perform everyday tests which she was terrified was dementia however upon scans it revealed a large brain tumour towards the back of her brain. This was removed on 05.10.2018 and pathology results showed that this was metastatic breast cancer to the brain so she's stage 4. She was supposed to come out of hospital 3-5 days later after the operation but due to the rapid deterioration a week prior to the op and the scale of the op itself she can no longer walk or even sit up as her blood pressure drops dangerously low. She has been pronounced bed bound and 4 weeks after her op oncology have decided that she's not well enough for further treatment and has sent her home palliative with a live in a carer and a second carer coming in 4 times a day. She only has months left to live. Before all this suddenly happened she was in full time work with a company she has been with for years. She has been signed off sick until 28.12.2018 but her company do not yet know she is terminally and unable to work. My Mum is only 59 years old worked her whole life and will never get to enjoy her pension she has worked so hard to get. She also has a death in service with her work. Are we obliged to tell her employer she is at the end of life and unable to work or are we able to get another doctors note? Anyone had any previous experience with this can they legally dismiss her? Many thanks in advance. HannyC ",
      "MessageIndex": 0,
      "PostDate": "22/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172082/mum-diagnosed-with-secondary-breast-cancer-to-the-brain-what-do-we-do-about-work",
      "Title": "Mum diagnosed with Secondary Breast Cancer to the Brain, what do we..."
    },
    {
      "AuthorID": "HannyC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hannyc",
      "Content": "Thanks, I will give them a call. HannyC",
      "MessageIndex": 2,
      "PostDate": "22/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172082/mum-diagnosed-with-secondary-breast-cancer-to-the-brain-what-do-we-do-about-work",
      "Title": "Mum diagnosed with Secondary Breast Cancer to the Brain, what do we..."
    }
  ]
}