{
  "AuthorID": "Happibunny",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/happibunny",
  "Posts": [
    {
      "AuthorID": "Happibunny",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/happibunny",
      "Content": "Hi guys, Like everyone says, take your time, do your exercise, and look after yourself! My surgeon told me so e women stay off work for a few months, others a year, and other never go back to work. There are no hard and fast rules. I was initially scared to go out in crowds in case someone knocked into my scars and my reconstructed breast. People don't know what you have been through, you are just another shopper! Time will heal, and your confidence will return. I'm nearly five years post op, and still very protective of my surgery areas. I still have numbness under my arm and around my back. has anyone else noticed this? i don't think that worry will ever go away, but I did find that a well fitting wired bra helps give me confidence. Also, and i know this sounds daft, but if you are walking along with someone else, make sure they are on that side, and they will give you some protection. If you get a knock to your reconstructed breast you certainly know about it! Don't know if that helps, but pm me if you wish. Big hugs X",
      "MessageIndex": 20,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71581/feel-like-a-fraud-on-this-site",
      "Title": "Feel like a fraud on this site"
    },
    {
      "AuthorID": "Happibunny",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/happibunny",
      "Content": "We're all on difficult and challenging journeys to some degree or other. Don't play down what you have been through. It's all hard and that's why we've found each other on here for support. Jacky - have you looked at reconstruction? Is it an option for you? Big hugs X",
      "MessageIndex": 6,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71581/feel-like-a-fraud-on-this-site",
      "Title": "Feel like a fraud on this site"
    },
    {
      "AuthorID": "Happibunny",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/happibunny",
      "Content": "I had reconstruction back in 2009 followed by 7 weeks of rads. I'm really glad I had it done, and would recommend it if its what you want to do. I can wear whatever I want, and you can only tell I've had surgery by the fine scar around my back. I found it a lot to get my head around, and still do to some extent. I'd definitely go along to your meeting though and speak to others to understand what's involved. All the best. X",
      "MessageIndex": 10,
      "PostDate": "06/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71224/deciding-whether-to-have-reconstruction-or-not",
      "Title": "Deciding whether to have reconstruction or not"
    },
    {
      "AuthorID": "Happibunny",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/happibunny",
      "Content": "Hi Davinia, I had the cancer removed from my breast and the 'space' filled with saline solution for 2 weeks to keep the shape. I then had recon with the tissue being brought round from my back. They only found the cancer when i had a mam prior to an augmentation. I had an amazing surgeon who did the job, so I had recon on one side and augment on the other! I now have bigger boobs than before, and a cleavage for the first time in my life! You can't tell from the front and there is just a fine scar from under my arm to my spine. I'm happy to wear a bikini, or go braless! It is a lot to get your head around I must admit, but I'm so glad I had it done, and its given me more confidence in how i look. How i feel about it is sometimes a different matter. One breast is always cold, the other always warm. It's a funny feeling and sometimes you get strange sensations. I found that my strength in my arms and back were slightly affected which they are bound to be, after all, they are removing back tissue and putting it somewhere it wasn't designed to be. I'd do it again if I had to, but I know not everyone would. It depends on yourself. I'd love to live in France, I'm so jealous! Big hug X",
      "MessageIndex": 13,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71224/deciding-whether-to-have-reconstruction-or-not",
      "Title": "Deciding whether to have reconstruction or not"
    }
  ]
}