{
  "AuthorID": "hdsurvivor",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hdsurvivor",
  "Posts": [
    {
      "AuthorID": "hdsurvivor",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hdsurvivor",
      "Content": "Hello ladies, I wonder if there are any ladies out there with experience of implant exchange and that can help with my query? I had my implants exchanged ten days ago, from tear drop silicone implants to round silicone implants and wonder how soon I can wear 'normal bras'. I know that I had to wait around three months after the initial mastectomies and reconstruction surgery, but I was hoping that I wouldn't have to wait that long. I did buy two front opening post surgery bras but finding that is not enough with keeping up with the washing and rather than buy more of these I was hoping to get some nice new non-underwired bras and wonder how soon I can wear them. Can anyone help, please ?",
      "MessageIndex": 0,
      "PostDate": "26/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118752/bra-after-implant-exchange",
      "Title": "Bra after implant exchange"
    },
    {
      "AuthorID": "hdsurvivor",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hdsurvivor",
      "Content": "Hi Hayley I was diagnosed with a low grade papillary breast cancer in August and I had a bilateral masectomy a month ago. Biopsy of tissue also showed a 5cm area of DCIS (not picked up on mammogram or ultrasound). I am not having radiotherapy mainly as I have had mantle field radiotherapy many years ago for Hodgkins Lymphoma (the radiotherapy probably caused the BC), no chemo either-hooray. But like you I am taking tamoxifen. As I understand it not all breast tissue is removed, about 90-95% of it, so the tamoxifen is to minimise the risk of recurrence in the remaining tissue, chest wall etc. I haven't been told if I will be having regular MRI's, but would certainly be reassured if I was to have them. Wendy x",
      "MessageIndex": 1,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84220/dcis-mastectomy-but-no-radiotherapy",
      "Title": "DCIS, MASTECTOMY BUT NO RADIOTHERAPY????"
    },
    {
      "AuthorID": "hdsurvivor",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hdsurvivor",
      "Content": "Thank you HopeRu, I am sometimes quite impressed (and amazed) myself that I have survived 32 years and not going anywhere soon! My BC was rare(1-2%) papillary cancer and was non invasive hence no chemo required, I did however also have a large area (72 mm)of DCIS in the same breast as the tumour and it hadn't even shown up on the mammogram. I didn't have DIEP originally as I have had o lot of abdominal surgeries and it was ruled out at the time of my BC diagnosis, however I met with the plastic surgeon this week and he thinks it will be possible I just need a CT angiogram to check for blood supply, so fingers crossed I will be a suitable candidate. I was 51 at diagnosis so a little bit older than you, but still pre-menopausal.  I am glad you are happy with your surgery and will check out the link you have attached. Take care Hdsurvivor ( it was called Hodgkins Disease when I was diagnosed in 1985)",
      "MessageIndex": 7,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/35697/hodgkin-lymphoma-survivor-with-breast-cancer",
      "Title": "Hodgkin Lymphoma Survivor With Breast Cancer"
    },
    {
      "AuthorID": "hdsurvivor",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hdsurvivor",
      "Content": "Hi ladies, me too I had Hodgkins 32 years ago, treated with radiotherapy only. I was diagnosed with breast cancer in my right breast in 2014 and had a bilateral mastectomy with immediate reconstruction with strattice and implants, as I was told inevitable it would occur in other breast at some point. My implants contracted and were replaced 10 months ago, these are now not sitting right so I am going through the process to see if I can have DIEP now. My BC was not TN like the rest of you but highly hormone positive 8/8 oestrogen, 8/8 progesterone. I didn't have chemo either. It appears the risk for us ladies treated with radiotherapy for HL is much higher than they originally thought when we first got recalled for screening around 2003. Makes you wonder what other damage the radiation has done.",
      "MessageIndex": 5,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/35697/hodgkin-lymphoma-survivor-with-breast-cancer",
      "Title": "Hodgkin Lymphoma Survivor With Breast Cancer"
    }
  ]
}