{
  "AuthorID": "helen21",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helen21",
  "Posts": [
    {
      "AuthorID": "helen21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helen21",
      "Content": "Hi Sascha Rose, I fear that you are probably correct about going for the mastectomy now. My head is telling me to do it, but my fear says to go for the lesser surgery first (could well be before Christmas).  I am very confused and scared, but I went to the hospital today and met my consultant.  He seems to think that there is a very good chance of achieving a clear margin this time. This will be the last chance though as if this one margin is not clear this time I will have to have the mastectomy. He said because they can't see the LCIS (apparently grade 3 because of the way it is growing) they don't know where it is. I feel, probably like everyone else on here, that I have totally lost control of my life. I agree about the lymph nodes.  Just having two removed for testing was bad enough, I so hope I don't end up having to have any more removed.  Thanks for pointing that out though.  I am going to raise the question with my breast care nurse. I did ask her if I should go for the mastectomy now and she was very non committal. She said it has to be my decision.  At the time I couldn't think straight, this has only all come to light in the last 3 days. Do you mind me asking about your margins ? Why did you have margins if you had a mastectomy ? did you have a lumpectomy first  and then ended up with the mastectomy ?Please excuse my ignorance, I find it all so confusing and I need to understand the next move, although I am beginning to think that is impossible.        ",
      "MessageIndex": 3,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55771/mixed-lobular-and-ductal-carcinoma",
      "Title": "mixed Lobular and Ductal carcinoma"
    },
    {
      "AuthorID": "helen21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helen21",
      "Content": "Hi Karen, I need to get my head around the mastectomy, but it all seems so enormous. I'm a bit like you and don't really want to face it, or hear about it.  I'm going to have to really read up as much as I can.  I am on track for the re-excision (probably before Christmas). Three general anesthetics in about 7-8 weeks. My consultant is hopeful of success.   If the margin is still not clear then I face a mastectomy.  If I am prepared then It won't be so bad if it happens. Thank you for sending me good luck. 3rd time lucky. Fingers crossed. Helen",
      "MessageIndex": 5,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55771/mixed-lobular-and-ductal-carcinoma",
      "Title": "mixed Lobular and Ductal carcinoma"
    },
    {
      "AuthorID": "helen21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helen21",
      "Content": "Has anyone else had mixed Lobular and Ductal carcinoma ? I had a lumpectomy at the end of October. Scatterings had shown up on my MRI scan, but it was decided that my surgery should go ahead as planned.  The scatterings were minute and it was suggested that radiotherapy would probably clear them up after the surgery.  I understood that I had a grade 2 invasive Lobular tumour.  My lymph nodes were clear.  On reading up on Lobular cancer I have understood that it doesn't form a lump, but I had a hard lump that was easily felt.  Results of the lumpectomy showed that my margins were not clear and I have just been back for a re-excision of my margins.  Results of this show that they are now clear but one of them only by 1 mm and they recommend 2mm.  The scatterings were LCIS. I was told that I need to go back for a 3rd time to have one of the margins re done or  have a mastectomy.  I was in total shock as that was the first time a mastectomy has been mentioned in my case.  My breast care nurse took me to a side room to find out what my thoughts were on what I had been told,  but I truly didn't have any thoughts on it as I hadn't expected the results that I was given. Shock and desperation I suppose were my thoughts at the time and now 3 days later still shock and desperation. She asked me if I had been given copies of my treatment reports, which I hadn't, so she gave me copies of them.  On the first one it says sections show of an invasive mixed Lobular and Ductal carcinoma with extensive LCIS. The second one says the LCIS has a predominant pleamorphic pattern of growth.  I can find no mention of the 2 types mixed on the internet, only one or the other ie either Lobular or Ductal.  I was also told that radio therapy won't work on LCIS and neither does Chemotherapy, so it is important to remove all the LCIS that is present and hopefully acheive the clear margins. I am going tomorrow to sign consent forms.  If this isn't successful then I will be facing a mastectomy next.  What are others thoughts on this. I have a gnawing feeling that I am postponing the mastectomy by going for the re excision. I must admit that I also prefer the option of the lesser surgery first in the chance that it might be successful.  I feel like I am going round and round in circles and every time I go for results they are not the ones I want to hear. ",
      "MessageIndex": 0,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55771/mixed-lobular-and-ductal-carcinoma",
      "Title": "mixed Lobular and Ductal carcinoma"
    }
  ]
}