{
  "AuthorID": "HelenKP",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helenkp",
  "Posts": [
    {
      "AuthorID": "HelenKP",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helenkp",
      "Content": "Morning Joanne, so sorry to hear your news. I was diagnosed in March and now well in to my treatment. It is a very scary, surreal and isolating time when you are first diagnosed. The hospital will be able to give you more information after your operation. I'm assuming you have been given a breast care nurse, they are really good so please phone them if u need to. Also, use us, this site has helped me immensely even though I haven't posted that much. Good luck on Wednesday, I will have u in my thoughts xxxxx",
      "MessageIndex": 4,
      "PostDate": "07/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77840/really-scared",
      "Title": "Really scared"
    },
    {
      "AuthorID": "HelenKP",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helenkp",
      "Content": "Hi, I just had to reply to your post, it really touched a chord in me. Firstly, I'm so very sorry you are having such a tough time of it. I totally get where you are right now as my husband turned my life upside down last year too and for the first time in my life I have been literally broken. I've spent the last year having counselling and my husband and I are trying to save our marriage. He's completely broken my trust and I still feel betrayed by him, I was just starting to make progress when BAM, in March I got my diagnosis. So I'm now not just dealing with all my fears and get through my treatment but fighting to save my marriage too.  My husband too, is trying to mend the damage he has caused and sometimes I feel suffocated but.....he is trying to right the wrongs he has done. I've tried to be reflective....looking at the bigger picture and look at things that have been wrong for us both. If it is meant to be, then it will be. If things don't change and are not on an equal footing then there is nothing to build on because one party will always be resentful. You are not a horrible person at all, you just need to be honest and kind to yourself. You are fighting more than one battle here.  Good luck with your chemo, make sure to drink plenty of water and rest. I have my next chemo on 16th, it will be my 3rd so if u have any questions please feel free to ask.  Best wishes and hope this helps...if only a little  Helen xxxx",
      "MessageIndex": 3,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79197/where-do-i-go-from-here-part-two",
      "Title": "Where do I go from here, part two"
    },
    {
      "AuthorID": "HelenKP",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helenkp",
      "Content": "Hi Spammie, I know what you mean, my husband does the same to an extent. As you say, I am focusing on my health first. I too had always dealt with things on my own but I have reached out as I know I need the extra support now. It's helped a lot. I have seen all this as a time of reflection not anger, for the first time in my life I have truly looked inside myself. There's no rush, take your time and please know if u need a friend....I'm here :-) Good luck with your chemo, I'll be thinking of you on the 12th  Big hugs Helen xx",
      "MessageIndex": 9,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79197/where-do-i-go-from-here-part-two",
      "Title": "Where do I go from here, part two"
    },
    {
      "AuthorID": "HelenKP",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helenkp",
      "Content": "Good luck today Paul, we will all be thinking of you. Xxx",
      "MessageIndex": 4,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77583/thank-yuo-to-evertone",
      "Title": "thank yuo to evertone"
    }
  ]
}