{
  "AuthorID": "HelenaL",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helenal",
  "Posts": [
    {
      "AuthorID": "HelenaL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helenal",
      "Content": "Hi there, I currently study at De Montfort University in Leicester, Fashion Retail Buying. I have joined the online community in hope that i can gain some market research for my final year dissertation. I am basing this major project around the availability, affordability and desirability of Mastectomy Lingerie on the high street. The idea as corny as it sounds came from the heart; I feel it is an overlooked area of design within fashion. My personal view is that we all know how great good-fitting and stylish underwear can make a woman feel, so why does it seem impossible to find trendier styles within mastectomy lingerie/underwear for many women who want to regain that previous confidence and style with the necessary specialist support/fit. I am looking for women who have undergone mastectomy operations to give their down to earth, realistic and reliable answers. I have set up an online questionnaire for those of you who may wish to take part in my market research, it is so important for me to gain your honest insight and thoughts so that I may create a final range that is tailored to the majority specifications.   There are various retailing competitions that our dissertations can be entered in, and I truly hope that this concept will gain interest and support from the retailing industry. If it did, it could literally mean that there could be more choice, more style, better priced and more available mastectomy lingerie hitting the high street on a permanent basis. Fantastic!!!! If you are intrigued and would like to take part please click onto the following link, http://www.kwiksurveys.com?u=mastectomybra Your answers are gratefully recieved. Thank You for your time, and I hope you do not find my request for you views too intrusive as I understand this is a personal area of your life. Best Wishes, Helena Lindsay",
      "MessageIndex": 0,
      "PostDate": "11/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42341/mastectomy-lingerie-and-underwear-what-would-you-change",
      "Title": "Mastectomy Lingerie and Underwear! What would you change?"
    },
    {
      "AuthorID": "HelenaL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helenal",
      "Content": "I just want to say thankyou to those of you who have taken part so far, i have had a quick look at the answers so far and they are so honest and to the point, thank you so much. Keep them coming, Kind Regards, Helena x",
      "MessageIndex": 1,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42341/mastectomy-lingerie-and-underwear-what-would-you-change",
      "Title": "Mastectomy Lingerie and Underwear! What would you change?"
    }
  ]
}