{
  "AuthorID": "Helsbells78",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helsbells78",
  "Posts": [
    {
      "AuthorID": "Helsbells78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helsbells78",
      "Content": "I wasn't aware I could speak to someone, I haven't had much chance to explore the site much. But I may give that a try. I can't really go with my mam to her appointments, as I used all my annual leave up going to hospital every day when she was in the first time, and took some unpaid leave - I wish I could get some time off though because it would be very helpful to be able to go with her x",
      "MessageIndex": 4,
      "PostDate": "26/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56222/can-anyone-help-me-understand-my-mams-situation",
      "Title": "Can anyone help me understand my mams situation?"
    },
    {
      "AuthorID": "Helsbells78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helsbells78",
      "Content": "My mam has been poorly for a while, and hid it from us, she knew she had something on her breast, started as a mole or similar and grew rapidly, and she's been hiding a weeping wound for about 18 months. Earlier this year she seemed to have a long lasting chest infection. Wouldn't go t the doctor though (we now know this was because if they listened to her chest they'd have seen the dressings she was applying herself). She got worse, started to look yellow and had no energy, was always cold, and our of breath. We had a huge fight eventually because she was so stubborn about going to get checked out, and in August this year she went. Basically, she had been worrying so much about this wound that she ended up with stomach ulcers which were bleeding and her blood levels were dangerously low, which was the cause of the symptoms we had seen. But then they told us she had a lump in her breast, armpit and the wound was skin cancer. She had the lumps removed and the skin cancer and had a large skin graft. But, they discovered at her post op check up, another area of skin cancer, on the side of the breast. She has had a second op to remove this but it was just a small area about the size of a 10p coin so they didn't do a skin graft, this second op seems to have done her in, she's constantly in pain and can't move her arms much. She is starting radium in a couple of days but has also had another biopsy as they were worried about a small bit where the skin graft hasn't healed properly and got infected. They now want her to also go for an x ray - I don't know why, she said its standard procedure but she doesn't take these things in properly and also sometimes doesn't tell us the full story. It's very frustrating but I can't attend with her to these appointments. I don't even know wht stage the cancer was graded as. Does anyone know what this x ray would be for? I'm worried she's hiding stuff again xx",
      "MessageIndex": 0,
      "PostDate": "25/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56222/can-anyone-help-me-understand-my-mams-situation",
      "Title": "Can anyone help me understand my mams situation?"
    },
    {
      "AuthorID": "Helsbells78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/helsbells78",
      "Content": "Hi, thank you so much for replying. I know that attending a lymphodena clinic has been mentioned, and they did take something from under her arm yes, e skin graft was a large area that covered a lot of her breast and under the arm, the skin taken to graft onto the area was pretty much the whole of the top of her outer thigh. She is taking medication for the stomach ulcers still ( they were so bad she needed about 7 blood transfusions before she could have any surgery) and she says the tablets are making her ache but I'm not sure it is that as she has been on these all along and never had these aches and muscular problems until the second operation. I am just scared for her and not sure I am getting the full picture. It doesn't help that her consultant is not very nice either and not the most approachable person. Xx",
      "MessageIndex": 2,
      "PostDate": "26/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56222/can-anyone-help-me-understand-my-mams-situation",
      "Title": "Can anyone help me understand my mams situation?"
    }
  ]
}