{
  "AuthorID": "hestertingey",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hestertingey",
  "Posts": [
    {
      "AuthorID": "hestertingey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hestertingey",
      "Content": "Hi Angie I don't think that a lumpectomy and nodes and Fec-t  and rads is an easy ride at all!   I would not enter into any communication with this woman at all.  I would not photocopy notes or anything.  it is she who has the problem, not you.   I would keep in contact with the man, as he sounds ok.  If he chooses to believe her sad crap, then dump him though.   I think everyone on here has experienced this type of thing!  I asked one lady (whose daughter I took riding for free every weekend for two or three years!!!!)  if her daughter might be free during the summer to just visit/groom the ponies a couple of times while I was in hospital and do you know what she said? She said;   'I don't want to commit.'   it does actually really feel like a blow.  i think the chemo makes us extra sensitive too.  the whole experience does. i got to an MRI once and I was late due to having waited in the wrong area for ages, like two hours!!  the receptionist told me off, saying I had messed up their whole schedule for the day.  Do you know, I started to cry and did not stop crying for the rest of the day! But we have to remember IT IS THEIR PROBLEM.  Take a deep breath, do something lovely for yourself, remember we are all here for you, and we all know what it is like.  The woman in question just has not got a f***ing clue what it is like, and sounds like a complete thicko.  So really best not to waste another single second on her ridiculous views!!!! Spend all your time nurturing your self to recover from treatment.  Lots of good food, and breathing and walking.  Then you will have zero time for saddos!!!!!   Sending good vibes your way!!! and virtual hugs.  ",
      "MessageIndex": 1,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53572/accused-of-making-it-up",
      "Title": "Accused of making it up"
    },
    {
      "AuthorID": "hestertingey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hestertingey",
      "Content": "Hi Terrauk, I this this is not the problem with this site.   Some sites definitely do have unfriendly people trying to hurt others, but so far on this site (ie Macmillan cancer support) I have only encountered kindness and a genuine desire to help.",
      "MessageIndex": 5,
      "PostDate": "23/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53572/accused-of-making-it-up",
      "Title": "Accused of making it up"
    },
    {
      "AuthorID": "hestertingey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hestertingey",
      "Content": "Hi Lady Muck, I like swearing too, especially when it is necessary. Don't expect to feel worse.  Node clearance is not that bad, certainly not as major as mx.  i had both mx and nodes done at the same time and hardly noticed the underarm scar and suffered no pain.  just a bit of numbness and tingling, both of which are improving greatly four weeks later. Chemo sounds awful, but it is not as awful as you think.  I had mine before the op.  3 x docetaxyl and then 3x FEC.  the docetaxyl gave me painful feet for two days and some shivers and flu type feelings til around day five.  after that i led a normal-ish life each time.  the FEC made me nauseous for around eight days, but i did manage to eat and the anti-sickness did work quite well.  The first FEC i had did make me have low white blood count and knocked out my estrogen which made me feel depressed for about ten days.  (very unusual for me so a bit of a shock.)  for the next two FECs they gave me mini injections to take home, which helped boost the blood count and i did not get the depression with them. i guess one big positive in your case is that the tumours were small, and two nodes is not many.  you can feel really happy about that, because your chances of metastasis are then smaller. The four months seemed to go by very quickly.  It was not as bad or as long as i had feared.  I took lots of advice from this site and blogged about it all, which helped.  (if you are interested, it is called 'the breast blog in the world.' !) i started tamoxifen a week ago, and so far have noticed nothing, apart from maybe a little mood slump.  i am due to start Herceptin in a week's time.  people say the effects are not that bad.  i am hoping they are not. Once you have got the op out the way, I am sure you will feel better.   I met quite a few lovely people when i went to chemo.  it is helpful to see the chemo not as poison but as clear sparkly lovely medicine which is fighting the cancer along with you.  i became quite a chemo convert in the end. felt very cleaned out and fresh!  and there are lots of perks to it all.  and many blogs to read about it.  chemobabe is one that i liked.  and 'the perks of having cancer.' Really hope that everything goes well for you.  Best of luck ",
      "MessageIndex": 4,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53229/got-some-bad-news-today",
      "Title": "Got some bad news today"
    },
    {
      "AuthorID": "hestertingey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hestertingey",
      "Content": "Hi, I suffered total body aches as soon as the steroids wore off, day three and four, then bad foot pain (plantar syndrome) day five and six.  managed to get codeine prescription from doctor which helped a bit.   the main thing which has helped is a constitutional remedy from a homeopath.  for me this is carcinosen 200.  for you it might be a different remedy.   Drinking a lot of water to flush it all out also seemed to help the second time i had T.  Generally from day six things got better, and week two and three were almost symptom-free.   i have been told to eat before chemo and to drink water during and after.   i still have FEC to go, so if you have any tips on that one, please say!  thanks.",
      "MessageIndex": 3,
      "PostDate": "25/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49332/pain-after-having-chemo",
      "Title": "Pain after having chemo"
    }
  ]
}