{
  "AuthorID": "Holmlea",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/holmlea",
  "Posts": [
    {
      "AuthorID": "Holmlea",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/holmlea",
      "Content": "Hi I am due to have bilateral mastectomy with immediate reconstruction at the end of the month. This is being done in one operation and expected to take approx 10 hours. Maybe ask him to reconsider",
      "MessageIndex": 1,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66002/bilateral-mx---they-want-to-do-two-operations-instead-of-one",
      "Title": "BILATERAL MX - THEY WANT TO DO TWO OPERATIONS INSTEAD OF ONE"
    },
    {
      "AuthorID": "Holmlea",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/holmlea",
      "Content": "Hi, I had a bilateral DIEP 3 weeks ago & although Im pleased with the breast recon but I have two huge lumps under my arms. Makes me feel like the michelin man. The BC nurse says this is normal but I really hate it & want to know if there is a light at the end of the tunnel & assure me that this swelling will go down. Please help",
      "MessageIndex": 0,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67394/diep-surgery",
      "Title": "DIEP surgery"
    },
    {
      "AuthorID": "Holmlea",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/holmlea",
      "Content": "Thank you both for your replies. I'm having difficulty finding a bra to fit as I'm having to buy a larger size cup to go over the lumps and are baggy at the front. Do you have this problem too? Julie",
      "MessageIndex": 3,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67394/diep-surgery",
      "Title": "DIEP surgery"
    },
    {
      "AuthorID": "Holmlea",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/holmlea",
      "Content": "Hi No it's not a seroma. It is part of the formed breast. The best way I can describe is when women become really obese they get a roll of fat under their arm joining into their breasts. It has gone down a little but is still hard & swollen. It is very difficult to get a bra to fit as I have to get a bigger cup size to go over the lumps. The surgeon has said they will go down. I think Im just impatient. Im really pleased with the actual breasts. Im seeing my surgeon again this week for my abdominal surgery & will ask her again about the lumps. If you want any more info or would like to see some pictures of my surgery ( I am 4 weeks post op) please do a friend request & I would be happy to help. Best wishes Julie",
      "MessageIndex": 5,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67394/diep-surgery",
      "Title": "DIEP surgery"
    },
    {
      "AuthorID": "Holmlea",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/holmlea",
      "Content": "Hi I had a bilateral DIEP immediate reconstruction 30th Oct 2013. I am really pleased with the results. The first 2 days are painful especially getting in and out of bed but by day 3 I was doing it alone. I dont think it was anymore painful than my ceasarian. The most overwhelming thing for me was that having gone through chemo, 4 nodes removed and then surgery, on day 3 it suddenly dawned on me that the cancer had finally been removed. I did have a quiet tear or two in the bathroom. I would recommend that post surgery, if you feel tired, rest. I refused to do so during chemo but really needed to have a lie down for an hour in the afternoons after surgery. I have completed my exercises religiously as I was quite suprised as to how pathetic my arm movement was, and if it was not for the horrible joint pain caused by Anastrazole, I would now be feeling fantastic. I manage to workout for 45-60 mins a day to lose the weight gained by chemo and the bonus of such an op is my incredibly flat stomach. My new boobs are starting to feel part of me but do still feel 'a bit stuck on'. All in all, a big op, but a big result - no feeling of a loss of boobs or feeling a lesser person as you wake up with a new 'set'! - but that might be just my pragmatic approach. I wish you luck whatever you choose Julie",
      "MessageIndex": 18,
      "PostDate": "29/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70913/breast-reconstruction",
      "Title": "Breast reconstruction"
    },
    {
      "AuthorID": "Holmlea",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/holmlea",
      "Content": "Hi Sharon Im 44 and It was an easy decision for me as I did not want implants. Although the operation is very medically 'hi tech', on the receiving end, it's pretty straight forward. I had a drain in each boob and both sides of my abdomen. All were removed before discharge. Just make sure that you do your arm exercises, even if it's just for a couple of minutes. I must say, that's it is only in the last couple of weeks that I have increased my times for exercise as the Anastrazole had crippled me since November, it is finally starting to feel easier and I want want to make the most of my super flat tummy !! You will manage just fine alone. But be kind to yourself and rest when your body tells you to. Make sure you buy some 'hold in' pants as you need to wear these for a few months. I got mine from M&S. You also need to wear a gross 'old lady' bra to help form your boob shape for 3-6 months. They are vile but do the trick! Julie",
      "MessageIndex": 21,
      "PostDate": "29/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70913/breast-reconstruction",
      "Title": "Breast reconstruction"
    }
  ]
}