{
  "AuthorID": "Hopeforthefuture",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
  "Posts": [
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": " Hi there - I totally understand how you are feeling as that was me a couple of months ago.  I started counselling at the start of my fourth round of chemo as I was going onto Taxotare and was pretty scared. Talking to her has made such a difference and has helped me through each stage of treatment and finally to helping me get back to work after 10 months. It took a few weeks after the final chemo to start to feel better and I then had surgery to remove the lymph nodes on my right side.  Now I feel really well and at times find it hard to believe that I've been on a roller coaster but that it has now finally stopped and I can start planning for the New Year and becoming a grandmother at Christmas. Life does get better, take things slowly, exercise and live well.   All the best for the future. Michelle X",
      "MessageIndex": 4,
      "PostDate": "21/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118472/moving-on-counselling",
      "Title": "Moving on, counselling?"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Hi Lou - I have just queried this with my Breast Care Nurse as Dr's suggested I have it but to check first.  BCN said as long as I had finished chemo it was safe to have it.  I start radiotherapy tomorrow but all ok to have flu jab.  I would just check to make sure.  Michelle X",
      "MessageIndex": 3,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115445/flu-jabs",
      "Title": "Flu jabs?"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Hi there - I too am a young 50 year old who struggled with the decision to have full node clearance after cancer was found after central node biopsy in January when I had surgery to remove tumour.  There was no evidence on ultrasound so this was a bit of a shock for me.  I too do not want lymphodema or the problems that come with it.  However do I want the risk of the other nodes being cancerous and spreading to the lymphatic system - I wouldn't know unless they were removed and checked.  I've had chemo - not great and 2 weeks ago I had full node clearance and am recovering well.  I had the all clear on Tuesday - 12 nodes were removed and no cancer was found - such a relief.  I was guided by my consultant and my breast care nurse who have been brilliant. I did not want the surgery but I had to give myself, my family and my unborn granddaughter the best outcome I could to beat the disease.  I had to do everything I could to give me the chance to enjoy life beyond cancer.  My journey is not complete as I have radiotherapy for 4 weeks starting in September but I've got through the worst of it and starting to look beyond treatment.  The decision to have surgery was difficult but it's done and I have to live with and deal with what comes along. Everyone is different but do what you feel is right for you. Michelle x",
      "MessageIndex": 7,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113867/i-dont-want-a-total-axial-node-clearance---what-are-my-options",
      "Title": "I dont want a Total Axial Node Clearance - what are my options?"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Hi there - I finished rads on the 26th October and am feeling really well - some tenderness to the area that was blasted but moisturising and used the cream given to me at hospital - all good.  I've also been off work since January and looking forward to returning to my job - albeit different to when I left - my choice - this year has made me re-evaluate everything so less stress is the order of the day.  Do you feel like it's a bit of a dream and is it ok to feel well and almost like did it really happen to me? Wishing you all the very best for the future. Michelle x",
      "MessageIndex": 3,
      "PostDate": "06/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117599/radiotherapy---week-3-of-3",
      "Title": "Radiotherapy - week 3 of 3"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Hi there - I have a PICC line and most of the time it is ok but a few days after it was put in I had an ache in my arm and pins and needles in my hand.  I rang the chemo 24 hour helpline and was asked to go in. They were sure it was a clot so had an ultrasound and confirmed there was a small clot at the entry point of the line. I'm now injecting daily with Fragmin to break any clots. As I said most of the time it's ok but this week I've had a dull pain that won't go away in my left arm - left it for a few days thinking it would go away - it didn't - trip to A&E, ultrasound yesterday to ensure no more clots - there weren't.  The thought of yet another visit to hospital I am sure puts us all off ringing the helpline but we must so always best to get it checked out and it can be sorted.  Hope you get the re-assurance you need that all is ok if not it can be sorted - its just another part of the chemo journey unfortunately. Take care and let us know how you get on. Michelle X",
      "MessageIndex": 6,
      "PostDate": "08/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111562/why-is-my-picc-a-pain",
      "Title": "Why is my PICC a Pain...???"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Hi Val - I felt exactly the same as you on Tuesday when I started radiotherapy and I too have very little hair but I can say I didn't even know I'd had treatment - it was done and over with very quickly.  The technicians are lovely and really look after you - is nothing like chemo - so far so good - just do as they say with moisturising the area and drink plenty of water.  I'm a bit tired but that's because I'm going in to hospital for 8am and haven't been surfacing much before 9.30 - 10am!!  My hair is growing back quite quickly - but I hated the wig and didn't get on with the bandana I bought so have ditched both and go without - apart from this morning when it was raining and cold and wore a cap!! You will be fine and this part of treatment is so much easier than chemo.  Good luck for tomorrow.  Michelle x",
      "MessageIndex": 5,
      "PostDate": "29/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115593/radiotherapy-hair-is-growing",
      "Title": "Radiotherapy. Hair is growing"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Thank you G n' J - have a great Christmas too! The support on here the past year has helped me get through the most difficult time in my life - thank you and all the lovely members on here - a special family  - Michelle xx",
      "MessageIndex": 2,
      "PostDate": "23/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120156/merry-christmas-everyone",
      "Title": "Merry Christmas Everyone :)"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Hi - I had a lumpectomy in January and still have a green mark on my boob too.  It is fading and surgeon said it would eventually go - it's the dye used in the procedure as you said.  Not something that can be rubbed off unfortunately !!  Take care. Michelle X",
      "MessageIndex": 1,
      "PostDate": "09/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111626/green-boob",
      "Title": "Green boob!"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Lost my hair but now growing back albeit grey and fluffy! I'm 3 weeks post chemo.  Eyebrows just growing back and they are very black still a bit sparse though.  My nails have been the best they have been for ages a little bit discoloured but intact luckily.  A few eyelashes on each eye but are taking ages to come back.  I'm just grateful that everything is starting to re-grow and that chemo, its effects and how I felt are starting to fade.  Wishing everyone well on their journey wherever they are on it. Hang in there. Michelle X",
      "MessageIndex": 6,
      "PostDate": "24/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113802/eyebrows-eyelashes-and-lizard-feet",
      "Title": "eyebrows, eyelashes and lizard feet"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Hi Flopsyuk - thank you for replying.  I can't seem to get a definitive answer about this - it might be the chemo but more likely an infection - although all tests have been negative! Oh so many questions and I'm worried too about op - but we'll get there.   Thanks again.  Michelle x",
      "MessageIndex": 3,
      "PostDate": "09/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113106/chemo-side-effects-once-chemo-finished",
      "Title": "Chemo side effects once chemo finished"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Thanks Lynn - hoping it will go away but with op looming it's hard to get my head around things. X",
      "MessageIndex": 4,
      "PostDate": "09/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113106/chemo-side-effects-once-chemo-finished",
      "Title": "Chemo side effects once chemo finished"
    },
    {
      "AuthorID": "Hopeforthefuture",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hopeforthefuture",
      "Content": "Hi there - has anyone suffered with bladder problems after they finished chemo? I have had cystitis/water infection symptoms just before I started Tax which never quite clears up.  Oncologist asked me not to take any over the counter medicines until chemo finished.  I've been to the Drs and had several samples sent off and they've all been clear of infection!  It's very frustrating and uncomfortable - I'm also due surgery on Friday to have node clearance and want to be as well as possible and infection free!  Sorry to waffle on.  Michelle x",
      "MessageIndex": 0,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113106/chemo-side-effects-once-chemo-finished",
      "Title": "Chemo side effects once chemo finished"
    }
  ]
}