{
  "AuthorID": "Hurricane",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hurricane",
  "Posts": [
    {
      "AuthorID": "Hurricane",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hurricane",
      "Content": "Signed  x",
      "MessageIndex": 16,
      "PostDate": "03/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120669/petition-the-government-to-continue-kadcyla-for-breast-cancer-patients---sign-please",
      "Title": "petition the government to continue Kadcyla for breast cancer patients..."
    },
    {
      "AuthorID": "Hurricane",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hurricane",
      "Content": "Hi Fiddlesticks I'm similar to you with one slightly smaller and scarred.  I have bought 2 or 3 M & S mastectomy bras and they fit really well and are available in some pretty colours.  My local branch never seems to have my size in but you can order online and have them delivered free of charge to your local store.  Just picked up a pretty pink and black and pink pair today. Sharon x",
      "MessageIndex": 3,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113017/bras---rant",
      "Title": "Bras - rant!!!!"
    },
    {
      "AuthorID": "Hurricane",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hurricane",
      "Content": "My Oncolgist said that it can be harmful if you have too much calcium (something to do with your kidneys I think or may have been Liver) - so much information and chemo brain at the time!  She prescribed Adcal-D3 whilst I was having chemo, then stopped these and I am now on Colecalciferol D3 1,000 unit tablets.  I have 6 monthly infusions of Zolendronic Acid for the next 2 years (that will be 3 in total) and was told a bone density scan was not required as my calcium levels were OK and the Zolendronic Acid would negate the need for a scan.  I'm 62 and on Letrozole.  Hope that helps. Sharon x",
      "MessageIndex": 22,
      "PostDate": "26/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117039/dexa-scan",
      "Title": "Dexa scan"
    },
    {
      "AuthorID": "Hurricane",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/hurricane",
      "Content": "You're certainly not crazy.  I'm the same age as you Isingbass- diagnosed in January this year and decided to retire at the end of September - I too am on Letrozole. I loved my job but it was extremely busy and stressful, although well paid.  I was worried about retiring, financially and emotionally.  However, I now know it was the right thing to do.  I have much more time to do things that I want to do.  My husband is retired so we can spend time together, I can visit friends and family and don't have to fit everything in at the weekends. Life is a lot less stressful and although the loss of my salary is a bit of a blow, you soon learn to adapt and take pleasure in simple things.  My work colleagues have been so supportive and I meet up with them for coffee and cake and the odd evening out.  I can't believe how quickly I have adapted to retirement and although we may be poorer, I feel my life has been enriched. I hope this helps. Sharon x",
      "MessageIndex": 4,
      "PostDate": "29/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120419/retiring-but-scared",
      "Title": "Retiring but scared..."
    }
  ]
}