{
  "AuthorID": "InTheStorm",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
  "Posts": [
    {
      "AuthorID": "InTheStorm",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
      "Content": "No one has mentioned this to me either.  I have my chemo given on the other side but have had bloods and blood pressure on my SLNB side.",
      "MessageIndex": 7,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143365/sentinel-lymph-node-biopsy",
      "Title": "Sentinel lymph node biopsy"
    },
    {
      "AuthorID": "InTheStorm",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
      "Content": "Hi Claire Did you manage to get your chemo delayed ? I had my 3rd on Tuesday and I'm feeling ok but really tired. Next one is due in the New Year but I'm half way through. Yah !   I can now look forward to Christmas and my sister has very kindly invited us to hers so I don't have the hassle.",
      "MessageIndex": 20,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141840/first-ec-down-but-proper-fed-up",
      "Title": "First EC down but proper fed up"
    },
    {
      "AuthorID": "InTheStorm",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
      "Content": "Haven't posted for a while but I've done it. Had my 6th and final EC. Now resting at home and trying to avoid the colds and sickness bug everyone seems to have. If I manage to escape them my experience wasn't nearly as bad as I feared. I've had all 6 via cannula in one hand with no problem. My veins are fine and look normal though my arm is a little tight if I straighten it. This usually eases after a few days. The first cycle was a learning curve but by 2 and 3 I had the nausea, heartburn and constipation under control with help from my CNS. My hospital give everyone Corsodyl mouthwash from the off so I haven't had a sore mouth or ulcers. The fatigue really built up as I expected and I barely recovered from cycle 5 before it was time for 6. But I now have 4 weeks  before I see the oncologist and sort out my radiotherapy. But chemo is over. There were tears.",
      "MessageIndex": 23,
      "PostDate": "14/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141840/first-ec-down-but-proper-fed-up",
      "Title": "First EC down but proper fed up"
    },
    {
      "AuthorID": "InTheStorm",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
      "Content": "And well done to you too Badgerset. Hope the rest of your recovery goes smoothly. Even though we haven't encountered any major problems with chemo it's still a tough old thing to go through. Should also say the longer chemo went on the more I've embraced my baldness. I have lots of hats, scarves and a wig but I'm now comfortable sitting in my local or a restaurant without them. I've got to kind of like it ! Also my weight is pretty much as it was before chemo. I haven't been as active but my appetite isn't what it was. My meals have been healthy but smaller and I haven't felt the urge to snack.",
      "MessageIndex": 25,
      "PostDate": "14/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141840/first-ec-down-but-proper-fed-up",
      "Title": "First EC down but proper fed up"
    },
    {
      "AuthorID": "InTheStorm",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
      "Content": "How you doing ?  I've had a good week. Felt my usual self and been out to lunch with friends and to the pub with my family, visited my parents and done a bit of Christmas shopping.  I'm losing my hair fast but I'm cool with that. I have an appointment on Monday about a wig but not sure I'll wear it much. I've got got lots of lovely hats. Cycle 2 on Tuesday.",
      "MessageIndex": 17,
      "PostDate": "18/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141840/first-ec-down-but-proper-fed-up",
      "Title": "First EC down but proper fed up"
    },
    {
      "AuthorID": "InTheStorm",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
      "Content": "I'm so pleased you were able to enjoy the birthday and have your nights out. I know it helps me mentally if I can get out, have fun and be 'normal'. And it makes facing the next chemo a little easier as I know I won't feel crap forever.  Sorry to hear about your veins. Is that the chemo that has caused it ?  It'll be weird me not cooking this Christmas but I'll probably be helping my sister in the kitchen and enjoying a few glasses of wine. Then we have a meal out before New Year. My New Year will be very quiet as I'm at the hospital early on 1st for bloods but you'll be able to really enjoy it !",
      "MessageIndex": 22,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141840/first-ec-down-but-proper-fed-up",
      "Title": "First EC down but proper fed up"
    },
    {
      "AuthorID": "InTheStorm",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
      "Content": "Hi Claire  I had  a WLE and SLNB in September which went very well but the Oncotype DX came back with a high score which was a huge shock as chemo had never been mentioned until then. I had my first of 6 cycles of EC on 31st October so we are on this journey together. First night I was nauseous and had heartburn but it cleared the next day. By far the worst thing so far has been the constipation. I'd done the right things - lots of water, diet. - but day 6 was awful. Cramps like labour pains and vomiting.  When I see the Oncologist before my next cycle I'm going to request preventative laxative !",
      "MessageIndex": 5,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141840/first-ec-down-but-proper-fed-up",
      "Title": "First EC down but proper fed up"
    },
    {
      "AuthorID": "InTheStorm",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/inthestorm",
      "Content": "I think the vomiting was probably down to the fact I'd just eaten before the cramps started. I'm feeling ok now. Bit tired and my legs are heavy and a little achy today but I've had the last of the injections this morning. I had a headache the day after chemo but managed to sort it with paracetamol fortunately. My tumour was small and the WLE had clear margins and the nodes were clear. The consultant had discussed radiotherapy when I was diagnosed but it was only later that he told me about the Oncotype DX test and chemo was first mentioned when I got the result. Must be very hard for you with a young family. Mine are grown up now and there's just me and OH at home. We are muddling through together. Be nice if you and I get a bit of 'normal' time now before round 2 !",
      "MessageIndex": 8,
      "PostDate": "08/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141840/first-ec-down-but-proper-fed-up",
      "Title": "First EC down but proper fed up"
    }
  ]
}