{
  "AuthorID": "IslandGirl58",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
  "Posts": [
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Bijou So - I was at a dog show today and meeting up with many of my friends who hav'nt seen me since BC ( before cancer ). Mostly the conversations went like this : \" gosh you look well how are you doing ?, how are you feeling ? \"  to which I replied without fail \" I'm fine, feeling great, doing well ....\" None of which is true and in my head I just wanted to scream that I'm scared witless and am indescribably angry at the way my Cancer has robbed me of my old life. I play the same game with my family and even my wonderful husband, trying to protect them from the truth. What is this disease that requires us to be positive all the time so that we can 'fight' it effectively ?. Why do I feel that I need to support those I care for by hiding the truth ?. Even when my Oncologist or BC nurse asks how I am, I automatically reply with a chirpy upbeat response - why ?. You could've been me talking.  I'm fine is really a cop out isn't it?  Let's them all off the hook nicely, but that's what we all do.  It's also what everyone wants to hear and is probably all they can deal with anyway. I say it all the time and am so far from fine. I accept that I am lucky to have had my cancer caught early and 'only' needed a mastectomy and Letrozole.  In everyone's eyes now it's all over and in the past.  Of course as many here have said what lies ahead is constant fear of a return or something there that was missed. It feels as though life will never be normal or relaxed again.  I am resolved to get counselling simply to be able to express feelings that I have (up to this post) suppressed even to the point of not being able to think about them myself. I think we should all get counselling as a matter of course in our situation.  I can get it but need to ask.",
      "MessageIndex": 33,
      "PostDate": "03/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115646/why",
      "Title": "Why ?"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "If it's any help Kerry, I had immediate reconstruction with my mastectomy.  I had an implant.  The surgeon said he was happy to do this as he thought it unlikely I would need radio and as it turned out I didn't.  I too had inductal and invasive mixture with no lymph node involvement. I even got to keep my own nipple and the neatest of scars down the side of my breast.  To be honest the surgery was a breeze but you will need to be patient for your recovery and be careful to follow advice.  Do not do too much too soon.  Good luck",
      "MessageIndex": 10,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123419/immediate-reconstruction-or-staged",
      "Title": "Immediate reconstruction or staged?"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "I went back to work part time last November and full time from January.  I was surprised by how exhausting it was so would advise not asking too much of yourself too quickly.  There's a danger that our colleagues see us now fully recovered and back to how we were before the moment we go back.  Especially if we look like we have two boobs and hair. I know I minimised it to everyone who asked after my welfare which in a way helps them but not me. You may be encouraged to know that apart from my aches from Letrozole I am fully back in the saddle now and not feeling the tiredness and brain fog I used to. It's not easy at first but it's great to have something to occupy your mind other than the disease and treatment.  Be patient with yourself and I know you will get there. Just don't take on too much too soon. xxxx",
      "MessageIndex": 3,
      "PostDate": "06/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128266/back-to-work-anxiety",
      "Title": "Back to work anxiety"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "An enforced reduction in your hours due to your cancer would surely be discrimination under the Equality Act 2010 under the protected characteristic of Disabilty?  Check this out with your union.  A reasonable adjustment would be a decent phased return.  If you then decide that you want to permanently reduce your hours then that's another matter. It being convenient for your boss to give you a schedule for a whole year and thereby reduce your pay is not reasonable.  You should be honest with them about how you feel or they may think they are helping you.",
      "MessageIndex": 14,
      "PostDate": "07/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128266/back-to-work-anxiety",
      "Title": "Back to work anxiety"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Like everyone says there are no set limits but it can't be indefinite. They would need to see that there was a reasonable prospect of you getting back to full time.  If they did run out of time they should also consider whether they could offer you a part-time role. I work for a government agency and am going back to work (on Letrozole) tomorrow on a return to work schedule that is to be discussed with me when I go in.  My OH reduced me to tears by saying that medically she could only recommend a 4 week plan.  There's no way that will work!  I am exhausted everyday even after a full nghts sleep.  I would say a very slow increase in hours over 8 weeks is more realistic.  The OH wanted me to start on 16 hrs per week which sounded a lot. However my boss can do a local arrangement different from what the OH said and has told me that she doesn't want me to go back to sick leave and will make sure I get the right schedule to avoid that. When I used to be in HR the unpublished limit for return to work plans was 3 months but we wouldn't expect that limit to be reached in any other than serious cases.  When that limit was reached we would start to think about dismissal on medical inefficiency grounds (with compensation) or medical retirement. A lot of my issue is confidence and so I plan to try it and see how it goes. It sounds like your boss is trying their best but your plan does not sound very gradual.",
      "MessageIndex": 6,
      "PostDate": "14/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118083/how-long-can-i-stay-on-a-phased-return-reduced-duties",
      "Title": "How long can I stay on a phased return/reduced duties?"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "I am shocked that you were made to use annual leave.  That is contrary to civil service rules (local government rules are very similar) that we go by where I work.  Annual leave is there for normal rest and recuperation from work and not for recovery and convalescence from illness.  Neither should you lose it at the end of the year if you haven't been able to take it through no fault of your own.  Your illness will be covered by the Equality Act as a disability (previously covered by the disability discrimination Act) and they should be conscious of that in their dealings with you. Do you have a grievance procedure or union you can go to for support? They also failed to get advice from OH?! The whole thing is disgusting and I would guess contrary to nearly all their own procedures. Sorry rant over.  I hope you start getting treated much better by them or find a better employer who knows what they're doing.",
      "MessageIndex": 7,
      "PostDate": "14/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118083/how-long-can-i-stay-on-a-phased-return-reduced-duties",
      "Title": "How long can I stay on a phased return/reduced duties?"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "I am using bio-oil on my mastectomy scar and agree with what someone else said that the massaging action does good too.",
      "MessageIndex": 3,
      "PostDate": "29/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117245/stopping-scars-from-drying-out",
      "Title": "Stopping Scars From Drying Out"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "I'm in Dorset and was told I would have a DXA scan as a baseline against which they could then measure any changes.  I had one about a month after starting on Letrozole.  It only took ten minutes and was told there and then that it was normal and that I would have another scan in two years.  As it's only a simple 10 mins I wonder how a waiting list could be a year long?",
      "MessageIndex": 10,
      "PostDate": "25/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117039/dexa-scan",
      "Title": "Dexa scan"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "QI'm sure everyone is different but I can only tell you of my experience.  Last August I had a mastectomy and immediate reconstruction with implant. The anaesthetist gave me a nerve blocker that apparently lasts for quite a while.  I can honestly say that the pain was minimal.  I was given a post surgery bra which they put me in immediately after or rather while I was coming around from the op! I left hospital with 1 drain in which was taken out after 5 days.  I didn't have radio or chemo.  I started to drive again after 6 weeks but know others have done so sooner.  I was strolling down to the local cafe after about a week but got tired quickly and moved very gingerly protecting my op side.  Was terrified of knocking it!   As others say you must follow the exercises religiously if you want to get back that full movement nice and quickly.  Also follow advice on bra wearing 24/7.  It helps to reduce swelling and keeps everything where it should be when you're healing. All in all, surgerywise I have had a lot worse experiences - a shoulder impingement op about 18 months earlier was agony! I now have a discreet scar down the side of my boob that can't be seen if I wear a bra or swimsuit. 3 months post op I was sitting in a hot tub with my hubby and a bottle of red thinking I'd not done badly. Xx. Good luck.",
      "MessageIndex": 7,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124908/pre-mastectomy-and-implant-recon-nerves",
      "Title": "Pre-mastectomy and implant recon nerves"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Sounds a bit vague of them.  I was given an Anita bra which was quite tight but was meant to be.  I was told to wear it 24/7 (allowing to take off to wash it if I replaced it with a sports bra).  This rule was relaxed after about 5/6 weeks post op when I was told I could now go down to sports bras but not the high impact ones that bind you too tight.  It just needs to be supportive and not wired.",
      "MessageIndex": 7,
      "PostDate": "29/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117250/which-bra-after-surgery",
      "Title": "Which bra after surgery?"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "I know exactly where you are right now as I was in a similar position.  I felt I should've been grateful that after my mastectomy there was no lymph node involvement, no chemo, no radiation just hormone therapy.  Why did I constantly feel on the verge of tears?  I found a solution in counselling through my bc nurse.  I didn't think I had anything to talk about but she couldn't shut me up!  Did me a world of good.  Also I wasn't doing well with my tablets but found a different brand reduced the side effects.  I would advise talking to your bc nurse.  Xxxxx",
      "MessageIndex": 29,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131657/just-feel-like-crying-all-the-time",
      "Title": "Just feel like crying all the time"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "You're welcome.  Good luck.  I'm sure you will feel better before too long. Xx",
      "MessageIndex": 32,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131657/just-feel-like-crying-all-the-time",
      "Title": "Just feel like crying all the time"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Just to say that it's not a given that you would need further aspiration after the drains come out.  I had a single drain after my mastectomy.  It really was just an inconvenience to have to go home with it in.  They removed it after 5 days and while I did have a short lived sensation of fluid sloshing around in there I didn't require any further attention to it and the yucky sensation eventually disappeared. Just remember that often it is the things that go wrong or are a problem that end up being discussed here.  When it goes smoothly there's little to say.  I hope that your surgery goes a smoothly as mine went and don't forget to allow yourself loads of recovery and convalescence time.",
      "MessageIndex": 7,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118000/just-diagnosed---any-advice-please",
      "Title": "Just diagnosed - any advice please?"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "I had it on the NHS about a year ago (Dorset).  Not had any problems with it.  I sometimes can feel something a bit alien in there if I move in a certain way but not often and never painful.  Normally it feels no different to my other breast but the skin over it remains numb in the most part.  That's nothing to do with the implant though.  Be prepared for several weeks of fluid even after the drain is out.  A weird sloshing sensation but it does go eventually.  I am happy that especially with a bra on my breasts look natural and no-one could tell.  I even have a cleavage  Good luck with what ever you have x",
      "MessageIndex": 13,
      "PostDate": "28/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136582/strattice-reconstruction",
      "Title": "Strattice reconstruction?"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "[/quote][quote user=\"Snowys Mum\"] Mine is the same 0.3 at 5 years and 0.8 at ten years. I take a quarter of a Letrozole a day Really?!  I thought there was just one dose.  Fed up with the fatigue, constipation, forgetfulness and stiff joints.  Will discuss this at my next appointment!",
      "MessageIndex": 15,
      "PostDate": "16/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119724/predict",
      "Title": "Predict"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "This is something I hadn't heard of.  Have been on Letrozole for 7 months and have thought my eye sight was off.  Hope just reading this doesn't fuel my imagination but I also had the grit in your eyes thing.  Will get it checked out. Thank you all",
      "MessageIndex": 4,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124866/letrazole-and-cataracts",
      "Title": "Letrazole and cataracts"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "That's strange as my local Boots offered me some but I didn't want it!?",
      "MessageIndex": 16,
      "PostDate": "13/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140486/sandoz-letrozole---boots-unable-to-supply",
      "Title": "Sandoz Letrozole - Boots unable to supply"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "I had similar problems over the brand of Letrozole that my local Boots would supply.  Was told they couldn't get it etc. I complained to their HQ and like magic they supplied it.",
      "MessageIndex": 4,
      "PostDate": "22/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140486/sandoz-letrozole---boots-unable-to-supply",
      "Title": "Sandoz Letrozole - Boots unable to supply"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "I have myself to blame really.  I had a mastectomy and reconstruction and am on Letrozole for 5-10 yrs.  no chemo and no radio.  To stop people keep talking to me as if I'm dying I kept saying I'm fine/really lucky etc. I know that compared to many i am lucky it was caught so early.  However now people act as if it was nothing.  Well it wasn't and still isn't.  People will always say all the wrong things but in the main they mean well and just struggling with what to say.......with they exception of that anaesthetist! There's not a single person on this planet who has any idea unless they've been through it and even then everyone is different.   Here's one.  Was told by a female registrar as she cupped my breasts assessing them pre mastectomy \"you have nice breasts \"  nice to know when they're about to cut one off!",
      "MessageIndex": 15,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122931/your-cancer-wasn-t-bad-then",
      "Title": "Your cancer wasn't bad then...."
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Am getting my mastectomy and reconstruction at the end of this month.  Have hitched a lift on the advice here so thanks to everyone!  The hospital did say that they will give me a bra to use at first but thereafter I presume I will need the front fastening etc for quite a while.   Unlike Nicky my boobs had started the long journey south so I will have one pert and one droopy!  They did say though that once it has settled down they may be able to give my remaining boob a lift which is comforting.  Not that looks are the primary concern right now but know that they might be in time. Love and hugs to all here Sarah xx",
      "MessageIndex": 9,
      "PostDate": "13/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113183/post-mastectomy-bra",
      "Title": "Post-mastectomy bra"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Interested to hear you call CIPLA a baddie.  I am struggling with fatigue, aching legs and digestive problems on it.  Does Femara have less side effects?  I am at the beginning of what feels will be a b***** long 5-10 years.",
      "MessageIndex": 4,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121818/what-brand-of-letrozole",
      "Title": "What brand of letrozole"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "From my own experience, yes Letrozole can definitely do this.  I found a different brand helped a lot.  I was seriously thinking I couldn't do my job anymore because of the memory loss and sort of brain fuzz including forgetting words and names.  It's at least worth a try. ",
      "MessageIndex": 5,
      "PostDate": "25/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132351/is-letrozole-really-to-blame",
      "Title": "is letrozole really to blame"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Me too. Mastectomy and immediate reconstruction 6 months ago. Not a chance of anyone noticing with a bra on.  Just as you say a little more perky than its mate.  Hardly give it a thought these days.  It's the Letrozole tablets I hate! Xx",
      "MessageIndex": 2,
      "PostDate": "04/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124362/qustion-re-high-grade-dcis",
      "Title": "Qustion re High Grade DCIS"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Sounds a bit like my experience.  I'm not qualified but can tell you what I was told.  The calcification can be a sign of cancer but is not cancer in itself and can also just be a sign of ageing.  In my case it was a very early cancer and I'm glad that they followed this early sign and I just needed surgery followed by tablets.  No chemo or radio.  I think that they get suspicious if it's concentrated in one area.  I didn't even have a lump that anyone could detect, it was that early.  It was the calcification that gave it away.",
      "MessageIndex": 5,
      "PostDate": "28/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132559/calcium-in-breast",
      "Title": "Calcium in breast"
    },
    {
      "AuthorID": "IslandGirl58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islandgirl58",
      "Content": "Have the same problem with Letrozole.  Boots said they couldn't get my old brand anymore.  Strangely after an email stating my case to their hq the local branch phoned me to tell me that they are sorry and have ordered in 6 months supply for me!",
      "MessageIndex": 3,
      "PostDate": "15/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121376/different-manufacturer-of-anastrozole",
      "Title": "Different manufacturer of anastrozole"
    }
  ]
}