{
  "AuthorID": "Islanikita",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islanikita",
  "Posts": [
    {
      "AuthorID": "Islanikita",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islanikita",
      "Content": "I was diagnosed with breast cancer in May this year. I am 49 years old, married with 2 daughters aged 15 and 10.  My treatment involved having chemo first (Fec-t every 3 weeks for 6 sessions) then a mastectomy then radiotherapy. My last chemo session was on 19th September. I had my mastectomy on 8th November and my radiotherapy is scheduled to start on 12th December all being well. During the last stages of chemo I realised I was not coping with the thought of the mastectomy. It was not the fact of losing a breast but more that I felt it would look totally stupid having no breast one side and a large one the other side. I am a 36 H. I kept trying to explain that is wasn't what other people would think, because with a prostheses they wouldn't know, it was about how I would feel about myself. I wear fantasie bras as they are one of the only companies that do pretty bras in larger cup sizes however because these are underwired I cant wear them post op for a while.  I searched online prior to my surgery for a mastectomy bra. Most companies did not go up to my size at all and any I found that did the choice was limited and the bras looked like what your 90 year old grannie would wear. I ended up in a lingerie shop in my local town with a very experienced owner. She found one mastectomy bra in my size but the fit was not good so I ended up with a normal bra, not as pretty as my normal bras but acceptable and confortable. (I have been told that I can use normal bras and just get a pocket sewn in). Unfortunately the result of the mastectomy is everything I feared. The next trauma was the softie. My breast care nurse gave me two whilst I was in hospital but when I got round to trying it out a week after surgery I was distraught. Even after putting all the stuffing from one softie into the other it was still too small. I saw my breast care nurse yesterday and she brought along the two largest softies available. We ended up with the largest one with some extra stuffing in. It is still not quite right but a lot better than the previous one and I think it probably does look okay and people will not know I am wearing a softie. With the lack of bras and softies (my breast care nurse has also said we may have to go to a couple of different companies for my prosthesis ) I feel like I am being made to feel like a complete freak for having larger breasts. It is bad enough going through this breast cancer lark without being made to feel like this. It is humiliating. I feel abnormal. Emotionally the mastectomy is the worst bit for me. I want to scream every time people keep telling me \"you have done the worst bit with the chemo\". Yes chemo is awful but you do recovery from it, your hair grows back. With the mastectomy you are left deformed. You have a constant reminder every minute of every day that you have cancer. Yes I know reconstruction is an option which I will take but that doesn`t help how I feel now. Any confidence I did have has now been totally destroyed. I have never particularly liked my body or my breasts and this makes me feel that people must of always looked at me and thought I had horribly big breasts, so now trying to face people with a softie is going to be so much harder. Are there any other larger breasted ladies out there who feel the same or had similar experiences?",
      "MessageIndex": 0,
      "PostDate": "18/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118320/made-to-feel-like-a-freak-because-i-am-larger-breasted",
      "Title": "Made to feel like a freak because I am larger breasted"
    },
    {
      "AuthorID": "Islanikita",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/islanikita",
      "Content": "Hi ronstar Thank you for your message.  Your suggestions have really helped. just looked at the replies to your fed up with bra shopping post and that has also helped.  I am having counselling which I set up a few weeks ago when I realised I was struggling. She is great and is helping but I have also arranged to see a counsellor at the hospital that deals with cancer patients so is specialised in cancer issues.  My friend who went through treatment for breast cancer last year came over a few days after my surgery.  She also had a mastectomy. Her words were \"but now the cancer has been taken away\". This really hit me and I have realised that I don't think I have ever accepted that I have cancer. It is a weird one to describe but because you are not ill before being diagnosed it does not feel real. when I was told I had cancer I kept thinking once I start chemo it will feel real but it didn't.  Also although you feel really ill for a week or two after chemo you have that good week where you feel ok and look good before the next session.  I thought once i started losing my hair it would feel real but again it didn't.  I thought when I had the mastectomy it would feel real but it doesn't.  I almost feel it would of been better if I had felt ill before being diagnosed then I would feel all this treatment would be justified.  When I tried explaining this to my husband he said how could I say I haven't been ill when I ended up in a & e twice during chemo. I said that wasn't the cancer that made me ill it was the treatment.  This is probably why I am struggling so much with the mastectomy.  Hope this makes sense. ",
      "MessageIndex": 10,
      "PostDate": "19/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118320/made-to-feel-like-a-freak-because-i-am-larger-breasted",
      "Title": "Made to feel like a freak because I am larger breasted"
    }
  ]
}