{
  "AuthorID": "J4N",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/j4n",
  "Posts": [
    {
      "AuthorID": "J4N",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/j4n",
      "Content": "All I can say is that it's like pulling a sticking plaster off, the telling people you love ❤️ , a seconds grief and then you will be surrounded with support.....",
      "MessageIndex": 33,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134879/advice-with-reconstruction-implants-verus-diep",
      "Title": "Advice with reconstruction: implants verus DIEP"
    },
    {
      "AuthorID": "J4N",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/j4n",
      "Content": "Hi, my implant was supposed to be under the transferred back muscle but as soon as I woke it felt 'wrong'. That's the only way I can describe it. I kept saying that something felt wrong but was told I just had to get used to it. After a few weeks, on a follow up appt, the surgeon said my implant had 'pushed' the muscle aside. It felt uncomfortable, red hot and swollen and where the nipple was taken burst open. This was an open wound for a month. I could see the implant poking out of my body. Even the Macmillan nurse looked shocked. I kept saying that something was badly wrong, as if my body was squeezing it out, as I felt so ill with it. It was badly infected and after 6+ weeks of feeling really sick they suggested I have the implant out but not to worry as it would be put back within 3 mths when the area had healed. This sounded like a wise move. I woke with a drain in, when the dressings came off the area had sunk inwards to my ribs. When I asked about scheduling to have the implant replaced I was absolutely stunned to be casually told they couldn't put it back. As if I had imagined the conversation when signing the consent form. I felt cheated, am disfigured and struggle to cope some days.  Anyway.....enough of my horror story!  All you lucky ladies who have choices to make, each journey isnt black and white as it may seem, accept that it may take several ops, the good news is that 99% of ladies get a good physical result and after recovery you will move on and enjoy life. I hope this for all of you I really do.  Don't beat yourselves up too much in making the decisions, just flow with it. ",
      "MessageIndex": 37,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134879/advice-with-reconstruction-implants-verus-diep",
      "Title": "Advice with reconstruction: implants verus DIEP"
    },
    {
      "AuthorID": "J4N",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/j4n",
      "Content": "Hi, I was exactly the same, the decisions just blew my mind.  You read up on the options but at the end of the day the surgeon passes the decision back to you, its so difficult and no option is guaranteed to work out in one op. Sorry if this isn't what you want to hear but I am just trying to be realistic. I had the LD flap recon (as the DIEP scared me too much) but mine didn't work anyway, despite the soul searching in making the initial decision.  I have now had 8 operations and have no satisfactory outcome. Now the DIEP isn't possible. I just want to let you know that the initial decision can drive you nuts yes, but whatever you decide is a journey, so think about what operation you find the least scary and go with that and then deal with whatever comes after.  ",
      "MessageIndex": 18,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134879/advice-with-reconstruction-implants-verus-diep",
      "Title": "Advice with reconstruction: implants verus DIEP"
    },
    {
      "AuthorID": "J4N",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/j4n",
      "Content": "Hi, I just wondered if there are ladies out there who have problems following the LD back muscle operation?  My surgery journey has been a complicated one, everything that they warn you could go wrong, did.  I now have a lot of stabbing pain in my back where the muscle was, the worst thing is the feeling of tightness around my body which is 24/7, its like wearing an extremely uncomfortable bra, even when you are naked.  I asked about this in the hospital when i came round as it was really and and i felt breathless, and they said it should ease. The muscle at the front isnt in the right place, its more under my arm and it feels so alien, twitching and flexing when it shouldnt. The implant had to come out as a) it was infected and b) the LD muscle wasnt big enough and was so tight it sort of squeezed the implant out. I had a hole in my breast for weeks before it was taken away.  My previously unscarred body is now a mess and no surgeon in the country, I have visited lots of top people, can put it right.  In part i just have ribs and skin, no flesh covering, and an unsightly bulge.  I am trying really hard to move on, some days are ok, but the disbelief that nothing can be done is the worst. I recently went to a support group however everyone there seemed thrilled with their results and had had successful surgeries, so I came away feeling like the quassimodo of the group. In some ways its good that no one seems to have had my experience, i wouldnt wish it on anyone, but oh how it would help to speak with anyone facing the same challenge. To all you ladies facing surgery, you have to trust your surgeon and go with the outcomes, i am but a miniscule statistic.  There are more great uplifting success out there an you will be one of them.      ",
      "MessageIndex": 0,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135022/complications-following-ld-back-muscle-op",
      "Title": "complications following LD back muscle op"
    },
    {
      "AuthorID": "J4N",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/j4n",
      "Content": "I will share my tip with you for getting comfortable. I used my holiday neck cushion, it's one of those Cushtie cylinder shaped rolls (not a semi circle neck support) and I couldn't believe the difference it made. It was glued to my side, in bed, on the couch, in the car, for the next month or two, just the right shape for hugging and supporting the breast area. The pain just eased when I held it. Not sure where you can buy them from now, mine was from a bargain store I recall. Please try and get yourself something like this. ",
      "MessageIndex": 17,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135022/complications-following-ld-back-muscle-op",
      "Title": "complications following LD back muscle op"
    },
    {
      "AuthorID": "J4N",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/j4n",
      "Content": "Hi Anne, by 'in two stages' I guess you mean the mastectomy and then the LD reconstruction later?  I had it all done all together, I discussed it with them, and they said as I was fairly active and in good health to just have it in one op. It's entirely person tho in what you think you can face. I would say the the ladies who just had straight mastectomies were up and about quickly  and seemed to recover amazingly well. I think it's the reconstruction surgery which takes much longer. Hope this helps. ",
      "MessageIndex": 5,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135022/complications-following-ld-back-muscle-op",
      "Title": "complications following LD back muscle op"
    },
    {
      "AuthorID": "J4N",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/j4n",
      "Content": "Hi Sue, sorry to hear that you have problems too, I was beginning to think it's only me and I should stop complaining but the pain is constant. It feels exactly as you describe, like a steel band around you which sometimes you can zone out and ignore it but at other times it drives me crazy. I have found. That ta worse after activity, if I have a heavy days gardening I suffer more for a few days after. I talked it thro with my consultant Bamburgh they just said it should ease. It hasn't. Now 18 months. I am now under a different consultant to try to find some surgical solution to areas and I've said to him how bad it is. His comment was that different surgeons have different methods of doing the LD and maybe it had been stretched too much. But it can't be undone. Even if he took the muscle off the front, the tight band feeling goes right around the back where the muscle was. I do know how you feel. I have tried back massage but no joy. I went to the Physio at Yorkhospital and she worked on it for a long while. It gave me a few days respite, but then came back. I am sitting here now in total discomfort. It's a bizarre feeling and I would give anything to be released from the pressure, some days it's unbearable.  Thank you for responding, you are the first person to describe it exactly.  Jan. X",
      "MessageIndex": 2,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135022/complications-following-ld-back-muscle-op",
      "Title": "complications following LD back muscle op"
    }
  ]
}