{
  "AuthorID": "jackies44",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackies44",
  "Posts": [
    {
      "AuthorID": "jackies44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackies44",
      "Content": "hiya Oh yes i have put on a load around my middle, I seemed to put it on very quickly but have now stayed the same weight.  After always being very slim its hard with everything else the hair loss etc lets hope when treatment finishes it comes off, whats most important is getting through all this and a little weight gain although annoying on the grand scale of things does it realy matter. I was told that herceptin dosnt put on weight and it was the Tamoxifen that did so i dont really know Keep strong  love jackie xxx",
      "MessageIndex": 5,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67632/weight-gain-on-herceptin",
      "Title": "Weight Gain on Herceptin"
    },
    {
      "AuthorID": "jackies44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackies44",
      "Content": "Hiya just wondered if anyone was feeling the way I do at the moment, Diagnosed xmas time last year,mastectomy in Jan followed by four lots of chemo and now having Herceptin until march next year. If the emotions and pressure arnt enough i now have the pressure of work bugging me about going back.  So i was told i had to phase back in in July otherwise i would go down to half pay,so off i troitted to work,hard to cope with the constant questions and that look of sorrow (has anyone else experienced this ) I know people want to know but i really am finding it hard coping with how im feeling emotionaly and working at the same time.   I really want to jack it all in and concentrate on myself for once in my life.  As this ois not an option have two teenagers and my husband left me 2 years ago, so i am mum and dad most of the time.  Just finding it hard to be cheerful and keep wondering what will happen once treatment is finished.  Would love to put the cancer to the back of my head but its always there,  I have great friends and good family and a great new partner on the positive side, just feel like i want to go into work and say stick your job im taking time for myself but cant so feel trapped. Anyway rant over !!!!!",
      "MessageIndex": 0,
      "PostDate": "28/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65245/dealing-with-emotions-and-going-back-to-work-its-hard",
      "Title": "Dealing with emotions and going back to work its hard"
    },
    {
      "AuthorID": "jackies44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackies44",
      "Content": "HI all its me again Its seems that some employers arnt sympathetic at all.  I have been lucky work in a school had 6 months off with full pay,but had to go to doctors recentley as they were expecting me to come back in September back to work as normal.  I just wanted to shout HELLO ive had an operation,chemo Herceptin every 3 weeks are you having a laugh or what. I felt like they were controlling me so go myself a certificate with a phase in back to work.  I am still finding it really hard and this week on my days off at hospital twice.  Also not once has the head teacher come up to me and welcomed me back asked how I am or anything like that, i find this really insulting after working there for 10 years. Getting there slowly but surely Good luck to you all its hard but we are all strong xxxx",
      "MessageIndex": 7,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65245/dealing-with-emotions-and-going-back-to-work-its-hard",
      "Title": "Dealing with emotions and going back to work its hard"
    },
    {
      "AuthorID": "jackies44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackies44",
      "Content": "hi lyndy best of like with yours i think its the waiting around for it to happen is the worst at the moment, i expect you feel the same, if it helps went to a ampering session yesterday and met some lovely ladies at various stages of treatment they all looked fine with hair and without and just seemed to be getting on with their treatment in their own way. People keep saying to me one day at  at time and dont expect too much of yourself, off to hospital for mugga scan today, followed by the wig lady such fun,dont you feel like your life is on hold i do ?   Best of luck  jackie xxx",
      "MessageIndex": 8,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58419/nervous-about-starting-chemo",
      "Title": "nervous about starting chemo"
    },
    {
      "AuthorID": "jackies44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackies44",
      "Content": "Hi  Starting treatment on the 18th herceptin first followed by chemo the next day, feeling nervous because i feel so well and get the feeling that im going to feel like s....t Any advice to stay strong and fit and well as possible thanks Jackie",
      "MessageIndex": 0,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58419/nervous-about-starting-chemo",
      "Title": "nervous about starting chemo"
    },
    {
      "AuthorID": "jackies44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackies44",
      "Content": "hi thanks fro replying  herceptin followed by taxol 4 treatments in all , yes i ahve had surgery full mastectomy 5 weeks ago thanks for taking the time to reply means a lot  ",
      "MessageIndex": 6,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58419/nervous-about-starting-chemo",
      "Title": "nervous about starting chemo"
    },
    {
      "AuthorID": "jackies44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackies44",
      "Content": "hi Amber good luck with yours and keep me posted as i will, met some lovely ladies yesterday and they all looked and seemed fine bit tired but all  looked well this helped a great deal, on wards and upwards it will soon be over.",
      "MessageIndex": 7,
      "PostDate": "06/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58419/nervous-about-starting-chemo",
      "Title": "nervous about starting chemo"
    }
  ]
}