{
  "AuthorID": "jackeen",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackeen",
  "Posts": [
    {
      "AuthorID": "jackeen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackeen",
      "Content": "Hi all, I am claustrophobic and had to go to hospital earlier this year for a scan (not related to my lump) and could not go through with it. The nurse has been asking around hospitals to see if there is a open/walk in scanning machine available, so far no luck. I am going to 'view' a bigger one at the hospital on Thursday to see if I could manage it. Is there any possibility of being sedated I asked only if I can get my GP to write out a prescription!  I am ready to explode, I am here by myself and would ask if anyone else has found where I can get privately tomorrow an open/walkin scan without sedation that deals with soft tissue.  I have rang around this morning and they do not do soft tissue.",
      "MessageIndex": 0,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67886/open-mri-scanning-machine",
      "Title": "open MRI scanning machine"
    },
    {
      "AuthorID": "jackeen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackeen",
      "Content": "H I everyone, Had my first chemo last Thursday. It was just short of three weeks since my mastectomy and I am still in pain from the scarring. I stopped taking painkillers because of the chemo and wish I hadn't now.  My mastectomy was on my left side, it is painful trying to sleep.  I have an appointment for a scan tomorrow and will try and see my BC nurse afterwards and ask her about painkillers.  I am going around like a Zombie because of lack of sleep through pain and worry.  I know I'm not alone as that why this site is here. I just want to let of steam to other who are going through the same.  Thanks for reading.",
      "MessageIndex": 0,
      "PostDate": "26/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70837/pain-and-lack-of-sleep",
      "Title": "Pain and lack of sleep"
    },
    {
      "AuthorID": "jackeen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackeen",
      "Content": "Hi I have had my first chemo two weeks ago as they say in the third week you feel ok.  Before I have my next lot, this day week I would like to do something about my diet.  I read about eating certain foods for two days beforehand and two days after to lessen the side effects.  I think it was avoiding carbs. Can someone put me in the right direction ie where this info is on here.",
      "MessageIndex": 0,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71394/diet",
      "Title": "diet"
    },
    {
      "AuthorID": "jackeen",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jackeen",
      "Content": "My mastectomy was 8 weeks ago today. Dressing over a small part of the wound that  just would not heal up and with everything else I put bra measuring on the back burner till yesterday.  I made an appointment on Wednesday after being told the wound was now healed.  I went to Nicola Jane in London's Smithfield.  They knew I was nervous, would not look in a mirror in case I saw the scar (not ready yet).  They measured me, brought in an array of bras and the prosthesis. That last bra I was really comfortable with and bought both items and kept the bra on.  It's such a moral booster, I can look in the mirror....................when I have the bra on and I look normal.  Now that I have been professionally measured by staff who  know about mastectomies, I will buy off them again.  Great service.",
      "MessageIndex": 7,
      "PostDate": "21/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72264/mastectomy-bra---daft-question",
      "Title": "Mastectomy bra - daft question"
    }
  ]
}