{
  "AuthorID": "Jaloco",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
  "Posts": [
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello This is my first post here but I suspect it won't be my last! I was diagnosed with DCIS at the beginning of September and am booked to have a mastectomy and node sampling on 28th.  I am concerned that at each stage of the diagnosis the goal posts have been moved - I found a lump (that actually is a benign cyst) but when I had it investigated I was found to have wide-spread calcification in both breasts. Radiologist said he was sure that it was innocent but better check just in case.  Had vacuum biopsy and hey presto it is early-stage cancer.  Surgeon says I need mastectomy as wide spread but he doesn't think it's spread, but better remove some nodes just in case...... all this starts to sound familiar and I have managed to convince myself that when I get the results they will find it has spread and I'll need chemotherapy which I am really frightened about.  Can anyone tell me if you ever have a mastectomy without the nodes being checked too? My other concern is that my BC nurse told me I would probably be put on hormone treatment afterwards. I have been reading about these on the internet and have scared myself silly because of all the side-effects mentioned.  I am post-menopausal so suspect it wouldn't be Tamoxifen I'll be given - but they all seem to have a list of grotty things like depression and increased risk of cancer of the uterus and so on.  Can anyone cheer me up as this has really upset me tonight and I thought I was doing quite well. Sorry this is so long! Look forward to hearing from anyone post-op who can enlighten me about the drugs and anyone who is at the same stage as me so we can compare notes.  Jaloco  ",
      "MessageIndex": 0,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Vicky Thanks for your encouraging reply - I was assuming that the op would be far worse than the biopsy pain wise.  I am having a skin-sparing mastectomy and temporary reconstruction with an implant so my options are left open if I decide I want a tissue flap job done later on . At the moment I think I'll opt for a permanent silicone implant once things have settled down. Don't know if the recon will make any difference post-op to how I feel physically, but I think it will help me emotionally to have some sort of bump there! Thanks again - this site is so helpful at such a worrying time Janet",
      "MessageIndex": 4,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello all Well it's Monday morning and I've still got another week to go before my mastectomy and reconstruction.  This waiting is awful but the plus side is that I am having an absolute blitz on my house and garden - cleaning out cupboards and drawers that haven't been done for years and even filing bills away! I can' t work out if I'm doing this just to keep busy or so that everything is organised for when my daughters are here helping me after the op or because I may not be able to do much for a week or so.  My main problem at the moment is that Im not sleeping well at all.  Some nights I can't get off to sleep and others I wake in the small hours and then can't get back.  It's then that my mind does overtime thinking about the future and what my results may be and what if I need chemo and what if...... I know I should try just to concentrate on the next hurdle but it's hard not to think about the possible future especially in the middle of the night.  I end up listening to the World Service on the radio which is sometimes boring enough to send me off again.  I know a lot more about oil and the automotive industry in America now - yawn yawn! So if anyone has any tips for sleep I'd appreciate them.  I really want to find something that avoids putting the light on and reading or similar as then I find my brain gets too active.  Incidentally I take a cup of Valerian tea to bed with me which always helped before all this horrible stuff happened. Hope everyone is ok out there.  It's good to have someone to talk to..... All the best Janet",
      "MessageIndex": 16,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Jeffer I am so sorry that you've got to have a double mastectomy and also have got to wait another two weeks. I was threatened with a double as they found calcifications in both breasts but I've been told that the left one doesn't look suspicious at the moment.  Being pessimistic, I think it's probably just a question of time before it does and I'll be losing that one too. There seem to be lots of ladies here who have had double mastectomies done so it may be worth you starting a new thread with that as the heading and I'm sure you'll get lots of helpful replies. I must say I am astounded at how many people there are with breast cancer - it is far more common than I realised. I do think it's quite usual not to remember all the things that you get told at the hospital - it's just too much to take in.  You could try writing things down or perhaps ringing your breast care nurse for some clarification. Hope you get some useful info soon.  I'll be thinking of you during the waiting - I'm ticking off the days in my diary - I just want to get it over and done with now. Janet  ",
      "MessageIndex": 18,
      "PostDate": "20/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi all - came home on Thursday so only in hospital for 48 hours, although felt much longer.  Jim's girl, you were quite right - it really wasn't such a bad deal and I certainly haven't had anything like the pain I felt after my biopsy.  I've actually got lots of numb areas and the doc said it could take a long time to get sensation back fully and some areas may not fully recover. I didn't have the tissue expander implant as the surgeon did a skin-sparing mastectomy and said it wasn't needed, so I have a temporary fixed sized implant for 6 months which doesn't seem to be too bad shapewise, although it's difficult to tell with all the bandages covering it up.  He did a sentinel node biopsy and just took out the first two nodes that the blue dye identified. I was glad he warned me that my wee would be bright green for a day or so afterwards! I had a patient-controlled morphine drip in when I came round and the morphine made me feel very sick so asked if they could give me something to help.  Unfortunately I had an adverse reaction to the drug I was given and I reckon that was more scary than anything to do with the operation itself.  So another time I shall just be sick!  Since coming home I've been having a few dizzy spells but nothing too bad really.  Went out for a short walk to the village shops this morning with one of my daughters which made me a bit light-headed. My drain was taken out at the hospital which I was pleased about as apparently some patients are discharged with them in and have to have the district nurse visit at home to take them out. I am doing my exercises as advised but reckon they are going to get rather tedious as time goes on.  Something I am really surprised about is that I thought I wouldn't be able to do much because it would hurt or I'd be too stiff, but that doesn't seem to be the case.  So I am having to remember not to lift things with my right arm or carry stuff because the physio said I mustn't to reduce the risk of lymphodoema.  That's going to be difficult. Anyway, to anyone out there waiting for their operation, please try not to worry too much - it isn't anything like as uncomfortable as I imagined it would be and it gets us one step nearer to getting a treatment plan sorted out and being able to get back to a normal life again. Sorry this is so long - looking forward to hearing how Celia and Sheila got on. My results appointment is on the 13th so that's my next important day. Thank you for all your support Love to all Janet/Jaloco",
      "MessageIndex": 47,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Dear All Saw my surgeon today and delighted to say he is adamant that I don't need any further treatment  despite his junior doc telling me last week I'd need further surgery and/or radiotherapy.  Apparently the pathologist thought she was examining a large lumpectomy when the margins would have been very important - but it was my whole breast (a modest B cup!) and surgeon says that margins are totally irrelevant for DCIS and mastectomy.  He also told me he removed the sentinel node and three others, to be on the safe side and they were all clear.  (His registrar, who was present at the op told me that only two nodes had been removed, so just goes to show you can't believe everything you're told!) So, I now have appointments for routine follow-up in 6 months and to see the plastic surgeon in January to discuss reconstruction, which will probably be replacement of the temporary implant with a permanent one.  (Don't think I want to bother with a tissue flap one at my age.) They hinted today that I could ask for an enhancement on the good side if I fancied having a 'fuller figure' as it's easy enough to put in a slightly larger implant.  So that would be a nice reward for the last few horrible weeks! Just got one more appointment with the physio on Friday to sort the cording out - have got more or less full movement back though and the cording is nothing like as painful as it was.  So, all in all, I'm a very happy bunny and looking forward to resuming a normal life again... Lots of love and positive vibes to all who are still having treatment - hoping it all goes well for you - and thank you for the support you have given me here, it's really helped enormously. Janet x",
      "MessageIndex": 68,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Celia Good to hear you in such high spirits.  I know what you mean about forgetting what you should and shouldn't do - it's so easy to forget and fill the kettle with the wrong hand or whatever.   I've got a new problem that developed yesterday - I noticed my shoulder was much stiffer than before and there is a tendon like lumpy line coming out of my armpit towards my arm which is quite painful especially when I do my exercises.  I think this is what the physio described to me as 'cording' and can be relieved by massage but my bcn doesn't know anything about it and the physio isn't in until Thursday so am trying to find out if anyone else has had this problem and can give me any advice.  (I've also started a new thread called 'Cording' ) Interested to know if I should massage towards the armpit or away from it or into it or what..... Any help much appreciated, Love, Janet x  ",
      "MessageIndex": 55,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Kaz,  Thanks for your reply and encouragement.  Have had another rotten night waking up and worrying about everything but it certainly helps to be in touch with others who have been through this awful experience. I will try to take it one step at a time - I know that makes sense.  On the other hand I often find if you expect the worst outcome at least you are prepared if it happens, and get a nice surprise if it doesn't!  I am trying to find out all I can so I am a step ahead of the process and can ask suitable questions of the medics, who I must say have been absolutely marvellous - been phoned at home twice now by consultants to discuss results and treatment .  Better service on the NHS than when I went private years ago. I can't work out which is going to be more difficult - the wait for the op or the wait for the results.  I am still bruised and lumpy from the vacuum biopsy so am expecting to be more than a bit uncomfortable after the mastectomy!  Can you or anyone else tell me how restricted you are after the op - is it possible to get a bra on for instance and can you use your hand/arm ok to write and type even though stretching is not allowed.  Any advice on how to cope with the surgery will be gratefully received. Good luck with the rest of your treatment and thanks for being here to help. Janet      ",
      "MessageIndex": 2,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "I'll be thinking of you today Sheila and am sure your surgeon will tell you the correct results and outcome.  My problem was that I didn't see my surgeon last week - just a locum who didn't really know what he was talking about.  Good luck and let us know how you get on. Janet x",
      "MessageIndex": 70,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Janet / Jim's girl Thank you for such a positive and encouraging account of your experience - it certainly has cheered me up to know that you've come through the operation, reconstruction and exercises without too much distress and that the Arimidex isn't too awful either. Am I right in thinking that they didn't find any spread in your nodes so you didn't have to have chemotherapy? Am obviously hoping that will be the outcome for me. I was surprised when my surgeon told me that I'd be getting a new nipple and tattooing - mainly because I'm in my 60s and more or less assumed that I'd have to be content with an external prosthesis so I'm really pleased about that. He has also said I can opt for the bigger reconstruction surgery if I want to instead of the implant - but that sounds pretty scary and is a long operation so think I'll accept the easier option.  So good to be given a choice though. May I ask how well your new breast matches your other one? I will heed your advice about the exercises - perhaps get my grandchildren involved too.  I am quite good at following instructions to get a desired result and know I will feel frustrated not being able to drive or lift things initially, so the sooner I can get back to 'normal' the better. Thanks again for your help - very much appreciated. Janet / Jaloco  ",
      "MessageIndex": 7,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello Kaz Thanks for your advice re: bras and pain killers.  I'm glad I'm not the only one who adopts a somewhat pessimistic attitude to things in order to feel prepared for the worst. Am gradually getting my head round what's in store and feeling a bit more positive - especially reading about other people's experiences here. Good luck with the rest of your RT and your permanent implants. Love Janet x",
      "MessageIndex": 8,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello Gill Thanks for writing about your mum - it must be a worrying time for you as well as for her but it sounds as though you're both coping well.  I am about the same age as your mum so will be interested to hear how she gets on post-op.  I have another ten days to wait and am currently stressing about catching any coughs, colds or other bugs that could dealy the surgery as I just want to get it over and done with.  The worst wait will be for the pathology results of course - but then at least I'll have a better idea what's in store and can make plans accordingly.  It's the not knowing that I find so difficult. You are absolutely right about keeping cheerful and getting lots of friends to visit.  I am actually filling my days up quite well meeting people for coffee and lunch in between doing loads of housework and gardening so I will know I can have a week or two off without things getting too out of hand.  Anyway my very best wishes to your mum with her recovery and will look out for further news from you. Thanks for posting Janet",
      "MessageIndex": 15,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi all Thanks for the info on the tissue-expanders - that certainly makes sense.  Also all the tips on sleep/relaxation CDs and pillows etc. I had a better night's sleep last night because I was totally exhausted from driving 200 miles and playing with my grandsons for a day - it was definitely a good thing to do. Still woke up a few times but managed to get back again which made a lovely change. Meeting a friend for lunch later so that's today's distraction. Not long to go now..... Will report any new info after my pre-op assessment tomorrow - my list of questions is rather long - mostly practical stuff like visiting times and mobile phones.  Incidentally, my son-in-law is a hospital doctor and has told me to be sure to take some earplugs with me as there's usually someone who snores or talks in their sleep..... With love Janet/Jaloco  ",
      "MessageIndex": 28,
      "PostDate": "23/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Welcome home Celia So pleased all went well for you too and that you have been discharged sooner rather than later and also 'drainless'. I'm having a few dizzy spells every day but otherwise much much better than I thought I would be.  I reckon the dizziness is when I'm particularly tired so will have to watch that and have a lie down now and again.  Am already finding the exercises are easier to do as the days pass and I can get my arm up/out a bit higher each time. Keep in touch and hope all continues well with you. Love Janet x",
      "MessageIndex": 51,
      "PostDate": "03/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello Well I'm amazed you were able to go out so soon after your operation - that fills me with hope.  My breast care nurse told me I needed to have someone staying with me for at least 4 days and nights after I come home as I live on my own, but I guess that may be in case of complications. Pleased for you that you've managed to avoid the chemo and radiotherapy and hope the reconstruction goes well in January. All best wishes Janet",
      "MessageIndex": 14,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Yes, I had a very informative time at the hospital - all questions asked and answered and I did get a better night's sleep last night.  Long may that continue. I saw a staff nurse, a breast care nurse and a physio.  They did all sorts of routine tests, asked loads of questions about my medical history and did lots of encouraging talk - the physio got me to do the exercises and really stressed how important they are to regain full movement, also the need to avoid lymphodoema by keeping hand and arm well moisturised and free from cuts and scratches which could get infected.  I then got my results apppointment which is on the 13th Oct (thankfully not a Friday!) and then had  blood tests and ECG and then home.  It all took about 3 hours and no waiting at all - amazing.  I feel better about probably having to have hormone treatment now and surprisingly better about the actual operation. They are now saying I'm likely to be in 3 or 4 nights though whereas before they said 2 or 3. Goalposts moving again! Today I've been for a 6 mile walk in the lovely Peak District and have lots of things to do tomorow and Monday so I guess it will soon be over and I'll be back on here telling you how I got on. Will be thinking of everyone lots. Love Janet",
      "MessageIndex": 31,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi everyone Just to say went for my results today which are a bit unexpected so am starting a new thread \" mastectomy margins\" in the hope of reaching some other ladies with similar stories. Janet x",
      "MessageIndex": 57,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Celia That's fantastic news - I'm so pleased for you. Well done! Love, Janet x",
      "MessageIndex": 60,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Janet/ Jim's girl Thanks for your messages  and all the useful info.  It is certainly helpful to know you were able to get out and about so soon after your operation and I am hopeful the same will be true for me.  I shall certainly keep posting as it is good to know I am not on my own with this and that so many others have been through the same experience and are able to talk about it very positively. I am finding the time hanging a bit at the moment.  I go for my pre-op assessment next Friday (24th) and then have the op and recon on the following Tues (28th). I have arranged all sorts of actiivties next week to keep me occupied, including going up to Leeds to see one of my grandsons on his 4th birthday - that's bound to cheer me up.  In between other things I seem to be sort of \"getting my house in order\" which is a bit wierd as I'm not the house-proud type.  Just have a feeling that it makes sense to do as much as I can before the event. It feels a bit like preparing for a holiday that I don't want to go on! I have also tried to be selective about who I tell, but one or two people have asked very pointed questions about why I won't be around for certain events so I've ended up telling them them rather bluntly which is a bit unkind, but hopefully will make them a bit more sensitive if similar circumstances arise in the future.  Not sure if I mentioned before that I live on my own so my daughters have arranged  to take turn in staying here for the first week as advised by the hospital.  I'm actually really looking forward to spending time with them despite the circumstances.  I'll let you know how I get on and am hoping I will have as straightforward a time as you and will be able to encourage other people in the future. Thanks for caring Janet/Jaloco",
      "MessageIndex": 11,
      "PostDate": "16/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello again Celia and Sheila It's so reassuring to know I'm not alone in this, but also sad that we are all having to cope with it.  Thanks for the sleeping tips - I'll certainly try the relaxation techniques but not the Ovaltine as I can't bear the taste or smell of milk! I've spent quite a long time tonight reading through all the info they gave me when I was diagnosed and making a list of questions to ask at my pre-op assessment which is on Friday.  Doing this made it seem more real after all the waiting and I feel a bit more focussed now - still scared but a bit better prepared. One thing I can't work out is about the reconstruction.  My surgeon recommended I should have a skin-sparing mastectomy and a temporary implant now to leave my options open to have either a tissue flap job later on or a permanent silicon implant.  He mentioned he may use a tissue-expander implant now but I can't work out why I should need this rather than just have an ordinary implant put in.  If he's not removing the skin, just the tissue and the nipple why should the skin need expanding?  Any ideas anyone? I can ask the BCN on Friday but last time I asked her about the implant she just said I'd have to ask the surgeon. The other thing I'm stressing about is how I'm going to cope with waiting for the results - two weeks is ages and I can imagine being a nervous wreck by the time I have to go.  It was bad enough waiting for the biopsy results but this seems to be a much bigger deal in that it's going to determine our quality of life for the next few years I reckon, judging from what I've been reading on here in some of the other threads.  Sorry to be rather negative but it does help to say it (ie write it) how it feels at the moment. I think we need a group cyber-hug to cheer us all up after my miserable ravings. We need to get some positive vibes circulating - easier said than done though. Will be thinking of you and hoping next week isn't too bad for anyone. Love from Janet x      ",
      "MessageIndex": 22,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Thanks for your good wishes Jim's girl - I definitely won't be online tomorrow as have to leave the house at 7. Am told op will be sometime between 9 and 1 so this time tomorrow it will be over and I'll be on to the next stage.... Good wishes also to Celia who is scheduled for this Thursday (if I've got my facts right) and then to Sheila for the 11th - although I hope I'll be back on here by then and able to say some positive encouraging things myself. See you all soon and thanks again for all the support. Love Janet  ",
      "MessageIndex": 34,
      "PostDate": "27/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello I had a mastectomy and sentinel node sampling two weeks ago and got my results today which were something I hadn't anticipated at all.  It seems the cancer was grade 3 and widespread, but all contained in the ducts and the nodes were clear.  However, they didn't get  clear margins on the posterior side next to the chest wall so I am being discussed in their team meeting tomorrow to decide whether they will do more surgery, radiotherapy, chemotherapy or nothing. I go back next week to find out their decision. I would be interested to know if anyone else has had this happen and what treatment they ended up having.  I don't want there to be any chance of there still being any cancer left to develop but can't quite understand how there could be if all the cancer cells were inside the ducts. Any pearls of wisdom much appreciated! Janet x",
      "MessageIndex": 0,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32351/mastectomy-margins",
      "Title": "Mastectomy margins"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Jules Thanks for your helpful post and links.  I saw my surgeon yesterday who is absolutely adamant that posterior margins have no relevance at all when you've had a mastectomy.  He assured me he had removed the fascia (covering chest wall) so no possibility he had left any dodgy tissue behind.  He was furious that I'd been told by a locum that I would need surgery and/or radiotherapy and had had a week of worry as a result.  The funny thing is (I'm just regaining my sense of humour!) that the pathologist apparently thought she was investigating a lump not a whole breast so had taken great care to examine all the margins.  Ok, so I was only a modest B cup....... So the only appointments in my diary are to see physio again for cording massage, then plastic surgeon in Jan to discuss recon and a six-month routine check in April.  No hormones needed either as tested negative.  Am over the moon and now planning to put it all behind me and get back to normal asap. Janet x",
      "MessageIndex": 5,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32351/mastectomy-margins",
      "Title": "Mastectomy margins"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Jules Thanks for your message. I've been doing lots of reading on the internet (can be dangerous I know) since I started this thread and it does seem that radiotherapy is the obvious course of action now.  I go back on Wednesday to discuss with medics and am concerned they may want to do nothing. My situation is a bit more complicated in that I had a skin-sparing mastectomy (so all my skin still intact except nipple and surrounding area) and also had an implant, which is temporary for 6 months.  This then gets replaced by a better shaped permanent one, all being well.  I look forward to that as I'm not very happy with my current shape, although it's early days.  I understand that radiotherapy and implants don't mix well so that may affect the decision as to what to do with me now. I just want to be rid of the worry and be able to get back to normal again. Incidentally, what dows NED mean? I'm too new to this to know the jargon, but I do hope it means you are in the clear now. Janet x",
      "MessageIndex": 3,
      "PostDate": "16/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32351/mastectomy-margins",
      "Title": "Mastectomy margins"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Sharon I'm really pleased you've got it sorted now and have agreed to have the mastectomy. If you should start to think about changing your mind again just think 'STOP' very firmly in your head (better still say it out loud!) and refuse to let yourself start thinking about any alternatives. Concentrate on postiives only from now on and you'll be absolutely fine. I think it's important for you to keep very busy while you wait for the 8th.  I spent time before my mastectomy looking for some pretty pyjamas that opened down the front and getting all sorts of toiletry things for my two nights in hospital (including the earplugs and eye mask!). Also did a manic spring clean at home as I was told housework would be banned for 4 weeks post-op. So everywhere looked really clean and tidy when I came home. Do keep in touch and let us know how you are - we're all rooting for you! Love, Janet  ",
      "MessageIndex": 45,
      "PostDate": "29/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello again Sharon Delighted to hear that yesterday went well - definitely a positive and something you can think back to if/when you are feeling less positive.  Imagine yourself sitting there looking out to sea and how you felt then and what you'd eaten for lunch and how it tasted good. I'm not at all surprised you're still thinking about having just the lump removed, but I think in your heart of hearts you know that it makes much more sense to do what the consultant and everyone else is advising and have the mastectomy and be done with it.  I'm so pleased you're seeing your GP too and getting some help - you deserve it.  No-one should be struggling with all this on their own and just like you were there to help your neighbour, so there are lots of people there to help you. Keep in touch Love, Janet",
      "MessageIndex": 82,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Dear Liz So sorry to hear you've been diagnosed.  It's a horrible shock isn't it and a lot to get your head round.  I was threatened with a double mastectomy too but it was decided only to do one side and keep a careful check on the other which already has widespread calcifications so I feel as though it's a time bomb ticking away. I wonder whether I shouldn't have asked to have the double and be done with it.  Ah well - too late now. Will keep fingers and toes crossed for you that you get good test results on Friday.  Lots of positive stories here from ladies who have had mastectomies and are now managing to get on with their lives again.  It's really not that awful an operation and there are some really clever reconstruction techniques on offer these days. Be thinking of you, Janet x",
      "MessageIndex": 66,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Sharon Well done you! I don't think anyone could actually 'like' the idea of having a mastectomy but I'm really glad you're back on track. Re: what it feels like afterwards - not sure I'm the best person to answer that as I had an implant put in under the chest wall at the same time as the mastectomy.  For a week or two I didn't have much feeling there at all - just numb.  Now the nerves are mending I am aware that that side feels different from the other - the best way to describe it is like I've got something in a  pocket that's digging in a bit so I'm aware it's there nearly all of the time. It doesn't hurt though, just aches a bit now and again. Having said that, this week is much better than last week and I'm not so conscious of it if I'm busy doing something.  (There's a moral there I reckon!) I had to be at the hospital at 7:30 too and had to wait for about an hour and a half for a bed. I was second on the operating list so didn't go to the theatre till about 10:30 but there seemed to be plenty to do with unpacking my bag, getting changed, seeing the surgeon and anaesthetist and then the nurses measured my legs and fitted me with elastic socks to avoid getting dvt.  And of course because I was nervous I needed so many wees! Even had to go again after they were ready for me. And I hadn't drunk anything since 10 the night before so goodness knows where it all came from. Anyway I hope you don't have too long to wait on Monday - the sooner it's over and done the better and you can concentrate on getting well and fit again. Thinking of you lots Janet x",
      "MessageIndex": 84,
      "PostDate": "04/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Dear Sharon Can you describe what it is about having a  mastectomy that is worrying you so much? Is it your shape or the operation itself or how you'll feel afterwards or what?  I had a temporary implant put in at the same time as my mastectomy (4 weeks ago) so I've still got a reasonable shape and no-one would know I've had anything done when I'm dressed. (I have an appointment with a plastic surgeon in January to discuss permanent reconstruction.)  So you don't have to be flat-chested if that is worrying you. Like lots of other ladies have already said here, the pain really isn't that bad - nothing like I expected.  I took a few paracetamol but nothing stronger. Yes, there are areas that are still numb, but the feeling is gradually coming back.  Incidentally I was told to keep the area completely dry for two weeks until the dressings were removed.  Also no deodorant or anti-perspirant for 4 weeks and then only roll-on, no sprays. Definitely told not to use a wet razor in case of cutting the skin and introducing infection which could lead to lymphodoema.  But none of that is any big deal really. Also had to do exercises every day to get my arm and shoulder moving again and now have full movement back after just a month. I have calcifications in my other breast but they haven't as yet developed into anything that looks suspicious.  However I have asked to have another mammogram in 6 months and at the first sign of anything developing that might be cancer I shall be asking for another mastectomy.  I definitely don't want to risk having cancer spread round my body if I can avoid it. If you have a lumpectomy, won't you automatically be referred for radiotherapy to zap any cancer cells that may be left? I did a bit of research into radiotherapy and there's no way I'd rather have that than a mastectomy. So, please think very carefully about all your options and please don't just go for what you think is the easiest one.  If they don't get clear margins you'd probably have to have the mastectomy anyway and if they do get clear margins you'd need radiotherapy.  But, at the end of the day, surely what we are all after is peace of mind - whatever it takes to achieve it.  If that means mastectomy and/or chemotherapy and/or radiotherapy then please be brave and go for it.  Your life is too precious to waste. Thinking of you lots and hoping you'll be able to make a good decision on Friday. Love, Janet x",
      "MessageIndex": 35,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Sharon I had 4 nodes removed at the same time as my mastectomy and thankfully they were all clear.  So I don't need to have chemotherapy or radiotherapy. The breast tissue removed is also checked and graded and you should get the results in about 2 weeks.  They will be able to tell you if the cancer has become invasive in the breast and how fast growing it is.  However, as far as I know, the only way they can find out if it's spread beyond your breast is by checking some of the lymph nodes in your armpit. They also test the tissue for hormone receptors and if it's positive they are likely to offer you hormone treatment for 5 years (one pill a day). This reduces the likelihood of a recurrence. Even though you've chosen not to have your nodes checked the mastectomy won't be a waste of time at all as it will remove the primary site of the cancer. Without the operation the cancer would have free rein to spread round your body if/when it decided to. I should add that if my nodes had been cancerous I would have gone for the chemo and/or radiotherapy and anything else I was offered.  I just want to be rid of all cancer cells and know I've given it my best shot. Hope you have an enjoyable lunch - try and pretend you're someone else for a few hours and make the most of having some company and not having to cook. I look forward to hearing how it went later on. Love, Janet",
      "MessageIndex": 74,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Sharon So glad you've seen your GP and got something organised.  I agree we are all different but want to say that, for me, having a mastectomy was definitely the right decision as I had calcifications throughout the breast and I would have worried if I'd only had a lumpectomy about having to go through it all again later on.  As it turned out the pathology report showed that there was grade 3 cancer throughout the whole breast so the mastectomy was fully justified. Want to add also for you and others waiting for their ops that I was terrified beforehand too, but can honestly say the mastectomy was nothing like as bad as the biopsy.  I just felt numb when I came round and cannot believe how ok I felt afterwards.  Went home after 48 hours and have been fine ever since.  The worst thing for me about being in hospital was not being able to sleep because it was quite noisy.  My tip: take some earplugs and an eye-mask! Keep in touch Love, Janet x",
      "MessageIndex": 28,
      "PostDate": "22/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Dear Sharon Can totally understand you wanting some peace and not wanting to think about being ill - it's what we're all after. But, if you don't have the mastectomy, won't you always be worrying about whether the cancer is growing and spreading and ultimately causing far more problems than you have at the moment?  I know I would, which is why I'm really glad I had the mastectomy. So, please, please, please, stay focussed and positive and don't change your mind again.  Easy for me to say - not so easy to do though. Your ME and depression must be really awful to cope with as well as all the breast issues.  I've known a few people with ME and have first hand experience of depression myself.  I know that horrid gloom that descends and at times makes you feel like giving up. But you can rise above it - use all the help that is offered - Joan suggested going to have another chat with your Gp and that's an excellent idea.  Write as much as you can here to give vent to your feelings - we're here to listen and help as much as we can.  Use all the resources at your hospital to support you - have you been allocated to a specialist breast care nurse? They ae specially trained to help us get through all the worries and concerns as well as the practical side of things. You mentioned in another post about being worried what you'll look like afterwards and whether you'll be able to go out after the operation.   Please be re-assured that no-one will be able to tell - if you don't tell them! You won't look any different with your clothes on.  If you're not having any reconstruction done, then you'll be given a temporary prosthesis to put in your bra until you get fitted with a proper one. Anyway, lecture over, almost! Just please promise that if you feel even the least bit tempted to change your mind, just come on here and sound off instead. We're all wanting to help you through this. Start ticking off the days till the 8th and give yourself a treat at the end of every day -  something you really like. You've already got through Friday and Saturday, so two treats deserved already! You can do this! Love, Janet",
      "MessageIndex": 55,
      "PostDate": "31/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Dear Sharon I am so sorry to hear that Monday didn't go well for you. Looking for the positives (yes, I'm at it again!) you had a long conversation with your consultant so he will understand you better now and you have come to a decision on a course of action that is more acceptable to you than the mastectomy would have been. Furthermore, you came on here and told us what had happened and that couldn't have been easy for you.  Please don't think that you have let anyone down and please don't stop writing here - as long as you think it helps you to do so.  This forum is all about supporting each other whatever the situation and no-one should set themselves up as experts or be judgemental.  We share our experiences as fellow cancer sufferers/survivors in the hope that doing so will help others in similar circumstances, hopefully always mindful that what is the right course of action for one person may be totally inappropriate for someone else. Depression, anxiety and ME are all horrid conditions that I believe can turn you temporarily into a very different person from the real you.  But with time and perseverence  I believe they can be overcome and you can reclaim your life again, especially with lots of support and understanding from friends and  family as well as from the professionals. I shall be looking out for further news from you here. Try and put Monday behind you if you possibly can. With love Janet",
      "MessageIndex": 107,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Sharon Have just typed a longish reply to you and lost it somewhere in cyberspace! Hope this one makes it ok... I am astounded at what you've managed to do re; housework and preparations for Christmas - you are an absolute star and deserve a medal!  I was glad to have help after my operation with the boring jobs but I did join in with cooking almost as soon as I came home.  My daughters took turns to stay with me as I live on my own and we had great fun trying out some different recipes - then they did the clearing up while I put my feet up or did my exercises. Make the most of being pampered though and only do what you feel up to doing. Re: you fighting your decision - my amateur knowledge of psychology makes me wonder if it's your attempt to stay in control of the situation.  For me I was very angry that this cancer had grown inside me and there was nothing I could do about it except have the mastectomy.  I really don't like not being in control but didn't ever consider not having the operation.  I think I said in an earlier message that I reckon in your heart of hearts you know it makes the best sense to have the mastectomy but you perhaps don't want to admit it as that means the cancer is in control rather than you.  I'm no expert though - so these are only my amateur thoughts. Anyway, enough theorising - you're nearly there and you're doing fantastically well.  Perhaps you should spoil your husband a bit this weekend as well as making sure you get some quality time for yourself. It must be a very worrying time for him too and you need him on your side in all this. I had a letter yesterday inviting me to be screened for bowel cancer - how bad timing is that? Just got over one hurdle and already being set up for the next! I shall of course get it done but just wish they'd waited a week or two. So, have as good a weekend as you possibly can - I'll be looking out for messages in case you need some last minute support and will be thinking of you lots as usual. Love, Janet  ",
      "MessageIndex": 92,
      "PostDate": "05/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Dear Sharon This time tomorrow it will be over and you'll be able to get some rest and let everyone look after you. I'm glad your son is coming to support you especially as it will mean your husband isn't on his own while you're in hospital. Sharon, you have done absolutely brilliantly this week and should be really proud of yourself.  It feels to me like you've turned a corner and are more resigned to it all now - I reckon you'll be strong tomorrow too. Like everyone else I shall be thinking about you so much, sending positive vibes out to you and looking forward to hearing from you when you are home again. With love and very best wishes for tomorrow Janet x",
      "MessageIndex": 100,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Dear Sharon I am so sorry you are having such an awful time.  Please go and talk to as many people as you can - I would start with your gp and your breast care nurse.  Your consultant should always be acting in your best interests and I don't see how he can just cancel the operation without discussing an alternative course of action, perhaps at a later date, when you've had more time to think things through. Please don't try and sort this out on your own.  Use all the people you can to help you.  ME, anxiety and depression are awful conditions in themselves without all this additional worry.  I'll be thinking about you lots in the coming weeks and hope to read some more positive news here soon. With love Janet x",
      "MessageIndex": 19,
      "PostDate": "21/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Sharon Well done - another day over! You've said some interesting things in your replies here today especially the idea of focussing on the desired end result instead of dwelling on what has to happen to achieve it. That's absolutely spot on. How about directing some of your emotions into developing a real hatred for the disease in your breast and a passionate desire to be rid of it, whatever it takes. When you wake up from the operation you'll have peace of mind at last that it's gone. On a practical note, you should be seen by your surgeon and anaesthetist before your operation.  Please tell the anaesthetist how worried you are and he/she can give you something to help.  I told mine I was scared and when they had put the drip in my hand I was given a shot of something that made me feel I didn't have a care in the world.  Worth asking I reckon. When you find yourself thinking negative thoughts,  have a go at stopping them by concentrating on positive things instead and remember that last time you did get through the operation, even though you found it very difficult. One thing I do every single night before I go to sleep is to make a list in my diary of 5 positive things that have happened that day and 5 things I am looking forward to the next day.  It's all too easy to lie in bed thinking about what isn't right with our lives, but much better to reflect on what has gone ok, however trivial that might be.  Top of your list tonight could be that you have got through another day without changing your mind.  Next, you have written some really good messages here.  Next, you've got even more people reading your story here now and supporting you.....  Even things like managing to cook a meal or going out to the shops when you're under so much stress are real achievements and worth recognising.  I'm sure you're actually doing an awful lot of good stuff but allowing all the old dark thoughts to overshadow your successes. Blot them out and don't let them back in to make things difficult. You're doing really well, Sharon - keep on track and it will soon be over.  Keep reading the messages we are all writing. We've come through ok and so will you.  Let all the support you have carry you through this and keep on writing as often as you can. With love, Janet  ",
      "MessageIndex": 65,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hello I had a skin-sparing mastectomy last September and had a temporary implant put in under the chest muscle.  I have found this rather uncomfortable as the muscle contracts whenever I use my hand or arm and squashes the implant. I am always aware of the implant because of this - it feels rather like having an orange stuffed in my chest (although softer and flatter than an orange!) Today I saw the plastic surgeon to discuss replacing the temporary implant with a permanent one.  She has suggested I should try having the implant over the chest muscle to avoid the unpleasant sensation, but said that this is not usually done as there's only the skin to support the implant.  I'm left feeling a bit fed up about it all - especially as I was also told I wouldn't be able to drive or do housework etc for 4-6 weeks afterwards, so potentially worse than after the mastectomy. Has anyone else had an implant put over the chest muscle and was it successful? Did it really take that long to recover afterwards or are they just being cautious.  It matters to me as I need to drive for my work. Am wondring if it's worth all the hassle if it might not give a good result. Any info gratefully received. Janet",
      "MessageIndex": 0,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/35053/implant-over-chest-muscle",
      "Title": "Implant over chest muscle"
    },
    {
      "AuthorID": "Jaloco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaloco",
      "Content": "Hi Jo I had a right mastectomy aobut 2 months ago with a temporary implant inserted to keep reconstruction options open for later on.  I am so lucky in that the cancer hadn't spread and so no further therapy needed - enormous relief. However there were calcifications also showing on the mammogram of my left breast and I feel now as though that one is just like a time-bomb ticking away until it too will need surgery. I have to decide soon what sort of reconstruction to opt for on the right side, but am also wondering about asking for a prophylactic mastectomy on the left side so I can be rid of the worry of having cancer develop on that side too and could then also have the best possible matching reconstructions done.  Did you have any difficulty getting an elective mastectomy funded? I don't have any family history of breast cancer so wonder if I've got enough of a case. Do the powers-that-be accept that the stress and worry associated with feeling constantly under threat of cancer is sufficient to warrant the operation? Also very interested to read your comments about the tummy versus back methods. I am so pleased that you are really happy with the outcome.  Thank you for sharing your experience here - it's been very helpful to me. Best regards Janet  ",
      "MessageIndex": 11,
      "PostDate": "19/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33030/bi-lateral-mastectomy-with-diep-reconstruction",
      "Title": "bi lateral mastectomy with diep reconstruction"
    }
  ]
}