{
  "AuthorID": "James UK",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/james-uk",
  "Posts": [
    {
      "AuthorID": "James UK",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/james-uk",
      "Content": "Hi there, so happy to hear your treatment has gone well and you’re free of this awful disease! It does give me hope.  Everything is moving so fast yet we don’t know the full picture yet. I can’t stress enough what great health she’s been in, no cancer before, and the night before she was diagnosed she was doing her intensive exercises classes as usual. Today we walked 10 miles before rushing back for her hospital appointment tomorrow morning. It’s so hard to fathom, the diagnosis has knocked us for six.  Very best wishes to you, long May your good health continue. ",
      "MessageIndex": 14,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152525/has-anyone-had-a-ct-scan-before-diagnosis",
      "Title": "Has anyone had a CT scan before diagnosis?"
    },
    {
      "AuthorID": "James UK",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/james-uk",
      "Content": "Hi LeoLady, My partner and I have just travelled back home urgently after getting a call this afternoon for her to go to “an urgent bone scan” tomorrow morning. She had her breast cancer diagnosis last Wednesday and her CT on Sunday.  We’re both just so afraid right now, we’re not told why exactly they’re doing things and are fearing the worst. I’m terrified of losing her.  Do others here have any insight into how certain hospitals diagnose? Totally at a loss to know what’s routine and what’s seriously wrong.  So worried right now...",
      "MessageIndex": 10,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152525/has-anyone-had-a-ct-scan-before-diagnosis",
      "Title": "Has anyone had a CT scan before diagnosis?"
    },
    {
      "AuthorID": "James UK",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/james-uk",
      "Content": "Thank you so much Sue,  We’d got away from where we live for a few days and got a call to come back immediately. It’s the way they described it as “urgent” totally threw both of us. Because she had the CT scan on Sunday we assume that they’ve requested the bone scan because of this, that’s why we’re particularly worried.  We walked 10 miles today and she’s been in fantastic health, it’s so hard to fathom anything right now.  Thank you so much for your speedy response. I hope there is better news soon. Very best health and happiness to you also xx",
      "MessageIndex": 13,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152525/has-anyone-had-a-ct-scan-before-diagnosis",
      "Title": "Has anyone had a CT scan before diagnosis?"
    },
    {
      "AuthorID": "James UK",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/james-uk",
      "Content": "@leolady56 (hopefully I’ve done that right...), thank you so much. The replies were all very helpful! We got away but then had the dreaded call from the hospital requesting she attend an “urgent bone scan” the next day so we had to rush back to where we live that evening. Utterly stressed but the scans preliminary findings were that “nothing nasty” had been found. That’s what we were told at the scan by the lady who was doing it.  My partner has a further MRI tomorrow and a biopsy on a lump they so far haven’t inspected next week. We were also told today that she will get her results at a meeting on April 3rd. Already my mind is racing at the prospect of attending this and how we ought to prepare. How do people get through it?  We’re trying to stay positive. The bone scan looks clear, her health is otherwise great, and she has virtually no symptoms - the breast pain is mostly from the biopsies right now.  I hope your course went well, it’s a fantastic thing you all do.  Best wishes, ",
      "MessageIndex": 16,
      "PostDate": "21/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152525/has-anyone-had-a-ct-scan-before-diagnosis",
      "Title": "Has anyone had a CT scan before diagnosis?"
    }
  ]
}