{
  "AuthorID": "Jammyfiona",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
  "Posts": [
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Jen you have had to wait a long time and realky feel for you as that time is already very difficult with all the worry.  As others have said it wont make a difference to the outcome of the cancer but definitely make this your platform for making sure next steps happen more quickly. best of luck for 16th. fiona ",
      "MessageIndex": 6,
      "PostDate": "12/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106497/waiting-and-more-waiting",
      "Title": "waiting and more waiting :("
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Funda I am just like you, invasive ductal breast cancer. I am new to the site too and recovering from surgery. I had mammoplasty and a lumpectomy and the sentinel node biopsy done too. Like you I have. Like you I have been told it is in my lymph nodes. I get upset when I found that out but my surgeon said that I should not be concerned because it was treatable and they would treat it. My cancer is triple negative so chemo and radiotherapy will be the next phase.  My friend bought me a nutrabullet which I am going to experiment with and a friend bought a voucher for me to see a nutritionist who specialises in seeing people who are going through chemo. I will post anything that is of interest. I am waiting to find out when my chemo starts.  I hope we can get to know other as it appears we are on the same path at more or less the same point!  Fiona  ",
      "MessageIndex": 3,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100948/new-to-this---saying-hello-and-looking-to-connect",
      "Title": "New to this - saying hello and looking to connect"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Mistia I just wanted to say hello. I am also grade 3 TNBC . Starting chemo in December. ",
      "MessageIndex": 13,
      "PostDate": "21/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100948/new-to-this---saying-hello-and-looking-to-connect",
      "Title": "New to this - saying hello and looking to connect"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I felt that the images she used on her pre surgery photo..'I have cancer' and post surgery ' now I do not' were very simplistic. It may have been a comfort to her to feel that way but that will not be the experience that many woman have. It was a simplified media sound bite and these things get media coverage but they don't tell the whole story.   ",
      "MessageIndex": 9,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101010/anybody-else-been-victoria-derbyshired",
      "Title": "Anybody else been Victoria Derbyshired????????"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I have just watched it too after reading your comments and I think this next phase of her experience is much more authentic and considered. I really didn't like the way the mastectomy was portrayed although I accept that was her experience and personal to her. The difficulty is the way her experience is extrapolated to become the media version of BC. I think the chemo was handled much better. I think what she is doing is good. ",
      "MessageIndex": 24,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101010/anybody-else-been-victoria-derbyshired",
      "Title": "Anybody else been Victoria Derbyshired????????"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "What a great idea! I am still using the scalp oil and my hair is making a return with hair that looks less like baby fluff. i still look bald but the next month is going to be significant i think....in any case I love the smell of the oils abd it's just partook my morning routine after putting oil on breast scars and moisturising my face.  Hope your hands and fingers continue to improve! And thanks for sharing another great idea!  Fiona",
      "MessageIndex": 1,
      "PostDate": "26/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107121/sore-hands---revelation",
      "Title": "Sore hands - revelation!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Bunty-ann as has already been said people will tend to post if there is a problem and not post if there isn't! Also when people have side effects they might be posting just to check in that others had got that too...so it was almost a way of connecting with people while going through a shared experience.  I finished chemo 2 months ago. I had a variety of side effects but I'd do it all again if I thought it would stop recurrence.  like many people I felt super anxious at the idea of chemo. but the reality is you get through it. It's no picnic but you keep a perspective of why you are enduring it. Each chemo I did took me one step closer to the end of treatment. I have a 7 year old son and I am going to do everything I possibly can to see him grow up. So every side effect was tolerated and overcome.  i hope you get a good news regarding the heredity component. I understand you must be worried too about your daughters I am sure they will be a great support to you over the next few months. I think we do this for our family to do all we can to have more time with them.  you will get through this because you will discover how strong you really are. fiona",
      "MessageIndex": 5,
      "PostDate": "22/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109449/chemo-consult",
      "Title": "Chemo consult"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Papa smurf you are bound to feel anxious. the thing to remember is that all the science and knowledge is making sure that you move forward in the best possible way for you and your personal stats. If you get chemo while unpleasant you will have the comfort of knowing that it is necessary and making a difference. if you don't require it then that's the best option in your personal case. let us know how it goes we will be thinking of you fiona",
      "MessageIndex": 3,
      "PostDate": "14/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106593/scared-about-today",
      "Title": "Scared about today"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Next week on Good Friday I will have my last cycle of chemo. I have been reflecting on what I have learned about myself from the chemo experience. There are 5 themes. Here's my list. 1. About Courage. I am risk adverse, a total coward. I never seek out thrills and theme parks make me sick. I am not ashamed to admit that. At 1am this week I was lying in hospital with a head injury, requiring a blood transfusion and waiting as the medics tried for the 4th time to get a blood sample from my exhausted veins. And I thought....this requires courage. I know I have no choice, but I think I have been brave. Not just during this minor assault but since discovering the lump in my breast in September last year. I know many of us are uncomfortable being described as 'brave', but I have decided that I am and that is the first thing I have learned about myself. 2. About Gratitude. I am very lucky. I was lucky before I had cancer and I am still lucky now. After chemo, I have a few days where all I feel is the side effects. I don't feel pleasure in my usual things, in food, in music, in fun. I don't sleep well. But as the days pass things come back to you, you might sleep better, to be able to taste a grape, or go to the toilet (that's been major for me) and after these events you feel intense gratitude. This week I have felt gratitude for things I would never have thought of before. I am grateful to the person who donated the blood I had transfused on Monday night. It has made a huge difference to my ability to get about. I am grateful that chemo will give me the chance to get better. I am grateful it will soon be over. 3. About Compassion. I started visiting the Macmillan site after my diagnosis. I was lonely and scared. Every time I asked a question, someone would say 'that happened to me too, ' or ' it gets easier,' People used their difficult experiences to help me and that's what I needed the most. It was such a dark time but there were people there all along. The more they reached out to me the easier it got. I made connections with people through the experience I have had and I understand how totally essential that is for me and for others. When people post on Macmillan for the first time, I remember. I remember the fear and confusion and the pain. I remember the anxiety I felt before my first chemo, I feel for them. 4. About Knowledge. I have learned a lot about breast cancer. Not near as much as others but enough to help others sometimes. It feels good to do that, to help people as I have been helped myself. That knowledge empowers people to ask questions and to not always accept things we are uncomfortable with. Knowledge is power. I know how it feels to experience chemotherapy. I expect to be asked about that experience many times over the next few years and will always be honest and open about it. 5. About Acceptance. I knew at the beginning of this experience that there would be things I had no control over. I had no control over how I would be affected by chemo. I had to accept the side effects, there was trial and error with anti-sickness meds and steroids. In the same way I have to accept that I have no control over how effective chemo has been. Since I had my surgery first I won't know how chemo has impacted on my cancer. I have to accept that I can't control the outcome, no one can. But I can control how I move forward from chemo. This is my life, it is not a certain thing but I can still enjoy it and experience happiness in it. I won't miss chemo! But I do believe that enduring it has made me a stronger and more compassionate person. I hope that feeling will help me as I move forward to the next phase of treatment and beyond, back to my life! Fiona...xxx",
      "MessageIndex": 0,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106758/farewell-to-chemo",
      "Title": "Farewell to Chemo!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Jen72 i don't think you are having a rant and you are not being too emotional. i don't think your husband knows as much about cancer as he thinks he does. My husband isn't really one for talking about his feelings and sometimes when I'm talking about how things are for me I can see he is listening but I know he feels a bit hopeless because its a problem he can't fix. I suppose you could say that cancer is the ultimate problem that can't be fixed by your partner...,however much they might want to. he is not supporting you the way you need but perhaps he is in denial.....and just wants the problem to go away. I am trying to understand why he's being a bit useless here. Maybe he is struggling with this in a way that he can't articulate but I do think that you need people to talk to especially if he is not in a position to listen to you in a supportive way.  Cancer doesn't always bring out the best in people but you deserve better than this.  Fiona",
      "MessageIndex": 3,
      "PostDate": "24/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105759/husband-remark-to-cancer",
      "Title": "Husband remark to cancer"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Mike B thank you so much for that thoughtful and considered reply. i am so glad that you have the support of your wife and lovely family and that this has given you what you needed to fight. i feel I have an enhanced feeling of how lucky I am to have my life and the wonderful people in it. It is as you say a life worth fighting for.  Thanks for your comments they mean a lot!  Fiona",
      "MessageIndex": 12,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106758/farewell-to-chemo",
      "Title": "Farewell to Chemo!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Debbie  I think that's amazing that your daughter was able to do that. I think she will always be glad that she was there with you. I have taken a different friend with me for each chemo and we have always had a great chat and good fun. It helped so much. thanks to everyone for responses to my post. I was highly anxious before starting chemo and so the fact that it has mainly gone ok has been both a relief and a surprise. The fact that there have been positives that have come from chemo is hugely surprising to me but it's true.  The connections we make with each other are what keeps us going. I have been totally humbled by the things people have done for me.  Fiona",
      "MessageIndex": 20,
      "PostDate": "18/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106758/farewell-to-chemo",
      "Title": "Farewell to Chemo!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello sarah i totally relate to that feeling of contentment and related to that and perhaps weirdly.....I worry less. You'd think you would worry more but I was quite an anxious person....especially at work.  Fiona",
      "MessageIndex": 11,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106758/farewell-to-chemo",
      "Title": "Farewell to Chemo!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "hello Lizz this article has really annoyed me For 2 reasons. firstly she treats her experience of chemo as if it affects everyone the same way which is obviously not the case. I often compare the chemo experience to childbirth becayse everyone has a different experience and you get the horror stories which can terrify you before you know how it will be for you. It is very unhelpful. secondly she wonders why the hair replacement info is not widely shared....probably because most people don't have the resources to spend thousands of pounds on sticky on hair. I know hair loss can be very upsetting for a variety of reasons but  both my friends with BC did cold cap and it worked for them. i didn't use it because I hate the cold and didn't want to have the time spent doing chemo prolonged. So i was bald for 4 months. I didn't love that experience but I had a wig which I could have worn if I wanted to. I didn't though and that was my choice. i understand the yearning for normality because getting cancer takes that away from you but I put those feelings into doing normal things with my kids and my friends when I felt well enough inbetween cycles to do that. I often felt happy at those times and it helped me get through chemo.  you will get great support going through chemo and the chemo club thread is great, this article not so much! fiona",
      "MessageIndex": 4,
      "PostDate": "03/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109960/decca-aitkenhead-in-the-guardian",
      "Title": "Decca Aitkenhead in the Guardian"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Jaki i hope you get the low score you are hoping for. Becoming a mum for the first time can leave you feeling so vulnerable even without adding in this horrible factor.  my children are 7 and 12 but like you I was worried about how chemo might effect my ability to look after them as my husband works away from home.  I have only had a couple of people telling me that 'I'll be fine' it's the one comment that I just can't let go. I always start off by saying that actually right now nobody knows how I will be be....not me, not the doctors, not anybody because the facts are are right now my future is uncertain so while I'm all for positive thinking I like to ground that thinking in realism and facts. I am learning to accept that uncertainty and it helps me if other people can learn to do that too. I find that since saying this people are less likely to tell me that I'll be fine! i understand also that friends and family want to help and that sometimes their words are just evidence of how helpless they feel in the face of this. Good luck with the score and hope you get the outcome you are looking for and can enjoy your time with your precious daughter. fiona",
      "MessageIndex": 2,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102215/anyone-been-diagnosed-after-having-a-baby",
      "Title": "Anyone been diagnosed after having a baby"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "A wee poem inspired by my experience with Taxotere....!  Meet my friend called Mr Pain Get used to him you'll meet again. It takes 3 days before you get An experience you won't forget! How shall I compare thee? How can I try? Like being hit with a stick Till you cry and you cry. Like being put on the rack It's medieval that way. Like walking on coals Oh how can I say? It's vile, it's awful, but this much is true Cancer hates it as much as you do. So when you're sick and tired of trying Remember the feeling of cancer dying.",
      "MessageIndex": 0,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105530/after-taxotere",
      "Title": "After Taxotere..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thanks for that info about the tea. I will need to try white tea and experiment a bit more.  Fiona",
      "MessageIndex": 4,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102447/lifestyle-changes",
      "Title": "Lifestyle changes?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thanks for those comments and that helpful advice re yoga. My teacher was also a close friend so I think that will help and I will be starting at a very basic level. I think I need to get some basic poses into my daily routine. ",
      "MessageIndex": 10,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102447/lifestyle-changes",
      "Title": "Lifestyle changes?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I start radiotherapy on the 19th May which is exactly 8 months to the day after I found the lump in my right breast while having a shower. I am having 19 sessions.It will be two months since I had my last chemo. It will be 7 months since I had my breast surgery.  I have been feeling really reflective today. I still visit this site every day because I feel supported here and I want to connect with others going through this too. I have been really up and down over the last two months. I honestly (stupidly) expected to feel better as soon as 3 weeks had passed after my final chemo.  I was frustrated when I still felt tired and achey. I caught a stinking cold that took 2 weeks to shake off and I have been mortified by how much weight I have put over a very short period of time.  However, I am doing my best to eat well. I continued to walk my dog almost every day during my illness. I have started yoga and once my rads is finished I'll go back to swimming twice a week.  I've changed my photo to reflect what I look like now....2 months of hair growth....very fluffy but it's almost a buzz cut! I have decided that chemo is a poor beautician and a worse hairdresser!  Im not sure what this thread is about really except I wanted to just check in and say thanks for all the support I've had a various points during this experience. God only knows what kind of state I would have been in without it. Fiona",
      "MessageIndex": 0,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thanks Lancashire there have been so many changes and I've coped with them but I felt really fed up with weight as I had lost loads of weight before diagnosis. The weight gain feeis unfair based on what I was eating but I do accept that chemo turned my eating habits upside down and I had extended steroids to cope with Taxotere. I am happy that I coped with chemo though and I know that's the most important thing. It's the whole identity thing isn't it.  my positive voice tells me that this is an opportunity to take back control over my lifestyle....my negative one says....not again!  Hope you are continuing to get your head round diagnosis there are loads of TNBC ladies here.  Fiona",
      "MessageIndex": 4,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Nicky thank you for that lovely comment.....now I'm crying! Not always a bad thing! Thank you for kind words...xxx",
      "MessageIndex": 8,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Clare  as ever it's the gap between expectation and reality that is the source of unhappiness! I honestly thought that I would think myself better after chemo and shake off everything that's happened. I relate to what you are saying....in particular when walking my dog....the feeling of exhaustion after doing normal things it still takes me by surprise. then having to cope with the worry and anxiety of what might be the cause of the aches and pains. I don't yet know how people deal with that. I still don't really believe that this has happened to me.I think treatment creates a unpleasant but kind of safe temporary structure to our lives which stops us from worrying about what we are worrying about now! sorry you did not get the creams from oncologist but I hope radiotherapy goes well for us both and that the next few weeks and months bring a bit of serenity to our thinking. I know that for me sharing my feelings and being understood is helping a lot. So thank you for sharing your feelings too as it helps to know that I am not the only one! hugs Fiona ",
      "MessageIndex": 16,
      "PostDate": "16/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thank you fiona and Evelyn for those comments. I will check out that article online and I will have a liitle shopping trip tomorrow and get myself sorted.  and thank you for your support which I appreciate so much. Words can make a big difference...xx fiona",
      "MessageIndex": 19,
      "PostDate": "16/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Funda connecting with people has made every step easier and the load lighter. I so relate to your description of where you are at. I also find myself remembering the various stages of pre diagnosis and post from surgery to chemo. I am talking about it again....it's almost to remind myself that this actually did happen.  I hope the tamoxifen works well for you! fiona",
      "MessageIndex": 21,
      "PostDate": "17/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Those are amazing changes! That's great that your gym does classes especially for people who are recovering. I walk my dog too and that is the only source of exercise I am doing at the moment. I used to swim twice a week though before diagnosis and will return to that. ",
      "MessageIndex": 2,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102447/lifestyle-changes",
      "Title": "Lifestyle changes?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello fiddlesticks  yes I've had quite a few tearful moments too. I feel like there are some changes in me that are permanent now but others are hopefully temporary.  because the weather has been good I've been going out and about without my hat as I've been wearing it since Christmas! I felt a bit self conscious then I kind of stopped caring. the weight thing is really annoying. As I told a pal I feel like my reward for getting this far through cancer treatment is a subscription to weight watchers! But I am just making nutrition my focus for now. I do feel that my face looks less round and 'moonish' than it did 2 months ago. Bloody steroids!  I am losing my toenails but my finger ones seem OK.  I am grateful to be at this point though and sometimes I can't believe that I am. France in the summer sounds amazing!  Fiona",
      "MessageIndex": 2,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Julia i know you are right. I just don't feel comfortable in my own skin and I am finding that tough at times. Then I get a dose of perspective...thinking about what I've gone through to get to this point and I know it's not worth getting upset about.  I didn't cry much during the chemo phase and I think I am starting to feel things again....sometimes inconveniently!  I am going to just try to eat things that nourish my body because I do feel better when I eat better.  Fiona",
      "MessageIndex": 6,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Haha! I love that one! I agree they should be in a book! i am half way through and I had had no side effects so far. The only thing that had been worrying me was the 2 hour commute to Aberdeen. But I stay over at Clan on Monday which has been fab then my friends have been taking turns in driving me on the other days. I downloaded desert island discs so i can listen to them on the journey on the days I drive. even the radiotherapy waiting room has been good as we are all getting to know each other....I have a date with a 70year old on Monday....same time...same place! Lol! Hope it's been ok for you too! Xx",
      "MessageIndex": 26,
      "PostDate": "29/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I drink tea all day long given the chance so having some of the healthy stuff and less caffeine sounds like a plan. There is a mindfulness mediation class on offer at hospital so I want to do that and find ways to incorporate it into my daily schedule.  One thing I am going to start doing is a yoga morning stretch salute to the sun type thing....incorporating gratitude because in theory that's a good idea....in practice I was always too rushed in the morning to do it....after always being too late in bed.",
      "MessageIndex": 6,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102447/lifestyle-changes",
      "Title": "Lifestyle changes?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello notaquitter I am also a primary teacher. I was working 3 days a week but doing a support for learning job so basically working with pupils with dyslexia, autism or a diverse range of needs. Too long a story to explain but I was thinking about taking a more permanent version of this job in my school but I knew it would mean working more but not getting more money! Also carrying the can when the inspectors come.  I totally understand where you are coming from.....people tell you that life is too short but it really is too short to be wasting it being stressed out when you have been so ill.  Fiona",
      "MessageIndex": 13,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102447/lifestyle-changes",
      "Title": "Lifestyle changes?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I was talking with a friend today about how I feel I need to live my life in a different way once my treatment is over. I am triple negative so I know hormones were not a factor in stimulating the cancer to grow and I am still waiting to hear if I have the Gene mutation.  I have read about mindfulness meditation and being part of a survivor support group as being beneficial in recovery so I am going to do that. I am going to start yoga...or resume it....I stopped going to class because I couldn't fit it in.  I am not going to apply for the job that I thought I should apply for because it was the natural next step for me in terns of where my career was. I knew it would stress me out. I am going to give more time to my friends and family who have got me through this shitty time. I am going to try and eat better food....antioxidants etc. I might drink green tea instead of tetley! That kind of thing. I just wondered what changes, if any, people planned to make to their lives and why?",
      "MessageIndex": 0,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102447/lifestyle-changes",
      "Title": "Lifestyle changes?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thank you julia helsbels and Lynn for your kind comments and sound advice. I have decided to go and buy some cheap jeans and tunic style tops to keep me comfortable while I've got this extra weight. Just to tide me over until summer time. My clothes are tight and it's making me feel much worse!  That said I feel better for acknowledging that it is bothering me. I think I felt kind of guilty for worrying about something like that when there are big concerns about the obvious stuff. Thank you...xxx",
      "MessageIndex": 13,
      "PostDate": "16/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109196/a-bit-of-a-ramble-and-a-thank-you",
      "Title": "A bit of a ramble....and a thank you!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I am 4 months on from chemo and have completed treatment. I'm Triple Negative so not getting hormone therapy.  I haven't had a period since my 2nd cycle of chemo and that combined with hot flushes and other aches in my joints lead me to suspect that I it has triggered an early menopause. I've had my kids so not over troubled but because my mum has osteoporosis I have asked my doctor for a bone density scan to see if I am at risk. Due to being TN I always knew I would get chemo and I just hope it has worked but I feel a bit neglected my by Doctor. I had such great care during treatment but now I feel a bit like chemo has impacted on my body in ways that I might not even understand and it doesn't seem as if follow-up care is offered.  My younger brother had bowel cancer the year before I was diagnosed with BC so I am now getting screened for that too. This was supposed to happen before I got my diagnosis but the Dr didn't get back in touch after promising to do so. I don't want or need to be at the Dr's now..I don't think its a psychological need I am feeling but I know that nothing would have happened if I hadn't gone up to surgery to ask. Has anyone else experienced damage after chemo and had to ask for specific support or scans? I knew so little about cancer before that I don't even know what kind of damage people do cope with. Fiona ",
      "MessageIndex": 0,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111964/long-term-impact-of-chemo",
      "Title": "Long term impact of chemo?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thanks Julia Whenever I tell my friends that my periods have stopped their immediate response is ....lucky you! Obviously if I hadn't already had my family they wouldn't say that but they are seeing it from the perspective of convenience rather than health! I was as regular as clockwork and unlike many of my friends wasn't bothered with problems connected with my periods. However I accept either outcome....that they are gone or may return. The latter is better given the osteoporosis risk associated with reduced oestrogen levels.  I should have talked about thus more fully with oncologist but I felt I was wasting their time as its not major and aged 43 the menopause wouldn't have been a really long way off...although after cancer 5 years definitely has a different value.  this is only the 3rd time I've seen my doctor during this process which includes the original visit after I found my lump. It feels a bit like I couldn't move for health professionals telling me that I might find things difficult emotionally after treatment concluded but I didn't get told very much at all about the physical long term implications of chemo. That said I do not regret having it and do feel that  given how hard it was on my body...it must have been hard on the cancer too!  The upshot of that is I feel happy and optimistic....but the aches and pains are a reminder of what I've been through and I don't know if they are a direct consequence simply of the menopause or something else....feel a bit clueless in that respect.  Fiona",
      "MessageIndex": 5,
      "PostDate": "16/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111964/long-term-impact-of-chemo",
      "Title": "Long term impact of chemo?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thank you susieMB thats good to know that you felt achy too but that it has eased in time. Patience has never been my best quality so I always feel I should be further on or better etc!  You'd think that after this experience I would be more accepting of things as they are rather than as I think they should be! the thing is I know that the T part of chemo hit me hard and so it's not surprising that I would still be experiencing chemo related difficulties.  Glad you are also enjoying the yoga....I really am too!  Fiona",
      "MessageIndex": 18,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111964/long-term-impact-of-chemo",
      "Title": "Long term impact of chemo?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Helen Thank you for that compliment...it is much appreciated! Xx I am going to a yoga class next week at my local cancer centre and I am looking forward to it and catching up with my other ladies. I've been doing yoga at another class and am enjoying it but it's hard! Xx",
      "MessageIndex": 2,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111964/long-term-impact-of-chemo",
      "Title": "Long term impact of chemo?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thanks everyone...both for compliments on my 'do' and info! I do accept that scans are not offered to detect the possibility of recurrence although ironically my friends and family who have not had experience of BC find this very surprising and I am often being asked about that at the moment. My understanding is that early scanning and detection does not change prognosis in terms of recurrence of a secondary nature. I have made my peace with that. I think I am more concerned with improving the functioning of the bits of my body that appear to have been damaged.  The ache I feel in my body after I've been sitting in one position for a while is a new thing for me and I'm trying to establish if it is temporary or permanent. I feel my body and joints have aged and sometimes seized up altogether. My oncologist did say to contact him anytime but I took this to mean if I thought the cancer had come back ...otherwise I see him in 6 months time.  I actually have no pain or discomfort related to my surgery at all so I can see by some responses here that I have been lucky in that respect.  I feel so old inside though....but appreciate it's still early days.",
      "MessageIndex": 13,
      "PostDate": "16/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111964/long-term-impact-of-chemo",
      "Title": "Long term impact of chemo?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Teresa congratulations on finishing treatment....it's such an indescribable feeling....happy/sad/ angry/ frustrated/ grateful all rolled into one! re arthritis ...that is exactly how I feel! I'm just not sure what the cause is though or if it will ease.  I am starting to look better on the outside but it's the inside I'm worried about.  Are you going to wait and see if it gets better or do you have a plan? fiona",
      "MessageIndex": 17,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111964/long-term-impact-of-chemo",
      "Title": "Long term impact of chemo?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Karin let us know how you get on on Thursday.  With regard to people who say insensitive things while meaning well I know exactly what you mean! One of my friends is a very supportive friend and would do anything to help but she just couldn't handle conversations where I expressed my fear about my uncertain future, so everything was gobstopped with \"you'll be fine! \" I took no comfort in that whatsoever and found it really irritating! On the other hand her actions showed that she was there for me. You will get a very quick sense of who you can forgive for saying the wrong thing and who isn't worth the effort.  I had a few rubber neckers too who seemed much more interested in me after I had cancer and I struggled to get my head round whether that was kindness or nosiness!   I have a clear sense of who my friends are now and I feel that has been a positive outcome in a difficult situation. fiona",
      "MessageIndex": 23,
      "PostDate": "06/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114391/hi-im-newly-diagnosed-with-invasive-breast-cancer-scared-and-looking-for-support",
      "Title": "Hi im newly diagnosed with invasive breast cancer, scared and looking..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Maria I was really sad to hear how your family have been with you. It must hurt so much and I think getting counselling would be a great idea.  My brother just finished treatment for bowel cancer the day I was diagnosed with breast cancer. It was horrible for both my mum and brother. It really upset my brother to know I was going to go through what he had just come out of. Congratulations on getting through it all....you did it in spite of your family. Family should be a source of support and not of pain. It is very sad to read the effect they have had on you. You have had lots of great advice from people already but I really just wanted to say that you do not deserve to be treated that way and agree that putting a bit of space between you and them might be good.  I hope you can move forward from this and enjoy your life with the family you have made with your husband. Fiona",
      "MessageIndex": 17,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104012/extended-family-have-turned-their-back-on-me",
      "Title": "Extended family have turned their back on me"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello karakeys sorry about your diagnosis. As Helen said many of us find this early stage the most difficult time. It's hard to believe but it does get better.  I have completed treatment now but drew much comfort from this site in those early days and especially during chemo where I picked up many tips from others who had gone before.  Weirdly once your treatment starts your life takes on a kind of structure that revolves around each step in the process. Each step bringing you closer to where you need to be. You are not in control of that perhaps but you are in control of how you handle it, being prepared and becoming knowledgable about the type of cancer you have. All these things helped me. it is scary but you will have the support of people at all different points in this experience. if you have any questions feel free to ask fiona",
      "MessageIndex": 3,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114391/hi-im-newly-diagnosed-with-invasive-breast-cancer-scared-and-looking-for-support",
      "Title": "Hi im newly diagnosed with invasive breast cancer, scared and looking..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "That's really difficult and I can understand your worry. I was off during treatment although I know some people are able to keep working on a more flexible basis.  Hopefully someone will post with info about financial support available as the last thing you need is to be worrying about that on top of everything else. fiona",
      "MessageIndex": 5,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114391/hi-im-newly-diagnosed-with-invasive-breast-cancer-scared-and-looking-for-support",
      "Title": "Hi im newly diagnosed with invasive breast cancer, scared and looking..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Julia I am pretty confused about this part of the process. As you say 6 out 8 of my nodes did not have cancer. When the surgeon did the SNB he said that he took out more than usual because they did not look good but that they wouldn't know for sure until the biopsy. When I got the results of the biopsy which I had been dreading I  felt that 2 out of 8 was a good outcome all things considered. They have said all along that my lymph would need further treatment though. I am worried about lymphadema and saw the nurse yesterday about swelling in my arm and armpit area. She says that she doesn't think it's lymphadema but obviously will have to monitor. I did ask my nurse yesterday but she couldn't tell me what factors will determine the course of action they decide upon.  i feel like I have been fairly well informed at each part if the process until now and I don't like that! thanks for that info about your experience it is really good to speak to someone who has had this too. fiona",
      "MessageIndex": 2,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Jayne thanks for your response! i also declined that trial as I am TN and cancer was grade 3. I felt that I wanted my treatment to be personalised to my needs rather being decided randomly. As the recurrence rate for TN Is higher I felt this was a risk I was not prepared to take. I was actually unhappy about the info about the trial because it was available to those with 1 or 2 lymph nodes affected but the risk for those with TN or Her2 + would be higher and that was not made explicit I felt.  i have since found out that I will be getting rads to axilla in addition to tumour site and am happy to go with this decision.  Fiona",
      "MessageIndex": 19,
      "PostDate": "05/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello silvercloud I feel for you having to make that difficult decision. I am also 43 with young children but because I am triple negative i knew that I would get chemo and that it would make a big difference to my prognosis. I finished chemo 6 weeks ago and am about to start radiotherapy. I was really anxious about having chemo but in some ways it wasn't as bad as I thought it might be. You get through it. I am glad that I was able to tolerate it in order to give myself the best chance of survival but of course there never really was a choice for me and clearly there are no guarantees either.  As others have said....it's your choice and once you have made it you have to feel that you can live with it.  Good luck fiona",
      "MessageIndex": 20,
      "PostDate": "04/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108705/making-the-right-decision",
      "Title": "Making the right decision"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Dee thank you so much for your honesty in describing the outcome that removal of your lymph nodes had for you. I totally agree about fear of the cancer diagnosis affecting decision making also because sometimes the decisions are made for us and sometimes we don't have the information required to make an informed decision. I 100% agree we need to be asking those questions and it's very hard because we are being flooded with new info about the cancer as well. i appreciate you taking the time to share your experience so much and reading such accounts makes me feel more secure about the option of radiotherapy rather than further surgery. Although I know there is still heightened risk there now. thank you fiona",
      "MessageIndex": 22,
      "PostDate": "06/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I had 8 lymph nodes removed during my breast surgery but because cancer was found in two of them it will require further treatment once I'm finished chemo. I have 2 questions. First does anyone know on what basis they decide to go for surgery clearance rather than radiotherapy to lymph? Second would anyone who has had clearance surgery separate from breast surgery share their experience?  If they do the surgery then that will happen before radiotherapy and I would just like to know more about how manageable that is....although after chemo I can't actually imagine it being worse!  Thank you Fiona",
      "MessageIndex": 0,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Good luck for tomorrow yvonne.... My surgeon told me my lymph nodes didn't look good when he did SNB and I was so worried about getting biopsy results. So I know how horrible that feels.  I am grade 3 invasive ducal too but TN.  Thinking of you for tomorrow. fiona",
      "MessageIndex": 3,
      "PostDate": "09/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106393/results-tomorrow",
      "Title": "Results tomorrow"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thank you Julia, dreamthief, susie, positive and chloe for those replies. That is so helpful. i realise how little I know about this and that info will really help me with questions once I see consultant again. I am worried about lymphedema. I had mammoplasty breast surgery at the same time as the lumpectomy and SNB and was really happy with the outcome and recovery so am not keen to have more surgery if it can be avoided.  Fiona",
      "MessageIndex": 8,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Pop I also have breast cancer that has spread to the lymph. I had my surgery 2 months ago.  I started chemo this month. Like you I was very scared. Everyone's experience of chemo is individual to them but I can honestly say that while I did get side effects it wasn't as bad as I thought it might be. I had FEC and will get T for cycle 4,5 and 6.  I get my second cycle on the 30th and while I am not looking forward to it....I am no longer anxious about it.  Fear makes the wolf bigger than it actually is....that describes my experience but I understand that for others  that may not apply. I felt quite down on the 3rd day after my first chemo I think in part because I had psyched myself up to do it then felt quite deflated after realising how many more there are to do. But the time has come round quickly and I have been happy in between and busy seeing friends and enjoying my life as much as possible.  Each chemo I get moves me forward to where I want to be and closer to recovery. That's the mindset I am using to handle things.  You will get great support here! Fiona.",
      "MessageIndex": 2,
      "PostDate": "21/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102742/recently-diagnosed-breast-and-lymph-node-cancer-chemo-in-january---feeling-scared",
      "Title": "Recently diagnosed breast and lymph node cancer. Chemo in January..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Funda  I have the same thing except my periods stopped after my second cycle of chemo. I asked consultant if I might now be going through early menopause ( I am 43) .....the consultant told me .....maybe but that it wasn't a reliable form of contraception! How I laughed....! Like I need contraception right now! He said the flushes would be hormone related and are re-adjusting. I am going to go to the doctor if my periods don't come back though.  Fiona",
      "MessageIndex": 3,
      "PostDate": "22/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108204/feeling-hot-and-cold-at-night",
      "Title": "Feeling hot and cold at night"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello pepys What a lovely positive and inspiring post!  Its great to know that there will be good things again. sounds amazing too!  Fiona",
      "MessageIndex": 8,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Good luck for tomorrow Lynn. I felt so much better once Id got my first one done. Then you know what you are dealing with. I ate a lot of melon after FEC....and tomato soup. I wasn't exactly a model of nuttition though!  Fiona",
      "MessageIndex": 14,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109160/chemo-starts-tomorrow",
      "Title": "Chemo Starts Tomorrow"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello. Lynnwad I used the black nail polish with a layer of hardener too for the Taxotere bit of chemo. I wasn't sure if it would work but I thought it was worth a go.  I used it every time for cycle 4, 5 and 6.  My fingernails are fine....but every one of my toe nails has turned purple and is in the process of falling off. It does reflect the fact that when I had Taxotere my feet were really sore but my fingers were OK. A bit numb but no pain.  i don't know if wearing the polish made a difference but it's an easy thing to try and who knows!  Fiona",
      "MessageIndex": 12,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109160/chemo-starts-tomorrow",
      "Title": "Chemo Starts Tomorrow"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "hello Judy I agree with everything you said on this subject. Before I got cancer I remember Jessie J shaving her head for charity and everyone saying how brave she was and I didn't think it was brave. It's good that she raised money perhaps but certainly no awareness. Now I have had cancer and have been bald as a result of chemo I would take no comfort at all in others doing this either to fundraise or in some misguided attempt at empathy. How you react to losing your hair is personal. I knew it was a temporary thing and viewed it that way but the idea that others would shave their heads and therefore feel they have insight to the experience of having cancer is just the dumbest most insensitive idea ever.  I am glad to know others feel this way as I thought it was just me!  Fiona",
      "MessageIndex": 13,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Agreed Karen I found T difficult especially the first time and I was vocal about that. But I got through it and knew as pointed out by dreamthief that a reduced dose was an option. I chose to continue with it and my 2nd and 3 red cycle were manageable and not as unpleasant.  The experience of going through chemo is a personal one....to me the experience reminded me of childbirth because people had their stories and some were scary and traumatic but the vast majority got through it relatively well.  In any case a few months later  it almost feels like it was somebody else doing those cycles.....except for a few longer term chemo related gifts!  I am so glad I got through it and would hate to think that fear results in people opting out of treatment....until you've had it you don't know how it is going to affect you. fiona",
      "MessageIndex": 2,
      "PostDate": "17/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112013/taxotere-please-stop-panicking",
      "Title": "Taxotere.........please stop panicking!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello papa smurf i cant answer your question about whether being not being able to feel the lump is good or bad but just wanted to say hello. I joined this site at the same point as you just before surgery and SNB. At the moment you probably have lots of questions that have not been answered yet. I got the results of my breast lump biopsy 3 weeks after my diagnosis and I found that really helpful as I had a much clearer idea of what I was dealing with, the type of cancer etc. it may be that your question can only be answered by waiting unfortunately and that's the difficult part. Please do continue to post with questions or concerns.....or if you want to rant, cry etc we will will listening. fiona",
      "MessageIndex": 4,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105000/new-diagnosis",
      "Title": "New diagnosis"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "hello everyone ive just ordered a book called tea and chemo by jackie Buxton which has great reviews about the experience of having BC.  does anyone have any recommendations for books they have read?  only 7 more sessions left of radiotherapy and I'm feeling much better....doing yoga looking forward to going back to swimming and will be returning to work after the summer. i feel like life is about to return to 'normal' but I'm obviously not feeling exactly normal but i think I'm doing ok.  Any suggestions?  I have read the online article by dr Peter Harvey about after treatment finishes already. It's very good. fiona",
      "MessageIndex": 0,
      "PostDate": "05/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110043/moving-forward-reading-recommendations",
      "Title": "Moving forward reading recommendations?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thank you both for suggestions  I just finished the humans by Matt haig which is funny and poignant. the best book I have read recently is all the light we cannot see by Anthony doerr not a light read but amazing and beautiful. fiona",
      "MessageIndex": 6,
      "PostDate": "09/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110043/moving-forward-reading-recommendations",
      "Title": "Moving forward reading recommendations?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello papasmurf you are doing all the right things exercises and walking. My surgery also involved mammoplasty so different but I was overwhelmed by how weak I felt and I also had days when I felt very low. You sound really positive. I know you will be feeling nervous about the next stage in process but just keep doing what you are doing and look after yourself ...getting your strength back most important thing. sending positive vibes back at you! fiona",
      "MessageIndex": 24,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105498/discomfort-increasing",
      "Title": "Discomfort increasing"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello papasmurf you are doing all the right things exercises and walking. My surgery also involved mammoplasty so different but I was overwhelmed by how weak I felt and I also had days when I felt very low. You sound really positive. I know you will be feeling nervous about the next stage in process but just keep doing what you are doing and look after yourself ...getting your strength back most important thing. sending positive vibes back at you! fiona",
      "MessageIndex": 9,
      "PostDate": "20/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105498/discomfort-increasing",
      "Title": "Discomfort increasing"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Susie I am tempted to read all his other books now but I also need to re read it to process the info as there is a lot there to take in. But the basic message is clear and accessible and it's definitely a book I would recommend. Not sure if I would make it through not the last goodbye without becoming a weeping wreck though!  Fiona",
      "MessageIndex": 5,
      "PostDate": "09/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107612/vitamins-and-supplements",
      "Title": "Vitamins and supplements?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Carol & Iona I had a look at the chorlella that sounds like an easy adjustment to make. I feel like there is so much to learn just now in terms of lifestyle changes but it is all very self directed through reading etc as there is not much info that is shared via medical routes. I have just finished reading 'anti-cancer a new way of life'  By Dr Serven-Schreiber which I feel so described how I want to live beyond this diagnosis that I was often in tears reading it. I know that I need to improve my nutrition and that will benefit my health generally, I need to continue to exercise but make yoga a central pillar in that regime. I also need to opportunities to meet with other people who have gone through this experience and make connections with them.  I hope to work one day less once I return to work to get a better balance between work and home.  I have no genetic factor and the cancer is triple negative therefore not stimulated by hormones. I might never know what caused my cancer but I do know that I could live better and that when I do I feel better so I am seriously trying to plan for that...and implement it. fiona",
      "MessageIndex": 3,
      "PostDate": "09/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107612/vitamins-and-supplements",
      "Title": "Vitamins and supplements?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Iona looks like we are both trying to do the same thing. My appetite is back though and I am trying to eat good food and get structure back into my eating.  I guess we both know that it's early days for recovery but like you I want to do what I can to facilitate it! I feel happy that I am having a good breakfast porridge and wholemeal toast a because I have time I make a juice in the morning because I like them and it makes me feel good. But in terms of vitamins and supplements etc I don't have a clue so hopefully can learn from what others are doing too. The most beneficial thing to my health will be kids going back to school on Monday! Hurray!  fiona",
      "MessageIndex": 1,
      "PostDate": "08/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107612/vitamins-and-supplements",
      "Title": "Vitamins and supplements?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I cried every single night before bed for the first month....so I drove my husband mad too....he couldn't help but was trying his best and I was putting on a brave face all day...mainly for my kids who are still young then I became a crying mess just when I needed to sleep.....it wasn't good but thankfully once my treatment plan was in place things got better. I still have some days that I worry and i think everyone does. i have had surgery (mammoplasty/ lumpectomy/ SLNB) and finished chemo 2 weeks ago. I start radiotherapy next month and once that's finished I'm done as I am triple negative so no hormone therapy.  You are right to ask the questions you need to on Friday. I have had really good care but I think sometimes the detachment required to do their job can come across in quite a blunt and stark way. Good luck for Friday. fiona",
      "MessageIndex": 11,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello  not exactly sane situation but my cancer is grade 3 and I had cancer in 2 out of the 6 nodes they sampled. The outcome for me after my surgery to remove the 30mm tumour was chemo then radiotherapy to tumour site and axilla. There was debate about whether to do further surgery to lymph but radiotherapy was expected to give the same protection as surgery but with less further disruption.  I know it's scary when it's in your lymph but my surgeon told me its treatable when I got a bit stressed by it.  Fiona",
      "MessageIndex": 2,
      "PostDate": "09/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I would make getting better your full time job for the rest of your treatment. I have been off for 6 months now and onto half pay. Worrying about how to pay bills in addition to dealing with cancer must be awful so I am glad that was one less thing to worry about. I am a teacher and I care about doing my job well and there is no way I could have done it during chemo....especially Taxotere which hit me hard. Take the time ...and get better. Fiona",
      "MessageIndex": 9,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108073/work-or-not",
      "Title": "work or not?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Teresa totally understand your desire to have a holiday ....I'm off to london this weekend for my birthday and as a treat to mark end of chemo. i am triple negative and the cancer was grade 3 and in my lymph. I was told I would get 5 weeks to recover from chemo I am seeing consultant in a weeks time to get my radiotherapy dates etc. I don't have any medical knowledge at all to contribute but that would seem to only make a couple of weeks difference if you were to start after your holiday.  I would be asking the questions Barbara suggested.Xx fiona",
      "MessageIndex": 8,
      "PostDate": "12/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107774/delaying-radiotherapy-for-a-few-weeks---could-it-be-detrimental",
      "Title": "Delaying radiotherapy for a few weeks - could it be detrimental?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Jeanied thanks for the recommendation! I read all the time...lots of different things!  Fiona",
      "MessageIndex": 3,
      "PostDate": "08/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110043/moving-forward-reading-recommendations",
      "Title": "Moving forward reading recommendations?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Sarah I started feeling ill about 2 months before my diagnosis, I started vomiting about once a week. I would lose my appetite and was not able to eat and all I could do was sleep it off I felt cold to my bones. I always went swimming on the days I didn't work Monday and Friday and it only happened on those days. I couldn't understand how my swimming would be connected though as I have been swimming for years.  Then I ended up at the doctor with a sharp pain in my side. The dr thought it might be kidney stones...I remember thinking I don't fancy having kidney stones.....that sounds rubbish....a week later I found a lump in my right breast and had my cancer diagnosis within 10 days.  I stopped swimming and was only sick one more time, after telling my children that I was ill. I haven't felt that way at all since having my surgery and chemo. I was sick after my first chemo was that was definitely because of chemo.  After I found my lump friends kept telling me that breast cancer didn't have symtoms so it couldn't be cancer.... I believe that the cancer was draining my energy capacity and that's why it only happened on the days where I was swimming. I had been pushing myself on those days. I don't know this for a fact but I think that's how it was affecting me.  I think it was connected. fiona",
      "MessageIndex": 1,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109174/dizzy-and-fatigued",
      "Title": "Dizzy and fatigued"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "It is frightening and nothing anyone can say makes it less so. When my surgeon performed the SLNB after my surgery he told me after surgery that my lymph nodes looked 'squishy' and that they would either be removed by surgery or zapped by radiotherapy after I had chemo. he was genuinely surprised when he came back into my hospital room and found me sobbing! He even asked why which despite my emotional state I found quite funny as I'd just had breast surgery, and had been told in was in my lymph nodes too...I kind of felt I had good reason to cry!  when I explained that hearing it was in my lymph worried me i did take comfort from knowing that it could be treated.  I am saying all this because you have every right to be frightened....I was too and I still am. I am also worried about the lymphedema risk which I think would be higher for me if they removed whats left of my lymph nodes.  As a new member to the site posted a few days again....this is scary shit....and it really really is.  i don't have the medical knowledge to address your concern about the time factor between the surgery abd radiotherapy caused by the chemo phase but perhaps someone else will. I hope you get some answers that will help you. fiona",
      "MessageIndex": 6,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Dear Felon i am sorry you are having such a tough time with chemo. I can't share advice about your regime as I was on FEC-T but for me the t bit was really tough too. i totally identify with what you are saying about the guilt feeling of being so dependent on husband but agree with every word Julia has written on that subject. i was a very independent person and in many ways llived a separate life from my husband because he works away from home and i was working part time and being responsible our school age children the rest if the time. Earlier on this year I did articulate to my colleagues...is it normal to feel this tired? then I felt guilty for moaning becayse many of them were working full time with children the sane age and husbands who also worked away from home or long hours.  of course it became apparent for me that it wasn't normal to feel that tired....when I started to lose weight and vomit before finding a lump in my breast. i am telling you this because my husband and I are are much closer since my diagnosis. I know it can go the other way too! But in letting my husband do more for me and more to help I feel very grateful but he also has developed a much greater appreciation of how much I was doing.....and I just felt I was doing the minimum as I am not really very house proud...minimum standards apply!  I have a much stronger feeling of being appreciated and cared for .....something I found it very difficult to do but had to accept and actually people who love and care about you want to do that. You would do that if he was in your position. I tell my husband how grateful I am for all the things he is going because that's important. I also have had to say to him when i needed more help....a conversation I hated having but I was becoming exhausted after T....and people can't tell by looking. I had lovely pink skin .....caused by steroids but was actually so anaemic that I couldn't even walk my dog. I looked well though! so well that my husband went off to work after my 5th chemo and I collapsed in the house while my children were asleep. Cue ambulance etc  now he and I are less complacent about the effects of chemo. So once again I will say sorry it's been tough so far but do not feel guilty the care he is giving you now is what a loving partnership needs to be about. Once you are better and your strength returns you will in time find that you are stronger than you have ever been and the enhanced gratitude you feel for your life and loved ones will help you to move forward from this horrible time.....that's what I want for myself and would wish it for you too. hugs, Fiona.",
      "MessageIndex": 3,
      "PostDate": "26/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107119/breast-cancer-looking-for-advice-experiences-support",
      "Title": "breast cancer, looking for advice,experiences,support"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello lizz dreading chemo and feeling scared is understandable. I am trying to understand if its those feelings alone which are making you feel that  you want to refuse chemo?  i completed chemo 2 months ago and while it's no picnic I'd do it all over again if I thought it would stop a recurrence. I always knew I would be getting chemo so I didn't have to make any difficult decisions. Perhaps when the results come back from DX test you will feel in a better position to decide. It must be really tough. For myself I feel very happy that I have done everything I could to get rid if it but I know there are no guarantees either way.  Good luck  Fiona ",
      "MessageIndex": 1,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109329/thinking-of-turning-down-chemo",
      "Title": "Thinking of turning down chemo"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello lizz im glad the result to the test has helped you move forwards towards making a decision. feelings of uncertainty are the worst and so even though you feel an understandable reluctance to do this at least you know that the chemo is likely to have a significant impact on your prognosis. I think you put up with the side effects...whatever they may be if you have clearly thought about what you are doing and why, as you clearly have.  Fiona",
      "MessageIndex": 27,
      "PostDate": "22/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109329/thinking-of-turning-down-chemo",
      "Title": "Thinking of turning down chemo"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello YorkA I felt the same as you when got the news about the lymph. I felt really worried, sad and tearful but the surgeon said the same to me...it's treatable and I hold onto that. 2 out of 8 sampled for me had cancer but I am hopeful that means that the nodes were doing their job and catching it. It is really hard but it does get better. Even with all the ups and downs of surgery and treatment it does get better.  I am in bed recovering from my second chemo cycle. And although it doesn't have much to recommend as an experience each one that I complete is moving me forward and I do feel better about that...even if I did spend some time crying last night and this morning...I am a wimp about illness!  Thinking of you Fiona",
      "MessageIndex": 14,
      "PostDate": "31/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103039/reigning-in-the-fear",
      "Title": "reigning in the fear"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello YorkA Sorry you are in this situation too. I am also 43 and have grade 3 ductal breast cancer. I have had surgery and am now getting treatment. It is so hard in the beginning. My children are 7 and 12 and because I had started vomiting and losing weight before finding the lump and getting my diagnosis I really believed that I had secondary cancer and that I would not see my children grow up. It was so painful. It felt like a bereavement.  I have gone from feeling like that to feeling positive and happy most of the time but of course our experiences are all personal and others might not feel that way. My positivity comes from accepting things the way are. Yes I have cancer, yes that's shit. Yes the cancer has spread to my lymph nodes but that is still treatable. My scans do not show evidence of secondary cancer. So every day that I can do normal things and be a mum to my boys and feel well is a good day. I have no control over the final outcome but I need to find a way through the difficult days to survive this. If I allow fear of death to paralyse me from living now then cancer will have successfully taken away even more of my life than it already has. I don't have control over many things in this situation but I do have some control over how I handle things. I go to a support group and I am active on this site....it has been a great source of support to me and the people on it a a great source of knowledge, experience and compassion.  When the appointments start filling up the diary and surgery and treatment start it does keep you busy too and leaves less time to brood.  It's not a easy path but there is only one direction to go on it. I wish you all the best as you find your way.  Fiona",
      "MessageIndex": 4,
      "PostDate": "29/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103039/reigning-in-the-fear",
      "Title": "reigning in the fear"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Helly lizzy very happy and positive post ....good to read!  Might check those out....I'm 9 weeks post chemo and my eyebrows are starting to grow back and if I hadn't dusted off my tweezers I'm pretty sure I could have been sporting a reasonable beard by now but still no eyelashes! I miss them fiona",
      "MessageIndex": 1,
      "PostDate": "03/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109962/eyelashes",
      "Title": "EYELASHES!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "That must be such an amazing feeling! Have a fab holiday! fiona",
      "MessageIndex": 4,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104684/i-think-i-am-a-neddy",
      "Title": "I think I am a NEDdy"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Yesterday I was out getting supplies at the chemist for starting chemo in 2 weeks and I stopped at a cafe for a quick snack. Just as I was about to start eating my turkey, lettuce and tomato pitta bread the song 'Radioactive' by Imagine Dragons came booming out over the radio!  It made me laugh but also starting me thinking about some songs I know and love have new meaning for me now. The song 'Hold On' by Oasis for example starts with these lines hold on....hold on .....don't be scared.....you'll never change what's been and gone. those lines feel very emotional for me now. I wondered if people would like to share songs that hold new meaning or just make them feel good! I'm making a chemo playlist!  Fiona",
      "MessageIndex": 0,
      "PostDate": "22/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101588/cancer-playlist",
      "Title": "Cancer playlist..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Craftyp  I hope you get some feedback on this ...i am 43 too and my periods stopped half way through chemo once I started T. i very quickly became anaemic after starting that cycle and having had my final chemo last week (yay!) I am still recovering.  I was wondering how long it would take to get back to 'normal'  its horrible when periods are so unpredictable so can understand how you must be feeling. fiona",
      "MessageIndex": 1,
      "PostDate": "30/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107245/periods-returning-after-chemo",
      "Title": "Periods returning after chemo"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Liz I am TNBC too.... Diagnosed in October and had surgery mammoplasty, lumpectomy and SNB that month. I started FEC-T 6weeks later. I am in for second cycle on Wednesday.  I had long hair and got it cut short. On day 15 after Chemo it started falling out. I got it cut a little shorter. Within 5 days so much of it was falling out that I cut my husband to clipper it right off. I knew I would lose my hair as was not interested in trying cold cap. I'm bald now and my children are getting used to it now. Nails...I might be wrong about this but I think it's the T part of chemo that may impact on nails. That's cycle 4,5 and 6 so I am going to paint my toe nails and finger ones with strengthener, then black polish, then a grape colour as my goth days are long gone although I would make a good punk with this hair!  I Joined a TNBC facebook group but it was American and it didn't work for me so I left it.  That's great that you want to donate your hair. Some little girl will be very happy with that and what a great thing to do. I am wearing hats...I gave a wig but I'm just not feeling it so far!  Fiona",
      "MessageIndex": 10,
      "PostDate": "28/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102992/hello-newbie-here",
      "Title": "Hello Newbie Here"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thanks Juliet....I have much less hair now but I think I am beginning to get a bit of fuzz that might soon be hair!  the two most difficult times for me were diagnosis and the anxiety I felt before chemo. It has all been so much better since then. I have my 5th cycle on friday and after getting the first chemo done the time has flown past. It's important to do nice things in between cycles especially in the 3rd week when you feel good and have appetite back.  The only other thing I forget to mention and this might be too much information but constipation was a real issue for me throughout. Now take dicoctyl which is much kinder than senna!  i know the unknown is hard to deal with but once the 1st one is done you will probably feel so much better and there is a chemo club thread here too for posting on with tips and advice.  Fiona",
      "MessageIndex": 5,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106091/start-of-chemo",
      "Title": "start of chemo"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Juliet i felt very anxious before my first FEC but it wasn't as bad as I feared. i always have a brisk walk before chemo to warm up my body and make the veins work. I always make sure I have some food and time for it to settle in my stomach. i like to have a friend keep me company because it takes my mind off what's happening. the actual process is usually pain free after getting the cannula in. If that's how they are doing it. Some people get Picc line etc.  after chemo is over I usually go to my bed with water within reach and a bowl with wet wipes just in case of sickness. not everyone is sick but I was the first time. The second time I got emend and that stopped the sickness i spent a lot of time sleeping over the first two days...ate a little....drank a lot to get rid of that pink pee you get!  By the third day I was out walking again although a little weepy. your experience might be totally different but for me while unpleasant....it was doable.  hope this helps...any questions just shout! fiona",
      "MessageIndex": 3,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106091/start-of-chemo",
      "Title": "start of chemo"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Congratulations! hope you had a lovely day. Thats my birthday! Each year is a blessing.",
      "MessageIndex": 6,
      "PostDate": "19/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108081/celebration-today",
      "Title": "Celebration today ..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Bev i also had a horrible time after my first T and my oncologist said that cycle 4 where you are recovering from FEC and starting T can be the worst time. It was for me and I found that cycle 5 and 6 of T were not as bad. My bone aches started between day 3 and day 5. I did not get mouth ulcers but pain in my feet and a little in my hands.  hope it goes easy on you fiona",
      "MessageIndex": 5,
      "PostDate": "07/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108824/docetexal",
      "Title": "Docetexal"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Petrosa i felt the same as you when I found out the cancer was in my lymph. I was very scared and worried but being told by my surgeon that this was still very treatable was a comfort to me. My tumour was a similar size and I had the surgery 3 months ago. 2 of my lymph nodes had cancer and they were removed during SNB but I will either have further rads or surgery to remove the others once I finish chemo. for me getting a cancer diagnosis was like a bereavement. I couldn't eat or sleep and couldn't stop vomiting. This all began to get better once the appointments started happening. You are also dealing with the sadness of wanting another child and having to deal with this instead. This is very hard and unfair. fear plays such a big part in those early days after diagnosis and people don't know what to say to help. I had people telling me you're young and strong you'll beat this .....you'll be fine. I found this very difficult because of course nobody knew how I would be.  it does get better. My youngest boy is 7 and I have moved forward from wondering if I will see him grow up to accepting that this is my situation and while I am hopeful....I have to learn to cope with uncertainty.  It's really hard but it gets more manageable....that has been my experience.  Fiona",
      "MessageIndex": 2,
      "PostDate": "27/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104340/stressed-out",
      "Title": "Stressed out!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Judy Your mum is being well supported by your family. You are not responsible for her or her feelings. You sound like a very caring and positive person and don't allow pressure and manipulation from others to change that. It is your job to get well just now and not to take on the worry for other family members too. You love your mum and are bound to be concerned but let the family pick up the practical matters in this this situation. You are right to do this and don't waste energy feeling bad or worrying about people's opinions.  Fiona",
      "MessageIndex": 10,
      "PostDate": "17/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103754/feeling-helpless-and-guilty",
      "Title": "Feeling helpless and guilty"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Jane  i like the ideas already posted. It's true as Julia says that our brain often goes into worst case scenario mode.  I did a lot of that kind of thinking in the beginning when I was first diagnosed because I had developed physical symptoms which I thought were indications that my cancer had spread and were secondary. It took 3months between diagnosis, surgery and the outcome of scans before starting chemo for the evidence to show that while the cancer was in my lymph it had not spread further.  During that time I had people telling me that I would be fine etc and that I was young (43) and would beat it etc  Meanwhile I was putting a brave face on while believing that I wouldn't live to see my children grow up. It was intensely painful but I think in some ways perhaps it has made this bit easier. I say this because the only way forward for me at that time was to accept that I had no control over the outcome of the cancer and that I might live, but I also might die.  Once I had accepted that I made the decision that the only thing I could control was how to deal with my diagnosis. Also that if my time with my children was going to be short then I had to make the best of that time. In your situation it sounds as people are telling you that it's positive and your head is telling you to be positive but you are not feeling it.  But you have been through this horrible experience....and finished chemo and perhaps you have not has time to process emotionally just how awful aspects of this have been. Family and friends etc are often to keen for you to be 'positive' and 'strong' that I think we mask our true feelings and stop being authentic.....to protect them from just how terrible it actually is.  Maybe you are playing catch up with feelings that you repressed because you were so busy trying to get better.  I am still half way through chemo so not in a position to give advice but I guess I just wanted to say that I think that the way you are feeling makes sense for where you are at in this experience but that better days are coming for you. You know that cancer has taken time from you that you won't get back but the future (even if it is less certain than it used to be) is yours.  Also come here to talk to people who understand. fiona",
      "MessageIndex": 5,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104616/worried",
      "Title": "Worried!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "It's the conversation you never dreamed of having. Glad for you that it's done because I think things move forward at such a pace. You obviously put a lot of thought into how to share the news and questions are good...x have an evening full of love with your family. hugs, fiona.",
      "MessageIndex": 8,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101266/advice-on-telling-my-children",
      "Title": "advice on telling my children"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Iona my two are same age as yours but two boys. The boys knew about cancer because my brother aged 38 had just finished treatment for bowel cancer. In this context we were able to explain that while cancer is a serious illness it is something that you get surgery and treatment for and most people are lucky like uncle and get better.  I spent a lot of time explaining that the treatment not the cancer would make me feel unwell and that because if that they might see me crying and being sick.i explained that It us important that they realise that while this horrible it will make me better. They can give me cuddle etc and it's not their fault.  I also explained that you can't catch cancer( apoarently they might worry about that)  i said that we would get through this difficult time as a family and there might be some small practical things they could do to help. I spoke to my eldest after that in private and told him that I would try to answer any questions he had with honesty because he understood and was very upset. Warn your child's teachers at school to be watchful of any changes in behaviour. Mine have been fine after initial wobble. telling them will probably be the most difficult thing you do but afterwards it is much easier because you are no longer pretending...while obviously sptill protecting them from graphic non age appropriate details.  Good luck..... fiona",
      "MessageIndex": 2,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101266/advice-on-telling-my-children",
      "Title": "advice on telling my children"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello everyone I was diagnosed last month with BC. I am recovering from mammoplasty and lumpectomy at the moment. The surgeon has told me expect that the cancer is in my lymph nodes  but the extent of that will be confirmed by biopsy in a couple of weeks. I am triple negative and so chemo is the next thing but treatment schedule will be informed by biopsy.  I just wanted to make contact with people who are going through this or have been through it. I am 43 and gave two boys aged 12 and 7. I feel mostly positive and am seeing friends but while I will talk to them about what us happening there are some things that I think might be too distressing for them.  So just wanted to let you know I am here! fiona",
      "MessageIndex": 0,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100946/newly-diagnosed-saying-hello",
      "Title": "Newly diagnosed....saying hello!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "That's great news Yvonne what a relief. Fiona",
      "MessageIndex": 4,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106426/good-news-on-results",
      "Title": "Good news on results"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thanks for that heads up about the December chemo group that is really helpful to know about that and I will look that up when it starts..xx",
      "MessageIndex": 2,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100946/newly-diagnosed-saying-hello",
      "Title": "Newly diagnosed....saying hello!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thank you so much for making me feel so welcome. I really appreciate the different pointers to things that might help. I got my surgery 2 weeks ago. I was scheduled for a lumpectomy but was offered mammoplasty as well and was lucky to get this without having wait longer.  We told our boys about 5 days after I was given the diagnosis. I was off work and feeling quite ill so we took the decision to be open with them. My younger brother had just completed treatment for bowel cancer so they did have knowledge of what cancer is. The oldest had already asked me outright if the tests I was getting were for cancer so there would have been no escaping it.  I am in no hurry to get the biopsy results because I don't feel they have any good news in them but I am delighted with the results of my surgery! That has been a positive in a pretty negative situation!  Its all a massive learning curve isn't it? thanks...xx  ",
      "MessageIndex": 5,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100946/newly-diagnosed-saying-hello",
      "Title": "Newly diagnosed....saying hello!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello loolyboo I started chemo exactly 6 weeks on from surgery but that was right for me as I had mammoplasty which took longer to heal.  I can understand that you would not be ok with that when its a resources issue though.  Be interesting to see what others experiences have been fiona",
      "MessageIndex": 1,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106446/waiting-forever",
      "Title": "Waiting forever!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "hello Rosiemay My heart goes out to you because I know from experience that this bit is really difficult. i found out on the day I went to breast clinic too and had a 3 week wait until the results of the biopsy.  I am 43 and have two children.  I expect your head and your heart is taking you to the worst 'what if scenarios ' when you think of your children.....that was the most difficult thing for me, along with all the questions I didn't yet know the answer too. i can give you advice based on how I got through those days but advice is not easy to follow sometimes. The most important thing to do is to try and eat,sleep and get outside each day. If you have anything you can distract yourself with even for short periods then do it. I started watching the good wife on netflix.....sometimes in the middle of the night. this is obvious ....but read the info they have given you about breast cancer. When you go for your biopsy results they will tell you what type of cancer it is... And what is stimulating it....eg hormones etc. You will find out what what grade the cancer cells are and if you understand these terms and know what that means for your treatment you may find some comfort and feel more in control. You will be worrying about your children most of all I expect. Mine are 7 and 12.... Boys and although telling them was very difficult for me beyond those early difficult days our lives have taken on a different shape but the boys are handling my illness and subsequent treatment very well. We were honest with them but shared age appropriate info. i just had my 4th cycle of chemo yesterday and the treatment is much more manageable than might be expected. fear plays an awful role at the beginning but it does get better as you begin to get the info you need about your diagnosis and the dates start coming on for scans etc  i hope you are managing to sleep and please post with any concerns, questions, anything. There are many kind people on this site who will listen and try to help. We will all be there for you. Fiona",
      "MessageIndex": 3,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105210/awaiting-results-of-biopsy",
      "Title": "Awaiting results of biopsy"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "I finished radiotherapy on Tuesday and I saw my oncologist yesterday to conclude treatment. I thought I'd share this poem which I've been thinking about over the last few days. I feel both happy and scared....I think that's normal!  Nine months of treatment completed....you do get through it!  Fiona",
      "MessageIndex": 0,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110495/end-of-treatment",
      "Title": "End of treatment....!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Ahh George....I think that metaphor must be the most perfect one for life ever....leaky boats! ",
      "MessageIndex": 8,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114365/could-we-give-some-hope-to-people-like-me-please",
      "Title": "Could we give some hope to people like me please?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello smiffy2512 Sorry about your diagnosis....it's so hard in the beginning knowing what to do and how to move forward.  I agree with everything said by Carol here. You have to decide what you need. My best friend was with me when I got my diagnosis and so she's been there for me since the beginning. I took longer to tell my kids because I didn't trust myself to be able to share that info without control. its your choice. For me being open helped and the sooner I started telling people and talking the more control I felt.  good luck with your decision. fiona",
      "MessageIndex": 2,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107280/newbie-with-core-biopsy-question",
      "Title": "Newbie with core biopsy question"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Congratulations......and best wishes!  Fiona",
      "MessageIndex": 5,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105132/rip-cancer-12-04-15---11-02-16-i-m-there-last-treatment-today-no-more-rads-hooraaaah",
      "Title": "RIP Cancer 12/04/15---11/02/16 I'm there! LAST TREATMENT TODAY, No..."
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Ahh George....I think that metaphor must be the most perfect one for life ever....leaky boats! ",
      "MessageIndex": 23,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114365/could-we-give-some-hope-to-people-like-me-please",
      "Title": "Could we give some hope to people like me please?"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "This post made me laugh! Good luck with the surgery and good luck with the competition!  Fiona",
      "MessageIndex": 1,
      "PostDate": "17/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110578/this-worried-me-at-first-now-i-m-smiling",
      "Title": "This worried me at first, now I'm smiling:)"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello CEC You are not selfish....this is a scary business and you have every right to feel as you do. We probably all felt that way, I certainly did, and as time passes you learn to find a way to cope but we all still have our wobbles. I joined a yoga class today, its the first exercise I've done apart from walking since I had my surgery and finished chemo. Once the class finished and the teacher asked how I was I burst into tears! I felt totally overwhelmed and I expect there will be lots of times when I feel that way.  I cried so much after diagnosis that there was a period of time when I don't think I had any tears left and I felt quite numb about the whole experience. Seems like emotion is making a comeback for me once more. if you led an active life before that will motivate you to get back to that but there is a period inbetween where you have to accept some physical and emotional changes but these will hopefully be temporary.  I was petrified at the beginning....good word ....but now I feel quite strong emotionally and proud that I got through it. You will too....but for now you have every right to feel any emotion while you come to terms with what's happening.  I couldnt talk to my mum about what was happening to begin with because she would get very upset and I didn't want to be the cause of that. Once I started handling my diagnosis better...so did she....and we're good now. It will get easier.  fiona",
      "MessageIndex": 5,
      "PostDate": "06/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108813/how-are-you-all-so-brave-i-ve-just-been-diagnosed",
      "Title": "How are you all so brave, I've just been diagnosed"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "well done on completing!  i am about to start T next week. it goes in quite quick doesn't it?  But chemo is the worst thing bar bereavement that I have ever experienced.  I just cannot wait for it to be over.  Fiona",
      "MessageIndex": 2,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104726/chemo-done",
      "Title": "Chemo done!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Dear Peace I can only second all the excellent advice given by other members. It is true that we were all where you are now and we do understand the worry but the most likely outcome statistically is that it isn't BC. However, if it is then it is very treatable and you will get fantastic support here.  Whatever it is you won't change the outcome by worrying so you must put all your energy into enjoying Christmas and family and friends.  We have BC....but that's what we are doing because that's the most important thing. Much easier said than done I know but do your best. I hope you get good news when you meet with your consultant.  Fiona",
      "MessageIndex": 7,
      "PostDate": "25/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102899/petrified-waiting-for-results",
      "Title": "Petrified waiting for results"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Thank you we all have some cracking stories now though and a bit of clarity about what's important in life!  but my goodness haven't we earned it. fiona",
      "MessageIndex": 4,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104726/chemo-done",
      "Title": "Chemo done!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Hello Chris  just adding one more post to agree that being told it will be alright is the most annoying and unhelpful thing anyone can say! I know that it is just something peole who care about you want to be true but that doesnt help!  I have a friend like that who won't allow me to be realistic ....she things it's negative but when in this situation i think it's natural to think about the worst case scenario the most....the other we know we can deal with as we are doing it.  The idea that you can't be 'negative' ( I don't think you are being that by the way) when you have cancer never fails to amaze me.....what blinking situation are you allowed to be negative in if not this one! waiting for results like these are horrible difficult times...I wish you luck with a positive outcome to it. fiona",
      "MessageIndex": 3,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111894/has-it-spread---todays-the-day",
      "Title": "HAS IT SPREAD - TODAYS THE DAY"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "morning helen i am so glad I read your post and the replies this morning because I have been feeling a bit flat and worried this week...and also annoyed with myself for not just 'getting on with it' which given our circumstances is the definition of being hard on yourself. I loved your story about your colleague hoping you get the resuls of the cancer you want....I found that very funny!  Judy I know I am a paid up member of that club and loved your surgery waiting room story....just as well we can laugh! Kath I am grade 3 TN too so if you want to chat send me a friend request. I am 6 months on from diagnosis and have had surgery, chemo and am about to start rads. i have been annoyed with myself this week for not recovering quick enough from chemo and imagining every ache and cough is something more sinister...something I said I wouldn't do. its not easy this.....just as well we have each other to talk to! fiona",
      "MessageIndex": 10,
      "PostDate": "26/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106701/bit-of-a-ramble-starting-to-wobble",
      "Title": "bit of a ramble starting to wobble!"
    },
    {
      "AuthorID": "Jammyfiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyfiona",
      "Content": "Fingers crossed and everything else crossed for you! Fiona xxxx",
      "MessageIndex": 1,
      "PostDate": "19/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103987/bilateral-mastectomy-and-recon-on-thursday-sacred",
      "Title": "Bilateral mastectomy and recon on Thursday sacred!!!!"
    }
  ]
}