{
  "AuthorID": "JammyR",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
  "Posts": [
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Again not exactly the same but... Scans showed clear nodes for me but results following Sentile Node Biopsy showed 2 positive. I then had full node clearence....31 of them removed and all clear but the first 2 being positive has sent me down chemo route. Good luck and try not to worry xx",
      "MessageIndex": 3,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149161/can-anyone-help-me-please-with-lymph-node-question-please",
      "Title": "Can anyone help me please with lymph node question please."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "After my core biopsy the nurse warned me there would be swelling and bruising and said not to panic. I was sore for for a few days and the small lump I had felt  before the biopsy felt massive afterwards so was glad she had warned me. Everything crossed for your results. Joanne",
      "MessageIndex": 1,
      "PostDate": "23/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145380/hard-stinging-lump",
      "Title": "Hard stinging lump"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Glad you have recovered well...getting through the surgery is at least one obstacle you've overcome. Yes I know what you mean it's hard to accept that we have no control over what will happen. Everyone keeps saying \"cross that bridge...\" and of course they are right and when I'm doing stuff and budy during the day I'm able to think like that too but in the night of course the mind wanders and worries!. Keep looking after yourself xx Joanne",
      "MessageIndex": 5,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143429/awaiting-results-senital-lymph-node",
      "Title": "Awaiting results senital lymph node"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi. I'm also in your position, nearly. Been told no sign of spread from scan etc but having lumpectomy and sentile node biopsy on Wednesday so will be waiting waiting waiting again for results and crossing everything nodes are cleared. Hope you are recovering well from the surgery. I just want mine over now! Joanne",
      "MessageIndex": 3,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143429/awaiting-results-senital-lymph-node",
      "Title": "Awaiting results senital lymph node"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi I have had 3 xEC so far and 1xT got second T cycle tomorrow. So I'm probably not much help as only 3 weeks into T but my lashes and brows have started to shed but just look bit thinner, not noticable yet. Hard to know if its a SE if T or lingering SE from EC or mixture of both. In terms of hair loss I used cold cao for 2 cycles which failed...left me at end of EC with extremely thin layer of hair and lovely bald patches! So far there has been no further loss on T. I do know some ladies on here have said their hair started to regrow on Docetaxal and my onco did say it is less of a hair killer than EC but not to get hopes up as hair loss is still listed as a SE. Now, my 8 year insists she can see \"sprouts\" of hair as she calls them in my baldy bits but I aren't convinced. Be nice if it does start to grow so can ditch the wig sooner but nothing can do either way. My T side effects have been different to EC... more tiredness and aches but manageable and have still had a good normal 10 days leading into next cycle. Ask onco to prescribe some devent painkillers to have at home in case of bone pain. You get more steroids with Docetaxal so people generally find first couple of days fine and the SE kick in day 3. Mine didnt start till evening of day 4 and worst was over by day 8-9. Good luck! x x",
      "MessageIndex": 1,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156504/docetaxel-and-hair-loss",
      "Title": "Docetaxel and hair loss"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Thanks Edwina. I guess will know soon enough either wag. Got wig lined up so least feel prepared. xx",
      "MessageIndex": 2,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150207/itchy-scalp",
      "Title": "Itchy Scalp."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Did anyone start with an itchy scalp  very early in their first chemo cycle? I had EC#1 last Friday (so now on day 7) and used the cold cap. Literally from the moment I git home my scalp has been really itchy. I'm guessing that means cold cap hasnt worked and hair loss to follow before Cycle 2. However mentioned it to my BCN yesterday when she rang and she said  normally itching doesnt start until around day 14 onwards so maybe just cold cap has created dry skin or something.? Have washed it couple of times. Dont know why I am asking really as guess what will happen, will happen but just wondered if anybody else has had similar. Joanne ",
      "MessageIndex": 0,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150207/itchy-scalp",
      "Title": "Itchy Scalp."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi ladies. So I am currently having CT. 3 x EC to be followed by 3 x T. Now on day 5 of 2nd EC cycle and despite using cold cap I have been one of the unlucky few and my hair is falling out...well to be honest it has fallen out just few bits left which will be going to hair heaven at the hairdressers on Thursday.  Hair loss has been the hardest element of this for my 8 year old daughter to handle but she is gradually accepting it and helping me decide what head gear suits me etc. She is now asking a lot of questions about when it will start growing back and how long it will take to grow back to how I used to have it (below shoulder length!). She says it will remind her of mummys poorly boob until it is back to how used to be bless her. I have explained once treatment finishes and I am feeling well we will be doing so much fun stuff the length of my hair will be last thing on our minds but I do want to try and give her an honest answer as we always do.  I know you ladies who have finished CT will have all had slightly different regrowth rates and different experiences but just trying to get a general idea please? My last chemo is 23 May if goes to plan so assuming would start to see some fuzz in July? Also any tips for looking after scalp when hair goes? Do I need to just wash n go or apply any special to keep it healthy? DH suggested Mr Sheen... he is a brave man nearly got a wig shoved up his.......!!! Thanks in advance Joanne xxx",
      "MessageIndex": 0,
      "PostDate": "06/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/151864/hair-loss---question-about-regrowth",
      "Title": "Hair Loss - Question about regrowth."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": " Thank you!  Yes I did mention it may grow back different.... she is hoping it grows back like her best friends who has long, braided, jet black, afro hair!! My hair always been thick and wavy and unmanageable.... putting in a request to the hair gods (who surely owe me some favours) for it to grow back straight and but thinner!! ",
      "MessageIndex": 2,
      "PostDate": "06/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/151864/hair-loss---question-about-regrowth",
      "Title": "Hair Loss - Question about regrowth."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Janeydoll  Oh yes forgot I had a chemo twin! How are you feeling? Like you my hair has been same style for donkeys years so trying to see the eventual re-growth as a chance to try different styles. Fortunately my head hasnt been too sore as yet but that may change when last thin layer packs its bags in next few days. Deb09  Sorry you are suffering more in this cycle... i think its natural as chemo train chugs on to be more physically and emotionally  impacted. Takes so much energy to keep things on an even keel and stay positive in front of our children something has to give. You have coped so well so far, just keep on ticking the days off. JoDec  I can't thank you enough for sharing those fab photos. I asked my Libby if she would like to see photos of a lady who has finished the medicine 3 months ago and she said yes. Hope you didn't mind me showing her. Her reaction: \"wow mummy she is beautiful in all the photos\".... I explained that mine could poss grow bit slower or faster as all different but and said she thinks when mine gets to length yours is now we should \"chuck wig in t'bin\" (said in her broad yorkshire accent!). It has really really helped her as she had been saying she won't like my hair until long again. Just love the photo of you out and about happy without your wig...shows us ladies going through CT and hair loss right now that there is a very lovely light at the end of the tunnel. Thanks again.",
      "MessageIndex": 8,
      "PostDate": "06/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/151864/hair-loss---question-about-regrowth",
      "Title": "Hair Loss - Question about regrowth."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Thanks toxophilite  Great photos and congrats on the gold!  Be great if Tax was kind to me too hair-wise but tbh be relieved to make it through chemo in one piece and with sanity in tact! I guess as time goes on hair will be less of a big deal just very much 'this weeks BC issue' for us. Rang chemo nurse to cancel cold cap for EC #3 was quite funny when she said can I ask reason why....erm yes I have no bloomin hair left to put cap on!  xx",
      "MessageIndex": 11,
      "PostDate": "06/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/151864/hair-loss---question-about-regrowth",
      "Title": "Hair Loss - Question about regrowth."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "How old is your little girl? I was diagnosed in Nov 17 when my daughter was 7. Have had 2 lots of surgery, chemo and radiotherapy and would be lying if I said I didnt (and still do) worry about the what ifs. But she will be a massive distraction for you when you start treatment...I was able to.keep things going relatively normally for her and on the bad days just playimg board games or watching a film together was my salvation. So focus on christmas and see what 4th brings...you will feel better when know what plan is as you naturally home in on next appt/procedure. Take care Joanne",
      "MessageIndex": 8,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/173538/the-fear-is-starting-to-hit-now",
      "Title": "The Fear is starting to hit now"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Now I'm worrying that i should have asked more questions but hey ho surgery booked for Wednesday and no chance of talking to anyone before then. Think I'm at the stage anyway where I can't afford to delay anything if I'm going to be having chemo I want it to start asap after operation so can get back to work sooner. So much to worry about!",
      "MessageIndex": 24,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Thanks glad to hear you are recovering well and drain  not too much of a problem xx",
      "MessageIndex": 30,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Deb - thanks for the advice and good to hear from you. Glad you are doing ok after your surgery. Yes we aren't that far away from each other timescale-wise are we. Just take it really good care of yourself over Christmas and let yourself be pampered.  Joanne - ok thanks for the tip! Sounds like something I would do so shall chant to myself all day Wednesday \"don't stand on the drain, don't stand on the drain!\". Could do to make a sign that says \"lady with a drain coming through!\". Mechele - I guess we are different and recover at different rates. Not expecting to be feeling fab initially but good to hear it wasn't bad for you. I didn't have any after effects from the anaesthetic after lumpectomy. Played cards with my little one at home in the evening. I know this op is more intrusive and a little longer but my BCN said if handled it ok last time chances are I will this time. It's an afternoon list so pretty much a given I'll be in overnight. Right going to try and put it out of mind now and 'do Christmas' thanks again xc",
      "MessageIndex": 14,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "That's great news Jac, must feel amazing to know you have no cancer in you and any treatment you do need to have now is to protect you for the future. So pleased for you. ",
      "MessageIndex": 50,
      "PostDate": "02/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Evening ladies, I had lumpectomy and SNB on 29 Nov. All went very well home with 3 hours of operation, no pain relief needed at all and very quick recovery. This is largely I think due to position of wound as apart from a bit of swelling it didn't really affect shoulder  mobility at all. Hoped I might have \"got away with it\" on surgery front but 2/3 nodes cancerous so having full axillary clearance on Wednesday 27th Dec.  What have people's experiences of this operation been? Any advice? My BCN talked me through it in a non alarmist way. She explained I'll have a drain for 5 days,  the wierd numb feeling etc, lymphodemea risk and said the first few days I will find the physio harder and likely to need painkillers this time. Whilst it doesn't sound a barrel of laughs I didn't feel too bad. However since then at pre-op the nurse kept talking about it been a much bigger operation and it would last longer so I'll feel worse etc etc. She also kept talking about risk of needing transfusion etc been higher which got me worried. Fast forward a day and a 'helpful friend who had the same op few years ago decides to tell me the pain was terrible and couldn't bear anything on her arm for weeks? Is it really that bad?  Any advice/tips appreciated! Thanks in advance Joanne ",
      "MessageIndex": 0,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi Jac I'm not doing too bad thanks. Had op on Wednesday all nodes removed. Struggling a bit with arm/shoulder mobility on that side but can just about do the exercises so guess that's as good as to  be expected within 72 hours of the op. Our circumstances are quite similar...like you seem to keep falling into the 20/30 % so imagining all sorts now. I had 2/3 nodes from SNB positive for cancer and my surgeon said chemo highly likeky for me. The nurse then said that if no further nodes involved chemo would be a \"consideration\" but not necessarily a given. I'm also not eligible for Oncotype DX due to node involvement and I'm also pre-menopausal I'm 43. My tumor was 28mm, Grade 2 so am fully expecting more nodes to be positive and chemo.  Let us know how you get on...my results will be couple of weeks away yet. Joanne ",
      "MessageIndex": 39,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Thanks Sally. Drain will be removed New Years Day so yeah don't think I'll be partying New Years Eve!!  Joanne",
      "MessageIndex": 2,
      "PostDate": "21/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Thank you for your replies ladies and certainly useful to read about your experiences.  Jac sounds like we are almost twins then. I will ask about levels.  Glad you are recovering well and managing ok with the drain. Thanks again everyone. Joanne ",
      "MessageIndex": 9,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi Jac Thanks for your reply Yes have a BCN but obv wont be working now and my op is Wednesday. Might just clarify with surgeon but inclined to trust that my MDT made the right decision and get on with it. Joanne",
      "MessageIndex": 27,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Brilliant news from what I've heard radiotherapy isn't too bad and few weeks you'll be able to put all thus behind you. Have a lovely day you must be SO relieved. Joanne",
      "MessageIndex": 2,
      "PostDate": "22/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143069/my-results-so-pleased",
      "Title": "My results so pleased"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Ooh haven't been to a Christmas Party this year I'm looking in the wardrobe now deciding what to wear!  Love reading the awake thread during the day and catching up on the pictures. BC hasn't quite managed to bugger up my sleep yet (trying it's best though these last few days!) Just dash as my 7 year old is trying to put tinsel on the hamster as I type (hamster is giving her resigned look and trying to eat the cushion). Lucky Pants would be horrified! Joanne p.s tell Lucky Pants to go easy on the sherry on his days off as need him on duty on Wednesday for my node clearance if he doesn't mind please xx",
      "MessageIndex": 2,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145333/online-party",
      "Title": "ONLINE PARTY......"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Mrsox Hope chemo goes well tomorrow lovie.  Jammy",
      "MessageIndex": 121,
      "PostDate": "04/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Keep forgetting about this thread! Well 11 weeks into chemo and trying to keep up bit of walking when up to it. I have my sights set on a holiday to Centreparcs mid Sept which will ve about 3 months post RT and want to be fit enough to enjoy outdoor activities, bike rides, swimming etc with my little girl. So today we had a very muddy family walk around a country park 1.5 miles from city centre. Walked about 5k in total and enjoyed being normal!",
      "MessageIndex": 1048,
      "PostDate": "29/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Love this thread...thank you Leolady for starting it. So no very long walks today but 2 x school run so prob couple of miles from that then we usuallt get lift to Brownies so decided to walk there instead tonight, another couple of miles. Every little counts! I walked, my 8 yr old skipped and galloped (you and her would get on Leo!). Inspired by this thread planning to try and fit few miles walk around village in tomorrow.  Joanne",
      "MessageIndex": 11,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "This thread is really helping me move my bum of the sofa. 4pm today woke up from a lazy snooze was warm and cosy and didn't need to collect daughter until 5 but managed to make myself put trainers on and do 45 min walk.  Well done everyone. It isnt easy with BC on our minds but we can all do it! ",
      "MessageIndex": 35,
      "PostDate": "30/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi there! Nothing I can say orher than I feel your pain!. I had lumpectomy and SNB last Wednesday and nurse had said she'd book results appt for 15th Dec (2 wks and 2 days from op). Another nurse rang on Friday and said it may be a week later before all results back but they'll send me a letter once they know if 15th is going to happen or not. Meanwhile we sit here going quietly mad! I'm 43 and have a 7 yr old which helps keep busy and the days pass quickly but like you, I'm anxious that second op to clear nodes may be necessary before any other treatment. I had heard that all hospitals will eventually follow the new way of testing during the initial op....just feels like I'm healing well from lumpectomy/SNB but could be back to square one in couple of wks! Sorry no useful advice I can offer but really hope when you do get the results everything goes well. Take care xx",
      "MessageIndex": 1,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144245/waiting-for-results-is-the-worst",
      "Title": "Waiting for results is the worst"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Glad you have a plan and are feeling more positive. I think most of us on here have felt the same that waiting for treatment plan is harder than knowing what's planned. Its all still daunting, of course, but I think when there is a plan you can mentally prepare for each stage.  Let us know how your operation goes. I had lumpectomy followed by node clearence 4 weeks later and have recovered from both operations ok. Take care x",
      "MessageIndex": 1,
      "PostDate": "04/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146269/saw-my-consultant-today-for-my-treatment-plan",
      "Title": "Saw my consultant today for my treatment plan"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi Deb, Thanks for the tip re exercises post operation. I've had no after effects at all from the lumpectomy but realise the node clearance will be tougher as the wound will be under my arm and they move nerves etc this time. They've said to expect an overnight stay this time. I totally get what you mean about bad news. Was saying to husband last night 9 out of 10 lumps are benign, mine wasnt, 2 out of 3 people dont need further surgery, I do so gets to thd satge where feels like always bad! My operation is 27 Dec, going to try and block it out over xmas and concentrate on toy assembling and battery finding. How old are your twins? Nic I found your reply really positive and helpful too always good to hear from people who have got through the tough stuff. Makes me realise that it will be ok in the end and me and Deb will be on here still  in couple of years time supporting people who are at the start of their journey. Will let you know how the operation goes. I post mostly on the \"The Operation\" thread with a group of ladies all around similar stage of treatment as us. We share some laughs and our stress, pop by if you ever want to join the madness.!! Get your feet up this evening I know your head will be spinning but focus on the cancer being gone and I'm sure when you see oncology they will answer more questions. xxx",
      "MessageIndex": 5,
      "PostDate": "19/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145125/post-left-mastectomy-breast-surgery-results--worried",
      "Title": "Post left mastectomy breast surgery results- worried"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi Deb So sorry to hear you have had a horrid day. It's a cliche but it really is a rollercoaster isn't it. I think the positive here is that both the tumor and the affected nodes have been removed so the breast cancer is gone. I'm facing similar situation. I had lumpectomy and Sentile Node Biopsy on 29 Nov and results were clear margins but cancer cells in 2/3 nodes that they took so I now have further surgery next week (Happy Xmas me!) to remove all axillary  nodes. Will then find out how many more affected so I could be heading in similar direction to you. I can only tell you how my BCN explained it which made me feel a bit better \"once nodes removed we will have taken cancer out off you, all the treatment following that chemo, rads and hormone therapy is like an insurance policy which will protect against it coming back\". How are you recovering from the operation? Hope you are getting plenty of rest. Its all stressful isn't it. I had my pre-op today for next week and the nurse said in a very patronising manner...ooh your pulse is a tiny bit faster than normal are you anxious today? I replied \"I'm 43, have breast cancer, facing 2 lots of surgery 4 weeks apart followed by chemo etc, have a 7 year old and it's Christmas so yes, do feel  a touch anxiuos!\". My BCN has been amazing but the nurses in pre-op are annoying! Take time to process today's news and don't be afraid to speak to your nurse again if you have more questions. Take care, Joanne ",
      "MessageIndex": 1,
      "PostDate": "19/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145125/post-left-mastectomy-breast-surgery-results--worried",
      "Title": "Post left mastectomy breast surgery results- worried"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi Louise I was told not to feel lump after biopsy as it would feel bigger and different due to swelling biopsy cause but that it's nothing to worry about. I did feel it and it did feel different so was glad they had warned me! Hope the week passed quickly and they confirm it's benign. Joanne.",
      "MessageIndex": 4,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144080/waiting-a-week-for-results",
      "Title": "Waiting a week for results!!"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi sorry that you find yourself here but there is lots of useful of support and advice. I'm pretty new to this too and I do think approach varies a bit from hospital to hospital, person to person. But I had same procedure as you on 29th Nov (recovery has been fine btw so don't worry too much about the op) and waited 2 wks for results. My results appt was with surgeon but my case had been discussed at  MDT - multi disciplinary team meeting - the day before. I believe MDT is made up of surgeon, oncologist, pathologist etc so they discuss and agree next steps. I was told that I would see oncologist very quickly after results appt to discuss I'm going treatment. Unfortunately I need another operation so am having that on Wednesday and then will be back to 2 weeks wait for results! As I say other ladies may have had different experiences and am sure will reply soon. Any questions about the lumpectomy please ask....Im sitting rubbing bio-oil into my very neat and surprisingly well healed scar and feel no after effects at all now 3 weeks since the operation.  Hope you can relax a little and enjoy Xmas although I know it's not easy with a post Xmas operation date. Luckily I have a 7 yr old to keep me busy! xx",
      "MessageIndex": 1,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145426/time-scales",
      "Title": "Time scales"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi Deb, I can't offer you the support the ladies who have finished their treatment can as, like you, I am newly diagnosed. I have grade 2 invasive ductal breast cancer. But just to say I've had all the feelings you are experiencing over the last 4 weeks and the waiting is very difficult to handle. I'm having surgery this Wednesday and then will have another couple of weeks to wait for results and decisions re if need chemo etc. Just try and keep your mind in what you know....Im the world's worst at running away with my thoughts thinking what if it's spread etc etc but my husband keeps saying at least just worry about what we know so far not what you think might happen. I have a 7 year old and although it ain't easy have carried on with everything as normal with her and tried to do nice things with her every day... its a good distraction for example we had a  couple of hours playing board games earlier today and for most of that time I forgot about the scary stuff I have coming over the next few months. For sure it's on my mind a lot but determined to keep things on track in terms of family life as much as is possible. Sorry, prob not much help as I'm only few weeks ahead of you on this horrible journey but wishing all the best for your scan and treatment plan Joanne",
      "MessageIndex": 8,
      "PostDate": "25/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143349/devastated-and-petrified-diagnosed-with-2cm-lobular-breast-cancer-and-armpit-lymph-node-awaiting-ct-scan-very-scared",
      "Title": "Devastated and petrified diagnosed with 2cm lobular breast cancer..."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "What a lovely post....it is happy  news that you are happy. I think the default mood for all us ladies is worried/anxious so shout it from the roof tops that you have regained your mojo! Glad you are feeling positive and can start to be BC behind you.  xx",
      "MessageIndex": 1,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147891/happy-news-for-a-change",
      "Title": "Happy News .. for a change"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi Just to say I am exactly same position as you Volovox. Wk 5 of chemo and 2 sessions of cold cap but hair has come out. Disappointed as hair loss was a big worry for my 8 year old but we seem to have come to terms with as a family quite quickly and like you I wore my wig out for the first time yesterday. Its actually much nicer than my real hair so maybe novelty factor at mo but its helping me to move forward knowing I look good and my little girl has accepted it. I would have preserved with cold cap if it had worked but relief not to have to use it again and hopefully much less time at chemo appointments now. So yep we got this! Good luck with the rest of your treatment. Joanne",
      "MessageIndex": 7,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152475/coming-to-terms-with-hair-loss",
      "Title": "Coming to terms with hair loss."
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Not sure why they do 8 sometimes...6 seems pretty standard from reading posts on here but every case and every onco is different. I had Grade 2, 28 mm tumor. 2 nodes positive so full node clearence (all nodes taken were then clear). Am 5 cycles in 6 cycles of EC-T. I'm 43. xx",
      "MessageIndex": 1,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156671/6-or-8-cycles",
      "Title": "6 or 8 cycles"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi Shirl, I think it very much depends on where the lump is as to how difficult clothing id afterwards. I had lumpectomy on 29 Nov and my lump is towards top of boob at 12 o'clock position. I had berm out and bought sports bras etc in preparation but found that was able to wear my normal bra and nightwear from day 1. I've since had node clearence and have wound under my arm...thats more of a problem than the boob one, everything seems to catch it! Good luck with the operation. I had the op at 2pm and was home feeling ok by 6pm it wasnt as bad as i thought it would be. Joanne ",
      "MessageIndex": 3,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146345/what-to-wear-after-a-lumpectomy",
      "Title": "What to wear after a lumpectomy"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Wink  I am 43 and experiencing the same. Had a period just after first cycle and nothing since but frequent hot flushes at night. Gotta say the kind of false menapause and thought of hormone tablets for years after chemo is an aspect of this I really dont like but it's obviously a necessary evil to stop the BC coming back so guess just have to deal with everything one step at a time. How are you getting on otherwise with the TAC? I have my 6th and final Docetaxal cycle coming up.on Friday...will be so glad to have got to the end of chemo. Take care xxx",
      "MessageIndex": 183,
      "PostDate": "21/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "mustardandgrey   Good luck with your first cycle...there is a lot to take in and it's daunting for sure but it gets a little easier once you get going. Even on a day  when I don't feel too good I mentally chalk a day off in my mind and the cycles do seem to pass quite quickly. Veliz  I am having EC-T so can share my experiences of that but I have not had the zoledronic acid or herceptin. So this is my 4th montly chemo thread.... May will see me having cycle 5 this Friday and cycle 6 on 25 May....so am happy to be in final month (well sort of I know the side effects of cycle 6 will linger through June) and hoping to then get RT out of the way mid June to mid-July so treatment will be done before school summer holidays which is important with a bubbly 8 year old to entertain! Wishing everyone lots of strength and hoping May is uneventful for us chem ladies. Joanne",
      "MessageIndex": 4,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "summerholiday  We are almost chemo twins lol... I have EC-T cycle 5 on Friday.  Agree re chance for a rest! My 8year old daughter keeps insiting I have pamper evenings to make me feel better...involves me lying on bed for ages whilst she does my nails etc....can't complain! In terms of steroids I have 4x2mg tablets twice a day  so 16mg a day in total for me days. They don't seem to affect me too much and I def don't get a buzz from them. I am seeing onco tomorrow so hopefully will keep dose the same for this cycle. Take care...we are getting near the end of CT. x",
      "MessageIndex": 10,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Leolady56  Glad they have you back on a plan and you can start to motor through the CT poop. Most 'NHS wigs' are just wigs from standard wig shop so if its a decent shop they refer you to (mine just happened to be a great one)  you literally pick a wig as you would if you walked in off street. Do you know how much your Trust pays towards it? I was lucky mine meet full cost but obviously if its just a voucher towards you can pay difference. Def good to have one to use though. I dont wear mine in house but feels nice to go out with hair! Does take a bit of trial and error getting right one and you will prob come out with something bit different to imagined. Shame the forum doesnt have a \"live\"  option  like facebook we could all watch and vote!   Take care lovely x",
      "MessageIndex": 57,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Wink  Glad you are getting some decent days after the initial side effects. Yes its easy to keep ploughing on during the day like you say.. I only have one child but she has hectic schedule with sports stuff etc so always something to be doing. I have had a decent spell of sleeping ok and pushing the bad thoughts away but this last week or so keep waking up worrying about anything and everything... think its cos I am now starting to.think about post chemo and going back to work etc. Also am at the lowest point looks wise....bald, no eyebrows or lashes. As soon as things start to grow back it will feel like on the way up again. No bell at our chemo unit (that I'm aware of anyway) but sure there is at the hospital I will have radiotherapy at so will def be giving that a clatter! Take care x",
      "MessageIndex": 186,
      "PostDate": "22/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Congratulations Summerholiday....big milestone and fingers crossed the side effects will be kind. I am 2 days behind you..all set for final EC-T on Friday..like you my side effects have been reasonably mild just a few grotty days but generally ok. With you on the worrying front though...however calm and positive try to be its the middle of tbe night that gets me! Take care.",
      "MessageIndex": 196,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Can't answer your question really as my onco just used Predict and surgeon said \"ask your onco!\". But I always thought Predict was supposed to be more up-to-date than NPI.  But then even Predict is a rolling porgramme of updates so will always be a little out of date. My onco was talking about how a lot of us will get hormone tablets (tamoxifen and whatnot) for 10 years now instead of 5 as it used to be. I asked if Predict takes account of that and he said not yet but there will be a big release of it in the pipeline taking into account latest info. ",
      "MessageIndex": 1,
      "PostDate": "11/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/157091/nhs-predict-npi",
      "Title": "NHS Predict & NPI"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Ha ha Janeydoll... I don't drink alcohol very often but have a massive craving for a G&T now you've mentioned it. Elderflower good idea though might have send hubby for some.",
      "MessageIndex": 11,
      "PostDate": "19/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150435/drink",
      "Title": "Drink"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "I know what you mean. I never really drink tea or coffee but usually drink a lot of fizzy water and juices. I am 10 days post EC#1 and gone off fizzy altogether. I can manage tap water with bit of diluted juice and oddly crave glasses of milk which is something I don't usually drink. Also quite enjoying fresh orange/pineapple juice. All in all prob not drinking quite enough so also trying to gave a lot of fruit and soups etc so getting bit more fluid in ne that way.",
      "MessageIndex": 1,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150435/drink",
      "Title": "Drink"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "taralou  So sorry you have been suffering love, sounds awful.  I feel like T hasnt been has hard for me (well this first T cycle anyway...who knows what next ines will bring). In terms of pain my onco gave me cocodamol to keep in and said start with 1 parecemol and 1 cocodamol every 4 hours then add in ibuprofen ot try 2x cocodamol. Thankfully the paracetmol/cocodamol combo kept it manageable. Wouldn't say days 4-8 were great but not horrible. My skin is def very dry...have been using good hand cream few times a day but still looks like might be getting a  bit flaky around nail beds. My face has calmed down but was bright red until couple of days ago.. again am using face cream/moisturiser but skjn on cheeks v dry. Brows and lashes on their way out too. Def keep mentioning everything to onco and ring unit if worried. Sending love x",
      "MessageIndex": 5,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156137/skin-falling-off-my-fingers-chemo-face",
      "Title": "Skin falling off my fingers?? Chemo face!!!"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "@mrsox How are you doing lovie? I am fettlib fair to middling! Thanks for the tip.re child farm cream...will send Mr Jammy to Boots...he will.doubless come home with the wrong thing but never know! Takr care Mrs  xx",
      "MessageIndex": 7,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156137/skin-falling-off-my-fingers-chemo-face",
      "Title": "Skin falling off my fingers?? Chemo face!!!"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Yep I know we are very sensitive and ordinarily don't take as much notice of such things but the whols Christmas period seems to have been big on the cancer adverts. We only watch things on record now so can skip adverts as don't want my little girl putting 2 and 2 together which I think she may well do if exposed to too much cancer media!",
      "MessageIndex": 1,
      "PostDate": "31/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145929/advert",
      "Title": "Advert"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Thanks Bigguy.... yep we are all different so can't really plan but will just have to suck it up whatever! If can stay ok rest of this cycle going to try and make the most of it and not stress too much about T but easier said than done of course! Glad you aren't suffering as much this cycle and can start to look towards final one. Getting there slowly but surely. Just had funny convo with Libby about my hair. Still have the thinnest little covering (less than 5%). Never got around to shaving it as assumed the 3rd EC would finish it off as obvs didnt use cold cap. There are some longish bits which serve no purpose other than Libby messing with them when pops in bef for a cuddle... amuses her to make me lool like a troll. Anyway I said I just prob just shave it all off really and she said no just cut the long bits off then you will have some hair \"to start you off when medicine finishes\". She may have a point altho suspect it will shed at some point. xx",
      "MessageIndex": 7,
      "PostDate": "01/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Take care Leolady56  xxxx (and make sure the big girl pants don't fall out of your trouser leg!",
      "MessageIndex": 274,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Glad your appointment went well Leo and that you are good to go next week.. hair loss thing can be bit unpredictable. You may never need a wig who knows. Following thr epic cold cap fail and therefore not using it for EC I assumed my remaining extremely thin patchy would shed but it hasn't. Keep hanging on to see what happens but as there are some long bits left I need to go get it cut so if it does hang about what is there will look bit thicker when regrowth starts. Noticed a couple of little spikes in a little bald area today and wondered if by some miracle it was bit of regrowth so soon. Then remembered I have zero luck so no doubt the Docetaxal will kill it all off. Sorry havent been in this thread much going to have good read and catch up with you all. Had a week of feeling well so been going out and making most of school hols with my little girl. Cycle 4 starts tmrw...first Docetaxal cycle so will doubtless be feeling the SE by end of weekend. Keep strong ladies tomorrow is a day further along the chemo/ treatment calendar for us all.",
      "MessageIndex": 205,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Hi everyone. One monthly chemo thread nearer to being able to join a radiotherapy thread! Nice as it is chatting to you ladies of course can't wait to move to next stage! So I am day 10 of 3rd EC cycle. Feeling ok and getting out for walks. SE have been manageable for me throughout EC but did end up in hosp on day 12 of first cycle with neutrophil count on 0.05! My next cycle on 13 April will the first T cycle which I am dreading. Any tips for dealing with T SE or suggestions what to get in would be appreciated. Have onco appt couple of days before so will definitely be requesting that I am sent home with decent pain relief in case need it. Also which day do the SE usually kick in? My chemo is always Fridays so handy to know how I am likely to be on the weekends so can make sure people around to help with daughter if needs be. Leolady56  you know I love chatting to you but hoped you woukd never need to join this thread lovely. We are all here for you as you know. Joanne",
      "MessageIndex": 5,
      "PostDate": "01/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Nik52 Thank you always good to hear and glad you aren't suffering too much now, sounds like you had horrible time on EC. That must have been really scary being so ill...I had hosp stay on cycle 1 with neutrophils of 0.05 but only slight temp for couple of hours and never felt unwell . They kept me in 4 nights until crept over the 0.5 mark but thats been my only thing with EC so far (touch wood... day 12 of cycle 3 still time!). Hear so many people having a terrible with T its hard not to worry but will take it a day at a time. Thanks again Joanne",
      "MessageIndex": 13,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Linda - thank you for those tips sure they will come in handy. I am going to get couple of things to be prepared but shall see what T brings and send DH to chemist when needed. Good luck tomorrow... rest, rest, rest I think will be key after last one and let your body gradually recover. Take care xx",
      "MessageIndex": 17,
      "PostDate": "03/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "Leolady56  Oh no sounds like more poo... hope onco can sort things out for you and they are able to carry on with CT/herceptin.  In terms of PICC line and BP I am really struggling to remember where they have been taking mine! I think lower down arm but come to think of it last chemo might have put it over PICC. Who knows...will pay attention next week! I have District Nurse come on non CT weeks... they let me request a preference time wise so they are always here by 11. Don't have a prob with it when send someone who knows what they are doing... had a couple who have made right mess of it!  Xx",
      "MessageIndex": 367,
      "PostDate": "27/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "JammyR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jammyr",
      "Content": "LiziX Hope you get a good nights rest and are soon out of hospital. I ended up in hospital with an infection early in my 1st cycle but have been ok since. Hopefully this will be a one off for you too. Mam to 3  Second what the lovely Ali said re injections. Varies between oncologist as to when they are prescribed but I have had them since cycle 2 and they don't cause me any trouble at all. Hardest thing is supposed to do left side one day, right side next...trying to remember which side I did previous day with a foggy chemo brain is a challenge!  Leolady56  Less of the 'sorting washing and washing up' and more of the bed if rest please or I will send you to the headteacher (lady called Lindsay..heard she is very strict!). Hope the rest of you chemo ladies have had a decent start to the week. I am day 11 of cycle 4 (first Docetaxal cycle) and feeling ok today. Hopefully get a run of good days now before it all starts again late next week. Take care everyone.",
      "MessageIndex": 333,
      "PostDate": "23/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    }
  ]
}