{
  "AuthorID": "Jane46",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
  "Posts": [
    {
      "AuthorID": "Jane46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
      "Content": "Hi I am part of a trial for Herceptin and the onc mentioned the injection to me and I spoke to my trials nurse ( she's brill) I don't know what criteria they use but maybe you could ask if there is a trial you could help out with. I'm on the Persephone trial. They are testing two groups 1 get Herceptin for 6 months and the other 12months. It suits me. Sometime I've found that I have needed to ask the same question several time before they listened. So keep asking till you get the answers you want. Hope this helped Jane",
      "MessageIndex": 11,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75049/herceptin-by-injection",
      "Title": "Herceptin by injection"
    },
    {
      "AuthorID": "Jane46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
      "Content": "Hi. I have had 7 Herceptin doses. 6 by IV and 1 by injection. The injection was by far the easiest. They made me stay around after the injection to check for any adverse reaction. They said I won't be there so long next time. As for pain well it felt a bit like having a dead leg when you were a kid ( my big brother was an expert...! ) Even with the bit of discomfort it was 10 times better than the IV hope you find it as easy All my best Jane",
      "MessageIndex": 5,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75049/herceptin-by-injection",
      "Title": "Herceptin by injection"
    },
    {
      "AuthorID": "Jane46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
      "Content": "I had 3 lymph nodes taken and only 1 contained cancer. So I refused a full clearance as it seemed like over kill and the underarm seemed so sore after the op. I also had to go back for an extra clearance around the lump they removed. This part was easy and the scare is very tidy. It was also reassuring to get the all clear from the surgeon. I'm now having chemo 3 fec (does anyone else laugh when they say this haha) and 3 tax. The 3 fec has gone quite easily so let's hope the rest goes easily. Don't fret over what we can't change if they need to take extra then it will only be done for your own good Best of luck",
      "MessageIndex": 4,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66700/further-surgery-for-wider-margins-and-more-lymph-nodes-to-be-removed",
      "Title": "Further surgery for 'wider margins' and more lymph nodes to be re"
    },
    {
      "AuthorID": "Jane46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
      "Content": "Hi I also had cording in my arm, I spoke to my surgeon and he \"snapped it for me\" i know sound yuk, I like to think of it as a stretch but what ever it is called it worked. And it meant I could continue with my exercises and I have full use of my arm since. Try asking it may be a bit of a shock when done but it was so much more comfortable when done Worth asking. Best of luck with your journey we all have different journeys down this cancer path but I hope yours is an easy one. Jane",
      "MessageIndex": 4,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67286/cording-in-arm---any-advice",
      "Title": "Cording in arm - any advice"
    },
    {
      "AuthorID": "Jane46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
      "Content": "Hi there I don't know if everyone feels like this but I was exactly the same. Within the first week I was totally fatigued. The therapy was easy, the exhaustion was crippling. I finished mine in Feb but I still feel tired but not as much. Don't fret over it too much just use it as a good excuse to put your feet up. I was told it was an accumulation of all I'd been through and it was my body's way of trying to recuperate. Your not alone, or are we the first to feel like this. So head up and look for the light at the end of cancer treatment Thinking of you Jane",
      "MessageIndex": 1,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75213/fatigue",
      "Title": "fatigue"
    },
    {
      "AuthorID": "Jane46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
      "Content": "Hi This is my first message. I want to say your not alone. My husband is also an arse. He had decided to have an affair in the last 6 weeks. I heard from a friend. He said he couldn't find the right time to tell me \"because\" I'm having chemo.cheeky get using my sickness to blame for his blatant lack of care. He said she is good to talk to about me being ill and it's just gone further. Haha what an arse ! Remember tho, we are the ones who have fought a hard fight agains this illness and that makes them the losers because they lost us. It's lonely and depressing tho I agree. Our boys are our lives and yours will understand when he's older you just wait and see. I've found that my 17 year old is best left to his own devices and then he comes round. Not sure if any of this helped but at least you know your not really alone. That there is at least the two of us in the 'My Husband is an Arse group'",
      "MessageIndex": 5,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66983/alone-after-treatment-with-no-one",
      "Title": "Alone after treatment with no one"
    },
    {
      "AuthorID": "Jane46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
      "Content": "Hi. I think I forget the best way through this is to laugh at it.... Hope this makes you laugh as it did me. My son (17) said he thought it was mcmillan online BALDY community ......?? I shouted to him that that's not funny and to be more thoughtful he was laughing very loud when he replied \"alright mum keep your hair on\".... He squealed and ran when I threw my wig at him tho.. He now tells me to keep my hair on any time he sees me looking down. Also made me realise he's coped a lot better than I thought. Jane",
      "MessageIndex": 0,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75241/don-t-forget-to-laugh",
      "Title": "Don't forget to laugh"
    },
    {
      "AuthorID": "Jane46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane46",
      "Content": "Hell's angel tattoo sounds better than his suggestion that at Xmas I should have \"this way up\" tattooed on my head for when I'd had one or two ciders too many !!! Heehee. I may steal your line and threaten to pick him up from school hat less. Jane",
      "MessageIndex": 5,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75241/don-t-forget-to-laugh",
      "Title": "Don't forget to laugh"
    }
  ]
}