{
  "AuthorID": "Jane26",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
  "Posts": [
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Hetty50 I had the same problem and I used a product called Toppik. It is a powder made up of tiny fibres. They do it in seveal shades. It's was brilliant and meant I didn't need to wear my wig. The website is www.toppik.co.uk. Hope this help Jane x",
      "MessageIndex": 8,
      "PostDate": "07/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114481/help-with-hair-thinning",
      "Title": "Help with hair thinning"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Mand123, When I was told I needed chemo my first thought was \"oh no not my hair!!!!\" After my initial horror I spoke to my Oncologist regarding cold capping. He told me that I could try it but it probably wouldn't work. I too was worried about messing with the chemo and the chances scalp cancer. He told me the chances are so minute and unproven. So I decided to give it a go. I had nothing to lose (only my hair!!) So i I had my long hair cut into a shoulder length bob to reduce the weight. It's true the first 5 to 10 mins are the worse but not unbearable. Once your scalp gets used to the cold it's okay.  It does add about 1-1/2 hour on to treatment time. I'm about to have my final round next week 6/6 FEC 75. I still have 60-70% of my hair left. Only on the top has it thinned mostly and over all a bit, but it means I don't have to wear a wig only soft hats and also when my hair does grow back it will fill in the gaps and thicken rather than starting from scratch. I think the reason Oncologists try to put people off is because we take up chair space and time cold capping. Talking to the chemo nurses on my unit they say including me, only one other lady have tried the cold cap and both times it been successful. Every appointment my Oncologist has a look at my hair and even hes impressed. Looking after you hair in between each cycle is very important too. I'd just tied mine up in a loose ponytail and did not touch it. Washed and conditioned it as little as possible and bought a silk pillowcase.  It's a purely personal choice but if your hair is really important to you then I'd say give it a go  Good luck",
      "MessageIndex": 18,
      "PostDate": "29/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107171/cold-cap-or-no-cold-cap",
      "Title": "COLD CAP OR NO COLD CAP?"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Julia, Thanks for your reply. This week was a lot better and I tried the massaging with a moisturiser. The area definitely wasn't as tender. I'm completely hooked on Zumba  and im feeling better just doing something energetic. My nature is not calm and relaxing, more fast and furious!!!!! Jane X",
      "MessageIndex": 7,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113941/exercising-after-treatment",
      "Title": "Exercising after treatment"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Nix Thanks for your reply Things are much better this week. I suppose it just takes time to let our bodies heal Jane X",
      "MessageIndex": 8,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113941/exercising-after-treatment",
      "Title": "Exercising after treatment"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hello Ladies, September last year I had a quite a large lumpectomy with nipple removal with Sentinel node biopsy and 3 other nodes removed. Finished chemo in April and radiotherapy in June. Currently on Zoladex injections and Exemestane tablets.  I had a check up with Oncologist 6 weeks ago and he said everything looks fine. However recently I have had some tenderness in my breast  and also under my arm where my scars are. I've had a feel and can't feel anything suspicious. I decided to start Zumba classes to try and get my fitness back, lose some weight  and help my joint pain,after all my treatment. So last night was my first class. I wore a supportive sports bra but it was quite uncomfortable jumping  and dancing about and is tender today. Is this normal when you start exercising or running again, to experience some degree of discomfort or should I be worried? Could it be everything healing, nerves knitting back together or maybe the effects of radiotherapy  Every little pain or feeling I now worry about. Anyone else experienced the same thing? Big hugs Jane xx",
      "MessageIndex": 0,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113941/exercising-after-treatment",
      "Title": "Exercising after treatment"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Bedford 69 and Jane h, Thanks for you replies. I'm feeling a lot better this week and definitely better after some exercise. As you say slowly does it however, I do find that extremely hard!! Jane X",
      "MessageIndex": 9,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113941/exercising-after-treatment",
      "Title": "Exercising after treatment"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi there! I am having fec x 6. I am about to have cycle 5 and have cold capped all the way through. Hairloss was a major thing for me. Although my hair has thinned I would say I still have 60% of my hair. It does make chemo sessions longer and is uncomfortable for the first 10 minutes but it's definitely worth trying. At least when chemo is over your new hair will come back and fill in and thicken the thinned areas.  Good luck with everything! ",
      "MessageIndex": 9,
      "PostDate": "07/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106250/fec-t-and-cold-cap",
      "Title": "FEC-T and Cold Cap"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi to everyone, I started Zoladex injections and Exemestane tablets 2 weeks ago. Everything seemed to be going well with no bad side effects until last week.  I have developed numbness and tingling in my right hand and and aching up my arm. It's so painful!! It's beginning to wake me up in the night and is at its worse in the morning. I have been to my GP and they have told me its probably Carpal tunnel syndrome and have given me anti inflammatory tablets. They are going to arrange some nerve tests for me and they say the treatment options after that are steriod injections or surgery. I did phone the chemo ward on Friday and they said they would speak to my Oncologist but I'm still waiting for a call back I just wondered if anyone else has had this problem. Big hugs Jane xxx",
      "MessageIndex": 0,
      "PostDate": "09/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108946/carpal-tunnel-syndrome",
      "Title": "Carpal tunnel syndrome"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi ladies, Thank you all for you replies. I'm am going to arrange a blood test and talk to my consultant as I can't go on like this for the next 5 years as it's now started in my left hand too!!!!! I'm 45 but I'm feeling 75 at the moment Big hugs xxx",
      "MessageIndex": 4,
      "PostDate": "25/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108946/carpal-tunnel-syndrome",
      "Title": "Carpal tunnel syndrome"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Sinead12,  My chemo sessions have been about 3 hours because of using the cold cap. The cap is put on half an hour before the chemo drugs are put in so to make sure the scalp is nice and cold. By the time the chemo drugs have been put through and the cap has been left on another hour it's up to the 3 hour mark. I have just had my 3rd chemo cycle and there is definitely a pattern on the days when you will feel bad. Mine lasts 2 days (day 3-4), I then make sure I'm ready for those days with some help with my boisterous 2 year old, shopping and food prepared. After then the feeling lifts and each day you will start to feel you are getting back to normal. It's a small price to pay to see our beautiful children grow up. It's not nice but I promise it's doable! I haven't put on any weight so far as I try to eat sensibly and try to walk every day even if I can only make it to the end of the road and back. I completely understand your worry about your hair as I was exactly the same and it seems really stupid in the grand scheme of things but you are not alone. Although the cold cap is hard going at first it's definitely worth a try, I'm glad I did. Jane x",
      "MessageIndex": 19,
      "PostDate": "08/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104804/isolated-cells-in-nodes",
      "Title": "isolated cells in nodes"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Sinead12, I to was diagnosed with Invasive ductal carcinoma grade 3, with isolated cells in 1 of my nodes back in September. I had a lumpectomy to remove the tumour and I was told I was borderline if I would need chemotherapy. The oncologist decided to send my sample off for the Oncotype DX test. I came back with a score of 33. Anything over 31 is high cancer of reoccurrence. Like you the thought of chemotherapy was frightening , stupidly they thought of loosing my hair was the worse thing I could imagine but I had no choice. I have a 2 year old little boy and I have to do everything I can to stop this horrendous disease from coming back for him and my husband. I have been put on 6 cycles of fec and I decided to try cold capping to see if I could save my hair. Yesterday I had my 3rd cycle and everyone can't believe how my hair I still have. It has thinned but I can still get away without wearing a wig, scarves or hats. Have a read about the possibility of using them. I was told 50% of patients who use cold cap will keep 50% of their hair. During chemo you will grotty for 2-3 days but it's definitely doable and if it gives you every chance of long term survival surely you have to give it a go. Good luck xx",
      "MessageIndex": 9,
      "PostDate": "06/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104804/isolated-cells-in-nodes",
      "Title": "isolated cells in nodes"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Fiddlesticks and all you lovely ladies I am completely new to this forum and I am in exactly the same boat as you. I had my lumpectomy and Sentinel node biopsy last Monday after finding a 1.8cm lump in my breast while showering. I am 44 and have been diagnosed with Invasive ductal carcinoma. I am out of my mind with worry and trying to stay positive for my family especially for my 22 month old son. Yesterday while watching TV an advert came on which was about breast cancer. It completely floored me and sent me into a state of panic. You are so right, everything I watch, read or even encounter seems to remind me that I have breast cancer. I know it's because I'm more aware of it and it's a great thing that they are promoting awareness but it's so hard. I get my results in 13th October im so so frightened xx  ",
      "MessageIndex": 9,
      "PostDate": "05/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99482/adverts",
      "Title": "Adverts!!"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Helen, Thanks for you encouraging post. This forum is definitely helping me. Friends and family have been fantastic and very supportive but if you are not going through this yourself you really cant properly understand. Im hoping that my results are as good as yours were. I'm really trying to stay positive and strong, I think once I know the results then I'll be able to deal with the future. How did your rads go ? Xx",
      "MessageIndex": 19,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99482/adverts",
      "Title": "Adverts!!"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Fiddlesticks How funny you get your results the same day. I just wished it wasn't the 13th!! I completely understand. I'm OK one minute then feel panicky the next. Im hoping it will get easier once I have the results and I know what I'm dealing with. My big fear is that it is in my lymph nodes and has spread. When I was diagnosed with bc I was totally convinced it was just a harmless cyst and wasnt at all worried about the biopsy results so this time I think im probably expecting the worst so anything else is a bonus. I'm just so scared!  I'll be keeping my fingers crossed for you next week! Big hugs to you too xx",
      "MessageIndex": 13,
      "PostDate": "05/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99482/adverts",
      "Title": "Adverts!!"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Hi Dreamthief Thank you so much for encouraging words. They have made me feel better. I cant believe how many people are diagnosed every year. It's shocking! My worries are that it has been found in my lymph nodes and it's spread elsewhere and I'm going to be the 10%. In fact I'm pretty much terrified about it all. I think it's probably because it's all so new and ignorance is not helping. I started out Googleing Breast cancer  but I just end up getting my knickers in a knot!!! This forum has definitely started to help as I realise I'm not the only one going through this nightmare. I try to tell myself to cope with each stage step by step but im finding it hard. Thank you for you lovely reply  Jane xx    ",
      "MessageIndex": 14,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99482/adverts",
      "Title": "Adverts!!"
    },
    {
      "AuthorID": "Jane26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane26",
      "Content": "Thank you for your message. No one has explained that to me about the lymph nodes. I guess I'm just going to keep busy and deal with whatever I'm told next Tuesday. As you say it just one step at a time and not to overthink stuff. Thank you again for your support and hug voucher!! Xx",
      "MessageIndex": 17,
      "PostDate": "06/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99482/adverts",
      "Title": "Adverts!!"
    }
  ]
}