{
  "AuthorID": "Jane11",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane11",
  "Posts": [{
    "AuthorID": "Jane11",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jane11",
    "Content": "Hi,  I was diagnosed with early breast cancer in 2011, which was a shock, as I was only 37, with no family history. However, I was REALLY lucky, in that it hadn't spread to the nodes, and I had surgery quickly. I had rads, but no chemo. My treatment is considered 'curative' ie I don't have cancer and it's unlikely it will return.  However, my oncologist put me on Tamoxifen AND Zoladex. That was last spring, and almost immediately, the headaches started, but I thought it was 'just' the medication...so it was three months before I discovered my BP was dangerously high. I'd always had superb BP, and I watch it, as I have a real family history of stroke. Anyway, BP meds seemed to get it under control, and my oncologist dismissed it as \"stress\". Two months later, my BP started to rise...and rise..and rise. The Zoladex is given as 3 month implants, so I couldn't stop taking it, but worse was the fact I felt like I had to really fight to get anyone to take any notice. My GP made the right noises, but I'm sure he  was looking to the oncologist, who stuck to his '\"Stress\" diagnosis. I found some online references to Zoladex and BP, and two different GPs looked it up in medical references online and in books. Both references said BP is one of the big side effects of Zoladex. Yet, still nothing happened, and by this time I was desperate to get the implant out. It took a truly wonderful BC nurse to fight my corner. My surgeon agreed to take out the implant... unfortunately, it was too late, so I had to wait  for it to expire. It then took another 3 months for my BP to come down again, but it's now totally back to normal. Needless to say, I don't take Zoladex anymore! I've since made my concerns about the lack of connection between Zoladex and BP known to my oncologist (who now recognises this \"rare\" side effect did happen!). It was not listed as a side effect in any literature I was given, nor was my BP tested, nor was I told to watch it. Given that the info GPs have access to lists it, I think we patients should be aware, so we can look out for ourselves. I'd be interested to hear how many of you on this drug have had similar experiences. Oncologists don't seem to want to acknowledge the link, but it is clearly there. I think it's important women are made aware of this. And, if you are on Zoladex, TAKE YOUR BP!!!",
    "MessageIndex": 0,
    "PostDate": "20/06/2013",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61679/are-you-taking-zoladex-please-read-this",
    "Title": "Are you taking Zoladex? Please read this..."
  }]
}