{
  "AuthorID": "JANISRW",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janisrw",
  "Posts": [
    {
      "AuthorID": "JANISRW",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janisrw",
      "Content": "We all had to suffer this and i am sorry for you but scarves can be fun and colourful and different coloured wigs too. Dont worry it wont be for long the hair will soon grow and it will be nice and thick and new and no split ends. I cant wait for mine to grow then i can bleach and dye it all over again lol. Take heart, it is as David said, a battle scar and to be worn with pride. Keep right on to the end of the road and all that, in true british spirit lol. Lots of love xxxxxxxxx",
      "MessageIndex": 6,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10773/hair-loss-and-chemo",
      "Title": "Hair loss and chemo"
    },
    {
      "AuthorID": "JANISRW",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janisrw",
      "Content": "i am on the same chemo drug as you and have experienced the same acid symptons, it will usually last a few days and on and off over the 3 week cycle. Hope you feel better soon xxxxxx",
      "MessageIndex": 6,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10782/acid",
      "Title": "Acid"
    },
    {
      "AuthorID": "JANISRW",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janisrw",
      "Content": "i always end up in tears when i read of everyone elses story on here, be strong love, you are almost there we are all thinking of you. I am not religious at all but seem to find myself saying prayers for all of us with cancer and all who are battling with the infections and bruises and everything else that comes with cancer and chemo. Fight it, moan lots that is what this site is about if we cant moan to each other who can we moan to and thinking of you - big hug (())))))))) janis",
      "MessageIndex": 12,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "JANISRW",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janisrw",
      "Content": "watch your temperature love, and ring the hospital if it goes up to 38C i went to clinic yesterday and got a right royal telling off asmine went up to 38 last week. I was in the middloe of nowhere in Devon but took to the bed and slept it out and was fine next day. However, it could have gone the other way i was told and that the main concern on taxotere is that we are more prone to infection than on any other drug. Dont worry about the nails, just worry about the temperature and good luck to you. I have my second taxotere on monday so see how this goes xx best wishes xxx",
      "MessageIndex": 8,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10768/taxotere---any-tips",
      "Title": "Taxotere - any tips?"
    },
    {
      "AuthorID": "JANISRW",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janisrw",
      "Content": "YEAY it grows back already? I have heard this before fantastic, see any other side effect is minimal if you get your hair to grow back again. I only have 3 more Tax to go so will battle it out, i dont care about the nails but there was a lady in clinic painting hers a dark colour you were right. Hair yay xxxxxxxxxx luxury xxxxxxxxxxxxxxx",
      "MessageIndex": 5,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10768/taxotere---any-tips",
      "Title": "Taxotere - any tips?"
    },
    {
      "AuthorID": "JANISRW",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janisrw",
      "Content": "Everyone is different so what may happen may not actualy happen. My friend has just finished her 4th treatment and not lost nails at all and just had tingly feeling in hands and fingers sometimes. Just had my first Taxotere on Monday and not too bad so far apart from flu like aches and paines and a slight tingly feeling but on day 4 not tooo bad side effects. If you are only having 3 it may not affect you. Take the steroids as prescribed they will counteract the side effects. GOOD LUCK XXXXXXXXX",
      "MessageIndex": 4,
      "PostDate": "14/08/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10768/taxotere---any-tips",
      "Title": "Taxotere - any tips?"
    }
  ]
}