{
  "AuthorID": "Jantr",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jantr",
  "Posts": [
    {
      "AuthorID": "Jantr",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jantr",
      "Content": "Hi Kathleen I've been on post treatment medication for about three years. Started on Tamoxifen which made my eyes roll back inside my head and couldn't find the words to speak whenever I flushed in the extreme ( every hour at least - day and night). Went to Letrazole, which made my skin crawl and brought me out in a rash all over my face. Went to Anastrozole, which gave me extreme day and night sweats, fatigue, depression and joint pain. Went to Exemestane - same again but developed permanent lower back pain which set into my hips and down my legs and also sent my head funny as the Tamoxifen had. I was desperate and due to go on holiday, so tried to call Breast Nurse, but no answer - not even to voicemail, so called GP Practice, who put me to a Locum who said he would call back in 10 minutes (which he did). To my pleas to just give me 2 weeks peace whilst on holiday on the south coast - he said all would be ok. Huge sighs of relief and as I stopped, the back pain softened and seemed to move up my spine - fine, I thought it will move up and disappear. I woke up next morning with what I thought to be mosquito bites around my bra line, but they didn't itch, they stang. I had had shingles in the 90's and recognised the symptoms, so went to local GP to get strong painkillers - not very efficient, rather blighted the holiday and continued for about 5 weeks after. I had made an appointment with my Oncologist for my return, she looked at the fact that I had been on treatment for three years and said that I could have a treatment holiday until January 13th, when she would see me again. Over the months I have realised just how much this medication has affected me. I have felt my personality return, realised how depressed, fatigued, almost paranoid at times, the bone ache day and particularly at night and soaked shirts in hourly sweats with the horrible rushing nausea that portends same!! I had a 2.5 lump (grade 2.2?) and they only found one cancerous cell in my lymph. I am 59 years old - has anyone stopped taking treatment - I've been told there are only the four and I've exhausted them haven't I - (they've exhausted me!) any comments gratefully received",
      "MessageIndex": 3,
      "PostDate": "04/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103263/where-can-i-go-from-here",
      "Title": "Where can I go from here ?"
    },
    {
      "AuthorID": "Jantr",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jantr",
      "Content": "This is my first post. I took treatment for breast cancer early 2013 and since then have been through Tamoxifen, Anastrozole, Letrozole and Exemestane. I was due to go on holiday two weeks ago and was at the end of my tether with side effects, I called my GP to see if it would be ok to stop dead for this holiday - just to get a break! A locum said it would be fine, so I stopped and as the lower back pain abated, it moved up my back - OK, I thought that's how it goes away. Nooo, it was shingles, so I spent two perfect weeks feeling as though I'd been flayed - but It was better than the side effects medication brought! Am waiting to see my Oncologist tomorrow and the thought of turning back into the mindless, dribbling monster my poor partner has to put up with is filling me with dread. Has anyone stopped early and any evidence of consequence or any alternative to the medicines I have been taking - Please!",
      "MessageIndex": 15,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99826/hello-can-anyone-help",
      "Title": "Hello can anyone help?"
    },
    {
      "AuthorID": "Jantr",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jantr",
      "Content": "This is my first post. I took treatment for breast cancer early 2013 and since then have been through Tamoxifen, Anastrozole, Letrozole and Exemestane. I was due to go on holiday two weeks ago and was at the end of my tether with side effects, I called my GP to see if it would be ok to stop dead for this holiday - just to get a break! A locum said it would be fine, so I stopped and as the lower back pain abated, it moved up my back - OK, I thought that's how it goes away. Nooo, it was shingles, so I spent two perfect weeks feeling as though I'd been flayed - but It was better than the side effects medication brought! Am waiting to see my Oncologist tomorrow and the thought of turning back into the mindless, dribbling monster my poor partner has to put up with is filling me with dread. Has anyone stopped early and any evidence of consequence or any alternative to the medicines I have been taking - Please!",
      "MessageIndex": 0,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99826/hello-can-anyone-help",
      "Title": "Hello can anyone help?"
    }
  ]
}