{
  "AuthorID": "Janzz",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janzz",
  "Posts": [
    {
      "AuthorID": "Janzz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janzz",
      "Content": "Hi Peachez Thanks for letting me know how Letrazole affects you.  I will chat when I see the oncologist this week.  I appreciate how lucky I am to have the drugs to to help me believe me, and if it means putting up with pain so be it as I know how lucky I am to have got this far.  Perhaps he will advise me as to something to take alongside to help the joints. I think like everything when something new or unpleasant happens it tends to be a worry. Will also try to walk a bit more!! Will be thinking of you on Monday - good luck and keep in touch Jx",
      "MessageIndex": 4,
      "PostDate": "27/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33437/letrazole",
      "Title": "Letrazole"
    },
    {
      "AuthorID": "Janzz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janzz",
      "Content": "Hi I am new to the site, can anyone tell me if they are on Letrazole and if they have any side effects. I am not sleeping and very tired and have aching joints. Had chemo earlier this year followed by radiotherapy for grade 3 aggresive tumour. Thanks",
      "MessageIndex": 0,
      "PostDate": "23/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33437/letrazole",
      "Title": "Letrazole"
    },
    {
      "AuthorID": "Janzz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janzz",
      "Content": "Hi Posy, Thanks for that, there doesn't seem to be many people on Letrazole that I know of.  I also had 20 sessions of radiotherapy and finished end of July.  The pain and sleep has just got worse really.  Today its my ankles - can't hardly walk.  I have a big check up with oncologist on Thursday so will certainly talk to him. Take care of yourself Janzz",
      "MessageIndex": 2,
      "PostDate": "26/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33437/letrazole",
      "Title": "Letrazole"
    },
    {
      "AuthorID": "Janzz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/janzz",
      "Content": "Hi Peachez I hope that all went well today, been thinking of you. I will chat with my oncologist on Thursday and see what he comes up with. I certainly don't want to change drugs for something worse! Will ask about Glucosimine etc as if it helps I'm willing to go for it. Take care and hope to hear from you soon Lots of love Janzz  xx  ",
      "MessageIndex": 6,
      "PostDate": "29/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33437/letrazole",
      "Title": "Letrazole"
    }
  ]
}