{
  "AuthorID": "Jayjay101",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayjay101",
  "Posts": [
    {
      "AuthorID": "Jayjay101",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayjay101",
      "Content": "Hi Linsw, I had a lump in my armpit, and once my doctor decided to refer me to the breast clinic, I had an appointment within a matter of days, which was also on a Monday - I think that might be new business day. When I first got there, I was given a basic questionnaire to fill in, and I was taken to a room for height and weight, before being returned to the general waiting room , where my partner was.  After a while, I was called through to see a practice nurse, who was wonderful.  She explained what was going to happen, and was very reassuring - I'm not ashamed to say that I cried, and she wasn't fazed by it at all.  The first was a quick top-off physical exam, by her, and then she stood on the otherside of the room, asking me to lift my arms, so she could compare my breasts.  The instructions were very clear, and it was no where as embarrassing, as I'd thought it would be.  She circled where the lump was, with black pen and I was then referred for an ultrasound - it's usually a mammogram at this point, but I'll come back to that.  I was given a gown to put on, a basket for my clothes, and sent to another waiting room, which is women only.  This wait isn't a pleasant one, so I suggest you take something to try and take your mind off what's going on. After a while, I was called through for an ultrasound, which is lying topless on the bed, but they do give you a paper towel to cover yourself, and there's a nurse there, who you can talk to, and who is again reassuring.  The ultrasound was quick and painless - that included two separate ones for me, as there was a trainee there too.  At that point, the consultant that did the ultrasound explained that it was an inflamed lymph node, and there was no cause for concern - she actually showed me what she was looking at on the screen.  I was returned to the waiting room, and then called back to the original practice nurse, who repeated what the consultant had said, and confirmed she would write to me, and my doctor.  At that point, it was get dressed and go home!  The letter arrived within about 10 days. As for the mammogram, they didn't do it at the time, because my lump was in my armpit, but I was called for a regular screening one. last week.  For that, I was initially in the main waiting room with my partner, and then called through to the second one, where you are alone.  After half an hour's wait, I was called into another room, and again asked to remove all upper clothing.  Once again, I had a brilliant nurse, who was very kind.  You stand stand in front of the machine, and the nurse arranges your breast on a plate, bringing another plate down, initially using a foot peddle, then manually.  At all times, she was asking if I was comfortable, and I really was - yes, there was a squeezing sensation, but no pain.  She then steps back, asks you to take a breath, takes the shot and the machine instantly releases you.  They do shots from above, and from the size.  For the side shots, you have to move your arms in a different way, and lean, but the instructions are clear, and we ended up having a laugh, because I was nervous, and doing everything wrong!  And that was it - clothes back on and leave.  The results will be posted within 10 days, or maybe a little longer, as they're short staffed. I hope this helps to put your mind at rest over what actually happens on the day.  I was convinced that I had breast cancer, and I've never been so scared in the whole of my life, but they were brilliant with me, and I was lucky. Good luck!  Will be thinking of you tomorrow.",
      "MessageIndex": 73,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135835/breast-cancer-august-diagnosis-group",
      "Title": "Breast Cancer August diagnosis group"
    },
    {
      "AuthorID": "Jayjay101",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayjay101",
      "Content": "Thanks for letting us know how you got on.  As for the crying, well, I was howling the moment I walked in - my guess is that they're used to it, and it's better out than in - they know how traumatic it is, and downright bloody scary.  No place for cool!  :) Roll on Thursday, so you've got a better idea of what you're dealing with.  Here if you need to chat. Jay xx",
      "MessageIndex": 87,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135835/breast-cancer-august-diagnosis-group",
      "Title": "Breast Cancer August diagnosis group"
    },
    {
      "AuthorID": "Jayjay101",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayjay101",
      "Content": "You're more than welcome, Lindsey - glad to have helped a little. I just wore jeans, T-shirt, boots and underwear.  I only needed to remove my T-shirt and bra, and they give you a gown to wear.  Me, being me, tried to put it on back to front... the practice nurse pointed out that the bits they were interested in were at the front, so it might be an idea to have the gap at the front...  For the ultrasound, they used a gel, and they wiped it off for me, before I got dressed, and there was no residue on my clothes.  Oh, that reminds me!  No deodorant, talc or body creams, as they can give a false reading.  I took a deodorant with me for after the mammogram. My ultrasound experience was different to Jo Dec - I cannot imagine how that must have felt and hude hugs are required in that direction.  Other than asking me to remove my gown and lie on the bed, there was no small talk at all, and there was what felt like quite a delay, as I was lying there.  The nurse kept smiling and asking if I was ok.  Looking back, I think he was waiting for the lady consultant to come in, before he started - I remember her appearing from behind a curtain, and then it was showtime.  I didn't know he was a trainee at that point.  He was totally silent, for a good couple of minutes of the exam, before saying 'is that it?' and the consultant said 'no'.  He then said 'what about that?' and consultant said 'no' again.  He asked about something else, and was told it was a blood vessel.  At that point, the nurse starting asking me again if I was ok.  The consultant took over, and you could tell straight away that she was more experienced, just by the speed and the pressure she used.  She was really quick in pointing out certain areas, and very professional in her manner.  Neither of them spoke to me, until it was time to say what the consultant had found.  Reading back, that sounds as though it was a bad experience, but it wasn't, and the whole thing was over very quickly.  It was only when I told my partner about it, that he pointed out that the trainee had probably been shown what the nasties look like, and perhaps not so much the all clears, so he could have been struggling.  I've got to admit, that's how it felt. I would suggest that if you have any questions at all, or if you're worried about anything, ask, ask and ask again.  I'm terrified of needles, and I'm a fainter, and the practice nurse said that if it came to a biopsy, she'd hold my hand herself - just that bit of kindness and support made a huge difference.  She also said that it was good to raise my concerns, as if they knew what was likely to happen, they could prepare for it.  Fingers crossed for you. Jay xx",
      "MessageIndex": 79,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135835/breast-cancer-august-diagnosis-group",
      "Title": "Breast Cancer August diagnosis group"
    }
  ]
}