{
  "AuthorID": "JayJay999",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayjay999",
  "Posts": [{
    "AuthorID": "JayJay999",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayjay999",
    "Content": "Just as I'm finding my way through this whole sorry state of affairs, there's yet another swift kick up the behind to knock me off my feet. Lawyers still fighting it out over the divorce, being pushed/pulled in every direction. Advice still to move into a hostel, and pretty much give up on everything I've worked so hard for. Finally start RT this Monday. Given appointment times that my ever wonderful employers have graciously worked around bearing in mind I work a 2 hour drive from both home and the hospital. Find out a couple of days ago that actually these have changed and I \"just have to get on with it, I'm nobody special\"! Never for one second imagined I was, so found that more than a wee bit insulting. Then receive a call asking to change the RT verification appointment as Oncologist wants to see me. Now I'm told that there are 2 shadows on my liver, these were noticed at the very first referral appointment, 16 weeks ago... I'm halfway through packing up to move out after treatment finishes and I've just about got myself into an emotionally stable state of mind. Now however, it's back to CT scans, more appointments leading to heaven only knows what and I've done nothing but weep uncontrollably for the last 48 hours. Why couldn't they just tell me what was going on at the beginning??? I've had to fight for every single piece of information on my diagnosis and treatment and it's exhausting. The divorce/treatment/diagnosis and work I can cope with, but this relentless being made to feel as though I have no right to be informed of my own information is simply draining and I could honestly walk away from it all and just take my chances. Please forgive my \"oh woe is me\" self pity, but I'm at breaking point and just needed to put things in writing. Sorry :(  Wishing you all love and luck as always xxx",
    "MessageIndex": 0,
    "PostDate": "29/09/2018",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168907/frustrated-don-t-read-i-m-simply-having-a-moan",
    "Title": "Frustrated...(don't read, I'm simply having a moan :( ...)"
  }]
}