{
  "AuthorID": "JayKay8",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
  "Posts": [
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hi Ali Sorry to hear this news.  You might find some useful info re PALB2 on this US website, Facing Our Risk of Cancer Empowered. All good wishes.",
      "MessageIndex": 7,
      "PostDate": "15/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168020/palb2",
      "Title": "PALB2"
    },
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hi AJ I see from your profile that you are having private testing, but I wondered if you had come across media reports from last year about a new test that narrows down one's breast cancer risk? There was a report on the BBC website and it was also in The Guardian. There seem to have been lots of developments recently so it is well worth doing research before making any decisions.  One such report is about the very low risk of death, for example, for people with a BRCA2 mutation if they choose to have surveillance rather than risk-reducing surgery.  This would clearly lead to the question as to whether having risk-reducing surgery is \"worth it\" compared with surveillance for some women at high risk of breast cancer. I'm sorry that this doesn't answer your question about the process of risk-reducing mastectomy but I hope it encourages you to investigate your options thoroughly so you can make an informed decision. All good wishes",
      "MessageIndex": 4,
      "PostDate": "21/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166557/risk-reduction-surgery",
      "Title": "Risk reduction surgery"
    },
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hello Everyone I hope you don't mind me popping over from the BRCA and Ovarian Cancer groups but I'd like to flag up some research reported earlier this week by Cancer Research.   Professor Andrew Tutt, from The Institute of Cancer Research, London (ICR) who led the research, said the study strongly suggests that women with triple negative breast cancer should be tested for faults in the BRCA genes as those who test positive may benefit from carboplatin. The research is particularly relevant for those with Triple Negative Breast Cancer, but I guess for people who have any suspicion that their cancer could be associated with a BRCA mutation it is worth investigating further, as BRCA associated cancers seem to respond particularly well to carboplatin. I hope this info might be helpful.",
      "MessageIndex": 8,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156216/newly-diagnosed-triple-negative-starting-chemo-1st-may",
      "Title": "Newly diagnosed triple negative starting Chemo 1st May"
    },
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hi Sparkle Hope you don't mind my intrusion into this group but I just want to let you know that, even if you are found to have a BRCA mutation, it is important to be aware of all your options. The Eve Appeal has information about a trial for people to have Risk Reducing Early Salpingectomy with delayed Oophorectomy - which basically means having one's fallopian tubes removed first and waiting until around the time when the natural menopause would happen before having one's ovaries removed.  This would have the advantage of avoiding the detrimental health consequences and symptoms of early menopause, but the disadvantages in terms of risk reduction are as yet unknown.   There seem to be many developments happening with BRCA and managing risk reduction so it is well worth making sure you know the most up-to-date information before making any irreversible decisions, such as surgery. I hope your genetic test outcome is favourable, and all good wishes. ",
      "MessageIndex": 5,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171826/breast-ovarian-cancer-link-and-genetic-testing",
      "Title": "Breast ovarian cancer link and genetic testing"
    },
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hi Dormouse I'm sorry to hear about your diagnosis and the difficulties in family communication.   Just briefly, it is very important to let your oncologist and medical team know about the family BRCA mutation because it could affect your treatment and eligibility for clinical trials.  New types of drugs, called PARP inhibitors, have recently become available for people with cancer and a BRCA mutation;  I have ovarian cancer with a BRCA mutation and have just started on one of these drugs, and I understand that there are people with breast cancer who are in trials with the same drug in combination with other chemo drugs. With a known BRCA mutation in the family I imagine your oncologist will refer you for genetic counselling (and subsequent testing if you are happy to go ahead with it).  Testing for a specific BRCA mutation is much quicker than testing for any possible BRCA mutation, but to find out what that specific mutation is you will probably need to be in contact, either directly or indirectly, with your aunt.  She probably has a genetics reference number to give to relatives, which is the most helpful piece of information for you to give to your genetics counsellor.   I can understand your concerns for your daughter and grand-daughter too but the first step will be for you to get tested and, if you are found to have a BRCA mutation, the genetic counsellor should talk through with you how other members of the family can best proceed with counselling/testing as it is quite usual to wait for several months for an appointment.  (If, in the unlikely situation your daughter or grand-daughter have any symptoms that might possibly be cancer in the near future - breast, ovarian and pancreatic are the main ones associated with a BRCA mutation - then they should tell their doctor about the family BRCA mutation so that they are referred immediately.)  Please note that males with a BRCA mutation are at higher risk of cancer too.  If you are seeing your oncologist on 27 December to talk about chemotherapy treatment it will be important for you to raise the BRCA issue then. I hope all goes well for you and best wishes,",
      "MessageIndex": 4,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145372/brca-gene-question",
      "Title": "BRCA gene question"
    },
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hello Hilary I'm glad you spoke to your oncologist about the family BRCA mutation. Although I don't know much about having breast cancer with a BRCA mutation, assuming you have the mutation, (as I have ovarian cancer with a BRCA2 mutation) I am aware that it can also affect the choice of chemotherapy. Although this is from a website based in the US, it states Other research suggests that BRCA-positive individuals diagnosed with triple-negative breast cancer may respond particularly well to platinum-based chemotherapy.  Do you know what drugs are proposed when you have chemotherapy? Do you know whether your oncologist is up-to-date with knowledge about this as it might well be worth you doing some reading up about it and possibly requesting a second opinion about proposed treatment from oncologists who have a particular interest in this area?  A second opinion doesn't necessarily involve you actually attending another appointment with a different oncologist but could be simply requesting that your notes and proposed treatment are reviewed by an expert in this particular area. Perhaps it would be a good idea also to post in the BRCA positive group in this community to see if others have had recent experience or knowledge that could help you obtain the most appropriate treatment.  It seems that there has been a thread here.  Even if you don't manage to find out whether you have the family BRCA1 mutation before you start chemotherapy, it might be that the chemo is changed as a result of finding out the genetic test results so I think it is worth pursuing genetic testing as soon as possible. It's a lot to take in, but if the knowledge of your BRCA status might give you a better outcome to your treatment I'm sure you'll agree that it is worthwhile finding out as soon as possible. Best wishes ",
      "MessageIndex": 7,
      "PostDate": "27/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145372/brca-gene-question",
      "Title": "BRCA gene question"
    },
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hi Hilary You will probably be interested in a post, to which I've just responded this morning, to someone diagnosed with breast cancer last week who has been advised that the whole path of action could be changed if she carries the faulty gene.  See here.  You might like to ask your Breast Care nurse whether this might apply to you too. Best wishes",
      "MessageIndex": 9,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145372/brca-gene-question",
      "Title": "BRCA gene question"
    },
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hi again I don't know if you have been tested to see if you have inherited the BRCA2 mutation from your dad but the relatively good news is that, for women with a BRCA2 mutation, risk of death from breast cancer is actually quite low.  (I realise that having cancer at all is not pleasant but it seems that if it is caught early then the chances of a good outcome are high.) This report from March might be reassuring for you. Waiting for test results or to determine whether things like swelling goes down can be stressful and I understand how difficult it could be for you to get through the next few weeks.   When I'm in this sort of situation the question I find it helpful to ask myself if \"What is the best thing I can be doing now/today/this morning?\"  Apart from looking after myself, it helps me get on with life as best I can and not spend too much time worrying about things that I cannot change. I hope you find some nice ways to enjoy yourself in the next few weeks. Best wishes",
      "MessageIndex": 7,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165190/axillary-tail-lump",
      "Title": "Axillary tail lump."
    },
    {
      "AuthorID": "JayKay8",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jaykay8",
      "Content": "Hi loulou Your dad might be interested in the following advice from the US: \"All men with breast cancer meet national guidelines for genetic counseling and testing\" - that is in the US. This is from the FORCE website. I don't know whether he meets UK guidelines but if he hasn't already seen a genetic counsellor I imagine it would be helpful for him to see one as it could open up new treatment options to him if he needs further treatment. I hope the swelling in your lymph node goes down but it sounds reassuring to that you are being monitored. Best wishes",
      "MessageIndex": 2,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165190/axillary-tail-lump",
      "Title": "Axillary tail lump."
    }
  ]
}