{
  "AuthorID": "JayneyB20015",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayneyb20015",
  "Posts": [
    {
      "AuthorID": "JayneyB20015",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayneyb20015",
      "Content": "I ummed and ahhhhed then turned it on , pottering around , I recognised a voice... Suddenly hooked...I saw my consultant Mr Kieran Horgan from Leeds.  I felt strangely comforted and proud to see him treat the chap from Leeds with breast cancer.  I have been lucky enough to have the most amazing consultant, oncologist, BCN's and oncology nurses and feel so very very grateful to them all to be out the other side (I may have missed some words out there with being from Yorkshire and all that! ).  Hair growing back and starting back at work.  This Macmillan site has been such a source of information, support and strength throughout.  Thank you all and sending much love to those going through troubled times with our \"little visitor\".  Love  Jayne xxxx",
      "MessageIndex": 27,
      "PostDate": "03/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109913/the-big-c-me",
      "Title": "The Big C & Me"
    },
    {
      "AuthorID": "JayneyB20015",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayneyb20015",
      "Content": "Hi All, I have been a long time daily reader of this board and love the support that there is here, though this is the first time I have posted. Im 43 and was diagnosed 11th August 2015 with Invasive Ductal Cancer, 500mm tumour , Grade 3, ER+ and Her2+ (ticked all the boxes!). The lymphnode biopsy showed no involvement (overjoyed). Chemo started 11th September 15 with 3 x EC and 3 x Docetaxel and Herceptin (ongoing), the last chemo was on 29th Dec 15. I am quite proud of myself getting through the Chemo relatively ok though the switch to Docetaxel was a bit of a shocker to start with the shooting pains etc but managed to control them better for the following rounds. My hair is starting to sprout back...(Yeay!) Anyway enough of the waffle, I have developed this week a really bad breakout of spots on my face, I have never been prone to spots even as a teenager other than the odd one luckily. They are over my nose and down one cheek and also under both eyes which are the really sore ones. They are small, but numerous, quite red and angry with tiny little white heads...I tried my usual remedy of TCP but this doesnt seem to help and as one goes a new one appears.. I know this isnt the end of the world, but was just curious to hear if anyone else had experienced this and if so any miracle remedies that would help... TIA Jayne xx",
      "MessageIndex": 0,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104121/strange-spots",
      "Title": "Strange Spots...."
    },
    {
      "AuthorID": "JayneyB20015",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayneyb20015",
      "Content": "Thank you both, bit of a relief to know its not just me!!! As I say not the end of the world just strange, during chemo my skin was really good but now urgh!!! I'll read the link George and ring the oncologist on Monday...  Thanks again! This site is soooo helpful!  Jayne xxx",
      "MessageIndex": 3,
      "PostDate": "22/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104121/strange-spots",
      "Title": "Strange Spots...."
    },
    {
      "AuthorID": "JayneyB20015",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayneyb20015",
      "Content": "Thanks Lee so much, it's great to find you're not on your own with these things... I got some sudacreme after reading this and whilst look like a ghost it's soooo soothing!!! Thank you Jayne xxx",
      "MessageIndex": 5,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104121/strange-spots",
      "Title": "Strange Spots...."
    },
    {
      "AuthorID": "JayneyB20015",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayneyb20015",
      "Content": "Hi there, I can answer in part... I had my surgery last Saturday 30th Jan, this was my right breast and in order to get what was needed they had to also do a breast reduction and lift at the same time else it would have looked too \"deformed\".  My experience is ( and know we are all so different) that I have healed well physically. A week on I have full movement in my arm. I am still taking painkillers ibuprofen and paracetamol but nothing stronger.. I have been today had my dressings changed and feel I would want another couple of weeks before going back to work. Whilst the dressings were changed my nipple felt really sensitive which surprised me as I thought I would lose that.  The best thing was I got the pathology results early, in which they told me they were \"all clear\" , they got the clear margins they needed , no more surgery on that side... yeay!!! Hopefully other will help advise on the other bits!! Good luck! Jayne xx",
      "MessageIndex": 2,
      "PostDate": "06/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104775/reduction-and-uplift-surgery---reconstruction-not-perfect",
      "Title": "Reduction and uplift surgery - reconstruction not perfect"
    }
  ]
}