{
  "AuthorID": "JayZee",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayzee",
  "Posts": [
    {
      "AuthorID": "JayZee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayzee",
      "Content": "Avie - Hi, I so completely understand about the 'What the??????' and for me the more I understood of it all the better I felt. Jools is right in that the best folk to explain it all are the nurses, I have called and emailed the backup nurses a couple of times now and they are fab - unfortunately for me the hospital have not been quite so good at explaining but I understand from reading blogs and forums that many 'key workers or nurses' are indeed a fabulous source of info and support..... I would also recommend a revisit to the Breast Cancer Care leaflet 'Understanding your pathology report' I wont pretend to be the expert, but in very simple terms as I understand it: HER2 positive means that your cancer cells are stimulated by a protein and you will benefit from Herceptin which will effectively stop that stimulation and reduce/prevent cancer growth. So good news really - you have another weapon in the armoury! Grade 2 is the way the Docs decide how quickly your cancer is growing, by looking at the cells . 1 = slow, 2 = moderate, 3 = fast. I believe that Breast Cancer is most usually 2 (although mine is a 3) Staging is described in different formats, and takes into account Tumour size, Grade and spread to nodes or bones/organs etc - cant say for sure what yours means but hope this helps to work it out or at least give the confidence to seek further (and far more intelligent) advice from the nurses... Hope surgery recovery goes well and you have a fab Xmas and new year and that you find the support on here that I am/have - I am only a few months ahead of you in treatment and its not sooo bad!! Julie",
      "MessageIndex": 2,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10818/results",
      "Title": "Results !!!!!"
    },
    {
      "AuthorID": "JayZee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jayzee",
      "Content": "Hello out there... I was diagnosed in September, had lumpectomy and just started FEC Chemo (2 weeks in). At this precise moment I am more nervous about this new technology - I know, hardly new but it is to me, I dont do the Internet and all this blogging and chatting and forums in text is mind-boggling! - I have no doubt within weeks I will feel comfortable with it, afterall cancer was new to me too not long ago and now I am becoming quite the expert (NOT!!!) I am lucky to have great parents close by and several friends have really stepped up, my daughter is a super star and work have been extremely supportive thus far... but I guess nothing is better than folk who actually get it and arent offended by the truth! - hoping to find that here and from reading other forums seems I have come to the right place... I do truly feel pretty positive for the vast majority of the time just wish I knew more about what to expect, I feel completely in limbo - can I/will I/Should I work, should I risk helping out at my little girls school/watching her Xmas play with the hundreds of colds and bugs being sneezed around, will I be able to go to that Xmas night out ! will the hair remain on my head or all over my bed, do the side effects increase with each cycle or not - I know we all respond differently etc etc etc it's just so frustrating not being able to plan isn't it?! Anyway - just wanted to say Hi and I look forward to 'speaking' to you.... Still smiling. Julie",
      "MessageIndex": 0,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10817/another-new-member",
      "Title": "Another New member!"
    }
  ]
}