{
  "AuthorID": "Jenben1981",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenben1981",
  "Posts": [
    {
      "AuthorID": "Jenben1981",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenben1981",
      "Content": "Hi all, this is my 1st post on here although I have been reading this forum for a while and found it so helpful. I'm 36 years old. I'm married to my lovely amazing husband and I'm mum to our gorgeous girl who's 11 and our cheeky little man who's 8. I was also diagnosed 2 years ago with an autoimmune disease called Scleroderma. I was diagnosed with an aggressive form of breast cancer back in March 2018, IDC stage 2b, Grade 3 40mm and other people's blogs and this forum have helped me so much in the last few weeks.  I'm now on day 4 of chemo 3 of FEC-T. Starting to get so nervous about the Docetaxel for the next 3 rounds. Does anyone have any experience or advice. It's the horror stories of the nails coming off and I'm feeling so awful already and I know I shouldnt google but it's hard not to. I decided to start my own blog for all you ladies/gents who have been recently diagnosed and are 3 months behind me so you know what to expect and to know it's feel normal if you do feel like I feel. You are not alone in the way you feel and its good to know you will get there and the symptoms you may or may not feel is not just in your mind. Except now I'm starting to get scared. This is my link to my Breast Cancer chemotherapy blog if anyone is interested in having a look at our story so far. Please feel free to comment or share. I just feel so alone at the moment.  www.facebook.com/.../ Thank you xxx",
      "MessageIndex": 0,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159027/round-3-of-fec-t-getting-nervous-about-docetaxel",
      "Title": "Round 3 of FEC-T, getting nervous about Docetaxel!"
    },
    {
      "AuthorID": "Jenben1981",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenben1981",
      "Content": "Thank you so much Sal, I've never posted on these forums before so thank to for replying to me. I don't know anyone else going through this at the min and I'm still waiting for my breast nurse to arrange a group counselling thing for me to meet others. Have just been BRCA tested so worrying about that as I'm triple negative and my kids are my world. Mum also had it 15 years ago thankfully was picked up during routine mammogram.  Really appreciate your reply. We aren't alone are we! it just feels it sometimes.  And yes I will avoid the horror stories.there's some not nice things out there....  Hope you're ok and take care too  Jen xxx",
      "MessageIndex": 2,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159027/round-3-of-fec-t-getting-nervous-about-docetaxel",
      "Title": "Round 3 of FEC-T, getting nervous about Docetaxel!"
    },
    {
      "AuthorID": "Jenben1981",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenben1981",
      "Content": "Thank you so much for your reply! I've heard in France from my aunty that they use cold hand and feet pads to try and preserve the nails, but the chemo nurses didn't seem to know about that when I mentioned it. I will Def try your advice re the dark nail polish and see how it goes and also ask about the extra steroids. Yesterday was my last steroid for round 3 and I feel so awful today. This cycle certainly seems harder than the last 2 for some reason. And so happy that 6 months you are doing well. Thank you xxx",
      "MessageIndex": 5,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159027/round-3-of-fec-t-getting-nervous-about-docetaxel",
      "Title": "Round 3 of FEC-T, getting nervous about Docetaxel!"
    },
    {
      "AuthorID": "Jenben1981",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenben1981",
      "Content": "Thanks Laura, any information is greatly appreciated! They haven't mentioned steroids before chemo and I'm not seeing the oncologist until an hour before my first Docetaxel so I might ring up and ask. Worth a try isn't it.  I know it sounds stupid worrying about the nails etc , but the thought of them falling off just makes me feel queasy!  Did u still have to have the filgrastim injections after Docetaxel? Thank you so much  Jen xxx",
      "MessageIndex": 6,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159027/round-3-of-fec-t-getting-nervous-about-docetaxel",
      "Title": "Round 3 of FEC-T, getting nervous about Docetaxel!"
    },
    {
      "AuthorID": "Jenben1981",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenben1981",
      "Content": "Thank you Gay for your reply. Really appreciate your input.  Will Def find out about the steroids before hand as nothing has been mentioned so far about them and I'm only seeing oncologist an hour before I start it!  Has anyone had any problems with their hair coming back or whay about the other side effects? Am finding this 3rd round of FEC the worst so far, I thought round 2 was much easier than the 1st but don't know if it's the heat affecting me more too.  Big hugs  Jen xxx",
      "MessageIndex": 8,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159027/round-3-of-fec-t-getting-nervous-about-docetaxel",
      "Title": "Round 3 of FEC-T, getting nervous about Docetaxel!"
    }
  ]
}