{
  "AuthorID": "Jeni2356",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jeni2356",
  "Posts": [
    {
      "AuthorID": "Jeni2356",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jeni2356",
      "Content": "Hi Nollie, Sounds like I have the same as you, Grade 1.  Lumpectomy and three nodes out, pretty painful as I guess with all surgery but healed ok, scar was lumpy but is not bad now. Results with me, well there was one that had cancer so they went in and took the rest of the lymph nodes out (axilliary node clearance) and luckily didn't find anything.  16 nodes in total. I have a really bad time I have to say, although it doesn't happen to everyone and on 23rd September after the surgery I drove home for the weekend (2 hour drive). Over two days I had what I called a grapefruit under my arm and felt like a body builder or something.  Drove back to London Sunday night and whoosh, after I stopped the car, about a litre of fluid came out like a fountain, welcome seroma!, went to GP and we 'milked' the rest out.  This happened three times and several visits to breast clinic, stitches re-stitched and for dressings galore, TLC and observation until infection and A&E at 3am in the morning in agony with massive infection (their description) This meant a week in hospital dosed up with antibiotics and morphine.  But hey, everyone reacts differently and I had a bad reaction and my lymph fluid did not want to 'replumb' into my system in a hurry.  They couldn't give me my chemotherapy until I had healed, and I was told not to do the recommended excercises, but now I'm on the mend and every day is a little easier.  They move the nerves to do the clearance and that is the most annoying thing at the moment is constant dull pain and cording, where there are like sinues running down my armpit to my elbow and they look very weird, however I'm booked in with physio to hopefully get it back into action.   Sounds Like you've got your hands full with the horses and the children but you really need to take it easy!  If you can get some help in do so. I'm the sort of person who generally steams on regardless and my life is very active, but this one really made me sit back and reassess my priorities and realize I had to be patient.  I had my first chemotherapy 5th Nov, last Friday and it's do-able, hair loss, from the posts on this forum prob over next two weeks................... Hope you're ok at the moment ..... and take it easy! Regards Jeni x  ",
      "MessageIndex": 3,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "Jeni2356",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jeni2356",
      "Content": "Hi Nollie, how's it going? hope you're feeling a little better today.  Having read the other posts I now feel totally paranoid and  perhaps I overreacted when you first came online with news of your blow-up.  I didn't mean to alarm you, and it was because I would not wish what happened to me on anyone if at all avoidable.  I don't think I've had the easiest of time in my post-operative state.  Whether it's mismanagement (not offered physio from outset), my stupidity in thinking I could carry on like normal when I shouldn't have, not done my exercises, getting the fluid syringed off risking infection or just plain unlucky as it appears everyone else has got through theirs remarkably well.  I apologize if I freaked you or anyone else out. Jeni x",
      "MessageIndex": 10,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "Jeni2356",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jeni2356",
      "Content": "Nollie, Stop soldiering on, if you've got to melon stage, please, please get to the breast clinic asap and get some fluid syringed off before it gets worse! Physio can come later.  It is normal but needs dealing with and you will get some relief.  Phone the ward where you had your op or phone someone at your breast clinic and get some advice, don't think you should be waiting at this stage. You don't want to end up with an infection at A&E like I did it was awful. I felt like I had to deal with it as it was part and parcel of the operation, which it is for a percentage of us, but you need to get seen to.  I don't know which part of the country you're in, however my breast nurse at Guy's in London saw me through this, as well as the surgeon and the consultant (who re-stiched me up after the stiches burst open) they were great and still are. Don't know if you noticed the date of my op but it's taken me up to now to heal and even when they started chemo last week the scar was still weeping a little, takes ages.  It will settle eventually but will take time. Please let me know how you get on and please don't suffer in silence, this is serious stuff. Let me know how you get on.... Jeni x x x",
      "MessageIndex": 5,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    }
  ]
}