{
  "AuthorID": "jenners",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenners",
  "Posts": [
    {
      "AuthorID": "jenners",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenners",
      "Content": "Hi Rebecca, Just thought I would let you know that I still have my hair after 6 cycles of chemo, it is slightly thinner but not noticeably though.  I did lose my eyelashes and most of my eyebrows though and was advised during the 'look good, feel better' session at my hospital not to use false lashes as the chemo can make you sensitive to the glue used.  I have to admit that I did have a go though but found it impossible to make the lashes stay in place when there's no real lashes to lay them on...gave up and just used eye liner!  If you think of the chemo ward as a large waiting room with reclining chairs you wont go far wrong.  If you decide to give the cold cap ago then make sure you have some warm clothes to layer on and off as you could get cold.  After the first 15 mins the brain freeze wears off and you will sail through.  I didn't get any headaches etc.  Just made sure I washed my hair 2 days before each cycle and then not again until 2- 3 days after.  Your hair looks pretty messy at that time but I don't think it will interfere with your modelling as I'm pretty sure you wont want to take on any work during the week after each cycle anyway...you will feel pretty rough.  That said, after that you will bounce back.  I would plan to take bookings towards the middle of week 2 and in week 3...you should be ok then!  Hope this helps, if you need any more advice etc drop me a line.  Good luck with your treatment, Jenx  PS...saw a programme on nipple reconstruction a few weeks ago and it's amazing...they pucker the skin together and tattoo around it to match the other one...you could hardly tell them apart :-)",
      "MessageIndex": 9,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51029/is-the-cold-cap-worth-it-and-chemo-questions",
      "Title": "Is the cold cap worth it and chemo questions"
    },
    {
      "AuthorID": "jenners",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenners",
      "Content": "Hi Jo, I am glad you found my post helpful.  My hair is still looking good and is about shoulder length now!  I am planning on having it cut and coloured soon at Tony & Guy as they have staff trained in hair care for cancer patients.  I know it will be mega expensive, but your hair can be totally different after treatment and colour may come out different etc; so I think it's important to go somewhere with that extra training at least for the first appointment post treatment. I wish you the very best of luck for next week.  Take something to read; I also took in a portable DVD player to take my mind off it all.  They will probably give you some piriton in the line before the chemo which helped me a lot as it had a very relaxing, sleepy effect on me which gets you through the first horrible few minutes.  To be honest the worst was over just over 5 minutes after putting the cap on.  Only negative thing I have found about keeping my hair is that now I am post treatment and look like nothing has happened, everyone is pretty much treating me as nothing has happened.  That might suit some, but physically and mentally I am not the same person at all and feel that had I lost my hair, I would be treated with a little more consideration.  That said 'would I do the same again?' ...yes! Please let me know how you get on and if you need any advice of help please feel free to get in touch. I will send you a friend request to make it easier for you. Wishing you the very best for you continued treatment, Jenx",
      "MessageIndex": 12,
      "PostDate": "08/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51029/is-the-cold-cap-worth-it-and-chemo-questions",
      "Title": "Is the cold cap worth it and chemo questions"
    },
    {
      "AuthorID": "jenners",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenners",
      "Content": "Hi Cleo, I am very sorry to hear of your new developments and can understand how hard it must be to take this decision.  I have not had the same problems as you so far but my thoughts are this.  By taking a rib away you will know that at least this secondary is out of your body.  The singer  Cher had her bottom ribs removed to slim her figure years ago so I am guessing that up to a point, removing a rib wont give you long term problems.  I wondered if the consultant would consider both the rib removal and RT/drug regime together to catch any cells that could be in the surrounding tissues? I know everyone's different, but I tend to have the 'throw everything at it' attitude, if for no other reason than to know that I have don'e all that I can to beat this thing. I'm sorry that I can't be of any more help, but wish you well with your treatment.  Am sending you a hug too! Jenx",
      "MessageIndex": 2,
      "PostDate": "01/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47540/just-diagnosed-with-bone-met---secondary-to-bc-help",
      "Title": "Just diagnosed with bone met - secondary to BC, Help"
    },
    {
      "AuthorID": "jenners",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenners",
      "Content": "Hi Sascha, I don't know whether my input will be of any use to you, but before you are given chemo you will be given a kidney function test and your consultant would use the results to adjust the amount of chemo administered so my feelings are that if your kidney was not working at 100% but they believed your cancer would be life limiting without it, they would give you a reduced dose instead.  I must stress that I am not a doctor, but when my bone marrow was struggling during my chemo they carried on with the cycles but with a reduction in the amount of drugs administered.  Also, I wondered how viable it would be to ask for a meeting with all three doctors given their differing opinions.  I know this would probably put the NHS into a spin as it probably isn't protocol, but maybe if you are 'in' on the differing views/conversation you would find it easier to make a decision as to what treatment path you wish to take.  I wonder if they would be able to offer temporary dialysis to help your remaining kidney process the chemotherapy?...my theory is 'don't ask, don't get'. Enough of my ramblings; I wish you well with whatever treatment you choose and hope that you have a speedy recovery.  Big hugs, Jen x",
      "MessageIndex": 1,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50465/anyone-else-with-only-one-kidney-facing-or-had-chemo",
      "Title": "Anyone else with only one kidney facing or had chemo??"
    },
    {
      "AuthorID": "jenners",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenners",
      "Content": "Hi Sascha, What a crazy state of affairs it is in Spain :-/   My cancer was uterine cancer so no doubt their are quite a few differences in treatment and drugs used.  I had carboplatin and Taxol every three weeks (well, it was supposed to be 3 weekly but was often deferred due to bloodwork).  As the cycles went on they decided to reduce  my dosage as they felt it was more important to have the treatment on time than to keep the dose and lengthen the time between cycles.  In case you don't know, the reason for the gap in between cycles is that healthy cells (blood etc) recover faster than tumor cells so they wait just enough for the good cells to recover but not enough for the cancer cells to recover before being hit by the next cycle, thus killing the cells. I think that they will monitor you very closely so they can reduce or stop treatment if your kidney reacts badly to it.  It's such a shame there are no breast care nurses over there; I hear also there are no support groups either in Spain?  I think the mental stress  patients go through is equal to any physical effects cancer has; it seems the rest of Europe are a bit behind in that respect.  Luckily this site is accessible all over the world. On another note, just in case your consultant mentions the cold cap, I used it for all six of my cycles and managed to keep my hair so its worth the first 10 minutes of discomfort each cycle if you're offered it.   Please let me know how you get on; I will keep everything crossed for you! Jenx",
      "MessageIndex": 6,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50465/anyone-else-with-only-one-kidney-facing-or-had-chemo",
      "Title": "Anyone else with only one kidney facing or had chemo??"
    }
  ]
}