{
  "AuthorID": "Jenniecros",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenniecros",
  "Posts": [
    {
      "AuthorID": "Jenniecros",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenniecros",
      "Content": "Morning Ladies,  i have just spent 4 months in a Tamoxifen nightmare of extreme nausea - some days so bad I couldn't even venture into the kitchen as had to keep away from smell of food, to tiredness, no libido, irritable and lots of weight loss.  Had my lumpectomy in July had radiotherapy in September so am through all that.  Saw the oncologist yesterday who has taken me off the Tamoxifen for three months and then I will have a blood test to see if I have had my menopause or not.  I had been on HRT for 7 years ... then breast cancer ...  what I am worried about is being off the Tamoxifen even though my quality of life was pretty awful on it.  Hindsight being a wonderful thing would I have gone on HRT if I had been warned about the link to breast cancer - probably not.  Will stopping Tamoxifen take me back in a few years time to a reoccurrence of breast cancer?  Who knows and the decision is so hard to make.  If I have had my menopause its possible I can have some other sort of hormone treatment but to be honest they all sound so awful.  Any advice/experience from you lovely ladies would be appreciated.  Jennie",
      "MessageIndex": 0,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140429/coming-off-tamoxifen",
      "Title": "Coming off Tamoxifen"
    },
    {
      "AuthorID": "Jenniecros",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenniecros",
      "Content": "Thanks Ronstar - very helpful.  No they haven't given me any indications, the oncologist said that three months off won't do me any harm and to be honest I could do with the break so I am taking his advice.  I feel I need to try and get back on my feet, its been an awful year with BC and some family issues and I do feel that I am running out of stamina to keep going whilst feeling so awful.  It will be interesting to see how I feel over the next three months to see if I improve.  The nausea has been so bad this week, I can hardly get through each day.  Eating little and often does not help either as I just don't feel like eating.  I had a look at that other thread - thanks for recommending, very helpful.  I am going to try and have a rest this weekend and Monday is the start of a new no Tamoxifen week!  Hope you are okay too.  Jennie",
      "MessageIndex": 2,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140429/coming-off-tamoxifen",
      "Title": "Coming off Tamoxifen"
    },
    {
      "AuthorID": "Jenniecros",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenniecros",
      "Content": "HI Kerry Nice to read your post and you have been through a lot - but don't feel despondent.  I know I am particularly sensitive to tablets so may be my side effects are bad because I don't tolerate tablets well.  I am 53 and after weighing up the pros and cons decided to go on the Tamoxifen to prolong my well being.  I had been on a form of HRT for years for my bad PMT symptons and now am wondering whether this caused my breast cancer - hindsight being a wonderful thing - not sure I would have had the HRT in light of what's happened to me recently.  I am going to persevere with the tablets, in the hope the side effects do subside. I haven't had any other side effects yet other than the nausea.    I too want to get back to how I was before this started.   Take care and keep positive. Jennie",
      "MessageIndex": 9,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137041/side-effects-of-tamoxifen",
      "Title": "Side effects of tamoxifen"
    }
  ]
}