{
  "AuthorID": "JennyT64",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jennyt64",
  "Posts": [
    {
      "AuthorID": "JennyT64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jennyt64",
      "Content": "When this is all over: 1) I'm going to pick up my text books again.  I'm one exam and one project away from completing AAT accountancy and so far it's taken 3 years 2) Stop fretting about tidying the house, it's only me and hubby so as long as it's clean who cares. 3) Stop letting my boss make me so stressed 4) Start doing crafty stuff again, after I've finished number 1 5) Finally go to Vegas and 'get married'.  Ok so it will be renewal but we've wanted to go for about 17 years 6) Keep in touch with friends who have been there for me",
      "MessageIndex": 21,
      "PostDate": "29/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89050/when-all-this-is-over",
      "Title": "When all this is over"
    },
    {
      "AuthorID": "JennyT64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jennyt64",
      "Content": "Hi, Not sure where to begin really, this journey has been going on since August and hasn't even started properly. I hit 50 in January 2014 and was called for my first mammogram later in the year.  After the mammogram I had a letter asking me to go to the hospital 'nothing to worry about, just routine'.  Yeah right.  I had an ultrasound on both breasts as they had found problems.  Right breast there was a lump and left calcification.  I had to go back for a biopsy on both breasts, they took one sample from the right and three from the left.  Results - right breast clear, left inconclusive. Second biopsy another two samples taken by needle, again inconclusive.  Third biopsy I had to go to a different hospital and have a vacuum biopsy, inconclusive. Fourth, vacuum biopsy, again inconclusive but possible DCIS so wire guided biopsy recommended. Results for the wire biopsy show definite signs of cancerous cells so lumpectomy next to see if clear margins can be found.  I had to go in before Christmas for another mammogram as the wanted to make sure all markers had been removed from previous biopsies.  I had an appointment to see the surgeon on Christmas eve and was told the mammogram showed the calcification was over an area greater than 4cm so I now have to have a mastectomy instead.  I've opted for a reconstruction at the same time using the back muscle.  I've given up trying to remember the technical terms for everything. I had lymph node biopsy last week to see if the cancer has spread and get the results on Tuesday.  Mastectomy is booked in for 12th February.  I could have had the op sooner by my son has an RAF graduation on 5th Feb and I wasn't going to miss that. So that's my journey so far.  I'm dealing with this the best way I know how and that's one step at a time and some very black humour.  To give you an idea of this when I told my son about my mastectomy his comment was 'that should make bra shopping interesting'.  I really needed that as that just about sums up my attitude at the moment.  It may change after my op but I'm not there yet. Blimey, that's a long first post but just thought I'd join the group that nobody really wants to join but from what I've read gets loads of support.",
      "MessageIndex": 0,
      "PostDate": "24/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88791/dcis-and-a-very-long-journey",
      "Title": "DCIS and a very long journey"
    },
    {
      "AuthorID": "JennyT64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jennyt64",
      "Content": "Evening, Not long back from my appointment with the surgeon. This was one result that was definite and clear, there was nothing in the lymph nodes, it hasn't spread. I'm just a little bit relieved at that.  Just the op to get through now and hopefully no treatment to follow.",
      "MessageIndex": 4,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88791/dcis-and-a-very-long-journey",
      "Title": "DCIS and a very long journey"
    },
    {
      "AuthorID": "JennyT64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jennyt64",
      "Content": "I thought I'd jump in on this discussion as I need to find a bra for post reconstruction using the back muscle.  I need to find something that can be adjusted to train my new 'breast' where to sit.  Any ideas? Thanks",
      "MessageIndex": 13,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89868/bras",
      "Title": "bras"
    },
    {
      "AuthorID": "JennyT64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jennyt64",
      "Content": "I thought I'd jump in on this discussion as I need to find a bra for post reconstruction using the back muscle.  I need to find something that can be adjusted to train my new 'breast' where to sit.  Any ideas? Thanks",
      "MessageIndex": 28,
      "PostDate": "17/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89868/bras",
      "Title": "bras"
    }
  ]
}