{
  "AuthorID": "jenny_mills",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
  "Posts": [
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "HI all, I was diagnosed in May 2011, had stage 3 ductal cancer and also had lymph node clearance where 3 nodes out of 15 were affected. I have since had 3 X FEC and 3 X Tax Chemo, and 33 days of Radiotherapy, Tamoxifen for 5 years. I am now really struggling with my breast being extremley painful and it looks like there is a build of fluid all around the nipple area. Just wondered if anyone else has had this problem ? Any help or assistance would be appreciated. Happy New Year to Everyone.Jenny xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
      "MessageIndex": 0,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56531/fluid-lymphodema-in-my-breast",
      "Title": "Fluid / Lymphodema in my breast"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "HIi Fiona, Sorry not got back sooner had a busy morning, I have two kids age 7 (Girl) and 9 (Boy) and they are a handful, as well as having 9 kids over this evening for Holly’s birthday party. I was diagnosed in May 2011, it all moved along quite quickly then, I was booked in to have a lumpectomy and a biopsy on my nodes, once the results came back on the biopsy I then had to have another Op for the Node Clearance.  I started chemo in July, 3 X Fec and 3 X Taxotere, this all finished on 28th October.  Radiotherapy started 1st December and that finished on 30th December, which was quite nice really to start a new year with no treatments. I believe that if the cold cap would have been fitted better, same as you really that it would have been quite successful. I started taking the Tamoxifen during radiotherapy, well about 2 weeks after.  I have seen various other comments about taking it later in the evenings to help with side effects.  I take mine at 12 noon, but was told to make sure I take it at the same time everyday.   Will check with my doctor to see if ok to move to the evening and see how I get on. I have also noticed that I am very blotchy now not sure if this started with the Tamoxifen. I don’t think the worrying will ever stop, my mind is always doing overtime, I am just not sleeping well. Scans – never offered any, until I mentioned that I had a pain in my back that had been there for years, and then I was offered the bone scan.  I would like to have a CAT and MRI scan as everyone else seems to be having them, I feel that I cannot move on really as I am constantly worrying about every little pain I get so having the scans will help. I live South East of London, in Kent (Bexleyheath) and was given a wig as well, wasn’t too great, I have since bought 3 more, think I may have a wig problem !!!! I am 38 by the way, how old are you ? Hows movement in you r arm since your node clearance? I am due to a follow up appointment in March so hopefully will find out what sort of screening I will be having going forward. Hows your family been ? I did not really tell my kids what was actually wrong with me as I felt that this would have scared them.  They knew I was ill and that I was having treatment but that was as far as I told them. Really lovely to speak to you. Take care Fiona xxx",
      "MessageIndex": 13,
      "PostDate": "03/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46739/fect-t-part-and-it-s-side-effects",
      "Title": "FecT-T part and it's side effects"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "Hi I see u finished yr chemo roughly same time as me, I finished my taxotere at the end if October. You say u still have numb fingers and toes, same here. Just wondered if u had any other side effects?? My skin still feels sore to touch, and still feel exhausted. Did u have radiotherapy ? I did mine finished end of December Look forward to hearing from u Jen x",
      "MessageIndex": 8,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46739/fect-t-part-and-it-s-side-effects",
      "Title": "FecT-T part and it's side effects"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "Hi Fiona.   Hope your weekend was good x   Friday was ok, the girls were a nightmare kept running around and playing in the arcades rather than playing bowling.  I wont be doing that again in a hurry, but heh they had fun.   I must admit if I had told Holly i think that she would have been the same as your daughter, as she is a very emotional girl.  Must be hard for your son as well going through his GCSE's.  Sounds like your school has been supportive as well which is fantastic, its nice to know they are looking out for the children.   I thought you had a mx, I suppose the decision of reconstruction is hard, but I think at the end of the day it comes down to how you are feeling inside.   I have heard good and bad stories, my sister works as a nurse on an oncology ward and has seem some really bad reconstructions and problems that have occurred from having the reconstruction.  On the other hand my best friends, sister in law has had this done and now spends her time going to groups showing them what has been done and discussing the process.    I kept forgetting if I had taken my tablets too, great idea to have the days of the week on there, I have since bought a pill box with Sunday to Saturday on them which has really helped.    My oncologist never really discussed statistics, just implied the importance of taking them.  I am not too sure about follow ups ? screening ? I went for an appointment on Jan 3rd but as I was experiencing back pain, sent me for the bone scan so prob will find out more when I go back in March.   I am also a born worrier, so I think you are right i am probably worrying at night, thinking what if etc... ! I know keep thinking my leg is getting warm, which is obviously a sign of thrombosis, but this is probably all in my head ! I got a free wig from the NHS, but it was awful, I have since bought one from Suzi's Wigs, in Thurrock and three more from wigs and pieces on line, I tend to browse the site and find one I like, then search on your tube and you can get a proper idea of what the wig is like. I cannot stand wearing the wigs as my head gets too hot, but I will have to start wearing it next week as hoping to get my butt back to work.  The wigs can be cut, I have altered one of mine already.   You take care and speak soon.   Jen x",
      "MessageIndex": 16,
      "PostDate": "06/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46739/fect-t-part-and-it-s-side-effects",
      "Title": "FecT-T part and it's side effects"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "Hi x I was aching like mad when I was on the tax, I was so glad when it all finished, the whole experience was dreadful as you know. My toe nails seem to be ok, finger nails have horizontal lines on them and seem a little ridged, but seem to be getting better day by day. My underarm and down the back of my arm and back are still numb (my nodes were removed as well, I had 3 out of 15 nodes that were affected).  Eyebrows are back and eye lashes are coming back too.   My hair is growing quite well, I did use the cold cap and managed to salvage some hair, looks a bit silly though.  Meant to try and go back to work soon, but not too sure if I should wear my wig or not. Sounds like our cases seem very similar, I had 22 sessions of radiotherapy which finished 30th Dec, had an extra 7 or 8 which was a booster on my glands, apparantly coz of my age. my skin wasnt too bad, a little red, but seem to be suffering with really dry skin down my arm on my affected side. Yes, on Tamoxifen now, Side effects, first 6 weeks feeling really giddy, water retention, my bones keep clicking which is worrying me.  Hot sweats are dreadful especially at night time, but he hoo only another 4 years and 11 months to go before I stop taking them. I am also still feeling really tired and keep forgetting that I still cannot do alot, If i do I find that I get completely exhausted and just have to sit down and chill out. DId you have any scans ?? whereabouts are you being treated ? Take care, Its lovely to speak to someone that is at the same stage as me. Jen xx  ",
      "MessageIndex": 10,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46739/fect-t-part-and-it-s-side-effects",
      "Title": "FecT-T part and it's side effects"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "Hi x As Carole said it isn't that bad, if u can bear 10 mins of having a cold head then it's well worth it. A little bit of advice, my cap was not fitted properly on some of my treatments, make sure it fits snug and there are noI gaps at the top. Make sure u can feel the cap all round yr head before they turn it on. If it means spending another 5 mins making sure its fit right, then do it. Good luck huni x hope treatment goes well Jen x",
      "MessageIndex": 2,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49690/cold-cap",
      "Title": "cold cap???"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "Hi x I am also experiencing all the same side effects as u x u say u have more side effects can I ask what they are ? I feel dizzy all the time and just don't feel myself x x x",
      "MessageIndex": 4,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57383/tamoxifin",
      "Title": "Tamoxifin"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "Hi xx I did not think too much if my breast care nurse x I did not feel supported by her at all x x x I live in Bexleyheath in Kent Patricia, where abouts in Essex are u from x thank u for yr support and advice xxxx",
      "MessageIndex": 9,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57383/tamoxifin",
      "Title": "Tamoxifin"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "Hi Amanda and Patricia x It sounds like I have the same side effects as u Amanda x my heart palps are not too bad but they are there x my oncologist keeps telling me that my side effects are nothing to do with tamoxifen x however I disagree x I also get a pulsating feeling in my neck and I sometimes feel so exhausted that my whole body pulsates x It must have been very worrying for u having the pins and needles especially after having a stroke x I am now being referred to a neurologist as there were some abnormalities with my MRI x they want to rule out MS x I think I am just getting back on track and then this happens xx Take care xxxxxx",
      "MessageIndex": 7,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57383/tamoxifin",
      "Title": "Tamoxifin"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "HI Sharon, I have so many other side effects from Tamoxifen, like dizziness and feeling spaced out all the time, I am hpoing to get this drug changed to another one if possible. I felt fine before I started taking this tablet.Jen x",
      "MessageIndex": 3,
      "PostDate": "15/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50767/tamoxifen-and-pain-in-the-neck",
      "Title": "TAMOXIFEN AND PAIN IN THE NECK"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "Hi,I am post chemo and radiotherapy and now on Tamoxifen for 5 years, a month after starting I started getting a gland / pain in my neck and jaw and wondered if anyone else has been experiencing this ? Jennyxxxx",
      "MessageIndex": 0,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50767/tamoxifen-and-pain-in-the-neck",
      "Title": "TAMOXIFEN AND PAIN IN THE NECK"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "HI all, I was diagnosed May 11, I had lumpetomy and Node clearance, 3 nodes out of 15 infected. I had 3 FEC and 3 Taxotere, finishing end of Oct 11, then 26 sessions of radiotherapy which finished 31 Dec 11.I am now suffering with a sore swollen breast and shoulder. I have recently had a mammogram which was all clear, just wondered if anyone else has suffered like this ???",
      "MessageIndex": 0,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50211/sore-breast-after-treatment",
      "Title": "Sore Breast after treatment"
    },
    {
      "AuthorID": "jenny_mills",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jenny_5f00_mills",
      "Content": "What problem did yr mum have ?? Jen x",
      "MessageIndex": 3,
      "PostDate": "21/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47322/worried-about-back-ache",
      "Title": "Worried about back ache"
    }
  ]
}