{
  "AuthorID": "jessie21",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jessie21",
  "Posts": [
    {
      "AuthorID": "jessie21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jessie21",
      "Content": "Hi all, So had my mastectomy 13 days ago now and had my appt with my consultant today.  He gave me the results back.  I am Grade 3..tumour size 24mm...margins none...nodes all clear.  I do need chemo though as he explained that Grade 3 is agressive and spreads quickly.  I immediately googled it (which was a bad thing!) and burst into tears at seeing the stats!  My MRI just concentrated on my breasts rather than my whole body and it has went from 'contained' to 'we don't know'  I noticed that people have put up on here what stage they are at.  Should my consultant not have told me that too?  I have went from bring so positive to thinking I will be dead before I am 50 (I am 41 now) I have my appt with the chemo department tomorrow (21st) to discuss the treatment...they might send me for a CT scan..and again I am convinced it has spread.  I am completwely overwhelmed with all these thoughts and unable to sleep. ",
      "MessageIndex": 0,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84669/pathology-report",
      "Title": "Pathology report"
    },
    {
      "AuthorID": "jessie21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jessie21",
      "Content": "Thank you all for every word you wrote.  I came away from my appt walking on air.  He said that I am Triple Negative and that I wouldnt need a CT scan because, in his words, they are positive that I am 'cured' They offered my chemo just to mop up anything and I agreed.  He said that although I don't need it, they wanted to make sure.  Am I right in getting treatment?  And I couldn't get over the word he used 'cured'  No-one is cured of cancer, they are in remission..not cured.  He didnt explain what type of cancer but referred to the word 'tumour' rather than 'tumours' - which I had assumed there were 2 of them in the same area of the breast.  I just want to thank you all again for your kind words and I am grateful to you all.  My thoughts are very much with you xx",
      "MessageIndex": 4,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84669/pathology-report",
      "Title": "Pathology report"
    },
    {
      "AuthorID": "jessie21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jessie21",
      "Content": "I would love some advice.  I found a lump 4 weeks ago and was referred to the Breast Clinic.  I was poked and prodded several times.  I had an ultrasound which showed two lumps so a Core Biospy was taken.  The consultant then took me into a side room and delivered the news that both lumps showed cancer cells.  I was told by the woman doing the core biospy that those results wouldn't be known that day. The consultant went straight from the cells discussion to handing me info about surgery and said what did I think about it.  I wasnt told what stage I was at, bascially I have spent the past week feeling abandoned, confused and afraid after what I assume was a diagnosis.  They are sending me for an MRI scan this week. Who actually tells me that full results?  Is it the consultant I spoke to, is it my own GP?  Are they supposed to give you more information at the time of diagnosis?  I really don't understand the whole situation.",
      "MessageIndex": 0,
      "PostDate": "24/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83309/confused-need-help",
      "Title": "Confused, need help"
    },
    {
      "AuthorID": "jessie21",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jessie21",
      "Content": "I am 41, no breast cancer in my family and diagnosed on 18th Sept.  I was exactly like you and in complete shock because I thought it was a cyst.  I thought I was too young and no history.  It is ok to feel everything that you are.  I sat down with two girls last week who have been through breast cancer and I came away with a positive outlook.  Sometimes it helps to do that.  All I know is that my surgery is next week and I am getting chemo.  The future is unknown to me, just like you but  I refuse to let this define me, I refuse to let this take over my life and get me down. You have a lot of inner strength so gather that up and face every single day with a smile.  This is a good place to express yourself and a lot of the people on here will advise you on the different stages.  You are not alone in this, we are all here for you.  xxx  ",
      "MessageIndex": 1,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83643/just-been-diagnosed-with-breast-cancer",
      "Title": "Just been diagnosed with breast cancer"
    }
  ]
}