{
  "AuthorID": "jhazel",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jhazel",
  "Posts": [{
    "AuthorID": "jhazel",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jhazel",
    "Content": "Hi J-A. Of all areas of my life since breast cancer diagnosis, work has been the most sensitive I felt with.  It was also its impact (i.e. chemo brain)  I feared the most in the beginning as I could not bear the idea of being incompetent after all the active treatment (I work in IT).  My employer, boss and colleagues have been extremely supportive, accommodating my reduced work hours, remote location and unpredictable availability since my return 2 months ago.  Despite all that, I have been offended by any remark (and even act of kindness) no matter how encouraging it sounded to someone normal (I refer as someone who hasn't got and has never experienced cancer).  Noone could win with me. I was paranoid in every aspect of work and pushed myself hard to prove to others and myself I was still capable as before and nothing has changed.   It was only because our Health & Safety manager (a former Oncology nurse) firmly advised me to cut down my hours and focus on \"me\", that I eased a bit.  I've come to realise that some side effects are cumulative and no matter how hard I tried, I am currently on reduced capacity (foggy brain and fatigue in the afternoons). I am naturally a positive person and very trusting.  Obviously this ordeal has changed a side of me and I couldn't figure out why - is it the chemo, surgery, or simply a natural reaction to such a challenging situation?  Like you, I feared the irreversible side effects. Google became a friend for a short time. However, with some reflection, I realised I was only stressing myself out.  Every cancer patient goes through his/her unique journey.    With limited energy, it was up to me to decide what truly matters for as long as I live.  And I chose to dismiss everything that brought me down.  Like a learned skill, I got better with it over time. I take one day at a time and have pretty much convinced myself that if there are long term side effects that will affect the job that I love, that I have the skills and the attitude to change careers or even lifestyle in the future. I am now 5 out of 6 cycles of TH-FEC treatment after a mastectomy.  I was well informed by the medical team on potential short and long term side effects (print out from the Macmillan website).  I stopped obsessing about side effects (I still keep a log for each cycle to share with my Oncologist at every meeting) and I'm currently reading books and articles on Survivorship that serve as inspiration for mentally and emotionally preparing me for the possibilities of the future.  My medical team (including the community nurses) are well aware of my concerns in the future, etc.  Whether they empathise or despair listening to me over and over, I don't care because they are my sounding board :-) Sorry for the long post, but I thought by sharing what I'm going through might give you an insight on how some people deal with the same situation.  If I were to give an advice, it is to allow yourself with any emotion you feel - it is valid, but don't dwell on it too much to a point it stresses you.  Try to stay focused on getting well (and remaining well, i.e. finding the treatment manageable).  I also think it is important to trust your medical / health support team.  Together, you and them will help you go through this.  Go well with your treatment and take care.",
    "MessageIndex": 5,
    "PostDate": "22/03/2017",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125438/work-place-and-insensitive-comments",
    "Title": "Work place and insensitive comments"
  }]
}