{
  "AuthorID": "jmc1002",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jmc1002",
  "Posts": [{
    "AuthorID": "jmc1002",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jmc1002",
    "Content": "Before I had surgery for breast cancer I was really active. It has taken me a while to get back to the level of fitness that I had before surgery but one of the things that helped my recovery was cycling. As such, earlier this year I qualified as a British Cycling Ride Leader as part of the Breeze Network. This a network of qualified volunteers who run free guided bike rides for women. I'd never heard of this network before so I thought I would share it as it's a really friendly way to get out on your bike and it caters for all abilities and bike types with rides of different lengths, speeds and in lots of different locations. One of the main reasons I wanted to qualify as a Ride Leader was to be able to run rides for women like me recovering from surgery or cancer treatment. My aim is to run gentle rides, riding at a relaxed pace with the emphasis on enjoying being out in the fresh air and enjoying the company of like minded people. There is almost always an opportunity for coffee and cake at some point along the way too! I'm based in the Bristol/North Somerset area and the next ride I'm running will be in Clevedon: www.letsride.co.uk/.../sunday-breeze-around-clevedon And another in Bristol: www.letsride.co.uk/.../breeze-from-bitton-to-bath-along-the-old-railway But volunteers with the Breeze network run rides all around the country which can be found on the website: www.letsride.co.uk/breeze",
    "MessageIndex": 0,
    "PostDate": "10/07/2017",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133415/cycling-to-help-recovery---british-cycling-breeze-network",
    "Title": "Cycling to Help Recovery - British Cycling Breeze Network"
  }]
}