{
  "AuthorID": "Jo500",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jo500",
  "Posts": [
    {
      "AuthorID": "Jo500",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jo500",
      "Content": "Hi Sascha, No you are not a whimp. I handled my cancer right up till I started RADS I was given a short gown with poppers across shoulders and down the front. I was given it to wear at the setting up appointment. But having a young man walk into the treatment room with a camera no introduction and pulled the gown down saying just taking some photos! I nearly died, some how I could handle a male GP or my oncologist but this young guy who could have been anyone, and what made me so angry with myself was I did not challenge him, before this nightmare started I would have had something to say but I have felt so robbed of my self confidence. Then I started treatment and was being treated by young guys laying with my arms above my head and having my gown pulled down made me feel so vunerable it was the indignity and whilst I have not had my breast removed my weight loss has reduced my breast to zero! I feel so unattractive, I put up with it for a week going home in bits breaking my heart. I spoke to my sister and she begged me to speak out, and I found the courage to do that and am so glad I did. I spoke to a female radiologist and asked if I could be treated by female staff only and if I could keep the breast which was not being treated covered. She said absoloutly and the following three weeks were so much better it was very tiring but the women in the department were brilliant and reassured me that they want to make a difficult time as easy as possible. Speak out Sascha whilst the staff may be very used to it they need reminding now and again that you are not used to it!  ",
      "MessageIndex": 16,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52248/is-rads-always-like-this",
      "Title": "Is RADS always like this?"
    },
    {
      "AuthorID": "Jo500",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jo500",
      "Content": "Hi Racheal, I would say do your research and discuss with your oncologist what is best for you. I just got given the tablets and started taking them with out question. ( my sister had them and no problems) I wish my note was more positive, I was prescribed Tamoxifen following my lumpectomy, I was diagnosed with early stage er + cancer and have some 4 weeks passed finished radiotherapy. I am post menopausal, and having had the worst time going through menopause some six years ago relented and took HRT I had four wonderful years with out symptoms! I am on my third packet of tamoxifen and have noted each packet is a different make, I searched the previous thread re fillers in tamoxifen and in fact whilst having my radio therapy I was particularly unwell one day and they called the Dr who suggested it could be a different brand of tamoxifen that was causing the issues however next day came down with flu so put that down to a bug! I currently have night sweats and hot flushes and the mood swings, I do not have nausea or aching joints but as one previous writer suggested night sweats and hot flushes can have a huge impact on your quality of life, they are on mine. I am seeing my oncologist on Thursday and plan to discuss whether tamoxifen is the right choice. I have read a couple of papers on Cancer reserch UK that suggests whilst it has been seen as the gold standard aromatase inhibitors are showing even better results and there is a school of thought that post menopause women should be offerred these as an alternative. My oncologist plan was originally to have me take tamoxifen for two years then move to an aromatose inhibitor. I suppose what I would like to know is would a different brand reduce the flushes and sweats, would I have the same side effects on the aromatase inhibitors. My other concern is the increased incidence of endometrial cancers blood clot and stroke these risks were not explained to me prior to my being given the tamoxifen. However the research on the alternative drugs show that the risk of osteoporosis increases. I am feeling very tired and would describe it as fatigue but is this the fact the night sweats mean I sleep for no more than three hours or the after effects of the radiotherapy or another side effect of the tamoxifen I cant say. I also would like to know if any one reading this has changed to aromatase inhibitors, and if as a result the side effects have been minimised. I know there are three it would be great to get some feed back on them. My sister also had breast cancer same as me however she was pre menopause she had 5 years on tamoxofin and no side effects however due to polyps in her womb she had a full hysterectomy after her mastectomy. She swore by evening primrose oil! I am now taking 1000mg a day but not working yet for me! I can also reccommend the chillo pillow for any one suffering night sweats its a little bit firm but I am getting used to it and it does provide wonderful relief. Also I have invested in cool sleeper PJs they wick away the moisture very quickly and have stopped the need for constant changes during the night. Hugs to all Jo",
      "MessageIndex": 3,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51970/has-anyone-had-any-possive-experiences-with-tamoxifen-am-due-to-start-taking-it-and-am-absolutely-petrified-the-thought-of-taking-that-drug-hsas-scare-me-more-than-the-cancer-itself-any-possitive-feedback-would-be-much-apprec",
      "Title": "has anyone had any possive experiences with Tamoxifen????? Am due..."
    }
  ]
}