{
  "AuthorID": "joanie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
  "Posts": [
    {
      "AuthorID": "Joanie Jelley",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
      "Content": "I am just finding my way around the site so I hope this message is heading in the right direction. I was diagnosed with primary cancer in the breast and secondary cancer in the bones and lungs in October 2011. I had been for my 3 yearly mammogram exam in May 11 but nothing was seen in the results.The cancer was only found when I discovered a lump on the site of a previous fibroadenoma scar. I have not had any surgery. I have had chemotherapy and a couple of sessions of radiotherapy. I am currently taking a hormone suppressant Exastemene and a bisphosphonate that is hopefully helping the bones. I had to come off Letrozole because I was having so much pain in my joints. Presently I am experiencing numbness and stiffness in my hands. Can anyone advise how they have dealt with simllar symptoms .Thanks for coming back to me",
      "MessageIndex": 0,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52444/secondary-cancers",
      "Title": "Secondary cancers"
    },
    {
      "AuthorID": "Joanie Jelley",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
      "Content": "Hi Beevergirl, I am sorry to hesr that you are experiencing side effects from the hormonal suppressant medication you are taking. I am post menopausal and was given the hormone suppressant Letrozole, which made every joint in my body ache and made me feel as if I was going down with flu all of the time. I discussed the problem with the Oncologist and BCN's and we agreed that I would continue taking the tablet for a few weeks to see if the side effects lessened. They didn't - so I ceased taking the tablets for a couple of weeks to just make sure it was the medication that was causing the problem. It was - so my oncologist started me on an alternative medication Exastemene - which has proved to be much better in terms of not getting aching joints and flu like symptoms. However another side effect has been carpal tunnel syndrome but that is also improving after a steroid injection and wearing a wrist support. I think we need to be active in our treatment and have found that the medical professionals have been open to this. I hope things improve for you Kind wishes Joanie",
      "MessageIndex": 0,
      "PostDate": "20/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53484/it-s-our-body",
      "Title": "It's our body"
    },
    {
      "AuthorID": "Joanie Jelley",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
      "Content": "Hi Lopseygoldwig Many years ago I was diagnosed with Fibroadenoma, which was removed. In 2011 I noticed a lump in the scarring site of the original operation, which turned out to be cancer, unfortunately which had spread to bones and lungs. Your email made me wonder if Fibroadenomas were a precursor to cancer, even though they are originally diagnosed as benign. It's a thought. I wish you well in your treatment Joanie",
      "MessageIndex": 1,
      "PostDate": "17/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54305/has-any-body-else-had-a-similiar-experience",
      "Title": "has any body else had a similiar experience"
    },
    {
      "AuthorID": "joanie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie",
      "Content": "Hey ladies, I too have tnbc. I was diagnosed in feb, surgery I'm march, started chemo I'm April. I have had my 5 of 6 chemo on Thursday past ,now tax feeling pretty sore today but hey it won't last for ever, shortly after no 6 chemo I start radiotherapy for 5 weeks, and like u all say we are on our own after that just hoping it never comes back😄personally I was devastated with the news at the beginning and thought I will never get through this, but I have to say I trust In God and my inner strength is showing better every day. I had to cancel a holiday this year due to this awful disease but I'm just about to book another one for my lovely husband turns 50 ( he has been a tower of strength )and I think we will both need a holiday after all this😎it's lovely to chat on this site with fellow people who no what it's like, I hope you feel better soon lots of love xx joanie",
      "MessageIndex": 10,
      "PostDate": "05/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79019/triple-negative",
      "Title": "Triple negative"
    },
    {
      "AuthorID": "joanie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie",
      "Content": "Well done I am Just starting radiotherapy I'm a few weeks last chemo next Thursday 😄 congrats And good luck X",
      "MessageIndex": 5,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79706/i-did-it",
      "Title": "I did it!!!"
    },
    {
      "AuthorID": "Joanie Jelley",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
      "Content": "Hi Annie 40 Denial is a defence mechanism which helps us deal with the stuff that life throws at us. I am all for denying stuff if it helps see me through. Best wishes Joanie",
      "MessageIndex": 0,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53392/denial",
      "Title": "Denial"
    },
    {
      "AuthorID": "Joanie Jelley",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
      "Content": "Hi ASB One down. How many more to go? When I had finished chemo CT scans showed that the mets in the lungs had improved and the mets in the bones had not got any worse, which I would consider reasonably successful. I go to a hospice nearby as a daycare patient on a weekly basis. I have counselling there, a range of therapies including acupuncture and reflexology, physio input and the chance to talk to people in a similar situation. I also had 'Toning' sessions which involved chanting, which I believe helped improve my lung capacity. The only problem is when I do it at home I wonder if the neighbours think I have gone loopy!! Anyway have a good rest and take care Joanie",
      "MessageIndex": 2,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53391/secondary-cancer",
      "Title": "Secondary Cancer"
    },
    {
      "AuthorID": "Joanie Jelley",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
      "Content": "Hi ASD Thank you for your kind words. I think I am quite proud of being an 'inspiration' to others. I hope your first chemo session goes well. Best wishes Joanie",
      "MessageIndex": 0,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53391/secondary-cancer",
      "Title": "Secondary Cancer"
    },
    {
      "AuthorID": "Joanie Jelley",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
      "Content": "Hi Sue, Thanks for your suggestion I will discuss it with my oncologist next week. Love Joanie",
      "MessageIndex": 0,
      "PostDate": "16/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52472/secondary-cancer",
      "Title": "secondary cancer"
    },
    {
      "AuthorID": "Joanie Jelley",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joanie-jelley",
      "Content": "Hi Annie I have breast cancer and mets in bones and lungs. There are so many issues and thoughts that are floating around for everybody. I wish I could help or advise you in all the ways you want to be helped/advised. All I feel fit for at the moment is to let you know that my thoughts are with you and everyone on this site. I gained sustenance from someone who responded to one of emails. It made me feel cared for even though they did not have the answers. Now what is the magic word that I can leave you with????? Love Joanie",
      "MessageIndex": 10,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55947/had-my-3rd-tax-and-blood-transfusion",
      "Title": "had my 3rd tax and blood transfusion"
    }
  ]
}