{
  "AuthorID": "John4703",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/john4703",
  "Posts": [
    {
      "AuthorID": "John4703",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/john4703",
      "Content": "As a husband I'll stick my head above the parapet and say that it can be hard having a wife who you love dealing with breast cancer. I do not think it is a reason to have an affair. I am not finding it easy to have my wife describing herself as ugly after a mastectomy, I tell her the truth, she is beautiful.  It is far from easy being the husband but that is not excuse for an affair.   Life is not easy but by sticking together we will win.  I am not sure if this is even relevant to this post but as a husband I want to make it clear that cancer is not a reason to stray.",
      "MessageIndex": 16,
      "PostDate": "28/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59155/unfaithful-husband",
      "Title": "Unfaithful husband"
    },
    {
      "AuthorID": "John4703",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/john4703",
      "Content": "I saw this a while ago and have been thinking about it a lot.  I've been married to a beautiful girl for nearly ten years, for the first nine years she had two boobs and looked beautiful, since 1 March 2013 she has only one boob (and no cancer) and she looks beautiful.  There are times when she feels low as she doubts her body image but in my opinion she is still as beautiful and still as sexy as the day we met.  Beauty is from inside and one boob, two boobs or no boobs does not matter, what matters is how we feel about each other.  What does surprise me is if I kiss her on the scar where her breast was removed it still gives her the same feeling of pleasure so never feel that a mastectomy reduces your beauty or your appeal, you are as beautiful and desirable and wonderful as you were before the surgery.",
      "MessageIndex": 27,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69415/i-can-t-cope-anymore",
      "Title": "I can't cope anymore"
    }
  ]
}