{
  "AuthorID": "johnoconnor",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/johnoconnor",
  "Posts": [
    {
      "AuthorID": "johnoconnor",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/johnoconnor",
      "Content": "Hi Ladies Sorry you find yourself here, my cancer is Prostate, related and treatment  and drugs are similar to BC, but mine is inoperable - spread to the lymph system., Do not want to intrude on your privacy but maybe put a guys slant on BC ?  OK here goes, does depend on age I suppose, breasts are a sign of sexuality, but does become exaggerated, as we get a little more mature they become less of a focus.. If  you do need breast surgery and maybe reconstruction then make it the decision you want - not what you think us guys want. True Beauty come from within not  just a physical attribute. If you feel incomplete without the surgery - then please go for it and good luck, but when you are loved - its you that are loved not just your body. Do what you feel good with. - Sorry on my soap box again Hugs Guys xxx John",
      "MessageIndex": 3,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47439/shocked-by-change-of-diagnosis",
      "Title": "shocked by change of diagnosis"
    },
    {
      "AuthorID": "johnoconnor",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/johnoconnor",
      "Content": "Sorry Maybe I made the wrong emphasis, I have inoperable PC. my hormone treatment means I am chemically castrated, you know like sex offenders, the only message I was sending is do what you feel good with not because you think a guy wants it - but because its what you want - I will withdraw from the group and sorryif I offended anyone xx John xx",
      "MessageIndex": 5,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47439/shocked-by-change-of-diagnosis",
      "Title": "shocked by change of diagnosis"
    }
  ]
}