{
  "AuthorID": "joho",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joho",
  "Posts": [
    {
      "AuthorID": "joho",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joho",
      "Content": "Hi Gitte, I am a year on from you - finished all my treatment by Christmas 2009. I have had reconstruction - both sides - last year . I completely understand how you feel - I get told how amazing I have been etc etc and isn't it great now things are back to normal. I have days when I just want to be left alone and spend time trying to get my head round what I have been through and how I find a 'new normal'. It's very hard to explain that feeling to anyone who hasn't been through something so big. Also, I think because I have been so positive (and still am!), people around me sometimes don't realise how hard it is to achieve that (at times). Does this make any sense to you?  Take care Jo x",
      "MessageIndex": 1,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36819/post-cancer",
      "Title": "post cancer"
    },
    {
      "AuthorID": "joho",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joho",
      "Content": "Hi Suzy I had a bilateral back flap op done about 10 weeks ago and things really settled down after the eight week mark. I did have some back pain - not as bad as yours sounds! I have found the best thing to ease back pain and the muscle tightness is swimming. I started with a couple of lengths - very weird the first time - and now (three weeks later) and happily swimming twenty lengths. This seems to stretch the muscles nicely and then they relax. Days I don't swim are definitely less comfortable than the days I do!  Hope you feel better soon! Jo x",
      "MessageIndex": 1,
      "PostDate": "16/12/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33985/from-back-flap-to-back-pain",
      "Title": "From Back Flap to Back Pain!"
    },
    {
      "AuthorID": "joho",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joho",
      "Content": "Hi My choice was both boobs off - I just wanted rid of the breast tissue. I have had that surgery and the reconstruction now. I would do it all again if I had to. The upside is - no mammograms and fabulous pert new boobs! I had my big operation last October and am so happy with the results and with the sense of relief having had it brings to me.  To balance that, my friend was offered a mastectomy at the same time as me - she had four positive lymph nodes as well (I had 2). She refused the mastecomy and went for lumpectomy and more radical radiotherapy. She is also fine and happy with her decision! Hope this helps! Jo x",
      "MessageIndex": 3,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36808/mastectomy-v-breast-conservation---discus",
      "Title": "mastectomy v breast conservation - discus"
    },
    {
      "AuthorID": "joho",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joho",
      "Content": "Hi Janet, I'm glad that I have been of help - reconstruction's a big decision to make - especially quite close to your diagnosis/treatment.  My sister was like you - just needed to have surgery but we both elected to have the prophylactic mastectomy for exactly the reasons you outline. I had no mention of funding being a problem - reconstruction is considered part of the package here. The only thing I had to 'prove' was that I was properly understanding the risk of keeping my breast and that I wasn't being over reactive!  I had genetic screening done prior to my reconstruction and no genetic link was found between myself and my sister - it made no difference to the treatment I was able to have. My sister also had no problem with the question of funding.  The feeling of constant worry is a heavy weight to carry - my GP told me to refuse to leave the consultant's office until I had the answers I wanted!! (Didn't have to resort to that, thankfully). I think you would have a really strong case for surgery and you may be anticipating a battle that you won't need to fight.  Are you able to request a consultation with a surgeon to talk things over? Let me know what you think/decide! All the best. Jo",
      "MessageIndex": 12,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33030/bi-lateral-mastectomy-with-diep-reconstruction",
      "Title": "bi lateral mastectomy with diep reconstruction"
    },
    {
      "AuthorID": "joho",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joho",
      "Content": "Hi, I live in Berkshire and I have just had reconstruction. I had right side mastectomy a year ago - had chemo, then surgery and then radiotherapy. I elected to have a risk reducing right side mastectomy with bi lateral reconstruction - done six weeks ago. I chose the latissimus dorsi operation and am really pleased with the results - all the scarring contained within my bra and the new boobs looking fabulous. The recovery is OK - first week was a bit grim but morphine makes it easily bearable! I chose this operation because of the scarring being contained,  I didn't want micro-surgery and the surgeon at my hospital has a fantastic reputation (well deserved!). My sister had the deip flap bi lateral op about two years ago. Her recovery was good - very similar in time scale to mine but her scarring is much more extensive. The look of her new boobs is good and they feel natural. She had her op in Salisbury.  My best thing I can tell you is that the emotional effect of reconstruction is huge - the combination of relief having got rid of breast tissue combined with feeling pretty close to normal again is massive. I had a year with only one boob - yuk!! My sister felt the same - the restorative nature of the operation can't be under-estimated. I think you have to have a lot of confidence in your surgeon - I asked loads of people - hospital staff and other patients - about mine - he lived up to his excellent reputation! I am now six weeks past my operation and am driving again, a bit sore but completely manageable and am the happiest I have been seen the day I was diagnosed! Hope this helps. Jo    ",
      "MessageIndex": 5,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33030/bi-lateral-mastectomy-with-diep-reconstruction",
      "Title": "bi lateral mastectomy with diep reconstruction"
    },
    {
      "AuthorID": "joho",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/joho",
      "Content": "Hi, My time scales between diagnosis etc were as follows: Diagnosed on 29th April 2009, started hormone therapy (zoladex) on 12th May, chemo on 22nd May. I had my last chemo cycle on 5th September and then had my mastectomy 4 weeks later. I then had radiotherapy - 12 doses - three times a week for a month - finished on Christmas Eve. My reconstruction was almost a year to the day of my first mastectomy but I started the process of discussing it with my surgeon in May this year. I was actually able to choose the date of my operation to fit in with my work which really helped (I'm a Head teacher and it takes some planning to hand your school to someone else!) The first mastectomy was a pretty painless procedure from a physical point of view - a bit tougher emotionally as you have to get used to how you look. It helped that I had seen my sister through all this before I joined the club! I knew what boobs without nipples looked like, what a mastectomy looked like.  My first operation - I was out of bed within a couple of hours - only needed paracetamol for pain relief and was home within 48 hours.  My decision for bi lateral breast removal was for risk reduction. I wanted to avoid the horrendous wait for test results, mammograms etc.  Gosh - I'm really waffling on! Feel free to ask me anything - if I lived near you, I'd happily show you my new boobs! I flash them fairly freely to anyone who is interested - so pleased with them! My surgeon told me not to flash them until they are finished as they are still a work in progress!! Jo x",
      "MessageIndex": 8,
      "PostDate": "13/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33030/bi-lateral-mastectomy-with-diep-reconstruction",
      "Title": "bi lateral mastectomy with diep reconstruction"
    }
  ]
}