{
  "AuthorID": "Jools",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
  "Posts": [
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Hi I have sent you a private message. Welcome to the site - I am sure we will be able to support you through this worrying time. Take care Jools",
      "MessageIndex": 1,
      "PostDate": "21/03/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10888/secondary-breast-cancer",
      "Title": "Secondary Breast Cancer"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "I went for genetic testing in the summer last year. Before ANY tests are done you sit with a trained genetic counsellor and discuss everything in detail - only after this do they decide whether you are suitable for genetic testing. I was then sent away with the blood forms and the test tubes and was told to ask the chemo nurses to draw off extra blood before my next chemo - if I wanted to go ahead (I also had to sign consent forms). I could have decided not to be tested after my chat but as I have 2 daughters I wanted to be tested so that they NEVER have to go through what I have (and other family members) Best wishes, Jools x",
      "MessageIndex": 1,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10858/genetic-testing",
      "Title": "Genetic Testing?"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Oh dear - this must be a great shock Kate - especially when you have known this person for so long. I suppose it just highlights that everyone deals with this disease in there own way. Some people have tight knit families who manage to cope themselves and dont want anyone else to be there. Although it is their choice - it doesnt allow for others feelings does it. Also some people when they are ill do not want to be seen (especially if they are deteriorating - gone bald from treatment etc). When I was first diagnosed I didnt want everyone to know and told people gradually when I felt able to hold a conversation without crying - but via the 'grapevine' I expect most people knew. I found having cancer made me feel vulnerable. If your friend has been diagnosed and lost his life relatively quickly maybe the family felt unable to deal with outsiders. I suppose that is thier own choice. I hope you get a chance to visit his grave, leave flowers and a special message. I am sure he knew how much you regarded him. Best wishes, Jools xxxxx",
      "MessageIndex": 1,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10848/an-appeal-to-families",
      "Title": "An appeal to families"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "I also know of many people whos liver mets have responded to chemo - myself included. I met one lady in my chemo unit who had her multiple liver mets shrunk to microscopic specks. It can also stabalise a tumour and slow its growth. Why dont you ring the nurse helpline for further info - free phone 0808 800 1234. Also my first chemo didnt affect my Liver mets and they were not responding - they switched to another type of chemo and I have had good results - so if one doesnt work there are others they can offer. Best wishes, Jools",
      "MessageIndex": 2,
      "PostDate": "07/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10857/question-about-efficacy-of-chemo-treatments-on-secondary-cancer-in-liver",
      "Title": "Question about efficacy of chemo treatments on secondary cancer in..."
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Hi there sorry to here that you friend is in this situation. I cannot recommend anything ................EXCEPT........ Being there for her........listening to her............hoovering and dusting................putting out the wheely bins...................taking her shopping/getting her shopping..................hugs.............and endless understanding. Up for the challenge? There are so many things that are contra-indicated when having treatments its best to check with the oncologist before taking anything - even vitamins! So be a friend by being there for her, it will mean more than words can say. Best wishes to you both, Jools x",
      "MessageIndex": 1,
      "PostDate": "05/10/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10783/best-friend-starting-chemo-this-week",
      "Title": "Best Friend starting chemo this week"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Hi I used the cold cap and it worked for me - hair thinned a lot but always had a good covering - none of my friends/relatives/neighbours ever guessed I was having chemo. I have a friend on this site: Denning - and she had FEC and T and used the scalp cooler - again her hair thinned but she didnt lose it all - and that was with the changable caps not the special machine which I had - so I say GO FOR IT - if you can save your hair it is worth it. I timed the pain with the cooler - it hurts for precisely 8 minutes - after that you go numb and can't feel anything - I thought it was really worth it even though I spent a long day on the chemo unit because of the cooler. First time round (2003) I lost all of my hair and was never offered the scalp cooler - and it affected me deeply - others arent so bothered - I was very pleased with the results with the scalp cooler second time around - I say give it a go. By the way - you do lose some hair while using the scalp cooler - mainly the thinner hairs - but dont be put off/worried by that - I used to panic when I saw the amount of hair I was losing - but Denning kept telling me to keep on with it - and she was right ! Good luck whatever you decide, Jools xx",
      "MessageIndex": 4,
      "PostDate": "27/07/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10978/hair-loss-cold-cap-and-fec-t",
      "Title": "Hair loss/cold cap and FEC-T"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Welcome to the site, I have been through all of the above so here goes (my experience not everyone's): Chemo began about 6 weeks after surgery once I had had the all clear from the surgeon. Radiotherapy started about 6 weeks after the chemo - it allows the liver to recover from processing the toxins. You will get full pay then half pay and if that runs out incapacity benefit. The helpline here is staffed by qualified nurses who can also advise on these queries (freephone 0808 800 1234) - give them a try too. Best wishes hope all goes ok for you. PS dont be afraid to tell them when you have improtant dates (ie daughters birthdays) things can be moved / appts changed if you ask. :o)",
      "MessageIndex": 2,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10844/practical-advice---timings-how-long-is-a-piece-of-string",
      "Title": "Practical advice - timings...how long is a piece of string?"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Thats the rollercoaster syndrome !!- its so unreal isnt it - keep plodding on Love - you can and will get through all of this - just take it one stage at a time and keep comming here to share your concerns etc. You are among friends here and we truly understand because weve all been there one way or another. Thank goodness you found this site - wish I had had it 5 years ago!! Lots of love Jools x x",
      "MessageIndex": 3,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10814/what-questions-do-i-ask",
      "Title": "What Questions Do I Ask?"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Ask how many cycles you will be having, which chemo drugs he/she wants you to have and why he/she thinks this is the best chemo for you, ask if the chemo will make you lose your hair - if it will - ask if you can use a scalp cooler (so you dont lose your hair) , ask if you will be an in patient or an outpatient, what the side effects are likely to be - and write down the answers or get someone to go with you to write them down. (I know once I heard the words chemotherapy I went into lalalalalala mode) But honestly - the drugs they give alongside your chemo mean that most of the side effects can be minimised. After chemo you have to drink plenty of fluids to flush the chemo out and to prevent constipation which the anti emetics (anti sickness) tablets can give you. And take your anti sickness meds on the dot when they are due - if you leave it and wait until your sickness returns they dont work as well. If you are sick ring up the chemo unit and ask for stronger anti sickness meds. Chemo builds up in the body so generally the first couple of cycles arent too bad - but then they effects can be a bit more bothersome tiredness etc. But some people sail through and you have no reason to believe that you wont be one of those. Good luck - you CAN do it! Best wishes, Jools x x",
      "MessageIndex": 1,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10814/what-questions-do-i-ask",
      "Title": "What Questions Do I Ask?"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Yes I used the scalp cooler. I was on paclitaxol chemo - had 3 cycles and it worked for me. I like you wasnt sure - but tried it anyway. In 2003 I wasnt offered scalp cooling but this time round (2008) I kinda insisted. After three cycles they stopped my chemo but I never lost all my hair and still had a good covering. Each time at the two week point I would lose loads of hair and i thought the next time i would lose it all. There are 2 photos on my profile, in the white and blue shirt it is before chemo - in the photos 'Jools and Kate' - it is after three treatments so you can see before and after (I am in white top). Tips: make sure you wet your hair thoroughly before applying the scalp cooler if you go to the loo - check it has been re-connected properly so you dont 'defrost' treat your hair gently - dont blow dry it on high heat - no straighteners it is agony when the cooler first goes on - trust me I timed it - after 8 minutes you are totally numb and it doesnt hurt after then Give it a go - I said 'even if i end up losing all my hair it will be a few weeks less when i dont have to wear a wig or bandana'! Ignore the strange looks you get whilst wearing the scalp cooler - it is worth it Check out my blogs by clicking on my photo! Also see my pics!! Best wishes, good luck, Jools x",
      "MessageIndex": 2,
      "PostDate": "10/10/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10786/new-kid-on-the-block-anyone-out-there-can-give-me-guidance-on-the-scalp-cooling-treatment",
      "Title": "new kid on the block.........anyone out there can give me guidance..."
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "I had a six week gap between the end of chemo and the start of RT for BC in 2003 - this time (this week) I had a 5 week gap (Im getting more RT oh goody) - I think it is to allow your body to recover and your Liver to process and breakdown the chemo stored in there (it can only process it at a certain speed). If there were a shorter gap I think the skin problems could be greater as chemo makes your skin more sensitive and Rt gives 'sunburn' . Depending on how many RTs you get will depend on your tiredness levels - it is possible for some people to work through RT but if you decide to do this maybe try for a shorter working day and/or a shorter working week so you can manage - I know I kept feeling myself dropping to sleep all over the place yet some people manage fine (I had 5 weeks of RT though). In any case, whatever you decide - congratulations on comming through a long slog on chemo - and may your next stage be uneventful and short :o) Love Jools xxx P.S. There is a certain range of products which worked for me keeping my skin in good nick - the radiographers were impressed with my lack of skin reaction - can't advertise on here but feel free to PM me if you wish. J x",
      "MessageIndex": 1,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10875/chemotherapy-and-radiotherapy",
      "Title": "chemotherapy and radiotherapy"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Yay Carol - final chemo is a big milestone - congratulations on completing such a gruelling treatment course! You should be proud that you stuck it out to the end. Hope the side effects arent too bad and that you look after yourself properly. In my experience radiotherapy is a doddle compared to chemo...but that is only my own experience. You will be feeling better and better - just in time for the summer! Im so jealous! Best wishes love Jools x x x",
      "MessageIndex": 27,
      "PostDate": "03/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10730/sorry-to-be-such-a-misery",
      "Title": "sorry to be such a misery"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "I am glad you have your results and clear scans - I think this is a question that you need to ask the cancerback up nurses Avie or your MAcmillan nurse who can go through the report stage by stage with you. Its so confusing isnt it? You have all this information and its meaningless! I am sure everything will become clear when you get someone qualified to explain. Very best wishes, Jools x By the way - just because your lymph nodes tested positive does not mean that your cancer will spread.",
      "MessageIndex": 1,
      "PostDate": "08/12/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10818/results",
      "Title": "Results !!!!!"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Hi JANE-ANN - I dont remember any difference in the nipple however i did get (and still have) numbness as you describe in my arm - the numbness may be due to your surgery as sometimes they damage a nerve during surgery - this is common and should have been described to you as a possible complication i believe? I can also remember it felt like someone had inserted a sausauge in my armpit which was just swelling beneath the surgery site and that did get better over time but made it hard to put my arm down by myside. I think you should speak to your Macmillan Nurse for reassurance they seem to have a knack for making you feel better! Good luck with everything and take care.... Jools",
      "MessageIndex": 1,
      "PostDate": "21/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10728/post-op-problems",
      "Title": "Post op problems"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Well done you - cant get better news than that ! All the best, Jools x",
      "MessageIndex": 18,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10896/long-wait---is-there-anything-or-any-way-to-speed-it-up",
      "Title": "long wait - is there anything or any way to speed it up"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "When I was first referred by my GP it was to the 'low risk' breast clinic - even so the appointment was only 2 weeks - I actually was asked to return the following day to the 'high risk' breast clinic to get my results. Im glad the GP is trying to hurry things up. I am sure you would have grounds for a complaint if you dont get an earlier appointment. In the meantime try to stay calm - you dont know that you do have cancer and you may well be told it is nothing - so don't dwell on the negative if you can help it. In the meantime ring up the helpline here and speak to a nurse mon - fri 9 - 4 freephone 0808 800 1234 - and you will find a listening ear. I am sure loads more people will respond offering support too. Let us know how you get on - best wishes, Jools xx",
      "MessageIndex": 2,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10896/long-wait---is-there-anything-or-any-way-to-speed-it-up",
      "Title": "long wait - is there anything or any way to speed it up"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "HI just wanted to say I have found using my summer weight quilt all year round also helps reduce the number of hot flushes I get - I use a bedthrow aswell if I get too cold. Best wishes, Jools x",
      "MessageIndex": 6,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10836/warm-moments",
      "Title": "\"warm moments\""
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Welcome to whatnow - there are many patients on here who are living with the knowledge that they are not curable - its not a good place to be. You will get support here of a different kind from that of your family/friends - because we understand/have been there etc. I have sent you a Private Message (PM) also. Take care and keep responding to your replies on here :o) Love and hugs Jools xxxx",
      "MessageIndex": 1,
      "PostDate": "22/01/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10846/another-new-one",
      "Title": "Another new one"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Hiya Treeze. Welcome to the site I hope that you find it a source of comfort. All I can say is Im sorry to hear about your cancer and I feel for you. It is the hardest thing to face chemo because it is so emotional and also the thought of losing your hair. I am currently using the scalp cooler during my chemo and so far so good (just finished cycle 2). As for scans - waiting for results is the hardest time - extremely stressful - if you are anything like me once you know what you are dealing with you will feel more in control - dont suffer in silence - contact your Macmillan nurse or ring up the cancerbackup helpline who will help to shore you up in the lead up to results. Please feel free to send me a private message if you want to Im always around. Also think about popping in and saying hello in the chatrooms - try earlier in the day at first as its quieter then - or later in the evening. Anyway we have all been affected in some way by cancer and come here to get support and share feelings - AND to cheer ourselves up - so if you go into the chatroom and find Tarzan and Snow White were just being silly! We trully understand what the trials and tribulations of having cancer is about so dont hesitate to share with us. Best wishes , love Jools x x x x x",
      "MessageIndex": 1,
      "PostDate": "14/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10748/had-all-surgery-now-chemo-starts-so-scared",
      "Title": "had all surgery now chemo starts so scared"
    },
    {
      "AuthorID": "Jools",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jools",
      "Content": "Its such a lot for you to deal with isnt it. I find your oncologist's attitude a litle blase actually. I think you should definately have the hormone therapy and consider some chemo. That way if there are any stray cells they should be zapped before doing any further damage. I agree with your GP - get a second opinion and insist on having as much preventative treatment as posible - did they not offer Radiotherapy either? I am stunned. Try not to worry too much just now - have fun over xmas and resolve to be gettting that second opinion and some treatment in January. In the Nice guidelines you are entitled to all of the above treatment - stand you ground! Also why not chat to the nurse helpline here for further sound advice 0808 8001234 (free) Best wishes and a huge HUG from me, Jools x x x",
      "MessageIndex": 1,
      "PostDate": "20/12/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10825/double-mastectomy-difficult-decision-re-further-treatment-or-not",
      "Title": "Double mastectomy, difficult decision re:further treatment or not"
    }
  ]
}