{
  "AuthorID": "JudeColc",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judecolc",
  "Posts": [
    {
      "AuthorID": "JudeColc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judecolc",
      "Content": "Not sure how the friend thing works but will have a look.  I have started several things today and not finished them! Got the hoover out but then had acid reflux and now struggling a bit with indigestion.  I think you are right - need to take it easy and leave everything strenuous for a few weeks. I am going to The Christie Hospital and feel very safe there as soon as I walk through the doors.  Everyone seems to know what they are doing and that gives me confidence and security I guess. We're not far from you - we are in Cheshire, but my Oncologists works out of The Christie so we have about an hours journey, which I am actually getting used to now. Going to check out the friends link.",
      "MessageIndex": 5,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "JudeColc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judecolc",
      "Content": "Hi Gillie Thanks for responding so quickly.  Can I add you as a friend so we can compare symptoms?! I had chemotherapy 7 years ago but things have changes a lot since then. Last time I suffered from fatigue and nausea, however they did manage to treat the nausea after the first few treatments but the fatigue did seem to build up over the course of the 6 sessions - I am told things may be different this time with new medications etc. I don't feel too bad today, a little tired but I had a restless night and have, like you, just taken Emend. I do feel slightly confused (again that I think is a side effect I have read about!) about all the various drugs etc but as you say, I am trying to use natural remedies to try to minimise the side effects (fruit toast, figs and green tea for breakfast). I dont have any Dexamethasone tablets but I seem to recall they put it in the drip yesterday, along with an anti-sickness too. Which hospital are you being treated at? I guess they all do things slightly differently. Keep in touch. Jude x",
      "MessageIndex": 3,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "JudeColc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judecolc",
      "Content": "Hi everyone, Just wondering if there is anyone out there on the same Chemo as me?  I had my first treatment yesterday which went well, but Ive been reading the anti-sickness drugs, which say they cause constipation (amongst other things)!  Does anyone know if it is ok to take something like Fibrogel or Dulcoease as these all have warnings on them about taking with other drugs!.... confused.",
      "MessageIndex": 0,
      "PostDate": "10/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "JudeColc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judecolc",
      "Content": "Hi Cathy Thank you so much for taking the time to do this.  I am waiting to hear if I need to have chemo but had it 7 years ago and didn't have the option of Cold  Cap so lost all my hair - is it a relatively new treatment and how long do you actually have to have it on? Judith",
      "MessageIndex": 1,
      "PostDate": "06/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63258/cold-cap-experience",
      "Title": "Cold Cap Experience"
    },
    {
      "AuthorID": "JudeColc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judecolc",
      "Content": "Hi, My Doc told me to try Daktarin oral gel (miconazole) and it worked for me.  Maybe ask your doctor or pharmacist first, but you can get it without prescription.  Not heard of pineapple before, but it would probably be preferable if it works for you. All the best Judith",
      "MessageIndex": 7,
      "PostDate": "30/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62941/mouth-problems",
      "Title": "Mouth problems"
    },
    {
      "AuthorID": "JudeColc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judecolc",
      "Content": "Hi Jane Ive just read your post from June and wondered how you were getting on now.  I had my first chemo 6 days ago and am feeling exactly as you describe.  I was wondering if iron-rich food may help as I wondered if it may be something to do with decreased red blood cells?",
      "MessageIndex": 5,
      "PostDate": "14/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51092/day-6-after-1st-fec-chemo---still-feel-lightheaded",
      "Title": "Day 6 after 1st FEC Chemo - still feel lightheaded"
    },
    {
      "AuthorID": "JudeColc",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judecolc",
      "Content": "I too had the neulasta injection at Thr Christie. I never had severe pain, just flu like aches in my neck and back. I guess everyone is different but it certainly didn't last more than a day or two. Is your Onc. Dr Burt?",
      "MessageIndex": 1,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70314/pain-following-neulasta-injection",
      "Title": "Pain following Neulasta injection"
    }
  ]
}