{
  "AuthorID": "Judy123",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
  "Posts": [
    {
      "AuthorID": "Judy123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
      "Content": "Hi Ansi, You are a breath of fresh air and it's so nice to laugh once in a while. I'm going through hell and back with the side effects of letrozole. Went to work with my daughter yesterday, a change from looking at my grubby four walls, and ended up crying my eyes out to the receptionist!! I'm used to crying in private when no-ones around but yesterday came as a bolt out of the blue. I thought my health problems were isolated, as so many on here are back to work now and getting on with life. A year after mammogram, diep flap and reconstructive surgery, not forgetting chemo has left me, like yourself with osteopenia in my spine, damaged discs in my back, arthritis in my knees and hands and constant pain in my stomach due to the diep flap. The dizzy spells, hot flushes and blurred vision is an added bonus on top of the outbursts, crying and feeling isolated. I can only drive a few miles now, so am reliant on help for anything else. Nevertheless, I have to attend an assessment tomorrow for Employment and Support Allowance to decide if i am able to go to work. HAHAHA!  Are they for real? Was given Amtripiltine to take as an anti-depressant but don't want to take it. Perhaps I should. Trying taking letrozole on a night time instead of the day, to see if that makes a difference. Take care Judy     ",
      "MessageIndex": 2,
      "PostDate": "04/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51285/letrozole-and-the-blues",
      "Title": "Letrozole and the blues!"
    },
    {
      "AuthorID": "Judy123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
      "Content": "Hi Brenda, I,m in the same position as you. My chemo finished end of october. Have had bone scan, which was clear and osteoporosis scan, which showed osteoporosis from the hips down in my spine.Had an ultra sound in my left breast, which showed a duct causing infection but not caused by cancer. Not having a mammagram til May, so don't think i will know if the cancer has gone til then, which is frustrating! My hair is growing back grey! Help! Need to sort out what to do about work now, don't want to go back working nights and weekends, but will anyone take me on with my medical history now? Can anyone give me advise there? All the best for your celebrations this year. Looks like a busy one!",
      "MessageIndex": 2,
      "PostDate": "13/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45995/end-of-treatment",
      "Title": "end of treatment"
    },
    {
      "AuthorID": "Judy123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
      "Content": "Hi Fiona, I had a mastectomy and reconstruction in May11 and a biopsy on my other breast in April 11, the stitches healed fine on the reconstruction, but the stitches in the biopsy turned into an abscess and a huge hole in my good b reast!It took 2+ months of daily dressing to heal, leaving a large scar which is slowly fading.I have recently had a further operation to tidy up dog ears on my stomach and creating a nipple to reconstruction. Just the tattoo left to do now.Moisturising helps but I concentrate on recovering from removing the cancer which they hopefully have! A few scars after all doesn't matter that much if we're still here.",
      "MessageIndex": 3,
      "PostDate": "23/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46369/any-suggestions-please",
      "Title": "Any suggestions Please!"
    },
    {
      "AuthorID": "Judy123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
      "Content": "Hi, I've published a book called Living for a Reason - A true cancer journey. It is my own personal journey through breast cancer and shares procedures, hurdles, and emotions.  I've written it as a novel with memories back to when I was thirteen and growing up. Please read it and hopefully it will help you through your journey. Mine began in April 2011 with a Diep flap reconstruction followed by chemotherapy. Macmillan has purchased twenty five books from my publisher for reviews. Take care and take things day by day xx J A Prescott (Judy)",
      "MessageIndex": 5,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112670/books-you-recommend",
      "Title": "Books you recommend"
    },
    {
      "AuthorID": "Judy123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
      "Content": "Enter your message...HI Carol, I had a mastectomy on right breast and DIEP flap in May 2011. It was a 12 hour operation and I spent a week in hospital in the High Dependency Ward due to ensuring the blood vessels had nitted together and had not rejected. By day 5 all drains had been removed, along with the hair dryer to keep my new reconstruction warm!! I was up sitting in the chair and washing myself by day 3. The corset you have to wear for 6 weeks afterwards was the killer though, especially when you feel you want to be sick, which I did due to a migraine after operation. 12 months on I don't regret the decision. I am struggling with walking and tend to stoop a lot because of pain, but I do have damaged discs in my back and osteopenia in my spine, as well as arthritis in my knees and hands. I've been receiving physio lately in the local hospital which is helping, but have been told it takes time!! My reconstruction is fabulous and last week I had a nipple tattoo which looks so real. I have no visible scars and can wear any clothing, low cut tops and swimming costumes. My plastic surgeon did say it would take about 18months for the DIEP flap to heal completely. On the downside, I've had to finish work as I am unable to do my duties due to tiredness, unable to drive too far because of flap and back problems and the Letrozole tablets i am taking, which are causing dizzy spells, hot flashes and blurred vision. Not taking them is not an option though, if it stops the cancer returning. My mammogram a few weeks ago was clear, I'm in remission whiich is good news. Physically the body will take time, but the cancer is gone. Hope this helps. Judy  ",
      "MessageIndex": 5,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50955/diep-flap-and-lymph-node-removal-recovery",
      "Title": "DIEP flap and Lymph node Removal Recovery"
    },
    {
      "AuthorID": "Judy123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
      "Content": "Hi, My moods are deplorable at the moment. I'm shouting and ranting at everyone around me, family and friends. I can't seem to help myself. I was diagnosed with breast cancer in April 2011, and had my fifth mammogram last week. I should be celebrating a final clear result! Instead, my husband is awaiting results on tests indicating lung cancer. He's had an ebus bronchoscopy and having a pet scan tomorrow. X-ray and ct scan showed a largish ( the size of a golf ball) mass on his left lung. Consultants are treating it as lung cancer unless the tests show differently. He's 63 and we were planning his retirement at 65, monthly holidays abroad etc. The results won't be available until the 6th June due to the bank holiday Monday, and results are only given in the hospital on a Monday. My mind has gone into overdrive, and I know now how my family and friends felt on hearing my diagnosis. I'm fearing the worst and trying to be strong for him at the same time, but it's turned me into something horrific, a moaning cranky person I don't recognise. Could do with some advise, locking myself in the house alone until then seems the only way at present. Judy",
      "MessageIndex": 0,
      "PostDate": "26/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109622/help-i-m-turning-into-someone-i-don-t-know",
      "Title": "HELP! I'm turning into someone I don't know."
    },
    {
      "AuthorID": "Judy123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
      "Content": "Hi everyone, I was diagnosed with stage 3, grade 3 breast cancer in 2011. I had a 12cm growth under my right nipple, which I hadn't detected. A routine mammogram screening picked it up, I'm sure I wouldn't be here today without it. I've written a novel about my life since breast cancer (and highlights of my life beforehand). Things have changed considerably and I've described my treatment throughout my journey, the anxiety, physical changes, and coping with side-effects from the medication. Family dilemmas along the way, and dealing with every day life. Hopefully it will help others who have to travel the same route. My book is called Living for a Reason - A true cancer journey and is available to pre-order from Amazon. It is out on the 31st March. Author J A Prescott (I am Ann in the novel, my middle name). Please feel free to read my experience, one I will never forget. Judy  ",
      "MessageIndex": 0,
      "PostDate": "14/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106632/living-for-a-reason",
      "Title": "Living for a reason"
    },
    {
      "AuthorID": "Judy123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judy123",
      "Content": "Thank you dreamthief, I did try to copy the book cover myself with my iPad, but it didn't work. There are times it will copy and paste and others when it won't play ball at all. I hope my book helps others going through breast cancer. Judy",
      "MessageIndex": 2,
      "PostDate": "15/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106632/living-for-a-reason",
      "Title": "Living for a reason"
    }
  ]
}