{
  "AuthorID": "Judyr58",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
  "Posts": [
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I had my last of 8 chemo cycles on 23 May and felt just like you! I had a good response to the chemo meaning I could avoid mastectomy and we were talking about breast conservation. I was told I may lose my nipple because it seemed my residual cancer was attached - and needed a chuck taken so would be lopsided but was given options of reconstruction or therapeutic mammoplasty. I elected for the latter as I'm a slim 59 and the bane of my life has been my 32H boobs which have now given in to gravity! Basically therapeutic mammoplasty is a breast reduction (with a lift thrown in!) so while removing the cancer area they took more to achieve a size I wanted (hard to choose - I went for somewhere between D and E - obviously they can't guarantee!) My surgeon would not do both breasts as she said after all the chemo I had had (all high dose Abraxane and Cychlophosphamide which she said is about the toughest they can throw at us) my body would struggle with such a long op, and the risk of infection (higher because of the chemo) would double. The op on 4 July went well - some chemo side effects eg lot of bleeding during op so I had to have a drain, and lot of sickness after so had to stay in 3 days ( but then I've always been a sicky sort which was why they threw every anti sickness thing at me during chemo!) but pain was so much less than I expected and manageable with co codamol.  I had a slight blip with some surface infection covering about an inch of scar but soon sorted. I am absolutely delighted with the result - a very perky, non droopy 20 year old looking boob! She also saved my nipple and reattached. I was amazed that the joins are just sort of butted up together (like wallpaper joins if you get what I mean) and honestly look as if I had the op months ago, so very neat. Even after only 4 days when the dressings came off to remove the drain I couldn't believe how neat and good it was - lot of colourful bruising, but the shape and joins were brilliant. Also all 3 lymph nodes clear and clear margins (helped by the fact I have 370gms removed I guess!). The pathology also showed that the chemo had blasted my grade 3 (3,3,3) aggressive cancer to oblivion and the residual was grade 2 which my oncologist is absolutely thrilled with! Can't wait to get the other done, but she wants to wait 6 months post radiotherapy, so seeing her at the end of Jan with a potential April date). I can even get an underwired bra on with my comfie insert inside for when I go out - and am going for a silicon prosthetic fitting. So all in all it was an absolute breeze compared with the chemo - and great to think that I have got rid of the cancer inside me. I asked lots of questions and also took advantage of a session with my breast care nurse to prepare me for the surgery and afterwards which was offered - about an hour and a half - as well as a folder of info to take away, and my comfie insert to take with me. Ask about what surgery options are available and why they are recommending whatever way forward for you. Ask for a session with your breast care nurse. If you need to think about it, do so. Hope this helps - sorry, bit of a ramble, but wanted you to see that this next stage is the good one.",
      "MessageIndex": 6,
      "PostDate": "10/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113145/moving-from-chemo-to-surgery-august-sept-2016---join-me-here",
      "Title": "Moving from Chemo to Surgery August / Sept 2016 - join me here"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hello - I'm new to this site. I was diagnosed a couple of weeks ago - initial comments were stage3, aggressive but unclear about the margin, not happy with lymph nodes (even though the initial biopsy was clear), not happy with the volume of calcium and wanted more biopsies and MRI. I go back this afternoon to find out all the results and and way forward - and what options I may or may not have. I'm looking forward to at least getting out of this limbo land - but scared of what the future holds! I am lucky to have an incredibly supportive family and friends - but it still feels very lonely. On a different note - for the past week or so I have had a weird sickly sweet, slightly musty sort of smell, which I can taste as well - no one else can smell anything which amazes me as it is so strong. Has anyone else experienced anything like this - or am I just weird?!",
      "MessageIndex": 0,
      "PostDate": "12/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101173/smells-and-tastes",
      "Title": "Smells and tastes"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Well if you are weird so am I! I've just completed my final cyc of 8 T&C. I'm a tea-a-holic but in the first week of each cycle couldn't bear a cup of tea anywhere near me as the smell (even across the room!) made me feel sick! Really heightened sense of smell with all sorts of things - and would walk in and out of places just because of a smell no one else could smell. Again in first week particularly, some foods i couldn't touch just because of the smell. By third week I was pretty much back to normal. The weirdest thing I've experienced is now and again I have a sort of sickly/musty/sweet smell that, again, no one else can smell - even though it's almost overwhelming to me.  It actually started just before I was diagnosed so it's not chemo related. It isn't all the time and I can't find a pattern to it. I've often wondered if cancer smells - so fascinated about the animal experiences! best of luck xx",
      "MessageIndex": 13,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110353/weird-sense-of-smell",
      "Title": "Weird sense of smell ?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I didn't quite get the answers I had hoped - I thought that I was going to get a way forward after the second set of biopsies and the MRI. The good news is that the lymph nodes are clear and the lump is just within the parameters for a lumpectomy rather than needing a mastectomy as they originally thought. The less clear part is that there are abnormal cells about 3cm away from the lump which they cannot be clear about as to whether they are cancerous cells from the biopsies to date. So I was offered a choice of either a mastectomy or further biopsies. I asked whether the risks were minimised of any return of cancer to the breast if I opted for a mastectomy, rather than going for the lumpectomy (if the cells are ok) and was surprised that they said it would make no difference? On this basis I have elected for further biopsies - 3rd lot now - which they said are more complex and specialised and are only done on a Friday due to the set up. So it will be next FrIday hopefully if they have space - then another wait to see the surgeon. Seemed sensible to do this if there is the possibility of a lumpectomy if it proves clear. I am still confused at the fact that risks are not minimised by electing for a mastectomy as there is so much talk of preventative mastectomies. Can you shed any light on this please - as would want to consider this if I have any choice? thank you",
      "MessageIndex": 4,
      "PostDate": "15/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101173/smells-and-tastes",
      "Title": "Smells and tastes"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Or CAT scan!",
      "MessageIndex": 16,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110353/weird-sense-of-smell",
      "Title": "Weird sense of smell ?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you Jazmine ",
      "MessageIndex": 2,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101173/smells-and-tastes",
      "Title": "Smells and tastes"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Crystaljuju Thank you so much for your reply - this now makes perfect sense in terms of primary and secondary BC re preventative Mx. I have to admit to being still in the \"startled rabbit in the headlights\" stage! I have limited the reading and research I have done to date as I wanted to be clear what my situation was first - preferring to then focus my research. I hadn't quite expected to be facing my third lot of biopsies and third meeting to discuss the way forward before I had a plan. You have very helpfully confirmed my gut instinct to go with the WLE if that option is available - I'm pleased they are leaving no stone unturned and testing further to get optimum information. thanks again Judy                ",
      "MessageIndex": 6,
      "PostDate": "15/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101173/smells-and-tastes",
      "Title": "Smells and tastes"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Yes! I was told to have it - I had mine just before chemo.....they actually asked me if I'd had a flu jab when I started as if I hadn't I should ask for one!",
      "MessageIndex": 4,
      "PostDate": "14/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114834/flu-jab-and-chemo",
      "Title": "Flu jab and chemo"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi George Dreamthief I've had one bad migraine since finishing chemo - 2 days in bed as I get vertigo as well as the sort that means dark room and keep still! I woke up with it so hadn't been able to take the naratriptan as it must have hit in the night. I used to have them regular as clockwork which my husband had worked out - even had them on the diary! Also taking less naratriptan as not getting the visual warnings so often (my vision goes sort of pixilated so everyone looks like someone off crimewatch where they pixilated out the face!) I'm in a fingers crossed place that hopes somehow my hormones have taken a battering for the better On the hair front I was in both camps a bit. The only time I welled up was when I was told I would lose my hair....cancer diagnosis never really rattled me a great deal. I really do think that the thought of it and the process of losing it is the worst part. The (unproven I know) risk of brain metastases was the decider for me - my aunt had BC but died of brain metasteses. If Prof Poole thinks there may be a risk that's good enough for me - and losing my hair weighed against everything else was how I looked at it.  It was a risk/benefit assessment rather than I wasn't arsed!",
      "MessageIndex": 5,
      "PostDate": "21/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115218/migraine-ladies",
      "Title": "Migraine ladies"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Paula I suffer from migraines - my worst was being locked into one for over 6 months and my nervous system starting to collapse including vertigo, speech loss etc. Mine also seemed to be cyclical and definitely hormone related. I didn't opt for the cold cap - didn't fancy the added length of time, the extreme discomfort, the odds of it working - and my oncologist really didn't like them and felt that, although not yet proven, there were possible links to secondary brain metasteses. He is an internationally renowned Professor and has been pioneering in this field and his opinion was good enough for me. (Given that my treatment has been incredible and clearly there has been no expense spared in the level of care I have received, I do not believe the cost factor was an issue here if I had pushed). So I can't help you with this part of your question - but the thought of something that might induce headaches was also a factor for me. I was also worried about triggering migraines during chemo (8 x3 weekly cycles of TC - straight to taxotere as I've a slight heart problem so FE was out). Interestingly I didn't have a single one in 6 months which is a record for me. So in my case the chemo definitely didn't trigger anything - and in a bizarre way seemed to put them on hold. I finished chemo at the end of May (surgery 4 July and waiting to start RT) - and only had one since then, and none since starting Tamoxifen. I occasionally took naratriptan during chemo if I had any migraine indicators (I get visual indicators and if I take the naratriptan this has usually stopped the migraine developing). My oncologist was happy about this medication. I lost all my hair in the second week of the first cycle - it's not nice, and once it had really come out in huge handfuls my husband shaved it off for me which made the final part easier as it wasn't so visible. Once it was shaved off it was easier - and I found lots of lovely stylish headwear (didn't like wearing my wig at all) and adapted pretty quickly. I think the thought of losing my hair was actually more horrifying than the reality as I believe it is for most of us.  Hope this helps and good luck",
      "MessageIndex": 1,
      "PostDate": "21/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115218/migraine-ladies",
      "Title": "Migraine ladies"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you",
      "MessageIndex": 3,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179110/advice-about-mastectomy",
      "Title": "Advice about mastectomy"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I had therapeutic mammoplasty last time - just heard that I can’t have immediate reconstruction as they need to preserve the skin. As they’ve already done skin preservation and it’s recurred, and also latest cancer area is attached to the skin it has to be removed. It’s a blow as it would have made it easier to bear. Looking like reconstruction may be a long way off if at all. Seems like their thinking is it may have spread so I’m really hoping now that the scan results are clear! good luck for Monday!",
      "MessageIndex": 4,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179110/advice-about-mastectomy",
      "Title": "Advice about mastectomy"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I have a little niggle at the back of my mind and wonder whether anyone can make it go away! I had 8 cycles chemo pre surgery, then opted for therapeutic mammoplasty as even though the chemo was successful and I avoided a mastectomy, it was still going to remove enough to cause me to look lop sided. I only had one breast \"done\" as my surgeon said it would be too long an op for both after all the chemo and the risk of infection would also double with both done at the same time - again a chemo thing. In addition she said the radiotherapy might affect the shape and she would be able to do a better matching job afterwards - all good. Told I would have radiotherapy about 6 weeks after surgery. Surgery went well, clear margins and clear 3 lymph nodes. The surgery looked amazing. In hospital longer than anticipated as more chemo after effects meant I was very sick and blood sugar levels went crazy as well as having bled more than usual during the surgery. It is now 3.5 months post surgery - more chemo after effects have meant my wounds have been problematic. Basically it seems my body has got confused and thinks the stitches are attacking me! I've been back weekly since 4 July to have things monitored and dress wounds. All stitches now dug out and I'm finally dressing free and hopefully can start radiotherapy in another week or so if all dried up. So - sorry this is long winded - three questions: 1. My main niggle is - is there any risk with such a long delay re radiotherapy - by the time I start it will be 4 months+ post surgery. They say not to worry - but initially it was no worry if it's 8 rather than 6 weeks, then no worry if it's 8/10 weeks etc. so I've just got myself a little nervous. 2. Also in a lot of pain - really bad breath taking stabbing pains. Told it is a sign that the healing process is in force and the pain is nerve endings knitting together - which makes sense. Just added to my niggle above is preying on my mind. 3. I get unbelievably exhausted - wake up tired too. Energy levels at an all time low. Finished chemo on 23.May and thought I would feel much better than this by now. Hopefully I will be inundated by responses that the long delay is not a problem! Must admit it will be good to get started now and finish treatment - just hit 1 year anniversary of diagnosis. Next surgery in April feels different as I don't see it as treatment - cosmetic to balance me up! Thanks",
      "MessageIndex": 0,
      "PostDate": "23/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116951/delay-in-radiotherapy",
      "Title": "Delay in radiotherapy"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I’m reeling at the moment and would like advice on what questions I need to ask. I was originally diagnosed with invasive ductal breast cancer in Oct 2015 - Grade 3 aggressive and fast growing 8.5cmx6.5cm. I had 8 cycles of chemo, which shrunk it and went for the option of therapeutic mammoplasty in July 2016, followed by radiotherapy. I had another op on the other breast in July 2017 to remove ADH cells and reduce to match my other breast. More cosmetic surgery in July 2018. I found a lump in the original in Dec 2019. Everything pointed to fat necrosis - nothing on mammogram or ultrasound that suggested cancer, the biopsy was inconclusive but didn’t show anything cancerous. I had an excision biopsy in Feb 2019 as due to my history to be on the safe side. Saw surgeon for the results on Monday - he said my original cancer had returned (didn’t know the grade) and I had to have a mastectomy as I couldn’t have radiotherapy to that area again. He said we could talk about reconstruction “when the dust had settled”. He has requested CT and bone scans to check for any spread. Op to be within 4 weeks after scan results in. I really didn’t see it coming as they had kept saying nothing to worry about. I realise now that I have a shed load of uncertainty (as well as all the other emotions!). The cancer is ER+ve as it was last time - I’ve been on tamoxifen for the 2.5 years between original surgery and finding the lump......just been told to stop taking it ready for surgery. I am ringing the breast care nurse this morning to ask to meet with someone - my questions so far are: exactly why do I need a mastectomy? what is actually there that needs removing now? is there another option - ie monitoring and/or other treatment?  what are the risks if I don’t have a mastectomy? What mastectomy options are available eg reconstruction at the time of mastectomy and why this hasn’t been discussed/offered; if not possible what type of reconstruction is likely to be the best option for me and in what timeframe? My question is are there other questions I need to be asking as my brain is a bit in freefall - I really hadn’t expected to be in this position again, and certainly not so soon. Any advice is greatly appreciated, thank you Judy",
      "MessageIndex": 0,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179110/advice-about-mastectomy",
      "Title": "Advice about mastectomy"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "So sorry to hear this - pets become so much an important part of our family, and I'm guessing yours was a great support to you as it is well proven that cuddling and stroking pets is a great healer xx",
      "MessageIndex": 5,
      "PostDate": "30/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108581/what-is-it-with-cancer",
      "Title": "What is it with cancer?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thanks for the reassurance mistymoley - that's what I thought but the mind plays such silly tricks......",
      "MessageIndex": 2,
      "PostDate": "23/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116951/delay-in-radiotherapy",
      "Title": "Delay in radiotherapy"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "The totally with you! I was diagnosed in October and we had diving trips booked in February and April which had to be cancelled - and I had all sorts of stuff in my diary. I have to say though that our insurers sorted quickly and easily, and two spa days postponed indefinitely for me (even though both were time limited) and a couple of cake decorating classes did the same (where cancellations were actually non refundable) as well as two other people offering me free ones having refunded my money.......restores your faith in human nature. My husband and I both decided to take early retirement as soon as we could (both in the fortunate position of final salary pension schemes) after we were 50. I retired 6 years ago when 52. We did this \"as you never know what's round the corner\" and we wanted to pack lots into life while we were fit and healthy enough to enjoy it. I took up scuba diving (my husband was already qualified) and have packed the last 6 years with travelling, diving, hobbies I didn't have time for while working and all sorts of voluntary stuff.  I fully intend to pick things up again next year. Just had my last of 8 pretty gruelling TC neo adjuvant chemo cycles for Grade 3 4.5cm - shrunk to half! Therapeutic mammoplasty op to remove cancer on 20 June, then radiotherapy, with op on other breast at least 6 months later (my surgeon won't do both together as after all that chemo she thinks my body won't be up to the long op plus double risk of infection when immune system not great). Hoping to get some diving in before the second op which I can choose when to have. Best of luck with your treatment and hope you will be in a booking frenzy in no time xx",
      "MessageIndex": 4,
      "PostDate": "02/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109881/cancelling-holidays-is-the-pits",
      "Title": "Cancelling Holidays is the Pits."
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Hannah Yes - it's hard slowing down and giving things up - I love my busy life mainly as its full of things I love doing! Managed to keep doing quite a lot but have had to learn to seriously cut down and pace myself. I've had the same idiotic response with spas! It's so frustrating but I managed to get it sorted and have been for facials and massage while having chemo. At first I pointed out to them that my oncology centre actually offer complementary therapy free of charge as they see it as therapeutic and helpful so couldn't see what their problem was. I also told them that I had been hospitalised at one point during my treatment and that the oncology unit had their own complementary therapist (a volunteer) who offered aromatherapy, massage, reiki, reflexology etc. Even the fact that I regularly see an aromatherapist for massage, reiki and reflexology didn't work! Eventually they agreed that if I got a letter from my GP they would allow me to come.......felt like being at school and needing a letter from my Mum! Had another exchange then as I didn't think my GP would be in a position to comment as he is not an oncologist and has no idea of my regime (and I begrudged that I would have to pay!). Finally they agreed to accept a letter from my BC nurse who I explained was a specialist in both oncology and my care and part of the team looking after me. The letter reads -  \"There are no medical reasons why Judy cannot attend a spa day on....and enjoy any treatments you have on offer. We promote complementary therapies within our department for people on and off treatment and see their value in terms of aiding relaxation and improvising individual's wellbeing.\" Love the tone that has a slightly \"up yours\" feel to it! This has done the trick and I'm pleased to report that I have attended a couple of spa days without anything dropping off, having seizures on the massage table, passing some deadly cancer virus to the therapists through my skin or frightening the other guests (other than a few double takes at my bald head, but that's totally understandable!). I hope any of the above arguments might do the trick or you can get a letter from your BC nurse. Perseverance seemed to do the trick......I think I even mentioned the words discriminating against cancer victims at one point which seemed to freak them! Very evilly I started to actually enjoy the email exchange I was having with them! Good luck - and hope you get to enjoy that spa day soon. Judy xx",
      "MessageIndex": 10,
      "PostDate": "03/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109881/cancelling-holidays-is-the-pits",
      "Title": "Cancelling Holidays is the Pits."
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "This sounds an awful situation and you have every right to feel confused and upset. Don't be afraid to say you want to see someone else - consultants are not Gods and feel confident to challenge. My first consultant was difficult understand, totally lacking in emotional intelligence and just did not listen to me. In the end I told him that I was not prepared to continue with the consultation and walked out. I was shaking when I got out and upset. The nurse and my husband followed me out and confirmed it was not me! It ended up with the nurse booking me an appointment with a different consultant who was superb! Don't be afraid to by assertive - it's your body and your life and you are entitled to respect and best advice. Best of luck xx",
      "MessageIndex": 3,
      "PostDate": "12/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105165/confused-after-unhelpful-consultant-appointment",
      "Title": "Confused after unhelpful consultant appointment"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I finished chemo at the end of May before surgery in July - still waiting to start radiotherapy as my wounds are not healing well due to the chemo. I have peripheral neuropathy in my left hand and my toes - right hand is now ok. The pain in my toes started after I had finished chemo and became so bad I couldn't bear shoes on. It was really bad if I was out and walking. My oncologist said that in terms of numbness and tingling there is no solution (other than it might eventually correct itself - if still there after 12 months I looks like we are stuck with it). In terms of pain relief he told me that normal pain killers won't touch it as it is nerve pain. I have been taking gabapentin (300mg x 3 times a day which is a relatively low dose) and this keeps my toe pain under control. If I have been on my feet and walking a lot it does still get a bit worse, but just about manageable - I'm loath to increase the dose.",
      "MessageIndex": 4,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116537/sore-feet-peripheral-neuropathy",
      "Title": "Sore Feet/ peripheral neuropathy"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Whereabouts are you based? I am in Coventry but UHCW doesn't have the Dexa scanner so had to go to Rugby. My oncologist referred me and I had an appointment through within 2 weeks. Not sure if Rugby would be accessible for you or if you could elect to go there. Definitely speak to your bcn - maybe they react better to an oncologist requesting it rather than a GP? Good luck",
      "MessageIndex": 5,
      "PostDate": "25/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117039/dexa-scan",
      "Title": "Dexa scan"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I am ER+ve, HER-ve also. I had chemo pre surgery (Grade 3 aggressive, 6cm) and started tamoxifen 3 weeks after surgery (therapeutic mammoplasty on 4 July). I'm still waiting to start radiotherapy due to problems with wounds healing (down to chemo confusing everything!) - but looks like might start in a couple of weeks. I'm told tamoxifen for 10 years - maybe letrazole after 5 years, but had results from bone density scan that all my bones are fairly thin and on cusp of osteoporosis so this will be monitored and reviewed. Taking alendronic acid and vit D and calcium. I haven't had a cyst post surgery - but did have one during chemo and had it aspirated. My breast had felt hot and for the first time was sore,  and I had a high temperature so was taken in for a few days and treated for an infection, they also scanned my breast as a precaution and found the cyst. Hope all goes well with the scan ",
      "MessageIndex": 1,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116673/er-positive-her2-neg-treatment-after-chemo",
      "Title": "ER positive, HER2 Neg. Treatment after Chemo"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Jess Thank you for your response - I was going to make contact and share the heartfelt responses that I have had to my discussion. I think you will agree that emotions are clearly running high on this one and it is really good that you are taking this forward to your fundraising team. I must admit this campaign seems very at odds with the care, compassion, sensitivity and support from Macmillan nurses and the rest of the support information etc. on the website. I'm sure we will all be interested in the response to this - bearing in mind we are only the people on the breast cancer community site - I'm sure our feelings will not be in isolation of other types of cancer experiencing chemo.",
      "MessageIndex": 15,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hello Fiona (jammyfiona) I'm glad it's not just me either! Looks like a lot of people feel this way. It will be interesting to see what the response from the fundraisers is.",
      "MessageIndex": 18,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Wendy - Bubbleblower I know what you mean. Hopefully this thread may show the fundraisers and awareness raisers that they have a ready made community happy to help if they want to use us for consultation!",
      "MessageIndex": 19,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hello again GrandmaStar - glad you got the same positive response I did and happy my words helped you! The long to short and hair donation I don't have a problem with and makes more sense. I'm like you, I have outwardly come to terms with hair loss - you have to don't you - but there are the odd days when I wish I looked like the real me again. I also took a lot of care over my appearance - I now have a huge selection of headwear for every occasion! Big hugs - we will be there again",
      "MessageIndex": 107,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Jediknight So glad to hear life is good - despite the hot flush! Looking forward to those visits to the hairdresser again one day too! I'm really hoping after the second response from the fund raising team that this sort of horribly insensitive campaign will be the last - and I guess the memory of how this feels will never leave any of us who are or have been going through it.  I've learned to \"rock the look\" as a student recently referred to my baldness (accessorised by my new trademark dangly earrings). I'm a trustee at Warwick Uni. But if I'm really honest there are days when I wake up and look in the mirror and hate what I see before the eyeliner and eyebrows go on and stop me looking like Voldemort. Keep well.",
      "MessageIndex": 119,
      "PostDate": "16/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Fi It's so horrid when you lose your hair and how you lose it - I don't think any of us found it easy. I lost mine 6 months ago and am a lot easier about it now - you will hopefully feel more comfortable in time. Glad you aren't suffering too many side effects. Totally agree with all you have said as well! Big hugs and thank you for sharing your thoughts.",
      "MessageIndex": 9,
      "PostDate": "26/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Totally agree Grogg - and love the idea of practical and useful things to raise money.",
      "MessageIndex": 17,
      "PostDate": "27/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Haha Jediknight!",
      "MessageIndex": 31,
      "PostDate": "29/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "That sounds like an excellent way forward Silverglades! I'm struggling to get anywhere with Cancer Voices at the moment - a very helpful person pointed me in the right direction though. The website says to click on a registration form - but it isn't a form! I have now updated my profile, as directed, to show I am interested in joining. As far as I can tell I have to wait until there is a volunteer opportunity to join. I have set alerts to daily to make sure I don't miss it if it comes up! In the meantime it has flagged up a fascinating volunteer opportunity to present to employers/HR people - and I meet the brief. So as long as I am well enough in the timeframe we will see - registered my interest anyway. Hope you are keeping as well as you can - and keep cheerful!",
      "MessageIndex": 172,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "You are so right about the irrelevant facts Lynn - they totally missed the point!",
      "MessageIndex": 55,
      "PostDate": "01/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi there GrandmaStar You sound like you are doing a great job adapting to this horrid hair loss ordeal. I can honestly say that the process of losing it was the worst - once it was actually all gone it became easier, and I do hope you are nearly there! And I share your anger about the campaign - and even more so after the response we received from the campaigns team which was so patronising (and as someone said, very like a politicians totally irrelevant response!) - and did not in any way acknowledge any of the stories or comments that were made by people. I doubt we will get the campaign stopped - I just wanted them to focus on more imaginative, fun ways to raise money which would not cause the very people who rely on Macmillan for support so much distress. It is sad that they don't even acknowledge this. I hope you get on with a wig - personally have never actually worn mine as it feels heavy, uncomfortable and it's just not my hair. I've spent a small fortune in a range of lovely headwear - and more recently when it's warm gone without as so much cooler!",
      "MessageIndex": 58,
      "PostDate": "02/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Dobcross and LookItsMeg I think you have mistaken where I was coming from. My main reason for starting this thread was to see if others felt that this is a very insensitive campaign run by Macmillan - not sure if either of you have actually experienced losing your hair through chemo personally. It's the juxtaposition of this campaign with the purpose of Macmillan which is to understand and support people with cancer. Lots of people who have had chemo and lost their hair - a horrid experience in terms of how it happens, and not just your head, your eyebrows, eyelashes, body hair - not just shaved, but shiny bald, and it doesn't grow back straight away. Mine is just starting to grow back since losing it last December. The whole thing makes you feel you are being stripped of your femininity and identity. My issue was about an advert showing happy laughing people having their heads shaved in a party atmosphere - when this happens from chemo I haven't come across anyone who felt like this!  It's not the people doing it - it's the campaign that is the issue mainly for me. Similarly I don't have the same feelings about other charities who promote this approach - their reason for existing is not the same as that of Macmillan. So please don't judge me for feeling like I do - as I don't judge you for doing this - although I really wish people would do something much more fun to raise money! My plea to Macmillan is to drop or modify this campaign in the future and encourage other ways to raise money. If people want to donate to Macmillan they will, whatever people decide to do to raise money. Personally I would have hated my daughters doing this for me. I and my daughter have raised nearly £6000 between us in other ways.",
      "MessageIndex": 219,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Good on you barbaral !! I've done the same - didn't get lambasted so must have hit a nicer crowd! Also got a lot of likes and supportive comments - as well as people understanding and sparked off some funny suggestions of other fund raising ideas. With any luck Macmillan fund raisers might put efforts into different campaign ideas in future when this one has run its course......I will always live in hope!",
      "MessageIndex": 108,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thanks Jess - much happier with this response thank you! If I can be of an help with the research I am more than happy to speak to someone or be contacted. If you want my email address or phone number just let me know. Again thank you for ensuring our voice was heard.",
      "MessageIndex": 111,
      "PostDate": "15/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "This is a tough one for you! I was the one who started this thread as I find the brave the shave campaign insensitive having lost my hair (eyebrows, eyelashes etc) during 6 months of chemo. I was more upset about all the happy smiling faces and hilarity in the adverts as I found the process of losing hair through chemo very cruel - and when my husband and daughter shaved my head after two particularly awful days none of us was smiling! I think many of us find the word \"brave\" rather over the top too! That said - Macmillan do an amazing job and I have found other ways to fundraise and contribute. My main message to them is to encourage these other ways and advertise these and let go the brave the shave one as it stands in a juxtaposition to the aim of Macmillan to support patients through their cancer. So - your question!  I think you have 4 options I can think of - recently used no.4 myself! 1. Stay silent and don't contribute 2. Say you already contribute and support Macmillan in other ways so won't additionally with this one 3. Say you know a lot of chemo patients who have lost their hair have a difficult time with this campaign so don't feel you can support it 4. Say you know a lot of chemo patients who have lost their hair have a difficult time with this campaign so while you don't feel you can support your colleague and Macmillan through this way in recognition and support of this strong feeing - you will be supporting Macmillan through other ways as you value their work highly. Just some thoughts for you - hope they help - in the end go with your gut and feel comfortable with it x",
      "MessageIndex": 122,
      "PostDate": "28/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Jen72 I feel your pain - and it must have been so hard holding it together for  your children when your head was shaved, I cried like a baby! I had 8 chemo cycles of Abraxane and Cychlophosphamide. I kept my eyebrows and eyelashes until cycle 5 then they abandoned me and I felt very hurt as thought they were showing excellent solidarity with me til then! Have had my first op on 4 July - elected for therapeutic mammoplasty as quite a large area still to go and as I'm a 32H preferred a reduction rather than reconstruction. Happy to report all 3 lymph nodes clear and clear margins - the great news which my oncologist is really proud of is that I was grade 3 fast growing aggressive (3,3,3) and the residual cancer removed was grade 2 (which he described as lazily slow) so the chemo had done an excellent job in addition to shrinkage - and bodes well for the future. My last chemo was 23 May and my eyebrows are back, I have little stubby eyelashes and about 2mm of hair on my head - not much at the sides though. You can still see my scalp but it feels so nice not to be that shiny bald look anymore! It's soft and feels like velvet - my granddaughters love stroking it! Must admit so do I! Waiting to start 4 weeks radiotherapy now. Then second op to give me a matching pair around next April......have to say I'm in love with my pert 2O year old looking new boob My husband says he doesn't care if it doesn't grow anymore than this as he thinks it's sexy......and he actually really means it....he's a Yorkshire man and isn't one to not say what he really thinks! He's always had a thing about Sinead O'Connor though! I feel very comfortable being hatless in public now and rocking my rock chick look - actually ended up overcoming this one one day in a restaurant during the early hot spells around my 6th chemo adding a massive hot flush and just had to do anything to get cool. Hardly a second look from anyone which was a surprise to me. Hope your last chemo goes well - I can also report the joint pains (mine were crippling) have stopped already. I think mine were always at their worst due to the GCSF injections. Some peripheral neuropathy - toes are worst but gabapentin is really helping. The best bit is its a bit like child birth, once it's over all the pain and misery starts to be a memory. The only one that still brings tears to my eyes is standing crying in the shower with huge handfuls of hair, and having my head shaved - and I think this will always stay with me......and that's why I hate the ads so much. Big hugs to you - you've almost done it......and as Dory says \"just keep swimming.....\" X",
      "MessageIndex": 144,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I think a number of us would really like to speak to the team directly. This is pretty much what we were told last year - and we don't feel our views have been taken account of at all.",
      "MessageIndex": 316,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Michael Not quite sure what you mean about feedback. I was thinking more about a discussion with someone who leads on this project - or someone responsible for Macmillan care of cancer patients. It's the juxtaposition of the purpose of Macmillan being to support people with cancer - and this campaign directly causing distress to people with cancer going through treatment that is the issue.......responses to date are totally missing this point or avoiding responding to this point and just giving us standard platitudes.",
      "MessageIndex": 324,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi carolep As I kicked this thread off, I thought I would reply - you may get others! I think the deep support and care you showed to your friend who sadly lost her battle, and the sentiments behind your \"brave the shave\" fund raising are wonderful and a huge credit to you. I think I've made my feelings clear about the campaign, as have a lot of other women who have lost their hair through chemo. Our issue is with Macmillan in terms of using this method as a fundraising campaign. We are still hopeful that other more imaginative and less insensitive ways will be focussed on in future. I would have hated for a friend of mine to shave their hair off. There are lots of other ways you can help your friend through the fear - choosing wigs (if that's her thing), researching the gorgeous headwear, holding her hand if she has her head shaved as a lot of us have done when it starts coming out...... Seeing you with a shaved head will just remind her what she looks like and I can only guess, but I think once she's lost her hair she will feel sad and maybe guilty you did this. By the way, when you get your head shaved it looks nothing like the complete bald, shiny lack of any hair that you get from chemo - and doesn't include your eyelashes and eyebrows......and your hair would be growing immediately, rather than you stating like that for months. Anyway - those are just my thoughts and there to be ignored. So practicalities - have you actually got sponsors for \"brave the shave\"? If you have, and you decide to do something different you would need to see if they are still happy to sponsor you. My guess is they will as its about giving to Macmillan rather than watching you get your head shaved! If you haven't started getting sponsors, or want other ideas here are a few that don't involve your knee! Giving up alcohol for a month - Macmillan are running a Go Sober for October https://www.gosober.org.uk Dying your hair pink for a month - bit extreme but you could change after a month! Holding a Macmillan coffee morning - or arranging one at your place of work - interestingly this raised £25m as against £4m last year - people much prefer cake!! coffee.macmillan.org.uk/.../ Hope this helps with your thinking, and I hope all goes well for your friend - it does for lots of us, I personally have no intention of going anywhere! Having a friend like you will be a huge asset to her.",
      "MessageIndex": 197,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I'm not sure I agree to criticise the Community Champions as that isn't their role - and they do such a wonderful job. Check out Michaels link to a complaints form - and my post suggesting we flood them with complaints and see what result we get first.",
      "MessageIndex": 367,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Well expressed! As the originator of this epic thread - this sounds like a good compromise to me if they won't ditch the campaign.  I'm yet to find the time to finalise my complaint - and will suggest this idea - thank you",
      "MessageIndex": 402,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Glad I missed that! Just wish they would all find something a little more sensitive. It will be interesting how you get on with Channel 4",
      "MessageIndex": 247,
      "PostDate": "16/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you Michael- this sounds like a sensible way forward so thank you for your help and comments. Might I suggest that everyone sends in individual complaints - and encourages anyone they know who feels the same to do so too. I feel that a flood of complaints might be taken more notice of than us putter no in one joint complaint. Maybe also say on this thread if you have put one in. How does the sound? I never realised when I started this thread about 18 months ago or more that it would generate so much - including the media interest.",
      "MessageIndex": 366,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Oh bless you - must have been even harder with hair like yours. So glad it is finally growing back. I totally agree - on the adverts the shaving leaves a head of hair I would love right now. I went completely bald within 10 days of my first chemo too (just in time for Christmas). And I'm also guessing they won't be totally bald still in 6 months time...... I'm doing a great impression of Voldemort at the moment - and from the looks I get sometimes you would think I am! I find older people the worst who think it is totally acceptable to stare in a quite offensive way as if I have committed an act of gross indecency.  What is it with people suggesting you dye it pink or purple?!! Take care and big hugs",
      "MessageIndex": 25,
      "PostDate": "29/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "FrancesW - this sums it up perfectly - I love your second paragraph particularly and hope the fundraising arm of Macmillan see this.",
      "MessageIndex": 30,
      "PostDate": "29/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Dear rainbowhairgirl When I started this thread, my issue was not with the people choosing to raise money for charity by shaving their heads. My issue was with Macmillan - the \"brave\" the shave and the advert showing happy smiling faces while people had their head shaved. It (the campaign) felt insensitive to me and I wanted to see if other chemo patients who had lost their hair felt the same. Macmillan have acknowledged our feelings and committed to consulting Cancer Voices in more detail about this campaign, for which many of us are grateful. In no way was I judging or criticising people like you - and time and again on this thread people have said the same. At the end of the day the purpose of this forum is for people who are suffering from breast cancer and dealing with the horrors of treatment to be able to freely express their feelings, share experiences and support each other. I'm sorry if you feel judged, this was never the intention and I'm sure we would all applaud people raising funds for charity.",
      "MessageIndex": 210,
      "PostDate": "03/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "You are right - I did apply, but there has never been anything I have seen or been invited to about Brave the Shave. I'm personally gutted - and have no idea what it will take to get our comments taken notice of. I really thought we had made a break through - but this TV campaign is even worse with the whole 'photo shoot\" thing. Show me anyone who is having chemo and hair loss and wants a photo shoot. The whole campaign is fundamentally opposed to what Macmillan stands for - in terms of supporting people with cancer. I know fundraising is crucial - but really wish they would focus on other creative ways that do not cause distress to the very people they are there to help. I will see if I can make some personal contact with someone about this. I am now a volunteer trainer (about to start delivering training to HR and line managers about the implications of cancer in the workplace. Diagnosed Oct 2015 and just had my final surgery 2 weeks ago! So will try and use my internal contacts to see f I can meet with someone face to face. Watch this space! In the meantime anyone upset or unhappy or who doesn't agree with the campaign, keep commenting as the more we have the more evidence I have. be.macmillan.org.uk/.../Alittlebitaboutus.aspx",
      "MessageIndex": 293,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you Michael  We had explanations last year - didn't help! We really want a commitment that this will be the last brave the shave campaign and Macmillan will use its energies in a different direction.",
      "MessageIndex": 300,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Evie I'm afraid I need to take a bit of a back seat right now - bigger things on my mind. Biopsies to other breast and about to go in for wire guided therapeutic mammoplasty again. Last diagnosis Oct 15 and only finished all active treatment last Dec so wasn't quite expecting this. ",
      "MessageIndex": 412,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you Evie",
      "MessageIndex": 417,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Tebs Dont worry - I found it through google. Also that in 2017 the petition had been rejected as it’s through change.org which try and change government policy etc. The response was it had been rejected as its not about government policy - and Macmillan is a private organisation and referred people to contacting Macmillan about it!",
      "MessageIndex": 463,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Oh Jo that's such a sad story - Your story eloquently epitomises what I was trying to say and feel. I totally agree Macmillan do an amazing job with fundraising and of course with how they support cancer sufferers and we would all be the poorer without them. I just wish they would push all the other ideas they have rather than this one - I honestly don't think many people understand how emotive and insensitive this one can be.",
      "MessageIndex": 6,
      "PostDate": "26/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Like everyone, I am grateful for the fundraising initiatives that raise money to help us all. Unfortunately I feel this response smacks of \"fobbing\" us off with an off the shelf PR statement - and does not in any way take on board any of the many heartfelt stories and feelings that have been expressed in this thread. It lacks any level of understanding or empathy with what we are saying. I feel rather patronised and deeply disappointed in the response. ",
      "MessageIndex": 41,
      "PostDate": "01/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "GrandmaStar - I put a message on my FB page telling friends that I (and many others like us) find this distasteful and insensitive, with reasons why and asking that no one ever considers doing this in support of me, but find other fun ways to fund raise and I would cheer them on! Actually found a few had thought to do it and pleased to report they are doing other things - they hadn't realised how I would feel about it and we're so pleased I had spoken up. This was my actual post \"Keep seeing adverts for Brave the Shave to raise funds for Macmillan. I really hope no one ever considers this as a way of showing support for me. There are so many ways to raise money that are fun. I didn't have a choice about losing my hair, and at the time the way you lose hair from chemo was the singular most distressing and hateful process I have experienced. Personally I find this initiative a bit patronising and very insensitive - and it is a feeling shared by many in my position. So if you ever have this urge - go out and do something fun and enjoyable instead - be creative! X\"",
      "MessageIndex": 100,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi RebeccaT I was also contacted by the Sunday Times but decided not to comment as my experience of the media is that they edit and use comments out of context - but in my case that I was also very cross that the way I had been contacted was through this forum. This reporter had joined our forum and contacted me by sending me a friend request which I considered highly unethical to say the least, and breaches the terms for membership. I contacted Macmillan and they have been removed. Anyway - that said, I love your post which eloquently says it all. You didn't sound ungrateful in the article - you said it as it is. The article in the end was reasonably balanced - and the main thing is that the fundraising team had already committed to do more research. I'm still hopeful (ever the optimist!) that they will put their fundraising funds (it must cost a lot to run campaigns and there can't be an unlimited pot of money) into other methods to encourage people to donate money - this has always been my aim. I am also a pay it forward lover - and love how you personally do this through your art. I'm really proud that I have been successful in applying to be a Macmillan volunteer trainer - to both pay back and pay forward in the future. I've been horrified at some of the stories I've read about how people here are treated by their employers. So when an advert popped up looking for people with my type of experience to train and facilitate session with HR and line managers to be better equipped to understand and support people affected by cancer in the workplace (including our carers) this was definitely for me. Just need to complete my treatment now - chemo tick, therapeutic mammoplasty tick, radiotherapy to go...... Like you I am, and will always, be grateful to all the fundraisers that made my future possible and hope to be here for a long while yet and get back to my scuba diving soon! Take care",
      "MessageIndex": 214,
      "PostDate": "04/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Well put Carolyn. It's surprised me that my thread has kept on getting responses after all these months - it clearly shows the strength of feeling. Hopefully the marketing team will take notice and we won't have to suffer this horrid campaign this year.",
      "MessageIndex": 268,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Good evening everyone I have seen two Macmillan TV adverts this evening, as well as lots of adverts on their Facebook site - and this website - for Brave the Shave, This is encouraging people to raise money for people affected by cancer by shaving their head - it has fostered a climate where people think it is showing support to people who have lost their hair by doing this too. Even my own daughters offered to shave their heads when they knew I was to have chemo and lose my hair - talk about brainwashing! I can't think of anything that would have made me more upset than to see them lose their hair too. I have pretty much powered my way through 8 cycles of DC and had every side effect it could throw at me, one stay of a week in hospital, and four times they called me in because of various things, two bad reactions in the chair - but the one thing that reduced me to tears wasn't being told I had cancer, it was being told I would lose all my hair in the second week of the first cycle. And I don't need to tell any of you how hateful I found having huge handfuls come out in the shower (and I had short hair so hadn't thought it would be so horrid). And then your eyebrows and eyelashes go - and your femininity feels like it's being stripped away bit by bit. Frankly I find people who say they will get their head shaved as support, and that say they do it to \"share\" our experience haven't a clue! They might choose this, we haven't chosen it - and wouldn't. It may sound over the top to some of you, but I find this whole campaign offensive, insensitive and patronising - particularly seeing people smile while having their head shaved, and people cheering. I didn't smile, and my daughter and husband didn't feel like cheering when they shaved my head. Ok I'm cool with my look now - the very shiny head (not a short razor clipped look) - but I would prefer not to have had to experience any of this. If you agree - please let me know. I have messaged Macmillan previously and never even had a response. I've commented on Facebook under their posts in the past urging people to find fun ways to raise money (and there are so many) and not to do this for me.........and there is always a huge response in terms of \"likes\" and comments from people in our reluctant community. If people are with me - maybe we can convince Macmillan to stop this barbaric approach to fund raising. Either like this post or put a comment of support please - if you don't agree, that's fine, no need to do anything! Well - that's my rant over - you might have noticed I feel a tad passionate about this!",
      "MessageIndex": 0,
      "PostDate": "25/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thanks Londonlass - I totally agree that they are doing it for a good cause and don't want to belittle anyone who has done this or the money they have raised. I just wish that other more fun ways are publicised rather than this one....... Wishing you all the best for the future too xx",
      "MessageIndex": 3,
      "PostDate": "26/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I totally agree Julia (Crystaljuju) I have thankfully been successful in preempting any of my friends doing this - and so glad that many have fund raised significant amounts of money in other ways. I would never have criticised anyone who has done this as I know everyone is doing it for the right reasons. For example  my daughter has just raised over £4000 galvanising her school and parents to run round the playing field - and they want it to be an annual event as it has also sensitively opened up discussions with the children about cancer through her very thoughtful school assembly. I raised £600 just giving up chocolate for a month! I think what many of us are saying to Macmillan is to use other fund raising ideas as campaigns rather than this one - there are so many ways to engage and run campaigns that are more sensitive to those dealing with the emotions right now - and also save them the emotions of having to smile when friends or relatives go down this route when they want to scream! There is a very early post on this thread of someone who's husband did this and how it made her feel which is very evocative.",
      "MessageIndex": 102,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Be my guest GrandmaStar!",
      "MessageIndex": 104,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Couldn't agree more Lynn! -  I particularly agree about hair loss as being so symbolic of an awful time - always dislike being called brave or being turned into a poor victim  as well!  I think we all just muddle through as best we can - I am a pretty positive person anyway so my usual approach served me well and was very much my \"public\" face. That said I had a fair few days during chemo huddled under the bedclothes in tears and wondering how I would do another day, let alone another cycle. It's not about being brave, it's about doing what has to be done as the alternative is worse. Cheers to you too my dear!",
      "MessageIndex": 146,
      "PostDate": "31/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Silverglades This is pretty much verbatim I think to the response I had when I commented through the Brave the Shave Facebook page. They keep missing the point that when I originally started this thread it was about encouraging and using other ways to raise money in their campaigns - people are desperate to help and will jump on any initiative and use it.  The thing they miss is the juxtaposition of their purpose in caring for and supporting cancer patients - and having a campaign that distresses the very people they are helping. I'm hopeful of getting on the cancer voices in due time - interest registered - to be part of the more in depth consultation on this issue they promised us in their second response in this thread. I think they have finally got the message - and it was reinforced by a huge level of support from people who feel like us after my post on their Facebook page too.",
      "MessageIndex": 155,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Totally agree xx",
      "MessageIndex": 446,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Bless you Silverglades - you aren't mean and have done your bit! You've explained how you feel and that should be enough....and you have already donated. If you are worried you can clarify on your Facebook and make it clear you prefer to donate in different ways - although you are entitled to your opinion and feelings, and neither has encroached on anyone else. Hope that makes sense......sending big hugs",
      "MessageIndex": 169,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Tebs Would you share the petition here please - I can’t seem to find it on the brave the shave Facebook page. My daughters also said they would do this and I also told them not to.  I had the most awful nightmare a few nights ago - I had seen the brave the shave ad not long before going to bed, so this must have triggered it, Basically I woke up crying - I was back in the shower with handfuls of hair coming out, then sitting crying holding my daughters hand while my husband shaved the rest off. This happened 2 years ago and my hair has grown back now - but it still feels like yesterday. It was so vivid - like a technicolour flashback. It certainly didn’t have people laughing or cheering in it! I’m guessing it’s a bit like PTSD. So thanks again Macmillan for giving my such distress. Is the money raised really worth doing this to the people you are here to support? Can’t you really come up with something new to encourage people to raise funds?",
      "MessageIndex": 459,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "You made me smile about your daughter stroking your head Megster! My hair is starting to come back (last chemo was 23 May) and I have about 2mm of very soft velvety fluffy stubble - mostly on top, the sides less so. My youngest granddaughter loves to stroke it. Funnily it's a bit like people rubbing your bump when you are pregnant - everyone looks and strokes my head now (friends and family I mean - no random stranger to date!) My daughter has changed the text tone on my phone to \"it's so fluffy\" from Despicable Me which is so funny! Well said by the way - this thread has always been about recognising the fantastic work Macmillan do, and the need to continue to raise funds - as you say, we just want them to focus more on the fun ways. The more people I speak to the more I see relief that shaving their head isn't what we want to see - and great that they still want to raise money and are looking into other ways. Good luck Megster with your chemo.",
      "MessageIndex": 175,
      "PostDate": "07/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thanks Jazmine - I did try this, saying that the registration link took me to the volunteering page and not a registration form. I was advised certain options to select on my profile/preferences page which I did - but this just seems to be purely that, and suggests you sign up to the volunteering newsletter to find out about volunteering opportunities as they arise. I've now tried this email address again with a specific question asking how I can directly and specifically actually apply to join Cancer Voices - so hopefully I will get a more direct response. Meanwhile found a very interesting volunteering opportunity to apply for in my area so worth doing this anyway! Thanks again for your help.",
      "MessageIndex": 177,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Catchpole Glad you got to keep your red hair - love your story! Not vain at all - it was odd that I didn't get upset when they told me I had cancer, but when they said I had to have chemo pre surgery and would lose my hair.....that's when I cried! My breast care nurse said this was the thing that upset the majority of women. I'm with you on some more upbeat adverts - one or two around now which are much better. Totally changed your perspective of them when you are in treatment doesn't it?! Hope you are doing ok.",
      "MessageIndex": 225,
      "PostDate": "13/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": " Accepted Rebecca T - look forward to hearing from you x",
      "MessageIndex": 237,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Perfectly put!",
      "MessageIndex": 325,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "You are welcome to quote me!",
      "MessageIndex": 329,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Lynn I've already expressed that I feel criticising the champions is unfair - it's not your role, and you all do a wonderful job supporting us all. I hope the comment was made without thinking and gets withdrawn. I don't think it will be something many agree with. Keep up your excellent work.",
      "MessageIndex": 376,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I don't like Shave for the Brave either - I'm struggling to see the difference as people would still shave their heads and feel brave. The distress at seeing people shave their heads would be the same. We really want this idea of people shaving their heads for money to stop and the focus to be on other and maybe new ideas to raise money. The concept also encourages people to think this is supportive - putting pressure on cancer patients children, partners, friends etc to do this - when quite the opposite is the case for many of us.",
      "MessageIndex": 399,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Flo4 Couldn’t agree more! Judy x",
      "MessageIndex": 428,
      "PostDate": "25/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I’m sorry Sinbad1503  but do you seriously think that having your head shaved even remotely helps you understand what we go through? I’m guessing  you haven’t had cancer or treatment yourself - apologies if you have, but you haven’t mentioned it. (Which begs the question of why you are on this particular community site which is for people with breast cancer?). You have really missed the point about how we all feel about this campaign. We just want Macmillan to encourage other ways to raise money as this one is insensitive the vast majority of us. Please raise money - just do it a different way.",
      "MessageIndex": 445,
      "PostDate": "22/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thanks - nothing like last time thankfully and no chemo this time. Feeling positive - have a new grandson due in Dec so need to be fighting fit! X",
      "MessageIndex": 414,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Unfortunately I started this 32 page conversation 2 years ago - and it was brought to their attention - we just got a “press statement” type comment that didn’t address what we had said. It was picked up in the press too. I really don’t know what else to do! I’ve found the petition but it is through change.org and has been rejected by the government as it is not about government policy and referees back to Macmillan.",
      "MessageIndex": 461,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I don't read any media articles - my husband reads them and let's me know if there is anything useful - works a treat! Pleased to say he screened this out - glad he did as I'm a slim, fit, non smoker, non drinker, eat a healthy diet, work out with a personal trainer, passionate scuba diver doing 80-100 dives a year.........being tested for BRCA gene due to family history........maybe it's my fault I was born to the wrong mother!!!!!!! Judy",
      "MessageIndex": 20,
      "PostDate": "19/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102595/cancer-is-our-own-fault",
      "Title": "Cancer is our own fault"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Totally agree Dreamthief. I was clearly lucky - my GP started typing the prescription number into the computer before I had even finished explaining what I wanted. He has even put it as a repeat prescription in case I want more! Wish more were like him - we shouldn't have to fight for this. My breast care nurse hasn't heard of it but is interested to see the results as a type of case study.  Not started yet, but feel good that I'm armed with this stuff!",
      "MessageIndex": 5,
      "PostDate": "10/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114594/r1-r2-update-after-radiotherapy",
      "Title": "R1 R2 Update after radiotherapy"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I'm finding Wunderbrow is great - chose quite a light colour as the reviews say it comes up darker. Also if you get it wrong need to wipe off immediately - it's that good! Stays on all day without movement even with rubbing! Doesn't stay on overnight though as advertised - but I'm guessing they haven't factored in us chemo  lot with nothing there to cling to! Good luck with the rest of your chemo xx",
      "MessageIndex": 71,
      "PostDate": "06/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109962/eyelashes",
      "Title": "EYELASHES!"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I guess we are all different and I know some people keep their eyebrows and eyelashes - hope you are one of them! I have just had my last of 8 Docetaxol and Cychlophosphamide pre surgery - am I the only one who has had 8?! I couldn't have FEC as have a mildly leaking heart valve.  I lost my hair at the end of the first week of the first cycle but was also lulled into a false sense of security as kept my eyebrows and lashes right up to the 5th, when they started really thinning, and gradually deserting me. Doing a very fine Voldemort impression until I use eye pencils and Wunderbrow to paint on my eyebrows! Good luck and hope yours maintain a sisterly solidity! Xx",
      "MessageIndex": 68,
      "PostDate": "06/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109962/eyelashes",
      "Title": "EYELASHES!"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "The egg bound chicken has made me laugh out loud! Thought if you want to be prepared you might like some headwear - your scalp may be a bit too tender at first for a wig - even if unlike me you make friends with it. Here are some nice ones - the ones made with bamboo are great as cooler if you get hot.....and hopefully it's getting warmer - and a night one in good as head can get cold. This is a favourite - mocha is lovely livebetterwith.com/.../ Gorgeous in grey -  www.simplywigs.co.uk/.../christine-headwear-lotus-bamboo-turban.php Love this too - bit plainer, I've got this in grey too! www.simplywigs.co.uk/.../yoga-turban-christine-collection.php Loads to see here -  www.wigs4u.co.uk/.../index.asp Another good site with more affordable ones- https://www.annabandana.co.uk Told you I was a headwear junkie! Still thinking of that chicken Xx",
      "MessageIndex": 8,
      "PostDate": "30/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108541/treatment-plan-at-long-last",
      "Title": "Treatment plan at long last"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I'm having chemo pre surgery and have my 7th of 8 on Monday. I couldn't have FEC due to heart so straight into Abraxane and Cyclophosphamide. It's not my leisure activity of choice but doable. I was warned that my oncologist (a Prof) is a character and no bedside manner! In fact he is incredibly focussed and it can come across as condescending but actually I've found I like his style as I got used to it!  I recall at the first meeting he told me I was down for 6 or 8 - he said that this meant if I was a whinger it would be 6, if I had grit he would get 8 out of me! Fortunately I have a dry sense of humour and love a challenge! He really focusses on how I got on in each pre chemo review as he wants to make the next one better - despite his rough style I have realised he cares deeply and have grown to love him to bits. I found keeping a detailed diary each day of how I felt and then consolidating it in prep for the review really helpful - and he loves it! While I was getting changed last time he actually told my husband that I am impressive - felt like I'd been awarded Olympic gold!! Sounds like he has given you sound advice though - all good stuff. On the wig front - I was sorted with mine as routine pre chemo. Standard fee of £60 for whatever I chose as rest subsidised. In hindsight I wish I had waited until afterwards as I think the fit and how it looks changes when hair is gone - and actually I have never worn it as it feels heavy and uncomfortable, and very different to how it felt when I tried it with hair. Much prefer my ever growing range of headwear! Check in to the chemo club - there is a great list of things to help. One weird thing was that C made the inside of my nose very sore - combatted by shoving Vaseline up from day 1 and brilliant - so my tip of the day! Good luck - and tell them about everything as they have all sorts of things to make it better! Not sure if you were told the first tends to be worst - a) because basically your body says what the f#*k as it hasn't experienced it before and b) you identify which side effects are yours and your oncologist can learn from this and prescribe you meds - hence the diary as it's easy to forget by week 3. Sorry - rambled for ever but again best of luck xxxx",
      "MessageIndex": 4,
      "PostDate": "30/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108541/treatment-plan-at-long-last",
      "Title": "Treatment plan at long last"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Forgot to say if anyone had a sore mouth Nystan is brilliant - I take it immediately now before it starts and no problem xx",
      "MessageIndex": 19,
      "PostDate": "12/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107409/slimming-world-weightwatchers-while-on-chemo",
      "Title": "Slimming world/ weightwatchers while on Chemo??"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Bev I've just had my 6th of 8 chemos pre surgery. Couldn't have FEC so started straight in on Docetaxel and Cychlophosphamide - changed Docetaxel for nab paclitaxel on the third. Also have steroids with the nab p fir my joints. I put about 12lbs on with the first three cycles and decided enough was enough as I am a gold WW member and had maintained my weight for years - seems an added insult to put weight on on top of everything else we have, at least we could lose it! I started WW on 19 Feb and have lost half a stone to date - slow but steady - my actual goal was just not to put more on so this is great!  It works well as basically I make sure I have all the foods I fancy for the bad times (usually first week) but they are from the ones that won't make me gain and there are loads. Fruit is perfect fit me - and when I can't manage anything else I love Warburtons thins with lightest Philadelphia which have replaced digestive biscuits!  It was good to take back control! My leader is brilliant and also had the added and unexpected bonus of a group of people really rooting for me on both levels and really feel supported in the group. Don't hesitate - go for it - it has boosted my mood no end! Good luck Judy xx",
      "MessageIndex": 18,
      "PostDate": "12/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107409/slimming-world-weightwatchers-while-on-chemo",
      "Title": "Slimming world/ weightwatchers while on Chemo??"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you for your lovely words and advice xx",
      "MessageIndex": 9,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103754/feeling-helpless-and-guilty",
      "Title": "Feeling helpless and guilty"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you Gwenx - you are right about that little voice! ",
      "MessageIndex": 5,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103754/feeling-helpless-and-guilty",
      "Title": "Feeling helpless and guilty"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you Positive1968 - your experience made me feel much better about it all. I hope your recovery is going well (and your Mum's!) x",
      "MessageIndex": 6,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103754/feeling-helpless-and-guilty",
      "Title": "Feeling helpless and guilty"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "In October I was diagnosed with grade 3 aggressive and fast growing breast cancer - my lump is 6.5cm.  After three lots of biopsies and a lot of discussion it was recommended that the best way forward for me is 8 cycles of chemo followed by surgery (hopefully WLE if it shrinks etc) then more chemo and or radiotherapy. Originally I was to have 4xFEC followed by 4xDC but now all DC as I have a mild/moderate leaking heart valve. I have taken things pretty much in my stride with the rare teary moment (particularly when I lost my hair after two weeks of the first cycle!) and generally feel surprisingly positive - I worry sometimes I'm not worrying!  I had a 4 day stay in hospital just after the first cycle at Christmas, but stabilised ready for cycle 2 - and a bad reaction during chemo 2 but we got there eventually!  So I'm just coming out of the other side of week 1 of my second chemo  (it's not fun, tough going with the side effects but I know I can do it - and have an amazing husband and daughters cheering from the side lines). My 81 year old mother had BC about 30 years ago (small lumpectomy and radiotherapy) and has just found she has an inverted nipple. She has been referred to the screening clinic on Monday.  I honestly don't feel up to being with her for the \"allow up to two hours\" appointment - I'm dreadfully tired, and this will be the start of my vulnerable week 2 and the hospital she has been referred to have a poor record with infections.  My Dad and husband are going with her - but she clearly feels very unsupported by me. Frankly she has been pretty difficult since my diagnosis - making it all about her and how difficult it is at her time of life to have a daughter diagnosed with cancer (so selfish of me!). I'm obviously hoping she is clear - no one wants to go through this crap, not least in their 80's - I'm 58 and finding it tough going.  I'm selfishly dreading if she isn't for me too - and haven't felt I can voice it anywhere as I feel so guilty for feeling this way - and sorry for dumping it here. Obviously I would want to support her but I'm having to pull on all my resources for myself at the moment and don't know how much I will have left. And on chemo weeks I'm pretty rubbish and not capable of anything much at all as being hit hard with side effects. I'm not looking for answers as I don't think there are any really - I'm just feeling so helpless and guilty, maybe because I'm still in week 1 and just need to get out the other side! Thanks if you've managed to read this! ",
      "MessageIndex": 0,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103754/feeling-helpless-and-guilty",
      "Title": "Feeling helpless and guilty"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Thank you bluesy x",
      "MessageIndex": 2,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103754/feeling-helpless-and-guilty",
      "Title": "Feeling helpless and guilty"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Have you spoken to your BC nurse? I recently had a fitting for mine and the woman said to make contact if I had any problems. I would think, given the woman I saw tried about 10 with me before she was happy with the look, that buying this on line would be near on impossible. Even if you have to pay for a new one it would be worth trying to get another appointment. Or - if you weren't happy with the service, maybe find somewhere you can physically go and try them? For the record mine is made by amoena and really good as well as comfortable to wear. Good luck!",
      "MessageIndex": 3,
      "PostDate": "19/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115103/buying-a-prosthetic-breast-on-line",
      "Title": "Buying a prosthetic breast on line."
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi everyone I have been trying to find out how to be part of any future consultation on the Brave the Shave campaign. It was mentioned that this would be done through Cancer Voices. After a lot of emailing it appears there is no direct way to get on such a group - you have to sign up and wait for volunteer opportunities to present themselves. Today the opportunity popped up - I've applied and it looks like they will be consulting on brave the shave soon. If anyone else wants to get involved - here is the link - to apply, click on the green apply button on the top right of the page    volunteering.macmillan.org.uk/.../4333",
      "MessageIndex": 0,
      "PostDate": "18/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113563/opportunity-if-you-didn-t-like-brave-the-shave-campaign",
      "Title": "Opportunity if you didn't like Brave the Shave campaign"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "You are welcome LynnMcW x",
      "MessageIndex": 2,
      "PostDate": "20/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113563/opportunity-if-you-didn-t-like-brave-the-shave-campaign",
      "Title": "Opportunity if you didn't like Brave the Shave campaign"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Nicky  I had some peripheral neuropathy part way through which my oncologist monitored like a hawk and questioned me thoroughly at each review before we decided to continue each time. I loved the very simple test which would have been a deal breaker and mean it had to stop. He called it the stumbling and fumbling test. Basically if I experienced becoming clumsy and stumbling a lot, or clumsy and dropping things, unable to do buttons up etc. these were signs to stop - he also said if the tingling fuzziness in my fingers changed to actual numbness this was also a stop sign. Simple test here again was to press my nail into another finger tip - if I could feel it despite the fuzziness etc this was ok. I managed to do all of mine. My left hand is still fuzzy/tingly at times (last cycle 23 May) and was painfully achy at the end of the last one, ,y right hand is pretty much back to normal now. Strangely my feet had been ok but my toes became very painful after the last one. I am now taking gabapentin which is helping with the pain in my toes, and has stopped the ache in my hand. Hopefully over time it will all go away, but can cope if it doesn't. If you have any doubt or it is feeling numb or you are stumbling or fumbling  - stop, you've done enough!",
      "MessageIndex": 8,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113812/peripheral-sensory-neuropathy-how-bad-should-it-be-allowed-to-get",
      "Title": "Peripheral sensory neuropathy: how bad should it be allowed to get..."
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "The test was requested by my oncologist - my mother, aunt and great grandmother all had breast cancer. Only my aunt died - of secondary brain cancer. All over 50 when diagnosed, including me but he wanted the test done anyway as he said it doesn't necessary follow that the gene exists only where younger family members diagnosed - which blew my complacency out of the water! I have two daughters and two granddaughters so this is a concern now. It takes forever by the way! My oncologist requested it in December, it was ages before I was then contacted and filled in lots of paperwork, my mother has since been contacted for permission to access medical records. They then assess whether they feel there is enough risk to warrant the actual genetic test - and said a minimum of 18 weeks! I'm still waiting - so don't expect anything to happen quickly if your oncologist requests it!",
      "MessageIndex": 5,
      "PostDate": "01/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108601/hereditary-breast-cancer",
      "Title": "Hereditary breast cancer"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I have to take 60mg codeine plus paracetamol 4 times a day because I have intense pain from these damn injections - and docusate and movagel because of the constipation! My knees are the worst - I find ice packs helpful too. Don't you just love all the side effects! I'm on my 7th cycle of 8 pre surgery and can't wait to see the last of them - 2 left this cycle! As soon as I stop them it eases really quickly - just need painkillers at night for the  chemo joint pain. I was told off for trying to tough it out as didn't like taking so much - given in and much easier to cope. Take care and keep taking the drugs! X",
      "MessageIndex": 5,
      "PostDate": "08/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108871/day-4-visit-to-hospital",
      "Title": "Day 4 visit to hospital"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Alison hp22 My initial emotional reaction on hearing I had BC was to have a mastectomy - at that time I thought it reduced the risk of it returning. As I learnt more, I realised it didn't. The only time a mastectomy reduce the risk is if you have it before getting primary cancer - ie the Angelina Jolie BRCA gene thing, which is what confuses people.  As I already had primary cancer, a mastectomy does not reduce the risk of secondary cancer. My oncologist told me that a lumpectomy plus radiotherapy is equal to a mastectomy in terms of risk reduction. My surgeon told me that there are studies that show that where breast conservation has been possible, this tends to link to a better quality of life - the reason being that mastectomy with or without reconstruction tends to impact more on how women feel about themselves. She also said that reconstructed breasts will never feel like a natural breast. Obviously if you don't have a choice this all goes by the wayside. I had chemo pre surgery which shrank my 5.5cm tumour to 3cm - and the circular tumour become flatter and more oval. This meant I could have a lumpectomy. As I needed quite a lot taken to achieve the clear margins, with some surface skin, and the nipple had to be removed (and my surgeon wasn't sure if she could save it) meaning I would have a smaller breast and be lopsided - I opted for therapeutic mammoplasty so that I had a cosmetic breast reduction (and lift!) with cancer removal. This looks amazing (and she managed to save the nipple and reattach) and as I was a 32H and had always wished for smaller this is a bonus. My surgeon wasn't prepared to do both breasts at the same time due to the harsh chemo regime I had been on for 6 months - two reasons, the length of the op would have been too much for me, and the risk of infection (high because of the chemo) would double. So I will be having my other breast reduced to match next April - she prefers 6 months post radiotherapy to allow my \"done\" breast to fully settle to ensure a good match!! I start radiotherapy in the next 2/3 weeks. I was also told that if clear margins were not achieved when the post op pathology results were available I would have to have a mastectomy  - so I guess there was a risk here that I might have had the first surgery for nothing - a risk I was happy to take. Thankfully margins and the three lymph nodes removed are all clear. Hope all this helps - I arrived at my decision after asking lots of questions so I fully understood the whole situation and felt able to make an informed decision that felt right for me.",
      "MessageIndex": 7,
      "PostDate": "25/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113819/masectomy-or-lumpectomy-advice-please",
      "Title": "Masectomy or lumpectomy? Advice please"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Welcome to the \"pathetic numpty\" club because I'm guessing that everyone who has visited this site is a fully paid up member - I certainly am! I also class myself as pretty hardy and a \"coper\" - the wisest words I ever heard from someone were that coping well means asking for and accepting help when you need it - so if it helps, seeing your doctor accepting the medication shows just how well you coping with this. When I was first diagnosed, although I was fairly calm about it I just wasn't sleeping and totally exhausted. For the first time in my life I saw my doctor and asked for sleeping tablets - best thing I did for a few days. Stay strong and keep looking for the laughter - mine came last week. When I was sitting in the lounge waiting for my chemo (wearing one of my beanies that make it pretty obvious I have no hair) a woman sitting on the next table confided that she found the place a bit depressing as it was full of \"poorly people\" and was there as her sister was having radiotherapy after chemo. I thought I should get in that I was there for chemo too - whereupon she told me she was having a hard time as so many of her relatives (I think about 5) had been diagnosed with cancer over the last year - then proceeded to tell their detailed stories with each ending with the fact they were now dead. Honestly it would have made a script Victoria Wood would have been proud of! I had to excuse myself and go to the loo in the end as I was bursting with laughter!  Take care, and good luck xx",
      "MessageIndex": 5,
      "PostDate": "17/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106701/bit-of-a-ramble-starting-to-wobble",
      "Title": "bit of a ramble starting to wobble!"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Nic, nicnic I originally had a 6cm tumour and 8 cycles of chemo (Docetaxel and Cychlophosphamide) with a view to shrinking it. I had a good response - the tumour removed on 4 July was just over 3cm and spherical rather than round. Margins and the three lymph nodes removed were clear. Therapeutic mammoplasty (the techie name!) was muted when I first saw my breast care nurse as an option as I'm a 32H and had jokingly said that I'd always wanted smaller boobs! When I was told I didn't need a mastectomy and my surgeon would do breast conserving surgery it was discussed that I would be pretty lop sided due to the amount to be removed, and where it was, but they could sort for me at a later date if I wanted to. I asked about TM again and she said I was an ideal candidate - particularly as my breast tissue is exceptionally dense. After talking it through, I opted for this.  My surgeon said she would not do both at once - several reasons: - She said my chemo regime had been high dose and very taxing on my body and she didn't want to subject me to such a long op (the one I had was nearly four hours alone).  - In addition she said the risk of infection (high after my chemo) would be doubled due to double the amount of scars - the T junction point is a particularly iffy area for this, and my ability to fight lower. - the follow on radiotherapy can have an impact on the conserved/reduced breast and affect the shape and size, so better to let it all settle down so she can give me the best matching result - and do any adjustment needed to the one already done if necessary. - I could see if I was happy with the size and shape and she could adjust as necessary during the second op She was absolutely adamant that because of the first two reasons she would not do both at once as she \"didn't work this way\". All made perfect sense and I liked her reasoning, and her caution. So the op - went pretty much to plan. Slight complication as I bled excessively (not uncommon after chemo) so had a drain. This was out after about 5 days. I was excessively sick, which led to a couple of other problems, afterwards (chemo again) and had to stay in for 3 days rather than coming home the next day after the op - but I'm told this was more uncommon. The shape is amazing - slightly smaller (in her opinion) than she had anticipated due to tumour slightly bigger than the MRI had showed. We were aiming at a D/E (obviously they can't guarantee a particular size, it's not an exact thing!). No idea yet - but I think it looks amazing - very perky, no droop (breast lift thrown in!). She managed to save my nipple - which she hadn't thought she could due to where the tumour seemed to be attached - and made it smaller in keeping with my new breast. I've had a few problems with the wounds - so glad only had one done! Bit of infection after first week - soon sorted with antibiotics. Also after a couple of weeks the scarring - which looked so neat from day 1 like wallpaper butted up against each other, and the nipple didn't even look stitched on!) - I had an area underneath from right side that kind of unheaked itself (another chemo type weird thing as chemo can reverse the healing process!). So I've had about an inch and a half that has been very sore and needing me going to the clinic every week. Looks like it is improving now though at last. The actual after op pain is surprisingly much less than I was expecting - nothing like other ops I've had in the past. I was driving within 3 weeks. The scar from the lymph node removal was much the worse. So she was very right to say one at a time in my opinion - I have to say that my hospital seems pretty leading edge with all this stuff from surgeons, oncology and breast care nurses. I was given a comfy to balance me up - breast care nurse there the morning after to sort for me. I've just been fitted for an amazing silicon prosthesis which is very comfortable and I look completely normal - you wouldn't know I had two such different size breasts so this temporary period is fine. I'm waiting to start radiotherapy now - can't until wound fully healed. Seeing surgeon again in January with a view to surgery around April - she prefers 6 months post radiotherapy and I'm very happy to follow her advice - she has been superb, very caring and empathetic. So - hope that's not too much info and hope it helps a bit? Any questions, please ask. Main thing is I am really happy with the decision and looking forward to getting the other done - so go fir it!",
      "MessageIndex": 3,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114771/lumpectomy-with-breast-reduction---when-might-this-be-offered",
      "Title": "Lumpectomy with breast reduction - when might this be offered?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "Hi Nic You are welcome. Mine was pretty much in the same area on all the drawings I saw.",
      "MessageIndex": 7,
      "PostDate": "12/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114771/lumpectomy-with-breast-reduction---when-might-this-be-offered",
      "Title": "Lumpectomy with breast reduction - when might this be offered?"
    },
    {
      "AuthorID": "Judyr58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/judyr58",
      "Content": "I started using Liz Earle products - cleanse and polish hot cloth cleanser, toner and moisturiser just after I had started chemo. My breast care nurse couldn't get over how great my skin was throughout - and it was never dry, although it had been before! Not sure it made me look 10 years younger - but my skin has never felt so good.",
      "MessageIndex": 9,
      "PostDate": "14/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116376/looking-for-a-good-light-thin-moisturiser",
      "Title": "Looking for a good light (thin) Moisturiser ?"
    }
  ]
}