{
  "AuthorID": "Juju4",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
  "Posts": [
    {
      "AuthorID": "Juju4",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
      "Content": "Feeling like this is horrible.  I hope you don't mind but have you spoken to your doctor about feeling low?  or Macmillan helpline?  There might be a medical reason, (antidepressants are not just for depression - low serotonin levels?) or Macmillan might have a course you can go on to help you come to terms with what you've been through and offer help with moving forward?  Hope you feel brighter soon x",
      "MessageIndex": 6,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133834/starting-again-but-so-low",
      "Title": "Starting again but so low"
    },
    {
      "AuthorID": "Juju4",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
      "Content": "Well done for seeing the doctor. You've done the hard part. It'll take a little while for you to feel better from the tablets, I'm also on sertraline, so no big decisions whilst your body adjusts. Take it slowly and try little changes to your life. I hope in a week or so you feel better and have strength to consider changing the things you want to change. Hang on in there, you have already fought the biggest battle!  Xx",
      "MessageIndex": 13,
      "PostDate": "19/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133834/starting-again-but-so-low",
      "Title": "Starting again but so low"
    },
    {
      "AuthorID": "Juju4",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
      "Content": "Hi Sue, sorry you've had trouble.  I'm also on FEC and have had 3 doses through a cannula in my arm and now have a Picc line fitted for the last 3 doses.  Lots of people have it through a cannula into the hand for all sessions.  For me personally, my veins in my forearm had become uncomfortable and it was making using my arm tricky.   The nurses are very experienced with giving the E part by hand rather than through the drip, this means you do have a nurse with you the whole time so if there's any pain they can sort it immediately.   I don't think you have to delay the next one unless you want to or medically it's better for you.  If it's difficult to find your vein in your hand then perhaps wait? Hopefully you can ask at your appointment when they remove the line - or maybe talk to your oncologist?  Take care, Jude",
      "MessageIndex": 6,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133776/blood-clot-in-picc-line",
      "Title": "Blood Clot in PICC line"
    },
    {
      "AuthorID": "Juju4",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
      "Content": "Hey J,  there's nothing scarier in my book than the word 'likely'.  I know that's supposed to be reassuring but the we don't rest until we hear 'definitely' .  I hope that you have a good holiday and can put all the fear in a little box whilst you are away.  When you get back perhaps the breast care nurse can talk through it with you, until it's 'definitely a cyst'.   I am still in chemo but I imagine post treatment every lump and bump will worry me too x",
      "MessageIndex": 3,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135860/scared-its-spread",
      "Title": "Scared its spread"
    },
    {
      "AuthorID": "Juju4",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
      "Content": "Cheltenham please :-)",
      "MessageIndex": 16,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133577/hope-course",
      "Title": "HOPE COURSE !"
    },
    {
      "AuthorID": "Juju4",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
      "Content": "Hi, I'm on FEC and had my dose 3 reduced to 60% because of liver trouble.  They assured me that it's not a reduced dose in terms of effectiveness as my body could not have coped with more so it would have the same impact on the current cells - assuming it's because I was already in a lower state of fight so it'd be easier to kill the cells than if I was fighting fight?   I've had dose 4 back to normal but dose 5 has been delayed by a week to allow my white blood cell count to rise a bit more. It's 0.86 which is too low for chemo.  I know what you mean about playing it down, my mind goes into overdrive sometimes too....good luck",
      "MessageIndex": 4,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134428/reduced-dose-of-chemo",
      "Title": "Reduced dose of chemo"
    },
    {
      "AuthorID": "Juju4",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
      "Content": "Hi Daisylou, I had the oncotype DX test. It can take time for it to come back, mine was a particularly long wait at almost 6 weeks.  To my knowledge the test is only offered to HER2 neg ER pos breast cancer types.  If you are HER2 pos they will want you to have chemo anyway.  Us lucky ones get a 'choice'.  My tumour was 37mm, grade 3 but not in lymph nodes.  I'm 42. The onco test came back with a score of 75. I understood that to be a 75% chance my tumour will return unless I blast it.   I've yet to meet anyone who had a result anywhere near as high.  I'm almost triple negative except for a small ER positive so i'm thinking that's why.  When I asked the oncologist about the result he said he didn't matter, 50 or 75 it's all the same outcome - chemo.  So, I'm 3 in out of a cycle of 6 straight FEC.  Surviving. Not pleasant but totally doable.  Maybe your oncologist perhaps knows that chemo is not really the best plan of action for you and he's sent the test off to make sure it's the right decision for you?    Doesn't help if I say try not to worry, but try not to.  You can call them to find out if your result is in a couple of weeks before?  The delay may be something as simple as your oncologist has a holiday booked...I know, it sounds crazy when it's so important to us but it's their everyday working life, I've discovered. I wish you luck and hope this has helped a little, Jude x",
      "MessageIndex": 19,
      "PostDate": "20/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131880/will-oncotype-dx-results-be-different",
      "Title": "Will oncotype dx results be different?"
    },
    {
      "AuthorID": "Juju4",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juju4",
      "Content": "Good luck tomorrow x",
      "MessageIndex": 34,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132766/july-2017-chemo-club",
      "Title": "*** July 2017 Chemo Club ***"
    }
  ]
}