{
  "AuthorID": "JuJuxx",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
  "Posts": [
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hello Starks. I've just had my third round of FEC and am half way thru, taxotere/docetaxal is due to start on sept 10th. With my first round of FEC I felt very nauseas and heavy headed but was never sick, I took all the anti sickness and steroids as prescribed, I have crystallised ginger which helps and since one of my friends recommended hot water with fresh lemon and Manuka honey with ginger to sip, this has really helped my heartburn which can make you feel nauseas. I'm having an injection of white cell boosting stuff for the first 5 days after chemo which sends signals to the bone marrow which will stimulate it to grow new stem cells whilst the chemo kills all my mature ones. The period you have to be extra careful and not be around any one with coughs colds or whom have had any kind of bug is days 7-14. I generally start to come out if the darkness by day 10 and my appetite comes back, I can face the supermarket again but always carry an anti bacterial hand gel with me and wipe it along the trolly and dab a little under my nostrils! Manuka honey, the best grade you can afford is really good at supporting your immune system and keeping mouth sores at bay, plus brushing after every meal if you can and also gentle warm salt water mouth wash has helped prevent mouth ulcers with me. I'm not sure what's in store for me with the next 3 rounds but I will do my best to give any advice on my own experience as and when I can. As for hair loss, altho you know it's coming it's still a shock but you get used to it and I wear a bobble hat at home rather than my wig all the time. My hair started to really fall out after 2 weeks. It just goes dry and lifeless at first then starts to come out in lumps. You'll be bald by 3 weeks for sure. Glad you have a wig ready, I love mine, it's very similar to my own hair but actually nicer! I was fortunate enough to afford a human hair one so my hairdresser comes round and washes it for me every 2 weeks then blow dries it whilst on my head and curls or straightens it for me. It looks v glam! I have a back up synthetic one too but prefer my human hair one. You will be fine, so much support and advice on here from everyone all on similar journeys to you always willing to help etc xxxx",
      "MessageIndex": 4,
      "PostDate": "22/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81647/starting-chemo-in-11-days",
      "Title": "Starting chemo in 11 days....."
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Only had 3 cycles of FEC so far and nails seem ok as I've had them painted with shellac. But my hairdresser recommend silica tablets to take after all the chemo is done as this apparently encourages nail and hair growth. I ordered mine from Natures Best ready for when the chemo is over! Have no idea if it will work but I'll give it a go :-) xxx",
      "MessageIndex": 4,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81669/16-months-post-chemo-and-still-nails-coming-off",
      "Title": "16 months post chemo and still nails coming off"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I have a spoonful of Manuka 15+ every day plus hot lemon ginger with a little drop of Manuka in that too and to date no mouth ulcers! Fingers crossed! Xxx",
      "MessageIndex": 15,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81647/starting-chemo-in-11-days",
      "Title": "Starting chemo in 11 days....."
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Full article here:- Charities have expressed outrage as the NHS announced plans to stop funding 25 treatments for cancer, including those for breast, prostate and bowel disease   Eight thousand cancer patients are likely to have their lives cut short following a decision to withdraw NHS funding for 25 treatments. Medication which offers a last chance to patients with cancer a year - including those with breast, prostate and bowel disease - will no longer be funded by the NHS, under plans to scale back spending from April. Experts said that around two thirds of those who seek NHS treatment for advanced bowel cancer are likely to face an earlier death because of the decision. Charities accused health officials of taking \"a dramatic step backwards\" and destroying a lifeline which prolongs the survival of thousands of cancer sufferers. More than 3,000 patients a year with bowel cancer, and 1,700 patients with breast cancer are among those affected by the decision. Drugs which will no longer receive funding have increased survival in some cases from eight months to two and a half years, charities said.   ADVERTISEMENT   The Coalition introduced a special Cancer Drugs Fund in 2011, following a Conservative election manifesto pledge that treatments should no longer be denied on grounds of cost. Although its budget was increased from £200 million to £280million, demand is such that it is now forecasting to have spent £380 million by the end of the financial year. NHS England said it will increase the annual budget to £340 million but could not afford to continue paying for all the cancer treatments which are now funded. Cases for whom funding is agreed before April will continue to receive the drugs on the NHS, which is likely to mean a desperate scrabble on behalf of terminally ill patients as the deadline looms.  The chairman of the fund said the review had taken \"difficult decisions\" to prioritise the drugs which offer the best value. Of 84 treatments examined in the review, 59 will continue to be funded after March of this year, while 25 will be \"delisted\" - meaning they cannot normally be funded for NHS patients. Five treatments for bowel cancer, four for leukaemia, three for breast cancer, three for lymphoma, three for sarcoma and drugs used to treat cancers of the prostate, ovaries, lung, pancreas and kidneys are among those which will no longer be funded. Andrew Wilson, chief executive of the Rarer Cancers Foundation, said the decisions would be “devastating for patients”. He said: \"If the Prime Minister is serious about his promise to cancer patients, he needs to bring together NHS England and the drugs companies to broker a deal to protect access to these drugs before the March deadline when patients will be denied treatment.\" Mark Flannagan, chief executive of the charity Beating Bowel Cancer, said the decision meant around two thirds of patients with advanced bowel cancer were likely to face an earlier death. He said: “These changes are a backward step in treatment for advanced bowel cancer. Doctors will be forced to tell their patients there are treatments that can prolong their lives but they will no longer be available.\" He said some of the bowel cancer drugs had increased survival from 8 months to 30 months in some cases. Prof Chris Bunce, research director at Leukaemia & Lymphoma Research, said decision to remove many effective drugs for blood cancers like leukaemia, lymphoma and myeloma from the list was a “dramatic step backwards.” He said: “Many of these treatments can significantly prolong survival times and provide a good quality of life for diseases that can have devastating symptoms.” Three drugs currently used to treat advanced breast cancer - Halaven, Tyverb and Afinitor - will no longer be funded. More than 800 women a year are funded for Halaven, which extends the life of women with an especially aggressive form of the disease by almost five months on average. Around half of women live longer than a year after receiving the drug, which costs around £10,000 for a six-month course of treatment, and is prescribed as standard care in 55 countries. Samia al Qadhi, chief executive at Breast Cancer Care, said: “Thousands of breast cancer patients have today been denied the chance of improved quality of life and extra time with their loved-ones. This news is devastating for them.\" She said the fund was \"falling apart\" while health officials and the pharmaceutical industry had failed to find any long-term solution to how to pay for cancer treatment. Clinicians can still apply for their patient to receive a drug not available through the CDF on an \"exceptional basis\" – which means they have to demonstrate that their patient will gain more benefit from it than another given the same drug. Just three new drugs will be funded, following the review: Panitumumab, a treatment for bowel cancer; Ibrutinib, a treatment for Mantle cell lymphoma, a type of non-Hodgkin lymphoma; and Ibrutinib for use in chronic lymphocytic leukaemia. Professor Peter Clark, chairman of the fund, said: “We have been through a robust, evidence-based process to ensure the drugs available offer the best clinical benefit, getting the most for patients from every pound.” He said: \"These are difficult decisions, but if we don’t prioritise the drugs that offer the best value, many people could miss out on promising, more effective treatments that are in the pipeline.” The decisions follow a review by a national panel - comprising oncologists, pharmacists and patient representatives, which independently reviewed the drug indications currently available through the fund, plus new applications. They assessment looked at at clinical benefit, survival and quality of life, the toxicity and safety of the treatment, the level of unmet need and the median cost per patient. In cases where the high cost of a drug would lead to its exclusion from CDF, manufacturers were given an opportunity to reduce prices.  Prof Lesley Fallowfield, Director of the Sussex Health Outcomes Research & Education in Cancer, University of Sussex, said she did not agree with the fund's existence, and said it was not clear why some drugs had stayed on the list, while others were delisted.  She said: “The latest list as far as I can see contains some surprising exclusions and inclusions and I can see why desperate patients, their families and clinicians are outraged.\" “This whole issue of who wins when one has infinite demands on a finite budget can only be resolved with sane debate. This is unlikely to happen with a general election in the offing and all parties jostling for position as the most cancer patient friendly.” Lord Darzi, a former Labour health minister, said on Monday that the NHS should stop needlessly treating dying patients, to help finance the soaring cost of new cancer drugs. He told The Times that cutting down on unnecessary tests and treatments with little chance of success would free money to spend on the expensive modern medicines that the health service struggles to afford.  The drugs which will no longer normally receive NHS funding: Bowel cancer Aflibercept for metatstatic bowel cancers Bevacizumab as a first line treatment for advanced bowel cancer  Cetuximab as a second or third line treatment for metasatic bowel cancer    Breast cancer Lapatinib, for advanced breast cancer. Eribulin for advanced breast cancer Everolimus for advanced breast cancer Kidney Everolimus for metastatic kidney cancers    Leukaemia Bosutinib when used in the treatment of some Chronic Myelois leukaemia, including where patients have an intolerance for other treatments  Dasatinib, for lymphoid blast crisis chronic myeloid leukaemia Ofatumumab, for chronic lymphocytic leukaemia   Lung cancer  Pemetrexed when used to treat advanced non-squamous non-small cell lung cancer    Lymphoma Bendamustine for some cases of non-Hodgkin's lymphoma Bortezomib in treatment of relapsed/refractory mantle cell lymphoma Bortezomib for relapsed Waldenström macroglobulinaemia, a rare type of non-Hodgkin lymphoma    Myeloma: Bortezomib for some cases of relapsed multiple myeloma   Pancreatic cancer Everolimus for some pancreatic cancers   Prostate Cabazitaxel for advanced hormone-resistant advanced prostate cancer, when disease has progressed in spite of chemotherapy. Reproductive cancers Bevacizumab as a second-line treatment for advanced ovarian and Fallopian cancers Sarcoma  Pazopanib for soft-tissue sarcomas Pegylated Liposomal Doxorubicin for some sarcomas Regorafenib for gastro-intestinal stromal tumours, a rare type of sarcoma   Number of patients who will be affected by the new restrictions: Breast cancer 1765 Colorectal cancer 3239 Lung cancer 573 Prostate cancer 465 Sarcoma 262 Kidney cancer 284 Ovarian cancer 403  Myeloma 106  Lymphoma 373 Leukaemia 119 Neuroendocrine 116 Total number of cancer patients affected: 7705 Analysis by The Rarer Cancers Foundation, which calculated the projected impact of the decision to remove 25 treatments from the Cancer Drugs Fund using NHS England's figures of the number of patients who received these treatments through the fund in 2013/14.  ",
      "MessageIndex": 6,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88234/breast-cancer-drugs-stopped-by-mr-cameron",
      "Title": "Breast cancer drugs stopped by Mr Cameron"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I agree Dreamthief! ",
      "MessageIndex": 8,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88234/breast-cancer-drugs-stopped-by-mr-cameron",
      "Title": "Breast cancer drugs stopped by Mr Cameron"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I've just read an article in the telegraph about the Breast cancer drugs that will be stopped \" Three drugs currently used to treat advanced breast cancer - Halaven, Tyverb and Afinitor - will no longer be funded.",
      "MessageIndex": 5,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88234/breast-cancer-drugs-stopped-by-mr-cameron",
      "Title": "Breast cancer drugs stopped by Mr Cameron"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I have read that weekly taxol is less taxing (no pun intended!) than 3 weekly taxatere. I felt rough on FEC and for me personally the 3 weekly taxatere, altho evil in it's own right, was the lesser evil of the two for me!! It makes you feel very tired and your bones will ache, like flu symptoms, food and drink will taste strange and you may get a sore tongue. Everyone responds differently so you may be ok with weekly taxol. However you react you'll get thru the other side I promise! Xxx",
      "MessageIndex": 1,
      "PostDate": "02/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85184/weekly-taxol-side-effects",
      "Title": "Weekly taxol side effects"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hope all went well Jm, how are you feeling so far? Xxx",
      "MessageIndex": 9,
      "PostDate": "12/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82540/not-looking-forward-to-starting-fec-on-thursday",
      "Title": "Not looking forward to starting FEC on Thursday"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I felt sick on the FEC but wasn't physically sick. Tomorrow I start my taxatere! I will be reporting back! Been taking steroids today and will continue with whatever they suggest. Good luck for Thursday and keep us posted! Xxx p.s you make tax sound less scary than some of the stories I've been reading on the net Jm! Xxx",
      "MessageIndex": 6,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82540/not-looking-forward-to-starting-fec-on-thursday",
      "Title": "Not looking forward to starting FEC on Thursday"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Good luck for today Jm, let us know how you get on. Xxx",
      "MessageIndex": 7,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82540/not-looking-forward-to-starting-fec-on-thursday",
      "Title": "Not looking forward to starting FEC on Thursday"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Wise words from Mistymoley, and I totally understand how you feel with regards to sister in laws, have very similar experience!! Not a word of comfort to me or her younger brother (my husband) when I was diagnosed. I've been inundated with cards and flowers and candles etc from so many people but not a thing from her and I've been her sis in law for 20 years!! I also feel pissed off when I hear that everyone is going or been on holiday or going away for weekends, doing this, buying that etc etc, I know their lives go on and they are perfectly entitled but it still makes you think, why me? What have I done to deserve all this!! But I think I've finally realised after all these years that life just isn't fair! Which is why, once we are thru this we should all live the rest of our lives to the fullest, I really hope your PN gets better soon, are you taking any B vitamin supplements at the mo as these are supposed to be good for this condition. Keep feet and hands warm and massage them regularly. Get your sis in law to come round and massage your feet for you!! Really truly hope you turn a corner soon Trudi and rant away on here whenever you want. Xxxxx",
      "MessageIndex": 3,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82085/i-am-experienceing-anger-at-my-family-andfeel-awful-about-it",
      "Title": "I am experienceing anger at my family andfeel awful about it"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hi MrsShep! I have a human hair wig and had it coloured my usual shade and cut and styled exactly how my normal hair was, altho the wig is slightly thicker, it looks so natural and my hairdresser comes round my house regularly for wig maintenance!! She blow dries it whilst on my head then puts light waves thru it so it looks girly - it's great just to whack it on in the morning and ta dah! It's all done! Saves so much time! I've been told I don't look scary without it either but I usually wear a bobble hat around the house as I find it a bit draughty otherwise lol. I also have a synthetic one which is much lighter weight but I'm attached to my human hair one more. :-) I hope you love your wig as much as I love mine ;-) xxx",
      "MessageIndex": 7,
      "PostDate": "27/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81880/hair-starting-to-go--",
      "Title": "hair starting to go :-("
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Okay well I'm now on day 9 post taxatere and it has decided it doesn't like me!! The honeymoon period was nice but short lived and the 'run over by a steam roller' effect hit me on day 4. I have powered thru and managed the pain with a combination of paracetamol cocodamol and ibuprofen. I also had diazepam for a few days to help me sleep. Monday night I had a very close relationship with the ensuite, tummy cramps and you can guess the rest, sharp stabbing pains making me shudder, everything I ate going straight thru me but I just battled thru thinking it's all normal side affects of the tax. Last night however, a mysterious purple rash appeared at my infusion site on my hand and it was itchy and swollen, also in the crease of my elbow where bloods were taken was purple and itchy and failed the glass test! Temperature was creeping up, started to shudder but didn't feel overly feverish. Anyway I called the emergency unit about half 9 last night and explained my symptoms. Was told to take the emergency anti biotics immediately and drink a litre of water and keep checking my temp. Unit called me back an hour later and were happy that I'd caught the neutropenia sepsis early! Thank god I called them as I thought I might wait til the morning but happy my gut instinct kicked in. Don't want to be a chemo baby but the rash appearing and temp going up and the fact my tummy was still very very upset, all pointed towards sepsis. Hospital are calling me regularly to check up on me but I've been told if I start to get violent shaking and temp goes up I have to call 999! So this taxatere really does brutalise our immune system big time!! Apart from that I'm fine and have lost a few pounds this week lol :-D xxx",
      "MessageIndex": 4,
      "PostDate": "18/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82974/docetaxil-experiences",
      "Title": "Docetaxil experiences"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Jm I think it's really strange how we are all being given meds at different times. My Onco friend said they should give the white cell boosting drug 5 days post chemo because otherwise the chemo just destroys the new cells too quickly, which makes logical sense to me, but my NHS trust give them to me for the first 5 days after chemo. And some of you are having them for 7 days?? I was given an emergency pack of strong anti biotics to keep but weds was the first time I needed to use them. I just want to focus on my neutrophils now I'm feeling better, I'll be having as many B12 rich foods as I can for the next 10 days!! My knee joints feel as tho they have arthritis, kinda sore and tender/achey but a couple of 400mg ibuprofen seems to ease the pain a little. It's nothing compared to how I was feeling last week tho! Those shooting pains all over and back pain, erghhhh!! My cancer nurse at chemo unit said they'll more than likely reduce the dose next time by 20-%. I'll insist on it anyway. Xxx I hope you Lovely ladies are all ok and have a relatively pain free weekend! Xxx",
      "MessageIndex": 10,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82974/docetaxil-experiences",
      "Title": "Docetaxil experiences"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hi Daft Bird. Doesn't sound good to me, does the area feel hot or swollen? I had pains after my second round of FEC and went to A&E, I did have signs of clotting so now on clexane (heparin) daily injections for 6 months. They suspected either clotting or phlebitis - if I was you I'd go back for second check up just to be safe as clots are common with these chemo drugs. Please keep us posted xxxx",
      "MessageIndex": 1,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81701/leg-pain---fec-chemo---cause",
      "Title": "Leg Pain - FEC chemo - cause?"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hi Lyndsey, I'm on chemo and have been prescribed cocodamol and zopiclone so I'm assuming we are still allowed to take them. I never had a PICC line but sometimes wish I did as my veins in my hands are not happy and the phlebotomist struggles to get a blood sample now! I only have one more chemo to go so they won't put a PICC line in now. I wish you luck for this week, let us know how you're getting on xxx",
      "MessageIndex": 1,
      "PostDate": "13/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84249/medication-whilst-on-chemo",
      "Title": "Medication whilst on Chemo??"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I have heard that it helps but don't know too much about it tbh.,xxx",
      "MessageIndex": 1,
      "PostDate": "02/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80553/acupuncture",
      "Title": "acupuncture"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hello Anantadati :-) interesting reading your treatment programme, similar to mine but I've had 3 x FEC and 1 x taxatere so far. Completely different experiences with both, nauseas and fuzzy headed the same as MrsMeag with FEC and hips, leg and lower back ached with tax! Also had neutropenia sepsis with the tax so been on strong anti biotics since last weds. The veins in my hand at cannula site were swollen sore and purple but getting better now. Been hearing lots about beet root being an excellent food to eat on chemo as it's great for the blood and vein health. I'm going to juice beet roof, water cress, apple carrot and ginger as this is a good immune booster. :-) I wonder why they give some of us tax first and others FEC first. My lump has shrunk loads, I used to be able to feel it easily but I can't feel it now, even after the first FEC it wasn't half as palpable - the mammo showed it has shrunk from 32mm to 14mm which my team said was excellent, so the chemo is working even tho it's doing damage to the rest of my body at the same time, but that's the price we pay!! And our bodies do bounce back especially if we nourish ourselves well. My tips are have Manuka honey 15+ every day - I have not had one mouth ulcer yet! And drink coconut water (vita coco) as this helps flush it all out quicker. Never had the cold cap option so just went bald and have a fab human hair wig which is identical to my own barnet :-) I hope all goes ok, this group is fab and everyone is very supportive no matter what your worries or concerns are :-) Xxx I was told that the taxatere infusion lasted one hour, which it did last time but I've also heard of other having a reaction on the second tax and my chemo nurse earned me that this could happen too. In light of my neutropenia tho, I've been told by the chemo unit they will reduce it by 20% next time so that's something positive! Apparently this will not affect it's ability to kill kill kill! I also have the injections, no aches or pains at all with these during FEC so the bone aches I experienced on tax I assumed were caused by the tax!",
      "MessageIndex": 3,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83140/new-member-of-breast-cancer-group",
      "Title": "New member of Breast Cancer group"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I think your diet sounds great hairworries! I have been having lots of stir fries using chopped garlic, chilli, red onion, courgettes, red or green peppers mixed in with Thai Jasmine rice with a dash of soy sauce and sprinkled with spring onion and coriander at the end. I also mix in honey roast salmon or cauldron tofu pieces (from Sainsburys). It's delish! I've been having salmon most days or tuna. I'm gradually changing over and trying new things. Once my radiotherapy is complete by Feb/march next year I'll be well in the swing of my over-hauled diet and I will just be in the habit of eating all the right things to keep my bodies environment cancer unfriendly, hopefully!!",
      "MessageIndex": 28,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hello Crysal Kitty! That's a very cute name!! I am almost identical to you with treatment but just 3 FEC, 3 Taxatere/docetaxal followed by lumpectomy 6 weeks after chemo is finished, followed by 6 weeks of radiotherapy 6-8 weeks after surgery! Mine is hormone negative so won't have to take any follow on drugs afterwards: still a long journey ahead but I'm still here, alive and well and doing ok so far! I've had all 3 FEC, have to say, wasn't impressed !! Obviously the hair loss is a shock even tho we know it's coming but I found the nausea and heartburn quite troublesome and my hormones were all over the place too which didn't help. Little bit of insomnia but now have zopiclone to take if I'm desperate. Omeprezole sorted out my heartburn and the sickness subsided by day 10. I was very nervous too about the taxatere, you read so many horror stories about how it affects some people! A lady on here named jmwatson actually put my mind at ease with her experience of it and it seemed doable and not too scary from what she said, even tho she had an allergic reaction to it, her medical team seemed to have it all under control. I had my first infusion on weds 10th September, all went ok, no reaction at all BUT YOU MUST take the steroids the day before and on the day of chemo and the day after. This will help prepare your body for any adverse reactions. Drink plenty of fluids and if you can get onto the coconut water ASAP, like now, today! Drink a large glass every day (from Tesco or Sainsburys, vita-coco in the chilled drinks part) plus two large glasses for first 3 days after chemo. This will help you flush thru quicker and keep everything moving. My other nutrition tips are Manuka honey 15+ every single day from NOW! I have not had one mouth ulcer throughout my whole chemo as yet and other ladies on here have said the same. It helps support the immune too. Eat as many healthy bright coloured veg salads and fruits as poss. Drink green tea with lemon in. Keep proteins up too. The main thing is keep super hydrated. I haven't had any nausea at all with taxatere and it's heaven! However, altho my firs two days were good and I managed to resume normal chores etc, by Friday night/sat morning I felt as tho I'd been fast forwarded into old age overnight!! Felt as tho I had been run over by a steam roller! Every bone ached and had lower back ache too. I have managed these side affects with paracetamol (which is a bit crap) cocodamol and ibuprofen and having two warm baths a day in Epsom bath salts. Been resting as much as poss. I would say it's not as bad as FEC but I did have complications (blood clot) with 2nd FEC and damaged vein so for me, taxatere is being nicer atm! However, I'm not counting my chickens yet as have two more to go and I have heard that round two can cause more trouble! Today is day 7 after tax and I feel a bit washed out, but that may be because I was having an intimate relationship with my en suite between mid night and 4am today!! So you may experience an upset tummy but it was nothing too horrific and my temperature was stable. Always keep your temp checked, stay away from people with germs for first couple of weeks and just listen to your body, don't over do it and ask for help if you can't manage. I hope you'll be ok, pls look after self nutrition wise, it makes such a difference as your body needs all the natural enzymes to rebuild cells and get back on track ASAP. I'd highly recommend a vitamin D supplement and a multi vit every day as extra support. I've had this verified by my medical team and it's ok to do so but that's all I take. I hope this info helps you, please don't worry and just give yourself the best defence internally as you can. Xxx",
      "MessageIndex": 4,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82805/about-to-start-docetaxel-feeling-nervous",
      "Title": "About to start Docetaxel ... feeling nervous"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Thanks for posting this, I had the same thing happen to me on weds for my 3rd FEC. I had been taking milk thistle and my liver readings had been normal. However I mentioned this at my 2nd chemo to the reflexologist and she grassed me up to one if the chemo nurses who called me and said I mustn't take it any more as it interferes with the flourocil - but if you're just having Epicrubicin and Cyclophosphamide then you may be ok to take it but def check first. My liver enzymes have shot up since not taking it, from normal 30 to not so normal 135, white a jump! My friend who is an oncologist said it's the Epirubicin causing this and things will settle down again. I'm drinking as much iced mineral water as I can to keep flushing the toxins thru! Thank you Dreamthief for your links and advice once again, you're a star! Xxxx",
      "MessageIndex": 4,
      "PostDate": "22/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81557/help-need-some-advice-re-l-iver-function-test-results",
      "Title": "Help need some advice re: L iver Function test results"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Morning Noodles, lots of good questions and I'm sure we can all help on here. It's all a bit too much to take in when you're first told you're gonna lose the natural feminine things that we just take for granted!! My regime is 3x FEC and 3x Taxatere. I'm thru the FEC now,,last one was last weds. My hair started to really come out in lumps approx two weeks after the first round. I already had a wig at the ready and have really been wearing it from the beginning as I wanted to get used to it. It now fits perfectly as I'm virtually bald!! I also have a very good friend who is an expert with semi permanent cosmetics so had my eyebrows brush stroked prior to chemo starting. They look fab and I don't have to worry about them anymore. I do still have eyebrow hair tho so to date it hasn't fallen out but I expect it will once the taxatere regime starts. Same with my lashes, still got those and regularly have individual lashes attached by another beauty therapist friend. She said my lashes are all normal and are not showing any signs yet of falling out so I'll keep having them done until the chemo decides to steal them from me. I have strip lashes on stand by for when that happens too! Nails, I've been having them shellaced and will continue to do so, my BCN said it was a good idea to do this, darker colours the better so the UV light doesn't damage them as we become more sensitive to UV whilst on Chemo. I still have gel growing out on my toes so I'm going to get this sorted out ASAP before the taxatere starts. I hope my own experience so far helps with your questions, I know we are all different tho. Are you having the same drugs as me do you know? Xxx",
      "MessageIndex": 2,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81765/hair-nails-eyebrows-lashes",
      "Title": "Hair, Nails, Eyebrows & Lashes"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I am with hairworries on this, even tho my BC is triple negative I'm still trying to reduce the dairy in my diet. I'm trying all the different milk alternatives and have settled on rice milk. My 20 year old son has also cut out dairy and since doing so has less mucous and feels so much better. I agree that plant based natural organic foods are the best for us but also we mustn't deny ourselves little luxuries every now and then! Everything in moderation I agree but I'm aiming for 80% alkaline 20% acidic ph body balance from now onwards. I can't take any hormone blockers for my BC so I'm out on my own with just nutrition, diet and exercise as my weapons against recurrence!",
      "MessageIndex": 17,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84829/dairy-foods-hit-breast-cancer-recovery",
      "Title": "DAIRY FOODS HIT BREAST CANCER RECOVERY"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Have you had chemotherapy as well yet?",
      "MessageIndex": 1,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82094/vitamin-supplements",
      "Title": "Vitamin supplements"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I've been told I can take a multi vitamin and vitamin D3 but that's all I'm taking now - just eat as healthy as you can without giving yourself a fibre overload! And drink as much fluids as possible especially on the chemo days. I was told to steer clear of powerful anti oxidants and echinacea. After chemo has finished then you can introduce those again, according to my oncologist",
      "MessageIndex": 5,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82094/vitamin-supplements",
      "Title": "Vitamin supplements"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Mine grew back during taxatere and is still growing!! It shouldn't all fall out again :-) I'm now 4 months post chemo and my hair is 3 inches long :-D xx",
      "MessageIndex": 1,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91569/when-does-hair-grow-back",
      "Title": "When does hair grow back?"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "It's definitely cumulative, my last tax was the worse but doable and I had watery eyes and the sensation you say on your tongue.  But I preferred the tax to the FEC as the tax didn't make me feel nauseas!  You will get thru it, keep hydrated and if you can, drink vita coco coconut water as much as possible as this resembles human plasma in the blood and helps keep you super hydrated, has all the vital electrolytes that the chemo steals from you, the coconut water will help flush the nasty ole tax thru  fast and I felt it def helped me lots :-) ",
      "MessageIndex": 15,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91836/is-the-third-tax-the-worst",
      "Title": "Is The Third Tax The Worst?"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hi Noodles, there are some amazing wigs out there - I actually prefer mine to my own hair! My head felt very tender about 3/4 days before it really started shedding, kinda like someone had grabbed hold of my hair and had dragged me across the room by it!! Ouch!!! But it's bearable,, just a sure sign it's on it's way out! Xxx",
      "MessageIndex": 15,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Fantastic! Mine were too and as my BC is the triple negative kind (fast growing, aggressive and unpredictable!) then the fact my nodes were clear means my chances of recurrence drop from 50-60% to 10-20% so I was happy too to hear that they appear to be clear altho I'll still have the sentinel node biopsy at surgery to triple check the triple neg! Really happy for you that they are showing clear for you Shaz :-) xxx",
      "MessageIndex": 10,
      "PostDate": "06/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82312/great-news",
      "Title": "Great News"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I've just got back from hospital, went in yesterday and had lumpectomy, she took 100grams of tissue, quite a lot as I wanted her to take as much as needed to and a bit more! I've had an uplift too on both boobs, she did this by cutting off nipples and moving tissue etc and making areole a bit smaller so I have no cuts underneath or down the middle if the boobs. She has made an incision under my armpit to reach the bides and took out only two. I'll get results on 22nd this month. Have to say I am over the moon with my new boobs! My friend had to go in again for further tissue to be taken out and that turned out to be clear, she's now doing chemo. I will be on edge now til the 22nd! Really hope the nodes are clear but if not I know I've got to back in again for auxiliary clearance but if that's what I have to do then I'll have to do it!! My hemoglobin has gone up which is great news as it was low before cancer and during chemo so I'm hoping the fact it's getting better is a sign I'm getting better! Xxx",
      "MessageIndex": 3,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86935/further-surgery-after-sentinel-node-biopsy",
      "Title": "Further surgery after Sentinel Node Biopsy"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hi I was diagnosed last June with triple negative BC and have had 3 x FEC, and 3 x taxatere, lumpectomy and maxoplasty, just 3 weeks of radio to get thru commencing later this month.  Ermionig gives great advice. Throughout my chemo I made it my priority to eat as well as possible focusing on plant based veg and salads, sweet potato and lots of fish. Cut down on dairy and sugar and cut out all processed and red meats. Drank gallons of water and discovered coconut water by vita coco during my last 3 lots of chemo which helped me loads. All my blood reports came back strong and liver and kidney reports were fab. Had Manuka honey every single day and didn't get one mouth ulcer. The last tax gave me a sore tongue but nothing too horrendous considering what can happen. I also took vitamin D3 every day and still do. Lemons also very good. Try and alkalise your ph as Cancer hates this environment and getting out and about if you can will help lots.     Everyone copes differently with chemo, I am not allowed herceptin or tamoxifen as mine was not hormone receptive. So basically all I have is good nutrition and regular exercise to reduce the risk of recurrence which is high within two years. My nodes were clear and i responded remarkably well to the chemo which almost obliterated the tumour which was 32mm but def grew from first diagnosis until first chemo. i think it's best to take one day at a time, you will get thru this and then look back in a couple of months and think \"what the hell happened!\". I felt very angry on and off during chemo, it def takes a toll on your emotions but they will settle down once you've got thru your treatment.    this group is fab, the ladies here are very supportive with lots of tips and advice that will keep us all focused xxx  ",
      "MessageIndex": 2,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88095/struggling-after-forth-chemo",
      "Title": "Struggling after forth chemo"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "My mother in law had BC 17 years ago with positive nodes and is still alive and well at the age of 69 :-) xxx",
      "MessageIndex": 6,
      "PostDate": "11/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80997/breast-cancer-remission-and-5-year-plus-survivors",
      "Title": "Breast cancer remission and 5 year plus survivors"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I agree! It's a very supportive site. We are blessed! X ",
      "MessageIndex": 1,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91568/this-is-the-best-bc-forum",
      "Title": "This is the best BC forum!"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Coconut water!! Replaces all your electrolytes and carries oxygen to the cells super fast. You'll feel better sooner. It's the bomb!  Vita Coco is the best and if you don't like just plain coconut then they have other mixed with either lemon or mango or pineapple. Over ice, suck thru a straw as if you're on holiday in the Caribbean! xx",
      "MessageIndex": 1,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96575/drinks",
      "Title": "Drinks"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "So sorry to read this, I am particularly interested in triple negative ladies experiences as that's the Breast cancer type I was blessed with. I'm surprised to read it's back after all those years too, but my oncologist did tell me it's a tricky little bugger :-(.  I really hope you don't have to go thru chemo again and they can get rid of the lump with just surgery and radio.  In the back of my mind I always think that two of the three things they give us are carcinogenic and do either of these trigger later chemo's, something we will never know I guess :-( .  ",
      "MessageIndex": 4,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88452/new-one",
      "Title": "New one!"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "It's a difficult one but having had the chemo myself and experiencing how horrible it is, makes you feel/look and the on going side affects years down the line (cyclophosphamide can cause secondary leukaemia!) and one of the ones I was given can cause secondary bone cancer, the risks are small they say but I don't think I'd have chemo again if I was given that choice. It messes with your DNA and goodness knows what else.  Yes I had a great response to it and yes it zapped my tumour (as I had it before surgery) and my nodes were not affected luckily.  I'm just not convinced that chemo is always necessary but that's just my opinion xxx I would stick with the hormone therapy tho to block the receptors that fed it.   ",
      "MessageIndex": 2,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91880/has-any-one-been-offered-the-choice-of-chemo",
      "Title": "has any one been offered the choice of chemo"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "I found my first tax hard going and went neutropenic so the last two were reduced by 20% which was much kinder to me but still vile lol. Well done Noodles, was thinking of you the other day and wondered how you were getting on :-) im almost 10 weeks post chemo and 3 weeks post surgery & feeling so much better, just radiotherapy to get thru now xx",
      "MessageIndex": 5,
      "PostDate": "29/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87588/5th-chemo",
      "Title": "5th chemo"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hi ladies! Well I've got thru 3 cycles of FEC - had follow-up mammogram yesterday and my tumour has shrunk from 32mm to 14mm! My Onco team are very pleased and I am over the moon. Still have to have the evil taxatere tho but I'm fully charged (with steroids!) and ready to rock!! 💪. I've supported my immune as much as poss throughout with using Manuka 15+ honey every day, a class of coconut water every day, water with fresh lemon, green and herbal tea, as many coloured fruits and veg as possible. Kept protein intake up. Supplements of multi vitamin and a vitamin D3 tablet daily. Used body shop coco butter on skin. Shellaced nails and toes and rested when body demands but done some light exercise too. Feeling nervous about tomorrow as it's the unknown but wanted to say thank you to everyone who has given their advice along the way. Night night ladies. Sleep well and keep up the fight xxxx",
      "MessageIndex": 0,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82575/taxatere-tomorrow",
      "Title": "Taxatere tomorrow! 😩"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Thanks Katie I'll keep you posted on how I get on! Yes, it's good to read what Jm has written re her tax experience, I just really don't want to feel nauseas anymore, think id rather bone ache! Plus I'm concerned with going neutropenia but what more can I do than I'm already doing! I've ordered a box of surgical masks from Amazon 😷 so will wear those a lot think! Lol. Oh and also I carry a handbag sized anti bac gel in my hand bag and use it all the time when I'm out and dab a bit under my nostrils too. (A tip from a friend when we had the swine flu epidemic and she never caught one cold the whole winter!)💪☺️ Xxx",
      "MessageIndex": 2,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82575/taxatere-tomorrow",
      "Title": "Taxatere tomorrow! 😩"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Thanks for sharing those tips!  The stress is the one I battle with as I'm surrounded by stressful situations and friends who are stressed but I'm trying to back off a little and keep myself to myself a bit more.  I'm already taking tumeric and have matcha green tea plus green magma every day (barley grass juice powder, similar to wheat grass) and a scoop of super green powder in my smoothie each day. The nutri bullet is the best investment I've made! please share any other tips as the thought of a recurrence fills me with sheer terror! xx",
      "MessageIndex": 23,
      "PostDate": "21/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91387/a-few-tips-from-my-cancer-survivorship-course",
      "Title": "A few tips from my Cancer Survivorship Course"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Altho I feel well enough to work in my 3rd week I would not risk it due to being in contact with general public - I work in a beauty salon so lots of risks of cross infection! I'm signed off for 6 months on SSP and will review as my radiotherapy will be 6 weeks solid after and I have no idea how this will affect me! The unknown is so horrible but I'm just taking it one day at a time atm xxx",
      "MessageIndex": 6,
      "PostDate": "02/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80532/wimp",
      "Title": "Wimp"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Hello maddog, I'm so sorry to hear you're so young with this diagnosis, it is such a shock, I'm 10 years older than you and still felt cheated! Mine is hormone negative, so different treatment to what you're having. I know what you mean when you say you feel as tho you've been in a bubble ever since finding out but it does sound as tho they've caught it early, mine is stage 1 but grade 3 aggressive which means it hasn't spread to lymph nodes but is very fast growing so I think I caught mine early too. No lymph node involvement is very positive so don't worry that it's spread, chances are it's still contained. My chemo has worked brilliantly so far, so don't be afraid if they suggest it for you, it's not pleasant but very doable, you'll have highs and lows and so will your hubby and loved ones. I think men find it hard to deal with, mine said he feels so helpless but he's very busy with his work as he is S/E, and I am fortunate to have a group of really amazing supportive friends around me. I didn't realise I was so well loved! I found it all quite overwhelming in the early stages and receive at least one bouquet of flowers a week, really am very blessed. This is why I have to kick it's butt! My two teenage sons have been amazing too. You'll find out who your true friends and family are over the next few months. This forum is great to chat to other ladies about any worries and fears. As for google, I'm always on there asking questions and we can scare ourselves unnecessarily! But the real- life answers on Macmillan, cancer research and cancer.org are the best for practical advise. I've not had my surgery yet and yes I feel nervous about it but can't offer any advice on that atm. I've never been under the knife before so I hope I don't get too freaked out. I think madwife has answered everything else, I hope you manage to have another baby in the future, I'm sure you will as lots of women do afterwards. Fingers crossed for you and pls keep us posted on how you're getting on xx jujuxx. And how wonderful to read that madwife is still here to tell the tale 12 years later!! That's given me a real boost today and I'm so happy all is well in your world madwife! X",
      "MessageIndex": 2,
      "PostDate": "14/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82764/newly-diagnosed-35-years-old",
      "Title": "Newly diagnosed :'( 35 years old"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Yesterday I had my last Taxatere. Can't believe I have made it thru, fingers crossed I'll be ok on this cycle, mustn't get complacent! Surgery booked for 7 weeks time so should be healing nicely for Christmas. My tips for ladies about to embark on this journey, it's doable! I was so terrified but with the help of this site I got thru it. I do honestly believe that diet and nutrition is key. On FEC, it's a bit more difficult as one can feel nauseas so just try and stick to a healthy eating plan but have what your body craves. If it's cake, have it. If it's fish and chips, have it! Keep super hydrated. Drink as much water as possible especially the day of and few days post chemo. I discovered vita coco coconut water half way thru my treatment, so by the time I got to taxatere I was drinking this as well and I am convinced it helped me so much. It flushes the chemo thru much quicker whist restoring essential electrolytes in your blood and carrying oxygen to your cells. Also, manuka honey every day. I have not had one mouth ulcer throughout the whole of my treatment. Drink green tea with freshly squeezed lemon in. Drink water with freshly squeezed lemon/limes in. Cut down on dairy and red meats but keep lean proteins up. Eat walnuts and almonds daily and as much fresh fruit as poss. Fresh figs are in season and a good source of alkaline which gets depleted by the chemo so it will take your alkaline stores to rebalance and this comes from bones teeth and nails. Vitamin D3 every day is essential for bone health. New toothbrush every cycle. Rinse with salt water twice a day and brush with soft toothbrush after every meal if you can. Take a hand sanitiser gel with you in your handbag and use when out in public, especially at supermarkets, dab some under your nostrils too and wipe along the trolly handles. I hope these tips help. My oncologist said to me yesterday that I've had a remarkable response to chemo and the tumour has now virtually disappeared. It's been a tough roller coaster ride but I've tried my best to be the one in the chemo car, riding it with MY hands in the air rather than it riding me! XXX",
      "MessageIndex": 0,
      "PostDate": "23/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84784/last-chemo-done-3-x-fec-and-3-x-taxatere-done-finito",
      "Title": "Last chemo done, 3 x FEC and 3 x Taxatere. Done! finito!!"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Thank you everyone! You've all helped me get thru this. Dreamthief deserves a medal, always there with best advice :-) and Jm you def helped me thru the worries of taxatere!! Xxx",
      "MessageIndex": 6,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84784/last-chemo-done-3-x-fec-and-3-x-taxatere-done-finito",
      "Title": "Last chemo done, 3 x FEC and 3 x Taxatere. Done! finito!!"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Good luck AliG58! You will be fine, it's doable and everyone on here has their own personal tips which we all draw strength from. Well done Dreamthief! I'm so happy you've been given a medal. Truly deserved ;-) xxxx",
      "MessageIndex": 9,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84784/last-chemo-done-3-x-fec-and-3-x-taxatere-done-finito",
      "Title": "Last chemo done, 3 x FEC and 3 x Taxatere. Done! finito!!"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Thank you aroma mum :-) - I'm suffering today tho! The taxatere bone and back aches are kicking in but hey, this is the last time so I'm powering thru! xxx",
      "MessageIndex": 12,
      "PostDate": "25/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84784/last-chemo-done-3-x-fec-and-3-x-taxatere-done-finito",
      "Title": "Last chemo done, 3 x FEC and 3 x Taxatere. Done! finito!!"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Good for you I'm happy to read you are having a well deserved break. J'adore Paris! Have been 3 times and loved every trip :-) xxx",
      "MessageIndex": 2,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84190/i-m-so-very-lucky",
      "Title": "I'm so very lucky"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Sending a huge cyber hug to you Alicemay, fingers crossed it's nothing sinister. Xxxx ",
      "MessageIndex": 3,
      "PostDate": "21/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91643/mammogram",
      "Title": "Mammogram"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "That's great! I have a few on my right eye but none on my left eye yet, but the hair on my head is coming back thick and fast, like a French crop now. I'm taking silica tablets now my chemo has finished as I read this helps promote nail and hair growth so fingers crossed my lashes will grow back ASAP! My eyes are very watery atm, had this last cycle which did actually improve by week 3 of the cycle so I hope it does as it's driving me nots this constant streaming eyes, worse when I go outside in the cold!",
      "MessageIndex": 10,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85409/an-exciting-day",
      "Title": "An exciting day!"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "Feeling the same!! Still have surgery and radio to go but just want it all done and feel fed up some days, it depends on how much sleep I've had. Do feel very tired very quickly but I have low haemoglobin so could be that I'm slightly anaemic. I feel as tho I should be bouncing back full of energy by now as it's been 3,weeks since my last chemo, I'd normally be taking my steroids now treaty for the next lot, they def gave me boundless energy for a day or two! Anyway, we will all get there in the end, as scary as it's all been we all cope in our own ways. Roll on next spring for me when I can have a new kind of normality in my life. Obviously nothing is ever the same again after you've had this thrown at you! Xxx",
      "MessageIndex": 11,
      "PostDate": "11/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85669/feeling-sad-and-angry-after-having-had-breast-cancer",
      "Title": "feeling sad and angry after having had breast cancer"
    },
    {
      "AuthorID": "JuJuxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jujuxx",
      "Content": "That's so great to read you are taking back some control thru your diet.  I did the same and made sure I had the best nutrition I could afford. Alll my bloods came back strong every time.  You have to do what you can for your body as it's taking such a battering from the nasty poison they give you.  I found drinking coconut water loads really helped me bounce back :-) xx",
      "MessageIndex": 4,
      "PostDate": "19/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91564/massive-improvements",
      "Title": "Massive Improvements!"
    }
  ]
}