{
  "AuthorID": "Jules1965",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jules1965",
  "Posts": [
    {
      "AuthorID": "Jules1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jules1965",
      "Content": "Hi Joanne  I started fec t on 1 February. I had no itching until day 12 and now loosing hair. I did try the cold cap but my hair is thick so at the moment it seems to be at the nape of my neck.  How have you found your first round?? I was totally wiped out for first 5 days.appetite, taste all went, energy and heartburn.  Ended up in hospital for iv antibiotics but feel post chemo now ready for next one on Thursday. Saw oncologist yesterday and given omeprazole and cordysol for sore mouth. Take care Julia x",
      "MessageIndex": 6,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150207/itchy-scalp",
      "Title": "Itchy Scalp."
    },
    {
      "AuthorID": "Jules1965",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jules1965",
      "Content": "Hi Just been going through pages as I didn’t have anc results until 8 Jan. I had lumpectomy and sentinel node biopsy in nov 2017. Cancer lump removed and 3 nodes removed 1 of which was cancerous. I had anc just before Christmas and had results on Monday. 3/10 were cancerous so total of 4/13. I had an appt with oncologist on Thursday! So quickly and yes like yourself I’m HER2 positive and estrogen positive and was told I was complicated. It’s been a whirlwind since with appts this next week for bone scan, flu jab, ct scan and heart scan. The oncologist was lovely realistic and caring and even though I know Ive a  long battle ahead I felt a lot happier after our appt. my motto is onwards and upwards. I hope all goes well xx",
      "MessageIndex": 16,
      "PostDate": "14/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146297/her2-and-er-positive",
      "Title": "Her2 and ER positive"
    }
  ]
}