{
  "AuthorID": "julesp66",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/julesp66",
  "Posts": [
    {
      "AuthorID": "julesp66",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/julesp66",
      "Content": "Hi. I was diagnosed with breast cancer 10th October and had a simple mastectomy of one breast on the 20th they did a sentinal lymph nodes check at the same time and luckily, no problems there. On Monday I go for a PET Scan and then 3 or 4 courses of Chemotherapy starting next Friday, I am English but live in Turkey so I am finding the internet my 1st port of call for most of my questions as although the doctors speak English and I have some Knowledge of the Turkish language some things get lost in Translation, I have been looking for a group who can help with advise and hopefully here I have found it ! Anyway, I have been travelling to the nearest big Hospital for my treatment which is 3 hours away, but, I am worried how the Chemo will affect me, not looking forward to a 3 hour journey after the 1 st one, Would I be better staying at a relatives house for a few days  xxx Would love to know your experiences re 1st Chemo ",
      "MessageIndex": 0,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101254/hi-im-new-here-is-there-a-newbies-site-how-do-you-cope-with-chemo",
      "Title": "Hi Im new here is there a newbies site? How do you cope with Chemo..."
    },
    {
      "AuthorID": "julesp66",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/julesp66",
      "Content": "I will not be driving , I have a wonderful Turkish Partner who has been so supportive, I am having cyclophosphamide and something else I cant remember at the mo; I may be able to have the actual Chemo near to home Fingers crossed. the local hospital has a Chemo unit but not for diagnosis etc, ",
      "MessageIndex": 2,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101254/hi-im-new-here-is-there-a-newbies-site-how-do-you-cope-with-chemo",
      "Title": "Hi Im new here is there a newbies site? How do you cope with Chemo..."
    },
    {
      "AuthorID": "julesp66",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/julesp66",
      "Content": "Hi Yes a cyst is benign and not important unless its affecting your well being , I also last week during a routine scan was told I have a 6 cm lesion on my Uterus, they are not concerned unless it grows more, apparently it also showed on my Pet Scan 18 months ago, I have to have another scan in 3 months and they will just continue to monitor it  Go on holiday and enjoy yourself , it is so easy to get freaked out after breast cancer diagnoses. I know. Have a good time x",
      "MessageIndex": 2,
      "PostDate": "15/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135860/scared-its-spread",
      "Title": "Scared its spread"
    },
    {
      "AuthorID": "julesp66",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/julesp66",
      "Content": "Sorry about the missed spaces. My keyboard is playing up",
      "MessageIndex": 1,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109342/anastrozole-to-tamoxifen-then-letrozole",
      "Title": "Anastrozole to Tamoxifen then Letrozole"
    },
    {
      "AuthorID": "julesp66",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/julesp66",
      "Content": "Hiya all Hope you are all doing OK xxxx I vented on here last week about how bad I am feeling on Anastrozole,I have been taking it for 3 months but joint pains fatigue and depression were getting me down, I live abroad  and I am returning to the UK next week fo a family Wedding celebration. I went to see my Oncologist on Tuesday, and he has prescribed Tamoxifen for a month to helpme onmy holiday inUk and then I will try Letrozole, he says I will feel better on the Tamoxifen, Hasanyone gone through this route? I havent taken either for 2 days now as I am still getting extreme joint pains,I cant motivate myself to take the Tamoxifen, how long will the Anastrozole side effects last?  I hope someone can give me some idea, I will start the Tamoxifen anyway soon,I am too scared to take nothing for long",
      "MessageIndex": 0,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109342/anastrozole-to-tamoxifen-then-letrozole",
      "Title": "Anastrozole to Tamoxifen then Letrozole"
    },
    {
      "AuthorID": "julesp66",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/julesp66",
      "Content": "Thanks Everyone Found this where it lists Tamoxifen as one of the drugs that effect nails  http://www.breastcancer.org/treatment/side_effects/nail_changes Though its not listed on Tamoxifen sites as a side effect , will just look after my nails more carefully and hope it clears up  Thank you all for your replies xxx",
      "MessageIndex": 9,
      "PostDate": "23/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113737/nails-breaking-and-coming-away-from-nail-bed",
      "Title": "Nails breaking and coming away from Nail bed"
    },
    {
      "AuthorID": "julesp66",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/julesp66",
      "Content": "Hi I finished AC Chemo on Jan 26th this year and took Anastrozole for 3 months but gave up because of side effects. I have now been on Tamoxifen since May. Its been fine but just started noticeing my nails break very easy and my little finger nail has come away from the bed completely for two thirds down I can live with this but just wondered if anyone else has experienced the same, I havent had any trauma or injury at all to the nail ,Or could there be another problem, I think after cancer we tend to blame all ilnesses on it and the treatments for it",
      "MessageIndex": 0,
      "PostDate": "22/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113737/nails-breaking-and-coming-away-from-nail-bed",
      "Title": "Nails breaking and coming away from Nail bed"
    }
  ]
}