{
  "AuthorID": "JuliaF",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juliaf",
  "Posts": [
    {
      "AuthorID": "JuliaF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juliaf",
      "Content": "Macmillan do a really good booklet called 'Getting Travel Insurance' which will give you lots of useful info. If you ring them on 0808 808 0000 which is a freephone number, they'll send one to you. You should consider checking with your oncologist too - mine was not keen for me to go anywhere until my cycles were over! Then when I did go (two months into remission), I went without cover for my cancer because I couldn't afford the premiums I was quoted if they did cover the cancer! Good luck with this and hope you get to France. You deserve it! J X",
      "MessageIndex": 2,
      "PostDate": "22/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47357/travel-insurance",
      "Title": "Travel insurance"
    },
    {
      "AuthorID": "JuliaF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juliaf",
      "Content": "Hi Patricia It is a very personal decision whether you have the test or not but it will depend a lot on whether you have children. You already have cancer so will be monitored closely anyway so it may not be something you want to know just for yourself. As for me, I have ovarian cancer and my mother died of it, but there was no other close family history (not enough women!) and I never had children but I was asked if I wanted the test because of my mum. After counselling, doing the family tree etc, I decided to take the blood test in January because I wanted to know what the risk was of me also getting breast cancer. The test came back positive for BRCA1. Next step is to have breast MRI and then lots of talking as I think there will be some reluctance on the medics' part to even suggest risk reducing surgery while I am still so close to the ovarian cancer diagnosis and treatment - I am nearly 9 months in remission from that. And will I want the surgery anyway? Lots and lots of thinking to do. So, take your time thinking about it and get well first! Take care and keep talking to us. Julia XXX  ",
      "MessageIndex": 3,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49361/genetic-testing",
      "Title": "genetic testing"
    },
    {
      "AuthorID": "JuliaF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/juliaf",
      "Content": "Try not to worry - I understand it is more than likely that at least one cycle will be delayed due to counts being low. My last one was 10 days late! And I'm still here to tell the tale. Take care and your counts will be up again before you know it. X",
      "MessageIndex": 3,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49670/chemo-delayed-a-week-so-upset",
      "Title": "chemo delayed a week ..so upset"
    }
  ]
}