{
  "AuthorID": "Jump123",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
  "Posts": [
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi There.  I have just finished 6 months of chemo and have surgery booked for next Monday.  I am very nervous too.  I had sort of 'got used to' chemo and now this is something new.  I didn't want to do chemo first and I was keen for an op straight away and still would have preferred that as I am now really worried that I'm too scared to show up on the day.  Have lots of friends all volunteering to come around on Monday morning to \"escort\" me.  They are all lovely and I am lucky to have them. Good luck with your surgeon visit.  I am sure lots of other ladies will be able to help more than me.  I can only sympathise. xx",
      "MessageIndex": 1,
      "PostDate": "09/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113145/moving-from-chemo-to-surgery-august-sept-2016---join-me-here",
      "Title": "Moving from Chemo to Surgery August / Sept 2016 - join me here"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi There.  Started rads today and interview with nurse was alarming.  She launched into a spiel about skin reactions that included burns, blisters, open wounds and significant pain and said \"this is one time in your life when you should take as many strong painkillers as it takes to get you through\"  WTF!!!!!!!  I was a very reluctant starter and now terrified to turn up tomorrow.  Wonder if 1 session is considered therapeutic.",
      "MessageIndex": 0,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115443/rads---panic",
      "Title": "Rads - Panic?"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi All Have just finished 3 months of AC and nail on small toe has just lifted off.  Took nail varnish off and both big toe nails are half black.  Am on Paclitaxel next and this is listed as a side effect of taxanes but wasn't on AC list.  Anyone else lose nails on AC? Thanks Helen",
      "MessageIndex": 0,
      "PostDate": "02/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108673/nail-damage-from-ac-chemo",
      "Title": "Nail damage from AC Chemo?"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi All.  For me it has been really tough mentally cos that is always with me.  What I mean is the physical side effects which are crappy today may improve tomorrow.  In the meantime I can take all the drugs and take the edge off.  But how do you turn off your brain?  It helps coming on here and knowing that I am not alone and that we can still laugh at some things.  Cheers all have a good day. Helen",
      "MessageIndex": 6,
      "PostDate": "20/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108093/having-a-meltdown",
      "Title": "Having a meltdown"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi There,  I have posted the following question/comments in the Ask a Radiotherapist forum in response to the answers being given to people's concerns - basically there is nothing we can or will do to help and you will get over it.  Is this \"best practice\".  I would like to think that this attitude is not what people are experiencing when they go for treatment. Hi There.  I am due to have a lumpectomy in a few weeks and then radiotherapy.  I have already had 6 months of chemo.  I cannot see myself going through with the radio due to fear of skin burns and esophagus burns.  I find the answers given on here to people's genuine fears to be very unhelpful.  Why has nothing been done in the last 50 years to prevent appalling skin damage.  Why is it OK to say - in a few weeks you'll forget all about it.  What sort of professionals are answering these questions and why does the industry not seem to care overly much? I will look forward to my answer from the \"ask' forum.",
      "MessageIndex": 0,
      "PostDate": "27/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112495/question-i-have-post-to-ask-a-radiotherapist",
      "Title": "Question I have post to Ask a Radiotherapist"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Thanks everyone for your encouragement and support.  I also got a terrific response from the Ask about Radiotherapy site.  It is quite long but very helpful to me and hopefully others with similar concerns.  Cheers, Helen",
      "MessageIndex": 9,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112495/question-i-have-post-to-ask-a-radiotherapist",
      "Title": "Question I have post to Ask a Radiotherapist"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Had to copy and paste as I don't know how to link [edit by admin - here's the post in the Ask about radiotherapy area] Hello Jump123  Thank you for your enquiry.   I'm sorry to hear that you have found some answers unhelpful on here.  It is certainly never our intention to trivialise people's fears and concerns.   Rest assured, there have been many projects over the years looking into skin care and radiotherapy and there have been many changes made to practice and policies.   Basically, there is no way to prevent a skin reaction during radiotherapy - just in the same way that you cannot prevent the side effects you get from chemotherapy - but they can be delayed and managed with advice  from your treatment team.   There are a lot of 'horror stories' out there regarding radiotherapy burns. The first thing to clarify is that the skin reaction is not actually a burn. Yes, we often describe it as looking a little like mild sunburn, but it is due to the skin cells below the surface of the skin being damaged and then coming to the surface as we shed skin in the normal way, not a direct burn to the skin.   Secondly, treatment techniques have come on in leaps and bounds in recent years. Once upon a  time, people did suffer painful and unsightly reactions following radiotherapy but this is not the case any more.  Treatment techniques are designed to spare as much healthy tissue as possible and to minimise side effects.   Most people having radiotherapy following a diagnosis of breast cancer will have a mild skin reaction, where the skin gets pink, it may feel warm and can sometimes itch.  Some people will get more side effects involving bright redness, itching, and very occasionally, blistering of the skin.  This tends to happen mostly underneath the breast in the fold, where skin rubs together and it can be sensitive.   This is very much a worse case scenario, and it does not happen to everyone. Management for any of these reactions is based on alleviating symptoms and providing comfort whilst waiting for the skin to heal. Most skin reactions tend to peak towards the end of the treatment course and are often at their worst in the first two weeks after treatment has completed. The majority of skin reactions have significantly improved, if not resolved, by four weeks after treatment has finished. The advice we give patients, which is based on several years of research and learning, is to regularly moisturise the skin with any moisturiser of your choosing.  There are lots of products out there that claim to be  a 'wonder cream' but actually, there is no scientific evidence to prove that any one moisturiser is better than another. Keeping the skin in good condition will prevent the radiotherapy from drying it out and thereby minimise any potential reaction.   We would also recommend wearing a more comfortable, looser bra and loose cotton clothing and avoid extremes of temperature such as hot water bottles or ice packs on the skin.   If side effects progress, your treatment team can provide a cream to help with itching, and for the worse case scenario, dressings which soothe the skin and speed up the healing process.    To answer your concern about oesophageal side effects, it is extremely rare to have any issues with the oesophagus during treatment.  Again, treatment techniques have changed so much in recent years that sensitive structures are avoided with minimal risk of any reaction.  It must be extremely scary for you facing the treatment with the worries that you have.  Your oncologist will be able to go through things with you in minute detail. You can also call the the Macmillan Support line for further help and support on 0800 808 0000 (Monday to Friday, 9am-8pm).    You have come so far and managed to get through all of the chemotherapy - a lot of people on the Breast Cancer community page will tell you that radiotherapy is much more manageable compared to chemo. There are also lots of ladies, and men, on there that will happily share their stories with you of how they found the radiotherapy not as difficult as they originally anticipated.   It won't be something that you will forget in a few weeks, but most people find their side effects have improved in this period of time.   Believe me, your treatment team DO care about your well being and management of your potential reactions.  They are there to help you. I am aware I have written a fairly lengthy reply to you Jump123, but I really hope it has helped to alleviate some of your concerns mentioned.  Please do get back in touch with me if you want further clarification of any of the information I have given you or if you have any other concerns.  My very best wishes to you,  Kate",
      "MessageIndex": 10,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112495/question-i-have-post-to-ask-a-radiotherapist",
      "Title": "Question I have post to Ask a Radiotherapist"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi All.  Does anyone know why you lose your tastebuds?",
      "MessageIndex": 16,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi All.  I have had 3 of 4 AC chemo next one on Monday.  Then have 12 x weekly Taxol/Herceptin then surgery then radiation.  I am really stressing about the radio as I have very poor skin - slow to heal and tendency to keloid scars.  I am so obsessed about radio that I am about to give up on the whole thing.  Radio will make my outlook so much better and chemo has done a really good job.  But at the moment I cannot see a bright side.  My imagination is in overdrive.  I do have supportive family, friends and BCN but can't talk to them as they will think I am nuts.  Thanks for \"listening\",  Cheers, Helen",
      "MessageIndex": 0,
      "PostDate": "12/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107784/really-struggling",
      "Title": "Really struggling"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi Michelle.  I had doxyrubicin and have had an irritated bladder ever since.  The only thing that helps me is drinking lots of water.  I did not drink much water before and have to be very mindful to keep up fluids.  Hope you get relief soon.",
      "MessageIndex": 5,
      "PostDate": "09/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113106/chemo-side-effects-once-chemo-finished",
      "Title": "Chemo side effects once chemo finished"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi Haysie.  Sorry you have had second diagnosis confirmed.  My scans showed no spread which was fantastic news.  I will be having chemo first as Her2 plus inflammatory. Hope you are doing ok",
      "MessageIndex": 28,
      "PostDate": "16/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177630/cancer-for-a-second-time",
      "Title": "Cancer for a second time"
    },
    {
      "AuthorID": "Jump123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/jump123",
      "Content": "Hi there.  I got diagnosed yesterday with recuurence in same breasr. First time in 2016.  I am devasted but trying to take one step at a time.  Full body scan today looking for spread and results tomorrow.  Will really fall apart if i get more bad news",
      "MessageIndex": 19,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177630/cancer-for-a-second-time",
      "Title": "Cancer for a second time"
    }
  ]
}