{
  "AuthorID": "June Elaine",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/june-elaine",
  "Posts": [
    {
      "AuthorID": "June Elaine",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/june-elaine",
      "Content": "Hi Just to say I'm thinking of you and that I hope the op went well, have to say I stayed in overnight and was very happy to do so. Take it easy and if you are having FEC chemo get in touch and we can exchange notes. Looks like you will be having some hormone therapy whereas I'll probably move on to Hercerptin. But at the end of this dark tunnel the light is shining so just hold on to your hat! sending you healing, in love and light, June Elaine",
      "MessageIndex": 22,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34250/in-4-hours-i-ll-know",
      "Title": "In 4 hours I'll know..."
    },
    {
      "AuthorID": "June Elaine",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/june-elaine",
      "Content": "Hi after finding a lump on August bank holiday I went to the GP after aweek, I thought I'd pulled a muscle originally, but then quickly I was referred to hospital and saw the consultant who seemed to think it was just a cyst and had a mammogram one week and a biopsy the following week where I could see it was a black lump, I knew in my heart what it was anyway. After the nuclear medicine injection, which was in no way like a bee sting,  I had a wli and lymph node op back on 10-11-10, after insisting on going ahead with a planned holiday to see my sister who lives in North Cyprus. It only delayed the op by one week anyway. Currently I'm 1/2 way through 6 cycles of chemo, which came as a shock cos I was told radiotherapy only. So that is still to come afterwards. I finally get to see the consultant the end of this month before the 4th cycle and find out if i am HER2 positive as this was not hormone related. So if it is I then start a year of Herceptin after the radiotherapy, oh joy. I've been told I will have a CT scan before starting rt, has anyone else had to have this? I have to say that the op wasn't quite as bad as I had been lead to believe, although the strange pains were horrendous. The chemo has been not so scary as people tell you, if you think the worse you can cope with the reality. The worst is the tiredness and the queasyness and of course on FEC you do lose your hair, everything leaves you exhausted but it's not for long. Ihave to say the bald look actually suits me, so although I have scarves and a wig that needs a fringe trim I prefer to walk around in doors without. Scares the hell out of the postmen!!!!! anyway, all of you take care, its a dark road but its not so long, in love and light, June Elaine",
      "MessageIndex": 20,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/34250/in-4-hours-i-ll-know",
      "Title": "In 4 hours I'll know..."
    }
  ]
}