{
  "AuthorID": "justbeingnosy",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/justbeingnosy",
  "Posts": [
    {
      "AuthorID": "justbeingnosy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/justbeingnosy",
      "Content": "Hi there Jan,  I had terrible aches last summer with Docetaxel.  If you are able to get out and about and do some exercise walking, and push yourself through the pain of that, it really really helped me.  I am a keen walker, and I even managed to get up a few Scottish Hill in the middle of my treatment as we had a holiday planned and I was damned if I was going to miss it.  Just don't ask me how rough I felt during the walks but hey, I really think it helped move the drugs along and get me through to the next dose. Now I don't recommend anything as silly as that, but if you can walk a bit in the fresh air go for it, force yourself a bit and I hope that helps.  Maybe it was the endomorphins but it certainly cheered me up. Good luck, keep going you are nearly there!  Nicky",
      "MessageIndex": 7,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90305/aches-and-pains-with-docetaxel",
      "Title": "Aches and pains with Docetaxel"
    },
    {
      "AuthorID": "justbeingnosy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/justbeingnosy",
      "Content": "Gillywigs, no your life is not empty and worthless.  But I understand the statement and where the sentiment is coming from.  Can I turn this around a bit - because I'm going to be tough and say YOU need to take control.  I was diagnosed a year ago and for the first couple of days it was:  why me, cry cry cry, cuss, cuss, cuss, grumble grumble, cry a bit more..... Then I remembered my Mum who died of cancer fifteen years ago but lived with terminal cancer for over ten years after being 3 months to live.  She was phenomenal - so much more of a strong woman than I could ever be.  But reflecting on how she coped, made me realise I had to do some stuff as follows: I had to be positive, to help me and to help all my friends and my boyfriend cope.  If I could be upbeat and positive I found friends could cope - I think it was a case of \"phew\" from them.  Then they spent more time with me and didn't have to put on an act because they took me out of myself and made the cancer and all that goes with it feel more distant.  Do you have a hobby or activity you can throw yourself into?  I'm a keen hillwalker and yes that's been really hard this year but I have forced myself out to do moderate things and any hobby or pastime just puts the cancer in a box at the back of your head for a few hours.  And it has given me a sense of achievement.  Try something you have never done before, throw yourself into it - diversion tactics for your head really. Talk to strangers.  Do you know I have had more support and friendship from strangers than anybody - I think it is because they are not emotionally involved with you that they are more able to help.  Don't be afraid to tell people what you are going through - be proud of yourself for dealing with it (because you really can) Find a support group close to you and go along to it .  Have a cup of tea, a laugh, a cry, whatever.  Communicate it's really important. I can't help with the physical stuff of course, but if you are worried about what you are going to look like, oh I have so learnt that doesn't matter at all.  It's who you are that counts more than anything. Chin up girl, get a To Do list going for every day and tick something off.  Keep yourself motivated so that every day counts.  I hope I have helped,  with much love and concern and empathy for how you feel Nicky",
      "MessageIndex": 23,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90413/can-good-things-come-from-having-cancer",
      "Title": "Can good things come from having Cancer?"
    }
  ]
}