{
  "AuthorID": "Karen1908",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
  "Posts": [
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Thanks so much Rainbow Debs, I didn't know that, I know where I'm going tomorrow, straight to docs Xx",
      "MessageIndex": 3,
      "PostDate": "05/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126374/paying-for-letrozole",
      "Title": "Paying for Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Dreamthief,  thanks so much, I didn't realise this. I should've looked into it sooner but at least I know now.   Thanks again. Karen xx",
      "MessageIndex": 4,
      "PostDate": "05/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126374/paying-for-letrozole",
      "Title": "Paying for Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Zen, just filled the form in and left it for the doctor. Can't believe they didn't tell me! I read on here about knitted knockers and have since ordered one, it's great",
      "MessageIndex": 11,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126374/paying-for-letrozole",
      "Title": "Paying for Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Rach,  Thank you so much for all that info. That's a great help  Xx",
      "MessageIndex": 16,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126374/paying-for-letrozole",
      "Title": "Paying for Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi, can anyone give me a bit of advice. I'm currently on Letrolzole to put me in the menopause as my back was hormone receptive. I just picked up my prescription and was asked if I pay for my prescriptions, (I don't at the moment as I get tax credit) this is stopping soon and as I'm on Letrozole for three years at least I suddenly realised will I have to pay for the tablets. Thanks in advance Karen x",
      "MessageIndex": 0,
      "PostDate": "05/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126374/paying-for-letrozole",
      "Title": "Paying for Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi JustLittleMe,  thanks for replying, i think it's annoying when you don't get told. I'll nip to the docs tomorrow for the form. That's good that you can get an extension.  Good luck Karen x",
      "MessageIndex": 6,
      "PostDate": "05/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126374/paying-for-letrozole",
      "Title": "Paying for Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Rach, thanks for replying, I didn't know, but have been to the docs this morning and filled in the form, I can go and collect it  Monday. Take care  Karen x",
      "MessageIndex": 12,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126374/paying-for-letrozole",
      "Title": "Paying for Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Maggs, I too have suffered on these tabs. I was originally on Letrozole and came off them because of the pains in my hands. Getting up in the night I'm like a wind up doll. I was put on Anastrozole but oh my word, the pains in my hands are more painful (I think) just holding the steering wheel in the car if my thumb hits the wheel it's agony. My right knee feels like it's swollen a bit too as I couldn't even bend and raise it the other day. My only other option I was given at the start of my medication was Tamoxifen. I was 48 when diagnosed and I wasn't in the menopause but I've been thrown into now with the Zolodronic Acid injections. I'm not sure if they'll put me on Tamoxifen as the other two options were preferred. Before I swapped to Anastrozole I was given a week with no tablets at all and I couldn't believe how I'd just got used to the pain in my hands. I can't stay like this for the next 3-5 years it's like a nagging tooth ache that won't go away. good luck if you find something that helps. Xx",
      "MessageIndex": 2,
      "PostDate": "28/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134594/anastrozole-letrozole-joint-pain",
      "Title": "Anastrozole/Letrozole & Joint Pain"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Zen, I can't get over the amount of people suffering. I'm day one of nothing now until next week when I get Tamoxifen, to be honest with you I feel like I coped better with the chemo than these tabs as I knew when my bad week would be and how I'd feel. These are just 24/7 on your mind all the time. I will be filling in that yellow card link. Good look with everything, hope you get sorted xx",
      "MessageIndex": 27,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134594/anastrozole-letrozole-joint-pain",
      "Title": "Anastrozole/Letrozole & Joint Pain"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi all, I've given up on Letrozole and Anastrolzole. I was on Letrozole first and suffered with stiff joints in my hands, feet and elbows, moved onto Anastrolzole and I think it was a case of better the devil you know. My knee feels like it's stiffened and swollen and my right thumb always seems to lock at night, I wake through the night and as I move it its almost like it jumps of its hinge, so hard to explain but really strange to see. Spoke to my Oncologists nurse today and she said stop taking them, you can't have a quality of life like that for the next 5-10 years, so I'm going on Tamoxifen, I  know that has its side effects and she did mention thickening of the womb! but I think it's worth a go as the constant pain and stiffness in my joints just didn't let up, it was on my mind 24/7.  The amount of people that suffer with the tablets is frightening.  Lots of love xx",
      "MessageIndex": 12,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134594/anastrozole-letrozole-joint-pain",
      "Title": "Anastrozole/Letrozole & Joint Pain"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Aneesa1,  My diagnosis was the same as yours. I had 6months of chemo, started without a picc line but gave in in the end as it can be quite stressful on your veins whereas the nurse told me with a picc line the chemo is going into a main vessel which as she put it is like a quick flowing river so it absorbs the chemo faster. I had some iffy side effects, I tried to battle through and made it I found I was eating mints and skittles! To help with the taste in your mouth. I am also now on herceotin until August (3 weekly) I had a mastectomy end of November and now about to start Radiotherapy on Wednesday. Went for arm exercise yesterday and heard someone ring the bell to signal end of treatment. You will get there, it may seem daunting, but keep your chin up. I have found  this site really helpful, some great people. Take care  Karen X ",
      "MessageIndex": 11,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121610/her2-and-hormone-receptor-positive",
      "Title": "Her2 and hormone receptor positive"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi JustLittleMe, I'm a LSA in a school and have just started my phased return after chemo, mastectomy, radiotherapy. I've been off a year. I've been left to my own decisions as to how often I go in, which is good in a way but I could get used to doing mornings only. I've started on three mornings and next week will up it to four then I think I will do every other full day. I do feel guilty going home, plus people ask can you do things and I have to say \"sorry I'm not in this afternoon\" I'm finding that hard. I've got my OCC Health meeting on the 18/5 which considering I'd have been back in work 4 weeks can't see the point. You will be ok and it will be like you've never been off  pretty quick. I was surprised how my arm (affected side) ached, pulling open doors and using it a lot more than at home, but apart from that felt ok. Take it slow and increase it slowly.  Good luck Xx",
      "MessageIndex": 4,
      "PostDate": "06/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128266/back-to-work-anxiety",
      "Title": "Back to work anxiety"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Wynneth, It is a personnel choice and they are so hard to make. I had chemo first to try and shrink my tumour. This led me to believe I'd be able to have a lumpectomy but after 6 months of chemo although it had shrunk considerably I was told I'd be having a mastectomy.  If I wanted reconstruction straight away it would have been a trans flap but when I looked into that and read the leaflets I thought no, I've been through enough. I know  I wont be having reconstruction in the future, I've got used to how I look, it's still a shock sometimes when you get out of the shower and I start to cry but then you brush yourself down.  Good luck with your decision, you will make the right one for you. Take care  Karen X",
      "MessageIndex": 7,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Congratulations Londongal, well done. Your sound so similar to me. Time wise almost as well, I was Easter I'm just about to have the iv bisphosphanates, just had my 6th R/T and I mentioned an itchy rash I've got. Turns out I'm allergic to the pot of cream they give you. When I had my picc line in I was allergic to the plaster they put around that too Never mind! I hope your tooth settles down, there's nothing worse on a normal day than toothache but to have it as well as everything else! I'm trying to hang onto my nails too, finger nails all had ridges across almost as if it was one for each session of chemo, now they have snapped and split at all the ridges. Toe nails aren't great either. I think it'll be slippers in the summer ha ha. You take care Karen xx",
      "MessageIndex": 4,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122424/i-ve-finished-all-of-the-treatment",
      "Title": "I've finished all of the treatment!"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Londonlass, thanks for replying, my oncologist did write down tamoxifen and Zoladex together for name to look up but said those two in brackets (which was them) wasn't an option. Which I don't understand. I think I'm going to ring my breast nurse tomorrow. I'm having a dull ache as if I'm going to have a period, in which case my ovaries are still active but whether they kick in or not is another thing. She just said it was a personnel choice and depended on what was important to me! I replied with well obviously I don't want the cancer coming back but I know they can't guarantee that. Will see what nurse says tomorrow. Thanks again for replying",
      "MessageIndex": 10,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120981/choice-of-medication",
      "Title": "Choice of medication?"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "NHi, I'm new to the site and I'm just mooching round to see if anyone can help. I was diagnosed with breast cancer last April. I had 6 months of chemo, had a right mastectomy and lymph node clearance the end of November. I am about to start radiotherapy and go for my mapping on Wednesday. I went to see my oncologist last week and because I'm late Forties and I was still having periods, she doesn't know whether to put me on tamoxifen or if the chemo hasn't stopped my periods put me on Zoledex and Letrozone and throw me straight into the menopause (my cancer was hormone responsive)  to stop my ovaries.  I came away in a daze, having had the weekend to think, I think I'm going to choose the latter. I was wondering if anybody else has had this decision to make, or has anybody had any iffy side effects.  I look forward to meeting new people on the site. Thanks ",
      "MessageIndex": 0,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120981/choice-of-medication",
      "Title": "Choice of medication?"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Ronstar, thanks for getting back to me. It's so daunting isn't it. My oncologist said it depends what's important to me, so I said I'll go home and read up on them. She did mention the bone thinning and said if I chose that option I'd be having calcium for that too. I'm having herceptin  injections also. To be honest my periods stopped about June/July, I can't remember which, but I'm having that sluggish stomach ache you get about the week before your due on. My mum recently told me my nan was 56 when hers stopped. I just think if I can do everything possible to stop my body producing oestrogen then I'll have to do it. It was a hard enough decision to go for the mastectomy. My surgeon wanted to put me forward for a tram flap reconstruction, but oh my word when I read up on how they do that I thought no I've been through enough I've been separated from my husband for 3 years now and I thought if ever I meet anyone in the future, then they'll have to just love me the way I am now.  Thanks for replying",
      "MessageIndex": 2,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120981/choice-of-medication",
      "Title": "Choice of medication?"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Tray41. You have the same as me. I was 48 in August and up until then my periods were regular. My oncologist said she's not sure if they've shut down on their own. I would have liked her to say this is what we're putting you on, I'd have probably said \"ok that's great, thank you\"  I think it's all to do with patient choice now, but I'm hopeless at making decisions.  Hope you have a speedy recovery from your chest infection. Thanks for replying ",
      "MessageIndex": 5,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120981/choice-of-medication",
      "Title": "Choice of medication?"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Thanks for that Baki, I've tried to up my water intake today, I'll see how that goes. Take care Karen x",
      "MessageIndex": 6,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127077/don-t-think-i-can-cope-on-letrozole",
      "Title": "Don't think I can cope on Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Thanks Kargus, I mentioned it today to the nurse giving my Herceptin. I've got an appointment middle of May with the oncologists nurse, I did mention it last time to her but at the time I'd just had my zolodronic acid injection so I wasn't sure if it was that. I will speak to the chemist too. I'm back at work next week and I look more wrecked now than when I was having chemo I think. I stand up bent over then by the time I get to the other end of the room I'm ok. Happy days I will definitely see about a different brand.  Thanks for replying, Take care Karen x",
      "MessageIndex": 5,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127077/don-t-think-i-can-cope-on-letrozole",
      "Title": "Don't think I can cope on Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Morning guys,  has anyone got a bit of advice on the stiffness caused by Letrozole. I'm in agony with the joints in my fingers, they hurt so much, especially through the night (I presume because I'm not moving them much) I tend to wake up between 2-3 am then that's it I'm constantly spreading my hands open to keep my fingers moving. I don't think I can stay on these for 3 years.  Has anyone else had the same problem. Thanks Karen xx",
      "MessageIndex": 0,
      "PostDate": "17/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127077/don-t-think-i-can-cope-on-letrozole",
      "Title": "Don't think I can cope on Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Snowys Mum, That sounds interesting, I'll have a look at that. I can't cope with this for the next 3 years. Take care Karen x",
      "MessageIndex": 7,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127077/don-t-think-i-can-cope-on-letrozole",
      "Title": "Don't think I can cope on Letrozole"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Worried 2016, That all sounds great and positive. I've put myself forward for a moving on appointment at my local hospital. I will be back at work then so felt bad about having time off on top of my few appointments left. But I want to do the course so I'm making out the appointments are a necessity and not voluntary. I too had questions regarding my ovaries kicking back into action, I'm on Zoladex and Letrozole for three years so my oncologist said they would do a blood test to check in three years time. I can't believe that's it for three years, after having so many appointments it's scary when it comes to an end. I'm going back to work after Easter, I'll have been off for a year! Can't believe where time has gone. Look after yourself and here's to the new you x",
      "MessageIndex": 6,
      "PostDate": "18/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125145/appointments-and-courses-x",
      "Title": "Appointments and courses x"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi Violetblue, I was given the choice of tram flap reconstruction, (taking fat from my stomach) to rebuild my breast, the recovery time was much longer and I don't think I was up for this op. I originally didn't like the look of the mastectomy scar and being lob sided. I couldn't have implants as I am about to start radiotherapy. I came home in shock and googled pics of scars and did all sorts or research. In the end I thought d'you know what I've been through enough. I separated from my husband 3 years ago and the thought of ever meeting anyone new and showing them my battle scars scared me (I'm 48) I might not meet anyone but they'd just have to love me for who I am. I don't need my breasts anymore, my kids are grown up they've done the job there and it was killing me. So I opted for the mastectomy, I am still using my softie while I'm waiting for my real prosthetic. Yes the thought of summer dresses and low tops does make me feel a bit sad, but when my Macmillan nurse showed me pics even with someone with a swimming costume on you'd never have known. It is a personal choice and you will make the right decision.  Take care Karen1908 x",
      "MessageIndex": 13,
      "PostDate": "20/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121640/choosing-a-mastectomy",
      "Title": "Choosing a mastectomy"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi LondonLass, I'm exactly the same. My fingers joints are so sore. When I get up in the night I'm like a wooden doll who can't bend. I feel like I'm permanently stretching my fingers out. The inside of my elbows feel like I've knocked them on the desk.  (I'm not helping you am I!) in a way I feel like I'm not coping with this as much as the chemo as this is like a constant toothache that doesn't go, at least I had 1 good week out of 3 on chemo.  I spoke to my oncologists HCA and told her I wasn't coping on my tablets, as this is the second brand I've switched to. She said see how you go, usually give them two months at least to see if they settle down. ive got to have a wisdom tooth out now as well ASAP, they want to do it before my second biphosphate infusion in August. I'm worried about that now. Sorry I've not been much help to you. I hope the pain eases Xx",
      "MessageIndex": 1,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129892/joint-pain",
      "Title": "Joint Pain"
    },
    {
      "AuthorID": "Karen1908",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karen1908",
      "Content": "Hi LondonLass, I'm exactly the same. My fingers joints are so sore. When I get up in the night I'm like a wooden doll who can't bend. I feel like I'm permanently stretching my fingers out. The inside of my elbows feel like I've knocked them on the desk.  (I'm not helping you am I!) in a way I feel like I'm not coping with this as much as the chemo as this is like a constant toothache that doesn't go, at least I had 1 good week out of 3 on chemo.  I spoke to my oncologists HCA and told her I wasn't coping on my tablets, as this is the second brand I've switched to. She said see how you go, usually give them two months at least to see if they settle down. ive got to have a wisdom tooth out now as well ASAP, they want to do it before my second biphosphate infusion in August. I'm worried about that now. Sorry I've not been much help to you. I hope the pain eases Xx",
      "MessageIndex": 16,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129892/joint-pain",
      "Title": "Joint Pain"
    }
  ]
}