{
  "AuthorID": "KarenJ62",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
  "Posts": [
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hi MollyMoo My head was really sore too every time I touched it. Don't worry it does go and quite quickly. Once it starts to goit feels better. I've had 5 chemo doses now and have just a very fine sprinkling of hair...I'm looking forward to it growing back but it's not that bad.  I hope all goes well with your treatment. Take care.",
      "MessageIndex": 1,
      "PostDate": "31/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122444/tender-head",
      "Title": "Tender Head!"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Thank you for your post and all your others. I don't post much myself but am on this site many times a day and appreciate every word that everyone writes. It is so, so helpful. Just knowing everyone has bad days as well as good is sometimes enough to carry on the next few hours. Thanks again. Sending hugs.",
      "MessageIndex": 5,
      "PostDate": "16/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121471/now-i-know",
      "Title": "Now I know....."
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hope all goes ok today LondonLass, thinking of you. You've supported so many of us on this site , we all wish you well.",
      "MessageIndex": 29,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122180/have-to-be-honest",
      "Title": "Have to be honest....."
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Signed",
      "MessageIndex": 23,
      "PostDate": "04/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120669/petition-the-government-to-continue-kadcyla-for-breast-cancer-patients---sign-please",
      "Title": "petition the government to continue Kadcyla for breast cancer patients..."
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hi Charlotherapy. I had my third FEC through a cannula and my arm was sore, as if it was bruised. My latest side was 16th and I do find its feeling easier thank goodness as I was dreading having the next one. I'm still gentle with it when applying moisturiser though. I'm having three Taxotere next and its good to hear is a bit gentler. I didn't want my other arm used as I'm worried about lymphedema after my biopsy. Sorry I haven't got any advice but I do feel your pain xxxx",
      "MessageIndex": 11,
      "PostDate": "21/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120022/fecing-veins",
      "Title": "FECing Veins!"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hi badgerbam  Sorry to hear of your mum's news. I've had a very similar experience. I also had a lumpectomy and sentinel biopsy in September. Results showed that 1 of 4 nodes were involved so was told I should have chemo followed by another op to get the full margin plus full node clearance. Unlike others on this site my hospital haven't offered any more scans.  I have almost finished chemo now, final session due next Tuesday, and have an appointment to see the surgeon in April. The news that the cancer had gone to my lymph nodes was the biggest shock of this whole experience and I can fully understand you and your mum's worry. It made it seem so much more real as before that I felt I was so lucky to have caught it quickly. I think I was in so much shock I didn't ask many questions about my diagnosis and the consultants only seen to tell me a bit at a time! Chemo isn't pleasant but it is doable and this site is fab for support and tips to see you through it.  I do hope that that your mum feels better once she knows her treatment plan.  All the best to you both.",
      "MessageIndex": 5,
      "PostDate": "08/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122915/received-lumpectomy-results-2-sentinel-nodes-have-cancer---what-happens-next",
      "Title": "Received Lumpectomy Results, 2 sentinel nodes have cancer - what happens..."
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Same here. I've had the odd wobble but nothing major. I'm just really looking forward to the treatment being over. Never had a 'why me' moment, more of a 'why not me'. Who knows perhaps it'll hit me one day but for now I can put all fears into a little box and send it away. ",
      "MessageIndex": 2,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131730/abnormal-lack-of-feelings",
      "Title": "Abnormal lack of feelings?"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hi Whilst I can't add any more to the great advise you've had from invisible me and London Lass I just wanted to say I felt exactly the same. I had my first Docetaxel 2 weeks ago today and my aches are much less and that awful food hatred thing has gone. Just a bit of a furry mouth but everything I eat isn't \"slimy\" anymore. (Love that description by LondonLass). You're not on your own. I've got 2 more to go and I know I can do it. We can do this.",
      "MessageIndex": 4,
      "PostDate": "17/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121528/docetaxel-taxotere-aches-pains",
      "Title": "Docetaxel (Taxotere) Aches & Pains!!"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hi Tracey My GP prescribed SYLK which is a natural plant based moisturiser and is fine for me. I'm also ER positive and HER 2 . You can purchase it on line too but not sure about the high street as I haven't tried. Good luck....it's not nice is it.",
      "MessageIndex": 1,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125600/creams-for-vaginal-dryness-after-er-bc",
      "Title": "Creams for vaginal dryness after ER+ BC"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hi Ann Isn't it great to hear from so many of us running or doing some sort of exercise. I certainly think it helps to as long as you feel up to it. I ran a half marathon the day before my lumpectomy and then 2 weeks later I started running again. During chemo managed to do lots of walking but not running. I couldn't work as I'm a Teaching Assistant so all the walking kept me sane. I finished chemo mid Feb and am doing a half marathon on Sunday.  I just love the feeling of being able to run (i say run but it's just a nice jog really!). I'm really looking forward to being involved in an event again, this time I've got hubby and 2 daughters running with me.  Good luck and keep doing what you can but don't worry if you can't do as much as you'd like, you'll soon pick it back up again after chemo.",
      "MessageIndex": 19,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131420/any-runners-here",
      "Title": "Any runners here?"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Bet the Paris marathon was an experience. I did London 2 years ago and very tempted to have another go to raise money for my local cancer centre. I've got this half Sunday then the great north run in September and then I'll see how I feel!  Still having Herceptin injections until December. I really couldn't eat well during chemo and was surprised how sometimes walking would wear me out especially in the final 2 treatments. I have lost upper body strength which I suppose is understandable but hoping to build that up a little. Sometimes I can hardly open a jar and if I reach for something it really pulls.. Sounds like your as determined as me.",
      "MessageIndex": 22,
      "PostDate": "13/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131420/any-runners-here",
      "Title": "Any runners here?"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hi cocopops1 I know exactly where you're coming from. I remember thinking that I couldn't carry on. It seemed to last for ever. The horrible taste in my mouth, not looking anything tried to eat. But that part sounded so trivial when I told other people. I cried. This was all day 4-6. After that I did start to feel better and the last week if almost forgot how I'd felt and went to the third FEC thinking I was getting closer to the end.  I had my first tax 3rd Jan. Some parts feel the same. Same horrible taste I'm afraid and it seems to last just a little longer to go but now on day 9 and I can see light at the end of the tunnel. I do have the pains in my legs and back though that I was warned about. I'm having to take paracetamol at night to sleep but other than that is been doable. It seems so horrid at the time and I hate the thought of all those chemicals in my body but as others have said its helping us and that's what we have to remember.  Good luck and really hope you feel better soon.",
      "MessageIndex": 5,
      "PostDate": "11/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121144/fec-cycle-2-feeling-terrible-sorry",
      "Title": "Fec cycle 2 feeling terrible (sorry)"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Thanks LondonLass. I run a couple of half marathons every year but most people are surprised when I tell them this is my goal. I think I just needed to think of a future when I'm feeling normal. I'll let you know when I start training. I've already got a nurse at my chemo centre to do the Great North Run with me next year for the unit.  xxxxx",
      "MessageIndex": 7,
      "PostDate": "20/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119993/two-thanks-and-a-wish",
      "Title": "Two thanks and a Wish..."
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Thank you LondonLass  for your lovely positive comments.  I too have found much support from this site. I check it out every morning before I get up and I realise I'm no different from so many others. Having breast cancer and half way through chemo (I've had 3 FEC-T so far) has made me really appreciate the beautiful family and friends I have. I know it's a bit cliche but perhaps Christmas has made me a tad more sentimental than usual! I'm missing school (TA in a reception class) but I'm so grateful that I have a chance to get back there again next year. I wish everyone a very Happy Christmas and a peaceful positive new year.  I have a plan to run the London marathon 2018 ",
      "MessageIndex": 1,
      "PostDate": "20/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119993/two-thanks-and-a-wish",
      "Title": "Two thanks and a Wish..."
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "I'm another one starting RT in May too. Got an op to clear margins on Monday then should start 5 weeks later. I was so worried about chemo that RT has been pushed to the back of my mind but now it's getting closer I am wondering what side effects I'll get.  I haven't gone back to work yet and have been wondering when to. I don't really want to go back then have to go off again during RT. I'm TA in a reception class. School aren't expecting me back until RT is finished so I suppose I should relax and make the most of it but it's so weird as I've only had one day of in 16 years in this job.",
      "MessageIndex": 32,
      "PostDate": "06/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126095/april-breast-cancer-chemo-club",
      "Title": "* * * APRIL Breast cancer chemo club ****"
    },
    {
      "AuthorID": "KarenJ62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenj62",
      "Content": "Hi Jackie I too had a similar dilemma earlier this year. After a sentinel node biopsy 1 node was found infected and I was told that after chemo, a given because I was HER 2, I should have a full node clearance. This was just usual procedure at my hospital. But when I questioned it with the surgeon and oncologist both seemed happy with my decision to have radiotherapy instead. I read up a lot and although I could understand both for and against arguments I knew deep down that I didn't want the surgery. I do not regret my decision and the whole area feels fine now (radiotherapy was in July). All the best with whatever you decide.",
      "MessageIndex": 3,
      "PostDate": "19/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140457/axillary-clearance-or-radiotherapy-what-to-do",
      "Title": "Axillary clearance or radiotherapy, what to do??"
    }
  ]
}