{
  "AuthorID": "Karenandnat",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenandnat",
  "Posts": [
    {
      "AuthorID": "Karenandnat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenandnat",
      "Content": "Thank you so much for your support and advice, it's all a bit of a blur and can't really believe it's happening, but we are supporting mum and going to appointments with her. I live about 2 hours away but thankfully have the flexability to be with her, so spending the week with her next week to support her before, during and after surgery. Just dont know what to expect after the surgery and am worried she might have an allergice reaction to the Radioactive dye them will inject on Tuesday. So fingers crossed she doesn't and everything goes to plan. xx Thank you xx",
      "MessageIndex": 4,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68092/mum-just-diagnosed",
      "Title": "Mum just diagnosed"
    },
    {
      "AuthorID": "Karenandnat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenandnat",
      "Content": "Hi Cath So so sorry to hear you and your mum are on this horrible roller coaster and thank you for taking the time to reply. I understand how difficult it is when you don't live local, I am also aboutn 2 hours drive away, however so far have been lucky enough to have the freedom and flexability to be able to be with mum, so taking next week off too so I can support her before, during and after her op. Not sure what to expect after and hoping she doesn't react to the radioactiove dye they inject beforehand! But your words of advice are welcome and yes I am sure it is starting to get tiring everyone asking how she is, will remember this. It's helpful to know that you are not alone of this awful journey, albeit you would never wish this on anyone, but I suppose as it's all so new you do feel alone, and I am sure you are right once we know fully what we are dealing with and have a plan, hopefully it will be easier for us all and most of all for mum. Thank you, thank you, thank you. Big hugs back at you xxxxx",
      "MessageIndex": 6,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68092/mum-just-diagnosed",
      "Title": "Mum just diagnosed"
    },
    {
      "AuthorID": "Karenandnat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenandnat",
      "Content": "Hi all Wow you are all such amazing people and so brave and strong and I hope that I too can be brave and strong as I am not at the moment. My  mum was diasgnosed with breast cancer, grade 3 invasive cancer on Wednesday, next Wed 11th Dec she has surgery to remove the lump and some of the Lymph nodes, then we have another anxious wait to get the full prognosis. On a rollercoaster ride going from stong to angry and then in floods of tears and what gives me the right, it's not even me going through this. This is just a scarey time, don't really know what else to say, but Awww this hurts so much! Thanks for your inspriational stories and honesty. xx",
      "MessageIndex": 0,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68092/mum-just-diagnosed",
      "Title": "Mum just diagnosed"
    },
    {
      "AuthorID": "Karenandnat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karenandnat",
      "Content": "Dear Marg Thank you so much for your kind words and advice. I am sorry you are also experiencing this, but thank you for caring and replying. Fingers and everything else crossed for you, your family and my mum xxx",
      "MessageIndex": 5,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68092/mum-just-diagnosed",
      "Title": "Mum just diagnosed"
    }
  ]
}