{
  "AuthorID": "Karriedee",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karriedee",
  "Posts": [
    {
      "AuthorID": "Karriedee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karriedee",
      "Content": "Hi Frances, I had a lumpectomy in October plus axillary node clearance and the pathology revealed 17 out of 19 nodes tested were cancerous. My tumour was also twice as large as first diagnosed and I have to have further surgery, but this will not happen until I have completed chemotherapy and before radiotherapy. Personally,I would have preferred to get a second operation now, rather than wait for six months. I hope the second surgery went well for you and that you do not have a lot of problems with the lymph wound. I  have found that more problematic than recovery from the lumpectomy.I am still getting the lymph wound drained, due to a haematoma, and today my first chemotherapy session was cancelled due to a possible infection in the lymph wound.  Let me know how you got on. Hugs x",
      "MessageIndex": 6,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66700/further-surgery-for-wider-margins-and-more-lymph-nodes-to-be-removed",
      "Title": "Further surgery for 'wider margins' and more lymph nodes to be re"
    },
    {
      "AuthorID": "Karriedee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karriedee",
      "Content": "Hi there and welcome, I had  my first session of FEC ten days ago and am due 3 more  followed by 4 docetaxel. I found the first week or so quite hard, as  I was barely sleeping and felt quite sick a lot of the time, but I had a good night's sleep on Wednesday and have had two quite good days now. That has perked me up again and  made me realise I can get through this ok, which I was beginning to doubt. I went for an aromatherapy massage today, provided by an amazing charity in my area and that really helped me to relax. I think you have to just concentrate on one day at a time and be good to yourself. Hope you are feeling ok and best wishes to you for your trteatment. Karriedee",
      "MessageIndex": 5,
      "PostDate": "13/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68377/2-days-into-chemo",
      "Title": "2 days into chemo........."
    },
    {
      "AuthorID": "Karriedee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karriedee",
      "Content": "Hi there Busymum. Thanks for your reply. After my 8 sessions of chemo I have to have a small second operation as they failed to get  the wide margins from the lumpectomy and then will have the radiotherapy.Mine is also vascular invasive  but with extensive spread into my  lymph nodes, which were all clearded. After the lymph node  biopsy  I had  the full range of ct scans as part of the staging diagnosis and then a further  MRI scan on my liver as there were two suspicious sites, but luckily they were benign. I think that is why I am having 8 chemo sessions, but I am going to ask more about that the next time I am at the hospital. I agree with you, once you know it is cancer, you want to get as much information as you can, that is certainly how I saw it. Hope you are doing ok, Karriedee",
      "MessageIndex": 19,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68377/2-days-into-chemo",
      "Title": "2 days into chemo........."
    },
    {
      "AuthorID": "Karriedee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/karriedee",
      "Content": "Hi there, I had a tooth extracted before I started chemotherapy and the chemotherapy was delayed by a week so it was eleven days  healing time in total.  Hope this helps, Karriedee",
      "MessageIndex": 2,
      "PostDate": "12/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70036/chemo-therapy",
      "Title": "chemo therapy"
    }
  ]
}