{
  "AuthorID": "kathleen37",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
  "Posts": [
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thank so much everyone! Lesley - thank you as all your information is excellent, really helpful.  I'll update with the results.  THanks again, really, really appreciated.  xx",
      "MessageIndex": 4,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165165/hello",
      "Title": "Hello!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Evening all! Biopsy results and surgery planning this morning.  Surgery for 20th Aug or 3rd Sept (depends on radiologist consultant availability as have to do the wire procedure before surgery starts) So, lump is just under 3cm, but turns out I have spots of calcification around the lump, up to 10 cm away, mainly under the nip, which means it has to go.The surgeon is going to do a therapeutic mammaplasty, which basically means he's reducing the size of my boob and using the extra breast tissue to reconstruct it. At the same time, he'll do a standard reduction on the other side so I'll then have small boobs!!! He said about fannying about doing a nipple reconstruction and I said not to bother as I'll get one of those excellent medical tattoos. He showed me photo's of the op and how he's hoping it should look, and if he does what he's already done on other people it will look pretty bloody good!! Small boobs!! (He also explained that he may have to go back in, depending on biopsy results etc. ) Biopsy showed lump is hormone reactive - both oestrogen 8/8 and progesterone 7/8 allred score. Lymph nodes showed no signs of cancer, but are reactive, meaning at least a few will have to come out (wire/blue ink before surgery to show which ones are linked to the tumour) They'll be biopsied after surgery, along with the lump. Depending on further biopsies during surgery, will depend on whether I have to have radiation therapy and/or chemo or neither. Finger s crossed neither!!! (though I sort of got the feeling he thinks I may have to have radiation as he mentioned every day for 3 or six weeks) I'll also need the oestrogen/progesterone meds for a min of 5 years.  I also told my Mum and one of her sisters. (I may as well have put it out on the national radio) but that's fine, as she's coming to look after Mum while I'm in the hospital - which will hopefully just be a few days. I should hopefully have some help afterwards too.  So - I'm feeling fine. Really, really hoping no chemo/radio but whatever. One of the nurses was explaining the risk of Lymphedema (she measured my arms) so hopefully won't get that either.  I'm feeling fine about everything at the mo, so all good.  I've not been posting much, but have been reading lots and everyone is so lovely here. Feel at home already! Thank you1 xxx",
      "MessageIndex": 7,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165165/hello",
      "Title": "Hello!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Looks very impressive. Is that where you had yours done, Helen? I'm going to have the tattoo, but am currently researching best places. The place you linked looks excellent!",
      "MessageIndex": 5,
      "PostDate": "31/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170711/breast-tattoo",
      "Title": "Breast tattoo"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Hi guys,  I had the triple assessment on Tuesday afternoon (week wait after GP visit so thought that excellent!) Mammagram, ultrasound then biopsy.  Radiologist confirmed not a cyst and very dense lump. She was also concerned about lymph node on same side (right) so I had x3 punch biopsy on both lump and lymph node.  Speaking to surgeon after, he told me I had cancer. I asked how they were sure lump wasn't a fibroadenoma and he said that the consultant radiologist was very experienced and had confirmed it was a tumour. He said I would need surgery but not necessarily chemo etc - that and type of surgery depends on biopsy results.  I wasn't sure if it would be ok for me to post, as though an ex pat Essex girl, I'm living in Ireland now. Biopsy results for me will be two or 3 weeks.  I haven't said anything to anyone in real life yet (I've spoken to a few online friends, and friends in the US) but until the biopsy results come back, not really worth saying anything.  My main concern is that I live on my own with my 80 year old Mum. She had a stroke at the beginning of the year and I needed to give up work as she needs to be supervised. There is some family nearish who I hope will be able to help out when I have surgery, Anyhoo, wanted to say hi, as I know I'll have some questions when the biopsy results come through. I was thinking of printing off some of the NHS stuff, about stages etc so I would have something to ask (and a pen and paper to write stuff down!) when I go for my results appointment. I should google to see if there is a list of stuff I should be asking.  Good thing is that I'm feeling fine - it's been a funny year with Mum's stroke, and then my brother (lives in the US) had a tumour on his kidney a couple of months back and had his kidney removed. All good news though, as Mum is recovering well from the stroke and my brother has the all clear from his kidney tumour; no spread so no chemo or anything!! Yay!  Fingers crossed it will be the same for me. It looks to be a great place here.  Thank you. x",
      "MessageIndex": 0,
      "PostDate": "29/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165165/hello",
      "Title": "Hello!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "If it's any consolation, the bit I took from what I posted above is there aren't any definite lines, so no one is going to be able to say either way. For me, I think if I had a score so close to the low re-occurrence, then I would be considering no chemo. However, everyone is different so the considerations for me will be different to yours. I have no kids for example. I still have a few weeks before I get my results. I also wonder if those scores posted above are the standard, or if different medical communities look at them in different ways?  Hopefully, someone with more knowledge than me will be along with their thoughts.  At least tomorrow, I hope you can forget this crap and have a FANTASTIC birthday!!!! I hope you have lots of gin and cake! Happy Birthday! k xxxxxx",
      "MessageIndex": 3,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/167087/oncotype-dx-test-unclear-as-what-i-should-do-next",
      "Title": "Oncotype dx test unclear as what i should do next :("
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Hi Nicole,  I was diagnosed about 4 or 5 weeks ago now. (Had surgery last Monday week) I'm a crier, but for some reason this just hasn't done it for me. I have no idea? People keep saying I'm so brave, but I think you're only brave if you have a choice so brave I absolutely am not.  People are also saying I'm in delayed shock, but I actually am feeling fine. I'm not angry, though obvs cancer can eff the eff off, or really scared or much of anything really. It's just a huge annoyance that needs dealing with. Honestly? I have other shit I have to deal with too so perhaps that bit about not being angry may not be completely true!!!  hahah.  Everyone here is wonderful. I've learnt so much and people have been so kind with some of my questions. A real community.  Know that there will be someone here to support you whenever you need it.  Take care of yourself.  xxxx",
      "MessageIndex": 6,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/167029/someone-to-talk-to",
      "Title": "Someone to talk to"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "I'm having the Oncotype test, and this is the information I've so far been given www.cancer.ie/.../oncotype-dx-test \"What does my recurrence score mean to me? The recurrence score can predict how likely it is that your cancer will return in the future. Recurrence scores are grouped into 3 categories according to your risk of disease recurrence: low, intermediate and high. It also helps to show how effective chemotherapy will be for you. This means that your recurrence score can help you and your doctor decide on the best treatment for you. Low recurrence score (18 or less) If your recurrence score is low, this means that there is a low chance of the disease coming back. It is unlikely that you will need chemotherapy but you will be offered hormone therapy. Intermediate recurrence score (between 18 & 30) If your recurrence score is intermediate, this means that there is a moderate chance of the disease coming back. You will usually be offered a choice of chemotherapy plus hormone therapy, or hormone therapy alone. If your recurrence score is intermediate, it can be unclear if you need chemotherapy or not. This is often when the decision is hardest to make. The decision will most likely depend on your actual score and whether it is on the low or high end of this range. High recurrence score (32 or more) If you have a high recurrence score, this means that here is a high risk or higher chance of the disease coming back. On the positive side, it also means that chemotherapy will work more effectively for you. You will most likely be offered chemotherapy and hormone therapy.\" I too would be interested in what the other guys have to say All the best xxxx",
      "MessageIndex": 1,
      "PostDate": "29/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/167087/oncotype-dx-test-unclear-as-what-i-should-do-next",
      "Title": "Oncotype dx test unclear as what i should do next :("
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "I'm still waiting to hear when it will start. I've had my (2) pre meetings, had my mould done, x2 lots of tattoos.. I'm having 20 days worth so I hope all over before Christmas! Surgery happened so quickly (august) this just seems to have been dragging out... Also, has anyone any thoughts on the using cling film to cover the cream? I have the R1 and R2 and the first one says to go on straight after treatment. I'm an hours drive from the hospital, so I thought if I could at least cover it still I got home, would save wasting it by getting it on my clothes on the drive home?",
      "MessageIndex": 29,
      "PostDate": "26/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thanks very much. I think if i had a date I'd be better, but they have only phoned me so far to go in, so I'm a bit itchy, wondering if \"today will be the day\"... I should try and find out a phone number for them and at least ask? They did say all would be over before Christmas, but having looked at the calendar, with 20 sessions that won't be happening... It's sad that they're so busy...",
      "MessageIndex": 44,
      "PostDate": "29/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Just had a phone call to say treatment starting 11 oclock on Tuesday! See you all in the Dec thread!!!",
      "MessageIndex": 47,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "One of the guys from the radiology department phoned me back this afternoon as I'd mentioned that I would need to bring my Mum with me for appointments (I care for her full time as she has dementia) and I was a bit concerned about her wandering off. She said that they have all had \"dementia assistance\" training, and they were making arrangements for someone to stay with my Mum when I was having me treatment. She was so lovely she made me cry!!! Anyhoo, I'm so grateful. I must admit, I was obviously more nervous about my Mum than I thought and I feel so much better after that phone call!!! Mum had a stroke this year and hates, hates hospitals, and she gets agitated if she can't see me. I'm actually at a cancer centre for the radiation (in the UK/NI - my surgery was in Ireland - something else which I'm PRAYING won't be affected by Brexit...) but it doesn't really look like a hospital, the waiting area has huge windows looking out onto gardens, as well as a grand piano - so I'm hoping Mum will be ok. ",
      "MessageIndex": 51,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Actually, I've just asked the question to the R1/R2 people on facebook. I'll update when I get a reply x",
      "MessageIndex": 30,
      "PostDate": "26/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "(I forgot to say - I had to fly last week and when I was at the airport, I got speaking to one of the security ladies, and said about the clips and asked if she could use the wand to see if it would pick up anything. Nada. Nothing. Just thought I'd mention it...)",
      "MessageIndex": 41,
      "PostDate": "29/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "quick update.. Had to wait 2.5 hours for the machine to be fixed, then went in and spent another hour and 15 mins getting setup again, and then a body cast/mould made (3rd time lucky) More tattoos.  Reason I was called back was that original scan was too close to my liver so they redid me. (\"You have two lungs and only one liver!\") I was chatting with the 4 techs and asked what were they aiming for, bearing in mind I didn't have a CT scan before surgery, and now tumour is gone and boob reconstructed. How do they know what they were aiming for? They said that during surgery, tiny metal clips were inserted at tumour site, so they were what the CT/eventual raidation was aiming at.  I've never heard that before - is that common knowledge??? (still no date for when radiation starts - I'm getting itchy about Christmas.)",
      "MessageIndex": 13,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Hi guys. I had my planning appointment an CT scan a week ago. 4 weeks of radiation starting in 4 weeks time. EEkkk. They are hoping all finished by Christmas.  Got a phone call today to say they wanted me back in for another CT scan. They said not to worry could just be wanted different position or something.  Is this common would you's know? I've not actually had any scans (other than mam and ultrasound before surgery) so I did sort of wonder how they would know what to aim at? Any thoughts? Repeat CT's common? As ever, many thanks x",
      "MessageIndex": 11,
      "PostDate": "08/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Wow - I honestly had no idea about the clips. I'm flying next week, I might ask them to wave the wand over the boobage, see if  I bleep!!! You're right - so grateful for everyone here,  Thank you, gang.  xxxx",
      "MessageIndex": 17,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "The R1/R2 people came back and said they didn't recommend the cling film. Hey ho.  My second planning meeting (second CT/second lots of tattoos/body mould) was nearly two weeks ago now and I still haven't heard when I'm starting. My surgery was August, no chemo and they've told me I need 4 weeks and would be done by Christmas.  I guess I'm just getting twitchy.  Would it be usual to have the treatment so long after the surgery? ",
      "MessageIndex": 40,
      "PostDate": "29/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Really helpful thread - thank you!",
      "MessageIndex": 21,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165892/breast-cancer-spread-to-lymph-nodes",
      "Title": "Breast Cancer spread to Lymph Nodes"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Really helpful thread - thank you!",
      "MessageIndex": 6,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165892/breast-cancer-spread-to-lymph-nodes",
      "Title": "Breast Cancer spread to Lymph Nodes"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "I got 12 -YAY!! I'm more relieved than I thought I'd be. One thing though - I mentioned the TailorX results to both the Oncology nurse and the oncologist, and neither were aware of it.... I'm going to ask for a copy of the Oncotype results, as I'm sure it mentions the Tailorx study on there... Onco nurse is going to speak to the radiation people now, and I have appointment on Wednesday to discuss the hormone treatment. I'm guessing it will be Letrozole so I'm going to ask about brands and if they can put Femora on the script... I'm wondering if I should be asking about a dexa scan, to get a baseline on bone density. Is that usual?  As ever, thanks for thoughts/advice",
      "MessageIndex": 0,
      "PostDate": "27/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168784/oncotype-dx-results-back",
      "Title": "Oncotype DX results back"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thanks so much guys. You have to pay for a Dexa scan here, it isn't covered on the medical card, so I might just go ahead and give them a ring and get one booked in. Like you say, good to have a baseline.  Thanks, Lesley re the  Anastrozole. I wondered too about the differences (I was planning to print out the pages from here as they say they are the same thing) Good to know about Accord being for Anastrozole. I think I was leaning towards that as \"weight gain\" isn't listed as a side effect and I  really, really don't need to put any more weight on... So glad you don't get any SE with it. I'm so achy and stiff already, I'm really nervous about whatever they put me on THanks again.  xx",
      "MessageIndex": 3,
      "PostDate": "28/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168784/oncotype-dx-results-back",
      "Title": "Oncotype DX results back"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "I'm more than shocked by this scumbag's behaviour.  If not already a member, it would be worth phoning Unite, as they are a Union for the construction industry http://www.unitetheunion.org/how-we-help/list-of-sectors/construction/ They should offer support once you join if you're not already a member. Please phone them. I'm sure they would be horrified by this. You really need some support in regards the work situation. It's the last thing you need at this time.  Please take care of yourself xxx",
      "MessageIndex": 6,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/167099/potentially-stupid-question---chemotherapy",
      "Title": "Potentially stupid question - Chemotherapy"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "HI there,  I'm waiting confirmation of date for my surgery (dependent on radiologist availability) Either 20th Aug or 3rd Sept.  I'm having a therapeutic mammaplasty (first time big boobs have been a good thing!)  I'm having lumpectomy (will be losing nip too due to calcification under nipple) as well as having a couple of reactive lymph nodes removed. He said he'd do a nipple recon, but I said not to bother as I'll get a tattoo. Surgeon said depending on biopsy results, I may have to have further surgery (mastectomy) in which case he would use an implant. At the same time, I'm having a regular reduction on the good boob.  He showed me before and after photo's of patients he's worked on previously and I was a bit gobsmacked at how good they looked. The nurse was saying that there is some database the hospital was involved with where they take the before photo's and then the after pictures are uploaded and graded depending on how good the results are. She said that it was specifically to address inmproving cosmetic outcome of surgerys.  My main concerns are the biopsy results, and the removal of lymph nodes.  Fingers crossed all will be ok ",
      "MessageIndex": 10,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10810/advice-on-reconstructive-surgery-and-reduction-of-good-breast",
      "Title": "Advice on reconstructive surgery and reduction of good breast"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "I'm very over weight and surgeon advised to lose weight at fat produces oestrogen, and of course I'm oestrogen/progesterone  reactive.  Did lots of research (so I thought!!) and finally decided on the Michael Mosley Fast 800 diet. Read book, joined website, and am  also a member of a facebook group. It's a very low carb, though not a no carb diet.  Tonight, someone posted the following:  \"that going low carb can give you a huge boost of estrogen to begin with \" I started the diet two weeks ago, and last week stopped taking my Letrozole due to side effects (oncologist directed - to stop taking it for another week before starting Exemestane ) Has anyone heard of this? I'll try phoning the Breast Care Nurse (she will have no idea - she didn't know what a stitch abscess was) and the Oncology Nurse (I'm a bit scared to phone her as she's very busy and a bit terse and I've only just spoken to her about the Femera side effects...I asked her if I could email as she's so busy and it's hard to get her on the phone and she just said \"absolutely not. We don't use email for patients due to confidentiality...) Has anyone heard of this? For some reason it's really worrying me, my head's spinning at the min and I don't know who to ask, especially as I don't know when I'll get to speak to the Onco nurse. As ever, I would really appreciate anyone's thoughts.  Thank you so much x",
      "MessageIndex": 0,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178368/guys-in-a-bit-of-a-panic-regarding-diet---of-all-things",
      "Title": "Guys, in a bit of a panic regarding diet - of all things!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thank you. I'll head off and have a read of the links you've posted.  I'm so ticked off. I've got the rage that I'm on any diet to be honest. It just seems every which way I look - I do something to try and improve my chances of no cancer re occurrence, and I get a kick for it.  The Fast 800 is defo not a keto diet, but it is low carbs. It's very similar to the diet which can reverse type 2 diabetes and is generally recommended for people that have a lot of weight to lose (me) After the initial 12 weeks, I'll be going on 5:2,  with the two days restricted to the 800 cals. Any diet which meant I would be going low carb long term, is not for me.  For me, this is just about losing weight to reduce my oestrogen production by reducing my fat/weight. I haven't (unfortunately) seen any research proving any diet can \"cure\" cancer. My focus is trying to reduce the risk of mine coming back.  Thanks again",
      "MessageIndex": 2,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178368/guys-in-a-bit-of-a-panic-regarding-diet---of-all-things",
      "Title": "Guys, in a bit of a panic regarding diet - of all things!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "I do hope we can get a response, ursula2. I spent a while researching a lot of different weight loss diets, and up until this evening, was very happy with my choice.  I guess the panic is that I've stopped my Femera for a few weeks.  Fingers crossed we can find out. Now i've calmed down a bit, I'm wondering if the levels seen may be very low, as to have hardly any impact? As I mentioned, this is a short term (12weeks) plan.  I've asked the health care team there too, so will be posting their response. ",
      "MessageIndex": 4,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178368/guys-in-a-bit-of-a-panic-regarding-diet---of-all-things",
      "Title": "Guys, in a bit of a panic regarding diet - of all things!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thanks so much, guys. I'll do as you say, @ronstar and post the question there too. I have 5/6 stone to lose ( two of which went on during my radiation - no idea how that happened. I figured I was just too sedentary?) which is one of the reasons I chose this diet. No carbs is not an option for me long term. The book is excellent and although I've only been doing it for two weeks, it is really, really making me reconsider my food choices and understand the consequences of what I eat. Hopefully over 12 weeks that will imprint more, so when I'm back onto \"normal\" eating for 5 days a weeks, it will carry over somewhat. It is very focused on as much unprocessed food as possible, which I figure is only a good thing generally  I'm much calmer this morning. And logically, I agree that something so short term will most probably not have that much of an inpact.  Thanks so much guys - you've all been really helpful. I will post when I get a response from the Fast800 people.  Thanks again. ",
      "MessageIndex": 9,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178368/guys-in-a-bit-of-a-panic-regarding-diet---of-all-things",
      "Title": "Guys, in a bit of a panic regarding diet - of all things!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thanks puzzler. I've been off the Femera for a week now and my side effects have improved immensely - I hadn't really realised how bad they were, My hand is working again and I can walk much more normally now. Another med free week then EVERYTHING crossed that the new meds don't have the same SE's. x ",
      "MessageIndex": 20,
      "PostDate": "22/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178368/guys-in-a-bit-of-a-panic-regarding-diet---of-all-things",
      "Title": "Guys, in a bit of a panic regarding diet - of all things!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Haven't heard back from anyone yet. As expected, couldn't get hold of the onco nurse, isn't possible to leave a message. But, person that posted the original, turns out got it the wrong way round and very kindly posted where she misread the info from. Now, Fast800 is NOT a keto diet, but looks like panic over?  https://www.firstforwomen.com/posts/keto-diet-and-menstrual-cycle-164985?fbclid=IwAR3Ism45V_FnQeZJJ5g2Q-DYZoaXD830N00nf9RD1nJn5It7MyIqY-krxp0 Thanks again everyone. I really appreciate the help and no harm done. ",
      "MessageIndex": 15,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178368/guys-in-a-bit-of-a-panic-regarding-diet---of-all-things",
      "Title": "Guys, in a bit of a panic regarding diet - of all things!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "I wanted to add (as I'm telling everyone!) that for the first time, I've started aqua-robics. It's fantastic!!! I really, really love it! I'm not a gym person, but I've always enjoyed swimming, though  it can be a bit boring. (I love walking too actually, but I look after my Mum full time who has not too bad dementia and she can't come with me. She comes to the pool with me and sits in the armchairs with tea and snacks and I can see her and she can see me in the pool. It's working out really well) After my first 4 classes, a tip I've discovered - get into the deeper water if you can, as if you're very overweight like me, the water gives you much more support!",
      "MessageIndex": 12,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178368/guys-in-a-bit-of-a-panic-regarding-diet---of-all-things",
      "Title": "Guys, in a bit of a panic regarding diet - of all things!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thank you, Whatshappened. Turns out the original post was completely wrong. Person had remembered it wrong. I posted the link up above which shows the actual article which says the opposite. My bad for panicking. Apologies everyone.  ursula2. Fast800 is only appropriate for people that have a lots of weight to lose quickly - it is very similar to the diet that stops Type2 Diabetes. After the 12 weeks, I'll be moving to the 5:2 - which is eating normally 5 days - though healthily and then two days a week, continuing with the 800 calories.   I'd advise reading the book by Dr Michael Mosley. He also did the original 5:2 plan and is involved in the Type2 diabetes diet. Book  is very interesting. I actually did a lot of research before hand, and because although this is low carb, it is very much about eating as unprocessed/additive free food as possible. So for example, no low fat options are allowed, but butter, cheese is. No carbs for me was never an option long term. I'm finding the diet excellent as I'm eating stuff I like. And more importantly, understanding more about how the body reacts to different things (carbs) and making better choices for myself. I've also started aquarobics and I love, love it!!! (I can't tell you how pleased I am about that - you couldn't drag me into a gym) I've started 10 days ago and have lost quite a bit, but I have been doing the swimming two 3 times a week. And I have lots of weight to loose. First week weight loss is also probably mostly water.  So, for me, I'm happy and feel that I'm learning more than I ever had before about food and am really hopeful that this will lead to a better way of eating for me in the long term. The 12 weeks will be tough, but if it helps me long term it will be worth it. For anyone interested in the Fast800, please, please read the book first. It may not be for you.  ",
      "MessageIndex": 18,
      "PostDate": "21/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178368/guys-in-a-bit-of-a-panic-regarding-diet---of-all-things",
      "Title": "Guys, in a bit of a panic regarding diet - of all things!!!"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Hi Guys,  I've been on Femera since mid October and all was fine till beginning of Jan when I more or less keeled over with joint pain, and my right hand (left hand is still fine!) has sort of seize up - very painful.  I actually thought it may have been due to the radiation, as my chest wall had a bad reaction and it felt like I'd broken my ribs!! (that can  happen apparently, no one had any concerns) No SE's previous to this.  So, it hasn't improved any and oncologist has sent me a script to change from Femera to Exemestane . For some reason I though she was changing me to Anastrozole and so I asked  and she put \"please supply Accord brand\" on the script.... *doh* I'm off the Femera for two weeks before starting the new meds. (was told to stop the Femera on Thursday) I've been feeling much, much better, though hand isn't a hundred percent yet. Reason for the break was to see if there would be any improvement off Femera.  Just interested on how people are getting on on Exemestane and what brand would appear to be the best? As ever, many thanks for your thoughts xx",
      "MessageIndex": 0,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178364/been-changed-from-letrozole-femera-to-exemestane-due-to-femera-side-effects",
      "Title": "Been changed from Letrozole (Femera) to Exemestane due to Femera side..."
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Yes - sounds very like a stitch abscess. I've just had a few and I'm about 10 weeks post op. Mine burst so I was left with tiny little holes but I just washed with sterile saline, and put on a plaster to keep clean and they healed within a few days. Radiologist consultant confirmed for me what they were, no need for me to see my surgeon again.  You just need to make sure they are clean, so no chance of infection at all.  If you're unsure at all, ask your wife to phone her Breast Care nurse. I emailed photo's of mine to my BC nurse and she said she would get me in to see the surgeon, but had an RT appointment a couple of days later so I got checked out there and all good. ",
      "MessageIndex": 5,
      "PostDate": "03/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170999/post-op-complications",
      "Title": "Post op complications"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thanks very much, Moomy, I know I'm lucky to have the Femara. Perhaps it's still a lingering of the radiation and will improve??? I need to speak to someone as the calcichew tablets are making me sick so I need to get something I can just swallow. Perhaps Ill give the oncho nurse a ring.  Thanks again",
      "MessageIndex": 2,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177101/letrozole-side-effects---solutions",
      "Title": "Letrozole side effects - solutions??"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "I've been on Femera since about Sept/October I think. All was grand, but the last couple of months I've really, really been suffering from bone aches. I can sometimes barely use my right hand (left hand is completely fine) Thinking about it, I had issues with my radiation, in that my chest wall apparently reacted badly, making it seem like I'd a couple of broken ribs. Inflammation of cartilage sometimes happens and I was offered anti inflammatory s, but managed without even though it was very, very sore for a few weeks. Last radiation was 6 weeks ago, so I reckon it probably isn't to do with that - especially with the one hand thing and the fact my ribs are fine now.... getting out of a chair and walking are the issue now! I had a dexa scan too, and turns out I have very low bone density in my spine. Just on the osteo limits. *sigh* If I'm honest, I can't be faffed with trying different tablets - I just want to feel better. Are there any supplements I could be taking? Any recommendations from anyone? I don't know who best to discuss this with (other than you guys, obvs) I've had no contact from my oncology team since just after my surgery (August) I have my follow up radiation appointment Tuesday, but that's at a different hospital to my onco/surgery hospital.  As ever, I appreciate any thoughts Thank you",
      "MessageIndex": 0,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177101/letrozole-side-effects---solutions",
      "Title": "Letrozole side effects - solutions??"
    },
    {
      "AuthorID": "kathleen37",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kathleen37",
      "Content": "Thanks again guys, it's good to go armed with some things to ask about  One other thing - seems I'm now growing a black beard. Lots of black hair on chin and under chin. I contacted a laser hair removal place, and they threw hands up in horror and said they can't treat me till 5 years after treatment has past.... Don't fancy shaving every day - does anyone know if there is an actual reason for no laser, in which case I'll try somewhere else??? Thanks again. Very much appreciate all the help. ",
      "MessageIndex": 6,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177101/letrozole-side-effects---solutions",
      "Title": "Letrozole side effects - solutions??"
    }
  ]
}