{
  "AuthorID": "katherines",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
  "Posts": [
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Pepys - I'm so glad things are progressing for you even tho you have these side effects. I have been using the cold cap and coping well with it. The worst thing in the world to me was the thought of losing my hair (extremely selfish) even more so than accepting I have cancer. I've been luckly (touch wood) that although its thinned a lot, I had thick hair and it still looks ok ish but I did come to the conclusion that my life was worth more than my hair so I had to get my head around it.  I spent nights not sleeping in case it came out on the pillow. Ridiculous when I read everyone's stories on here. Its pure and simple vanity. My only excuse was that with the separation I felt no one would even consider being with me without hair.....who cares? I don't anymore (i hope) and I have my wig ready if I lose more. Although I'm feeling better in myself, I think of the cold cap and the chemo treatment room and the syringes full of chemo lined up and it makes me feel really sick. I can smell them all the time. Like a recurring nightmare that I can't escape.  I've got to get past this sillyness I know but I'm struggling. The nurses and other patients are wonderful so what is with me? Good luck with your treatment and I'm sorry for moaning yet again. You are a really brave lady and will get through it like we all will. Thank you for being in touch xxx",
      "MessageIndex": 22,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Sonia - thank you for your lovely message.  I do sleep a lot in the first few days and then try to over the sickly days too.  I do have a lot going on and to be honest most of it has kept my mind off the fact I have cancer at all. I can hardly believe that I do. If it wasn't for the chemo and the fact I have to have another op and radiotherapy after I would never believe that is what's causing it.  My next Chemo is on 16th sept which will be my wedding anniversary (separating not divorce yet). I think someone up there is having a laugh ;) . oh well.   I hope all has gone well with your chemo. Do you have any further treatment to come? Take care and thank you again for taking the time to reply. Katherine xxx",
      "MessageIndex": 23,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Pepys. They are all extreme stresses to be coping with BUT and I mean this honestly, I feel that dealing with them altogether is easier because each one takes a bit of stress from the others and in six months I'll have a well body, a new life to look forward to and some freedom and I can't wait now I've got my head round it. I think god decided if I had to go through them all then one big fight was the best medicine ;). Thank you so much for replying to me xxx",
      "MessageIndex": 12,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Mk16 - anytime lovely xx",
      "MessageIndex": 15,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Oh my goodness I am so so grateful for your amazingly supportive and kind replies. Funnily enough as you'll know today I feel as different again and this is day 8. Mk16 I start dct on my next chemo and I am worried. I hope the ct goes well for you. I'll have everything crossed xx I have support with my daughters although they are 21 and 17 and extremely busy being young women but my parents are the ones I'll be staying with when we move out and I think they're looking forward to having a bit of control back with me ;) .They are amazing but it will be hard not having my own bed and walls to bang now and again. All my friends have been amazing too its just that when I feel so low I don't want to see anyone and feel no one understands. When I posted last night I was at my wits end and I hadn't been in touch with any support services but seeing your replies and knowing you have taken the time to think about me and reply has given me my motivation back. No matter how poorly I feel, my girls, my parents, my friends and me are the reason I'll keep going. You have also gone through or are going through the same and why should I be any different? Thank you very very much. Lots of love and hugs Katherine xxx",
      "MessageIndex": 7,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Janesvodka thank you lovely lady. I will put some meditation music on soon (I have lots). ;) x",
      "MessageIndex": 9,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Whiskers - Thank you so much. This site (although I find it hard to navigate)/has been a massive help to me and knowing that we all go through the same feelings is huge for me.  I did feel so alone even though I have lots of friends around, I can't bring myself to go and meet up. This community is the best thing at the moment because everyone understands every single feeling I'm having and supports each other with kindness and advice that I can work with. Take care and thank you again whiskers for replying to me and caring. And, online shopping is my worst habit at the moment but who cares lol xxx",
      "MessageIndex": 21,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "MK16. Just so you know I do believe in being able to pass positive energy, hugs and cuddles without actually being physically with a person and if you ever feel like you don't have them, you do now. I'm sending everything I've got. you'll manage and your parents might not understand but they'll know and love you no matter what Xxx",
      "MessageIndex": 8,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Kaffloveswho. I will be strong Kath for my girls. They and my nieces and nephews are my life and I want to see my grandchildren one day too. Thank you lovely lady xx",
      "MessageIndex": 13,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Hi, I'm half way through six courses of chemotherapy for my breast cancer. I've done well for me I think coping while going through a separation and house sale but suddenly I'm panicking about continuing with it. I had the treatment on Tuesday and am feeling constantly sickly and migrainey. I'm weak and tired and I don't know if I can cope with any more.  I know it sounds selfish but I've got so much going on and I can't cope with feeling this poorly anymore.  I'm sure I'm not the only one to feel like this but does anyone have any advice for me? Thank you x",
      "MessageIndex": 0,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Whiskers. I need to shake myself sometimes but knowing others have been there to is such a deal breaker isn't it? Thank you so much ;) Xx",
      "MessageIndex": 10,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Shirleymac. I am gaining confidence by the day and I know I'm getting stronger. Before my first chemo I had a blood transfusion because my blood count had been so low. Also just before my second chemo the nurse gave me five instead of one new anti sickness tablet so I was rushed to a&e for monitoring as it was a massive overdose (accidental and no effects thank goodness). Its a constant battle but you've all made me feel really positive so thank you v v much. Love and hugs xxx",
      "MessageIndex": 11,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Janesvodka - I'm feeling much much better. I can't believe the difference. How can you feel so totally ill and sickly and weak and then the next day good as ever? Very strange. I'm really good though so thank you lovely lady and I hope you're feeling the same? I'm here for you too xxx",
      "MessageIndex": 17,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "katherines",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katherines",
      "Content": "Emma I've just read the chat and I've just had my third Chemo a week ago and I've had pains in my left bust (my cancer is in the right) and some soreness in the right. It is reassuring that others have had these symptoms and I'm pretty sure you can feel easy about them all now. I start dct in two weeks so am worried about the side effects there but I'll keep going. Good luck huni with your treatment but any worries please talk to your breast care nurses xx",
      "MessageIndex": 12,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82100/docetaxel-effects",
      "Title": "docetaxel effects"
    }
  ]
}