{
  "AuthorID": "Katiekoo1978",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katiekoo1978",
  "Posts": [
    {
      "AuthorID": "Katiekoo1978",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katiekoo1978",
      "Content": "Hi RadDad, I am sorry you have had to find this site but glad that it is helping! I was diagnosed in November and initially it was a massive shock, however once I got my head round my treatment plan and knew what the next few months had in store for me I just wanted to get on with it. It sounds as if you have both dealt with the diagnosis really well, make sure you ride this current wave of positivity as long as you can! Take each stage as it comes as all the different parts of treatment bring their own challenges, physically and emotionally. I am having chemo at the moment (on 4th cycle of 6) and due to have mastectomy & lymph node removal in April. Like your wife, at the beginning of my treatment I didn't feel the need to look for support online, but recently I have found this site a fantastic source of practical information for hints/tips on dealing with side effects and also finding out what to expect in my next stage of treatment. Advice from someone who has been through all this before is invaluable. I hope all goes well on Tuesday!",
      "MessageIndex": 8,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72268/nervous-huband",
      "Title": "Nervous huband"
    },
    {
      "AuthorID": "Katiekoo1978",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katiekoo1978",
      "Content": "Hi Lucy, I am so sorry to hear that you are so scared, I know EXACTLY how you feel.  I am also 36, I was diagnosed in November after I found a lump (I have grade 3, stage 3 breast cancer, having chemo, due to have mastectomy & full lymph node removal next month, followed by radiotherapy).   I have been through the same rollercoaster of emotions as you, and believe me, the waiting for results/treatment plan really is the worst part.  You will get the best chance of fighting off this disease, you are young so they will throw everything at it.  My medical team have been so supportive and reassuring, I have gone into my appointments shaking with fear and come out feeling really positive!   However scared and sad you feel at the moment, it will pass, and once you know your treatment plan you will feel so much better.  Just deal with one bit of information at a time as you feel ready to cope with it, you will be able to clarify anything else you need to know at later appointments once you are in a better place to deal with more information.  I am just approaching the end of my chemo and although I've not been working I have been able to carry on doing all the things I enjoy, haven't been a hermit staying in bed all day.  Chemo has been so much easier to cope with than I ever imagined.   There is a really useful facebook group you could join, Younger Breast Cancer Network, the girls on there know exactly how you feel!  Sending you a virtual hug, hope this has helped??  Kate x",
      "MessageIndex": 2,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73457/i-m-panicked-and-feeling-desperate",
      "Title": "I'm panicked and feeling desperate."
    }
  ]
}