{
  "AuthorID": "katie71",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katie71",
  "Posts": [
    {
      "AuthorID": "katie71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katie71",
      "Content": "hi there I've read through your replies and a couple of people mentioned the picc line and having to have it flushed once a week. If you'd prefer not to have a district nurse or have to go to the hospital every week then you can have a family member or friend trained to do it. Believe it or not it's quite a simple procedure and only took one training session. My sister did mine for me every week and we had no problems whatsoever. We are very close and when I was diagnosed she was devastated and felt useless. Doing my picc for me helped her feel she was doing something constructive and helpful. It helped me so much as I felt we were getting through it together, she also came to chemo. Cancer can be such a lonely experience and the things like this can make such a difference.  Good luck with your treatment X ",
      "MessageIndex": 9,
      "PostDate": "18/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121610/her2-and-hormone-receptor-positive",
      "Title": "Her2 and hormone receptor positive"
    },
    {
      "AuthorID": "katie71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katie71",
      "Content": "Hi there That's a shame hubby couldn't be trained seeing as you live so far from the hospital! Maybe a blessing in disguise tho as you had a temperamental line. I suppose different hospitals must have different policies and I guess I was just lucky to have no problems. xx",
      "MessageIndex": 16,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121610/her2-and-hormone-receptor-positive",
      "Title": "Her2 and hormone receptor positive"
    },
    {
      "AuthorID": "katie71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katie71",
      "Content": "Hi Aneesa1 I struggled with the thought of no hair but was really worried about the cold cap and the length of time it adds to chemo. Different people tell you different stories but I decided the only way to know was to try. I did it on my first chemo and I couldn't cope. I found the pain unbearable, it was like a tenfold migraine! Where it was so cold I felt my brain was actually numb and I couldn't see, hear or speak properly. I also felt really sick. I lasted 45 mins and I had to take it off. I just knew I couldn't keep it on for four hours every chemo so that was it. Other people probably sail through it but this was my experience.  I lost all my hair cycle 2 and I've never worn a wig or hat just rocked out the bald head which I know isn't for everybody, it's surprising how quick you get used to it tho  My only advice to you would be to try and see at least that way you can always look back and not wonder if you could/couldn't do it.  Sometimes I do wish I had my hair but at least I tried   Good luck lovey xx",
      "MessageIndex": 17,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121610/her2-and-hormone-receptor-positive",
      "Title": "Her2 and hormone receptor positive"
    },
    {
      "AuthorID": "katie71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katie71",
      "Content": "Hi ladies Diagnosed June 16. Did chemo for six months then had my mastectomy and auxiliary clearance back in January. I did not have reconstruction at the same time as needed more treatment.  Fast forward to now and I am 2weeks post diep flap recon. I feel great I'm just struggling with underwear! My doctor said I have to wear big support pants but I just can't find comfortable ones!  Any ladies had this op? Could you recommend where to get great pants Thank you xx Kate",
      "MessageIndex": 0,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140513/underwear-woes-after-diep-flap",
      "Title": "Underwear woes after diep flap"
    },
    {
      "AuthorID": "katie71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katie71",
      "Content": "Thank you, I shall give them a try. Getting quite the collection lol xx",
      "MessageIndex": 3,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140513/underwear-woes-after-diep-flap",
      "Title": "Underwear woes after diep flap"
    },
    {
      "AuthorID": "katie71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/katie71",
      "Content": "Hi Jilly I did have a quick look in there the other day but couldn't find high waisted briefs with support just normal, I'll have to go back and ask. Thank you xx",
      "MessageIndex": 5,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140513/underwear-woes-after-diep-flap",
      "Title": "Underwear woes after diep flap"
    }
  ]
}