{
  "AuthorID": "KayB54",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kayb54",
  "Posts": [
    {
      "AuthorID": "KayB54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kayb54",
      "Content": "Hi Tessa I had a mastec and full node clearance 2 years ago and I never knew that the sweat glands no longer worked. Duh! It's a hot day, so I've made a point of checking and you're quite right. How could I have missed that all this time? Oh well, I'll not bother so much with the deoderant on that side from now on, so thanks for the info. Kay",
      "MessageIndex": 9,
      "PostDate": "21/05/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/27970/sticky-armpit",
      "Title": "Sticky armpit!"
    },
    {
      "AuthorID": "KayB54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kayb54",
      "Content": "Hi Tessa I have a 'bother' rule - I don't bother my doc unless whatever I'm currently obssessing about has been bothering me for at least 3 weeks, UNLESS it's a lump. I know that the vast majority of lumps are harmless, but I would always tell the docs about them straight away. Don't worry about being a stalker. The medics would much rather sort any problem out as early as possible. Kay",
      "MessageIndex": 1,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/24335/lumps-and-more-lumps",
      "Title": "lumps and more lumps"
    },
    {
      "AuthorID": "KayB54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kayb54",
      "Content": "Please please have the treatment that your oncology team recommend. We are so very fortunate to live in a country that can offer such a good chance of recovery, and it's free too. Chemo is horrid, but not for the whole time you're on it, just for a few days per cycle. Radiotherapy is a walk in the park, but tedious. Following the recommended treatment will offer you the best possible chance of surviving this, so please take it. Best wishes, Kay xx",
      "MessageIndex": 4,
      "PostDate": "14/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "KayB54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kayb54",
      "Content": "Joan Hi, please try to hang on in there! RT is a breeze compared to chemo. but it is definitely a massive inconvenience because it's daily (been there, done that). BUT, it will end, so just do what you have too.  So, deep breaths, and just get it done. All the best, Kay xx    ",
      "MessageIndex": 1,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32535/stress-levels",
      "Title": "Stress levels"
    },
    {
      "AuthorID": "KayB54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kayb54",
      "Content": "Hi sarah I had 6 lots of Doce, and I won't kid you, it was pretty horrid. However, it's do-able. I would echo Lisa and say make sure you've got decent pain relief because the pain can be fairly awful. However, this usually only lasts for a couple of days per cycle, so try to hold that thought if it gets bad. Also, do try to keep your digestive system running as well as you can. Take a laxative if you're constipated, and do that sooner rather than later. I didn't the first couple of times and then thought I was going to die on the loo, just like Elvis when things swung the other way! Sorry to be graphic, but you really don't want to get that far. On a more minor note, my nails just about disintegrated, but I know other women used several coats of a dark nail varnish which apparently helps. Good luck, remember that it will end. Kay",
      "MessageIndex": 3,
      "PostDate": "03/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    },
    {
      "AuthorID": "KayB54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kayb54",
      "Content": "If it helps, I had 6 lots of Docetaxel, and none of the last 5 were anything like as bad as the first one. Chin up, it does end.",
      "MessageIndex": 10,
      "PostDate": "13/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    }
  ]
}