{
  "AuthorID": "Kazey",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazey",
  "Posts": [
    {
      "AuthorID": "Kazey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazey",
      "Content": "Hi Yvonne, Just seen your post and am feeling so sad for you. Breast cancer is a nightmare! I'm further on down the line than you, but still feel scared, tired, lost and worn. What you're feeling is totally normal, we all go through it. Sadly, you'll never be the same ME again, but will find a new ME that is easier to live with. I've been recommending a book I came across that made me feel that it wasn't me that was mad. It's the people who expect me to 'bounce back' and get 'back to normal' who are mad. It's called The emotional impact of breast cancer. It's by a psychologist who's had breast cancer herself, so she knows what she's talking about from both sides. She's called Dr Cordelia Galgut, but it's not at all doctory, it just tells it like it is! I carry it round with me in my handbag and look at it to remind me that what I'm feeling is normal. Take a look on Amazon, there's a kindle version as well. I've recommended it to others who also find it really useful, so maybe you will too. Love, Kazey x",
      "MessageIndex": 7,
      "PostDate": "28/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75880/when-will-i-be-me-again",
      "Title": "When will I be \"ME\" again ???"
    },
    {
      "AuthorID": "Kazey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazey",
      "Content": "Hi Stumble, I'm sorry I've only just read your post and it made me feel, yet again, how the world just doesn't understand what it's like for women to  have this terrible disease. Any cancer is terrible, but there's something about having your breasts invaded and then operated on and then being at the mercy of so many eyes doing so many treatments that makes it different. Our breasts are such a big part of how we and other people see us. I recently read a really good book that I found through the Macmillan books list. It's by a woman who's had breast cancer and is also a psychologist and she really gets how it feels. It's written in a way that makes you feel normal and that it's the world that is mad, not you. You can get it on Amazon, its' by Cordelia Galgut and it's called Emotional support through breast cancer. I know books can't solve our problems for us, but having it by me helps to remind me that I am normal to be feeling like I do. Love, Kazey, xxx",
      "MessageIndex": 5,
      "PostDate": "18/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71971/i-feel-violated",
      "Title": "I feel...violated?"
    },
    {
      "AuthorID": "Kazey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazey",
      "Content": "I think lots of us feel the same! People expect us to 'get over it' and 'move on', but it's not that easy! I still get very worried and upset and frightened. I don't know if you are interested in reading something, but I'd recommend a short book called Emotional Support through Breast Cancer by a psychologist who's had it herself. She's called Dr Cordelia Galgut. but it's not written like a doctory book, it's an easy read and makes a lot of sense. When I read it, it made me feel normal rather than mad! I still dip into it regularly. Have a look at it on Amazon and read the reviews. See what you think. The main thing is that you are normal to be feeling like you do!!!",
      "MessageIndex": 2,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73501/every-day-stress",
      "Title": "Every day stress"
    }
  ]
}