{
  "AuthorID": "Kazzakaz",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzakaz",
  "Posts": [
    {
      "AuthorID": "Kazzakaz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzakaz",
      "Content": "Hi there, So an update I was diagnosed 4 weeks ago and had various scans. Yesterday it was decided because its an aggressive type and I have a strong history with my mums side of the family the best cause of action is to have them both taken away.... I'm gutted devastated all of them...I cry all the time and most of the time I don't know what I'm doing. Will it get better I just so hope so. But knowing I'm not alone and reading the stuff on here has kept me kind of sane. God bless you all....",
      "MessageIndex": 0,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94470/got-to-have-them-both-removed",
      "Title": "Got to have them both removed...."
    },
    {
      "AuthorID": "Kazzakaz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzakaz",
      "Content": "Thank you so much for your support... I suppose with such a strong family history of BC...mum, all aunties, cousin and my mums mum before that I always knew that ticking time bomb was there just waiting to rear its ugly head but its still a shock never the less. I'm having a new set of boobs while they take the old ones away....I did lighten the load by asking if I can have Jordon sized....um NO...was my husband's reply....can't hurt to ask though!!!! I'm scared to death, can't sleep eat or function and I can't afford to lose weight at only 7 stone.....I've got so many questions but never ask as to scared of answers... Will I still need chemo/ radio if you have them removed I know I'll come through it but now I worry coz my 27 year old daughter will need to be watched....and feel guilty I may have passed it on.  Thanks all....",
      "MessageIndex": 3,
      "PostDate": "22/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94470/got-to-have-them-both-removed",
      "Title": "Got to have them both removed...."
    },
    {
      "AuthorID": "Kazzakaz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzakaz",
      "Content": "Hi Rob, first of all I'd like to say is that I get you...it...everything you are saying I'm just at the stage where I'm only just diagnosed I went alone and told nobody... I heard the words I'm sorry you have cancer everything else I blocked out...ended up in a coffee shop and drove home... You can cope trust me....",
      "MessageIndex": 5,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93709/i-can-no-longer-cope",
      "Title": "I can no longer cope"
    }
  ]
}