{
  "AuthorID": "kazzymoo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzymoo",
  "Posts": [
    {
      "AuthorID": "kazzymoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzymoo",
      "Content": "Hi there, i too have used the cold cap for my first FEC but found the headache after very uncomfortable and also my hair did fall out in chunks not long after. I had it cut short from elbow length to just above my shoulder in hope that the weight would allow me to keep some. I do have my hair still but after spending many days taking hair out of my coat or back of my cardy i decided to go the whole hog and have it shaved down, not completely! I have a wonderful wig from the hospital (you get £90 voucher) but went for a bit of luxury on top of the voucher. Many friends have said my new hair has taken years off me so its not all doom and gloom..lol im 42 years old a university student, mother and grandmother, and thats music to my ears :) I think its down to personal preference and taking control of what YOU want. It works for some but not for all. Its an experience and I can at least say i did try something but am very happy now not worrying about the what ifs now and just crack on with treatment. I have finished 3 lots of FEC and due to start the T part, Doxetacel on the 24th March and only 3 of them and im free!! Stay positive in all you do and keep in touch on Macs site.. this really is a place like no other. No heirs or graces we are all in the same boat facing the same challenges.. its ok to laugh and ok to cry we all understand xx Good luck ladies x",
      "MessageIndex": 7,
      "PostDate": "07/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106250/fec-t-and-cold-cap",
      "Title": "FEC-T and Cold Cap"
    },
    {
      "AuthorID": "kazzymoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzymoo",
      "Content": "you sound like me.. its such a relief not having to stay behind after the chemo and like you said knocks minutes off the time you sit there. Its a bit of relief in a time we never know whats round the corner. I cried when i thought of the prospect of losing my hair but after a chat with some lovely nurses and the hairdresser we came to the conclusion it was for the best.. and boy am i so relieved i took the plunge! My 12 year old who is autistic was scared as mum didnt look like mum no more but i did bring her round by buying her a blue wig ( pre teen hair do) and now we have a right laugh about it and she has even named my wig Helga as it came from Germany!! Good Luck in your treatment hun xx",
      "MessageIndex": 8,
      "PostDate": "07/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106250/fec-t-and-cold-cap",
      "Title": "FEC-T and Cold Cap"
    },
    {
      "AuthorID": "kazzymoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzymoo",
      "Content": "Had all my sessions now and just rads to look forward... i found on Doxe that my taste buds went completely hay wire.. everything tasted of butter!! ended up on strawberry milkshakes just to keep the calorie intake up. I was put onto GCSF injections to boost my immune system as i kept ending up in hospital with a temperature.. nice to become part of the furniture but it was equally nice to get home to my kids too.. found my finger nails were sensitive too and invested in some mad polish but i guess its all part and parcel of the treatment. Think the tiredness  was the worst part but on my last chemo (5th may) ive found my feet tingle a bit, not much in the way of aching joints, wait til tomorrow, may creep in but like you said we are alive and thats all that matters!!",
      "MessageIndex": 9,
      "PostDate": "07/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108824/docetexal",
      "Title": "Docetexal"
    },
    {
      "AuthorID": "kazzymoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kazzymoo",
      "Content": "Having just finished 6 cycles of chemo. 3 x FEC and 3 X T i can sympathise.. as we all can. Aches and pains like youve been hit by a truck, tiredness like youve not slept in months and the feeling of being useless.. yep all part and parcel of the things we do to stay alive. If you think about all the drugs that are being pumped into your system to fight Mr C off its hardly surprising you feel rough. Ive lost my hair, my nails feel like they get hit by a hammer on a daily basis, my legs seem to belong to someone else and as for sleep .. hmm kinda forgot what that was.. but on the flip side.. im alive, my hair is growing, back, Mr C can do one now cos ive shown im stronger and sleep well thatll come soon.. Try to look at the positives more than the negatives. For every ailment there is a medicine for it. Ive taken Codeiene and paracetomol for the aches and pains, i have GCSF injections to boost my immune system (think i have shares in NHS treatment due to neuropenia) and i look and feel like ive aged 50 years.. but im alive!! and that is all that matters You will beat this and for most its not permanent. There is light at the end of the tunnel for some that may be in the form of maintenance chemo but it all does the same.. keeps that nasty little blighter at bay. I have 4 and half weeks of rads to deal with next.. its a path set out for us all and a path you can choose to take or let it consume you.. my 8 year old daughter calls it rainbow therapy so im happy with that!!! i get to spend time to watch my kids grow up there is a pot of gold at the end of the rainbow.. Find something to keep focused on, ive just finished my first year of uni (have 2 grandkids, 4 kids and another grand kid on the way) okay you may not want to be that focused.. but anything to keep your mind active and positive helps. Im also going for counselling as i hadnt realised how much 6 months of treatment can effect you... survivors guilt maybe? on my last chemo day i cried, laughed, sat silently, every emotion you can muster i felt it but the lovely mac nurses understood and they are always there for you regardless!! Good Luck with the rest of your treatment.. believe me.. you are much stronger than you think xxxx",
      "MessageIndex": 4,
      "PostDate": "10/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108952/when-it-will-finish",
      "Title": "when it will finish"
    }
  ]
}