{
  "AuthorID": "Kelly1979",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kelly1979",
  "Posts": [
    {
      "AuthorID": "Kelly1979",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kelly1979",
      "Content": "Hello I'm new to this site but here goes... I was diagnosed with breast cancer aged 22 and had local wide excision, lymph nodes removed, chemotherapy and radiotherapy. Now, 12 years on and aged 34 it has returned in the same breast. I have to have the affected breast removed and I have also elected to have the other one removed as my mum passed away 2 years ago and tested positive for the BRCA 1 gene, so there's a strong possibility that I have it too. I have to have chemotherapy after my operation, and I'm seeing the oncologist to discuss tomorrow. I was hoping to have the double mastectomy and diep flap reconstruction done in the same operation but it looks like they want to do chemo sooner rather than later so i think I'll be having single mastectomy before chemo and then the other mastectomy and diep flap surgery after chemo. To make things more complicated, I've been on the waiting list for IVF for the last couple of years and only now reached the top of the list (my timing is just great!). I've seen the IVF people today and they have agreed to remove my eggs and freeze my embryos before I start any treatment. Given the BRCA gene i will have to think about removing my ovaries at some point too. My head is spinning! Just wondering if anyone else has been through anything similar and can share their experiences with me? Kelly x",
      "MessageIndex": 0,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60822/breast-cancer-at-a-young-age--second-time",
      "Title": "Breast cancer at a young age- second time"
    },
    {
      "AuthorID": "Kelly1979",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kelly1979",
      "Content": "I can also relate to is Lizane, i finished FEC T chemo in October and am still having to take strong painkillers for the neuropathy pains. Some days my legs feel so heavy like lead weights but this has got slightly better over the last few weeks. As for going out, I couldn't go to the supermarket without almost fainting and sweating (wig doesn't help) but again this has got slightly better over the last few weeks. I think it's case of building your strength back up slowly and getting used to moving around again. I do dread going out for meals etc as I know I'll have my wig on for more than a few hours and end up having hot flushes and feeling uncomfortable for most of the evening. I look forward to getting home and ripping the thing off my head! Does anyone else get this?! Hope everyone had a great christmas and has a happy and healthy (ish) 2014 x Kelly x",
      "MessageIndex": 7,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69107/is-this-normal-chemo-is-over-but-3-wks-after-and-feeling-worst-than-during-i-think",
      "Title": "Is this normal.... Chemo is over but .. 3 wks after and feeling worst..."
    },
    {
      "AuthorID": "Kelly1979",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kelly1979",
      "Content": "Hi Kirstie I had the same thing about a week after my first taxotere chemo. It gradually got worse over the next few weeks and ended up looking like severe acne. I went to see my GP who seemed to think it was a reaction to the chemo and she prescribed me anti histamines, a barrier gel and moisturiser. After about 4 days of using them it cleared up. It might be worth going to see your GP sooner rather than later. Kelly x",
      "MessageIndex": 2,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70657/blotchy-face-following-third-t",
      "Title": "Blotchy face following third T"
    },
    {
      "AuthorID": "Kelly1979",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kelly1979",
      "Content": "Hello I had a bilateral diep reconstruction four weeks ago, one of which was on a breast which had previously had radiotherapy. The surgeon warned me that the skin on that side may not be great and not so stretchy but was confident that he could do it. when I woke up from surgery I noticed that the radiated side was higher and tighter and the surgeon said he had difficulties as there wasn't much elasticity in the skin because of radiotherapy. He did say though that it will drop to match the other breast over the next few months. Also for the last few weeks I have suffered with skin necrosis on the same side and had to go back for lots of dressings as the wound wasn't healing properly. Last Friday the surgeon took me back into theatre and scraped away the dead tissue and it's been much better since. Although I've had these problems I would not let if put you off as the boob itself is truly amazing! The shape and size is great and apart from some wound healing issues I am really glad I chose this operation. The boob has dropped and settled down loads in the last few weeks and my breasts are starting to look more symmetrical now. My surgeon reckons that in three months time my boobs will look completely different to what they are now, so it's onwards and upwards from here. It's your decision but I would go for it! Best of luck, Kelly xx",
      "MessageIndex": 2,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75801/can-i-have-surgery-on-a-previously-radiated-breast",
      "Title": "Can i have surgery on a previously radiated breast ?"
    },
    {
      "AuthorID": "Kelly1979",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kelly1979",
      "Content": "By the way I'm 35 years old and if you have any questions just ask xx",
      "MessageIndex": 3,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75801/can-i-have-surgery-on-a-previously-radiated-breast",
      "Title": "Can i have surgery on a previously radiated breast ?"
    }
  ]
}