{
  "AuthorID": "Kentstar",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kentstar",
  "Posts": [
    {
      "AuthorID": "Kentstar",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kentstar",
      "Content": "I am sending you positive thoughts for a good result. X",
      "MessageIndex": 6,
      "PostDate": "15/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85820/feeling-totally-demoralised",
      "Title": "Feeling Totally Demoralised!"
    },
    {
      "AuthorID": "Kentstar",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kentstar",
      "Content": "What a wonderful xmas present for you. Now, just hunker down and enjoy the festivities with a lighter heart x",
      "MessageIndex": 4,
      "PostDate": "24/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87368/yeeeaaaah---yippeee-christmas-came-early",
      "Title": "Yeeeaaaah - Yippeee Christmas Came Early!"
    },
    {
      "AuthorID": "Kentstar",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kentstar",
      "Content": "Positive thoughts. X get another opinion regarding reconstruction. I am a j cup and on Thursday I am having a mastectomy, implant and reduction to healthy boob so I will be approx c/d cup. They should be able to offer you a reduction x",
      "MessageIndex": 3,
      "PostDate": "02/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86509/feeling-very-low-i-am-15-months-on-but-still-in-pain-and-weak",
      "Title": "feeling very low I am 15 months on but still in pain and weak"
    },
    {
      "AuthorID": "Kentstar",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kentstar",
      "Content": "I have thought long and hard about this thread. I personally don't get those who are prepared to watch and wait but acknowledge and respect their individual decision. I have a long family history of cancer deaths several before they were 40. My daughter had thyroid cancer in her 30s, now fully recovered after conventional treatment. Hers was found very early and treated with surgery and radiotherapy. With the advances in research so many of us can and will lead full lives post diagnosis. Statistics show the traditional route is most likely to get usthe result we all want, LIFE. I have come to the conclusion that it is probably more about genetics than lifestyle based on my family and friends experiences. I think it is better to focus on the future than looking back and wondering why and what if? Sometimes there just isn't an answer x",
      "MessageIndex": 94,
      "PostDate": "25/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "Kentstar",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kentstar",
      "Content": "Hi Sue, it is so hard waiting on results. I am usually a very positive upbeat person but in the first few weeks I did fall apart. One of my strategies to try and get through was listening to music. I also started crocheting a cotton throw which really helped as I could focus on designing it. I am looking forward to being able to pick that up again. I personally think it's so easy for others to say stay positive, chin up etc but sometimes it's good for the soul to allow yourself to be upset. Surely we are entitled to be! For me, if I hit the depths and wallow for a bit in self pity I climb back out a lot stronger. I suppose what I'm trying to say is you will find your own way to deal with it all and cry if you want to. Let emotions out rather than fester and remember the support available on here from folk who truly do understand why you need to cry sometimes. X",
      "MessageIndex": 1,
      "PostDate": "23/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87356/how-can-i-stop-myself-crying",
      "Title": "How can I stop myself crying?"
    },
    {
      "AuthorID": "Kentstar",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kentstar",
      "Content": "It is a frightening time. I was diagnosed in oct and spent 2 months totally bewildered, scared and angry that I had to have a mastectomy for DCIS which is non invasive and may never become so. I had my operation on 4th dec and had an immediate implant and reduction to the other boob. I was petrified and expected to be in lost of pain etc. I have to say I have had very little pain, discomfort yes but nothing too bad. My heart reaches out to everyone on this life changing journey. I hope you, like me, find that as the language and knowledge about your diagnosis is assimilated and accommodated it begins to become less scary. X",
      "MessageIndex": 3,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87315/the-unknown",
      "Title": "The unknown"
    },
    {
      "AuthorID": "Kentstar",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kentstar",
      "Content": "I had mastectomy, implant and reduction last Thursday. Considering the extent of surgery Other than the first full day I am taking less pain relief than I used to for period pain. Even day 1 was not bad. Just allow yourself time to rest as you will be tired. Everyone is amazed that a total wimp\" like me has got through it as well as I have. Hope my ramblings help although like me you probably just need it all to be over. Sending positive vibes to you and others on his journey x",
      "MessageIndex": 6,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86878/mastectomy-and-lymph-nodes-removed",
      "Title": "Mastectomy and lymph nodes removed"
    }
  ]
}