{
  "AuthorID": "kerrybmartin",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kerrybmartin",
  "Posts": [
    {
      "AuthorID": "kerrybmartin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kerrybmartin",
      "Content": "Dear Lesley, I'm so very sorry to hear about your dear friend. I just had to leave a little message for you, but now my mind has gone totally blank. Trully great friends are hard to find, difficult to leave and impossible to forget. Thinking of you Love and a great big hug! Kerry",
      "MessageIndex": 3,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10722/losing-the-fight",
      "Title": "losing the fight"
    },
    {
      "AuthorID": "kerrybmartin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kerrybmartin",
      "Content": "Dear Lesley, I'm so very sorry to hear about your dear friend. I just had to leave a little message for you, but now my mind has gone totally blank. Trully great friends are hard to find, difficult to leave and impossible to forget. Thinking of you Love and a great big hug! Kerry",
      "MessageIndex": 4,
      "PostDate": "29/04/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10722/losing-the-fight",
      "Title": "losing the fight"
    },
    {
      "AuthorID": "kerrybmartin",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kerrybmartin",
      "Content": "hi emma I've just read your message and it sounds just like me. I'm 36, on the 4th of March I was told by my consultant that I needed to have a masectomy, which like you I was fine about and also said they could take both off. On the 5th I had a CT scan to find out if it had spread anywhere else and thankfully it hadn't. On the 13th I went in for the op and I dont know if this goes for everyone but I felt fine when I came round, I was up on the ward at 1.10pm and at 1.50pm I was on the phone asking my mum if she was coming to visit! My consultant told me they had taken all my lymph nodes due to the results from the biopsy showed that it was there also. I met my chemo dr on the 3rd of April and he told me that I was going to be having two courses of chemo which will take 6 months to complete. After that I have to have radiotherapy, I will be having that 5 days a week for 4 weeks. I've had a bone scan as requested by chemo dr and I will get those results next Thursday when I go to see him again. I'm due to start chemo the beginning of May, so not long now! I'm not worried or nervous about it, I just want to get it started. I'm so glad I joined this group, everyone is fantastic. I've came across some lovely ladies since i joined last month, Debbie, Penny, Lesley and Alison just to name a few but as I said EVERYONE is lovely and I'm grateful for all the support I get. So you did the right thing joining and if I'm able to help you in any way, just let me know and I will try my best. I wish you all the very best for the road ahead. Love and best wishes Kerry ps; the chat room is great 2",
      "MessageIndex": 10,
      "PostDate": "24/04/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10721/new-to-the-club",
      "Title": "New to the club."
    }
  ]
}