{
  "AuthorID": "keznmel",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/keznmel",
  "Posts": [
    {
      "AuthorID": "keznmel",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/keznmel",
      "Content": "Hi there...I'm looking for some advise for my friend who has breast cancer and had her first dose of FEC on Tuesday with Cold Cap and has had excruciating headaches with relentless sickness since.  Has anyone else experienced this....?? She is unsure if it is due to the cold cap...however her Oncologist Nurse has advised her that the Chemo shouldn't be the cause, which leaves the cold cap. I would really appreciate if you could reply and give any advise. Thank you so much...Kerry x",
      "MessageIndex": 0,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46734/cold-cap-severe-headaches",
      "Title": "Cold Cap...Severe headaches????"
    },
    {
      "AuthorID": "keznmel",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/keznmel",
      "Content": "Thank you for replying to me Leanne. My friend, who is also called Kerry...went to the hospital yesterday as she couldn't keep any fluids down...which also meant couldn't take her anti-sickness tablets. Anyway, when she got there, they put her on a drip which was Cyclizine, as you mentioned. It did help and she does feel better, however they have given her Ondansetron in syrup form to take. Do you have the Cyclizine in tablet form? This maybe something that she needs to inquire about.  So...you have had 3 cycle's of FEC? How have you been effected? I hope you are feeling well at the moment. Take care and thank you again for making contact.  Love Kerry x",
      "MessageIndex": 2,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46734/cold-cap-severe-headaches",
      "Title": "Cold Cap...Severe headaches????"
    }
  ]
}