{
  "AuthorID": "Kim46",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
  "Posts": [
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I had a grade 3 stage 1 tumour (invasive ductal)which was 17mm. My cancer is avery aggressive form which is more likely to reccur within 5 years and is not responsive to hormones so chemo/radiotherapy is my only option. I felt I had to have chemo just to mop up any stray cells that may be lurking. I have 2 young children and felt it was important to give myself everychance to make sure I stay clear. I begin my chemo this week, and am very apprehensive but feel I have to go through it. Its 4 months out of my life, not long really in the great scheme of things and if it means I stay cancer free then I feel its my only choice. I know some peolpe choose not to go through it, everyone is different, I have put my trust in my oncologist and am going for it.I have many friends who are on standby to help out with the kids while I am unwell. Good luck whatever you decide to do. No one wants to be on this journey and all of us will taek a different path for a variety of reasons. All the best  xxx",
      "MessageIndex": 12,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71070/chemo-decision-yes-or-no",
      "Title": "Chemo decision. Yes or no?"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I am currently on my 2nd dose of docetaxel and am managing fine. But I am experiencing a side effect that doesn't seem to be mentioned in any literature. Both my eyelids are twitching like mad!!! On my first dose it was my left eyelid, had to keep telling people I wasn't winking at them! But since my second dose a week ago both my eyelids are doing it. It's really annoying and compleletly beyond my control. Hope it goes away when I finish! Anyone else had this? Kim xxx",
      "MessageIndex": 0,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77241/weird-side-effects-that-no-one-tells-you-about",
      "Title": "Weird side effects that no one tells you about!"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Glad to hear its not just me and that it goes away eventually!",
      "MessageIndex": 2,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77241/weird-side-effects-that-no-one-tells-you-about",
      "Title": "Weird side effects that no one tells you about!"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Thanks everyone My stomach still isn't right but am taking immodium which is helping. Day 9 now and I am starting to feel almost back to normal.Hurray!! Trying to be careful about what I eat to help, but cross fingers that the worse is over. Its tough going but think I can do it if sdie effects stay like this. I have also developed a sore mouth though it is not horrendous.Any tips for coping with that? I have eaten pineapple which helps alittle Kim xx",
      "MessageIndex": 3,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71735/first-chemo",
      "Title": "First Chemo"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Week one of chemo got through, hurray! Not as bad as I thought I would be just unbeleivable exhaustion. On Saturday(day 5) I was quite constipated so took an Exlax( just one very small square, not even the full dose.) before I went to bed. Not sure whether it was acoincidence, but the next day I had the most horrendous diarrhea, was quite concerned after about the sixth lot!!! But I took an immodium and it stopped. My stomach has been feeling really wierd ever since, bloated, windy and only eating seems to help. Is this common with FEC? Kim xxxx",
      "MessageIndex": 0,
      "PostDate": "11/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71735/first-chemo",
      "Title": "First Chemo"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I was diagnosed with breast cancer on 3rd December and had a lumpectomy and SND 8 days later. Nodes were clear and all cancer was removed. However after Christmas I began to piece things together and asked if I had Triple Negative? The answer was yes. I feel that everything happened so quickly, I wasn't able to take it all in. Don't misunderstand me, I am so grateful for all the care I have had, but I am wondering if I should have asked for a double mascetomy. I know that TNBC is more likely to recur within 5 yearsand if I have a double mascetomy I am giving myself a better chance.I am just about to begin my chemo, so will wait until afterwards. I am only in my mid 40s with 2 children.Anyone else find themselves in this situation.?",
      "MessageIndex": 0,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70879/should-i-go-for-a-double-mascectomy",
      "Title": "Should I go for a double mascectomy?"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Thanks everyone, still trying to make sense of things at the mo. I know I have to trust the cancer team, they have been fantastic so far. I also recognise the need for fairy steps, each day that passes I feel differently. I am one of those people who likes to be prepared , and I suddenly myself with no control over anything!!! Deep breaths!!xxx",
      "MessageIndex": 5,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70879/should-i-go-for-a-double-mascectomy",
      "Title": "Should I go for a double mascectomy?"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Thanks Marg, it's adifficult decision I know. I see my oncologist tomorrow so I may see what he thinks. Its just an option, but I feel I need to look at all the facts. Everything has happened so quickly, which I am grateful for and I just wanted the cancer out of me, the surgeon has done afantastic job. But sometimes its takes time to take things in , the past few weeks has seen me thinking more clearly and practically almost about the realities of my condition and steps I could take, apart from chemo to make sure it stays away!! Kim xxx",
      "MessageIndex": 2,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70879/should-i-go-for-a-double-mascectomy",
      "Title": "Should I go for a double mascectomy?"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Thankyou, I know you are right! I think everything has hit me this week, post holidays blues too. This was my first step at reaching out ,just to see how this all worked.Its good to know I can let off steam here too when I need to. Big thanks xxxxxx",
      "MessageIndex": 5,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I opened up to my husband last night and feel much better for it! We laughed and cried together and I think we are going to be Ok! It is amazing how the trials of life can bring out the best in people. Thanks everyone xx",
      "MessageIndex": 15,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I was diagnosed with a grade 3,stage 1 breast cancer on 3rd December which was an unbelievable shock. Still can't believe it. I underwent a lumpectomy and sentinal node biopsy a week later, luckily all the tumour has been removed and no cancer was found in my lymph nodes. I face 6 months of chemo soon followed by radiotherapy. I can see that I have been very lucky as it was caught early, but I now am beginning to feel very depressed. I got myself through christmas, visiting my family about 200 miles away which was lovely. Then New Year back at home with my husband and 2 children. They are all back at school this week and I am left at home with my thoughts! I feel sick at the moment , due to anxiety but my mind is in overdrive, could it be stomach cancer? N, o of course not, but then I didn't think I would get it in my breast!! My emotions seem to veer from manic activity, chatting happily, keeping busy etc to the depths of despair thinking the worst all the time. I do have lots of support at home and through friends, but I can't really talk to them about how I really feel.My husband is holding the fort, but I can see the strain in his face, I daren't speak to him about how I feel as I don't want to add to his stress. Also need to keep happy for my 2 kids who are both under 11, they need me to be strong. I feel such guilt that I am unable to be the Mum they need. Thanks for listening!!!",
      "MessageIndex": 0,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Ah, and I can now see that my reply goes to everyone!!!  I am sure I will be on here again, thankyou all so much for your advice. I will try and put it into practise, but its not easy.I am afraid I am a bit of a control freak too, it is very hard letting go. I am used to being the one , as most women are, who keeps things running in the family. I am finding it hard seeing others do my job!!! Maybe I wil learn to sit back and let them. Right, I am going to phone a couple of my friends before this cloud over my head gets any bigger!  xxxxxxx",
      "MessageIndex": 6,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Anne H,    Are you working? I am a nursery teacher , with some very challenging children. I feel unable to go to work because I am still quite sore and my job can be quite physical. Also my consultant says that toddlers are the worst group for spreading germs and I must stay away while I have treatment. Part of me wants to go in to work before chemo starts, for my sanity ina way as it certainly keeps you busy!! How do you cope with being a headteacher?? Really not sure what to do for the best. The job is exhausting when I feel well, never mind in my fragile emotional and physical state. I adore my job and miss the children so much, but am woriied I would be in tears as soon as I saw them, not vey professional! xx",
      "MessageIndex": 17,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "All above advice is great. I also bought some sleep caps from Anna bandana, great website for scarves etc. as my scalp hurt when I was in bed with head on pillow. It help to protect my scalp and aslo get over the shock of a cold bare head at night. I rubbed E45 into my scalp at night too to keep my skin smooth, moisturised and healthy x",
      "MessageIndex": 5,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77971/hair-loss---sore-scalp",
      "Title": "Hair loss - sore scalp"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I was diagnosed with tnbc in December. I remember the utter devastation I felt along with fear, anger bewilderment. All that has gone now and I feel a calm acceptance of the situation.If anyone had told me that a few months ago I would have laughed as I was a mess! I have finished chemo, which was tough, but I got through it. Just began my radiotherapy yesterday. I too am concerned about  going back to work as I have a very stressful job. I used to constsantly worry that I wasn't doing enough, that I was falling short of what was required of me, bringing wortk home and staying late. But no more of that nonsense!!! I think my mental attitude will be very different post cancer treatment. Life is too short and precious to worry, focus on the important things.Family, children, the joy of a sunny day!! My mojo is slowly returning  xxxx Love and best wishes to all Kim xxx",
      "MessageIndex": 7,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79019/triple-negative",
      "Title": "Triple negative"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I wanted the op to be over so the \"thing\"was taken away! I saw that as being the easiest part to deal with and relieved that the process of dealing with the cancer has begun. Good luck, sending you big hugs xx",
      "MessageIndex": 5,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70884/op-tomorrow",
      "Title": "Op tomorrow"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I am amazed by peolpe whi continue to work while going through this experience. I haven't been back since my diagnosis in December, just wasn't able to mentally and also as I work with young children my consultant said it would be very risky due to kids passing on infections. Chemo has left me exhausted and very unwell, can just about manage to to get up and dressed in the mornings and then have to rest.I think it affects everyone differently, and you have to think about your own situation. I am lucky as I am on full pay at the mo , then when I go on half pay I am entitled to benefts and also a benevolent fund from my union. I would recommend you contact someone about benefits as you never know what you are entitled to.. I am so glad I have been in a union, never imagined I would be using them for this situation.There is always help out there Kim xxxx",
      "MessageIndex": 5,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74263/brave-people",
      "Title": "Brave people"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Hi all,  Just home from hospital after spending 3 days on a drip because of diarrhoea that has been going on for 17days now. One day last week I took the maximum dose of 8 imodium to no avail! I was due to have my 3rd FEC today but it has been delayed so I can recover. The decision has been made to possibly abandon FEC and go on to the Docetaxel for 4 cycles instead of 3. I am absolutely petrified of having the same reaction to the drug as I had to the FEC, it s been so bad. I have lost so much weight and I was only just 9 stone to start with. Has anyone else had severe reactions like mine to FEC? And was the docetaxel better? Need some reassurance!!!!",
      "MessageIndex": 0,
      "PostDate": "18/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73788/moving-from-fec-to-docetaxel",
      "Title": "Moving from FEC to Docetaxel"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "Thanks Louise,      I still have the diarrhoea but am managing it by taking dioryalyte and trying the BRAT diet, so not as weak as last week. Hopefully by Monday when I have my pre chemo check up I will be OK, as don't want to delay treatment, though I am still very apprehensiveI know that everyone is different. The team at the hospital have been great so far( except A&E) so I know they will do what is best for me.     Upwards and onwards!!      Kim xxxx",
      "MessageIndex": 5,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73788/moving-from-fec-to-docetaxel",
      "Title": "Moving from FEC to Docetaxel"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I pray that I have same experience! i keep thinking it can't be any worse than FEC!!!    Kim xx",
      "MessageIndex": 2,
      "PostDate": "19/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73788/moving-from-fec-to-docetaxel",
      "Title": "Moving from FEC to Docetaxel"
    },
    {
      "AuthorID": "Kim46",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kim46",
      "Content": "I was never told not to take painkillers with FEC or Docetaxel. I have relied on paracetomal and ibufrofen to get me through soem of the aching that comes with chemo. My nurse recommended it! xx Kim xx",
      "MessageIndex": 2,
      "PostDate": "25/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77239/doxetaxel-and-codiene",
      "Title": "Doxetaxel and codiene"
    }
  ]
}