{
  "AuthorID": "KimbersZ",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kimbersz",
  "Posts": [
    {
      "AuthorID": "KimbersZ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kimbersz",
      "Content": "Dear mistymoley, Thank you, I will hold your hugs dear. It's good to know there are caring people like you around...... Have a lovely Christmas.....Kimbers x",
      "MessageIndex": 8,
      "PostDate": "23/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68799/urgently-need-help-another-angle-opinion-please",
      "Title": "URGENTLY NEED HELP......ANOTHER ANGLE OPINION...PLEASE"
    },
    {
      "AuthorID": "KimbersZ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kimbersz",
      "Content": "Hi, I was diagnosed with cancer in the breast 2 years ago, had lumpectomy and radiation, now on tamoxifen, I am struggling with side effects of this, but am doing well considering. I have a very, very close relationship with my daughter, who was with me when I was diagnosed, and has been my rock and best friend since then. I am 51 and my daughter is 31 with two children, whom I love dearly. However, she is married to a man, (she has been with him since she was 15), father of her children, who, four years ago got caught out with prostitutes in his own home, whilst my daughter was at work doing night shifts, the children, very young at the time, were upstairs asleep, also admitting that he had a cocaine problem. Totally unforgivable, she left with the children and stayed with myself and my then partner, we have since married. We paid for their mortgage, phones bills and any financial burden whilst she tried to sort herself out and move on. However, she went back to him. We moved on, and accepted him into our lives again, they started a business, but the business faltered, again we helped out financially to try and make the family stronger. My daughters husband would often ask me for money and ask me not to tell anyone as he was struggling with the business. He also asked for a large sum of money as they were due a tax rebate, which I duly lent. He didn't pay it back, as I thought, I didn't tell my husband as he was working away, and it was supposed to be for just a few days. Time moved on, no money was paid back, and I had to put this awful occurrence to the back off my mind. Some few years on, and my daughter is struggling badly, down to not having food I the cupboard for her family, and of course I helped. I am going to have to cut this story short, but after lending him yet more money, he is finally put in a corner where he has had to admit to a cocaine problem. By now, we estimate that he/they probably owe us up to £25,000.00, could be a bit more, or bit less, but a very small margin. My daughter then left again, came to us, and tried to get herself together. She stayed here 5 days, and then went back to him. We tried to talk to her, but she was adamant. Please, bear in mind, whilst we/I am going through this, I am also going through a very tough time with side effect of tamoxifen, insomnia being one of the worst. My husband has taken the full reigns of our business so is also under a lot of pressure. We are left feeling betrayed, but I have now lost my daughter. Her behaviour of late has been unforgivable, as she can't understand why we can't forgive him and move on, as he has given up the cocaine and is doing well. She blames me for not being able to move on and is treating me very badly. I am left so hurt and confused. It is unbearable, especially as we were so, so close. I have told my daughter that I have had no choice but to step away from her life for a while, whilst always being there if she needs a bolt hole, but can't take the drama and upset. I know that this isn't cancer related, but I don't have anyone to talk to, and my husband is so close in this nightmare that his opinion/help is not useful as he too is so hurt. Please, someone give me some advice from another angle. I am still taking tamoxifen, three years to go, I have had a few health scares, the last one just a few weeks ago, thankfully all is well. Insomnia, hot sweats and tearful episodes are back, but this could be down to other factors, sometimes it's too easy to blame tamoxifen! Thanks for reading and taking time. desperately yours.... Kimberley 🎅",
      "MessageIndex": 0,
      "PostDate": "23/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68799/urgently-need-help-another-angle-opinion-please",
      "Title": "URGENTLY NEED HELP......ANOTHER ANGLE OPINION...PLEASE"
    },
    {
      "AuthorID": "KimbersZ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kimbersz",
      "Content": "Dear Dorethee, I am so glad you are replying, words of wisdom indeed. Thank you. Yes, you are probably right about my fear of losing my daughter. Also, perhaps we were too close. I am afraid that things are so bad between us that she has now said she will not contact me again. She has an evil temper when pushed, and she can be manipulative, so, again, best to leave her be. I have shown my husband these replies and it has given him some relief, he is also thankful.....x Time to concentrate on each other, and just try and live a life where people are welcome only if they come with good things. If you know what I mean. I am just so tired of stressful/painful events, we never seem to get a minutes peace before something else comes along. Anyhow, thank you Dorothee, hope you have a lovely, lovely Christmas. kimbersxxxxx",
      "MessageIndex": 10,
      "PostDate": "23/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68799/urgently-need-help-another-angle-opinion-please",
      "Title": "URGENTLY NEED HELP......ANOTHER ANGLE OPINION...PLEASE"
    },
    {
      "AuthorID": "KimbersZ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kimbersz",
      "Content": "Thank you so much Emma, you replied a lot of sense, sometimes it's so hard to see the wood from the trees. I will look out for that book, sounds interesting. Xxxxxxx",
      "MessageIndex": 9,
      "PostDate": "23/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68799/urgently-need-help-another-angle-opinion-please",
      "Title": "URGENTLY NEED HELP......ANOTHER ANGLE OPINION...PLEASE"
    },
    {
      "AuthorID": "KimbersZ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kimbersz",
      "Content": "Dear ALL, I am humbled by the speed of your replies, and thank you to all for sensing the urgency. Yes, I will be seeking counselling in the New year! thank you....x No more money is being given, we have done our company accounts and we need to tighten our belts anyhow, but that truly is the end of the bank of mum and dad! thank you x My husband and I talk about this too often to be honest, and we drive each other crazy, as he isn't the parent, he doesn't understand to parental love behind the pain....does that make sense? We are Ecologists and kind of scientific minded, hubs more than I, which isn't helpful, as sometimes he can act a bit like Spock!!!! So now, we are trying to spend our time without talking about the whole tangled mess, and concentrate on just us. I am afraid she has already had a paddy, and accused me of being a dreadful mother, selfish and uncaring, which hurt so deep, but I stepped back and thought about it, and I think she is angry because she is angry with herself, so I have left her to 'hang where she dries'...... I will read again, and re-read your replies often, yes! I feel so awfully guilty! and wonder if it is my fault! have I been good enough as a mother! am I being cruel, my heart hurts and I truly am at the end if my tether, but I'm strong....I have gone through the suicide of my father and my twin sister, I have lost a little baby 3 hours old, and a few more very painful events in my life.......all this has made me strong, but I fear that one day something will happen that will be the straw that breaks the camels back.... I can't tell you how alone I feel in all this, so again, thank you for your replies... Kimbers XX",
      "MessageIndex": 5,
      "PostDate": "23/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68799/urgently-need-help-another-angle-opinion-please",
      "Title": "URGENTLY NEED HELP......ANOTHER ANGLE OPINION...PLEASE"
    },
    {
      "AuthorID": "KimbersZ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kimbersz",
      "Content": "Hiya, I have been on Tam for 18 months and some days I truly just cannot think or talk straight. mY memory is terrifying and has affected my work, thanksfullymy husband and myself work together so he has taken the brunt of the company. wish I could be positive, but it affects me, my life and my relationships very badly..... Still managing to smile though....hope you are well...x x x",
      "MessageIndex": 1,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/37126/tamoxifen-and-cognition",
      "Title": "Tamoxifen and Cognition"
    }
  ]
}