{
  "AuthorID": "Kittecat",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kittecat",
  "Posts": [
    {
      "AuthorID": "Kittecat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kittecat",
      "Content": "Hello, I'll be having a portacath soon (either before or after my 3rd lot of chemo). I know what it's for, read up about it works, but I wonder if someone can tell how they felt when it was put in (as it is not something I am looking forward to!) Also, when using the portacath to either give blood or to get the chemo and/or Herceptin, how does that feel? Thanks!    ",
      "MessageIndex": 7,
      "PostDate": "07/10/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/20293/central-lines-and-herceptin",
      "Title": "central lines and herceptin"
    },
    {
      "AuthorID": "Kittecat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kittecat",
      "Content": " Hi Corrine1963 - thanks for your message. I had docetaxel and finsihed in February 2010 and still have very weak fingernails. I just like to say that -to me- It is a comfort to hear that I am not the only one to suffer from weak fingernails after chemo. I hope you're recovering well.   Cat",
      "MessageIndex": 20,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41180/losing-fingernails",
      "Title": "losing fingernails!"
    },
    {
      "AuthorID": "Kittecat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kittecat",
      "Content": " Hi Corrine1963 - thanks for your message. I had docetaxel and finsihed in February 2010 and still have very weak fingernails. I just like to say that -to me- It is a comfort to hear that I am not the only one to suffer from weak fingernails after chemo. I hope you're recovering well.   Cat",
      "MessageIndex": 5,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41180/losing-fingernails",
      "Title": "losing fingernails!"
    },
    {
      "AuthorID": "Kittecat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kittecat",
      "Content": "Hi Fliss,   Sorry to hear about your joint ache. I also had docetaxel and noticed that my ankles were really stiff after having slept - I couldn't walk properly for some time after waking up. I finished docetaxel in February 2010 and the stiffness is finally disappearing.. So I hope for you that the aches will disappear too! After Docetaxel, I no longer painted my nails and I wish I had as they have been soft since and I just cannot get to grow my nail to a reasonable length with my nails splitting again. I do not know whether painting your nail for the foreseeable future will help - maybe some one else can shed some light on this?? I also like to add that I have not slept through the night since I started chemo. I do not know whether this is a usual or unusual side effect, but I do wake up quite a few times each night - whether I'm tired or not - so you're (unfortunately) not the only one. The drawback about Docetaxel is that with each dose, you also get a huge dose of steroids - which also has its own side effects! I hope your aches and pains will disappear over time and wish you good luck with Herceptin and above all, I wish you a healthy and long and happy future.   Cat  ",
      "MessageIndex": 38,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "Kittecat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kittecat",
      "Content": "Hi Bas,   Glad to hear you've been given vitamin D supplements. Research has shown that a vitamin D deficiency can lead to an increased risk in cancer .... Although I am no docter, I think it's best to go out and try to get as much sunshine as you can get without getting burnt to top up your vitamin D levels. http://www.webmd.com/breast-cancer/news/20080516/vitamin-d-deficiency-worsens-breast-cancer Iwish you a speedy recovery from breast cancer and a happy life. Cat",
      "MessageIndex": 35,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "Kittecat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kittecat",
      "Content": "Ever since I had chemo, I've decided to listen to my body - and have not listened to my oncologist for various reasons. Firstly, he mentioned that he would prefer me to eat sugar and biscuits so I would not lose more weight. I had hardly any sugar and NO alcohol during chemo and I felt fine - I was even able to take my children to school and pick them up pretty much all the way through chemo and I attribute that to eating healthily (ie lots of veggies and fruit), getting as much fresh air as I could and not having anything sugar. Secondly, he did not believe me when I said that I developed cataracts in both eyes due to chemo. It does not happen often, but it does happen. My surgeon - who has been a breast cancer specialst for over 25 years - has heard of it happening before. Not often, but it does happen. Thirdly - every person is different therefore everyone reacts differently to chemo. There are millions of people who have had chemo and therefore there may well be a million different types of side effects - not all immediately known. Fourthly, he sort of dismissed the idea of \"chemo brain\" - a \"mental fog\" that can cause problems with memory and thinking, huge cognitive problems. (for a bit more information look at:  http://www.cancer.org/Treatment/TreatmentsandSideEffects/PhysicalSideEffects/ChemotherapyEffects/chemo-brain and http://chemobrainboston.wordpress.com/chemobrain-book-excerpt/). But most importantly - my oncologist never experienced chemo (and for his sake, I hope he will not either). I told my oncologist about my health issues - hoping that if someone else came along with the same issues these won't be ignored.Please never let an oncologis or BCN make you feel like you're a hyperchondriac - I they don't know what you're experiencing and they may not have the time to listen to you either. I suppose forums like these are fantastic as we can tell others what's happening to us, so they may feel and realise that (unfortunately), they are not alone with the problems they've got after having had chemo. I have decided not to take Tamoxifen as it may reduce the chance of breast cancer coming back in 12 of 100 women (this is without having had chemo acoording to my oncologist - if you have had chemo, the chance reduces to about 6 or 7 out of 100 women). I found the following: \"A growing body of evidence suggests exercise could benefit cancer patients. In 2005, Harvard researchers found that simply walking on a regular basis helped breast cancer patients. The study focused on about 3,000 women diagnosed with breast cancer who are part of the Nurses’ Health Study. Those who regularly walked three to five hours a week (or got comparable exercise) were 50% less likely to have a recurrence of their cancer than women who exercised less than an hour per week.\". http://www.health.harvard.edu/newsweek/giving-cancer-its-walking-papers.htm Walking does not have the nasty side effects that Tamoxifen has and although I am not walking an hour a day, I have taken up running and am walking more and feeling much better for it! I wish you all good luck on your road to full health and a good night rest! Cat   ps - if any one has come up with an idea of how to get a good night sleep - please let me know!!!!    ",
      "MessageIndex": 41,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "Kittecat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kittecat",
      "Content": "Hi all,   Sorry to hear about all your problems getting to and staying asleep. Because of chemo, I've been pushed into the menopause and have not had a proper night's sleep for about 2 years. Recently, things got really bad and I woke up every hour :-(. Luckily, a friend of mine recommended melatonine - and it works really well for me. As melatonine is a sleep hormone anyway, there are no (as far as I know!!) side effects (I suppose you can compare it to Vitamin C tablets). I have not been able to buy Melatonine over the counter, but I have been able to buy it over the internet. Wishing you all a good night's rest tonight. Cat  ",
      "MessageIndex": 5,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41629/sleep",
      "Title": "sleep"
    }
  ]
}