{
  "AuthorID": "KiwiCardi",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
  "Posts": [
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I had a mastectomy last year and since finishing chemo and radiotherapy the nipple on my remaining breast has started going in, so now it is completely inverted. I was full of anxiety and panic, but I saw my surgeon and he did an ultrasound scan on it and said it's just due to the ducts shortening and pulling the nipple in. He said it's fairly common in women as they get older and nothing to worry about. I've also had my first mammogram and that didn't detect anything either. Fingers crossed your wife will have something similar and it will just be a false alarm.",
      "MessageIndex": 4,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133047/inverted-nipple",
      "Title": "Inverted nipple"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Kia ora G n'J, I'm originally a Kiwi but I came to live in Wales in 2008 and love it here. I'm finding that massaging moisturiser into my skin quite firmly ignoring the pain is actually helping it to settle down a bit, and when I work on the computer I have to put a heat pack behind my shoulder to help the muscles. I'm aware that I do need to keep moving it about to help with the flow of fluids. I found the hematoma myself so I keep checking to make sure nothing else is happening! No, no post surgery results yet. It seems to be taking a long time. My daughter has flown over from Australia to be with me and is very reluctant to go back before I get the results, so it needs to be soon. Good to find a supportive group!",
      "MessageIndex": 8,
      "PostDate": "03/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98127/advice-please-mastectomy-with-lymph-node-clearance",
      "Title": "Advice please-Mastectomy with lymph node clearance"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "That's really encouraging. Thanks x",
      "MessageIndex": 12,
      "PostDate": "03/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98127/advice-please-mastectomy-with-lymph-node-clearance",
      "Title": "Advice please-Mastectomy with lymph node clearance"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "That's really interesting Jen. My surgery will be 3 weeks tomorrow too, so same day. Everything was done from the one incision. I asked about a reconstruction but the surgeon wasn't keen. He said it could take longer to heal and he wants me on chemo as soon as possible afterwards, but he has done what he could to make a reconstruction easier further down the track - or so he said. I ended up with 4 drains in total. I started with 2 - one from the centre of the breast area and one from the armpit end. The breast one came out on the second day, but on the third night the armpit one blocked up. It caused infection and a hematoma so I was on IV antibiotics and the surgeon removed the drain and attempted to shove a new one in through the same hole. That was very painful to experience and didn't work, so I had to go back to theatre and they put 2 new drains in. Possibly that is what is giving me more pain now - having that area interfered with twice in 4 days. I haven't been told anything about deodorant at all, so I've been carefully using a stick one avoiding getting near the incision at all. I found I was sweating a lot there when I was in the hospital as it was so warm all the time, and I couldn't lift my arm up properly to have air circulating. That combined with a reaction to the dressing gave me an armpit full of blisters, but they have settled down now I have no dressing on. My daughter works as a nurse in a short stay ward in an Australian hospital and she flew over, so she brought me a great long handled cotton bag that they use for mastectomy patients. They are sewed by volunteers and given free to patients - enough room for 2 drains easily, plus a little side pocket for a mobile phone! All the nurses at the hospital here admired it. She also brought me a moon-shaped cushion with an elastic strap across the pointy ends. It goes over my shoulder and protects the area so it was great for under the seatbelt when I was driven home from hospital. I haven't tried wearing a bra yet. I have one that I bought from the Breast Care nurse before surgery, but the area feels too sensitive yet. I'm not very big busted so it doesn't bother me and if I have a loose cardigan or jacket on I don't think my being lopsided is too noticeable. I do keep moving my shoulder as much as possible though, and today I had a go at driving for the first time. The doctor said it was up to me when I felt comfortable and it's only a short drive to our village shop so I decided to try. I managed ok, but I was quite tired and had to have a nap afterwards. Nice to make another milestone though! Dee",
      "MessageIndex": 14,
      "PostDate": "03/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98127/advice-please-mastectomy-with-lymph-node-clearance",
      "Title": "Advice please-Mastectomy with lymph node clearance"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi, I'm new on this forum. I had this operation with lymph node clearance on 13th June, followed by further surgery 3 days later as a drain blocked up and I developed a hematoma and infection. I'm home now, all drains and staples out, but having a lot of pain in the skin between my armpit and my elbow. It feels a bit like pins and needles as well but it's making it really hard to do my exercises. Is this a common experience? And can someone tell me how long it should last? It's much more painful than the actual wound site. Thanks.",
      "MessageIndex": 5,
      "PostDate": "02/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98127/advice-please-mastectomy-with-lymph-node-clearance",
      "Title": "Advice please-Mastectomy with lymph node clearance"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Thanks for the encouragement Jen and Nix. I'm perservering with massaging and doing the exercises, and I find the more I do earlier in the day the better. It gets more painful as the day wears on and my movement gets more limited so I just concentrate on relaxing the area as much as I can then. I have a slight added complication in that I had melanoma surgery on the same arm 6 years ago and I have a long scar that curves around my forearm almost from my wrist to my elbow. The current pain reaches down to that scar and is making it feel tight and sore too. The lymphodema person that saw me in the hospital said I have to massage in stages going round the scar as fluid will be obstructed by it, so it's a bit of a performance. I have an appointment with a lymphodema clinic on Thursday so I'll get some more advice from them then. No idea yet when the chemo will start. I rang last Wednesday but they said they still hadn't had the results through from pathology. I think I'll call again around 3pm today and see if I can get an answer on when my appointment is likely to be. My daughter is booked to fly back to Australia on the 13th, but she doesn't want to go until she knows exactly what the pathology results showed and what my treatment will be from here in. So good to hear of everyone's progress! We can do this! Dee xx",
      "MessageIndex": 17,
      "PostDate": "04/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98127/advice-please-mastectomy-with-lymph-node-clearance",
      "Title": "Advice please-Mastectomy with lymph node clearance"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I had that problem too - it was so bad I thought something was rotting inside me. I found drinking heaps of water helped a lot. It carried on for a few weeks after chemo finished, but 6 weeks later has pretty much gone now.",
      "MessageIndex": 5,
      "PostDate": "08/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122864/chemo-farts",
      "Title": "Chemo farts"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "dalefarm Distraction therapy and physically not being able to see the drugs might help. Ask the nurses to cover the lines with a pillowcase or something. As former paediatric nurse you have to find ways of making things better for the patient. Talk to the nursing staff, as someone else has said they may have encountered a similar problem before. Please don't suffer in silence.  I had cannulas at first, then the PICC line. I can't bear to see things going into my body so the nurses always covered everything with a big loose dressing. Is that possible with a portacath? I also told the nurses not to talk about what they were doing as I didn't want to know. The \"Sharp Scratch\" was the only comment I would allow. The district nurses learnt to hide the vials of blood away under something after doing my blood tests too as I didn't want to see them. Is there anything you can take to do that would be a treat for you? A film you've always wanted to watch but didn't get time for? Crosswords or puzzles that you would enjoy doing and would take your mind off it? I'm actually a mad keen amateur linguist, so I took my tablet and did language revision, so I saw my chemo sessions as an opportunity to treat myself to something I enjoyed. Is there something you could do that would be the same?",
      "MessageIndex": 13,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121054/psychological-revulsion-towards-intravenous-drugs",
      "Title": "Psychological revulsion towards intravenous drugs"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Lacomtekp Re: the teeth. My dentist's wife had had breast cancer. When I lost half the outside of a tooth last month, I took it to show him as my husband had an appointment. Up until then I had just been losing little bits and pieces. He was in no doubt that chemo drugs may have contributed. I have six teeth which need rebuilding. I have an appointment next week for an estimate as I live in a place where dental treatment isn't covered. I think its going be too expensive for me. Dentist says its not the centre or roots, they are still strong. Just the enamel. I'm really interested that several of you are getting the same problem. There has to be a connection, doesn't there? It's starting to make sense to me now! Since I started chemo I had a piece fall off a crown, which the dentist smoothed off, then an abcess under a molar which had to be extracted, then a chunk came off another tooth which will need refilling and rebuilding, then the remaining part of the crown broke and came off in two pieces. Luckily the crown is covered under a 5-year warrantee, so at least I'll get that done again for nothing. The dentist says I'm grinding my teeth and that he's never seen that type of crown break before. I don't know if I've always ground my teeth or if it's something brought on by the chemo, but I'll be watching the enamel like a hawk now!",
      "MessageIndex": 10,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120951/feeling-strange-1-year-after-chemo",
      "Title": "Feeling strange 1 year after chemo"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "ronstar You reminded me of this lovely organic textiles company in Totnes - they are more worthy than beautiful but in case you're interested I've seen that site before, thanks. Unfortunately most of the bras also contain a good helping of Spandex, which is the same as Elastane. If I can get the percentage down to about 5% it's not so bad, but once it gets up to more than 10% it doesn't help me a lot. Mind you socks are worse. The number of times I've found men's socks that are 100% cotton, but nothing for women! It really annoys me, and I only have very small feet so I can't wear the mens. I used to buy children's socks as they were often 100% cotton, but not these days. Now I've found an Eczema website that does make wonderful 100% cotton socks - expensive, but my feet love them!",
      "MessageIndex": 27,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120905/bras-again",
      "Title": "Bras again!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "SpicedTea This bra search seems never ending...I just had a look at the Royce site. They are all non wired and some seam free. They stock them at John Lewis so I will go and take a look and then arrange a fitting. Thanks for the tip about matalan. Good luck in your search ladies.  I agree with the 'neverending' aspect. My mastectomy was in June but I still haven't found a comfortable bra. I have some that are slightly less UNcomfortable, but nothing seems great. I still have a puffy area at the armpit end of my scar and whichever bra I wear they put pressure on that part. I have to stuff a folded up square of gauze in there as extra padding. I keep doing my lymphodema exercises and rolling a little stress ball around on the area, which the lymphodema nurse advised me to do, so there doesn't seem much point spending yet more money on a bra until that area is the best it can be ... and I hope the way it is now is not the best it can be! I've been back to the surgeon and he just says it will improve in time. He mentioned that I \"had a bit of trouble with the drains\", which was a euphemism for him trying to shove a bigger drain back in the hole that he'd just taken a blocked one out of with just a little local anaesthetic! It didn't work and I ended up back in theatre, but that area where the drain came out is still tender.",
      "MessageIndex": 14,
      "PostDate": "08/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120905/bras-again",
      "Title": "Bras again!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Carolyn28 Why can't I wear an underwired bra? Again this is the potential risk of causing blocked ducts. Once you are breastfeeding there is the risk that the wires could press into your breast tissue and cause a blockage. logic tells me that blocked ducts and ductal carcinoma may be linked That's interesting. I wore underwired bras all the time when I was breastfeeding and I did get blocked ducts at one stage. I'll have to show that information to my daughter who is much bigger breasted than me and I know she wears underwired bras too.",
      "MessageIndex": 35,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120905/bras-again",
      "Title": "Bras again!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "ronstar There are loads of bra making courses - maybe this is the answer, ladies - I'm going to think about it!! here's a few out of interest - Kiwicardi, didn't see any in Wales That might actually be the solution for me ... though I would have to hunt something down in Wales. Even if it were Cardiff I have friends I can stay with overnight if I needed to. I've always had a problem with bras as my skin reacts to Elastane and it's pretty much impossible to get a bra now that doesn't have it in. I just buy the most cottony ones I can find, cut off any lace as that irritates me, then put up with feeling slightly uncomfortable all the time. I try to avoid buying new bras and just stick with the same ones for years, so this having to hunt for post mastectomy bras is driving me insane. The most comfortable one I've got in terms of supporting the puffy area is a sports model that zips up the front, but it's totally artificial materials, so I feel itchy and clammy all the time I wear it.",
      "MessageIndex": 24,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120905/bras-again",
      "Title": "Bras again!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "ronstar I feel for you! I have issues with wools and some products like cleaners and cosmetics but I'd never thought about something like Elastane - it must be hard! I get the sock thing - I've knitted my socks before but they're usually too chunky - you wouldn't want a knitted bra though Yes, wool, chemicals, cosmetics - I have those too. It can be so annoying sometimes. I've knitted socks too, but I only wear them in bed on really cold days ... and speaking of cold, they're forecasting SNOW for us over the next few days. I was celebrating as I love the snow until I realised I have to drive to Carmarthen for my Herceptin injection on Friday. I've only driven in snow once in my life before so not looking forward to that! I'll have to allow double the time, but at least it's at midday so the roads should be gritted and have had traffic on them before I venture out ... as long as I can get to the end of our road which isn't gritted.",
      "MessageIndex": 31,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120905/bras-again",
      "Title": "Bras again!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi cat53  I'm post-menopausal and I was going to have Letrozole but I already have some osteoporosis so the oncologist decided to put me on Tamoxifen instead. He said that it can reduce bone density in pre-menopausal women, but in post-menopausal women it has the opposite effect and actually protects the bones. I started on it in April and I have no noticeable side effects. I'm staying on it for 10 years. It sounds like a good option in your case. Best wishes,",
      "MessageIndex": 1,
      "PostDate": "03/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139153/tamoxifen-prescribed-even-though-post-menopausal",
      "Title": "Tamoxifen prescribed even though post menopausal ??"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "It might not work for others but I find I do much better drinking out of a bottle rather than a glass. I keep filling an empty Schloer bottle with water and I can drink half the bottle in one go, but I can't drink anything like that amount from a glass. I've just had my second cycle too and I feel completely different, very tired and was sick this morning, but constipation has been my biggest issue so got to keep those fluids going in.",
      "MessageIndex": 15,
      "PostDate": "25/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115388/struggling-to-drink-recommended-fluids-after-chemotherapy",
      "Title": "Struggling to drink recommended fluids after chemotherapy!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi Skye, I just wanted to add my sympathy. None of my family live near me, but my daughter flew to be with me for 6 weeks when I was first diagnosed and was here for the mastectomy. She was great, partly because she's a nurse and understands what I'm going through, but my parents are coming to see me soon and I'm dreading it. Everyone keeps saying how lovely that they will be here, but my mum sounds very similar to others mentioned here. She calls me to spend 20 minutes telling me about every little bump or ailment she has or the neighbours have, then \"Oh, and how are you?\" I end up saying \"Fine\" because she is the kind of person that delights in talking about illnesses. I know already she has been telling all her friends and acquaintances, not because she wants me to have support, but because they will sympathise with HER - Oh, Poor P, her daughter has breast cancer! All I can add to what people have said is that sometimes you friends become way more important than your family. I am lucky to have some wonderful friends that are being really supportive. If I had to rely on my family, apart from my daughter I would despair! I hope the family meeting on Thursday can result in something useful for you. Dee xx",
      "MessageIndex": 12,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Thinking of you there, Skye, and sending you strong vibes. I hope you can reach some understanding with your family. Dee xx",
      "MessageIndex": 23,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Bedford69 Can I ask did you have 'dog ears' excess tissue/skin at side of boobage after mastectomy? I gave and they are a pain. Surgeon agreed to revision surgery to 'tidy' them up but now it's gone to funding to agree Ah, I'm wondering if that's my problem. I had my fitting and got my prosthesis on Wednesday. I wasn't bothering to wear a bra, but the lymphodema nurse told me I should due to some puffiness at the end of my scar which was moving round to under my arm. She felt gentle pressure from the bra, plus massage etc, would help, so I started wearing my post-surgery bra with a softie in it and she was right. It did seem to be a bit better. At first the fitting on Wednesday seemed to go well, and I felt quite happy with the prosthesis, but now I find I'm getting sore where that puffiness is and when I peer down it seems to be creating a fold of tissue that is getting trapped under the bra. My oncologist examined me on Wednesday too and said I have a lot of internal scarring and perhaps some trapped fluid, so she's asking the surgeon to have a look and arrange for an ultrasound to see what's going on. I'm really hoping some kind of solution will be found as I don't feel very comfortable right now! Maybe the 'revision surgery' you mentioned, though I'm loathe to have another general anaesthetic!",
      "MessageIndex": 5,
      "PostDate": "02/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115732/protheses-problems",
      "Title": "Protheses problems?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi Kerry, I had a mastectomy June last year, then chemo and I'm almost finished the Herceptin injections. It was suggested to me that I was borderline for benefitting from Tamoxifen but if I was happy to try it, then that's what they recommended. If I got side effects that were bothering me I could stop taking it. I thought about it and chatted to a good friend who had a mastectomy 10 years ago and is still taking Tamoxifen by choice. She said she considers it her little life insurance pill that she takes each night, and I liked that way of looking at it so, even though I hate taking regular medication, I decided to give it a try. I've been taking it since about March now and the only side effect I have is that I sometimes wake up feeling hot in the night or first thing in the morning. I can't say much about appetite as I've always had a good appetite despite being slim. I did put 5 kgs on during chemo, but lost it again despite being on Tamoxifen so it doesn't always cause weight gain. I would suggest you give it a try and see how you go. One thing I do is to write the initials of the days of the week on the back of each bubble containing the tablet in the pack. I'm not sure about other brands but the one I have doesn't have any markings and I want to make sure I take one every day. Best wishes,",
      "MessageIndex": 6,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137041/side-effects-of-tamoxifen",
      "Title": "Side effects of tamoxifen"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "This same question has just been discussed in the September Chemo Club thread, so you may find some answers there that will help you. This was posted by lynnwad I lost little or no hair cold capping & I had a tingly sensitive scalp also aching like I had tied my pigtail too tight I took paracetamol & it eased it. Remember to always brush it every day or y'll get matting. Get a wet brush Amazon £5 best thing I ever bought Also Argan oil massage into scalp & brush thru & leave on overnight & wash next day. I found a spray leave in conditioner for dry brittle hair worked best. I was told by a top hairdresser at the start if the follicle is damaged the hair will fall out if not it won't so don't b afraid bout brushing etc I blow dried mine & used mousse & hairspray & went bk to hairdresser last week he said in his 40 yrs of dealing with wigs & chemo patients he'd never seen such a successful outcome so keep the faith & always make sure the cap is tight & touching every part of yr scalp. If u want anymore tips just holler. It sounds very much like we're at the same stage. Fingers crossed it will get better. My first session was on Sept 1 and my second one on Thursday.",
      "MessageIndex": 5,
      "PostDate": "20/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115138/sore-tender-scalp",
      "Title": "Sore/Tender Scalp"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Well, I took ibuprofen and paracetamol and went to bed as I couldn't do anything else. Luckily I slept really well, and this morning it's much, much better! I can hardly believe the difference. I can put a little weight on it and a friend popped round and left some crutches in my front porch for me, so I'm mobile! Thank goodness for that!",
      "MessageIndex": 2,
      "PostDate": "21/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115216/twisted-ankle-and-feeling-miserable",
      "Title": "Twisted ankle and feeling miserable"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Thanks everyone! It really does feel heaps better this morning, but yes, I'm being cautious. I've scrubbed quite a few things off my list of what I wanted to do today, and I'm only doing the bare minimum and resting with it elevated as much as I can. One thing was weird last night though. The hopping about really drained me much more than I expected, and I had to crawl up the stairs to bed in two stages, stopping for a rest halfway up. When I did get into bed I had a strange red rash on the backs of both my hands, as if the exertion had done something to me. It was gone by the morning, but served to show me just how much effect the extra energy use was having. I have been warned!!",
      "MessageIndex": 7,
      "PostDate": "21/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115216/twisted-ankle-and-feeling-miserable",
      "Title": "Twisted ankle and feeling miserable"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I can't believe it. Here I am 2 days away from my next cycle and I've twisted my ankle. It seemed fine at the time and I carried on doing things round the house, but after a while it started to hurt and now I can't put any weight on it. So I'm sitting with an icepack on it, feeling sorry for myself and exhausted from having to hop around the kitchen trying to make dinner. Luckily I made lots of soups and froze them before I started chemo, so at least it was just pick something and heat it up in the microwave, but I'm so annoyed. I had so many plans for what I wanted to get done tomorrow while I'm still feeling energetic, and now nothing is going to happen. Does anyone have any idea if something like this will take longer to heal on chemo?",
      "MessageIndex": 0,
      "PostDate": "20/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115216/twisted-ankle-and-feeling-miserable",
      "Title": "Twisted ankle and feeling miserable"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I'm new to a PICC line - only got it in last week - but I'm surprised it broke! I would definitely seek specialist advice, but just wanted to say that I had to have IV antibiotics after my mastectomy and despite being told that \"shouldn't\" affect my veins, I was in a lot of pain and they had to move the cannula each time until I went on strike and refused IV and they had to give me handfuls of oral tablets instead. What is fine for one patient isn't always ok for everyone.",
      "MessageIndex": 2,
      "PostDate": "30/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117277/picc-line",
      "Title": "PICC line"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Personally, I would rather play it safe. I really want to avoid lymphoedema if I can. It's enough of a hassle coping with everything else without getting that on top if it can be avoided. I do my prevention exercises pretty fanatically every morning, and I massage my arm too though the lymphoedema nurse didn't really think that would help a lot. In my head I think I'm doing something though, so I just keep doing it.",
      "MessageIndex": 4,
      "PostDate": "19/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121595/change-in-preventative-advice-for-lymphoedema",
      "Title": "Change in preventative advice for lymphoedema"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Another option, that I'm determined I'm going to have, though the oncologist doesn't know it yet, is a portacath - www.macmillan.org.uk/.../implantable-ports.html My daughter is a nurse and she swears by them - by the far the easiest thing with minimal care needed. They stay in for as long as you are having chemo and you can have bloods taken through them, everything you need. I'm hopeless with veins and cannulas and anything else. It sounds like a godsend option to me and I'm not going to accept anything else.",
      "MessageIndex": 17,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112831/picc-line-for-chemo",
      "Title": "Picc line for chemo"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Lacomtekp Unfortunately, it can't be used for blood samples Hi Karen, That surprises me. It says in the information on the Macmillan site that it can, and my daughter who is a nurse in Australia said they take blood samples through them there. I wonder if yours was just a special case? I'll be asking! Dee x",
      "MessageIndex": 26,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112831/picc-line-for-chemo",
      "Title": "Picc line for chemo"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Kacang I have my bloods done through the portacath but one nurse did tell me \"some will give blood and some won't\". I've had no trouble. Good! Another piece of useful information. This forum is the best!",
      "MessageIndex": 28,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112831/picc-line-for-chemo",
      "Title": "Picc line for chemo"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "It's a 40-minute drive to the nearest hospital where I can have chemo (if we don't get stuck behind a farm vehicle for miles) and I still haven't been told for sure that's where I'm going. The other choices of hospital are over an hour away and I live alone with no family nearby. I have some great friends who have volunteered to be on a list of drivers to take me and pick me up, but even with the 40-minute option, I'd rather not have them do it every week for a PICC line to be flushed. I see my oncologist for the first appointment next Weds (10th) and I will be very assertively stating that I need a portacath. If they haven't offered it to anyone before, well I'm prepared to be the first. It's not just for the convenience of my friends either. My veins go into panic at the site of a needle or a canula, and I had infection in the hospital after the mastectomy and more infection around the wound since I got home, so I need something with minimum risk and ease of looking after. I've read quite a few people saying how this cancer makes them much more assertive people. If I start getting objections to the portacath option I'll be refusing chemo until they agree! Good luck Nanajanet! Dee xx",
      "MessageIndex": 24,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112831/picc-line-for-chemo",
      "Title": "Picc line for chemo"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "One thing I found important was to know how to check your own wound for any signs of change. You can ask the nurses to show you before you leave the hospital, or just yourself gently feel around the wound so you get used to what it feels like and you can detect any changes, e.g. lumps or swellings that weren't there before. Usually a district nurse will come and see you once a day and check your drain, if you're usually discharged with one still in, but you don't want to wait 24 hours if you develop signs of infection. If you know what is normal for you, then you can act quickly if you detect something different. If you need to see a doctor, or get back to the hospital urgently, let your friends know that you may need to call them in the middle of the night - just in case! Keep in touch here so we know you're ok.",
      "MessageIndex": 4,
      "PostDate": "14/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113325/post-op-care",
      "Title": "Post-Op care"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi Karakeys, I know exactly how you feel. I was diagnosed in May, had a mastectomy in June and have just had my first chemo treatment. I still find it very hard to believe this is actually happening, and at times I want to just say \"OK, that's enough now. I'll just forget about it and go back to how I was\", but I know that's not possible. It's really weird if you don't feel ill at all but you have to subject yourself to treatment that makes you feel ill. I struggle to get my head around it at times. I'm also self-employed. I do some work from home and I'm trying to keep that up, but my income is plummeting. The finance advice people are great, so ask for whatever help you can get. I've been told I have to live off my savings until I bring them down to a certain point, then I'll be able to get some sickness support. I also live alone with my daughter and son both in Australia. But this forum is the place to be. Before I had my first chemo treatment I read all the discussions on here and got myself prepared. I won't say I'm handling it really well as I hate feeling ill, and I don't like what is being done to me, but I try to keep focusing on the end. There is no choice and it will pass. Sending you a big hug!",
      "MessageIndex": 10,
      "PostDate": "05/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114391/hi-im-newly-diagnosed-with-invasive-breast-cancer-scared-and-looking-for-support",
      "Title": "Hi im newly diagnosed with invasive breast cancer, scared and looking..."
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Has anyone suggested you have a portacath instead? I have a real problem with veins and getting infections. I haven't started my chemo yet but my daughter who is an experienced nurse has said that I must insist on a portacath as it's the only thing she can imagine my body coping with.en.m.wikipedia.org/.../Port_(medical)  It's worth asking about. Best wishes, Dee xx",
      "MessageIndex": 11,
      "PostDate": "20/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111562/why-is-my-picc-a-pain",
      "Title": "Why is my PICC a Pain...???"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi Jo, I finished chemo at the end of December 2016 and my hair is not quite as long as 3\" but is curly too. I think it's starting to loosen up now though and doesn't seem as curly in general. I think perhaps as it gets a bit longer the added weight will straighten it out more, though I didn't have straight hair before. It's always been wavy with a tendency to curl more in damp weather. I'm happier now it doesn't look so much like a pom pom on my head!",
      "MessageIndex": 2,
      "PostDate": "23/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136458/hair-after-chemo",
      "Title": "Hair after chemo"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Thanks Lindylou49. I appreciate the hugs! I've started massaging it morning and night and it hasn't popped yet, but hopefully it will soon. I go quite hard on it until it's too painful to do any more. If I stretch my arm up, I really feel it pulling tight and hurting, but the puffiness has reduced a little, so that's something. For some reason the idea of having lymphoedema really freaks me out. It's the thing I can least cope with, so I get upset if I see it swelling at all. I feel slightly less panicky now it's gone down a little, but I'm not putting the sleeve back on until the cording has gone.",
      "MessageIndex": 4,
      "PostDate": "03/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137147/cording-15-months-after-surgery",
      "Title": "Cording 15 months after surgery!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "mistymoley Get a referral to a specialist physio who can \"pop\" the cords. It's instant relief, and I've never had a problem with mine since they were popped! Thanks for the advice. I'll have to ask if we have one of those in our Health Board area. I was referred to a general physio for my scar area which was very tight and I had the impression from the BCN that I would get some kind of massage, but no - just more exercises that don't do as much as the original post-surgery ones. With ongoing hip pain from a different issue that I'm seeing a second physio for and getting nowhere, I'm rapidly losing my faith in physios. Sorry to sound negative - just having a down day.",
      "MessageIndex": 2,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137147/cording-15-months-after-surgery",
      "Title": "Cording 15 months after surgery!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I was feeling like I was top of things - mastectomy and node clearance June last year, then chemo, then radiotherapy, now concentrate on getting my life back. I had some small issues with lymphoedema in my affected arm, but that seemed to be under control with twice-daily exercises and a sleeve. But something has gone wrong. I woke up Weds morning with a painful tight wire stretching down from my armpit to my wrist, and a puffy forearm. I tried putting the sleeve on but it was really painful and made my hand swell up so I took it off. I called the lymphoedema specialist and she said it is unusual but it sounds like I have cording - 15 months after surgery! She said to leave the sleeve off for now, but to take pain relief then massage down the length of the cord with my finger tips. I'm trying to do it, but I have a long scar on my forearm from when I had melanoma surgery 7 years ago, and it really hurts if I massage anywhere near that. I'm wondering if that scar is actually interfering with the lymph drainage, though I don't know if that's even a possibility. I'll be getting an appointment in the post to see the lymphoedema specialist, but I feel so despondent and fed up with the whole thing today. When does it ever end?",
      "MessageIndex": 0,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137147/cording-15-months-after-surgery",
      "Title": "Cording 15 months after surgery!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Merry Christmas everyone! Thanks for all your support and advice here on the forum. It's great to know that no matter what the concern, or how trivial a question might seem, here it's always responded to with warmth and understanding. Best wishes and a better 2017 to you all! xx",
      "MessageIndex": 6,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120156/merry-christmas-everyone",
      "Title": "Merry Christmas Everyone :)"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Kacang It really does taste like apples and custard - just like one of its alternative names. So custard apples and soursops are the same thing? I had no idea!",
      "MessageIndex": 3,
      "PostDate": "02/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117420/soursop",
      "Title": "Soursop"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Lacomtekp The advise from the beautician in my chemo clinic was to use evo nail. 2 coates daily for 7 days, remove in the evening with acetone free remover, oil cuticles with argan oil, sleep and begin the 7 day process again  in the morning. I've been doing that with Evonail as well, though I had to order mine online. My nails were so good that by about the 5th cycle I started getting slack and missing some days, or only putting it on once. Now I'm 2 weeks past my final cycle and I can see a slight brown discoloration beneath my nails. They feel sort of tender as well, so now I'm frantically painting Evonail on them again - 3 times some days! I hoping I can stop anything developing past this point. I coped ok with losing my hair, but the thought of my nails coming off fills me with dread!",
      "MessageIndex": 6,
      "PostDate": "05/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120751/nail-care",
      "Title": "Nail care"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I've been using the Bilberry and Eyebright Complex for 3 days now. It could be just a coincidence, or even a placebo effect, but my eyes are starting to feel better. They're not so gritty when I wake up in the morning, and not so sore when I use the computer. Fingers crossed it keeps going like that.",
      "MessageIndex": 8,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124866/letrazole-and-cataracts",
      "Title": "Letrazole and cataracts"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I just remembered yesterday that I used to take a herbal remedy for sore, dry eyes years ago when I was working a lot with computers. I was despairing and thinking I would have to resign from my job when I went to a Health shop and they recommended a Bilberry and Eye Bright liquid. I just had to put some each day into water and drink it. My eyes made an amazing recovery within only a few days. I'm giving it a try again to see if it helps. I'll report back!",
      "MessageIndex": 7,
      "PostDate": "14/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124866/letrazole-and-cataracts",
      "Title": "Letrazole and cataracts"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I'm really thankful for these posts. I have an appointment with my oncologist sometime soon (waiting on a letter) to discuss whether or not I should have Letrozole. I was \"weakly positive\" to oestrogen (4/8) so I'm borderline for needing it. I've been having issues with my eyesight since I was on chemo - watery when outside, really dry in the night and when I wake up, and feeling gritty and blurry. I thought it was the effect of the chemo, so I was waiting for it to settle down a bit before going for an eye test - I've worn glasses since I was 14 - but now I'm wondering if going onto Letrozole will just make it worse. My mum has heaps of problems with her eyes, cataracts and retinal degradation, so I don't want to start down that track! I'll definitely make sure I raise these concerns with my onco when I go.",
      "MessageIndex": 5,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124866/letrazole-and-cataracts",
      "Title": "Letrazole and cataracts"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Great news Peaches! Good when something turns about better than you expected!",
      "MessageIndex": 3,
      "PostDate": "06/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114442/feeling-pleased",
      "Title": "Feeling pleased"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Baki It is difficult to distinguish betwee the side effects of the three but I can say that as soon as it is administered I feel it eating up my throat. It also affects my vocal chords. I get bleeding nose and gums and they say it's because of it. Other side effects include hair loss and tingling feet.  I don't get the feeling in my throat, but I did have a slightly runny nose that bled a little every time I blew it with the first cycle. Too early to see if I get it again this time round. But I'm not sure about the hair loss. I'm using a cold cap and they say I only need it on for the Docetaxol, they remove it during the Carboplatin so they're not expecting that to cause hair loss. So far I've got sore hair roots and a bit more than usual coming out if I wash it or comb it, but no more than that. Fingers crossed!",
      "MessageIndex": 5,
      "PostDate": "24/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115391/starting-carboplatin",
      "Title": "Starting Carboplatin"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi, I'm having Carboplatin together with Docetaxel. I have the Docetaxel first which takes an hour, then the Carboplatin for another hour. To be honest I don't know a lot about it. I haven't really gone into it at all, just accepted what the oncologist said. I'm seeing her again next Wednesday, so now that I've had 2 cycles and I'm a bit more out of the shock of it all I'm going to ask more and see exactly what it's targeting. All I've noticed is that it affects my veins more than the Docetaxel. I'm just having it through a cannula and I notice that when the Carboplatin starts I get intermittent pulses of pain up my vein. They give me a warm sleeve to put over it and warm my arm up and that helps so I can bear it. The last thing I want is for them to move the cannula as I hate the things, but I'm really happy coming home with nothing to worry about as it just gets removed at the end of the session and that's it for 3 weeks. I only had my second cycle on Thursday and I've reacted completely differently this time. The first cycle I was all hyped up, everything swirling around inside me and feeling agitated. This time I'm like a zombie - sleeping a lot, very relaxed inside and no energy. But as I'm having Herceptin injections as well, I can't really say which drug is doing what. If the oncologist explains more about the Carboplatin next week I'll post here. Good luck!",
      "MessageIndex": 2,
      "PostDate": "24/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115391/starting-carboplatin",
      "Title": "Starting Carboplatin"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi all, My second cycle of Docetaxel and Carboplatin caused a reaction totally the opposite to the first cycle. First time round I was very agitated inside, unable to sleep properly for about 10 days, lots of cramps and constipation followed by a couple of days of diarrhoea. This time round I was zonked out! Totally, completely relaxed inside with no energy and just sleeping really deeply, waking for a bit to eat, then sleeping again. That lasted from Thursday through to Tuesday morning when I woke up feeling relatively normal. The Chemo Unit gave me a mild laxative to take which I just drank with each meal and I had no digestive issues at all. I also found when I was awake that I could drink a lot more water, so that probably helped too. I was so lacking in energy on Sunday that I was thinking \"If this is cumulative how on earth will I move a muscle when I get near the end?\" but I feel so much better now I'm really happy. So yesterday I had a meeting with my oncologist, and I must say I think I hit the jackpot with her. She is brilliant - not only a really nice person, but she answers all my questions and explains everything in detail if that's what I want. I asked why the different drugs and what they do exactly. She said that they tackle different stages of the regeneration of cancer cells. The Carboplatin goes to the DNA and messes with the structure of it so that when the cell tries to replicate it doesn't have the right information and can't do it successfully. The Docetaxel acts on a later stage, so if the cell has got itself ready to replicate successfully, the Docetaxel interferes with the splitting apart process so it can't divide properly. I found that really interesting, and knowing that helps me to appreciate what is going into me when I have the chemo sessions and to feel really positive about what it's doing. So, it's 2 weeks of building myself back up ready for the next round. My blood count was slightly low from the test 2 days before, but was up enough by the day of the chemo, thank goodness. The onco said I'm a bit anaemic already, which didn't surprise me as I always have low iron levels, so it's \"eat lots of iron-rich food\" now to avoid having an infusion down the track. I have the runny, slightly bleeding, nose again this time, but not quite as bad as the first, so I try not to blow it if possible. Cheers all!",
      "MessageIndex": 9,
      "PostDate": "29/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115391/starting-carboplatin",
      "Title": "Starting Carboplatin"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi Wendy (Jamiehosed) - really interesting to hear that we've had similar reactions to the same drug combination so far. I'll be stepping up the mouth wash routine prior to the next one then, just in case. I already notice tingling and slight soreness in my mouth after I eat, but the B.Soda mouthwash usually gets rid of that. I had an iron transfusion once several years ago as I always have low iron. It made me feel terrible though and I couldn't get out of bed for a week. The doctor was surprised at how rapidly my levels dropped again afterwards and that I didn't really feel better until they were back quite low, and he decided that having low iron is just the way I am. I'll be doing everything I can to avoid having another one, if it means munching parsley and kale with every meal! Congratulations Nicky! (SpicedTea) - great to hear that you have finished and got such a good result. Very encouraging for all of us xx",
      "MessageIndex": 12,
      "PostDate": "30/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115391/starting-carboplatin",
      "Title": "Starting Carboplatin"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I have the 'travelling prosthesis' problem as well, though my MX was the right side, and I'm only quite a small bust size. I recently went to M&S though and had a fitting done by a woman who had had a MX herself. She was brilliant and I now find the bras I bought with her don't have so much of the same issue. They fit better and move less - though I agree with Gilly that I get more movement with the softies. The actual silicon prosthesis does seem to drift less due to the effect of gravity on the weight of it I think.",
      "MessageIndex": 4,
      "PostDate": "23/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132238/bra-problem",
      "Title": "Bra problem"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I get frustrated with the numbness too. It's improved slightly with massaging moisturiser into it, but still not great. I console myself with the thought that I have a long scar on my arm from melanoma surgery back in 2010. It was numb in a wide area all round the scar for about 2 years but gradually got better and now feels pretty normal. I'm hoping that the same will happen with my upper arm. Think positive! :)",
      "MessageIndex": 7,
      "PostDate": "10/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122999/getting-back-to-exercise-and-underarm-sensitivity",
      "Title": "Getting back to exercise. And underarm sensitivity."
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I've had two sessions now with the cold cap. I don't have a problem with the cold on my head, though I did find I need a lot of padding across the back of my shoulders as the tube goes across them down to the machine and that's cold too. I'm only small as well. They tried the small size cap but it didn't cover enough of my head, so they went for the medium with the covering straps pulled really tight. It must have been looser the first time though as I could still get my glasses on. The second time there was no way I could push them under the cap to get them behind my ears, so that was frustrating as I couldn't read or do any colouring for the entire time it was on. Luckily I could push earbuds through small gaps in the strapping and listen to podcasts, so I had to content myself with that. But as I head towards my 3rd session I'm wondering whether it's actually worth it for me. My hair was quite thick and curly but so much has come out. I don't have any bald patches. It's just coming out evenly all over. I try to just sort of plump it up with my fingers instead of combing it and I'm only washing it once a week with a very mild shampoo, but in the morning it's all over my pillow and there is hair all over the house. I'm seriously considering giving up, getting my head shaved, and wearing turbans until it grows back. The thought is more upsetting than I had expected. The logical part of me says it will grow back so what are you worried about, but emotionally I don't think I've really accepted that I have cancer and seeing myself so different will perhaps hit home. I hope others are having more success than I am. They do say that it seems to be more effective for some than others.",
      "MessageIndex": 13,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115778/hair-cuts-for-cold-cap",
      "Title": "Hair cuts for cold cap?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I finally started radiotherapy this week and I've had 4 sessions. I found it hard going every day so I'm really enjoying the little break over the weekend. I'm using the R1/R2 cream which the radiographer hadn't heard of but was quite happy for me to use it when I explained it is especially for radiotherapy. Should I use it across the weekend as well? I have loads of R1 gel so I was thinking I could use it once a day on the weekend, but I don't know if it would help at all. Do other people just use the R2 cream on the rest days? Does everyone get wrapped up with a sort of soft rubbery pad thing across their chest? I haven't seen it mentioned before so I was wondering what it's for. I think the radiographer did tell me at the first session but I was so nervous about it all (and suffering more from chemo brain than when I was actually having chemo!) that I can't remember now. It feels nice though and helps to calm me as it feels like it's protecting me somehow.",
      "MessageIndex": 0,
      "PostDate": "18/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I've just found some information on the pad they put on me. It's called a bolus pad and apparently it's to simulate tissue and bring the radiation closer to the surface of my skin. Some people said they burnt quite badly with it, so fingers crossed the R1/R2 cream will help to minimise that.",
      "MessageIndex": 6,
      "PostDate": "18/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I'll have to get some if this itchiness keeps up, thanks. The weird thing is that I've got a red, itchy patch on my back now too, just above my shoulder blade on the same side as the rads. That can't be connected in any way, can it? Surely it's just a coincidence, but I don't usually get random itchy patches!",
      "MessageIndex": 15,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "susanneg I was warned by the RT nurse to use R2 on the back of my shoulder because of this because of this possibility.  I had no idea! Yet again this forum has been a great source of information. Unfortunately it's a really hard spot for me to reach, but I'll try now that I know.",
      "MessageIndex": 19,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "It seems to be slightly less itchy today - front and back - so hopefully the effect will wear off soon.I actually managed to get a bit of Savlon onto my back as I'd accidentally scratched it and made it bleed a little in the shower before I realised what it was, and that seemed to soothe it a little. I'll try the antihistamines if it keeps going. And at least I didn't get broken skin or anything, so I count myself lucky really. It just would have been nice to have been warned that it could affect my back as well!",
      "MessageIndex": 23,
      "PostDate": "11/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi Everyone! I'm through the radiotherapy now and used the R1/R2 throughout. The radiographers hadn't heard of it but were very interested. One said there is a trial going on at the moment somewhere testing various creams to see which prevent burning best for breast cancer patients. I had my last session on Monday so I was continuing on with the R2 cream, but I've become really itchy. My skin can't stand any clothing moving slightly on it so I'm walking round holding my clothes off it. I'm wondering if I've developed a reaction to the R2 cream as it doesn't feel soothing like it did in the beginning. I've swapped onto E45 lotion for now to see if that will help it. I feel really tight inside as well so I'm trying to do some gentle exercises but then it tends to hurt. How have others gone on with reducing the tightness?",
      "MessageIndex": 13,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I developed another itchy rash higher up on my collar bone at the front, and the two patches I already had were still really itchy so I rang the radiotherapy nurse yesterday. She advised me to get hydrocortisone cream from my GP. She said she would have suggested that I pop in and let them look at it, but with it being over an hour for me to get there she said it would be easier to go to my GP. He just gave me a phone appointment, discussed the symptoms, then faxed a prescription down to the chemist for me. I've used the cream 3 times now, in contortions trying to reach the patch on my back, and so far no change. He said if it doesn't start to improve he'll give me something a bit stronger. I'm also getting very red in my armpit, which looked fine a few days ago. The radiotherapy nurse said I would be at the peak of reactions by now - something that I didn't really understand when I finished the sessions. I knew that it carried on working for a while, but I didn't realise the side effects would get worse before they got better. Oh well, at least the skin hasn't broken so far!",
      "MessageIndex": 28,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I've had a mastectomy too so they are just treating my chest area up to my neck. I read about the R1/R2 creams on this forum - here's the link https://www.radiotherapytreatment.com/ - and as I burn really easily in the sun I asked my GP if she could order them for me. She was happy to do that and the prescription was filled by Boots. I also have E45 cream which I was using twice a day for weeks prior to rads in the hope that it might prepare my skin a little for the onslaught!",
      "MessageIndex": 5,
      "PostDate": "18/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Snowys Mum @KiwiCardi it might be the radiotherapy has gone right through your body maybe  That's a scary thought! Is that possible?",
      "MessageIndex": 17,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Could be, @ronstar. Fingers crossed this disappears soon. Frustrating that there's so little consistency in what we get told from one radiotherapy department to another!",
      "MessageIndex": 21,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Yes, I was surprised how quickly it passed. I stayed at the hospital so I could go straight into my room and sit there on the bed with the R1 gel on. Only once I had to get dressed quickly to join others going out to see a film. I thought I'd wiped the excess off, but I did a very quick job and my top stuck to my skin! I had to peel it off later. After that, every time I decided it was dry enough I put a layer of R2 cream on. Even if my clothes were against it they didn't stick, so that was better.",
      "MessageIndex": 27,
      "PostDate": "13/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123584/radiotherapy-questions",
      "Title": "Radiotherapy questions"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Quick thanks for the replies as I'm off to work, but I'll read about that brushing when I get home. Dee xx",
      "MessageIndex": 3,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "kateandbiz Can I ask why you can't wear your sleeve when you're on the computer? I put mine on in the morning and take it off again at night, and wear it for everything I do during the day including on the computer, playing the piano, and everything else. It really pinches and makes the skin red and sore inside my elbow. The lympoedema nurse said I didn't need to wear it all day, just when I was doing something active. I'm going to confirm that with her when I go for the follow-up appointment on July 12th though.",
      "MessageIndex": 18,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I like the idea of the baby's hair brush - that sounds nice. I'm typing this with the sleeve on. I decided to try and perservere a bit more as I noticed the sleeve relaxing a little in tightness now that I've worn it a bit. Another one came in the post yesterday, so I have two now. I tried wearing it all day yesterday and although it was a bit red inside my elbow, it wasn't pinching like it did initially. I actually feel like the lymphoedema has reduced slightly with all my stroking exercises twice a day, so perhaps that is making the sleeve more comfortable as well. I imagine I will not notice I'm wearing it in the end. I hope so anyway.",
      "MessageIndex": 20,
      "PostDate": "02/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Great news at my checkup yesterday! Previously my right arm was 9% bigger than my left, but this has reduced to 3% bigger, which the nurse feels could be normal for me anyway as I'm right-handed. I'm very pleased with that! I thought I'd made an improvement as it didn't feel as puffy, but it was great to have it confirmed with measurements. I've been doing the extended exercises morning and night, plus wearing the sleeve when I thought I needed to. I asked about driving and the nurse said that I could drive for 30 minutes or so without it, but it would be best to wear it for longer periods. I forgot to ask about when I'm using the computer, but unless it starts to puff up again I think I'm fine. The nurse also advised to use a little Vaseline on the inside of my elbow if it gets irritated by the sleeve. She could see it was a bit red when I took it off. Talcum powder is a no-no, she said - just Vaseline.",
      "MessageIndex": 23,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Thanks for all the advice everyone! I was wondering about the amount of work I do on the computer, and whether I should wear the sleeve when I'm doing that. Today I went doing exam invigilation without the sleeve as I thought I would just be walking about or sitting, but the first thing I had to do was rearrange desks and chairs in the room - as I was doing it I was thinking, I probably shouldn't be doing this and it hurt under my armpit afterwards. I wore the sleeve yesterday while gardening, but when I took it off I had a rash on the inside of my elbow from getting overheated. How do you handle wearing it in the warmer weather? kacang I was also told to do arm exercises with light weights (not more than 1kg) but I think that's not universally accepted as a good idea - some say lift no weight - even shopping - with that arm. Anyway I do some exercises with light weights and haven't had a problem so far. I have some armband weights that live on my PC desk so I can just grab them and do a few exercises while things are downloading or taking their time. I'll keep using those as I do feel they are tightening up the flabby parts in my upper arm where I have no feeling back yet. I'll get onto that brushing business though. I'll try anything to at least prevent it from getting worse, even if I can't make it any better!",
      "MessageIndex": 9,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I've suspected for a little while that I've started developing lymphodema in my affected arm and my side just below the armpit - I had a mastectomy and lymph node clearance. It's just been feeling a bit weird, sort of tight and tired, so I went to the lymphodema nurse and she did the measurements. Sure enough, my right arm is slightly bigger than my left - not a huge amount, but too much to be just normal variation due to my being right-handed. She told me to increase my lymphodema exercises to twice a day, and to add in activation of the lymph nodes in my groin, stroking from my armpit down towards the groin. She also ordered me a compression sleeve, but said I don't need to wear it all the time - just to put it on when I'm doing physical work like housework or gardening. So my question is, has anyone actually been able to improve their lymphodema and reduce the feeling of puffiness? I've been doing the exercises twice daily for about a fortnight now and I think I can see some improvement, but it might be just wishful thinking!",
      "MessageIndex": 0,
      "PostDate": "18/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Just reporting back - I haven't got myself a brush yet. I saw one with cactus bristles in the chemist, but not sure about that. It seemed very stiff and only came with a long handle, so awkward to use on my arm I should think. I'll have to order one online. I've been doing the extended lymphoedema exercises twice a day though - in the morning immediately after some general stretching exercises, and at night before I go to sleep. I use my soft cotton nightie to draw across my back starting under my armpit then pulling it gently across my skin, and after doing the usual exercises I lift my arm up in the air and stroke lightly down towards my shoulder area. I'm not sure if it's my imagination, but I do think it seems to be improving. I have a check up on July 12th so it will be interesting to see if there's any measurable difference.",
      "MessageIndex": 14,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Kacang When I saw the lymphoedema physio, she said that firstly you need to 'give the lymph somewhere to go' so to rub my good armpit about 10 times in a circular motion, then stroke from the centre across the top of my right breast about 5 times, then across my left breast area from armpit to centre 5 times, then up the arm, repeat until bored, or for at least 10 minutes. This apparently gets the fluid moving to where you actually have nodes to deal with it. Only very light strokes as it's all just under the skin. Yes, that's the kind of thing I do morning and night - light stroking towards my good armpit, then also down towards the lymph nodes in the groin. I can't manage to do my back myself, so I pull my soft cotton nightie across it lightly in the direction of the good armpit. Usually when I'm working on the computer and waiting for something to load up or download, I lift my light weights several times and do quite a few of the weight lifting exercises, but I noticed on the website mentioned above it says to always wear the sleeve when exercising. I can't wear it when I'm on the computer, and it would be too frustrating to keep putting it on and off, so I hope it's ok exercising without it.",
      "MessageIndex": 16,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I do wonder if I'm not putting it on properly sometimes. One day the skin on the back of my hand went numb, as if my circulation was cut off. When I took the sleeve off I had quite a red ring around my wrist, but after that I positioned the sleeve differently and it didn't happen again. It's probably just that I need to get used to putting it on. I'm never quite sure how to place it - should the bottom end be almost on my hand, or a centimetre or two above my wrist. I hate the non-feeling of my skin when I pull it up near my armpit, and I'm not sure how far up there it should go either. My next appointment is 12th July, so I'll go armed with questions. Thanks everyone!",
      "MessageIndex": 22,
      "PostDate": "02/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131990/possible-to-reduce-lymphodema-in-arm",
      "Title": "Possible to reduce lymphodema in arm?"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "It's never plain sailing, is it? I hope this time next week you'll be looking back and wondering what there was to worry about. Good luck xx",
      "MessageIndex": 5,
      "PostDate": "20/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113586/in-a-right-tizz-now",
      "Title": "In a right tizz now!"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "People's experiences are different, but in my case I had no detectable lumps or anything. I went for the routine mammogram and got called for \"further tests\". I was told at that point that there was an area of calcification in my breast that was \"concerning\" and I needed to have biopsies done to determine exactly what it was. I remember thinking stupid calcium! I had been diagnosed with osteoporisis 2 months earlier and I wondered what the calcium was doing in my breast instead of in my bones where it belonged! It did turn out to be breast cancer though and I ended up with a mastectomy. The oncologist explained that when cells die they can leave traces of calcium, and when you have cancer that can speed up the turn over of cells, so that's why it can show up as calcium in scans. I know it's not always the case though. Sometimes it's something quite innocent. I sincerely hope that's the situation for your friend, but knowing how I felt at the time, I'm glad your friend has someone like you looking out for her!",
      "MessageIndex": 8,
      "PostDate": "29/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132559/calcium-in-breast",
      "Title": "Calcium in breast"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I'm keeping a diary now. I didn't start it right at the beginning. I thought about it, but I couldn't face it enough to write it down. It made it too real somehow. So I wrote nothing about the mastectomy and my time in hospital, which I found quite traumatic and I still have difficulty thinking about. Since I started chemo though I started writing, initially prompted by thinking that I should probably record my temperature each day. I do that first thing in the morning and last thing at night, just to be sure! That has helped me realise what is a normal variation for me, so I will recognise if something is going astray. I do find it helps to think back over the day and realise that even on my tired days I've managed to accomplish something and feel happy about that. I note anything that might be a side effect too, so I can look back before my next onco appointment and make sure I cover everything. As for reading it in the future, probably not. I kept a diary during some very turbulent years when I was younger then burnt it afterwards as I didn't want to look back. I might not burn this one, but I doubt I will want to read it again.",
      "MessageIndex": 9,
      "PostDate": "10/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116138/keep-a-diary",
      "Title": "Keep a diary"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I've had 5 doses of Docetaxel now, 6th and final one coming up next Thursday. Every cycle has given me different reactions, but to be honest I've recovered faster as time has gone by. My body seems to be getting used to dealing with it, and people are surprised how well I look and how much energy I have as I get into the 3rd week. I was warned the tiredness would be cumulative, but for me that hasn't happened, so it doesn't affect everyone in that way. I've been lucky not to have any aching anywhere, but I do have tingling in my fingertips and one toe seems to be numb all the time. The oncologist has decided to lower the dose to 80% for my final one, but is pleased I managed on the full dose up to now. Fingers crossed it goes well for you too.",
      "MessageIndex": 9,
      "PostDate": "17/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119794/docetaxel-side-effects",
      "Title": "Docetaxel Side Effects"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Not advice as such, but something many of us can identify with I'm sure What lies Beneath - Body Confidence after Breast Cancer http://www.huffingtonpost.co.uk/penny-rutterford/body-confidence_b_11466898.html",
      "MessageIndex": 2,
      "PostDate": "20/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113638/bra-advice-after-surgery",
      "Title": "Bra advice after surgery"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "LisaD81 I'm OK now just have a really dry throat is this normal? I didn't have a problem with my throat until the 3rd session where it went really dry and felt irritated and made me cough heaps for over a week. Suddenly, overnight, it got better. I found drinking camomile tea with a spoonful of Manuka honey helped to soothe it for short periods, but I've done some research and ordered some Salivix Saliva Stimulating pastilles online ready for the next session - just in case. Hope you feel better soon, and ready to take on the next one. It seems almost no time since I started and I'm up to my 4th session next week, if all goes well. Once you're into it, it does seem to fly by.",
      "MessageIndex": 6,
      "PostDate": "29/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117249/just-started-chemo",
      "Title": "Just started chemo"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Thanks Dreamthief. It's good to have a bit more information. I presume Linear Accelerators are the machines they use. At first I thought \"Linear what?\" then worked it out :) I'm just hoping I'll be ok towards the end. I have a reunion to go to in Llandrindod on the weekend before my very last session. I had anticipated being finished everything by then when I agreed to go and booked my place, so fingers crossed. I'm not sure I'll feel like driving the whole way though, so I'm hoping to get a lift.",
      "MessageIndex": 19,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121561/starting-radiotherapy",
      "Title": "Starting radiotherapy"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Well, Boots were very quick to get my R1/R2 cream - no problem at all. And I now have my first appointment - 14th Feb! They actually gave me 31st Jan, but with my daughter arriving from Australia on the 29th and only able to stay 3 weeks, that would have meant me having Rads pretty much every day during her entire time here, so I asked them to postpone it a fortnight. I figured a couple more weeks won't hurt and that will give us a couple of weeks to actually have a holiday before I start. They made very clear that it was my decision and I had to take responsibility, but they didn't seem that worried about it. One thing I forgot to ask though, so I'll have to ring them again on Monday, is that when they say \"every day\" do they actually mean Saturdays and Sundays too - so 15 days straight - or do they mean Monday to Friday for 3 weeks? I assumed it meant 15 days in a row, but someone was telling me they didn't think radiotherapy worked on weekends. What have other people had?",
      "MessageIndex": 15,
      "PostDate": "21/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121561/starting-radiotherapy",
      "Title": "Starting radiotherapy"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Thanks susanneg - I'm really looking forward to spending time with her and her partner. It seems a bit weird to me that I start Rads on a Tuesday if it doesn't go across the weekends. I'll have 1 odd day left after the third week that I'll have to go back for. Another good piece of info though: if there is no room at the hostel for me to stay they will organise hospital transport for me, so at least I won't have to drive myself over an hour each way every day. That's some comfort.",
      "MessageIndex": 17,
      "PostDate": "21/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121561/starting-radiotherapy",
      "Title": "Starting radiotherapy"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Kacang I'd insist on at least a PICC line. Mind you it does seem ridiculous that they don't do portacaths grrrr.  Best Lynn xxx Yes, I agree. The oncologist seemed to be wavering a bit during the discussion and mainly felt it involved more time as I had to go to a different hospital to have the portacath fitted and she wanted me to start chemo asap, but if I'm having to wait for the PET scan anyway, why not go for the portacath? They seem to think I might go along to the pre-assessment, see their lovely chemo unit, and decide everything is fine with a cannula. Well, that's not going to happen. I can force myself through one session like that with adequate pain relief if I know that I can get the portacath for the rest, but why should I have to?",
      "MessageIndex": 4,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113253/lymph-nodes-in-the-mesentery",
      "Title": "Lymph nodes in the mesentery"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi Carolyn, I think part of the problem is that I'm dealing with people from several different hospitals. I had my surgery in one hospital, my oncologist is based in another (though she visits the first one once a fortnight), my chemo will take place in a different hospital, and the PET scan has to be done in Cardiff, 2 hours away. The oncologist told me they don't usually do the particular PET scan for breast cancer patients but she has insisted as she wants me to have it. They are having to squeeze me in at short notice, but the onco doesn't want to start chemo until she is 100% sure what she is dealing with. She said that she may have to change strategy depending on the result, and I do respect her for that, even if it is making me anxious. I asked the Oncology nurse what 'change strategy' actually meant, just different drugs? At first she seemed reluctant to clarify and just repeated 'change strategy', then she said 'Yes, yes, different drugs' but there was something about the way she said it that didn't really convince me. I'm not sure if she just didn't know or if there was something she didn't want to tell me. Or maybe I'm just getting so worked up about it all I'm getting paranoid. I've decided to just go for a walk this afternoon and not think about it for a while. If I let myself calm down and give myself time to think through the issues, I'll write them down then decide what to do. Thanks so much for trying to help me. I have my parents and my brother staying nearby at the moment but like others on here I find it very hard to talk to them. My dad has been having monthly injections for a medical condition which my mother tells everyone are 'chemo' injections. They are definitely NOT, but it means that if I mention anything about chemo I just get a long story of how my dad is dealing with his \"chemo\". It makes me so angry as they just dismiss my situation and think it's the same as my dad's, but I just have to take a deep breath and let it wash over me. Right - out for a walk and some fresh air!",
      "MessageIndex": 9,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113253/lymph-nodes-in-the-mesentery",
      "Title": "Lymph nodes in the mesentery"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Hi Karen, I just saw this before I headed out for a walk. Thank you so much for the information! It does help me a lot to at least know what is ahead of me, and as you say, if that gives me the all clear it will be fantastic news! I hope it was all fine for you too! Merci beaucoup!",
      "MessageIndex": 10,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113253/lymph-nodes-in-the-mesentery",
      "Title": "Lymph nodes in the mesentery"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "I went to my first appointment with my oncologist yesterday. She was extremely thorough, going back through everything with me right from the biopsy results to make sure I understood, and I could ask as many questions as I wanted. Then she gave me a shock. My supposedly clear CAT scan of my lungs and liver had a comment on it from the radiologist to say that they detected lymph nodes in the mesentery - an area near the top of my intestine - but they weren't noted as enlarged. The oncologist said it was most probably because I'm quite thin, so they showed up in me where they wouldn't normally, but she was going to raise the question with the radiologist in their team meeting today. She called me afterwards to say that in fact the lymph nodes are slightly enlarged and she has some concern about that, so now I have to have a CT PET scan to find out what's going on. I'd had a call from the Chemo Unit saying that I could go for my pre-assessment next Thursday, and my first chemo session the following Monday (22nd), but now the oncologist says I can still go for the pre-assessment as long as I'm not busy with the PET scan that day, but the start of the chemo is on hold until she gets the result of the PET scan and knows what we are dealing with. I was already feeling stressed as they told me the closest Chemo Unit doesn't handle portacaths and they want me to TRY with a cannula before they consider a PICC line or Hickman line. They sent me for a MUGA heart check after that and I cried my way through a cannula insertion for that procedure. The nurse that did that said she couldn't see me coping with one for chemo. It's hard enough having to go through all this stuff. If something's available that can make it a bit easier, why can't I have it? So has anyone else had to have this PET scan for lymph nodes in the mesentery?",
      "MessageIndex": 0,
      "PostDate": "11/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113253/lymph-nodes-in-the-mesentery",
      "Title": "Lymph nodes in the mesentery"
    },
    {
      "AuthorID": "KiwiCardi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kiwicardi",
      "Content": "Thanks Carolyn, I'm just getting so anxious about how much time is going by. I was diagnosed in May, mastectomy on June 13th, it's now almost 2 months later and I haven't started on chemo yet. I've had a phone call to say that they can't fit me in for a PET scan until the week starting the 22nd, so it's getting longer and longer. They've told me to still go for my pre-assessment next Thursday, but I almost wonder what's the point ... unless I can convince them about the portacath. It would give more time to get it fitted ready! The main excuse was that they aren't used to doing them and they don't have a supply of the special needles - well, get a bit of training and a supply of needles in! That's no reason not to offer something to patients, surely! How different a technique can it be? If they can cope with PICC lines and Hickman lines, it can't be a huge training exercise to learn to cope with a portacath.",
      "MessageIndex": 3,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113253/lymph-nodes-in-the-mesentery",
      "Title": "Lymph nodes in the mesentery"
    }
  ]
}