{
  "AuthorID": "knicnic",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/knicnic",
  "Posts": [
    {
      "AuthorID": "knicnic",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/knicnic",
      "Content": "Hi Amanda I am sorry to hear your news, i am guessing it is still very raw for you having only found out a few days ago. I know as a mother myself that you want to be strong and brave for your children but just make sure you have someone that you can truly express your feelings to, I know you will find lots of support on here. My dad has lung cancer and he always puts on a bravado and it's sometimes easy to forget he is ill as he seems so normal, I know he is scared about starting treatment and though he hasn't said so I just know, I hope he is confinding his real feelings to someone as its too much to deal with by yourself. I have a breast specialist appointment Tuesday, about breast pain and am worried about the possible cause, I am to young for a mammogram so will be having ultrasound. Just remember breast cancer is so very treatable these days and I am sure you will find comfort talking to all the brave ladies on here that are fighting this battle or have fought it and won xxx",
      "MessageIndex": 5,
      "PostDate": "07/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48753/scared",
      "Title": "Scared!!"
    },
    {
      "AuthorID": "knicnic",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/knicnic",
      "Content": "Thank you for your reply.  I have always been an anxious person and though have had therapy for it I still find it hard to take each step at a time.  My mind races ahead and I think of what could be to come, I know I shouldn't think like that.  Mum has just started being more like herself after we lost my Dad last year and now it's like I feel understandably so she is going to go backwards.  I hope with all my heart that it is something benign.  Thank you for talking to me, I was a frequent visitor to this site when my dad was poorly and everyone is just so caring and lovely xxx",
      "MessageIndex": 5,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120065/breast-lump-over-50",
      "Title": "Breast lump over 50"
    },
    {
      "AuthorID": "knicnic",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/knicnic",
      "Content": "Thank you for replying.  I will make sure to not let my anxiousness transfer onto mum, I seem to be very good at putting on a poker face when inside my heart is in pieces. Mum had a clear mammogram in February so naively I guess breast cancer was not on our radar xxx",
      "MessageIndex": 9,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120065/breast-lump-over-50",
      "Title": "Breast lump over 50"
    },
    {
      "AuthorID": "knicnic",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/knicnic",
      "Content": "Thank you so much for your lovely reply,  it means so much that you took the time to reply. Being positive is not one of my strong points but I know like you say I must try.  My mum is being brave and says she is not worrying but I find that impossible to believe and my heart breaks with the thoughts that must haunt her x",
      "MessageIndex": 2,
      "PostDate": "21/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120065/breast-lump-over-50",
      "Title": "Breast lump over 50"
    },
    {
      "AuthorID": "knicnic",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/knicnic",
      "Content": "Hi Carolyn I do have an older brother, though my mum doesn't want to tell him before Christmas and till after her appointment.    I try to stop my mind from getting ahead of itself but find it so hard. My mum was wth my dad through all his treatment and both him and her said that she wouldn't be able to cope. Luckily my mum and I live in the same road but still she is in her house alone a lot especially at night, alone with her thoughts and I know night times can be worse.  I have told her I am here to listen and to be there for her but I know she will shield me from a lot which makes me feel worse xx ",
      "MessageIndex": 11,
      "PostDate": "22/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120065/breast-lump-over-50",
      "Title": "Breast lump over 50"
    },
    {
      "AuthorID": "knicnic",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/knicnic",
      "Content": "Hi I hope you don't mind me posting. I am so so worried about my mum. Last week she found a lump in her breast, she went to the gp who reffered her urgently. She has an appt next Wednesday at the breast clinic. I feel so scared that it is breast cancer. She is 58 and post menopause, I read on the internet 85% of lumps found in woman of this age are cancerous. I lost my dad to lung cancer just last year at the age of 56 and I can't believe that it could be happening to us again.",
      "MessageIndex": 0,
      "PostDate": "21/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120065/breast-lump-over-50",
      "Title": "Breast lump over 50"
    }
  ]
}