{
  "AuthorID": "ktra2017",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ktra2017",
  "Posts": [
    {
      "AuthorID": "ktra2017",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ktra2017",
      "Content": "Laura89 Thanks everyone. I'm not sure what it's classed as, all I know is I haven't had a chance to finish the first lot of treatments. I have to get 3 weeks of radio therapy and scans, I guess they'll know more then. I'm just really confused because after my operation I was told all the cancer was gone but they couldn't remove the lymph node as my nerves and veins run through it. I've been left to heal for 3 months without any scans to keep a look out. If it wasn't for my arm and hand being painful and loosing function I doubt I would even know any of this right now. All the doctors tell me different things and it's so confusing and frustrating. I have no faith in them anymore unfortunately. I feel your pain, as well all do Laura, and I only hope it is alleviated. The confusion of being told so much by so many different doctors can be misleading, and so confusing. It makes us question what is factual, and what is a presumptive guess.... Have you thought about a second opinion from a completely different consultant that's not attached to your local care provider? X",
      "MessageIndex": 16,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132044/how-much-more-can-they-throw-at-me",
      "Title": "How much more can they throw at me??"
    },
    {
      "AuthorID": "ktra2017",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ktra2017",
      "Content": "Laura89 Hi, I've been having a rough time and really starting to feel it now. I'm just wondering if anyone has had similar experiences? I've written my story on my profile xxx Laura I read your post, and then your profile. To say the least, you're such an amazing strong lady, despite feeling weak and vulnerable through something so life changing. You've gone through the A-Z of the difficulties associated with this, yet you've maintained such dignity, grace, purity and beauty in overcoming every test and obstacle placed within your way. Sometimes, and I hope these words help; the toughest soldiers, receive the toughest challenges. I understand this may not remove the pain and despair, but I hope it re-assures that YOU are YOU, and you have continued to prevail through physical and mental distress. Remember this. I will follow, and walk closely behind you, or by your side throughout your journey, as do all on here. Never be lonely; you have us all around you.   X",
      "MessageIndex": 14,
      "PostDate": "21/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132044/how-much-more-can-they-throw-at-me",
      "Title": "How much more can they throw at me??"
    }
  ]
}