{
  "AuthorID": "kumihimo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
  "Posts": [
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Thank you ladies for all your help and suggestions. My GP is good and when I first asked he did try and look it up when I was there and have half a feeling if it came up he would have prescribed it. When I rang back with the details the receptionist was googling it as I was telling her and she said she had found it and would pass details to GP. Can’t help feeling she may have shown GP the web page and he saw the price. Had he not then he may well have just prescribed it. I don’t know why he refused and feel if it was cost he would have said? I already have some Aloe Vera gel and E45 cream from trying to soothe the raging sunburn feeling I had under the arm after sentinel node biopsy So at least I have that. I will look up radiance and see what that says. I also came across something called My Trusty Sunflower Cream which was developed  twenty years ago at Salisbury District Hospital for patients recovering from burns and plastic surgery.  Originally you could only get it in the hospital shop but Now it is sold all over and on Amazon. It’s £6.99 so think I’ll get some of that as well. Don’t mind losing that amount if it doesn’t work. Hopefully I won’t need anything else or not much at all. I was just trying to be prepared. I will still ask advice on Friday at appointment though. You never know they might give me a prescription. Will say my GP said to ask them. Did any of you ladies ring a bell at the end of your radiotherapy or chemo treatment? have a lovely evening all. Frances xxx",
      "MessageIndex": 11,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140344/r1-r2-for-radiotherapy",
      "Title": "R1 R2 for radiotherapy"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Godd morning everyone. i am due to start radiotherapy soon and was recommended by several people on here to ask GP to prescribe R1 R2. I did ask and GP, he hadn’t heard of it and  couldn’t locate it under just that. He asked me to find more information on it name etc. I did and sent a message to him. Have just had call from surgery to say GP can’t prescribe it/ipant available on prescription. Was told to go back to who advised asking for it and get them to sort it. i have checked it out and various people Have said it is available on the NHS. That was a couple of years ago and wonder if it has been stopped now as it is expensive. Was thinking of buying it privately as it’s suppose to be very good but you are talkI got £70-£80 for both gel and cream. does anyone know where I can get it cheaper please or has anyone had it on prescription recently or is there something else that anyone can recommend please. i am having my preparation consultation and tattoo spots done on Friday. I guess I could ask there and see if they will prescribe or recommend something. thank you all. love and hugs Frances xxx",
      "MessageIndex": 0,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140344/r1-r2-for-radiotherapy",
      "Title": "R1 R2 for radiotherapy"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Oh I love him. Gosh with all these ideas people are sharing I thought no we ought to set up shop lol. Love Frances xxx",
      "MessageIndex": 43,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Thank you Edwina. I have just printed of the pattern. Will now make a coffee and do some retail therapy on my favourite online yarn store Woolwarehouse. I need a few things anyway and can peruse the suggested yarns for the boobies and indulge in some guilt free buying, lol. Not that I need any excuse. These a couple of my projects. Love Frances xxx And ",
      "MessageIndex": 36,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Brilliant Kacang and thank you. One pattern being printed off as we speak. I had only downloaded the first one and just assumed it was a revamp of old one. Think I prefer this one. Just made a brew and going to watch the video. Think I’ll do a trial run with some DK I have, just to get the idea and then sort some better yarn. I am a bit of a yarn stasher and any excuse to buy more, lol. I have been on Anastrozole for 5 months and finding it ok. Just the odd “warm” moment and joint discomfort but not all the time and quite tolerable. these last few days my right wrist (I’m a leftie) has swollen a little and is painful at times, but again bearable. More of a nuisance. I am allergic to ibuprofen but will take a paracetamol if needed. What I am wondering is would one of these wrist supports/fingerless stretchy glove things or something similar help. Just thought all you crafty ladies would know or may indeed use them in your crafts just for the support alone. There I no way I’m giving up my crafts so just looking for ideas. Thanks girls. Love Frances xxx",
      "MessageIndex": 55,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Just finished 2nd doggie coat and now to attempt my first knitted knocker. Can’t believe I’m sitting here deciding what colour to use. Was thinking they needed to be beige/cream or a pale pink but saw some in vibrant and even rainbow colours and thought they looked brilliant. ",
      "MessageIndex": 98,
      "PostDate": "26/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Oh I am in love with Filbert. Such detail and so clever. Love Frances xxx",
      "MessageIndex": 113,
      "PostDate": "06/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Hi Wynneth Only too happy to send you some patterns. Give me today to get some together and photograph and I’ll post them. Hugs Frances x",
      "MessageIndex": 164,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Morning Ladies. Oh I am a happy bunny to have found this thread/group/link. I love crafting, mainly knitting, crocheting and sewing. Had a passion for cross stitch and spent enormous amount of money on it over the years but just before Christmas I got rid of it all. People don’t like receiving cross stitch pictures or appreciate the hours of work that goes into it. I dont have the wall space to hang any more. Even small cross stitch items are not really wanted. It seemed a shame to have all this cross stitch materials not being put to good use so I gave it all to a vicar friend of mine for his ladies craft group at church.  I live on my own in a village and don’t drive. There isn’t any craft group to join and would love to go to a knit and knitter or stitch and bitch group and be with like minded people.  My latest creations have been 4 large pouffes which I was asked to make for a friends daughter who is getting married in a tepee in October for the guests to sit on. Don’t ask!! Anyway I finished them last night. I agree to make them just before being diagnosed last August and to be honest I didn’t think I would be able to do them as i had just one or two other things on my mind then. Well Im a stubborn so and so and don’t like letting people down and as I was feeling better I got crochet hook out and off I went. Mind you I’m glad they are finished as by the 4th one it was getting pretty boring. My latest project is a knitted dog coat for a charity that my friend linked me too. I would love to knit knitted knockers but the 3 UK groups I’ve seen via link dont seem to be taking volunteers. Maybe I’ll have to knit nose warmer instead Well I have waffled on too long and need a coffee. Just love this thread and so nice to be among like minded crafters with my sense of humour as well. That’s all I’m saying about that but you have given me some giggles. Love Frances xxx",
      "MessageIndex": 32,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Hi Kacang. Do you have a pattern for your knockers please. The only One I have found starts with the back first. Would like to try something different.  In the middle of knitting dog coats at the moment which is a change. Can knit one in a day. just loving all the ideas on here. love Frances xxx",
      "MessageIndex": 53,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "One talented lady Tigermum. So pleased you get to see it first thing in the morning and last thing at night. I love the colours too. Have you any plans to do anything similar?  Love Frances xxx",
      "MessageIndex": 67,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Kacang, they are beautiful. Well done you. Frances xxx",
      "MessageIndex": 108,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Morning everyone. I guess you all have woken to the white stuff again. Have to admit it looks very pretty and is an excellent excuse to stay home and just knit, crochet, paint or do whatever your craft is. I was beginning to think this group was no more or people weren’t interested as didn’t see any posts for ages Then I found they had all gone into my junk file. Was lovely reading what you have all been up to and was happy to see the group growing and thriving . I love all your pictures and what a fantastic crafty lot we are. A few have mentioned scraps or leftover yarn and what to do with them or wanting patterns. This link is all free patterns for knitting and crocheted things. Yes they do everything else as well but have masses of free patterns in every category. www.garnstudio.com/.../kategori_oversikt.php I’m knitting dog coats for 2 rescue charities at the moment which is addictive as can make one in an evening. I also bought some lovely soft yarn to make some knockers. I do have a bit of an addiction to stash buying and found a very good site for it, woolwarehouse. My latest order:   Have a warm and happy Sunday all. Love and hugs Frances xxx",
      "MessageIndex": 156,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Thank you, I love all these pictures. Some I had seen before but others will need to try and find patterns. I’ve just sent 8 coats off to the rescue place and really hope they have some odd shaped dogs to fit them!  This is the latest dabble and each only take about and hour to do. Poppy, half an hour. Stockings need hanging ribbon on them and maybe a star or something. Can put treats in as well. Little dog needs some bead eyes to finish.  Hugs Frances xxx",
      "MessageIndex": 261,
      "PostDate": "09/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Let me know if you want any more Wyeth.  Love Frances xxx",
      "MessageIndex": 165,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Afternoon ladies. I’m still busy knitting doggie coats but also made this up. My surgery was last September but still get discomfort and tendernes on both scars. 4 weeks ago I had to have a core biopsy on a swollen lymph node under the arm as it was a cause for concern. Happily it was fat necrosis. Anyway, since then the scar has been even more uncomfortable as they were disturbing the first one. Of course I can’t help prodding it to see if it’s got smaller or gone(slapped wrists) but I’m getting better at not doing so. I had heard that heat can help so I made an underarm wheat bag. I don’t wear it next to skin but on top of T shirt and the strap keeps it nicely in place. Love and hugs Frances xxx top ",
      "MessageIndex": 211,
      "PostDate": "02/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Hi Edwina. Do you send your knockers to a charity or something? Oops, that doesn’t sound right but you know what I mean lol. Did you knit on DPNS or 2 straight needles and lastly where did you find the pattern please. Saw one on the USA site but didn’t know if the UK are different. Sorry for all the questions. Love Frances xxx",
      "MessageIndex": 34,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "A pleasure to help if I can. Although they are called wheat bags you can fill them with almost anything seed like but the best is either pearl barley or brown rice. Brown rice is better apparently if you want to add an essential oil for an aromatherapy smell as the rice holds the oil better. I used this primarily because I had it in.  I started off drawing a large heart shape on paper and then modifying it by not making it as deep and slightly wider at the top as I wanted it to cup round under the arm comfortably. I used fleece material as as I got Half a yard for £2.50 it didn’t bother me it was tartan. Just make sure it is a fabric that won’t melt in a microwave. If unsure try a small piece. fleece I’ve found is ok and wanted something soft.  First time I kept warming it in 30 second blasts and for about 90 seconds. Realised that was too hot for delicate underarm skin. Next time I just did 30 seconds and even tough it didn’t feel really warm believe me it was for under the arm.  Only put enough rice in to get a flat covering otherwise it is bulky and uncomfortable. It took me 3 goes before I got it right. You can squidgy it into the place you need it but also the fabric holds the heat to and helps. The strap was an afterthought so next time I will do it better. First attempt I had 2 and thought I would tie it at the right level but soon found out you can’t do that on yourself!,.  Hope it helps. hugs Frances xxx",
      "MessageIndex": 233,
      "PostDate": "02/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Oh they are beautiful. I had the Noel Celtic lady but gave it to someone. I love the Celtic round pattern as well. I have a hospital appointment tomorrow and if it is good news then I’ve promised myself I will buy the Scheepjes Hygge kit as a treat. I’ve been umming and erring over it for a couple of weeks now. I’ve also told myself I will buy some really nice knitting needles and yarn to make some knockers. Read the pattern last night and it looks quite easy. Have a lovely day all. Love Frances xxx",
      "MessageIndex": 72,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "The shawl and the bobbles each end are crochet but the rest is cross stitch on top. I have seen other people’s finishes and they added personal likes, symbols etc. I have a thing about seahorses and lighthouses and was thinking I could do a seahorse on the middle panel. I like a challenge! Love Frances xxx",
      "MessageIndex": 75,
      "PostDate": "22/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Oh boy am I in love with this little guy. He is gorgeous. Love all the coats as well and will pinch some of those ideas. Thanks Hugs Frances xxx",
      "MessageIndex": 234,
      "PostDate": "02/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Hi Ange. Oh I can relate to the swarm of bees on the sentinel scar. I found a  wonderful definition where someone said it was like being rubbed with sandpaper on very sore sunburn. I had been warned about the aches, bruising etc on breast and scar but knew nothing about the sentinel or axillary pain. Be rest assured it does go. Love Frances xxx",
      "MessageIndex": 8,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150420/pain-after-wide-local-excision",
      "Title": "Pain after wide local excision"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Hi there. I had WLE 13th September and  had to lose the nipple as well. Like you my lump was small, 8mm. I expected pain and discomfort at first but got really concerned when I kept having intermittent pain, discomfort and “electric shock” pain a few weeks later but the lovely ladies on here were able to reassure me this was all normal and can even go on for many months or even longer. It no longer worries me. As been said, it is early days and it has been big surgery. Your nerve endings are coming out of shock and just trying to sort themselves out.  Take care and hope things settle down for you soon. love Frances xxx",
      "MessageIndex": 4,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150420/pain-after-wide-local-excision",
      "Title": "Pain after wide local excision"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Hi Gail Thank you for your kind words. I did join the forum at the beginning of my journey but don’t post often. Also since things went wrong and not longer get daily notifications I miss a lot. My BCN still hasn’t rung so I’ll try again tomorrow. This is not the first time she has taken a couple of days to respond but it’s now 3 days. Sadly she doesn’t fill me with confidence. In the past if I have asked anything she just says it’s normal or all part of healing. Never explains or helps. Told to take painkillers and that’s it. When I saw her about the small lump the first thing she said was “I don’t know how you find these things”. Felt a bit guilty. It’s only the second time and both times I was right and not imagining it. Last time it was Fat Necrosis in axilla thank goodness. The sad thing is when I did the Moving Forward Course in January many said how they felt let down by their BCNs. We were finding things out we should have been told during treatment or we found out through our own research or the lovely people on here. Hugs to you Frances xxx",
      "MessageIndex": 2,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172791/am-i-being-thick",
      "Title": "Am I being thick ?"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Thank you. Yes it is nice to know others are being helped having succumbed to this awful disease and news that no one wants to hear. Yes I am reassured but get tired you have to fight to get information you need or questions answered. Thankfully I have a wonderful friend who listens and puts me right if I get a bit unsure. I wish you a very happy Christmas and look forward to a positive, healthy and happy new year. Hugs Frances xxx",
      "MessageIndex": 6,
      "PostDate": "23/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172791/am-i-being-thick",
      "Title": "Am I being thick ?"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Hi Gail, sorry for late reply but have only just seen this. I did ring my BCN and she eventually called me. She said she had seen my email but had been off sick and only came back Wednesday. This was now Friday afternoon! Anyway I said I take it that a cutaneous lesion means no cancer or tumour. She said yes, there was nothing she, sonographer or radiologist, was worried about. If she was she would have biopsied it. Looked like a little lesion, a little skin cyst (that’s a new one to me), maybe a hair follicle but it was tiny and she wasn’t worried about it. it was nice to know but couldn’t help feeling let down. Active treatment was great and the care and attention I had was second to none. Sadly though from Virtually the day radiotherapy stopped and oncologist discharged me to care of BCNs and GP for next 5 years it’s like we are forgotten about or don’t matter. I hadn’t had the need to call my BCN for 5 months and I had to wait a week to speak to her. Sorry if I sound negative and ungrateful but I have seen and heard this so many times with others feeling the same. There are no local groups of any kind where I live. It’s either call your BCN or go to the drop on centre which is once a week for 2 hours and is an hour and a half away. It’s like going to the doctors and you get about 10 minutes with a nurse. At least though if they think anything needs looking at you are seen straight away usually as it’s in the hospital. Ok, moan over. I am very grateful for the treatment I’ve had and feel lucky it was caught early. Come February I see my surgeon who is going to give me a new nipple. Had to wait a year or so after radiotherapy. I live on my own so no one sees me as nature intended but I’m getting excited to have a nipple and hopefully look the same again. love and hugs Frances xxx",
      "MessageIndex": 4,
      "PostDate": "19/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172791/am-i-being-thick",
      "Title": "Am I being thick ?"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Evening friends Please excuse me if I am having a senior or thick moment but need to ask. 2 weeks ago I found a very small lump in my affected breast. Was diagnosed last August and had surgery 2 weeks later. 1st year mammo I joined the Neddy club. I went and saw my BCnurse at the drop in session last Thursday. she felt it, thought it might be a cyst but sent me for ultrasound. Lady doing the ultrasound sound said everything looked fine and nothing to worry about. It wasn’t a cyst. She thought it might be a hair follicle. On report she put Cutaneous Lesion. That just means a skin injury. I was a happy bunny, gave her a hug and off I went.  Over the weekend I was thinking about it.  My question is am I right in assuming that saying everything looking fine and nothing to worry about means that no cancer was seen or detected? (obviously at this time). I emailed my BCN nurse Monday night and asked her to call me when she had time as I had some questions. So far she hasn’t rung. I’m quite upset about that as she doesn’t know what’s up and it’s now 2 days.  Has anyone else been told results like that? I guess I’m overreacting but once the thoughts there I have to ask.  Many thanks Hugs Frances xxx",
      "MessageIndex": 0,
      "PostDate": "05/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172791/am-i-being-thick",
      "Title": "Am I being thick ?"
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "P.s Also letter says G2, T1(8mm), N0(0/3) which I understand and pleased about but then says L0? Surely that is a typo and should read M0,  I’ve never seen L0. If it is a typo then it’s a bit scary to think it can happen. I’m not concerned for me as all My pathology/histology have been good.  I caught it very early, to the extent that GP, surgeon and BCN have all been surprised I found lump especially as it was barely palpable.  love Frances xxx",
      "MessageIndex": 3,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139026/npi-score-feeling-a-bit-confused",
      "Title": "NPI score. Feeling a bit confused."
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Afternoon  I have just received a copy of the clinic letter sent to my GP after receiving my results. Everything was as expected (which were very good results) but at the bottom I saw NPI 3.16 which hadn't been mentioned when I was told my results. Not knowing what this was I googled it and now understand what it is and how it is made up. What I’m slightly confused about is the 16 in the score. When I used the NPI calculator it come out as 3.2. When I look at statistics they seem to talk in round figures. 3.1, 3.2 etc and not double figures like 16. I know the 16 is because my lump was 8mm and they calculate x 2. I’m wondering if on the calculations 16. = 1.6cm and they round up to 2 and had it been 14 = 1.4cm it rounds down to 1. It’s the only way I can get to single figures?   The other confusion is the covering letter said it said “She is now on our Open Acess Model for Low to Moderate Risk Breast Cancer Follow Up”. If I have read the NPI right then I am in the low risk and wonder why the letter says low to moderate. Unless it means whether you are low or moderate the open acess is the same.   Thank you to anyone who can help untangle the knickers I have got into a twist trying to work it out.    Love and hugs Frances xxx",
      "MessageIndex": 0,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139026/npi-score-feeling-a-bit-confused",
      "Title": "NPI score. Feeling a bit confused."
    },
    {
      "AuthorID": "kumihimo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/kumihimo",
      "Content": "Thank you So much. It’s one time I’m more than happy not to have promotion . I thought/hoped it was but as this is all new to me (6 weeks) I get concerned when I don’t know for sure or understand properly and guess I overeact. love Frances xxx",
      "MessageIndex": 2,
      "PostDate": "30/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139026/npi-score-feeling-a-bit-confused",
      "Title": "NPI score. Feeling a bit confused."
    }
  ]
}