{
  "AuthorID": "ladybracknell",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladybracknell",
  "Posts": [{
    "AuthorID": "ladybracknell",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladybracknell",
    "Content": "I've come to this discussion a little late and also, my (three and a half year) experience of supporting a close relative with cancer relates to my husband's bowel cancer rather than breast cancer. I thoroughly dislike this 'Brave The Shave' campaign but more importantly, so does my husband. He would not find it at all supportive if I willingly lost my hair when, ironically, he didn't lose his through the several courses of chemo he was given. And that's one of his main gripes - this campaign simply spreads the false assumption that anyone having treatment for cancer will lose their hair. For sure, the formulation of chemo for bowel cancer rarely results in hair loss. However, before he had chemotherapy we didn't know this. We assumed that one of the distressing side effects of chemo was the INEVITABLE loss of hair. This is simply not true!  Now there can certainly be all sorts of unpleasant side effects from chemo - he lost his mobility permanently through the neuropathy that came about after taking oxyplatin - and the radiotherapy wasn't a barrel of laughs either. However, since cancer is a wholly individual condition, it is no surprise that the effects of treatment will differ from person to person.  My husband has told me that he'd be very distressed if I 'Braved The Shave'. Our life has already been turned upside down by cancer. Making a pointless and erroneous gesture would do nothing to help and everything to remind him of his own increasingly limited mortality. So while I realise that anyone who has shaved their hair did so with the best intentions, I think this whole campaign is misleading and wrong. It compounds the stereotypical view of cancer treatment as well as putting emotional pressure on people (via social media) to make a similar gesture or risk being seen as callous and unthinking if they demur. ",
    "MessageIndex": 179,
    "PostDate": "11/08/2016",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
    "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
  }]
}