{
  "AuthorID": "ladygdiver",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladygdiver",
  "Posts": [
    {
      "AuthorID": "ladygdiver",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladygdiver",
      "Content": "Hi Carolyn, It's only 14 years wait to have the reconstruction as I was fed up with all the surgery I had had, not just for breast cancer but for unrelated medical conditions that happened post mastectomy. It's only now that I felt ready and fit enough to have it done. I will let you know how it goes & hope you have yours soon Jacki",
      "MessageIndex": 6,
      "PostDate": "01/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108605/treatment-optionsnot-sure",
      "Title": "Treatment OptionsNot sure"
    },
    {
      "AuthorID": "ladygdiver",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladygdiver",
      "Content": "Hi Sally, I had a lumpectomy 14 years ago bur the biopsy found 2 more tumours too close to the margin so a full mastectomy was the only option I had considered & I wanted it dome immediately! However I was given 2 weeks to decide whether I wanted reconstruction with the mastectomy or wait until a later date if at all. Worst 2 weeks of the treatment..... however I opted for a trans dorsi flap reconstruction over a silicone implant as I was quite big busted but opt for a reduction of the existing breast to leave me with a smaller pair in the end. All went well with the reconstruction. I did have to have quite a bit of fluid drained off at intervals afterwards but that soon settled. The only niggly thing was a dog ear flap of skin left on my side below my arm pit and I have numbness over the scar on my back and the odd electrical shock type feeling if it is touched in a certain way.  After 14 years of wearing a prothesis to match up my boobs I am now going for the reduction on the right side to balance me up & have a bit of a nip and tuck on the reconstructed side which has sagged a little with age! That's all booked for 28th May.... eek! Good luck with your choice. There is no right or wrong one at the end of the day just what you feel you would be happy with. It's your body.  I was given the option of a no time limit on what ever I wantedt to do tregarding reconstruction so if you need to have the mastectomy first then decided later .... OK it's another operation but don't be rushed into a decision. Take care Jacki",
      "MessageIndex": 3,
      "PostDate": "01/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108605/treatment-optionsnot-sure",
      "Title": "Treatment OptionsNot sure"
    }
  ]
}