{
  "AuthorID": "Lady In Red",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
  "Posts": [
    {
      "AuthorID": "Lady In Red",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
      "Content": "Have had my second drain removed today after 5 days - still drained 60ml overnight but my hospital insist that drain must come out after 5 days post op. Must admit I was very glad to get it out as starting to get very painful but when I asked what happened to the fluid without the drain I was told that either my body would re-absorb or I'd get this \"seroma\". Female doc told me last night that if I get it it can be drained if necessary but they don't like to do it as introduces risk of infection - male doc told me when he took the drain out tonight that I could get swelling that equates to a new boob. I said that if that the case I'd prefer to keep it, thanks very much!",
      "MessageIndex": 8,
      "PostDate": "01/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51089/share-your-experience-with-a-seronoma",
      "Title": "Share your experience with a seronoma"
    },
    {
      "AuthorID": "Lady In Red",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
      "Content": "Hi Amanda, we've only been married 4 years and I had two discs replaced in December last year, other surgery before that and now this latest diagnosis. Like you, we have been sleeping seperately and since I got my diagnosis two weeks ago my husband has yet to even put his hand on my arm, never mind give me a kiss or a hug. I'm knew to this discussion group business but have invited you to \"be my friend\" which I think means that we can talk privately?   I see from your profile that you're having treatment at James Cook which isn't far from me although I'm at North Tees Hospital Do get in touch to talk further",
      "MessageIndex": 1,
      "PostDate": "03/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50432/relationships-and-cancer",
      "Title": "Relationships and cancer"
    },
    {
      "AuthorID": "Lady In Red",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
      "Content": "While we all need our friends and relatives to support us during this difficult time, am I the only one who doesn't want to answer all of the questions about \"just what kind of cancer do you have, etc?\" because you know damn well that they will then \"google\" for more details. How do you get the balance right between having friends there to support you but also being able to say \"butt out and leave me alone?\"",
      "MessageIndex": 0,
      "PostDate": "01/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50396/is-google-a-step-too-far",
      "Title": "Is Google a step too far?"
    },
    {
      "AuthorID": "Lady In Red",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
      "Content": "Helen, like everyone else I'm sorry that you're having a bad time. My breast care nurses couldn't be better and my hospital is a centre of excellence. BUT don't ever apologise for \"being silly\" - I'm new to this site but welcome the fact that I'm talking to other people who have been through (or are going through) the same things and will have had the same questions as I now have. In my working life I often sit in meetings where it's obvious that someone doesn't understand something but doesn't want to ask a question for fear of \"looking silly\" and so I'll be the one to say something because I'd rather get the facts than keep quiet. Hope things improve for you",
      "MessageIndex": 7,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50710/a-bad-day-at-the-office",
      "Title": "A bad day at the office"
    },
    {
      "AuthorID": "Lady In Red",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
      "Content": "I've been today to sign the consent form for a single mastectomy to take place on 26th June. Feeling very emotional tonight. Yes, I know that having the breast removed will probably save my life but picking up that pen and signing that form was one of the hardest things I've ever done. If I feel like this now then how the hell am I going to voluntarily walk into that ward for the surgery? Just been in the bath and looked at self in mirror thinking that in two weeks time it will look so very different. Feeling very sorry for myself tonight. How have others coped with these feelings?",
      "MessageIndex": 0,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50730/rambling-thoughts",
      "Title": "rambling thoughts"
    },
    {
      "AuthorID": "Lady In Red",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
      "Content": "I'm not having an immediate reconstruction, my mastectomy is next week. Wanting to be organised and following advice from you lovely ladies I've ordered 2 \"post surgery\" bras from M&S and due to collect tomorrow. Does anyone understand the VAT system? Can I reclaim the VAT tomorrow when I collect them, even though I haven't yet had the op?",
      "MessageIndex": 9,
      "PostDate": "18/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50637/bras-for-reconstruction",
      "Title": "bras for reconstruction"
    },
    {
      "AuthorID": "Lady In Red",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
      "Content": "Zebedee on speed - love the image !!",
      "MessageIndex": 12,
      "PostDate": "15/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50754/i-m-new-and-just-been-diagnosed",
      "Title": "I'm new and just been diagnosed."
    },
    {
      "AuthorID": "Lady In Red",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-in-red",
      "Content": "I picked up a leaflet about this recently and noticed that my nearest hospital offering this is 30 - 40 miles away. My local hospital is a \"Centre of Excellence\" for breast care and so I thought that as something positive I would start a campaign to get this service offered there.   Your positive comments are the spur I needed to get going with it. Wish me luck....",
      "MessageIndex": 4,
      "PostDate": "23/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50995/look-good-feel-better",
      "Title": "Look good feel better"
    }
  ]
}