{
  "AuthorID": "Lady Lynda",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-lynda",
  "Posts": [
    {
      "AuthorID": "Lady Lynda",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-lynda",
      "Content": "It must be really hard for you, but five year olds have no idea about cancer and its treatment. She will be confused and possibly scared about what is happening. I don't know if her parent or parents live with you as well, if not, you are very important to her and you being unwell will be difficult for her. I would suggest you acknowledge her feelings, tell her you understand she is confused and disappointed that you aren't much fun just now. Tell her you don't think it is much fun either, but it won't last. Tell her it will be alright, that you are being helped to get better. She might be worried you are going to die. Maybe she knows someone who's grandparent or parent died. Feelings like this cause small children to act out, they are powerless and cannot do anything else. Maybe someone else in the family can have this conversation with her so you can concentrate on your own needs. I have brought up a granddaughter , she has always felt angry and been intolerant of my being ill. Not because she is uncaring, but because she needs me and cannot deal with me being anything but strong and consistently dependable.",
      "MessageIndex": 3,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93971/completely-fed-up",
      "Title": "Completely fed up"
    },
    {
      "AuthorID": "Lady Lynda",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-lynda",
      "Content": "Thanks Jane, that is really helpful Lynda x",
      "MessageIndex": 2,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77986/recovering-from-lumpectomy",
      "Title": "recovering from lumpectomy"
    },
    {
      "AuthorID": "Lady Lynda",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-lynda",
      "Content": "Hi, I had a lumpectomy nearly four weeks ago. The pain seemed to be improving but where the lump was my breast feels really hard and tender, today it has ached almost all day. Is this usual? I wonder if the hardness is due to hardened fat or whether I could have a haematoma. Can anyone tell me how I might know if I have one, and whether it matters.",
      "MessageIndex": 0,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77986/recovering-from-lumpectomy",
      "Title": "recovering from lumpectomy"
    }
  ]
}