{
  "AuthorID": "ladyinred",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
  "Posts": [
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "Hi Maggie I too am coming up to my first anniversary and have a related question. I initially found a lump and then had a mammogram which detected the fact that it was cancerous. However i was told that since it was Lobular cancer, they wanted to follow up with an MRI scan as lobular cancers often go undetected on a mammogram. They were indeed correct as the MRI detected a second mass which meant that I went from a lumpectomy to a mastectomy. My question is if they only do a mammogram as an annual follow-up, how can they be sure that there is not another undetected lump which does not show up on the scan. Am I within my rights to demand an MRI? I certainly will not feel reassured by a mammogram that all the cancer has been removed in the light of this experience Has anyone else been in this position? Ladyinred",
      "MessageIndex": 5,
      "PostDate": "01/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122389/one-year-on",
      "Title": "One Year On !!"
    },
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "Hi Jojo4 I had FEC- T and after the first Docetaxel my hands became strangely red around the edges as if they were badly sunburt. As time went on they got gradually worse especially after the second dose, and in the end my Oncologist stopped my treatment as he said another dose would make things worse, so my last chemo session was cancelled altogether. I would suggest you keep a close eye on it, but it doesn't sound like your reaction is as extreme as mine so far. It took about a month for my skin to peel and the burns to heal up and fade Good luck with the rest of your chemo Presumably you must be nearing the end if you are on T now Take care Ladyinred x",
      "MessageIndex": 2,
      "PostDate": "01/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123942/palmer-planter-syndrome",
      "Title": "Palmer Planter Syndrome"
    },
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "I too completed chemo almost four weeks ago and have surgery tomorrow but have aches and pains all over especially in my back, and I get fatigued and breathless all the time, especially when I go up stairs. The nurses told me this was normal and mainly due to the body trying to reproduce both red and white blood cells which have been destroyed I had my pre-op yesterday and they don't seem particularly worried, so I guess I have to trust them! Good luck with whatever is your next phase x",
      "MessageIndex": 3,
      "PostDate": "24/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113718/pain-after-chemo-finished",
      "Title": "Pain after chemo finished?"
    },
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "Hi Rach I have found myself in exactly the same position as you, though my surgery was last August 2016. My BCNs said they could not refer me because I am being treated in a different county to where I live, so I asked my GP to do it. My first referral was rejected by the hospital she referred me to, but after 10 weeks, I finally got to see a physio last week. Unfortunately she was no help at all and had never seen lymphoedema or cording before! She gave me some exercises to do but I actually felt I knew more about the problem than she did! As I am scheduled for reconstruction in October, I have not taken it further as the problems may well be different post surgery. I have resigned myself to waiting another 3 months and dealing with the issue then. Meanwhile I am following the exercise sheet given to me by the BCNs after my mx I hope your experience will be more positive than mine! Try to make sure you are referred to an experienced physio Good luck Ladyinred xx",
      "MessageIndex": 2,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138054/pain-running-down-surgery-side-arm",
      "Title": "Pain running down surgery-side arm."
    },
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "Thanks for your suggestion I will look out for it x",
      "MessageIndex": 5,
      "PostDate": "09/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110155/fec-t-allergic-reaction",
      "Title": "FEC T allergic reaction"
    },
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "Hi G n J Thanks for your email They gave me Cetirizine Hydrochoride and I was taking 1 a day initially, but even when I took two it made no difference. I am now on steroid tablets Prednisolone (30 mg a day) and although this has calmed the redness a bit, it has not stopped the itching. Hopefully they will let me have chemo tomorrow Ladyinred",
      "MessageIndex": 7,
      "PostDate": "09/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110155/fec-t-allergic-reaction",
      "Title": "FEC T allergic reaction"
    },
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "I have currently had two chemo sessions for breast cancer with FEC-T drugs and have developed an allergy to one of the many drugs I am having. I went to the hospital for my third session last friday and was turned away as the rash was too bad and a third session could make it worse. Obviously I was disappointed having psyched myself up for treatment but I took the Oncologists advice to defer. He has suggested I swap my treatment and change to the 4th cycle T drugs this Friday instead to see if they can work out which drug is causing the allergic reaction. I have an itchy rash all over my torso including neck, arms, chest, stomach and thighs and it is driving me crazy! Has anyone else experienced this?? I was prescribed some steroid drugs as a last resort if the antihistamine didn't kick in. So far things have not improved (ive taken steroids for 3 days) and I only have two more days before the next session. Can anyone recommend any creams for itchy drug allergies? I have tried calamine lotion, E45 itch cream, Eurax, Anthisan, Aqueous cream, Aqueous calamine cream, Aloe Vera... all to no avail!Most just dry out my skin so I look like a scaly reptile! Please help!!! Ladyinred",
      "MessageIndex": 0,
      "PostDate": "08/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110155/fec-t-allergic-reaction",
      "Title": "FEC T allergic reaction"
    },
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "Hi Amy thanks for your suggestion. i will give the lady a call XX",
      "MessageIndex": 4,
      "PostDate": "09/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110155/fec-t-allergic-reaction",
      "Title": "FEC T allergic reaction"
    },
    {
      "AuthorID": "ladyinred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ladyinred",
      "Content": "Dear all I am having surgery next week and was wondering if anyone can give me any bra advice during my recovery. I am having a skin sparing mastectomy with 'spacer' implant as well as level 2 lymph node removal. I have been told I should wear a 'comfortable' bra even for sleeping to keep the shape, but I am concerned that I will not able to do a bra up at the back and will be unable to get a 'crop top' bra over my head if I cannot lift my arms up. Can anyone give me any tips on what they wore? Thanks Ladyinred",
      "MessageIndex": 0,
      "PostDate": "20/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113638/bra-advice-after-surgery",
      "Title": "Bra advice after surgery"
    }
  ]
}