{
  "AuthorID": "Lady Pepys",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
  "Posts": [
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Fairyelephant, How I feel for you having to worry about this. Julia has given you excellent practical advice already so I just want to wish you the best. Yes, people do have instinctive feelings that something is wrong but they can be mistaken about the severity of it.  I had a nasty discharging cyst for months on my left breast and did nothing about it...that is, I didn't go to the doctor. It cleared up. But another thickened area on the same breast was not benign. They were not connected as far as I know. I had mammo and ultrasound at my first appointment and actually yes, it was quite obvious to the sonographer it was suspicious so they did a biopsy.  Great you have your mum with you to take notes and give you support. I'm keeping my fingers crossed your instinct was exaggerated concern. Keep us posted and chin up... Pepys xx",
      "MessageIndex": 3,
      "PostDate": "21/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105567/first-appointment-tomorrow",
      "Title": "First appointment Tomorrow"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello Bustysusy, Great name! I’m afraid I have no great eyebrow ideas but I bet there are plenty of gals on here who’ve had theirs tattooed. I’ve never had anything fancy done to mine, have lost them twice and am due to lose them again with new chemo next week.  I have a selection of eyebrow pencils etc in light brown which are great. Also a crayon-type thing from Rvlon (Colorstay) which has a brush at one end. Gives a lovely natural look. But I bet you know all about these in3Years plus of eyebrow research. To be honest I actually prefer the neater look my eyebrows had after chemo. I pluck them a bit more now to recapture the glamour! I feel that thinner brows give the face more definition. I can’t say the same for eyelashes. What a drag it is to lose them. I bought lots of false eyelashes but have never worn them! Pepys xx",
      "MessageIndex": 1,
      "PostDate": "27/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153665/eyrbrows-still-thin",
      "Title": "Eyrbrows still thin"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Sonia, Katherine et al, Round 2 of chemo went ahead, to my great relief. I opted out of cold cap this time as hair looks woefully thin so I'm prepared to say goodbye to it. I am also struggling, if I may say, womanfully. It's been decided that for the rest of my chemo I'll have filgrastim injections, the first of which was given to me..day 3..yesterday. I'll hopefully do them myself though in truth I'm being quite dopey and struggling to take my medication correctly! The GP has decided I have a cellulitis infection of my breast..I mean, of course, the mangled surgical site where my lovely left breast used to be. So I am now on my third lot of antibiotics. Oh joy! To be honest, it's not that bad. No changes in taste, no mouth ulcers, no loss of appetite, sense of humour. Just lack of energy. Yes, we shall not flag. Not much anyway. And thank you for remembering. Pepys xxx",
      "MessageIndex": 20,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Katherine, It can hardly be considered vain to want to keep your hair! Of course I would like to keep mine, not exactly a crowning glory but a shiny little mop of fine auburn hair, cut in a bob. I was SO happy that, at 56, I hadn't gone grey. Now, I didn't expect things to turn out quite like this...I'm glancing over at my eerie lookalike wig on its polystyrene stand and wondering when I'll wear it. I'm the sort of woman who doesn't leave the house without lip stick so you can imagine this whole cancer business is a worry!  I haven't been married for 20 years but have had relationships since then. I don't really dwell on whether anyone will want me. I always suppose they will because I see myself as more than the sum of my (missing) parts! Hopelessly optimistic! The last few days have felt quite difficult for me emotionally. I know what you mean about the smell of the chemo room. There's a memory that will stay with me forever. Feeling quite zonked out still on day 5. I know my side effects are nothing like as bad as I feared but god do I wish I had the customary spring in my step! The sea is 5 minutes from where I'm staying with friends. My aim is to get there, walk to town (and back) along the seafront, buy flowers and simply shift myself out of this torpor. Will I manage? I'll feed back later on my adventures. Love to you Katherine and to you all who've posted on here.  Xxx",
      "MessageIndex": 26,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Katherine, You've already had so many lovely replies, not much left for me to add, except I wish you the strength to carry on. Few of us have quite as many major stresses to cope with simultaneously. I certainly remember divorce and house moving..and having to cope alone..quite a challenge. Not sure how breast cancer in the mix would have made me feel. Sometimes you have no choice but to carry on. Didn't Winston Churchill say, 'When you're going through hell, keep going.' Better times are coming, Katherine. Pepys xxx",
      "MessageIndex": 6,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Sonia, Yes, I think the antibiotics are starting to work! Thank you for reminding me..I just looked and much of the angry redness has gone. I managed my injection yesterday and am hopeful they will work well. At least I won't have to wait around for nurses every day. Yesterday three of them turned up..partly, I think, because the house in which I'm staying with friends is a kind of zoo! 5 cats and a lion-headed rabbit..and they wanted a look at the madhouse by the sea!  More later. Xxx",
      "MessageIndex": 27,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Shovel, Waiting to have tests and then waiting for results is such a tense time. I really do sympathise. At least you did something about your lump as soon as you discovered it. In my case I did not, not because I was afraid but because it wasn't a lump but a thickening and I honestly thought it would be a cyst, a fibroadenoma, changes I had had before. Of course I eventually consulted my doctor who made an immediate referral.i didn't torment myself with worry and had an Easter trip to Copenhagen booked to see my brother. I did mention to my brother and his wife though not  to any of my three sons. I don't have a husband.  As far as I was concerned, there was still a good chance it may be benign. Mine turned out not to be but yours still might!  I was glad I didn't discuss with my sons until actual diagnosis because it would have been needless worry for the. They are in their twenties and thirties. My middle son is inDubai and would have fretted a great deal.  I actually got a diagnosis in the ultrasound room so no real delay there. It must have been quite obvious! At that point I started to let the family know. My sons were obviously upset but have dealt with it really well and so, in fact, have I!  I do so hope your lump turns out to be benign, as so many are.. 80% I believe. If it is not then it is still likely, as mine is, to be early and very treatable. Keep these things in mind, try to stay calm and lean on your lovely husband. I will be thinking of you. Pepys xx",
      "MessageIndex": 7,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82190/not-diagnosed-but-terrified",
      "Title": "Not diagnosed but terrified"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Rozzie, I would like to try that.  I've been on Letrozole for 11 months now and the side effects are really kicking in; prinicipally, joint pain, usually in my right leg.  I also have arthritis of my right hip so it's difficult to tell what the source of the pain is.  The hip arthritis is relatively recently diagnosed.  I continue to get about as much as I can  but now walk with a limp, which I hate.  The pain isn't consistent but tends to occur less when I'm at home and more when I'm out and about.  My doctor recently gave me Naproxen anti-inflammatory and it is very good - slow release and lasts a long time.  Sometimes, if I know I'm going to be pushing myself quite  lot, I take 2 Naproxen, 2 paracetamol and a codeine sulphate. Drug addict or what!  I hate codeine but there's no denying it works.  I have an appointment soon with an orthopaedic surgeon and will be interested to see what s/he recommends.  Is the rapid ipuprofen lysine an over-the-counter drug? Pepys xx",
      "MessageIndex": 1,
      "PostDate": "23/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101637/pain-from-letrozole",
      "Title": "Pain from Letrozole."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Jannie, A year since last chemo and 7 cuts?!  My last chemo was 11 months ago and I only have about 4 inches of hair.  I have not had it cut yet because I cannot think what to do with it.  I just push it behind my ears because I look such a wally otherwise.  The other day my eldest son told me I look 'less like Glen Hoddle' now the curls are dropping out.  High praise, eh? Pepys xx",
      "MessageIndex": 13,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100748/does-anyone-have-curly-chemo-hair",
      "Title": "Does anyone have curly chemo hair ?"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Lorraine, This looks lovely.  Very chic. Pepys x",
      "MessageIndex": 53,
      "PostDate": "16/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100748/does-anyone-have-curly-chemo-hair",
      "Title": "Does anyone have curly chemo hair ?"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "It looks lovely, Weeble.  So nice and thick and full of life.  Pepys x",
      "MessageIndex": 50,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100748/does-anyone-have-curly-chemo-hair",
      "Title": "Does anyone have curly chemo hair ?"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello ladies, I finished chemo at the end of November.  My hair has grown back quite curly though initially it just stuck up straight.  At least it didn't grow back grey.  I've always been pleased that at nearly 58 I have hardly any grey hair and I was warned that it might all grow back grey.    Anyway, I quite enjoyed the curls.  My hair has always been dead straight, fine and shiny (and I've always had it in a bob).  What can you do?  I would suppose that the hair will eventually return to its normal state.  Thank you all for making me laugh with your vivid descriptions.  Onwards and upwards. Pepys xx",
      "MessageIndex": 9,
      "PostDate": "02/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100748/does-anyone-have-curly-chemo-hair",
      "Title": "Does anyone have curly chemo hair ?"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "...but I think he must have meant Glen Hoddle circa 1970 as there's not much evidence of curls these days..",
      "MessageIndex": 14,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100748/does-anyone-have-curly-chemo-hair",
      "Title": "Does anyone have curly chemo hair ?"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Halle Berry!  That's a step up from Ena Sharples, Glen Hoddle and the Hand Grenade, isn't it?.. Pepys x",
      "MessageIndex": 18,
      "PostDate": "03/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100748/does-anyone-have-curly-chemo-hair",
      "Title": "Does anyone have curly chemo hair ?"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Nikonblue, I'm afraid I know nothing about atrial fibrillation so cannot help you there.  What I do know about is worrying and I've found that Sunday is a pretty typical day for getting the blues.  I'm 18 months on from initial diagnosis (stage 2b lobular cancer, mastectomy, chemotherapy and radiotherapy and now drugs!)  Even for a pretty upbeat person like me (or how I see myself), waiting for results felt like hell on earth and I still worry when I have tests.  I had to work really hard at distracting myself so I didn't spend ALL my time getting gloomy.  As far as I know, it isn't unusual for surgeons not to get all the margins the first time so may not be as bad as you think.  But thinking doesn't help, does it?! Was the cancer in your left breast and you fear the effects of radiation on the heart?  I was also very concerned about radiation, not particularly for that reason (though it was my left breast which was affected).  My surgeon said radiotherapy does have potential to damage the heart though the risk is very small indeed.  I was more concerned about the state of my breast pre-radiotherapy (purple, sore and inflamed) and whether rads would make it worse.  I had a tissue expander, which was not settling well.  Later I had this removed, the problem turned out to be not rads but chemo, which had caused bleeding under the skin.  Right now, it's quite comfortable. Hopefully someone who has experience of AF will get back to you..but what we all have in common is bloody worry and anxiety over tests.  I'm afraid I sometimes just pour a glass or two of wine and that helps..not that I'm advising you turn to the bottle ! It's hard to concentrate when you're anxious and you need to turn to your favoured distractions, whatever they are.  Sunday's not a great day for us worriers, is it? Italy alone sounds marvellous.  Were you able to enjoy it? Pepys xx",
      "MessageIndex": 1,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100976/waiting-and-feeling-a-bit-anxious-today",
      "Title": "waiting and feeling a bit anxious today......"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello all, I've been injecting the filgrastim for 3 FEC cycles now and the neutrophils are at a very respectable level. And no serious infections. I recognise some people get side effects from this but am not aware of any. Certainly no bone pain. I was a bit nervous about self injecting but am well used to it now.  Love, Pepys xxx",
      "MessageIndex": 6,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85000/filgrastin-booster",
      "Title": "filgrastin booster"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello Lyndsey, How great to hear your news. Hope all goes well for ultrasound and for Wednesday's op. I'll be thinking of you. Love, Pepys xx",
      "MessageIndex": 2,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82509/some-good-news-at-last",
      "Title": "Some good news at last!!!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Fiddlesticks, I hope you get some sleep tonight.  The waiting game is the worst but best to try and do some enjoyable things so that you can forget all this for a short while at least.  I did worry quite a lot but I am 19 months on from initial diagnosis.  Everything seems worse at 3am, I certainly know that, but life still has its pleasures.  Walking is good for you and helps to clear the head.  I wish you the very best.  Consider yourself hugged. Pepys xx",
      "MessageIndex": 5,
      "PostDate": "25/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100391/not-coping-coping-with-the-wait-for-results",
      "Title": "Not coping/coping with the wait for results."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Does anyone have experience of having radiotherapy with cellulitis. I had a mastectomy in June. When I later started chemo I developed redness at the surgical site. I've been on and off antibiotics, which haven't helped very much. Not taken antibiotics for many weeks now. I had my last chemo on 24 November but the redness is still there..sometimes worse than others. Several medics have examined it, including my surgeon. They say there's nothing sinister there, perhaps disrupted blood flow and I shouldn't be worried about radiotherapy. I have a tissue expander, by the way. Any advice gratefully received. Pepys xx",
      "MessageIndex": 0,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87462/cellulitis-and-about-to-start-radiotherapy",
      "Title": "Cellulitis and about to start radiotherapy"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear all, Marks have got some really pretty mastectomy bras at the moment and (most importantly) with matching knickers!  A lovely soft fabric, in a beautiful red, pink and purple swirly pattern.  Finally!   have moaned to them for so long about the dreary range they offer and often without matching pants.  I'm wearing my matching set now and they are just lovely.  FYI, the bras are also available in 'normal', which seems to me rather promising.  I don't see why we one-breasted or no-breasted women shouldn't be treated differently. I did not know that some hospitals will adapt bras for you.  I don't think mine does!  How forward thinking of them.. I decided I need to start swimming again (weight gained during treatment) and asked my local tailor/repair shop if they could adapt my swimming costumes to save me some money.  Will let you know how this works out as I haven't picked them up yet. Pepys xx",
      "MessageIndex": 13,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100464/pretty-post-mastectomy-bras",
      "Title": "Pretty post mastectomy bras????"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear AliG58, My sympathies.  I take a very average 36b/c and I find when I go online to search for bras, they never have my size!  But anyway, Marks, don't get me started.  Didn't know they had a FB page, thanks for telling me.  I've written various letters to them complaining about the pitiful choice they offer.  It's particularly annoying when they spout about their commitment to breast cancer sufferers (my local branch in Hastings displayed a huge poster in one of the windows, showing a half-dozen women with breast cancer in very pretty underwear...but in-store they only had around 3 post-surgery bras in stock.  And no matching pants).   Oh yeah? Well, give us something we'll wear.  And in all sizes! It's true you don't have to wear post-surgery bras.  I've bought full-cupped types and just popped the prosthesis inside but it's less comfortable.  As for wires, forget it. Recently Marks asked me to complete a review about 2 bras I bought from them and because it was less than complimentary, they didn't publish it. Anyway, all moans aside, I'm really enjoying the set I've just bought.  Pepys x",
      "MessageIndex": 15,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100464/pretty-post-mastectomy-bras",
      "Title": "Pretty post mastectomy bras????"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Lou, I found the tissue expander was quite a problem, though my situation was different to yours.  I had the expander fitted in June 2014 immediately after mastectomy.  A very short time after I started chemo, a few weeks later, the 'breast' turned bright red.  Nobody knew what was causing it though suspected the expander.  I never managed to get any refills as the thing kept moving and the port moved to a very awkward place, several inches from its initial position.  My consultant said this sometimes happened and I shouldn't fret about it.  I got it removed  a year later, after radiotherapy, when the whole area was very red and uncomfortable.  It was a pity because actually the culprit turned out to be not the expander but how the mastectomy site had reacted to chemo.  Apparently, chemo had caused bleeding under the skin but they could only see this when they operated.  I liked that the tissue expander gave me some shape but I honestly didn't care for the feeling of it...so rigid!  My consultant told me that some women decide to keep them permanently.  I am now flat as a pancake on my left side but still want to have reconstruction, using my own tissue.  Seeing my consultant on Wednesday to discuss this.  Let's hope you get these issues resolved, Lou.  Pepys x",
      "MessageIndex": 9,
      "PostDate": "20/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99794/breast-expander-has-moved",
      "Title": "breast expander has moved"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Well ladies, my courage seems to have deserted me. My hair looks sad, flat and oh so thin. Wig is still sitting on Its stand. I have no idea if it will fool any of the people any of the time..though it does look good. Soon I will have a bald patch on top so I need to take decisive action. Like you, Emma, I have no desire to look at my bald bonce and don't want to put any of my friends through the trauma of shaving it for me. This is all very silly because I am a confident and flamboyant type..not tried pink hair though!! Not having hair makes me feel very vulnerable. Oh god, what to do?! Pepys xxx",
      "MessageIndex": 29,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hi Ladyb111rd, I'm not the best person to ask about this because gave up on cold cap. My hair had become so thin I thought I'd resort to hats! I therefore didn't have the cap for my second FEC last Monday. I have very fine hair and any loss was going to be very noticeable. I do hope it works well for you. If you have quite a lot of hair to start with I'd say it's worth persevering. Don't know anything about the thing you mentioned. Hopefully somebody else will! Lots of love, Pepys xxx",
      "MessageIndex": 25,
      "PostDate": "07/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Noodles,  I have had one session of FEC with cold cap and hair has been shedding quite a bit. Unlike you I have fine, straight, hair..still quite 'trademark' cut in precise bob. I don't know if I'll continue with cold cap though it does sound as if it could work well for you..a bit of thinning wouldn't be disastrous. My second chemo was due today but can't go ahead yet due to low blood count.. So I'm guessing I'll be looking at more of my hair on the bedroom floor!   My scalp has definitely been feeling tender in the last few days, especially on top! It feels better if I wrap a scarf around it. Good luck with cold cap. Certainly seems the process works best for your hair type. Pepys xx",
      "MessageIndex": 19,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello Noodles, Sounds good! I didn't go for second cold cap because my hair had got so thin anyway but it all sounded more hopeful for you with your hair type. I've decided to wear hats and try to glam up this whole chemo thing! I can't say I feel fantastic at the moment but only day 5 so there's hope. I'm a bit tired but got out and walked a few miles today. And thank god for lipstick! Love, Pepys xx",
      "MessageIndex": 23,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Yes you are right, Judith, it does need breaking in! I'm going to try it for a short period at the weekend and get used to my new glamorous self. Today I went into town wearing my new black yoga cap. It was so hot I ended up running into Peacocks where I bought a very fetching blue  scarf sporting giant birds and tied it very ineptly round my head. With giant sunglasses I thought I looked the business. And god was it cooler to wear than the tight cap.  There goes another clump of my hair! Love, Pepys xx",
      "MessageIndex": 31,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Very very happy to hear your news Onwards and upwards. Pepys xxx",
      "MessageIndex": 8,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82312/great-news",
      "Title": "Great News"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Haha yes..I would probably sell my soul to a consultant with the right accent. Scottish! Pepys xx",
      "MessageIndex": 3,
      "PostDate": "06/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82368/did-anyone-else-develop-a-teensy-consultant-crush-during-their-treatment",
      "Title": "Did anyone else develop a teensy consultant crush during their treatment..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Janet, How exciting for you! I remember falling in love with consultant paediatrician when my eldest son was born 33 years ago. And I have loved many doctors since. However, even though my consultant oncologist is a very dear man, he reminds me of Harry Potter and is not really crush material. I'd best stick with Holby City! Lots of love, Pepys xxx",
      "MessageIndex": 1,
      "PostDate": "06/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82368/did-anyone-else-develop-a-teensy-consultant-crush-during-their-treatment",
      "Title": "Did anyone else develop a teensy consultant crush during their treatment..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "I meant, of course, hanky-panky!",
      "MessageIndex": 20,
      "PostDate": "28/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello Valerie-Ann, I'll agree with the other ladies here and say that walking is the best bet for keeping the weight off.  I started Letrozole just after Christmas, having put on around half a stone after the end of FEC chemo.  Not too worried about it as I am still within normal weight range (11st and 5 foot 8).  I haven't actually noticed Letrozole making me eat more but it's possible it will...early days!  I returned to work at the beginning of January and although I immediately threw myself back into my 20-mile a week walking routine (also to save money avoiding zone 1 on my way to and from work!),  I have recently cut back a bit.  Last week I started radiotherapy (having 5 weeks) and noticed I felt very tired indeed.  So for the next few weeks, I'm cutting myself some slack! Walking is great exercise though.  I was delighted that my recent bone density scan shows no problems whatsoever.  The joints are a different matter altogether!  However, as others have testified, walking does help to ease the aches and pains.  I'd like to start swimming again but obviously not able to until radiotherapy is finally over. I am sure that your weight will come off slowly and gradually and really that's the best way because it will stay off.  One of my work colleagues has been on Letrozole for 5 years (and the previous 5 on Tamoxifen).  She is now fitter than she was before but admits that her diet is far healthier than before she was diagnosed.  Incidentally she had stage 3 cancer with a lot of lymph node involvement so this is very encouraging.  It's good to see that many women do very well on this drug as you usually only hear about the problems. Onwards and upwards. Pepys xxx    ",
      "MessageIndex": 6,
      "PostDate": "01/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89166/weight-gain-on-hormone-therapy",
      "Title": "weight gain on hormone therapy"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Just wanted to let you all know, especially those just starting this awful 'journey' that other, more exciting journeys await. I was diagnosed with stage 2 lobular cancer in April2014 and had a mastectomy followed by chemo, radiotherapy, more surgery (to remove tissue expander) and lots of medication!  I also have to have a hip replacement on 1 March (unconnected with cancer). My relationship ended a few months ago. However, I'm happy to report feeling very happy, independent and hopeful. A few days ago I came out to Marrakesh alone to feel the sun on my face. Staying I a lovely riad, being waited on hand and foot by handsome men...I've been trekking in the High Atlas Mountains, ridden camels, swum (one breast, who cares?), eaten stupendously good food, met lots of people.  My hair is now well past my ears and my new curls look pretty good! I hope all those who are feeling low, scared and alone with this illness will remember there's a life beyond.  Pepys xxx",
      "MessageIndex": 0,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hi Judith, Yes, I did come here alone. Used to going places alone - not all the time of course, but there's a real charm in lone travelling sometimes. One does get hassled here a lot but I'm developing tactics to spend my time peacefully!  There was a moment during my treatment - perhaps more than one - when I wondered if I'd ever regain full confidence but I believe I have. And without wanting to sound like an evangelist, I'd really recommend lone travel. It reminds you of who you were before and who you can be again. I've needed people a bit more during this trip...not quite up to scratch yet...and I've spent more than I normally would on transport and other luxuries but what the hell.  Mountain trekking was great fun.  I had a personal guide, made clear I'd been ill and he was great.  And men still look, which has really boosted my self-esteem, vain creature that I am! Also, and quite importantly for me, I'm starting to write a little here, an activity I always used to enjoy before the cancer treatment made me feel so alien. It really does feel like getting away can bring you nearer to yourself! Pepys xx",
      "MessageIndex": 7,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear all,  Great if I cheered any of you up! I'm back in Britain now and no regrets whatsoever about my jaunt...though it was hard on my dodgy hip! Now, having it replaced on Tuesday so hopefully back to power walking instead of power limping! My overall feeling is that I can cope with whatever is thrown at me and those things I can control, I do. It is certainly true that some of the cancer treatments can drain you of your will to have fun but it's worth a try during the moments of respite to arrange pleasurable things to do.  Going away alone has really restored my confidence in my own strength and I got to do some writing which has made me feel alive again.  And guess what...at some point, I was actually troubled by...ahem...lustful thoughts (mainly about delicious waiter). I was quite surprised by this...and in fact didn't even recognise the feelings at first but when you think about it, lust for life, whether for food, sex, new sensations, all spring from the same inbuilt urge for life and survival. But yes, thoughts of hanky-lanky caught me off-guard. This might be best explored in a new thread? Pepys xx",
      "MessageIndex": 19,
      "PostDate": "28/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "crying! and pretty much off my head! Xx",
      "MessageIndex": 30,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear ladies, many thanks for your comments, which mean such a lot to me. I'm writing this on the rooftop of my riad!  Well, I can't say I don't feel afraid sometimes but working through fears is very exhilarating. When I think what I, and all of you, have been through since diagnosis, frankly everything else seems small fry. Yes, tomorrow is promised to no one so make the most of it. I do remember trying to take this attitude whilst going through treatment but some days were difficult...being bald, constipated and sick can't be anyone's idea of fun. However we do have to adjust our expectations sometimes. I was very lucky I never lost my appetite, my nails or my sense of humour. You really need the last! There's a very handsome waiter here (oh heart, be still!) and I do really fancy him. I'm practising the French for 'If I were 30 years younger, I'd give you a run for your money!'  I expect he knows. What a charmer! Off to town now on the back of his motorbike! Love to all, Pepys xxx",
      "MessageIndex": 12,
      "PostDate": "17/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "thank you Judith. I got my new hip this morning and am just lying there in those sexy compression socks and hoping the morphine will kick in!  Pepys xx",
      "MessageIndex": 23,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "hello all, thank you for your lovely messages. I really need them. I have been in a lot of pain which has taken me by surprise...you know, caring like a baby for my morphine and it is not bloody working. mountain trekking, gorgeous food and handsome Berbers seem so far away. Pepys xxxx",
      "MessageIndex": 29,
      "PostDate": "02/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105312/there-s-light-at-the-end-of-the-tunnel-ladies",
      "Title": "There's light at the end of the tunnel, ladies..."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello everybody, Haven't been on the site for a while but feeling very tearful and desperate for support!  I was diagnosed in April 2014 with stage 2 lobular cancer (3 tumours). I was unable to have a full reconstruction at tge time due to needing radiotherapy. I did have a tissue expander but that had to be removed last June due to problems. Although I now live in Hastings, I still have my treatment in London. I only managed to get my name on the waiting list in May due to a series of mistakes made by the hospital. Made a formal complaint and got a long-winded written apology. But I'm still waiting and getting more and more frustrated. My surgery will be at Broomfield Hospital in Chelmsford. I was called for pre-op assessment on 20 September but since then have not received an appointment. After several desperate phone calls I was told (in a voicemail from the surgeon's admissions officer) that my surgery would now be 'sometime next year'. I have been unable to get through to anyone to ask what this means! I know this reconstruction is classed as non-essential surgery but I feel like a second-class citizen! I live on my own, far from family and need to plan my care. I'm also applying for jobs and don't even know how to manage telling future employers that I may be off for a few weeks. I'm trying to be honest but can't even tell them when this might be.  So this situation is having an impact on my life in every conceivable way. Is anyone else having similar problems? Pepys xx",
      "MessageIndex": 0,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117871/still-waiting-for-diep-reconstruction-help",
      "Title": "Still waiting for DIEP reconstruction! Help!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello Dalefarm, This is really helpful. I did start thinking about having the op privately, even abroad, but think I'll do as you suggest and look to the Spring. Not like I can afford it. I sent an email via the hospital's Breast Reconstruction Awareness website and a nurse called and left a message (I'd said I was confused about the differing opinions on how long the pre-op was valid). It appears it's 6 months and only the MRSA swab has to be repeated. As for how the NHS is run under the Tories, I've sadly had the opportunity to experience it for myself. I do really appreciate my care and wouldn't dream of unfairly targeting any medical personnel in my criticisms but you do sometimes get the impression of a system buckling under the strain. I would really like to move my care to Hastings where I now live but feel it's a case of 'the devil you know'! Did you have DIEP? Pepys xx",
      "MessageIndex": 5,
      "PostDate": "13/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117871/still-waiting-for-diep-reconstruction-help",
      "Title": "Still waiting for DIEP reconstruction! Help!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Mighty Mouse, Thank you so much for your reply. It has really helped. When I made a formal complaint about my care at Whipps Cross Hospital, they pretty much jumped to attention because my concerns were about really serious failings. I was invited to meet with the hospital to discuss. I think they thought I might take legal action (and I did think about it but realised the experience might not help me). The hospital made several changes to systems, which they detailed in their letter of apology. However, one thing they haven't addressed is my reconstruction date. It's one thing to send a pre-op appointment but since then not a word! My BCN was as helpful as she could be and when I last spoke to her in the summer she assured me it wouldn't be much longer.  My consultant at Whipps Cross asked the plastic surgeon (in my presence) if he couldn't speed things up as I'd been considerably mucked about by the hospital. He just shrugged. I do know what all these people are up against but it doesn't make me feel valued. You are right, they forget that we have lives to organise. My family want to help but they also need to plan for it!  Re my BCN, the last time I texted her, she asked me to communicate by email (copying in various other people). I think she'd probably snapped with my moaning so I haven't contacted her since. The poor woman!  What kind of recon did you have? I wonder if it's because I want DIEP (which my consultant) doesn't do, that I'm having to wait so long. Do you happen to know what the 'sell-by' date on the pre-op is? I was told 3 months by the anaesthetist at pre-op but 6 months by the plastic surgeon's PA.  I suppose they just have to keep repeating the pre-op? Pepys x",
      "MessageIndex": 2,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117871/still-waiting-for-diep-reconstruction-help",
      "Title": "Still waiting for DIEP reconstruction! Help!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Lucy, Thank you for this detailed account of your experience. I have not been on the site for quite a while and am feeling lonely and frightened. I start FEC this Thursday at long last and sometimes it feels as though I'm en route to my execution! Currently I feel well. I had a mastectomy on 6 June but there's been a delay in starting my treatment because I decided to come to Wales after my op rather than stay in London. So for me the roller coaster is just starting! Lady M xx",
      "MessageIndex": 2,
      "PostDate": "27/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80243/worried-about-the-tac-side-of-my-chemo",
      "Title": "Worried about the Tac side of my Chemo."
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "I love swimming too but just got my existing swimsuits...bought before cancer diagnosis...adjusted by local seamstress. It is only a question of sewing in a pocket firmly enough so that the prosthesis can't drop out. I am only a B cup on the right side so that may help. Not sure about the 'mechanics' of things for the larger-breasted ladies but perhaps worth trying before shelling out large amounts of cash? The shoulder straps do need tightening so as to lessen the danger of 'fallout '! pepys xx",
      "MessageIndex": 3,
      "PostDate": "15/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105305/swimming-after-mastectomy",
      "Title": "Swimming after Mastectomy"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Minniehaha, How was it? How are you? Pepys xxx",
      "MessageIndex": 8,
      "PostDate": "13/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80978/starting-chemo-and-terrified",
      "Title": "Starting chemo and terrified!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Minnie haha, I know everyone's experience is different but I had my first FEC session last Monday. The worst part of it was cold cap and, frankly, as I chose that I can hardly complain! Every day since then I have expected o  feel awful and so far it's been fine. I try to get out every day for a longish walk and I do feel this has helped me to stay on top. I make an effort with my appearance which also helps. Yesterday i had a little blip when I really crashed but lo and behold alright again today. I am well aware that everything could change but for now I still feel human, have an appetite and some energy. I'm trying to live in the moment! Love, Pepys",
      "MessageIndex": 1,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80978/starting-chemo-and-terrified",
      "Title": "Starting chemo and terrified!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello little one  As someone who’s about to lose her hair for the third time, this sounds interesting. I’ll have a closer look at the site later. The first thing that comes to mind for me is the irritation of not being able easily to get the thing off. Wigs can be very hot! Also, if one’s remaining hair is ‘integrated’ with the wig, what happens when remaining hair drops out, dhich it can do so rather quickly.which I guess necessitates a trip to the practitioner. They seem to have several branches.  I’ll certainly look at this. Perhaps their methods keep the scalp cooler than a normal wig? I have a couple of wigs and have in fact bought a couple of reconditioned ones from a site called Wigbank. Very cheap!  I also have a number of great hats which really do help to divert attention from lack of hair and just feel glamorous. Actually, I hated the loss of my eyelashes more than everything else. But that’s another chapter! Pepys xx",
      "MessageIndex": 1,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153049/hair-loss-lucinda-ellary-experiences",
      "Title": "Hair Loss-Lucinda Ellary experiences?"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello Lynn, Absolutely gorgeous. Well done you! Pepys xx",
      "MessageIndex": 110,
      "PostDate": "01/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "I forgot to say that when asked his personal opinion my oncologist was very clear. If I were his wife, sister, mother, he would recommend the chemo. For some reason this seemed more important to me than knowing that chemo might confer a 2-4% benefit. In fact I spoke to two oncologists, asked both the same question and got the same answer! Pepys xx",
      "MessageIndex": 3,
      "PostDate": "29/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81962/help---results-today",
      "Title": "Help - Results today"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Fiona, I totally understand how draining it is to have pain.  I am really shocked how quickly the hip and joint pain has deteriorated in recent weeks.  Even though I am a very cheerful sort, it does get me down sometimes.  I have been refusing to walk with a stick...now need to revise that decision if I to get about at all.  I don't have a car.  Sometimes, especially when I can't walk after getting out of bed, I don't even recognise myself.  I was a 'power-walker', always the first to get up and dance (still do but god is it difficult).  Pain really changes how you feel about yourself.  As you are a nurse, I guess you know quite a lot about pain relief etc.  I wish I did - I struggle to find the best way of managing and sometimes find myself out and about and unable to walk (bywhich time the painkillers are a bit late!)  I take paracetamol and ibuprofen or naproxen (but have run out of that).  I also have prescription strength codeine and try to avoid it unless things are really bad. I'm assuming your husband knows that when you tell him you don't want to be with him, it's the pain talking?  I live on my own (my children live in London and Scotland) so I tend to keep a lot of how I feel inside me.  Today a friend called and I surprised myself by suddenly bursting into tears about how pissed off I am, hate my house, hate my infirmity and would be better off dead.  NOw that last isn't true but I just wanted someone to know it's not all roses here.  Everybody says how marvellous and 'well' I look and, in my nastier moments, I think they're saying it so they don't have to help me out in any way.  I don't think that's very rational, is it?! Do you also have good days, Fiona?  I hope so.  Have you ever used anti-depressants?  I've taken Sertraline until quite recently and found them helpful but not everybody does.  Fear of death is quite real, isn't it?  And nobody can tell us to snap out of it because we are in the unenviable position of having a potentially life-threatening illness.  If that fear overrides all other pleasures in life,  then it would be worth seeking help, if it's occasional then being more vocal about how you feel, both at home, with your friends and on here, may help.  I know I'm helped by writing things down. Pepys xx",
      "MessageIndex": 5,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100972/feeling-morbid",
      "Title": "Feeling Morbid"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Murphy, I do sympathise. It's disappointing when this wasn't the result you expected. I am sure your oncologist will explain clearly why chemo might be of benefit to you..sometimes it's a combination of factors. In my case, lobular cancer, 3 tumours and a higher than average rate of recurrence. I had micro metastases in one SLN which counts as negative but chemo is often recommended. I was very disappointed as I'd actually been told I would only need radiotherapy! I was not especially happy to be presented with  the choice of whether to have chemo. I understand why it's presented like this but the responsibility frightened me. I took careful note of what was told me then asked for the oncologist's personal opinion. Understanding percentage benefits is tricky and not that accurate. I opted for chemo to give myself the best possible chance.  I'd researched my particular cancer, grade and stage (grade 2 stage 2) and felt chemo was the safest option. And I also had to trust that my oncologist knew more than me! Very best of luck in your discussions and lots of love, Pepys xx",
      "MessageIndex": 2,
      "PostDate": "29/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81962/help---results-today",
      "Title": "Help - Results today"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Fiona, I am so sorry you're feeling like this...surely not mad but sad. I was also a fit woman when I was diagnosed, aged 56.  I'm 18 months down the line and also walk with a limp.  The pain stops me sleeping but then again I wasn't a good sleeper before.  I also worry that pain is an indicator of spread though recent x-rays and scans show arthritis.  The pain is pretty much everywhere now, thanks to a year of Letrozole.  I bloody hate limping and was known for my super-fast walking before! I also forget words and wonder if that's the Letrozole. Do you mind my asking why you are so sure this will be your last Christmas?  Of course I think about these things too...especially today, a grim Sunday on my own.   I moved to Hastings in September and am really struggling trying to get things done in my unfit state. I've had so many little domestic problems in the last few days, it's SO depressing and today I'm tearful and generally cheesed off. Fiona, do you have a partner/children/friends nearby?  You need to talk.  Nobody will think you're mad and certainly not on here.  Consider yourself hugged. Pepys xx ",
      "MessageIndex": 1,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100972/feeling-morbid",
      "Title": "Feeling Morbid"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Jessie, I think cancers which are confined to the breast and haven't spread can be cured by mastectomy. If a cancer spreads then it can be treated but not cured as such. The chemo is a precautionary measure in your case. I was also surprised to hear the word cure but surgery is still the mainstay of treatment where breast cancer is concerned. I had a stage 2 grade 2 cancer.  3 tumours. Tiny bit of cancer in one node so have to have chemo but there is no evidence of spread. Each case is individual. Pepys xxx",
      "MessageIndex": 5,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84669/pathology-report",
      "Title": "Pathology report"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "I also opted for the so-called 'conventional' route as I felt that the treatments offered had been subjected to proper trials and represented my best chance of survival. Now 21 months on from original diagnosis, I'm glad I did as I'm feeling well again. Of course my treatment is far from over.  I respected that my medical team had spent many years of study to be in a position to judge my best course of action.  That doesn't mean I accepted everything in blind faith. Being a questioning sort, I certainly queried some decisions, often at length. I have also complained when I needed to. Isn't this mutual respect the sort of thing that keeps the wheels of the NHS oiled? Pepys x",
      "MessageIndex": 154,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Julia, I took Annie's comment to mean that the majority of invasive breast cancers, left UNTREATED, will kill you sooner or later...and this is less often the case for DCIS.  Surely this is just plain speaking rather than scaremongering? Both of my great grandmothers on my father's side died from breast cancer before the age of 30. This was in around 1910. They were poor, living in Ireland and there was no treatment. My paternal aunt and cousin have  had lobular cancer, as I have, and are alive many years after diagnosis, having gone down the route of surgery, chemo, radiation and drugs.  I certainly think there's room for discussion about alternative healthcare...why not a combination of both, where practical? Having said that, where invasive cancers are concerned I believe the scientifically proven route will  give us our best chance. The fact we are even able to discuss it in this way is a luxury my grandmother never had. Love to all. Pepys xx",
      "MessageIndex": 163,
      "PostDate": "24/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Dulcie, i had 5weeks of rads and worked through them as I would have been on half pay if I didn't. My treatment was at Barts, I asked for the first appointment of the day and was generally in work at the Angel by 9.15. I was on a phased return though and went home after lunch to lie on the settee, eat cake and watch Judge Rinder.  Yes, I know. Disgraceful. You should be prepared to feel quite tired though. I was pretty knackered, and that took me by surprise. I'm also quite an actress and people were amazed. Bask in the glory but don't do too much! Pepys xxx",
      "MessageIndex": 8,
      "PostDate": "11/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105109/how-many-people-worked-through-rt-is-it-doable",
      "Title": "How many people worked through RT? Is it doable ?"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Lisa, My hospital recommends Timotei and happily you can pick this up in the pound shop! Pepys xx",
      "MessageIndex": 4,
      "PostDate": "29/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81933/26-years-old-diagnosed-with-breast-cancer-first-chemo-tomorrow",
      "Title": "26 years old, diagnosed with breast cancer, first chemo tomorrow!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Blue, I seem to have lost the long message I just sent you and I have to go out in a mo. In brief, my history is very similar to yours, including the hip pain, limping. It was recently diagnosed as arthritis. I am in fact having a hip replacement but that seems preferable to bone mets. Not suggesting you will also need this but get it checked out. Ask for an X-ray and appointment with orthopaedic surgeon. Good luck. Pepys xxx",
      "MessageIndex": 2,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103255/worried-i-have-bone-mets",
      "Title": "Worried I have bone mets"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Valusha, I am so sorry to hear your daughter's news when you have already experienced such difficulties in your native country. I hope that your daughter gets the medical care she needs. You will find this site very supportive. It's early days for you both. When the news sinks in more fully you may feel more inclined to ask questions and you will get a lot of help from the wonderful people on here. The people here will understand what you are going through.  Love, Pepys xxx",
      "MessageIndex": 4,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85576/hello-please-help-my-dougter",
      "Title": "Hello, please help my dougter!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "After my mastectomy, in June 2014, I found some very cheap soft bras in BHS...more like a vest really but they gave some shape as they had pockets and small detachable pads.  They still do them.  I think there are similar ones in Peacock.  These days I just look for comfort, not necessarily a mastectomy bra.  Wish I could wear underwires but they are still not comfortable.  I dream of post-surgery bras in beautiful colours with matching French knickers.  Dream on, eh? But I just bought two quite acceptable mastectomy bras in Marks, one red patterned and one cream.  Worth  try. Pepys xx",
      "MessageIndex": 13,
      "PostDate": "19/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99480/bras-after-surgery",
      "Title": "Bras after surgery"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Comper,   Nobody could be more claustrophobic than me but honestly the MRI experience is not bad at all. I didn't take anything and felt perfectly comfortable, not too restricted at all.  Of course you may feel better taking something if it allays your fears but try not to worry. Pepys xx    ",
      "MessageIndex": 3,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87453/mri",
      "Title": "MRI"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Dear Karan, Absolutely delighted to hear this great news! Love, Pepys xx",
      "MessageIndex": 5,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82610/good-news",
      "Title": "Good news!!!!"
    },
    {
      "AuthorID": "Lady Pepys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-pepys",
      "Content": "Hello Yvonne, You ought to get it checked out asap. I had similar symptoms when chemo started and I had a cellulitis infection.Not suggesting you do but it's not worth taking any risks following surgery. Love, Pepys xxx",
      "MessageIndex": 2,
      "PostDate": "11/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84186/do-you-think-this-is-normal",
      "Title": "Do you think this is normal ?"
    }
  ]
}