{
  "AuthorID": "Lady Penelope",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
  "Posts": [
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi Jackie Oh my goodness, what a rollercoaster ride you have had .... and you have made it through chemo ... a real inspiration, thank you for posting.... I just wanted to pick up (in the hope it helps others) that I too had the red, hot, swollen cheeks (with rash on neck and chest - very itchy) and my eyes were so dry I could hardly open them.  It was like really bad facial sunburn.  Onco also non plussed and asked if I had been sitting in the sun (doh! what sun) ..... piriton etc no help.  Tried Body Shop Aloe Vera which was cooling ... took about four days to go down and a week or so to be normal colour again.  Very distressing.   I am on TCHP + ZA. Hope info helps someone else like yours has me :-) Jan x",
      "MessageIndex": 28,
      "PostDate": "22/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi JoDec Thanks for foodie tips .... yeah, nothing tastes like I expect!  All the things I usually love (blueberries, soya yogurt, pitta bread were faves) all taste horrid and bitter..... I've lost weight too, glad it's not just me - onco said 'everyone on chemotherapy puts on weight' so emphatically .... maybe over the whole course we do? ..... and OMG the food bills .....and definite cravings .....  I had a couple of successful nights roasting butternut squash in rapeseed oil (olive oil tastes peppery) ...... I will get in some Knorr chicken noodle, I like the sound of that.  I had some posh bouillon drink stuff yesterday and it made me too thirsty.... today I actually fancy eating a bit and had two boiled eggs (yummy organic free range) and though they tasted okay they didnt taste eggie .... humous tasted humousy and was yum!...... it's so good to know others are trying to work this out, it helps me feel less as if I am floundering ... as if I am not so helpless and hopeless..... fortunately food waste is looked after by our lovely old labrador.  The only thing he doesn't like is rocket and mercifully he has a cast iron constitution! xxxxxx",
      "MessageIndex": 24,
      "PostDate": "06/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi JoJo Oh you poor sausage (no, don't say sausage, she might feel sick!) ..... I will get milk buttons in.  Yeah, that drinking thing is a bummer .... I just wanted to shut down everything when my mouth was so sore.  Yesterday one of the ulcery bits in my mouth fell off! Thank you for nail advice.  I have some grapeseed oil I will try.  I lost half a thumbnail a while back (clearing my old mum's house and trying to do some DIY - a cartoon moment like you wouldn't believe) and it is all skanky now whereas normally I heal and grow things like magic ... so figured something was going on with my nails. Are you on cycle 3?  I think I had a relatively easy time after my first cycle (over two days) .... I'm day 10 on now and feel physically okay.  Even ate a proper dinner last night.  But I am so so emotional.  To date I have had to shut down emotionally (lots of reasons alongside this one) since diagnosis mid Aug .... but now I feel like I am leaking.  Booked some counselling next week.  Seeing onco too so have some more questions that can be answered. Can I ask YOU something?  Have you found the bad side effects of the chemotherapy are cumulative?  Does it get more difficult as time goes on? It's okay to be honest. We are of course all individuals ..... I have just an inkling of anxiety (I;m not an anxious person really) about facing the crap five more times at least .... I have always been so lucky to be well ....  you?   It's a hard journey.  I have to view everything as a new lesson to learn, something to find out about life and the world and myself .... but all this is a bit of a mountain of a learning curve eh? Thinking of you.  Sip that lemonade, girl.  Your surety and your knowledge and your aura of confidence in your messages is such a boost for us all by the way x Lady P and the old labrador ho twater bottle dog(very windy last night ... what on earth has he eaten now?) PS: I work with cats .. did you say you have a cat?)",
      "MessageIndex": 30,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi Scaredgirl34   Oh you poor thing, what a grizzly start .... hoping you feel a bit brighter today and that the pre-chemotherapy anti-sickness kicks in for you promptly today.  I have Ondansetron and Metoclopramide in my home-going arsenal .... Ondansetron really good.  Hoping they can give you that.  I took it before any sign of sickness when I got home on my chemotherapy day (with all the steroids) ... gentle hugs for you on Day 2. xx",
      "MessageIndex": 12,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "HI happygolucky280 Wishing you a gentle day ... I did the whole monitoring hanging around malarkey too ... dreaded being inside sitting down for such a long time but it was fine and I was grateful it was taken slowly just in case.  They found me a side room with a window so I could take gulps of air and feel like I was in the world again so I recommend that if it's possible.  It felt a bit scary when they flushed the line and went onto the next drug but don't be daunted ... the programme of events just rolls along .... like with Scaredgirl, make sure you get your anti sickness dose .... for reference, I was fine (lots of steroids over four days were a bit weird and 'wiring' but kept reactions away I am told so worth it) and I took anti sickness immediately I got home too ... but did experience - after a day or two - numbness around wrist joint and thumb near to Pertuzumab (perjeta) site and then skin discoloration up my arm in same place.  All grist to the mill apparently.  Forwarned is for-armed (or fore-armed?  Oh bring on the bad jokes) ..... be kind to yourself and all your reactions is my motto (and I am usually pants at both so  .....) Lady P xx ",
      "MessageIndex": 14,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hello, JoDec I am really really grateful to you for posting about the d+++ ..... I was fine for six days afterwards then OMG the diarrhoea was utterly shocking!  I only took one tab of Loperamide as the initial dose when the d+ kicked in day before yesterday and that was a mistake ... last night two tabs as per box and this morning there is thank goodness much respite.  My oncologist almost ranted about how bad the diarrhoea would be but I was being all cocky and thinking 'hahaha, not  me, I'm too fit and well ..' serves me right.  Seriously, thank you for reminding me how important it is to keep on top of this end of things, so to speak.  I was apt to take dehydration from lack of fluid going IN as more important (such a sore throat and mouth, ugh) but will be extra careful.  Thank you very much for flagging up such serious issue, really grateful.  I am so sorry you have had such a rough ride with the subject though and hope the road ahead is smoother (if that is an apt metaphor eek?) Lady P x",
      "MessageIndex": 15,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi Sabadee Really appreciate your message today .... just wonderful to hear from someone who is 'out the other side' .... I'm such a tough nut but have found myself a little daunted after the first chemotherapy (at the prospect of five more) and to hear how you are back to work and how it was worth it is so good.  Thank you xxx",
      "MessageIndex": 2,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hey not so Scaredgirl!  Well done ..... PJs, shower, meds .... all to the good.  You and me, one down five to go ..... like to think I am holding hands with everyone .... had a sleepless night and although a great opportunity to catch up with some things I had a few tears ... luckily for me I have a big brother who lives in Sydney so I could send him silly WhatsApp messages ..... if sore mouth and throat kicks in I recommend milk lollies ..... even a Mumsnet recommendation on the box, so can't be bad ..... I don't normally like ice-cream but sooo soothing.  Ate three in a row.  Better than nuthin.  Had an avocado chaser.  Interesting mixture of tastes but everything tastes really odd doesn't it?  I tried a dollop of mayonnaise to help a bit of potato go down only to find the paprika in the mayo set my mouth and lips on fire ..... didn't even know there was paprika in it ..... so now using rapeseed oil as potato and pasta lubricant!   Anyone else any tips on food for we newbies to this chemotherapy malarkey?  So hard to eat without discomfort .... Lady P",
      "MessageIndex": 19,
      "PostDate": "06/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi Sam How are you doing? I just want you to know I'm thinking of you ... AND ... I am at day 9 after first cycle and everything physically feels better ..... hang on in there .... message if you feel pants .... get the milk lollies in .... order some Weleda Oral Ratanhia Mouthwash Concentrate (I used Amazon to find it) ..... and JoDec and I have had a good exchange re helpful food stuffs .... hugs xxx Lady P and her Labrador",
      "MessageIndex": 27,
      "PostDate": "07/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi JoJo So pleased you have Charlie - and so pleased he has you!  Bengals are divine ... we've had a few come through our doors for rehoming because they were acquired as designer animals ... wretched breeders using animals as a commodity, ugh.  I work for one of the large animal charities (but not the RSPCA - I do have them to thank for the start in this career and lots of wonderful training) .... I feel so privileged to have taken a major career change later in life and found a second career I love.  I have to work til I'm 75 (!) financially and hope it will always be with this employer; then it will never be work, just a joy.  How lucky am I?  I used to have 'grown up' jobs and more money but decided every day life was more important after my sister died and life fell off its axis for a while. I live in the South now .... I only have my beloved old lab at home these days ... my cat came back from the States with us but sadly he passed away and my husband always refused to have another in the house ... ...now I get my feline fix through work.  My doggie comes with me on long days.  He enjoys seeing all the people (he loves children) and in the summer he thrives in the air conditioning as he has a heart condition and gets stressed being hot!  I am part of a little sort of offshoot team, so to speak, helping people with enquires and information and mainly working with the cats who need particular attention (usually semi-ferals and long terms strays...) Being revisited by cancer again was the biggest shock.  I had just got working hours sorted at a new location and my poor old mum (dementia and disabled) into a lovely care home and believed I was getting my life back on track  and BAM!  A bolt out of the blue.  I refused to believe the clinician when she said I should really be cautious that the news wasn't going to be good after all the biopsies (three lots, three kinds) ... then the diag was worse than they had thought.  Even then I believed they were wrong, whatever, it would be fine, I'm tough, crack on, I'll manage ... then the oncologist (no bedside manner) delivered the news that it would be Big Five chemotherapy and there was no chance I would keep my hair with the treatment (my asset - long and thick and glossy!) and I could have smacked her (I swore instead - it felt good), that chemotherapy FIRST (I just wanted the boob taken off NOW - common thought I gather) followed by surgery, then probably radiotherapy, then ten years drugs ..... I walked out of her office dumbfounded (rare for me) ..... So here I am .... but I'm lucky ... it was found early by chance because the time lapse between mammograms was shortened as I had had five years of post cancer follow ups after lumpectomies for DCIS first time around and then fallen into the regular NHS system quickly so it was 2.5 years and not 3 ... given it is all over the boob and is HER2 I think that's blimmin' lucky stuff. And I am older and wiser and don't have young children (my sister did - my heart curls for mums) and we KNOW about HER2 cancers now and we have Herceptin on the NHS .... and while my onco is formidable, she is hot to trot on her stuff (and didn't object to the F word) .... And now I have friends on this amazing forum .... thank you to each of you.  I have felt very lonely on those sleepless nights and now I don't - hugs to you JoJo, hurrah for the NHS, three cheers for Macmillan and this forum.  I'd toast you all in champagne but it would taste like mercury at the moment and the bubbles would hurt my bloodied nose ... but heyho, there's milk lollies and flat pink lemonade ....",
      "MessageIndex": 36,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi JoDec Hope you got your day out and about and the sun shone .... it is such a weird tired isn't it ... I've never had 'flu but some say it is like it?  Today even walking up the stairs my knees felt weak, bizarre ....   Hoping you are feeling bright (and got some shopping done too). Lady P ",
      "MessageIndex": 20,
      "PostDate": "06/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Morning JoJo How were the trial Tesco purchases?  Any successes?  I need a mayonnaise substitute to help things slide down ..... at the other end (!) of the subject (erhem, apols) I had to resort to some D+ meds over last two days .... having got food in it ... nah, spare the details .... and now I have the opposite effect ... it's exhausting anticipating the next thing our poor bodies will do, want, react to ...... but at last my mouth doesn't feel like a nest of wasps has been in it. Hurrah!!! xxxx Lady P",
      "MessageIndex": 26,
      "PostDate": "07/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi Lillyrose I had bone and CT before starting chemo and again after cycle 3.  Had nodules on lungs but after second scan they have said benign.  MRI due.  It freaked me out but told it's procedure and I'm having the best care.  Hope that helps. Everything crossed. xx",
      "MessageIndex": 2,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144013/scans-to-check-if-bc-has-spread",
      "Title": "Scans to check if bc has spread"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi, Mumspal I'm just about to start (Herceptin & Pertuzumab 27th, then TC 28th) ... you put it so perfectly  '...certain things change but still human and have my life ....'  Thank you for that.  I must get my soft toofbrush and thermometer on Monday!  I had my long, luscious locks lopped off two weeks ago to believe all this is real .. going to have the bog brush barnet it now is shaved off between cycle one and two.   I wish you calm seas and gentle breezes.  Keep posting please ( er ...I'm not a nautical person so dunno why that particular metaphor came out but there it is!) x",
      "MessageIndex": 3,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138434/start-chemo-today-21st-sept",
      "Title": "Start chemo today 21st sept"
    },
    {
      "AuthorID": "Lady Penelope",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lady-penelope",
      "Content": "Hi Superskydiver So sorry you are experiencing pain. Hoping you have got everything checked (or have the system in place to do so) but I thought it might help to comment that I had really awful sharp pains after two lumpectomies .. they went on for over a year .... but it was all fine.  I remember gasping in the supermarket aisle or when sitting at my desk or in the car and clutching my poor diminished breast shouting 'yowyowyow!' at the zap and dart of pain. Once I had established everything was normal with it all, I still let rip at the pain (we need to acknowledge it - and our colleagues to accept it if your work environment allows) and then reminded myself how bodies need to complain when they are mucked about with and pulled around so much ... and to reflect on how interesting it was that my right boob now pointed nor'nor'east instead of on a normal booblike trajectory for a woman in her early forties.   x",
      "MessageIndex": 3,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139160/pain-in-breast-after-having-a-cancer-lump-removed",
      "Title": "Pain in breast after having a cancer lump removed"
    }
  ]
}