{
  "AuthorID": "latchbrook",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/latchbrook",
  "Posts": [
    {
      "AuthorID": "latchbrook",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/latchbrook",
      "Content": "Hi doublefoobie and a warm welcome to the online community I don't have the necessary experience to be able to help you but I noticed that your post had gone unanswered. By replying it will bump it back to the top of the page where it'll hopefully be seen by someone who does. I'm also going to tag my fellow Community Champions GRANNY59, lesleyhelen and Leolady56 into my reply to you as they look ater this group and might be able to help further. If you don't get any responses you could post your question in ask a nurse and one of the cancer specialist nurses will aim to reply within 2 working days. When you have a minute could you pop something about your husband's journey so far into your profile as it really helps others when answering. It also means that you don't have to keep repeating yourself. To do this click on your username and then select 'Edit Profile'. You can amend it at any time and if you're not sure what to write you can take a look at mine by clicking on my username. I hope you get this sorted soon. x",
      "MessageIndex": 1,
      "PostDate": "03/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177311/menstrual-cycle-post-chemo",
      "Title": "Menstrual Cycle Post Chemo"
    },
    {
      "AuthorID": "latchbrook",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/latchbrook",
      "Content": "Hi Debs16 I haven't been on this trial but I noticed that your post had gone unanswered. By replying to you it will bump your post back to the top of the page where it may be seen by someone who has been on it. While you're waiting for replies you could type the name of the trial into the search facility in this group and look for previous posts on this topic. You can then reply to the posters to ask any questions. If you don't get any replies, or can't find anything when you search, you could post your question in ask a nurse and one of the specialist cancer nurses will reply within 2 working days. When you have a minute could you pop something about your husband's journey so far into your profile as it really helps others when answering. It also means that you don't have to keep repeating yourself. To do this click on your username and then select 'Edit Profile'. You can amend it at any time and if you're not sure what to write you can take a look at mine by clicking on my username. x lesleyhelen Leolady56 GRANNY59",
      "MessageIndex": 1,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177404/monarch-e-trial",
      "Title": "Monarch e trial"
    },
    {
      "AuthorID": "latchbrook",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/latchbrook",
      "Content": "Hi Shihtzu I hope you don't mind me poking my nose in as I don't 'belong' to this group but I wanted to tell you that there is a travel insurance group you could join where you'll find recommendations from other users. To join just click on the link I've created and then choose 'Join This Group' on the page that opens. Once there look for the thread entitled 'Recommended Travel Insurance', I usually manage to keep it on the first page. I hope you manage to get some reasonably priced insurance and have a great time in Australia. x",
      "MessageIndex": 4,
      "PostDate": "14/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174788/travel-insurance",
      "Title": "Travel Insurance."
    },
    {
      "AuthorID": "latchbrook",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/latchbrook",
      "Content": "Hi Chez999 I can't answer your question but I noticed that your post had gone unanswered and by replying to you it will bump it back to the top of the page where someone who has the right experience might see it and reply. While waiting for replies you could also try using the search facility in this group to look for previous posts or post your question in ask a nurse and one of the specialist nurses will try to respond within 2 working days. I'm also tagging in to my reply to you Leolady56, mistymoley and GRANNY59 as they look after the breast cancer group and might be able to help you further. x",
      "MessageIndex": 1,
      "PostDate": "31/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/175607/microcalcificarions-papaloma-s",
      "Title": "Microcalcificarions & Papaloma's"
    },
    {
      "AuthorID": "latchbrook",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/latchbrook",
      "Content": "Hi grannylara/Jenny I think that's a fantastic quote. Would you mind if I used it at the bottom of my signature? xx",
      "MessageIndex": 107,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159720/thought-for-the-day",
      "Title": "Thought for the Day.."
    },
    {
      "AuthorID": "latchbrook",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/latchbrook",
      "Content": "Hi I never knew I don't have the experience to answer your questions but I noticed that your post had gone unanswered. By replying it will nudge it back to the top of the page where hopefully someone with the right experience will see it and reply. If you don't get any replies you could speak to your breast cancer nurse or post your question in the ask a nurse section and one of the specialist nurses will try to respond within 2 working days I'm also tagging some of the breast cancer Community Champions into my reply in case any of them can help you. I hope things settle down soon x Leolady56 GRANNY59 mistymoley",
      "MessageIndex": 1,
      "PostDate": "15/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174696/swelling-four-months-after-mastectomy",
      "Title": "Swelling four months after mastectomy"
    }
  ]
}