{
  "AuthorID": "Leapoffaith",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/leapoffaith",
  "Posts": [
    {
      "AuthorID": "Leapoffaith",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/leapoffaith",
      "Content": "\\\\\\Thank you Flopsyuk, This post has been extremely useful, this is exactly the reaction I have been having, I went for my next chemo session on Wednesday, but I still had pneumonia and my white blood cells were wrong so I couldn't have the chemo. I explained to the Onco I was having a bad reaction, but she insisted I stay on the drug for the full course of 12, we had an argument, I explained I could not cope with pneumonia for three month, and the COPD which would follow, She got very angry with me, rightly or wrongly I insisted she take me off it, so now she has put me on a course of three Docetaxel, she warned me my hair would fall out again, I was thinking I would rather be bald than have pneumonia for three months, and be left with permanent lung damage, I was feeling very upset when I got home and wondering if I had done the right thing, then I red your post, and it assured me I have. Thank you for taking the time to post it.",
      "MessageIndex": 4,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113767/paclitaxel-chemotherapy",
      "Title": "Paclitaxel, Chemotherapy"
    },
    {
      "AuthorID": "Leapoffaith",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/leapoffaith",
      "Content": "Hi, following a diagnosis for invasive ductile carcinoma grade 3, i had a 10cm lump removed in February, in April i started a course of four AC combi chemotherapy, at three week intervals. When i got to the fourth one, the oncologist told me, my blood work was showing liver damage from the chemo, so he changed the drug to Paclitaxel in order to save my liver. He told me the the drug is milder and he would be giving it to me in smaller doses so there would be hardly any side effects, so he started me on a curse of 12 three weeks on one week off per month. As soon as i was given the drug i started coughing, the cough continues to get worse, a couple of days later i found myself in hospital with pneumonia. They managed to clear my lungs, then i had to go back for another chemo, i had a really bad reaction whilst i was on the drip, the coughing came back and i couldn’t inhale at all for a few moments, they stopped the drip for a while and gave me something in my IV, then started it up again but more slowly. By the time i got home i had pneumonia again, back on antibiotics and steroids. My question is this, i am obviously not getting on with this new drug, it is giving me pneumonia which is completely debilitating, can i ask to stop it or change it, are there any other options, am i going to be seen as uncooperative if i refuse to have it, i really can’t cope with continuous pneumonia for the next three months",
      "MessageIndex": 0,
      "PostDate": "23/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113767/paclitaxel-chemotherapy",
      "Title": "Paclitaxel, Chemotherapy"
    },
    {
      "AuthorID": "Leapoffaith",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/leapoffaith",
      "Content": "Thank you for your reply Kacang, I am notoriously bad at reading up on things, I hate this whole sick bubble thing and can't wait for it to be over, however there are times when you really need information in order to make the right decisions, I have been reading up on these drugs now because I have to, I wish I had someone who could read the thing and give me the shortened version, but I don't so I guess I will just have to keep plodding on as best I can. Take care. Michele",
      "MessageIndex": 5,
      "PostDate": "26/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113767/paclitaxel-chemotherapy",
      "Title": "Paclitaxel, Chemotherapy"
    }
  ]
}