{
  "AuthorID": "Lellis",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lellis",
  "Posts": [
    {
      "AuthorID": "Lellis",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lellis",
      "Content": "Good Luck with your Op Lynne I hope all goes well - hugs I had mine 2 weeks ago and have to go back for another op on Sat and  was terrified the first time! but this time Im ok not happy but ok - these things happen. I didnt have a scan just prior to the op just the initial one but I did have the radioactive injection (ooouch that was worse than the op) and the blue dye which is still showing. I thought from what the doc said I would wake up looking like a smurf but it was just the nipple area that was effected so all blue coordinating clothes have been returned t the shop with the red shorts - joking! Julie I hope yur chemo goes well with few side effects, Ill be thinking of you too Im not even facing that prospect until I get these next results back - each day as it comes is my motto at the moment. take care everyone",
      "MessageIndex": 6,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44960/lumpectomy",
      "Title": "Lumpectomy"
    },
    {
      "AuthorID": "Lellis",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lellis",
      "Content": "Thank you for all your replies, sorry I didnt get back sooner - the pleasures of my electronic world were rudely interupted by lack of internet reception!! I have got back in touch with the BC nurse who spoke to me on my initial visit in the nhs and she has been a total star, we have had a couple of telephone conversations that have answered a number of my fears/whats going to happen questions and has pointed out that I can flip back and forwards from either option for treatments. This will be great as I would have had to travel about 20 miles for both the chemo and the RT whereas I can go literally a mile up the road to the local hospital for these. And she has told me to contact her at anytime in the future if I need to discuss any aspect of my treatment or even just for a chat. I have an appointment today with my consultant and thanks to Debbie I now have a list of questions I need to ask without sounding like a bumbling idiot who has been reading too much information on the internet. Good old NHS nurses are definatley the best!! and I dont mean OLD as in old ladies as Debbie is young - Id better stop there before I totally put my foot in it!!  ",
      "MessageIndex": 7,
      "PostDate": "07/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44955/nhs-or-private",
      "Title": "NHS or private"
    },
    {
      "AuthorID": "Lellis",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lellis",
      "Content": "I was diagnosed with grade 3 IDC a couple of weeks ago after discovering a tiny lump, having seen my mum and aunt go thro the same thing and coming out the other side all well and almost healthy (mum started with vascular dymentia around the same time) I really thought - Im strong I can cope with this. And yeah for the last few weeks I have done. I chose to go privately as my employers offer us BUPA but now after having had my initial op very quickley I feel Im being left all alone to cope with my feelings OK within 3 days I have the results back which is good the fact that I need to go thro this all over again as they have found HG DCIS in the surrounding area not so great. but Im begining to think that maybe I should have stayed with the nhs as there seems to be much more support. Has anyne else experienced this? I feel like I need to scream at someone to talk to me!!! maybe m looking in the wrong place for help, my consultant has been amazing but the breast nurse at the clinic is so standoffish there is no way I can open up to her. I feel like Im being railroaded into staying private as it seems my whole treatment has been planned out from the place I will have my chemo to the doc who will do the radiotherapy, I just feel like everything has been taken out of my hands that I have no choices in this. As Im the type of person who has always had to sort and plan my own life, bring my children up alone working everyday of my life almost I feel like m losing control and I need to get that back or go insane! I know Im lucky I had the option of a nice room and quick attention but now Im seriously wondering if its worth it!!",
      "MessageIndex": 0,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44955/nhs-or-private",
      "Title": "NHS or private"
    },
    {
      "AuthorID": "Lellis",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lellis",
      "Content": "Yes I have realised that although I didnt get the wine at supper - maybe I was missing out on something there. I was also told that the nhs surgical team could end up being anyone of a number of people and as I had already been told that \"my lump\" was definatley not cancer but had been caused by a ficticious knock which I couldnt remember having I was a bit dubious. I was only sent for the mammograph to \"be on the safe side\" after a long debate with the doctor involved initially but was suddenly sent to the top of the class and ended up with the consultant in charge of the breast team. I have been told I can flip from nhs to private and visa versa which I will be doing as the private treatment for the chemo and RT is well over 20 miles away in the middle Leeds and although not a great distance, timewise its a nightmare. I know I  have been lucky that Ive had this option thanks to my employers I am not taking anything away from the nhs I have the best BC nurse there is. It was just the quickness and choice of surgeon that made me choose private treatment. One up for the nhs for the support services tho as you said and as I have found out.",
      "MessageIndex": 10,
      "PostDate": "09/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44955/nhs-or-private",
      "Title": "NHS or private"
    }
  ]
}