{
  "AuthorID": "Lemongrass",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
  "Posts": [
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "Hi linsw, how are you today? How was the fireworks? I hope you were well wrapped up. My guardian angel pussycat Lucky was terrified from the sound of fireworks. She practically hid under the cooker all night until it all passed.  Well this is day 4 for me . Sleeping not great I crash about 10.30pm wake up every few hours to go to the bathroom as drinking lots of fluids . No drugs today all finished so hopefully, I will not crash later on. Have had a little heartburn and a few headaches but nothing that I can’t handle . I might have a walk round the garden its quite nippy  in Midlothian today, but the sun is shinning the birds are feeding and singing away.  My Dad is coming to spend the afternoon with hubby & I today so that will be nice plus mums made us some hearty homemade soup.  Im also awaiting my smoothie machine delivery today very exciting.  Hope today is a better day for you Linsw and Anna K . Sending you a hug . love Lemongrass xx",
      "MessageIndex": 7,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    },
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "Hi Gay,  Thanks for the info on sleep . I’m convinced it’s the steroids too but none today but I guess they take a few days to run through the system. I am tired as I can’t get a good decent sleep. Hopefully, tonight will be better.  I will ask to reduce the steroids for second session. Apart from feeling a little tired today I feel ok otherwise. I don’t start T part of my treatment until January. I guess we just have to go through it but at least we are not alone . It’s great being able to help others and get useful info from others too.  Hope you have a good day Gay .  Take care Lemongrass xx",
      "MessageIndex": 8,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    },
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "Hi Angie, I agree the forum is a great way to help us ladies on our journey. It’s not easy at all but it seems to help knowing that there are so many of us in the same situation . It is scary some days , it’s the not knowing, but your not alone :-)  Day 6 is going much better for me, I have managed to get dressed etc for the first time in a few days. I have been managing to eat small things which is clearly helping my energy levels today. You just have to listen to your body , yesterday I was exhausted therefore I just rested all day. I’m normally a person that goes at 100 miles an hour but I know that’s not going to be the case for sometime until I’m through this .  I am having a craving for Kentucky chicken something I don’t eat much so maybe tonight I will get some. I have lost 7 pounds in weight since FEC but thankfully I had reserves to spare . Hopefully , as each day goes by I will get my appetite back and build myself back up before session 2. Tomorrow, I am going to have my bloods tested to see if they are ok.  Fingers and toes crossed they will be fine.  Take care and stay positive lots of hugs  Lemongrass Xx ",
      "MessageIndex": 13,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    },
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "Hi Kim,  The first FEC treatment takes about 3-4 hours approx. If you are cold capping as well then you will need to add an extra half hour or more.  Thinking of you today Kim and wishing you all the best for your first session.Try and drink lots of fluids today , tomorrow and day after.  Sending you you a hug.  Lemongrass Xx ",
      "MessageIndex": 18,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    },
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "Hi Ladies,  Hope you are all doing well. Thinking of you all I hope Kim & Anna K are doing ok. I slightly overdid things yesterday therefore slightly exhausted today. I bumped into someone yesterday that I knew from years ago . We both worked in the same retail company years ago she is now working in my local supermarket. She commented on my new hair style . Then I told her that I cut it short as I was diagnosed with breast cancer. Then I told her all about it. She was diagnosed 5 years ago with exactly the same cancer as me , she has been through all the treatment I am about to embark on. She looks so well and has lovely healthy shoulder length hair .  It was so nice to meet someone who has came through the other side and looks so well. It’s as if I was meant to meet her.  I feel the good spirits are looking after me. It’s so important to be able to talk to each other and help each other through this.  I wish you all a lovely weekend , take it easy listen to your body’s and keep drinking lots of fluids.  Stay cosy love Lemongrass xx Lets just wander here here and there... like leaves floating in the autumn air and look at common little things..... stones on the beach .... flowers turning into berries..... ......from the winds we’ll catch a bit  of that wondrous feeling that comes ... .. not from seeing ...... but from being part of nature ..... from A walk with me by Gwen Frostic ",
      "MessageIndex": 23,
      "PostDate": "10/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    },
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "I have just had my first FEC T chemo session on Wednesday 1st of November. I felt quite sick to begin with but wasn’t actually sick due to the anti sickness pills I’m on . They finish today so hopefully tomorrow I will be ok. I have managed to eat small things but certain smells do turn my stomach. I have felt exhausted and not sleeping great. But I’m putting that down to the steroids which also stop today. Has anyone else had problems sleeping? Yesterday , I felt quite low but today I am much brighter and drinking lots of fluids At least I now have a rough idea what to expect for my second session of FEC. Just the hair loss to deal with next . I’ve had long hair all my life and I chopped it short before my right hand mastectomy on 25th September. I have to say I made the right decision and it certainly has saved time and has made life slightly easier . My wigs are now ready etc so I just now have to wait. ",
      "MessageIndex": 0,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    },
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "Hi Anna K , I wish you well on your journey On Thursday. Fingers and toes crossed for you that it goes well I will be thinking of you. I’m not doing the cold cap either. I have accepted the outcome when it happens and let’s face it our locks will grow back at some point.  Today , is definitely a brighter day for me . I’ve managed to do some things round the house trying to get my steps up. I have all my fruit prepared for later. I’ve also just ordered myself a mini smooothie machine and recipe book to kick start me for the weeks ahead.  A positive attitude,  I’m sure is the key to beating this. We have so much to look forward to next year when we’re through it all. Im having 2 more FEC sessions before Christmas then I start the T part in January . I’m also going to be starting herceptin injections in January once every 3 weeks for a year. But that part is hormones not chemo, my chemo will finish 2nd week of February . Then my hubby and I can celebrate Valentine‘s Day . We don’t normally make a big deal but hey this deserves celebrating .  Wishing you a lovely weekend Anna K stay positive this is the answer to beating this disease. Xx ",
      "MessageIndex": 2,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    },
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "Hi Angie,  I know exactly how you must be feeling about your first chemo session. It’s the unknown isn’t it best not to think too much about it easier said than done I know. Each session we go through each day we are closer to recovery .  I discovered my lump in June and was diagnosed on August 14th . I had a lovely holiday with my husband on September 8 -19th this had been booked for over a year and a half and there was no way I was cancelling it. On the 21st sept I was booked in to my hairdressers to chop my hair short. I’ve had it long for 51 years. I was actually ok and not upset at all. In fact it has knocked some years off me thats what everyone has said family , friends and my hubby. I’m going to have a interlace wig made by Lucinda Ellery which will give me confidence for 8-12 months depending on my hair re growth.  On the 25th September,  I had a right hand mastectomy and Lymph clearance , 24 Lymph nodes removed 2 had cancer. If they didnt have cancer I would not have required chemo. Anyway, the best way to deal with this is to try and stay positive it really does help .  I will be thinking of you as you start your journey on the 13th /14th try and enjoy the time you have beforehand keep busy do lots of nice things. Have a lovely weekend . We can all help each other through this darkness.  love Lemongrass xx ",
      "MessageIndex": 9,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    },
    {
      "AuthorID": "Lemongrass",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lemongrass",
      "Content": "Hi Sophie,  I know you have to have the steroids but boy they do affect sleep. Hopefully , the next time I can reduce them a bit . I start Doxetaxol  in January so we shall see what that brings.  Today , day 6 is definitely much better today, what a relief it is to feel more like myself again. I was starting to get worried that I wouldn’t pick up again but I have. I think I might have a walk round the garden as the sun is shinning .  Take care  Lemongrass Xx ",
      "MessageIndex": 14,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141650/first-session-of-fec-t",
      "Title": "First Session of FEC T"
    }
  ]
}