{
  "AuthorID": "lesley58",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
  "Posts": [
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, My hair started falling out about two after my first chemo, I just wanted some control over this whole situation and got my husband to shave it all off, I finished chemo 5 weeks ago and already have fuzzy covering, I have had lots of compliments about the shape of my head! lol, I'm now getting to the stage that I'm gradually discarding my hats and scarves and I do have a wig but have never worn it, it was not for me. I hope your mum doesn't have the rash for too long and I'm sure she will come to terms with it one positive is that you don't have to worry about the wind rain or doing your hair before going out. For me it was liberating and I still shampoo my head! Good luck to you and your mum warmest wishes. Ro. xx",
      "MessageIndex": 4,
      "PostDate": "04/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93691/it-s-happening--hair-loss",
      "Title": "It's happening- hair loss"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Well done lovely feeling isn't it no feeling yukky, I too got a letter for screening thought it very funny, when I rang to cancel the lady on the other end of the phone was very abrupt ,didn't even say thank you for ringing to cancel. Oh well must have had a bad day? shame lol. Good luck with every thing else one step nearer to full recovery. Ro xx",
      "MessageIndex": 11,
      "PostDate": "28/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94699/done-it",
      "Title": "DONE IT !!!"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hello, So many good and positive things have come from  being diagnosed last August, rekindled friendships from years gone by and we all now meet up on a regular basis. Close friends have become closer, family ties stronger and it has spurred me on to stay in better contact with everyone. My husband now cooks more, it was a difficult time not only with me having cancer, my husband was let go from his last job and he worked international so away for long periods of time, he has since started back to work which is great but he is nearer home now, we still have huge things financially to deal with but its made us  as a couple stronger. I have taken so many positives from this journey and long may it continue. Ro xx",
      "MessageIndex": 9,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90413/can-good-things-come-from-having-cancer",
      "Title": "Can good things come from having Cancer?"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Totally agree Bio oil very good I had a wart removed a few weeks ago on my face and using bio oil has helped a lot with reducing the scar, now using on my mastectomy scar too. Good luck and search around for the best deals too.  Good luck Ro xx",
      "MessageIndex": 2,
      "PostDate": "09/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91024/cream-for-scar",
      "Title": "Cream for scar"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Sorry to hear you have had a a horrible 1st experience of chemo, I too had the same thing eventually had to get doctor out for an injection, which did help me, couldn't keep anything down even water even though I did say that the second day after chemo, I was eating but come the evening was so sick. Anyway since that now had my second chemo, my meds have been added too and I am taking an amazing little pill that has helped immensely its been quartered for me and is so good its called Levomepromazine (methottrimeprazine) bit of a mouthful but one I'm gladly taking, my only side effect is indegestion. Hopefully it wont last too long but plenty of water, I went off tea so try hot blackcurrant Vimto is good ginger biscuits and plain food, I wish you well and it does get better. Hugs. xxx  ",
      "MessageIndex": 8,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87947/post-1st-chemo",
      "Title": "Post 1st chemo!"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi Ladies, I can't begin to imagine how you all feel, as I have only recently been diagnosed still having scans and get my results next week. Its good to know that this forum is here so we can have a moan and I've also been told if I feel like its a bad day then so be, it as tomorrow might be better. We all need to take strength from each other and that one day we will all be ok again. Hold on in there ladies and soon all of this will be a distant memory and you will be a much stronger person, big hugs and positive thoughts all coming your way. xxxxxx",
      "MessageIndex": 4,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82941/feeling-down",
      "Title": "Feeling Down"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, I didnt opt for the cold cap either on the advice too of my oncologist as she was adamant my hair would come out, I had short hair to start with so was not too concerned at loosing my locks, it started after to come out about 12days after, so I thought I'm in charge and I got my husband to cut then shave it off, ot was for me quite liberating and have since enjoyed playing around with scarves bought some trendy hats  and skull caps, I have an amazing hat that I bought from John Lewis in the sale and its a bear head very cute, I have had lots of positive feedback from friends and I have started experimenting with make up something that has not bothered me before but love to now do this. Hope this has helped. xxx",
      "MessageIndex": 7,
      "PostDate": "08/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51392/hair-falling-out",
      "Title": "Hair falling out!"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi  sounds like you have a very caring and loving husband just like mine, to me it's about just being together and knowing you're still about. Myself and my husband have our own bedrooms partly because of my erratic sleep petterns, but we love each other and he is my rock. It dosent mean that one day it won't happen again. Be kind to yourself your husband loves you, for who are. I do feel that we miss out on that closeness but for now it's about getting better stronger and eventually getting back to \"normal\" whatever normal is? I think personally too much emphasise is put on that side of being together, I still love to hold my husbands hand when we go out and we always cuddle. You will be ok.  Warmest wishes love Ro. Xx",
      "MessageIndex": 15,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89802/i-need-to-ask-a-very-personal-question",
      "Title": "I need to ask a very personal question?"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Just to let you know it may be horrible but its doable, just be kind to yourself, do rest and make sure you have pain killers sleep when ever you can, it is pants but I've now come through this, just had my last one and its been a few days of just laying around watching tv, trying to eat something but making sure you drink, let others look after you, it will pass. Hold on in there. Aim for a treat in a few days time if you can't or still don't feel like going out with your friend get her to come to yours and bring some goodies in to you, there will be other days you will get out. I thought I would never reach the the end of chemo but I have, just radiotherapy to go. Your friend will understand. Just be kind to yourself. Sending warmest wishes. Ro. xxx",
      "MessageIndex": 3,
      "PostDate": "05/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92320/hit-a-brick-wall",
      "Title": "Hit a brick wall"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi I had mastectomy yesterday, stayed in overnight as I was groggy and my oxygen levels were low. Now back home and it's uncomfortable but not painful but I'm taking painkillers, hope I sleep tonight and I'm actually quite chilled about it. Just waiting for the next step now. It's not pleasant but it had tone done to make my life better. Hope you are getting pampered as much as me, my family are great as my friends are too. Love and best wishes and a speedy recovery. Xxxx",
      "MessageIndex": 8,
      "PostDate": "07/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83831/mastectomy-tommorrow-now-panicing",
      "Title": "Mastectomy tommorrow now panicing"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "I have a v shape pillow but prefer my normal ones, I do have a small heart shape pillow which will help when the soreness goes down. Speedy recovery to all just waiting for my results now which are due next week. 😘😀xx",
      "MessageIndex": 12,
      "PostDate": "08/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83831/mastectomy-tommorrow-now-panicing",
      "Title": "Mastectomy tommorrow now panicing"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "I was nearing completion of a sleeve on my good side, before all this stuff happened, my right side where the cancer is(was who knows chemo this friday) is tattooed as well on my arm hoping to turn that into more of a sleeve but unfortunately its not going to happen now, due to axillary node clearance. Get advice from your nurse or oncologist to be sure. Learnt a lot from this stuff, especially about nodes and didn't realise how many we have in our bodies and where they are situated, so be careful, but do feel for you as I love tattoos have gone a bit mad since hitting 50 lol. Good luck and hope you can get it sorted. xx",
      "MessageIndex": 2,
      "PostDate": "10/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86854/tattoos",
      "Title": "Tattoos"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Hope your scan went well today I am having mine next week just had an MRI and bone scan today, MRI was a bit weird never stayed so still before, but was good and zoned out quite a few times! Think I actually fell asleep! Like you I was in limbo land and wasn't sure what to think or feel, but glad to say feeling much more positive today, I get my final results in a couple of weeks I hope I can remember everything to ask? I will write a few questions down as I have found this forum very very helpful. Good luck with everything look forward to finding out how your treatment goes, positive thoughts and hugs. xx",
      "MessageIndex": 11,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81543/new-to-this",
      "Title": "New to this!"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Thank you so much for your kind words and words of wisdom, I have days where I forget for some of the time as other things become paramount and life seems normal and its not me its someone else! Then as I said it hits you again and it brings you down, I am very lucky to have a fantastic husband who brings me back and friends that check up on me and wont let this thing inside me eat me away. I am scared and not looking forward to starting any sort of treatment but I know it will make me better, I can't imagine what its really like but soon will discover this for myself. I have already a lovely nurse I can contact, I have sort welfare advice from macmillan themselves and they have pointed us in the right direction.  I love roller coasters that sense of speed and freedom but this is one I'm not relishing, I want to stop and get off and wish that no one else has to go through this at all. On the positive side my family and friends are my pick me ups and can't do enough for me, I do feel cherished and I'm overwhelmed by peoples positivety and I like reading how everyone is coping and finding out all different ways of dealing with this thing. Thank you so much for your reply I really appreciate your response I do have much to be thankful for.  I know everyone in the medical profession works really hard to make it so much better for us. Wishing you well and a huge hug from me.  Ro. xxx",
      "MessageIndex": 3,
      "PostDate": "12/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82590/emotions-arghhhh",
      "Title": "emotions arghhhh"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Yesterday was feeling great after having an MRI and a bone scan, felt that yes! everything is going to be ok as having a CT scan next week then off to see the consultant for results and hopefully discuss treatment plan. Today not so good it creeps up on you all of a sudden and then panic, I have been told 95% success rate where I live but then the niggle? What if I'm in that 5% that are not successful? I just want to get on and get this sorted it seems to be taking ages to get everything in place, I do understand to a certain degree that it won't get sorted overnight, that there are reasons for it taking sometime, I don't like feeling these emotions as I want to be positive and each step is a step nearer to getting better. It has helped a lot by reading everyones else's experience on here and good to know there is always support for what ever we are feeling at the time. I have a brilliant family my parents just sent me flowers to make me smile, my husband a huge support my rock, my sons are brilliant too and my friends well where would we be without friends? I'm overwhelmed by everyones support and positiveness that I will get through this. I am scared of what happens next,but I know I have to go through this process to get to the other side and live my life as normal as it can be again.  I'm experiencing really bad hot flushes at this time due to previously being on HRT thats another thing did the HRT cause this? Don't suppose I will ever really find that out and could I have prevented it?  Well its here now and I just have to deal with it in the best possible way. Tomorrow will be better and I just have to go with this roller coaster of emotions step by step. Least by reading the experiences of all you lovely people I can prepare myself for some of what is to come. Thank you lovely ladies. xx ",
      "MessageIndex": 0,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82590/emotions-arghhhh",
      "Title": "emotions arghhhh"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Thank you KateG today is much better, just scared of whats to come but I know its all for the good and I know I shouldn't hide my feelings and try to put on a brave face in front of anyone, its good to know you are all here and know how it feels at times. Big hug thank you. Ro xx",
      "MessageIndex": 4,
      "PostDate": "12/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82590/emotions-arghhhh",
      "Title": "emotions arghhhh"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Just read your post I too had swollen feet and slight swollen ankles more on my left side than right, bit worrying but I did go and see my GP as I was having pain in my legs too and my knees, don't get me started on my knees! Anyway since seeing GP no swollen ankles or feet at all don't think it was anything he done just another phase we go through and yes it might be to do with the tablets I am on those too, I have been prescribed anti inflamerities for the pain which also has subsided now, I am 4 weeks past rads and 10weeks since my last chemo, think it is a side effect of chemo, left overs grrr, but yes ring your BCN, I have my 12 week check soon so will be adding this to my list of questions to ask, its getting longer lol. Hope you get sorted, but I rest as much as I can with my feet raised I find this helps plus I have a very good friend who specialises in massages so that has helped me too. Good luck. Ro xx",
      "MessageIndex": 2,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95207/swollen-feet-and-ankles",
      "Title": "SWOLLEN FEET AND ANKLES"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi M, First chemo always a bit scary as you don't know what to really expect even though everything has been explained in detail, it does take time to get your head around it, but coming on here helps. I'm now completing my last one this afternoon then radiotherapy after that, I didn't think I would get this far but I have, so you can get there and you will, the time has gone by quite quickly I think because its all planned out with appointments, for me it has wizzed by. Just a few bits of advice let people like family and friends do things for you, don't try to put on a brave face it doesn't help, be kind to yourself, go with the good days and when your'e not up to it just rest.Heed advice from your BCN and your oncology team don't be scared to ask questions, the only stupid question is the one not asked! As for your hair you will know what to do when the time comes, for me it was towards my second FEC it had started to fall out in small amounts, so I decided to shave it off with the help of my husband, it did feel good and I also got a wig but I have never worn it, it sits in the bottom of my wardrobe in its box and there is where it will stay, I don't wear hats indoors and have answered my front door with my bald head, I invested in skull caps and some great hats off of E bay, my family and friends have been a tremendous support, when I shaved my head I posted a picture of me on Facebook so everyone could see what I know looked like  that was unusual for me as I don't like having pics taken but I have grown in confidence in some ways, I have even removed my headwear while walking home from taking the dogs out for a walk, as most people who know me where I live don't batter an eye lid, at the end of the day its other peoples problem not yours you have enough to deal with and it will come back, I don't have any eyebrows or eyelashes either, this does bother me a bit but I have grown used to it now, there is help and support out there for make up and help for tying scarves and head wear. I quoted about shaving my head and I think the quote has been used in a new Macmillan publication? I'm looking forward to warmer weather when I don't have to wear any hats, but just put on a really good sun block! LOL. I hope I have helped in some small way but I'm sure you will get lots of hints and tips from the other lovely peeps on here. Good luck try not to worry too much, it will be ok.  Warmest wishes and positive vibes coming your way.  Love Ro. xxx",
      "MessageIndex": 1,
      "PostDate": "30/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92052/first-chemo-in-a-few-days",
      "Title": "First chemo in a few days"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Excellent news. xx",
      "MessageIndex": 12,
      "PostDate": "06/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82312/great-news",
      "Title": "Great News"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, 3rd session completed, crap weekend felt like gravity didn't want my body to move very far so I didn't. Sons have been absolutley brilliant nipping out to do a bit of shopping, brought me back Mcd's chips yummy! I know not very healthy but so good! Have been told by oncologist all is good, just finished FEC next part to come urgh!! Then got told told 15 sessions of radiotherapy to come whooppee! But I see a finish line ahead so bring it on. I see one of you ladies lives in Norwich Hi I do too!  Its good day today so now off out for a walk with the dogs who have been stuck in with me for the last two days and have been so good, have a good day everyone and its the little things that count that makes me smile.  Sending warmest wishes to all. Ro. xxxx ",
      "MessageIndex": 12,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89175/how-u-all-doin",
      "Title": "how u all doin ?"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "hi littlesusie, I got my diagnosis last week, still sinking in and my original question was how did peeps have to wait before scans and treatment ? As I have to have scans before treatment of chemo starts, appointments for MRI and Bone scan next week and ct scan two weeks after that. I'm still in limbo, I know they (consultant and team) have to make sure that its not spread, but all this waiting about sorry but its got to me anyway each day as it comes and each step too. Good luck hope all goes well. xxxx",
      "MessageIndex": 1,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82262/ct-scans",
      "Title": "CT Scans"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi I was meant to come out on the same day but had problems waking up lol, was enjoying the sleep, I was very scared too but it wasn't as bad as I thought everyone was very good and my recovery was excellent, I don't like the chemo no one does as it effects us all differently, off to hospital tomorrow for a much needed boost of a transfusion, feeling really fatigued at the moment loss of energy and am watching lots of tv, even going upstairs is like climbing a mountain. But I have one more horrible chemo to go before starting radiotherapy. I'm positive and know that this critter ain\"t getting away with anything. I'm sure you will recover quickly but take your time to rest don't be in a hurry better days are always around the corner.  Warmest wishes Ro.xx",
      "MessageIndex": 23,
      "PostDate": "16/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91239/mastectomy-on-monday-and-really-scared",
      "Title": "Mastectomy on Monday and really scared!"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi ChrissieC, Reading your post reminds me of my my experience, I too had a mastectomy on the right side followed by chemo and now waiting for appointments to come through for radiotherapy, I have one more chemo to do its not been easy but grab those days when you are doing well and enjoy, they far out way the tuff  days. Listen to your body, rest and let everyone around give you help and support. I'm nearly at the end of my treatment and am looking forward to when I don't see the 3 week cycle appear on my calender any more. Each of us experience different things, each one of us has had different side effects, but this site will give you the comfort and strength to get through, plus that of your husband, don't know how I would have coped with out mine he has been an absolute star. You can do this, sending you warmest wishes for a speedy recovery.  Love Ro  xxx",
      "MessageIndex": 31,
      "PostDate": "20/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/91239/mastectomy-on-monday-and-really-scared",
      "Title": "Mastectomy on Monday and really scared!"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi we have all been there waiting for results and your mind in turmoil, don't Google it's a horrible minefield, I learnt that early on each one of us is different and you will be treated as to what you need to aid your recovery if it's anything at all! I'm now waiting for results on an axillarynode clearance, but while I'm waiting im chilling im being looked after by my amazing husband and family and friends. We are all here to support each other, what ever the outcome we understand your dilemma. Limbo land, so just take each step as it comes. Positive thoughts coming your way and a hug. Xxxx",
      "MessageIndex": 7,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85327/average-time-for-results",
      "Title": "Average time for results?"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi,  sorry you're feeling this way it's horrible but you are in the right place. Sending you warmest wishes.  Pro xx",
      "MessageIndex": 5,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90280/feeling-sad-angry-lonely-and-lots-more",
      "Title": "feeling sad angry lonely and lots more"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi Just read your post, I finished rads on 8th May as I had a mastectomy the skin around that area was just pink, three weeks later I looked like I've been over cooked it has gone dark feels tight and is peeling just under my armpit, I saw my physio the other day as I had a frozen shoulder as well which is much better now, but she said I seemed to have slipped back a bit with the lifting of my arm as the skin on that side is still healing, I am applying e45 twice a day and leaving off my bra as much as I can as it gets uncomfortable, I was told by my oncologist that after two weeks it would start getting better, which it has but it does feel tight at times, I was told to try and massage the skin around the scar to loosen it and I do my best. Like we don't have enough to contend with! Anyway I hope you get sorted and soon. Ro xx",
      "MessageIndex": 3,
      "PostDate": "31/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94809/post-radiotherapy-effects",
      "Title": "Post radiotherapy effects"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Having the rads was easy and I thought great over the worse now but it just lingers on, I know we can't expect to get back to how we were before all of this but it does get me down. Anyway I did have axillary clearance as well, just some days it feels weird I think the weirdest feeling I've had is wanting to scratch an itch but nothing is there, like my nipple was itching! lol. This time next year it will all just be a vague memory and we will have come out the other side much stronger than we went in. Doesn't matter what you have had done its still the pits. Onwards and up wards. Good luck. Ro xx",
      "MessageIndex": 5,
      "PostDate": "31/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94809/post-radiotherapy-effects",
      "Title": "Post radiotherapy effects"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi Daisy, Sorry to hear its your mum but it is good to know you are supporting her very well and gathering as much correct info as you can. My husband so far has been my second ears and has asked questions at every appointment. I had a mastectomy, my right one was removed and at the time 4 centinal nodes were removed, unfortunately 2 came back with signs of cancer which was followed up by an axillary node clearance, all I can say its uncomfortable but not particuarly painful afterwards and as long as you do the recommended excercises its ok. For me though I have a painful shoulder which started before the fist op and my bcn was really good and I am now receiving phsyio, my results came back and the nodes taken on the 2nd op were clear, I am now off to see the oncologist this coming thursday to find out about my next lot of treatment, 6 sessions of chemo. Each one of us on here has had treatment that is suited to our needs, just take each step as it comes and yes it can be scary, the support on this forum is brilliant and full of useful information. Hope all goes well and your mum and you get the best care. I know I have received brilliant care from everyone I've met on this bumpy journey and have learnt lots about myself and others along the way. Good luck and chin up. xxxx Ro. x",
      "MessageIndex": 5,
      "PostDate": "16/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85881/ladies-with-lymph-node-positive-result-at-initial-diagnosis",
      "Title": "Ladies with lymph node positive result at initial diagnosis"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Thank you so much for the great advice, didn't think it could get any worse, but now I know what to do will be sending hubby on a mission to get me some pills! Can't believe the pain although I can manage it and yes, I now just drop off good job I'm on my comfy bed, could be a bit nasty LOL.Thanks Dream thief you are a star. I will endeavour to struggle on with the brilliant support of my other half. I had read up on the info from the hospital but it still doesn't prepare you for that damn brick wall. I have a treat lined up already with some lovely friends just hope I make it, Waffles mmmm. As for the taste buds yuk everything so bland but I cant stop nibbling, so thats good my appetite is ok. Anyway thank you again positive hugs and warmest wishes. 4 down 2 to go. xx Love Ro. xxx",
      "MessageIndex": 5,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90090/4th-chemo-session-really-surprised-at-how-i-feel",
      "Title": "4th chemo session really surprised at how I feel"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Whoops spoke to soon!    Im creased with pain in my legs and my fingers too! Can't sleep either what the heck is going on? Glad im not sick but this pain is horrible any suggestions very welcome please. Xx  ",
      "MessageIndex": 2,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90090/4th-chemo-session-really-surprised-at-how-i-feel",
      "Title": "4th chemo session really surprised at how I feel"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi everyone, Just had my fourth chemo session was expecting to feel yukky as usual, but surprise surprise, I'm not feeling too bad, bit tired but thats down to perhaps the steroids which keeps waking me up every two hours, which I don't need to take today, as the course has finished. Still taking my indigestion tablets which are brilliant as I suffered really badly with on my 2nd chemo, I can see the finishing line coming quickly now for chemo to end although I have 15 sessions over 3 weeks of radiotherapy to contend with. Today is a good day as was yesterday, tomorrow could be even better, I know I could stumble next week as my immune system might go down, but I'm making the most of getting out and about, albeit a bit more slowly and taking my time. So all is not too bad and its good to share the good times. Sending you all lots of positive thoughts and we can do it kick cancers butt.  Hugs and best wishes. Love Ro. xxx",
      "MessageIndex": 0,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90090/4th-chemo-session-really-surprised-at-how-i-feel",
      "Title": "4th chemo session really surprised at how I feel"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, we have all been where you are at this moment and its a horrible time, all I can say is stop trying to look at other sites as each one of us is different and your treatment is geared towards you getting better. you will have a huge team of people discussing your case not just your doctor they will decide on the best cause of treatment. Try not to think too far ahead and just take each step as it comes. It is worrying but you are in safe hands you have all of us too to support you, some one will know answers and give advice and tips. Try to stay positive but if you have a bad day then go with it and as for the fatigue it's not surprising it knocks you for six, as I was told by a dear friend whose mum has just passed away take the cer out of cancer and you are left with \"can\" which is doable. I have now had my 2nd op yesterday although I feel bruised and tired I know what's coming next to a certain degree but I know I'm going to get better . I want to I have to I'm determined to but only by taking each step as it comes. Positive thoughts and a hug. Xxxxxx",
      "MessageIndex": 10,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85247/breast-cancer-newbie",
      "Title": "breast cancer newbie"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, We too had advice from a welfare advisor it has helped so much, my husband currently unemployed (hopefully not for much longer) and they have pointed us in the right direction. I have since had my heating and electricity reduced and we are now in the process of claiming JSA just so we can get the protection on our mortgage put in place which will be of great help. Good luck with everything one less thing to worry ourselves about. xx",
      "MessageIndex": 1,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82628/macmillan-benefits-advice",
      "Title": "Macmillan benefits advice."
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Thank you ladies for your replies, I too am told how brave I am, but not feeling that at all, I don't mean to put a downer on how positive others are for me as it does help, but when its yourself going through this, there is always that niggling thought at the back of your head saying why? and how do I start to fight this? However somehow we find the strength and the attitude not to let it beat us, sorry about spelling mistakes as if thats anything to worry about LOL! I know I can ring my bcn and ask more questions but think I'll leave it for this weekend and try to get my head around about what is going to happen in a couple of weeks. I know there is perhaps an answer as to why surgery again but would like to know why? I'm not sure id reconstruction is on the cards as looking at my op its very flat, I don't look too often as I still can't believe its me, I do have a huge support network with family and friends and my husband is just amazing, unfortunately at the mo he is currently unemployed, so I dread the call when he gets another job, he doesn't want to return because he wants to be here to support me and our family, but needs must as the benefit paid at this time is not enough to pay all our bills etc. We do have a bit of savings left and could just about manage, sorry to go on but this year has been one of the lowest for us. All I can say is that it has to get better for all of us.  I really appreciate your time in replying and together we can get through this I will keep you updated and hopefully tomorrow will be a better day. Hugs to you both and keep up the good fight as they say. Love Ro xxxx",
      "MessageIndex": 3,
      "PostDate": "17/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84458/2nd-op-for-lymph-node-removal-after-mastectomy",
      "Title": "2nd op for lymph node removal after mastectomy"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Received results from mastectomy today and I have to have 2nd op to remove lymph nodes, I'm booked in for 3rd november. Doesn't matter how you prepare yourself its always a shock to the system, I put on my brave face asked questions, while my bcn removed the rest of the dressing from my wound. Had another peek at the scar  and was still a bit freaked out by it, but I suppose its healing and it will be ok, just feeling crappy about the next op and then the treatment continues. I know its each day as it comes and each step and the fight is on, but today? No don't feel like that at all so its cake tea and choccy biscuits. My consultant also told us that the tumour removed was  about 2inches big and I'm stage 2, but I knew that from before. Just we are devastated today as we never thought of the outcome of todays results. I'm going to be put in a trial too for lymphobia which will last over the next 3 years, I'm hoping this will help other sand myself along my journey.   Ro xxxxxxxxx ",
      "MessageIndex": 0,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84458/2nd-op-for-lymph-node-removal-after-mastectomy",
      "Title": "2nd op for lymph node removal after mastectomy"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi Rebecca So sorry to hear you are feeling apprehensive, scared and all the other emotional feelings this bugger brings with it, happy to say you have come to the right place. I found and gained a lot of comfort and strength from reading how others have coped. You will find an inner strength to see you through, if it's ady when you don't want to be bright and breezy then don't just snuggle up watch crap tv but drink plenty of water, would say wine but it's the after effects and we go through enough as it is, with out self inflicting more torment. Be kind to yourself, work towards a treat and make the most of good days. I had first chemo over week ago felt like absolutely and adamant I wasn't going to do it again, I am happy to say today is a good a good day although I'm under house siege not allowed out to the shops or anything like that. It will get better let others support you. Take care christmas hugs wishes coming your way, be positive for yourself. Xxxxx",
      "MessageIndex": 10,
      "PostDate": "23/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87315/the-unknown",
      "Title": "The unknown"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Just read your message please don't fret too much, I too have had a mastectomy and node clearance even had an axillary node clearance, during october and november, my advice just do your exercises after your op when you are ready, I was suprised that it wasn't really painful just more uncomfortable but that eases, take pain killers to help, make sure you rest, let everyone else help and support you. I will be starting chemo tomorrow not nice but its part of the recovery process.  I was absolutely bricking it going in for my op, but everyone was so kind and put my mind at ease my consultant was very good. BCN nurses, every one I have come across  on this \"journey\" has been so supportive and here on this forum. You will be ok, as I'm the worlds worst patient and a scaredy cat too. But I done it and am here to say its ok. Sending you a hug and best wishes for a speedy recovery, hope you gets lots of TLC and chocolate and yummy cakes too, kept me going. Ro, xxxx",
      "MessageIndex": 8,
      "PostDate": "11/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86878/mastectomy-and-lymph-nodes-removed",
      "Title": "Mastectomy and lymph nodes removed"
    },
    {
      "AuthorID": "lesley58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lesley58",
      "Content": "Hi, Finished rads 4 weeks ago, I too have painful knees, legs, etc. Saw my doctor yesterday have been prescribed anti inflammorities (sorry about spelling) but I am happy to say also that I have been feeling better ad the pain is now not so bad, only started tablets yesterday, so I can't put it down to them just yet. But reading the info in with the tablets, it says may cause muscle pain lol. Amazing ! Hope you feel better soon. Every day a step or two nearer to feeling great. xx",
      "MessageIndex": 4,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95179/dodgy-knees",
      "Title": "dodgy knees"
    }
  ]
}