{
  "AuthorID": "LH60",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lh60",
  "Posts": [
    {
      "AuthorID": "LH60",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lh60",
      "Content": "Thanks for your reply! I’m seeing surgeon today to discuss mastectomy with reconstruction! I’m probably verging on going down that route as I am not sure I could deal with a third failed excision!  Just wondering why you say with hindsight you wish you had tried for a third time?  X",
      "MessageIndex": 11,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181288/mastectomy-or-re--excision",
      "Title": "Mastectomy or re- excision?"
    },
    {
      "AuthorID": "LH60",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lh60",
      "Content": "Thanks for sharing your experience! Hopefully I can make my decision after a consultation with surgeon who does mastectomies with reconstruction this morning! I’ve been so torn between both options! My emotions are all over the place and I really can’t carry on like this! I’m hoping a decision will help!  Xx",
      "MessageIndex": 12,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181288/mastectomy-or-re--excision",
      "Title": "Mastectomy or re- excision?"
    },
    {
      "AuthorID": "LH60",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lh60",
      "Content": "Thanks for your response- it’s exactly right when you say it’s my choice! I’m just fluctuating all the time between both options! I have an appointment with surgeon who does mastectomies with immediate reconstruction next week, so maybe I’ll be clearer and more able to make an informed decision after that! I’ve been struggling emotionally and so, even though I’d really like to try one further re-excision, I’m not sure I could take another failed op! I’m also aware that my boob is already quite distorted after two ops and will probably look even more so after a third!  Are you pleased with results after reconstruction? How painful did you find it was compared to lumpectomy? ",
      "MessageIndex": 6,
      "PostDate": "18/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181288/mastectomy-or-re--excision",
      "Title": "Mastectomy or re- excision?"
    },
    {
      "AuthorID": "LH60",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lh60",
      "Content": "Oh my goodness- I’ve just read your profile and you’ve certainly been through a lot!  I’m so torn between giving the wide local excision one more go and then having a mastectomy if that isn’t successful or going straight for mastectomy now!  Spoke to BC Nurse earlier and she thinks I should meet with the consultant who does reconstruction and discuss pros and cons , then make my decision! Have hit appointment with her next Wednesday! A big part of me really wants to keep my breast but then I don’t know how I would cope emotionally if margins weren’t clear after a third op!?  Everyone keeps telling me I’m strong- and I usually am but I just don’t feel it currently! I’m struggling being off work ( I’m a primary school Headteacher) and yet I can’t focus on things at all!  You are amazing the way you’re coping with all that’s happening to you! I need to try to be more positive! Easier said than done though!  Thank you so  much for replying to my post! It helps to get the perspective of someone who has first hand experience of BC!  Sending you hugs and good wishes for the future! ",
      "MessageIndex": 2,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181288/mastectomy-or-re--excision",
      "Title": "Mastectomy or re- excision?"
    },
    {
      "AuthorID": "LH60",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lh60",
      "Content": "Hi I’m new to this group and would welcome advice to help me make a choice! I had 30mm invasive cancer removed via lumpectomy ( lymph nodes all negative)and then had a re- excision as there was DCIS in margins! Yesterday I was informed that there’s still DCIS in margins and given choice of a further re- excision or mastectomy with reconstruction! I’m gutted as I was really thinking all would be fine after re- excision and I would be moving on to radiotherapy alongside hormone therapy treatment! Now I’m a mess and keep fluctuating between both types of surgery! I just feel so emotional! Can anyone advise me? ",
      "MessageIndex": 0,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181288/mastectomy-or-re--excision",
      "Title": "Mastectomy or re- excision?"
    }
  ]
}