{
  "AuthorID": "Lil Nic x",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lil-nic-x",
  "Posts": [
    {
      "AuthorID": "Lil Nic x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lil-nic-x",
      "Content": "Hi Hannah So sorry to hear your sad news but uve found the right place to talk through it and get plenty of support. I'm only 32 and was diagnosed with invasive breast cancer with a 3.9cm lump. Like you I had biopsies, mammogram and ultrasound on the same day and then went for MRI. I have been through my lumpectomy and node removal. The node removal is not very pleasant but the lumpectomy has been ok. The worst pain is the bruising. I had mine done through my nipple and was lucky as my node removal was done through the same scar. I was in and out of hospital the same day. I find I can only lie on my back in bed as when I lie on my side it feels like all the tissue in my boob is going to one side. It's quite uncomfortable. Unfortunately I don't have children so at the moment I am going through the egg collection process having to inject myself everyday. Once this is all done I have to undergo FEC/T chemo for 6 months, then radiotherapy and also hormone tablets for 5 years. It's gonna be a bumpy ride but I'm gonna get through it and come out stronger at the end. It's quite difficult to write everything down without sounding like an essay so if you have any questions at all just give me a shout. The questions that seem the most silly will probably help you more than the sensible ones :) Please be careful what you read there is a lot of crap on the net. I'm here if you need anything hunni Look forward to hearing from you Lots of hugs Nic xx",
      "MessageIndex": 5,
      "PostDate": "14/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82764/newly-diagnosed-35-years-old",
      "Title": "Newly diagnosed :'( 35 years old"
    },
    {
      "AuthorID": "Lil Nic x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lil-nic-x",
      "Content": "Hi Hannah You will be strong next week I just know it. You find strength I have no idea where it comes from but you just do. Suppose it's the knowing we just have to get on with it. Stay positive chicken we ate all here with you :) I know you're worried about the scarring ( I was scared) but then you just have to think we are the lucky ones as we get to keep out boobs. I am a 34 D and my boob that had the lumpectomy is now a size smaller. I can get taut very to make them both the same size but I'm not bothered. I just feel thankful to still have them both. Unfortunately my lymph nodes were not clear. They only took 2 and found a pea sized cancer in 1 of them. The day I was told about this I was too excited because I got clear margins so did not ask about the lymph node. Been having a few scary thoughts lately so I'm gonna ask my surgeon a few questions on Tuesday at my next check up. The egg collection process lasts roughly 3 weeks if all goes to plan. You say you wouldn't be brave enough to inject yourself, truth is I'm not my boyfriend David has been doing it for me haha. Think I make him a wreck everytime haha. We are freezing embryos not just my eggs so that just basically means we mix my eggs with David's stuff (technical term) then they get frozen. It's amazing what they can do. Well done you on thinking so positively and setting yourself goals for next year. U go girl!!!! Lots of hugs Nic xx",
      "MessageIndex": 11,
      "PostDate": "14/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82764/newly-diagnosed-35-years-old",
      "Title": "Newly diagnosed :'( 35 years old"
    },
    {
      "AuthorID": "Lil Nic x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lil-nic-x",
      "Content": "Hi Thanks so much for your reply. Yeah you're right it's all really confusing. There's so much to take in. I'm a little disappointed as at my consultation they never went through the grade with me and my BCN did not go through my pathology report. I was just advised I would need 6 months of FEC-T. I might email my BCN and ask a few questions 😊 Did you find out you're percentage of re-occurrence? I know this is something that is available but is not offered a lot? Hugs Nic xx",
      "MessageIndex": 2,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82574/how-long-after-surgery-do-you-find-out-stage-grade",
      "Title": "How long after surgery do you find out stage/ grade?"
    },
    {
      "AuthorID": "Lil Nic x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lil-nic-x",
      "Content": "Hi Peeps I'm 32 diagnosed with invasive breast cancer. I have had a 39mm lump removed and 2 lymph nodes one showing positive for cancer. I currently have a hematoma which is draining.i start fertility treatment tomorrow and am awaiting chemo consultation. I have been advised I will need 6 months of chemo, then radiotherapy. I have read a lot of stories and most people seem to know the stage & grade of their cancer. I assumed I would receive a pathology report at my consultation after my surgery but that hasn't happened. I'm just wondering if someone can advise at what part of the process do you find out the stage and grade of the cancer? Thanks Nic xx",
      "MessageIndex": 0,
      "PostDate": "09/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82574/how-long-after-surgery-do-you-find-out-stage-grade",
      "Title": "How long after surgery do you find out stage/ grade?"
    },
    {
      "AuthorID": "Lil Nic x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lil-nic-x",
      "Content": "Hi LittleSusie Sounds like it's all over the place for you at the moment. Hope your CT scan goes well and no little shits are hiding anywhere. Thanks for your advice I really appreciate it. Iv always had someone with me when I go and I think that's why I hold back a little because I don't want to worry anyone. Might go on my own on Tuesday and ask about a few things that are on my mind 😊 Good luck again, fingers crossed Big Hugs Nic xx",
      "MessageIndex": 6,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82574/how-long-after-surgery-do-you-find-out-stage-grade",
      "Title": "How long after surgery do you find out stage/ grade?"
    },
    {
      "AuthorID": "Lil Nic x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lil-nic-x",
      "Content": "Hi Sandi Thanks for your reply. I think that's pretty disgusting that you had to go through your report yourself. Hope it all made sense in the end. Looks like I will have to request mine. I'm back to see my surgeon on Tuesday and really want to ask him but they just always seem so busy. I'm still a bit baffled as to why they wouldn't want to give it or go through it with us. Oh well hey ho. Big hugs Nic xx",
      "MessageIndex": 5,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82574/how-long-after-surgery-do-you-find-out-stage-grade",
      "Title": "How long after surgery do you find out stage/ grade?"
    }
  ]
}