{
  "AuthorID": "Lilleybumble",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
  "Posts": [
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "I just want to know how long in general that people have to wait for appointments to get to see lymthadema clinic?  I've seen my oncologist 8 weeks after my last RT and I have breast swelling,hardness and less movement in my arm due to pain.  She said she would refer me to lymthadema clinic but hopeful that swelling should go down if I massage daily. The appointment has just come through and it says a waiting time of 4 to 5 months. Wow,can't believe it's so long to wait. I've been doing a phased return to a very active job and she said that basically I'm over doing it. My work place have been very good but are stretched. With all the covering that I have needed them to do and my manager is pulling her hair out that my gp has again kept me on 4 days a week rather that being full time for another couple of weeks.  Does the swelling just go down. It has only gone like this since I started doing more ie being at work nearly full time. The fatigue is wiping me out as well.  I had lumpectomy SLNB stage 1 invasive cancer and 15 rads and 4 boasted rad sessions.  By the way I'm a lifeguard and a swimming instructor at a private school full time. Very intense training and full fitness required. I can be standing in water teaching a variety of classes for up to two and half hours at a time.  Advise please anyone  Thanks Lil x",
      "MessageIndex": 0,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104668/waiting-times",
      "Title": "waiting times"
    },
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "I'm having the same problem. Saw my oncologist 4 weeks ago after rads had finished and they said it was the start of Lymthadema in breast. It's very swollen,painful, dimpled and darkened in colour. They said they would refer me to lymthadema clinic but letter came saying 4 to 5 months waiting list. In meantime gentle self massage and don't overuse arm!! There is a real tightness in my arm pit which is limiting my movement. GP has reduced me back to 4 days work a week and limited hours and duties. I'm u able to do my job fully which is causing great repercussions at work - I'm not popular now at all and putting strain on staffing resources -I'm supposed to be a lifeguard and I'm a swimming instructor. The whole bloody situation is making so drained and down. Really just want to be back to normal now. I can't swim properly due to pain and my passion is running which I can't do due to pain. I'm usually a dd/e cup but having to wear a h to accommodate swelling. There is no end that I can see from this .",
      "MessageIndex": 6,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105612/breast-pain-months-after-radiotherapy",
      "Title": "Breast pain months after radiotherapy"
    },
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "I'm having the same problem. Saw my oncologist 4 weeks ago after rads had finished and they said it was the start of Lymthadema in breast. It's very swollen,painful, dimpled and darkened in colour. They said they would refer me to lymthadema clinic but letter came saying 4 to 5 months waiting list. In meantime gentle self massage and don't overuse arm!! There is a real tightness in my arm pit which is limiting my movement. GP has reduced me back to 4 days work a week and limited hours and duties. I'm u able to do my job fully which is causing great repercussions at work - I'm not popular now at all and putting strain on staffing resources -I'm supposed to be a lifeguard and I'm a swimming instructor. The whole bloody situation is making so drained and down. Really just want to be back to normal now. I can't swim properly due to pain and my passion is running which I can't do due to pain. I'm usually a dd/e cup but having to wear a h to accommodate swelling. There is no end that I can see from this .",
      "MessageIndex": 21,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105612/breast-pain-months-after-radiotherapy",
      "Title": "Breast pain months after radiotherapy"
    },
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "Hi Karen - I totally know how your feeling to some extent. I have also found a lump since my lumpectomy and I also have cording down and around my boob which is painful. I'm due a scan at 10am tomorrow in breast care unit then onto Dermatology for 11am as I have a mole that's changed shape and gone horrible and my first rads treatment is at 1.15. I'm just hoping its nothing to postpone my treatment moving forward as it seems such a long wait in between procedures. I'm on tamoxifen and started it 4 weeks ago but I'm experiencing chronic joint pain in my knees and elbows/wrists. Feel very apprehensive this evening.  Take care  lerain x",
      "MessageIndex": 3,
      "PostDate": "21/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100195/scared-again",
      "Title": "Scared again"
    },
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "Hi. It's been there for as long as I can remember but over the past year or so it's grown and totally changed shape and is itchy and gone bobbly in one part and it's started to bleed.  Pointed it out to my GP as I got concerned having been diagnosed with BC.  Lerain x",
      "MessageIndex": 5,
      "PostDate": "21/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100195/scared-again",
      "Title": "Scared again"
    },
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "Asda have some very soft support crop tops in and at £6 each they don't break the bank. I'm 34f and needed support day and night. I had lumpectomy 4 weeks ago along with sentinel lymph biopsy. Sleeping with a pillow under your arm has been my my comfortable position in bed. Waiting to start radiation therapy still. ",
      "MessageIndex": 9,
      "PostDate": "05/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99480/bras-after-surgery",
      "Title": "Bras after surgery"
    },
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "I was a fit 48 who was diagnosed with BC in August. Lumpectomy and SNB in September. Clear margins and it hadn't spread, they removed 1 lymph node. Started tamoxifen 18th September and I've completed 12 out of 19 radiation treatments so far. Pretty straightforward outcomes except for my joints (and the sore skin from rads of course) does anyone else really suffer with aching joints on tamoxifen ? I literally feel so old I struggle to kneel down on the floor let alone get up. I take the dog out for a walk and I'm knackered and aching all over. Is it thr radiation treatment ? I sleep for England at the moment. I'm managing 3 hours in an office each day before rads but towards end of week I'm on my last legs. Is 7 weeks long enough to decide if tamoxifen is the way forward. I can't go on like this. My BC nurse said to give it a bit longer to get into your system. Also I've had a pain deep in my right calf which hurts and worried it could be DVT ? Any advice please, thanks  ",
      "MessageIndex": 0,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100978/quality-of-life-7-weeks-in",
      "Title": "Quality of life 7 weeks in??"
    },
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "Thank you for your replies. I've been for rads number 13 today and saw the BC nurse over there. She is sending me for a bone scan next week after all rads have finished. I've also had a blood test done today. She suggested I get some stronger pain killers from my gp in the mean time. She also said to buy some Glucosamine tablets.  Xx",
      "MessageIndex": 5,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100978/quality-of-life-7-weeks-in",
      "Title": "Quality of life 7 weeks in??"
    },
    {
      "AuthorID": "Lilleybumble",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilleybumble",
      "Content": "I was diagnosed in August 2015 aged 48. Had a lumpectomy along with 19 radiation therapies and was put on tamoxifen for 5 years. Three months on the tamoxifen and the side effects were so awful that I decided to stop and take my chances. I have a very active job which requires me to be physically fit.I have lymtheodema in my arm and my breast,my breast is constantly swollen. I've had two referrells back to breast unit with new lumps I'd found in my affected breast to be told they are cysts. My trouble is that I can't stop thinking that I am going to get brest cancer again. I feel paranoid totally all the time. Does anyone else feel the same? I have periods of time when it's not foremost in my thoughts but everyday I have to put my lymtheodema sleeve on my arm it's a constant reminder of Cancer along with wearing a bra that fits my swollen breast and padding out my normal breast side. It just never leaves my bloody head ",
      "MessageIndex": 0,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126194/does-cancer-ever-leave-your-thoughts",
      "Title": "Does cancer ever leave your thoughts?"
    }
  ]
}