{
  "AuthorID": "Lilybeth",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilybeth",
  "Posts": [
    {
      "AuthorID": "Lilybeth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilybeth",
      "Content": "Hello Snowie I'm interested your silicone op was in March.   I had a mastectomy and immediate reconstruction with a permanent implant mid July and get the same feeling.   The onc says I shouldn't be feeling any pain, so I've been wondering what might be going wrong and if this is normal. My breast is so swollen, tight and solid most of the day still and goes down very slightly if I have 8 or more hours in bed at night.   Through the night I get a pain like a muscle pulling across to the new lowest point of my breast as I roll into a different position and then it settles down  and I drift off to sleep again.   Still get dreadful pulling muscle sensations through the side and top of the breast and these areas are sore to touch.   Also if I rub my arm or my shoulder blade my breast fizzes and pulls.   Sometimes it's like having churning twisting lumps that make me shy away from doing the exercises for the second half of the day.    They just pull too much to seem useful. Has your BCN or onc given you any indication now how long it will last?  I'm not due to go back for another two months but my BCN simply asked me if the onc knew and the onc said I should adjust my expectations for the length of time it will take me to recover. Lilybeth  ",
      "MessageIndex": 2,
      "PostDate": "21/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52089/discomfort-still-after-implant-reconstruction",
      "Title": "Discomfort still after implant reconstruction"
    },
    {
      "AuthorID": "Lilybeth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilybeth",
      "Content": "Hi Ladybird Once before I chose to cut off my very long hair as I was doing a lot of sport and it got in the way.   I kept it and recently my daughter got married and had a disastrous cut just before the wedding.   Her hair is very similar so we had mine (stored in my dressing-table drawer in an old brown paper bag) made into a hairpiece/extensions for the evening when she wanted to \"let her hair down\" and nobody noticed.   Now mine is thinning as a side effect of the Arimidex tablets, and I'm wondering if I can adapt the hairpiece that's now on a big hair comb! Perhaps you could cut yours off as a whole and use it later? Lilybeth",
      "MessageIndex": 5,
      "PostDate": "07/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54013/hair--",
      "Title": "hair :-("
    },
    {
      "AuthorID": "Lilybeth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilybeth",
      "Content": "I have read all your posts with great interest.   I did not take the time to consider alternatives because I'm not sure that I had very much confidence in them.  A number of family members have died of cancer including my father 50 years ago and I am grateful that I live at a time when treatment is so much more advanced that I have a chance of an accurate diagnosis and good prognosis.    I recognise that some posts have been upsetting to one or other person looking for validation of a personal preference.   However, I have been relieved at how this thread has been allowed to develop so that each protagonist can recommend an avenue to be explored. This sort of approach does mean we can genuinely explore our options and come to a conclusion that is right for us or our individual view of life. Lilybeth",
      "MessageIndex": 20,
      "PostDate": "22/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "Lilybeth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilybeth",
      "Content": "Hi Lyn I had two drains, one was removed after 5 days when I left hospital.   I kept the other for 10 days.   The breast was still producing a lot of fluid but the oncologist was worried about infection.   He covered the whole period of drains plus a day or so beyond with me being on antibiotics to avoid this.   I was able to go shopping and round the garden with the bag over my shoulder.   I gave the drain the personality of a clingy child that had to wait outside the shower door but really always wanted to be with me and sleep near me Lilybeth.",
      "MessageIndex": 23,
      "PostDate": "25/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53548/post-mastectomy-tops-with-drain-pockets",
      "Title": "Post Mastectomy Tops with Drain Pockets"
    },
    {
      "AuthorID": "Lilybeth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lilybeth",
      "Content": "Hello Yvonne I used one of those colourful wine bottle present bags with the cord handles, but I only had one drain.   You can put longer cords in to wear them over a shoulder. Best wishes Lilybeth",
      "MessageIndex": 17,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53548/post-mastectomy-tops-with-drain-pockets",
      "Title": "Post Mastectomy Tops with Drain Pockets"
    }
  ]
}