{
  "AuthorID": "Lindy1802",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
  "Posts": [
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Gerty,   Everyone is different. Only you can say if you will be physically able to travel - how have you been on previous chemo cycles? They normally follow the same pattern. How far in the future is this trip? Can you be sure your chemo won't be delayed for a few days/a week should your bloods not be up to it? As for travelling, we are told not to use public transport during low immunity periods. You need to be sure this trip does not fall in a low immunity period.  ",
      "MessageIndex": 3,
      "PostDate": "24/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58094/going-away-for-few-days-to-iow-via-train",
      "Title": "going away for few days to IOW via train"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Juju,   I'm sorry to read of your problems with fatigue and mobility on top of having to cope with BC. Life can be very unfair.   The reason for the change of hospital is because breast cancer surgery and chemo treatment is carried out at many general hospitals whereas radiotherapy is only carried out at very few hospitals that are spread out round the country. Most of us had to change. I was lucky because I live more or less half way between the 2 hospitals where I was treated, so only had 35 minutes to travel to each of them, albeit in different directions. Your Oncology team will still be looking after you even at the new hospital. Radiotherapy can be tiring even without travelling so far, so my advice to you is to uproot and stay with your relatives, at least during the week. Apart from the travel issue, delays are very common. You can arrive in time for your treatment and find the machines have broken, or some other crisis has happened and you are kept waiting in the waiting room for a long time. This is very frustrating and tiring. You need company or a good book! Some radiotherapy hospitals have a \"patient hotel\" on site that offers people in your situation accommodation. You could enquire about that. I hope all goes well for you. xxx",
      "MessageIndex": 2,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67923/change-hospitals-for-radiotherapy",
      "Title": "change hospitals for radiotherapy?"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Mccaan - that is just what I mean. Had you been given your path report and read it yourself, you would have known exactly what you had and what your treatment should have been. My advice to everyone is - always ask for a copy of the path report.",
      "MessageIndex": 8,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58006/wrong-cancer-entered-on-my-file",
      "Title": "Wrong cancer entered on my file"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Mechelle, What an awful way to treat anyone, never mind a cancer and chemo patient. I would seriously consider a complaint. Not only for the way you were treated but for the delay that even your oncologist was surprised about. All hospitals have targets to meet, and I am certain the target time between surgery and chemo has to be less than the 3 months you have had to wait.  I'm so pleased it is all sorted now and you can begin to take control of your own situation. Good luck with everything next Monday. xxx",
      "MessageIndex": 3,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56713/new-member",
      "Title": "New member"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I know we all make mistakes, but to me something like that is unforgivable - it could so easily have gone unnoticed and then what might have happened?     It sounds to me like you don't have a copy of your path report or you would have known the answers to your questions regarding hormone receptors, HER2 etc and would also have known what sort and grade your cancer is. May I suggest you ask for a copy of the report? It should have been given to you at the time.  Good luck with your next step.  xxx",
      "MessageIndex": 2,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58006/wrong-cancer-entered-on-my-file",
      "Title": "Wrong cancer entered on my file"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "We are entitled to a copy of all our path reports. Sometimes they don't give them to us unless we ask - no idea why. I would feel totally out of control if I didn't have mine. To me, knowledge is power - and I would not like to rely on what I am told because medical staff have a habit of only telling you what they think you need to know. I forgot to ask for the one following my surgery so asked my GP - she has access to the hospital computer files and printed a copy off for me. I would have been lost without it as it contained more detailed information than I had been told, and helped me understand my diagnosis.   Most (but not all) biopsy reports will say whether the tumour is hormone or HER2 receptive, the initial grade, and type, plus any suspected vascular invasion. The full diagnosis is in the path report following surgery, and that is the important one as anything reported from the initial biopsy can change for the better or for the worse once the whole tumour is out and under the microscope.",
      "MessageIndex": 6,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58006/wrong-cancer-entered-on-my-file",
      "Title": "Wrong cancer entered on my file"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi,   I do understand how you feel, and it is a terrible situation you find yourself in, but even worse for your poor mum. I can see her point in refusing further investigations. If she has decided to refuse any unpleasant treatment, what is the point of searching for further potential secondaries? A CT scan may pick up hot spots in her body, but she clearly isn't interested in knowing or having it treated. She has already refused treatment for the cancer in her breast, and it sounds like she has known how big this has grown but declined to do anything about it. Having said all that, maybe she could be persuaded to think again about having her breast treated.   My mum was diagnosed with BC when she was 84 and was advised to have a single mastectomy and radiotherapy. I was with her when she was diagnosed. She asked the Consultant what would happen if she just left the lump with no treatment. He told her it would erupt through the skin and turn very nasty indeed, and that in his opinion this was not a reasonable option because of the distress it would cause her. In the end, she decided a mastectomy was a better option. Not as a potential cure, but preferable to the ulceration that would happen. She went ahead with the mx , sailed through it all, and lived a normal life for a further 5 years before passing away of something else entirely.  ",
      "MessageIndex": 1,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57955/elderly-mum-doesn-t-want-any-treatment",
      "Title": "Elderly Mum : Doesn't want any treatment"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi, There are so many different diagnoses that not many of us have identical ones. I had no node involvement but had to have chemo because  (1). my tumour was a grade 3 and (2). because it was HER2 positive. So two reasons in my case. Please try not to worry, your oncology team will tailor the right treatment for your particular diagnosis once they have the results from your lumpectomy and SNB. The higher the grade puts you more at risk. HER2 positive also puts you more at risk. Negative hormone receptors coupled with negative HER2 (known as triple negative) puts you more at risk. Node involvement depends on how many are affected and whether the cancer cells are significant. Basically, the higher the risk the more likely you are to need chemo. People with DCIS tumours and no IDC tumours do not have chemo because it does not work on DCIS. Hope this helps a bit.",
      "MessageIndex": 1,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75144/confusing-treatments",
      "Title": "Confusing treatments..."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Mccaan, Chemo is always recommended for people with a Grade 3 lump, no matter how small or what the lymph involvement is. It's just an insurance policy to help prevent the cancer coming back. Chemo targets the whole body, whereas rads just target the area where the cancer was. All this is explained in the booklets you should have been given. I'm in the same boat as you. I had a lumpectomy. My lump was grade 3 at 15mm with no lymph involvement and no vascular invasion, but I am to have both chemo and rads. Try not to worry, the oncologist knows what he is doing and would not subject you to chemo if he didn't think it was beneficial to you.  xxxx   EDIT - I have just noticed your title on this thread is DCIS treatment.  DCIS is different altogether. I am assuming (please correct me if I am wrong) that your tumour contained Grade 3 IDC cells.",
      "MessageIndex": 4,
      "PostDate": "06/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57560/dcis-treatment",
      "Title": "Dcis treatment"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I can also relate to this. I finished my chemo in July and am now on Herceptin. I still have the pins and needles and burning in my feet after all this time. I was told it could take a year to disappear, and that it usually peaks after about 6 months. Mine isn't bad enough for painkillers, but it is still very noticeable. The heavy legs lasted a month or two after chemo. I can't say when it went. I just realised one day that it had gone! Walking is the best thing you can do, no matter how hard it is. I remember walking from bench to bench along a stretch of sea front, having to sit down at every bench like an old woman. Even now, nearly 6 months on, I still get it occasionally and can't walk as far as I used to be able to.. As for wigs, I gave up with mine and felt much more comfortable without. I gave up the hats about 2 months ago. As the earlier poster said, if Jessie J can do it, so can I. My family and friends say how cute I look and are encouraging me to keep it this short. We have all been poisoned, and it takes our bodies a long time to recover.",
      "MessageIndex": 9,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69107/is-this-normal-chemo-is-over-but-3-wks-after-and-feeling-worst-than-during-i-think",
      "Title": "Is this normal.... Chemo is over but .. 3 wks after and feeling worst..."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Thanks Sue, no, I haven't been to a group. I'm not very good with group therapy things. I've been following the instructions in the packets of patches and am now on stage 2 - the middle stage of 3. These are half the strength of stage 1 patches. I am finding these harder, but am managing better each day. Once I am confident about them and the odd bits of craving disappear, I will move to the final stage 3.",
      "MessageIndex": 22,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57411/bc-and-smoking",
      "Title": "BC and smoking"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I am  a life-long smoker, too, and was on 25 or more a day until the day after my dx. I knew it would affect my operation and chemo so I tried to stop by cutting down. I cut down to 10 a day to begin with, mainly by changing my routine and not taking a packet out with me. I stayed on 10 for about 3 weeks, and just before my op I cut down again. After the op I found it more difficult and was soon back up to 10, so I bought a box of the Pre-Quit patches that you wear but can continue to smoke if you really want one. I am now on 5 a day and doing well, despite this roller coaster of a journey. My husband also smokes, so I know how difficult it is.   Good luck!",
      "MessageIndex": 5,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57411/bc-and-smoking",
      "Title": "BC and smoking"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I have been wearing the patches that are meant to help you cut down, and then when you are ready, to stop. I am down to 2 a day from 25 plus, and those I don't really want, I only have them as a treat for doing so well! Some days I have none at all. I do, however, still need the patches. I asked my oncologist about wearing patches during chemo and he said it was fine.  Just a bit worried now about becomming addicted to the patches - but rather that than cigarettes!",
      "MessageIndex": 20,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57411/bc-and-smoking",
      "Title": "BC and smoking"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Mudge, For what it's worth I think you have made the right decision. What is the \"C\" bit of your regime? There are 2 different \"C\"'s. I had TCH. The H is the Herceptin for HER2 pos people only. My C was Carboplatin. I had the usual 6 doses of the TC along with Herceptin, and hand on heart I can say I sailed through it compared to people on the FEC or FEC-T regimes. I did have an unpleasant encounter with Neutropenia on my first cycle, but that can happen on any regime. I was told I was on this regime because (a) of my age (65) as my oncologist feels that the older the heart the more it may have deteriorated (b) FEC and Herceptin are not good bed mates I wish you luck on your journey and hope you manage as well as I did. (I finished last July but am still on Herceptin)  xxx",
      "MessageIndex": 10,
      "PostDate": "01/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71070/chemo-decision-yes-or-no",
      "Title": "Chemo decision. Yes or no?"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I had the single injection given once a cycle the day after chemo. My oncologist recommended taking the maximum allowed paracetamol tablets as a course, beginning immediately after the injection for 3 full days, then stop. (Stop because as was said above, paracetamol can mask a high temperature and that is risky when your immune system is low)  All I can say is, this course of paracetamol worked well for me. I had no problems with it apart from once when I had pain in my hips one evening.",
      "MessageIndex": 4,
      "PostDate": "04/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77640/lenograstin-injection",
      "Title": "Lenograstin injection"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Does a lot of this depend on the age of the woman? I understand mammograms are pretty useless in younger women, which is one reason they don't get the routine 3 yearly ones and end up only being diagnosed when their lump can be felt, often when the lump is more advanced..   As we get older, our breasts change to the extent that mammograms are more efficient at finding lumps that are too small or too buried to be felt.   I am 65, and in my case my lump could not be felt, even by the consultant who knew exactly where it was, and I had no clinical signs. The routine mammogram picked it up, and the biopsy showed a grade 3 IDC tumour that is HER2 positive, so a very aggressive type. How long might that have been growing and spreading before I could feel it had it not been for the screening?",
      "MessageIndex": 7,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57073/breast-screening---real-facts",
      "Title": "breast screening - real facts"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Blimey Yvonne, you are being far too hard on yourself expecting too much too soon. Your body and mind have been through a lot of stress, and you still have more to come with radiotherapy. You will get better, but not just yet! Look at it as time to rest and relax and don't keep trying to be how you were before diagnosis as that will make you even more tired and worn out. Slowly does it for best results in the long run.",
      "MessageIndex": 3,
      "PostDate": "27/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75880/when-will-i-be-me-again",
      "Title": "When will I be \"ME\" again ???"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "You should see my wardrobe. Or perhaps best not.  I have clothes in 3 different sizes.  My weight goes up and down all the time, and I haven't even started chemo yet. No hope for me then! I was rather hoping to lose weight when I start the treatment!",
      "MessageIndex": 2,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57280/weight",
      "Title": "Weight?"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "My nose started to run like that when I started chemo with Herceptin. Chemo finished last July but I'm still on Herceptin - one more dose to go. My nose still runs, so I blame the Herceptin. No tips I'm afraid. I haven't taken anything to stop it. I was told it might be because we lose our nasal hair on chemo, and I don't think mine has grown back.",
      "MessageIndex": 1,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73401/runny-nose",
      "Title": "Runny nose"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Dido, Have you considered it might be the Herceptin?  My chemo was tax and carboplatin x 6 with Herceptin from the first dose. I finished chemo early July 2013 and have had 16 herceptins (2 more to go). I have a very dry mouth, especially over night, although it doesn't sound quite as bad as yours. I have a very unpleasant taste in my mouth a lot of the time, and at other times if I wipe over my teeth with my tongue I get that metallic taste. I am surgically attached to a glass of water, and take regular sips throughout the day, which helps temporarily. I can still taste all my food normally, or at least I think I can! I have put this down to Herceptin. I also have a runny nose, especially outdoors, yet don't have a cold, and it gets crusty. I have also put this down to Herceptin. Otherwise, I am fit and well. My hair has also grown back thick and curly. It used to be straight and fine fly away!",
      "MessageIndex": 2,
      "PostDate": "21/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72324/dry-mouth-after-ac-chemo",
      "Title": "Dry mouth after AC chemo."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Joyce, A dry mouth and nasty taste are side effects of chemo, that is very common. However, that usually goes once chemo is finished. As mine hasn't gone and it's nearly 8 months since I finished I am blaming it on Herceptin. Either that or I have it permanently!! Good luck with the rest of your treatment.",
      "MessageIndex": 6,
      "PostDate": "21/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72324/dry-mouth-after-ac-chemo",
      "Title": "Dry mouth after AC chemo."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Overall, I have stayed the same weight.  I have lost up to 10lbs in as few as 4 days due to side effects, but then put the same 10lbs back on again in the next 4 days!   Chemo affects your food cravings quite a lot. Many people find they crave carbs and eat loads of bread, pasta,  spuds etc. Others go for sweet things. Most of us go for comfort food, so whatever your comfort food is you will eat and eat, whether it be fish & chips or chocolate. There is no harm in this, and apart from avoiding certain danger foods (from an infection/food poisoning point of view) we are generally told to eat what we like when we like.",
      "MessageIndex": 3,
      "PostDate": "11/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62378/chemotherapy---weight-gain",
      "Title": "Chemotherapy - weight gain?"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Jean,   I haven't started my chemo yet - hopefully next week.   I decided to face the hair loss \"head on\" (excuse the pun). I really did not want to put myself through the cold cap torture with no guarantee of success, and the thought of spending several more hours in the unit every session just put the lid on it. Anyway, I went out and bought a wig several weeks ago that is very similar to my own hair in colour and style. I wore it to go home in from the shop, and have worn it several times since. I like it and people are not noticing it isn't my own hair. I also ordered some lovely hats. Last Thursday I took myself off to my hairdresser and asked her to chop most of it off because I do not want the distress and trauma of it falling out over a period of days wherever I happened to be at the time. I know I will lose it, and I want to be in control of when and how. My hair is now about an inch long on top and shorter still at the sides and back, and what is worse it is entirely grey - and I have never seen myself grey before because I have always had it coloured. I cannot be seen in public like this - so I wear my wig whenever I go out now. I still love it , and when the big fall out happens in the next few weeks all I will need to do is go over it with the clippers and carry on wearing the wig.   Take care xxx    ",
      "MessageIndex": 8,
      "PostDate": "17/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58811/new-to-all-this",
      "Title": "New to all this"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Purdy,   It really isn't all doom and gloom, and once you have your proper treatment plan you will start to feel much better about things. Fear of the unknown is the highest hill to climb.   I can't comment on your area. However, my piece of advice is you need to have as little travelling as possible, both for chemo and rads. You don't need the extra hassle of travelling making you even more tired. That is a definite no no, and you also may need your nearest and dearest close to you if/when you start chemo. Someone has to do the cooking/housework, brew making! LOL.   Then, you need to be close to the hospital/clinic in case you are taken ill - and most of us are at least once during chemo. If you pick up an infection or your blood count drops, you need hospital treatment with antibiotics within an hour. Don't wish to panic you, but it is a fact.   I wouldn't start to worry about delays in Rads just yet. You may have chemo and surgery to get through first. Forget Rads for now. They are way in the future. I think you need to wait until you get your treatment plan before making any decisions.   Whatever you decide, I hope it all works out well fo you xxx",
      "MessageIndex": 6,
      "PostDate": "20/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60780/does-anyone-have-advice",
      "Title": "Does anyone have advice?"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Purdy,   There is another site you can try. The Breast Cancer Care website also has an excellent (and very active) community forum. You can join groups specific to your current treatment, and especially to monthly chemo goups, where everyone in that group starts chemo in the same month so are able to support and help each other as they go though it all.  http://www.breastcancercare.org.uk/community/forums/active Give them a try.  xxx",
      "MessageIndex": 8,
      "PostDate": "20/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60780/does-anyone-have-advice",
      "Title": "Does anyone have advice?"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Good luck to everyone just starting the chemo - and great to hear it went fine for you yesterday, Beara. I saw my consultant yesterday, and what a lovely lady she is. I was really surprised to see how young she is - or maybe that is just another sign that I am getting really old! I came away feeling confident and much better than when I went in. My WLE and SNB is next Friday, 18th January. I have to have the radioactive stuff injected the previous afternoon, so may well be glowing green all night. One thing she asked me was if I would be interested in doing a survey during the course of my treatment. This is to look at the management of breast cancer for women aged 65 or over in the North West of England. I signed up for it. (I turned 65 a couple of weeks ago). Good luck everyone xxxxx",
      "MessageIndex": 11,
      "PostDate": "11/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56673/hello-i-m-a-newbie",
      "Title": "Hello, I'm a newbie"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Thank you everyone for your lovely messages of support. I know I am just at the beginning of a long journey into the unknown and our lives will be on hold for some time to come, but I am so grateful for the support I am getting from my wonderful husband and my daughter, and also from you lovely ladies. Thank you. Lindy xxx",
      "MessageIndex": 16,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56673/hello-i-m-a-newbie",
      "Title": "Hello, I'm a newbie"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Thanks all of you lovely girls for your welcome and encouraging words. I am still in a state of shock, my mind flits about all over the place but I tell it to stop - and it does for a while!  I still think I am sat watching all this happening to someone else, and can't quite believe it is actually me. . .. but as for now, I really cannot wait to have this op and get this nasty stuff out of my body. Thank you xxx",
      "MessageIndex": 8,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56673/hello-i-m-a-newbie",
      "Title": "Hello, I'm a newbie"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi, Just introducing myself after reading through a lot of threads in this group and already finding comfort from this. I am 65. I was diagnosed with invasive ductal cancer, grade 3, on 27th December following a routine 3-yearly mammogram. This is a small primary tumour, between 10mm and 11mm. According to the ultrasound test and the core biopsy, there are no obvious signs of vascular or perineural invasion in the tumour, and no obvious signs in the lymph nodes, although I have been warned neither of these tests are wholly reliable and I won't know for sure until after my op. The lump is hormone negative. The HER2 is inconclusive (2+) and has been sent off for further tests. My mum had a single mastectomy plus radiotherapy when she was aged 84 in 2001. She died aged 89 of other causes. Apart from that, I have no experience of any sort of cancer. I am retired and happily married, with a married daughter and 2 teenage grandchildren. My husband has been brilliant. I look forward to \"meeting\" everyone and sharing experiences as I start on this frightening journey. A bit weepy today as I know I will have to have chemo.",
      "MessageIndex": 0,
      "PostDate": "08/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56673/hello-i-m-a-newbie",
      "Title": "Hello, I'm a newbie"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "It is so hard not to get paranoid, as I know from experience!   You could be starting with an infection, or it may be nothing at all. Sore throats are a known side effect. Try gargling with salt water or a mouthwash if you have some. Make sure you are keeping up with your water to help flush out the kidneys.    Just take your temperature and keep an eye on it. If it goes up to 37.5 take it again an hour later. If it is still the same or higher, ring your chemo unit (day time) or emergency number they gave you (out of hours). They will tell you what to do. Your own GP is not the person to call if you have a temperature.   The day you have your chemo is always day 1, no matter what time you had it.. So today you are on day 8 and quite likely to be in your low immunity period, which varies from person to person.   I hope all goes well xxx",
      "MessageIndex": 3,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65486/taxotere-side-effects-infection-question",
      "Title": "taxotere side effects: infection question"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Thank you Katsam for your reassurance, and I'm glad your op and the other procedures were a doddle for you, and that the burning is now fine. Also great news about the lymph nodes. That must have been a huge relief for you. Good luck with fighting the demons - I'm sure it will get easier as time passes. Lindy xxx",
      "MessageIndex": 18,
      "PostDate": "13/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56673/hello-i-m-a-newbie",
      "Title": "Hello, I'm a newbie"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I finished my 6 lots of TC chemo in July (Tax and Carboplatin). I had Herceptin at the same time as my 6 doses of chemo and am now on Herceptin alone until next April.   Herceptin can be hard on the heart, which is why we have regular heart scans during treatment to check the left ventricular ejection rate. If it drops too low they will stop the Herceptin until it comes back up again. As for Herceptin side effects, I haven't had any at all! I am carrying on with my normal life and feel well. The infusion takes half an hour, then a quick flush, then home. The worst is over once you finish chemo.   Good luck with the rest of your treatment. xxx",
      "MessageIndex": 3,
      "PostDate": "09/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66925/life-after-fec",
      "Title": "Life after FEC"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I had 6 doses of Tax, finishing last July. I also had a red blotchy face, and also on the back of my hands. I used Sudocrem, which acts as a barrier and is an antiseptic too, and took an antihistamin. It disappeared thankfully so I didn't need to see my GP.",
      "MessageIndex": 3,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70657/blotchy-face-following-third-t",
      "Title": "Blotchy face following third T"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi,   I don't know if lobular tumours are different from ductal tumours, but I was told that with my invasive ductal (15mm) a lumpectomy plus radiotherapy has the same long term survival rate as a mastectomy. This is something your surgeon will discuss with you if you ask. Good luck with whatever you chose.  xxx",
      "MessageIndex": 6,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64118/newly-diagnosed-less-problems-than-most-but-need-help-with-op-decision-bit-lost",
      "Title": "Newly diagnosed, less problems than most, but need help with op decision..."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Lynne,   I'm also in the Waiting Room, hoping to start chemo sometime in March.   When I had my results from my WLE and knew I needed a second excision operation, my BCN told me she would carry on and book my oncology appointment immediately, so that my second operation would happen during my waiting time, and chemo wouldn't be delayed any further. I had my second excision this morning and see my Oncologist on 5th March (10 days hence), so am really pleased my nurse did this for me, otherwise I would have 5 or 6 weeks to wait from today. I think 5 or 6 weeks is the norm.    ",
      "MessageIndex": 1,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58054/waiting-and-waiting-doesn-t-it-cause-more-stress",
      "Title": "Waiting....and waiting.... doesn't it cause more stress?"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi,   My initial lumpectomy had margins that although clear were very tiny - 5mm only on one side, so I had a cavity shave. I asked at the time what would happen if they couldn't get larger margins on this second attempt and was told either further surgery or, if that proved not to be possible, an additional week of booster rads targeted directly at where the tumour was. Fortunately my surgeon managed clear wide margins the second time.",
      "MessageIndex": 3,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58799/extra-week-of-radiotherapy-due-to-tumour-close-to-chest-wall",
      "Title": "Extra week of radiotherapy due to tumour close to chest wall"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi, There is no need to Google. It is all explained on this Macmillan site. Have a look under Cancer Information, or click on this link  HERE xxx",
      "MessageIndex": 2,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71123/cancer-stage-cancer-grade",
      "Title": "Cancer stage, cancer grade"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi, You need to ask your breast care nurse about your tumour. She will tell you the size, the type, the number of lymph nodes taken and the number infected, also whether it is hormone receptive and/or HER2 positive. She will also tell you the grade and the stage. All you need to do is ask. The best way of keeping in control of matters is to ask for a copy of the histology report if that is what you want. I appreciate some people prefer to live in ignorance. I got copies of all my histology reports and found out quite a bit I didn't know before. xx",
      "MessageIndex": 4,
      "PostDate": "31/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71123/cancer-stage-cancer-grade",
      "Title": "Cancer stage, cancer grade"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Julie, It's awful, I know, and I know just how you are feeling. I had a recall after a routine 3-yearly mammogram and was given another mammogram, ultrasound and a biopsy on 20th December. The consultant told me it is cancer, and is \"worrying\". However, she did tell me it is a small lump, 10mm and that is good. I was given an appointment to return on 27th December for the results. To say I was devastated is an understatement as I had fully expected the recall to be something and nothing. My husband and I had to carry this news all over Christmas and keep it to ourselves so as not to spoil Christmas for the rest of the family. The results confirmed it is a grade 3 invasive ductal cancer and I was given an appointment to see the consultant surgeon on 10th January. That was when we told our daughter and other family and friends, and then we took ourselves off on a week's holiday. It was this holiday that kept us sane and I am so glad we went. I am having a lumpectomy on Friday this week - and can't wait for this thing to be cut out of me. Please don't despair. When you get your biopsy results, ask for a copy of the Path lab report to take home with you because you will never remember what the nurse tells you and all the medical terms will go in one ear and out the other. You will find a lot of support on this forum, but whatever you do, don't go searching the internet for information - just use this wonderful Macmillan website or the Breast Cancer Care website. There is so much out of date and incorrect rubbish out there. Take care,  Lindy xxx",
      "MessageIndex": 4,
      "PostDate": "16/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56908/newly-diagnosed---feeling-lost",
      "Title": "Newly diagnosed - feeling lost"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi, I also had the Neulasta jab the day following chemo, and like Sonia I didn't have it for my first round of chemo and ended up in hospital with neutropenia sepsis. My oncologist prescribed the Neulasta for all subsequent rounds, which kept me out of hospital. I had heard these jabs can cause painful bones so asked my oncologist. He said to take 2 x 500mg Paracetamol immediately after the jab and continue at regular intervals as described on the packet for 3 full days whether I had pain or not. Stop after 3 days. This is to build up some pain resistance in your body before the jab gets working on the bones. All I can say is this course of Paracetamol worked for me. I had very little discomfort. I finished chemo last July, had radiotherapy during September, and am not just on Herceptin, with 4 more doses to go ... then it's all over! Good luck with the rest of your treatment.",
      "MessageIndex": 5,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70314/pain-following-neulasta-injection",
      "Title": "Pain following Neulasta injection"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Pam, My mum was 84 when she had a mastectomy, but happily she didn't need chemo. Diarrhoea makes you very dehydrated, which in turns makes you dizzy and weak. You must get loads of fluids down her - she must drink, drink, drink. I wish her every bit of good luck xx",
      "MessageIndex": 3,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72276/advice-needed",
      "Title": "Advice Needed"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi HilaryAnne,   No-one can advise you what to do. It has to be your decision entirely. All we can do is tell you our own stories.   Firstly, 5% is a good increase in my opinion.   Secondly, you don't say what grade your tumour was or what surgery you had, whether there were wide clear magins, nor whether there was lymph node involvement. All these are good indicators of whether to chemo or not.   My tumour was 15mm. No lymph node involvement. No vascular invasion. Lumpectomy and cavity shave removed the tumour completely with good clear margins. Grade 3 invasive ductal cancer. Hormone negative. HER2 positive. Caught early on routine mammogram. As far as I am concerned, my tumour has gone. However, I am having chemo (6 cycles of taxotere and carboplatin) with Herceptin for 12 months. Everything I have read and been told says Herceptin is the wonder drug that works brilliantly on HER2 positive cancer providing it is given alongside a taxane chemo, in my case Taxotere. I intend to throw everything I can at this disease - who knows if any stray cells found their way into my blood stream unnoticed, and I am not taking the risk.   If at the end of it I end up with the cancer coming back at least I have tried everything and won't be able to blame myself.   Have you asked if you can participate in this clinical trial? What does your oncologist advise?",
      "MessageIndex": 1,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59967/chemo-decision-advice-required",
      "Title": "Chemo decision, advice required"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Everyone is right, and I speak from experience. Last June I was mid-chemo. I covered myself in factor 15 and wore my hat and glasses. I sat mostly in the shade in the garden, but still got very red on my forehead in the area between my hat and the top of my glasses. I have always been a sun worshipper and have good skin that has never burnt in over 60 years, but it did that day. I think the fact my forehead was more sensitive because it had always been covered by a fringe might have contributed. However, it is now 9 months later and is still very red. I am beginning to think it is now permanent.",
      "MessageIndex": 4,
      "PostDate": "21/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73944/sunshine",
      "Title": "SUNSHINE!"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "My lumpectomy was January 2013, and whilst mine faded to a yukkie colour, it only disappeared about September!",
      "MessageIndex": 1,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71304/the-blue-dye-used-in-the-sentinel-lymph-node-bisopsy",
      "Title": "The blue dye used in the Sentinel Lymph Node Bisopsy"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Julie,   What a bummer of a shock for you just as you thought you were at the end, but good news to be honest as you now know they are throwing everything possible at you, and if you have tolerated it so far this should continue.   I am on TC + Herceptin, 6 cycles. I had number 4 yesterday.  I'm another that is tolerating this regime very well, touch wood. My worst is diarrhoea, sort of managed with Loperamide/Imodium, and I also get that horrible mouth and weird taste. I am finding myself covering everything in too much salt and pepper, or sugar on sweet things. Tomatoe Ketchup also helps! Not good for the general health, but if it works I don't care. LOL.   xxx",
      "MessageIndex": 2,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61393/chemo-changed-from-4-tc-to-6",
      "Title": "Chemo changed from 4 TC to 6!!"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Everyone is entitled to a copy of the path reports. You only have to ask for a copy and one will be given to you. I could not have managed without mine. There is another thread live on this forum right now about this. I did forget to ask for a copy of my surgery path report, but later asked my GP who accessed my hospital computer records and printed a copy off for me. (There is nothing unprofessional about this)   The path report following surgery contains your full diagnosis, in more detail than you are told by the nurse/doctor. Medical staff tend to summarise and only tell you what they feel is appropriate. For me personally, this is not enough. I want every detail, and this gives me control over my illness. For example, my surgery report said \"no evidence of vascular invasion\" . Not one person told me this, but that is a crucial and very encouraging part of my diagnosis.   I agree there is a lot of jargon and abbreviations, but all this can be explained by the nurse or looked up on the internet. However, not everyone is the same as me!",
      "MessageIndex": 5,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58012/i-never-saw-results",
      "Title": "i never saw results"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I had 2 week long holidays in between chemo sessions, but only in this country. My Oncologist was quite happy for me to do this, but did say to make sure I had details of the nearest A&E hospital and also a local health centre or GP just in case, and to continue taking my temp and being vigilant with avoiding infections.   I would never even have contemplated going abroad. xxx",
      "MessageIndex": 1,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65329/holidays",
      "Title": "Holidays"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "  Holiday insurance is a big problem for people on active treatment. There are lots of threads about it on the forum. As I said earlier, I personally would never consider going abroad during chemo particularly if flying. Planes are full of nasty germs, and no matter how \"good\" your bloods are before week 3, your immune system is still compromised. However, if you decide to go you must first ask your oncologist what he thinks as he knows your details. I do know a friend of mine went to France (driving) during her chemo. Her oncologist gave her copies of her notes, made sure she was familiar with the language, and insisted she research good hospitals in the area she was staying. She opted not to take out travel insurance because of the cost, but made sure she could afford any necessary treatment and a flight home should it be necessary. In Europe the E111 card assures you will get free emergency treatment but nothing beyond that. Another point to consider is the possibility of your chemo cycles being delayed for one reason or another, usually due to illness or low blood counts. If this happens you may have to cancel your holiday or delay your chemo even further. xxx",
      "MessageIndex": 4,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65329/holidays",
      "Title": "Holidays"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I saw my oncologist only this morning when he went through my own rads procedure prior to my planning meeting when I finish chemo. (one cycle to go).  He went through the possible side effects, one of which is cracked ribs. The ribs lie just under the breasts and so get zapped. This is probably the cause of your rib pain and is entirely down to rads. The other possible side effect is damage to the lower part of your lung, as this lies immediately under the ribs. He assured me this has no effect on lung function, but will always show up as a shadow on any future chest X Rays you have for any reason at any time in the future, so you must remember to tell them you have had rads to stop them panicking!!",
      "MessageIndex": 5,
      "PostDate": "02/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62037/rib-pain-and-radiotherapy",
      "Title": "Rib pain and radiotherapy"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I have been to my first Onco appointment today. He told me about the Aphinity Trial testing Perjeta (Pertuzumab) for BC patients who are HER2 positive. Apparently I am eligible for the trial, although I have Primary BC stage 1. I am being made an appointment to discuss this.   The drug is already approved for use in Europe and America for Metatistic Breast Cancer patients who are HER2 positive, but not for Primary BC patients. No doubt this is what the Aphinity Trial is all about.   http://www.cancerresearchuk.org/cancer-help/trials/a-trial-looking-trastuzumab-pertuzumab-for-HER2-positive-breast-cancer-APHINITY",
      "MessageIndex": 5,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55860/perjeta---new-drug-with-potentially-better-results-than-herceptin",
      "Title": "PERJETA - new drug With potentially better results than herceptin"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi, What a lovely supportive daughter you are. I can't add to what the others have said, which is all good advice. However, if you want a copy of any path reports you have to ask for them. If you don't ask, you don't get! I actually got mine from my GP who printed it out for me. GP's have access to hospital records. There will be a path report following her biopsy, and another one following surgery. I found having my path reports gave me more control over my own situation as they tell you everything there is to know and are what the oncologists use to determine the next stage of treatment. Some nurses and doctors tend to only tell you what they think you need to know and have a tendency to filter out odd bits and pieces. I was 65 at the time of my diagnosis, had lumpectomy, chemo, radiotherapy and Herceptin and am now 13 months passed diagnosis, still on Herceptin, and feeling very well. Wishing your mum good luck. xxx",
      "MessageIndex": 8,
      "PostDate": "07/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71419/feel-like-we-ve-been-left-in-limbo",
      "Title": "Feel like we've been left in limbo :("
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I also think your GP is out of order. In fact I would have blown a gasket. You do right to discuss it with the cancer specialists that know where you are at. It sounds like this GP has very little idea of what you (and the rest of us) are going through, mentally as well as physically.   A Care Home is no place to work once you start chemo, even on a part time basis. far too many germs and infections lurking about.   Good luck xxxxx",
      "MessageIndex": 5,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57415/fit-notes",
      "Title": "Fit notes"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Herceptin will be easy to fit in round work. The first dose is a long haul as you have to stay behind a couple of hours to make sure there are no reactions. After that the infusion is 30 minutes, plus about 15 mins of saline, then straight home. I was always in and out in under an hour. I had my last one 3 weeks ago. I had very few side effects, and none that were significant. I have a runny nose when outdoors, but nothing else really. As for finances, my hubby and I are retired. No extra help for pensioners from anywhere. It was the parking and petrol that cost us a small fortune.",
      "MessageIndex": 26,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75455/no-financial-help",
      "Title": "No financial help!!"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "In a perfect world, screening from aged 18 would be brilliant. However, this would lead to other problems. Younger women have dense breast tissue. Mammograms rarely work on dense breast tissue. Nothing shows up on the image.  To be told you are \"clear\" following a mammogram might send you away with a false sense of security - which might not be the case because your dense breast tissue is hiding any suspicious matter. This could be very misleading ... and dangerous!   The NHS is rolling out mammogram screening from age 47 nationally, although it is slower reaching some areas.",
      "MessageIndex": 4,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65457/should-we-petition-for-routine-mammograms-to-be-offered-for-over-40-s",
      "Title": "Should we petition for routine mammograms to be offered for over 40..."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Herceptin will be easy to fit in round work. The first dose is a long haul as you have to stay behind a couple of hours to make sure there are no reactions. After that the infusion is 30 minutes, plus about 15 mins of saline, then straight home. I was always in and out in under an hour. I had my last one 3 weeks ago. I had very few side effects, and none that were significant. I have a runny nose when outdoors, but nothing else really. As for finances, my hubby and I are retired. No extra help for pensioners from anywhere. It was the parking and petrol that cost us a small fortune.",
      "MessageIndex": 11,
      "PostDate": "19/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75455/no-financial-help",
      "Title": "No financial help!!"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Katie, Only medically trained people who know full details of your mum's diagnosis can answer all your questions Katie. As your mum's records will be available to her breast care nurse maybe you should be speaking to her, or perhaps you should go with her to her next appointment with her surgeon or oncologist and get the answers you want from the horse's mouth. The grade and stage of her cancer will be on her path report following her mastectomy. She can ask for a copy of that, and meanwhile the breast care nurse will tell her if she asks. She may well have already been told, and I would be quite surprised if she hasn't. All breast cancers are serious. They can all reoccur later, but with surgery, chemo and radiotherapy she will have the best chance of this not happening. She is in good health and follows a reasonably good lifestyle, so this is also on her side. Try not to worry, it's the last thing your mum would want. xxx",
      "MessageIndex": 2,
      "PostDate": "27/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70902/mothers-breast-cancer--can-anyone-answer-my-questions",
      "Title": "Mothers breast cancer- can anyone answer my questions?"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Gail,   It will be just a discussion.  They will have some sort of treatment plan for you, which will depend on what the initial tests and biopsy found. This is your opportunity to ask as many questions as you can. You need to write these down in advance, and you must try to make sure someone goes with you to the appointment. You may find eveything they say goes in one ear and out the other, most of us do, so you need another pair of ears to help you remember. Then write down the answers. Try not to let them rush you.   You need to ask what type of breast cancer it is (Invasive or in situ etc), where it is, the size, the grade (grades 1, 2 or 3), whether it is hormone receptive and/or HER2 positive, if they think there is any node involvement at this stage, and any vascular invasion.  The biopsy may not show all these features, some of which may only be known after surgery. If you are the sort of person that likes to know everything to keep control, you would be wise to ask for a copy of your histology report.   Good luck for Thursday.",
      "MessageIndex": 2,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60988/just-diagnosed",
      "Title": "Just diagnosed."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Gillie,   Everyone is slightly different, but normally on FEC the most vulnerable period is days 7 to 14! However, you have to bear in mind that if you catch an infection early on in your cycle it can linger in your body several days before it emerges as a problem during the most vulnerable period. To be honest, I believe we have to be careful throughout. Wouldn't it be nice if all the information we are given was consistent!",
      "MessageIndex": 2,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65343/which-days-are-the-most-vulnerable",
      "Title": "Which days are the most vulnerable."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "I don't think you are wrong to think that at all. I had no choice but to have chemo because my tumour was HER2 positive so I had to have Herceptin. However, I would also have asked to have everything thrown at it, including the kitchen sink if that might have helped. I would have felt \"untreated\" otherwise and would have lived in fear of it coming back. It may still come back, but at least I know everything available has been given to me. Lots of mastectomy people don't have radiotherapy if their nodes are clear, but this is something that can only be given once, so not having it initially means it can be given later if the need ever arises. Chemo is different, it can be given more than once. Good luck, and no .... you are not wrong.  xxx",
      "MessageIndex": 2,
      "PostDate": "03/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72879/had-wle-and-slnb-on-thursday-27th-get-pathology-results-on-11th-march",
      "Title": "Had WLE and SLNB on Thursday 27th. Get pathology results on 11th March..."
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Mumbly,   Have you spoken to your Oncologist yet? He will be able to tell you what benefit it will or won't be in your particular case. If you are a believer in statistics he can tell you what the research stats say for people in exactly your situation as regards the chances of your cancer appearing as secondaries anywhere else in your body.  The Rads will only target your breast where the tumour was found, not your whole body.   Personally, I am hoping they throw everything available at me. OK it's a year out of my life, but I will try anything to get this disease out of my body.    ",
      "MessageIndex": 2,
      "PostDate": "11/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57723/chemo-yes-no",
      "Title": "Chemo yes/no"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Sorry you have found yourself in this awful situation, but you sound positive and in control. Make sure you stay in control - ask for a copy of the path lab report because then you can go through it at home at leisure and give your nurse a call if it throws up any questions. This report will tell you everything they know at the moment. (Things sometimes change after surgery when they have more of the lump to look at.) There will be medical jargon and abbreviations you may not understand, but your nurse will be able to explain what they mean if you give her a call. It will tell you  the  type of cancer it is, whether it is ductal or lobal for example, and what grade - low, medium or high, normally expressed as grades 1, 2 or 3 with grade 3 being the most aggressive. It will also tell you if the cancer is hormone receptive and/or HER2 receptive. All this information put together will guide the medical team in deciding your initial treatment plan.   Good luck tomorrow  xxx",
      "MessageIndex": 3,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57949/had-biopsy-see-consultant-tomorrow",
      "Title": "Had biopsy, see consultant tomorrow"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi,   You sound just like I was at your stage, and still am now. I have done so much research I could almost do a PhD thesis. LOL.  However, it makes me feel more in control and helps me cope with it all.   Another thing your biopsy report may show is whether there is any indication or evidence of vascular invasion. The ultrasound you had should show if there was any suspicion of lymph node involvement, and on my lab report there was a bit about that.  They are questions you could ask at the meeting.   You won't get a full path report until after surgery. The biopsy is just an interim one and the stage of your cancer can't be determined on the biopsy.   My husband came with me. In fact he has been to all my appointments with me, and does his own research so he knows himself what to expect.   Good luck  xxx",
      "MessageIndex": 6,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57949/had-biopsy-see-consultant-tomorrow",
      "Title": "Had biopsy, see consultant tomorrow"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hey Twirly! Three score years is no good - you will reach much more than that I hope. I'm 65 and just started my chemo after surgery.  (Tax/Carboplatin/Herceptin). I want another 20 years at least!   As for vascular invasion. No-one mentioned this to me either, but I did get all my path reports and it was on there - no evidence of any in my case. As that was good news, I would have thought it might have been mentioned.   The best of luck to both of you, hugs, Lindy.xxx",
      "MessageIndex": 2,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59547/vascular-invasion",
      "Title": "vascular invasion"
    },
    {
      "AuthorID": "Lindy1802",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lindy1802",
      "Content": "Hi Mudge, My bit of advice is to have a Radox bath every morning if you can - gets the blood flowing and helps a lot with muscle fatigue, which will hit you bit by bit over all the cycles as it is accumulative. Also force yourself to have a walk every day, no matter how fatigued you feel. Drag those legs at least once a day! You may feel like an old woman but keep going, and plan a walk that passes the odd bench or two! Then drink, drink, drink as much water as you can every day - flush out those kidneys and all that poison. Good luck xxx",
      "MessageIndex": 12,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71604/starting-chemo---tips-and-advice-please",
      "Title": "starting chemo - tips and advice please?"
    }
  ]
}