{
  "AuthorID": "linz1230",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/linz1230",
  "Posts": [
    {
      "AuthorID": "linz1230",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/linz1230",
      "Content": "Thanks for the tips, they're great! I'm having fec for the first 3 sessions, then t with herceptin for the last 3... Not sure what to expect from those. I've read the fatigue gets worse so we'll have to see what happens. Then having radiotherapy right over Christmas time, which is bad timing but least I can start the new year afresh. Cathy, I think I'll have to remember to \"let it go\".... I'm at home with my teenage son, so feel bad asking for help sometimes. I'm sure I'll laugh once I'm out the other side. In fairness, I'm even embracing losing my hair and being bald for now... I thought I'd struggle with that part but guess you don't know you're inner strength until you've got no choice!  Have you had any experience with herceptin? ",
      "MessageIndex": 6,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98216/chemo-advice-please",
      "Title": "Chemo advice please"
    },
    {
      "AuthorID": "linz1230",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/linz1230",
      "Content": "Hi. I'm new to this but just looking for a bit of support. Was diagnosed in May with breast cancer, at 35 years old, have since had mastectomy and started chemotherapy. Now on second cycle, experiencing usual side effects, nausea, sore mouth, heartburn, headaches and general fatigue. The worst part is feeling isolated, not being able to go to work, exercise or socialise... Any tips for getting through this period? I've got another 4 sessions to go but going stir crazy at home! Thanks x",
      "MessageIndex": 0,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98216/chemo-advice-please",
      "Title": "Chemo advice please"
    },
    {
      "AuthorID": "linz1230",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/linz1230",
      "Content": "I'm on fec-t. I'll have a look at the August/September discussions, thanks for the recommendations.  I guess I'm finding it hard to cope with losing my independence, just being careful not to overdo it, avoiding public places and not having my normal routine. Know it's only short term, but maybe I need to make more of an effort to meet friends for coffee etc. I guess I feel like my life is on hold for now while I go through treatment. It's frustrating! Is that normal?",
      "MessageIndex": 3,
      "PostDate": "31/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98216/chemo-advice-please",
      "Title": "Chemo advice please"
    }
  ]
}