{
  "AuthorID": "little jude",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
  "Posts": [
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi there Cazza40, what a hot topic, I really feel for you at the moment, your head must be ready to explode with all that is going on. Having been thro a messy divorce myself, the only thing I would  say to you is, think of yourself and your children, some solicitors   will offer half an hour free advice,once you have some facts to hand it may help you decide which way you can choose to go.Put yourself in the driving seat now, any person who chooses to have an affair (for whatever reason they want to use)is fully aware of the possible chaos and hurt it can cause,and should be adult enough to face the consequences, I hope you have support from your family at this time,perhaps they can help with the children to give you time to think clearly what you want to do. I found once I had made the difficult decision to divorce my unfaithful husband, I discovered I could live very happily without him, and relieved to not have to think about whether he was at it again,  and despite bc the world is still a good place., hugs from little jude",
      "MessageIndex": 15,
      "PostDate": "28/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59155/unfaithful-husband",
      "Title": "Unfaithful husband"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "cheers flower good luck on your journey,xx little jude",
      "MessageIndex": 9,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62074/bra-trouble-after-wle",
      "Title": "Bra Trouble After WLE"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi there, I haven't posted for a while but follow others posts daily,so just a quick question what does wle stand for? cheers,little jude",
      "MessageIndex": 7,
      "PostDate": "04/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62074/bra-trouble-after-wle",
      "Title": "Bra Trouble After WLE"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi there Gillie B, just a quick note to say spotted u r being treated at russels hall, I had all my treatment there apart from rads which was at new cross, have to say the staff are fantastic,and although there are often delays this was usually due to that extra care being given in time, I started losing my hair towards the end of the first dose of chemo so went for it and shaved the lot, did lose all my eyelashes and brows, finished all treatment last june have been back at work on a phased return for a year, hair and eyelashes back but grey, hardly any eyebrows though, now,on Letrozole, so as every survivor says it is doable, you can get through it, and come out the other side, just be kind to yourself, and rest and sleep, and in your good week, prepare for the next sessions,shop cook freeze,good luck xxx little jude",
      "MessageIndex": 6,
      "PostDate": "11/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64539/myocet-cyclo-chemotherapy-regimen",
      "Title": "Myocet / Cyclo Chemotherapy Regimen"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi Anne,chemo affects people in different ways,but one of the most important things is to stay away from infections, even minor colds can bring you very low. How about working from home via skype to your asst head ,that way you could keep daily contact if you felt well enough. Often the 3rd week after chemo is the best for being out and about, an perhaps a school visit could be possible,so keeping that personal touch and a much needed boost for yourself. Just remember the quicker you recover the sooner you can think about returning to work properly, the one thing you want to try to avoid is the possible bouts of infection that can lead to a stay in hospital, and delays of further treatment.. We have all had tom learn to tread carefully and let our bodies tell us what it needs . Good luck.and Happy new year to all xxx little Jude",
      "MessageIndex": 4,
      "PostDate": "31/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69169/back-to-work",
      "Title": "Back to work?"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi Diana, think I had either tramadol or codeine can't really remember,am not going for reconstructruction, just want to get on with enjoying life,still am numb in the chest and arm region,but thankfully no sign of lymphodema,do still think back to last year going thro chemo etc. but you know what that is soooooo! last year ,onwards and upwards that is what I say, best wishes Jude",
      "MessageIndex": 5,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58858/what-to-expect-just-before-and-coming-out-of-mastectomy-surgery",
      "Title": "what to expect just before and coming out of mastectomy surgery!"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi N, I had a mastectomy and lymph node removal Oct 2011, no idea how long it took,just grateful to be asleep, op was thurs afternoon, assistance given going to the toilet because of drain fri afternoon, drain removed temp prosthesis fitted painkillers given, exercises given, and home.felt better being at home, kept up painkillers and stuck to excercises,and felt really good within a week.Just see this as the start of getting rid of this cancer,and the road to recovery, I am 60,and feel optomistic about the future, so good luck, and allow yourself time to recover properly. regards little jude",
      "MessageIndex": 2,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58858/what-to-expect-just-before-and-coming-out-of-mastectomy-surgery",
      "Title": "what to expect just before and coming out of mastectomy surgery!"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi there spudly, other people!!,I think anyone who avoids you is basically frightened -,of perhaps getting sucked into taking you to treatments they can't cope with , frightened of your fears and tears,what do they talk about to you?, and if they don't get involved it will all go away, I am a private person, and found that I needed to be clear at  what I wanted to happen.with my work colleagues, once I had mopped up their tears, I asked them to treat me in the same way, no sympathetic noises,just the normal affectionate insults,I visited them regularly and they made jokes about how i actually looked better now I didn't have to brush my hair, they sent me cards counting down the treatments, and flowers when the last treatment was over, they were there when I wanted them. Family was more difficult as my daughter, son brother and sister desparateley wanted to help,so one or the other took me to chemo, phoned, daily are you still alive? was the regular question(i can cope with that), I had to let them do things for me that normally i wouldn't think about them doing , washing shopping.got to quite like it, it allowed me to rest. My biggest issue came from my ex husband, I discovered he had e-mailed several friends we had made friends with when we lived in a different part of the country, informing them of my diagnosis, I wanted to tell them when it was all over, but this made it difficult for some of them to deal with and their letters to me now don't mention what has happened, and therefore it has now become the elephant in the room with them. Stick with your friends and family who want to be there for you, don't worry about the others, if they want to remain friends after the treatment is over show them you are the bigger person in this.good luck liitle Judexx ps you will make new friends on this site and along your journey",
      "MessageIndex": 4,
      "PostDate": "23/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59005/how-to-deal-with-how-people-react",
      "Title": "How to deal with how people react"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "I was diagnosed Oct 2012, had mx, 3 fec 3 tax, have been on letrozole for just over 1 year. the most valuable word I found has been acceptance,accepting having this disease,and that the treatment was the best option to survive,no I didn't want to go through this at all,but accepted I couldn't solve this by myself,and with all the research into breast cancer, had to accept this was the best way to go. yes it was tough but crossing off each treatment on the calendar with a red pen, brought me closer to getting this b'tard where it hurts, nearly 2 years on  I, am back at work,  still being checked, I now have to accept the new me,a different me but still me,remember the doctors and nurses, are giving you this treatment so that you can enjoy the rest of you life,accept this and you will get through it good luck, hugs little jude",
      "MessageIndex": 2,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65910/fec-taxotere-then-letrozole-how-do-you-do-this",
      "Title": "FEC, Taxotere then Letrozole how do you do this?"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi there cat53, I am on Letrozole and I was given a bone scan, and prescribed calcichew tablets, so see your consultant, hope all goes well with you xxx little jude",
      "MessageIndex": 2,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60964/calcium-suppliments",
      "Title": "Calcium Suppliments ?"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi cat53, my bone scan came back no problems but my onc prescribed calcichew as a preventative against thinning bones, if you are still concerned contact them again,xx little jude",
      "MessageIndex": 5,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/60964/calcium-suppliments",
      "Title": "Calcium Suppliments ?"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi Molly, I too have been on letrozole for just over a year, unfortunately I do have thinning hair, painful knees ,fingers and toes, I also have some dizzy spell when i get overtired , so i use this symptom as a warning to slow down, Iam 61, so have to balance these issues with getting older as well, so how much the aches and pains are due to the letrozole or ageing, is anyones guess, but this drug appears to be successful in the prevention of the return of cancer, so I'll stick with it, good luck little jude",
      "MessageIndex": 9,
      "PostDate": "29/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66449/side-effects-of-letrozol",
      "Title": "side effects of letrozol"
    },
    {
      "AuthorID": "little jude",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/little-jude",
      "Content": "Hi there,I am on the mammo 50, finished treatment 5 years ago, and was asked 3 years ago, the main reason is that for some people the yearly mammo can cause extreme stress to some people, and elimination or stress is vital in everyone's wellbeing, I was put in the 2 yearly group, and towards the end of the period I asked for an early mammo as I thought my remaining nipple seemed withered, one was arranged within 5 days, all was well just old saggy breast I was pleased to say.,. As this is a trial make your own choice  knowing that if you have concerns you will not be ignored, it may be after this research that more frequent mammos ARE needed, that is what research is about finding the best pathway for all, Jude60(now 65)",
      "MessageIndex": 8,
      "PostDate": "25/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129373/mammo-50",
      "Title": "Mammo 50"
    }
  ]
}