{
  "AuthorID": "Lizzie58",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lizzie58",
  "Posts": [
    {
      "AuthorID": "Lizzie58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lizzie58",
      "Content": "Hi everyone - I was diagnosed with breast cancer in Oct 2010 following a routine mammogram.  Had surgery followed by radiotherapy and have been on tamoxifen since then.  My periods had been regular as clockwork until April last year when they abruptly stopped.  I couldn't decide if this was the tamoxifen or my age (53), but to be quite frank, I welcomed the cessation. Then in mid December last year I had the mother of all periods together with a great deal of pain.  Again I thought this must be something to do with the tamoxifen but then I had my annual BUPA Well Woman check and the doctor suspected fibroids. Had a scan last week and I do have fibroids and a cyst on each ovary.  Due to see the consultant tomorrow and will probably be told that it's very common and all is well, but can't help feeling a little anxious. Has anyone else had this sort of problem whilst on tamoxifen or am I being paranoid!    ",
      "MessageIndex": 0,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45737/tamoxifen-and-fibroids-cysts",
      "Title": "Tamoxifen and fibroids/cysts"
    },
    {
      "AuthorID": "Lizzie58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lizzie58",
      "Content": "Hi Ladies I had a WLE in Oct 2010 followed by radiotheraphy and am on tamoxifen for another few years now.  I feel a bit daft asking this, but does anyone know if after undergoing this sort of treatment, is our immune system affected? I just feel like I've had so many minor illnesses, such as stomach upsets, bronchitis and lately just don't feel right.  I don't normally bat an eyelid, and would hate to blame things on BC but I do feel rather down at the moment, especially as I was pulled up at work for being off sick for a couple of days a week ago.",
      "MessageIndex": 0,
      "PostDate": "09/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64513/is-our-immune-system-affected-by-radiotheraphy-tamoxifen",
      "Title": "Is our immune system affected by radiotheraphy/tamoxifen?"
    }
  ]
}