{
  "AuthorID": "lj2821",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lj2821",
  "Posts": [
    {
      "AuthorID": "lj2821",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lj2821",
      "Content": "Hi,  I'm a bit worried about posting in here but I'll give it a go. I have a little boy and am pregnant with my second.  About 5 weeks ago I had some redness on my right breast and a little bit of orange peel skin I went to the doctor but when I lay down for examination the redness disappeared so she put it down to pregnancy. The redness has now gone but the orange peel skin has not. I went to the doctors yesterday who has referred me to our local breast unit and appointment could be 2 weeks.  I'm terrified. I am thinking it's the worst. The thickness seems to come and go but my breast is sore most of the time (mainly around the nipple) and I think the breast is bigger than the other. I can't stop checking the area about 30 times a day.  I had nothing but trouble with it with my first child with mastitis and a lot of swelling but not until after the birth.  I'm not sure I can cope with a two week wait. I'm completely on edge and tearful all the time. I'm not too sure what I'm doing or writing here but I feel like I need to get it out. ",
      "MessageIndex": 0,
      "PostDate": "11/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123107/possible-ibc---pregnant",
      "Title": "Possible IBC - pregnant"
    },
    {
      "AuthorID": "lj2821",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lj2821",
      "Content": "Hi Millie, I'm 21 weeks pregnant. I'm so tearful I don't know what to do with myself! Having pain in my other breast (which I'm hoping is pregnancy related) actually feels like a positive. With my first it was the same breast that caused me problems as it is now. I couldn't find any bras that were comfortable, my nipples were sensitive and I couldn't rest my child on my right side because of the pain.  I know it's right to get it tested but it blindsided me really i wanted them to tell me it was all fine!  The thickness does seem to come and go and it's more prominent went im not lying down when I've been led down for a while it could almost be seen as normal. I'm hoping that might be a positive thing but who knows. ",
      "MessageIndex": 2,
      "PostDate": "11/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123107/possible-ibc---pregnant",
      "Title": "Possible IBC - pregnant"
    }
  ]
}