{
  "AuthorID": "Lola 44",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
  "Posts": [
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Gerty, During my fec and tax, i travelled often as treats between treatments. Train to paris, plane to strasbourg and plane to uk, i live in west france. I never had any priblems. It did me good in fact. I am sure it will you too, go and enjoy. Lola x",
      "MessageIndex": 2,
      "PostDate": "23/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58094/going-away-for-few-days-to-iow-via-train",
      "Title": "going away for few days to IOW via train"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Happy Healthy New Year to everyone, I hope everyone managed to enjoy some of the festivities. Now its all over I am having a clear out in my wardrobe. I have finished chemo and I am having a MX on 10 January, just starting to get a wobbly feeling in my tummy, and I am starting to think about straight after the op. I know I will be in for 4 days until drains come out. But what sort of clothes did you wear in the weeks following surgery, did you wear a prothesis and bra straight away? I have got all my baggy jumpers at the ready. Should I have lots of button ups or will I be able to put clothes over my head. I have a meeting Monday with the nurse before my surgery. Any important questions I should be asking?How did you manage to sleep the night before? I have a little cry everyday already!!!! Hugs to all, Lola xxxxx",
      "MessageIndex": 0,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56485/weeks-following-mx",
      "Title": "Weeks following mx"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi, thanks for all your replies, i will dig out some button up tops. I am hoping to start work after three weeks, i work from home teaching, is it feasible? None of my young students have any idea I have been through chemo. For those of youvstarting chemo, like everyone says, plenty of rest week one then build up weeks two and three, take all medication given to help, emend really helps nausea, and I took pain killers for day before the tax pain started. What is anc? Does everyone have it? My surgeon says he will take out three lymp nodes to check, im hoping as inhave had chemo first they will be clear! Nikki I will be thinking of you starting chemo on the 10th, when i wake up. Big hugs. Lola xxx",
      "MessageIndex": 6,
      "PostDate": "02/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56485/weeks-following-mx",
      "Title": "Weeks following mx"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi, had my mx last week and lymph nodes removed, not sure how many, its still very numb under my arm, like after being to the dentist, when can I start using deodrant there? Also how soon after did you drive?. I forgot to ask these questions when I left the hospital andnmy follow up rdv is next Monday. Hugs. Lola x",
      "MessageIndex": 0,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56944/deodrant",
      "Title": "Deodrant"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Gosh, driving question was a bit of an after thought. I jst assumed I would get in my car and drive off next week. But as mx was my right side and i change gear on the right it might not be so safe. Will check next week. Better not let my 23 yr old son see this he will want to take my car for a month. Lola x",
      "MessageIndex": 3,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56944/deodrant",
      "Title": "Deodrant"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi, After my biopsie whilst waiting tobstart chemo my lump was very painful and seemed to get harder, once i started chemo i found for the first week after chemo I had pains in my lump which subsided after first week and the lump got softer, this seemed to happen after each of my chemos, I used to ring breast cancer care nurse who assured me this is normal for some people and also it could be my mind, imagining things, very power minds at the mo. But speak to someone, its really very assuring. Hugs, Lola",
      "MessageIndex": 7,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55951/lump-pain",
      "Title": "Lump pain"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi SuzyJane, I was diagnosed 30/7/12 with IDC, triple negative. My lump was 40mm. I had 3 x Fecand 3 xtax. I remember with the fec it seemed to hurt for about a week after each treatment, like you the oncologists seemed puzzled but the nurses said it could be a sign of it working. With the three tax it seemed to go harder and hurt for a week after and sometimes just before treatment, i wondered if it was stress. I could also easily imagine a pain in the ither breast. So i wondered if it was my mind. My lump didnt grow any bigger and it didnt shrink either.during all the chemo. After I had the mx as planned and 27 rounds of rads. I feel fine now, but do sometimes wonder if i should have insisted on stopping chemo and having mx earlier. My oncologists said all time the chemo first was to zap any stray cells early and shrinkage would be a bonus so whilst the lump didnt grow he wasnt oncerned. Are you staying on fec or changing to another chemo? Try talking thru it with your oncologists. I rembervreally worrying about this which seemed to make it worse. Others had pain and their lump shrunk, so it is poosible thats whats happening to you. I hope so. But as long as its not getting bigger the chemo is doing its job. big hugs. Lola xx",
      "MessageIndex": 5,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59975/breast-lump-hardened-and-sore-during-fec-chemo---is-this-normal",
      "Title": "Breast lump hardened and sore during fec chemo - is this normal?"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "I had my last tax 7 december, day three my aches use to start so after the first i knew to start taking the pain relief from day 2 so it coukd build up. Unfortunately tax is cumulative so builds up. I lost the rest of my eyebrows and lashes with tax. But they are now back, taste buds came back almost immediately, but im afraid the tingle in finger tips and the aching feet are still here. Feet feel like blocks of ice generally on a night time.even with my thick socks on and they are warm to touch. Hoping its not forever! Lola x",
      "MessageIndex": 14,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58595/finished-fec-and-start-tax-on-wednesday-but-feeling-really-nervous",
      "Title": "Finished fec and start tax on Wednesday but feeling really nervous..."
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Where has the triple negative group gone? I cant find it anymore and i would love to compare treatments with other tnbc. Lola xx",
      "MessageIndex": 0,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57271/triple-negative-b-c",
      "Title": "Triple Negative B C"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Thanks, found it in experiences, not groups. Lola xx",
      "MessageIndex": 3,
      "PostDate": "27/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57271/triple-negative-b-c",
      "Title": "Triple Negative B C"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Aroma mum, i had my last chemo on the 7 December, 3 x FEC 3xtax, I had my mx on the 10 january and will start 25 sessions of rads 20 february. Between my mx and rads i have had physio 3/4 times a week to prepare my skin and help mobility. My radiotherapists sais rads shoukd startt somewhere between 4 to 8 weeks after mx. Hope this helps. Lola x",
      "MessageIndex": 8,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57607/new-to-the-group",
      "Title": "New to the group"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Mandi, Ive just had my third tax. No sickness like with fec, i had mine on a friday, then slept most of the afternoon. Saturday mornings up with the lark, feeling great, which always lasted saturday and sunday, so you may get to celebrate your birthday. Mondays i started with aching joints and feeling very tired, today is wednesday and the aching has subsided. By Fridays i am usually out and about but still tired. My oncologist told me to start taking pain relief 24 hours before the joints startbwhich has made the final two far more bearable than the first. I also used the cold gloves during infusion to help protect the nails. Good luck to you all starting tax. Its very doable. Happy birthday hugs Lola x",
      "MessageIndex": 6,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55891/what-delays-chemo",
      "Title": "what delays chemo?"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi. Just had my last tex, 3 x FEC 3 x TAX, mx booked for 10th jan. I thought i would be happy but i cant stop crying for the first time since July. My oncologists says its normal. But i have so many questions that he cant answer. One of them is my mri showed the tumour as 2.5cm, ultrasound one week before 19mm but the oncologist and surgeon have always marked it as 4cm after feeling it themselves. The tumour has not really shrunk after chemo so i think deep down my main worry is it has not worked, my onc. Says we dont know that until a pathology result after surgery. Still dont know stage either butt its grade 3 tnbc. I guess i justcwanted him to say, dont worry its going to be okay, but of course he cant. He did explain its possibly killed some of the cells but it just hasnt shrunk, as the remaining cells are spread out around lump.. Sorry to go on but i feel a little bettervalready just writing my feelings down. Hugs to all. Lola.",
      "MessageIndex": 0,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55821/so-why-cant-ibstop-crying",
      "Title": "So why cant ibstop crying?"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Tracey, Yes me too dreaded looking so it was nice to have the nurse with me. I would be scared at leaving hosputal the samecday, can you ask to stay longer? I know some people like to leave early but if you dont need too why should you. I am being treated in France and my surgeons rules were, stay in hospital and rest, accept your new shape infront if the mirror with a bc nurse and have the drain removed, then he will discharge you. My scar has healed nicely, its a long really thin line now and quite pale after fuve weeks. I started physio and massage in breast area after one week which will continue for 30 sessions. I had my chemo before surgery, but start five weeks of rads tomorrow. My hubby razored my hair after the first chemo session, i cried, but i had ohosen a wig like my hair beforehand, wore it from that day forward and a bonnet at night time. I never looked in a mirror without wig or bonnet, i just didntvwant to. The only person who saw me bald was my acunpuncture guy and i guess the operating team. Let the surgeons look after you and you take care of the rest of your body. Lots if fruit and veg particulary brocolli. Will be thinking of you. Hugs. Lorraine x",
      "MessageIndex": 13,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57911/recent-diagnosis-has-left-me-stunned",
      "Title": "recent diagnosis has left me stunned."
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Tracey I was given a sheet with exercises to start gently that same week. You can google exercises after mx if you havent been given any. My physio works on my upper arm twice a week still, my op was 10 jan. she also showed me hw to massage the scar to help quicker healing with out it sticking inside. Did you ave sime lymph nodes removed? Hugs. Lola x",
      "MessageIndex": 25,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57911/recent-diagnosis-has-left-me-stunned",
      "Title": "recent diagnosis has left me stunned."
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Winston, I found although tax is painful for four days and tiring for over a week i still prfer it to the fec and horrible sickness. I start taking xpirim pain relief a day before pains arrive which helps, also day ten i have acupuncture which boost me up and from there on its back to normal for final week. Fresh pineapple for the taste buds. Spoonful of tumeric with black pepper and nut oil everyday and lots of broccoli. I also have for frozen gloves on during tax and have had no nail problems so far. Just had a lovely walk on the beach, fresh oysters and no tears for two hours. So treats and walks def help me. Thank you all for your positive messages, it really helps. Big hugs. Lola x",
      "MessageIndex": 6,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55821/so-why-cant-ibstop-crying",
      "Title": "So why cant ibstop crying?"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Tracey, Im triple negative too, i had chemo first that didnt shrink the tumour so on 10 January i had a mastectomy and 14 lymph nodes removed. I have not had reconstruction. Before surgery i threw out all my bras and got a couple of mestectomy bras. I bagged up all tight fitting t shirts and jumpers and left out my baggy clothes. Surgery was a thursday, like you, sunday morning the nurse stood in front of the mirror with me, and heped me with my bra and comfy, soft protheses. I left the hospital monday wearing my bra and a normal jumper. Nobody can tell which breast was removed, i wear normal fitting t shirts and jumpers, never wore the baggies, yes i undressed most nights and cried probably for the first week, but since then i have been really surprise how quickly i have adapted, i m so pleased i didnt have to change my wardrobe or dress style. I will be thinking about you thursday and dont frget, normal clothes monday. Hugs. Lorraine x",
      "MessageIndex": 8,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57911/recent-diagnosis-has-left-me-stunned",
      "Title": "recent diagnosis has left me stunned."
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Tracey, Thought about you over the weekend. So glad evrything went okay, keep up the arm excercises, and rest plenty, get hubby to do the cleaning, ha ha. Hugs Lola x",
      "MessageIndex": 20,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57911/recent-diagnosis-has-left-me-stunned",
      "Title": "recent diagnosis has left me stunned."
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Carol, hope your rads went okay today. We do seem to be given more here in France, I have 25 booked in for after my mx. No wifi for me at St Naz hospital so lots of dvds ready. MX tomorrow, getting really nervous now. Good luck and big hugs to everyone starting new treatments this week. Lola xx",
      "MessageIndex": 13,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56659/last-hurdle",
      "Title": "Last hurdle!!!!!"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Hi Eider, I am also having treatment here in France, just had my first Tax after 3 x FEC. I am using Evonail as recommended by hospital, can you wear nail varnish also do you know? I also used the frozen mittens and managed to keep my hands in for the whole time. Did you use them? Lorraine",
      "MessageIndex": 17,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53296/the-wonders-of-evonail---day-13-no-nail-damage",
      "Title": "The wonders of evonail - day 13 no nail damage"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Is it possible to stage a cancer if you had chemo first before surgery? I had a mx two weeks ago after chemo 3x FEC 3xTax. My tumour always stayed at 4cm, manually measured. Results of pathology shows a tumour of 2.5 x 4cm with some living cells, she didnt say if there was any dead cells. 14 lymph nodes taken out, 1 positive 13 negative. Dont know if more were involved before chemo. She did say chemo didnt work as well as hoped. But nothing visible to the naked eye left. Now booked in for 25/27 rads starting in three weeks. Should the tumour have another dimension? Or do i times the two to get a true tumour size? How do they work out how many rads? She said they are going to do rads on mx site plus lymph node site. Why do I always feel down at the end of each stage of treatment? I should be happy its all out, but I keep thinking but the chemo didnt kill it all! Sorry aboutvall my fear questions, just would like someone elses take on all this. Lola x",
      "MessageIndex": 0,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57236/grading-after-chemo",
      "Title": "Grading after chemo?"
    },
    {
      "AuthorID": "Lola 44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lola-44",
      "Content": "Mine was grade 3 after core biopsie, but was never given a stage, i gues because they didnt know if lymph nodes were involved until aftercsurgery. Hope you are feeling better today. Im in France so I know how difficult it is in a foreign country having treatment. Hugs Lola",
      "MessageIndex": 2,
      "PostDate": "25/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57236/grading-after-chemo",
      "Title": "Grading after chemo?"
    }
  ]
}