{
  "AuthorID": "Londonbutterfly",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
  "Posts": [
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Hi Gill, it's Gill here too! I had my nipple tattoo earlier this year, also privately, but I had to wait longer than 6 weeks after the nipple reconstruction.  More like 6 months.  I think that varies from surgeon to surgeon, and also there was a waiting list for that tattoo artist.  I am very pleased with the result, although I know it will fade over time.  The lady who did my tattoo recommended and supplied a particular gel, which was an antibiotic one.  She just covered it with gauze and I could wear my normal bra.  It was completely painless and healed in no time at all.  You'll be pleased to get it done, it really makes a difference to how the reconstruction looks. Gill x",
      "MessageIndex": 2,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95439/re-nipple-tattoos-can-you-help",
      "Title": "Re. nipple tattoos, can you help?"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Hi Kipper and Ogre... both your messages have really resonated with me and although I log in here regularly and read (and marvel) at the tenacity of us women facing this awful challenge, I have yet to post, but I just wanted to do so tonight.  I am 54 and was (happily) married for 28 years when my I found my husband (whom I had nursed through cancer of the oesophagus) was having an affair in 2012.  I was totally devastated.  My best friend of almost 40 years didn't like the way this 'changed me' and put some distance between us which I found very hard to understand.  Then 6 months after, I too found a lump which was diagnosed as breast cancer - a total bolt from the blue,there's no family history.  I can't tell you how many times I thought that the only person I should have had supporting me at this time was the very person who had walked away.  I have also have no children.  I have an elderly father, I am an only child.  I totally agree that this journey takes 100% commitment and I have had little time (or interest) in other people's trivia - which is most unlike me usually I must add!  I have been off work since the beginning of May for the first time since I left school and that alone has give me time to think... but mainly to have time for ME when it feels I have spent years worrying about other people. I've now had a mastectomy and DIEP reconstruction at the same time, endured the FEC-T chemotherapy and 15 daily sessions of radiotherapy (just finished last week... phew) and have now started on the hormone suppressant Letrozole.  I am out the other side.  I echo other's sentiments on here, that it is entirely \"do-able\" but there's no doubt that it changes you. I just wanted to say that those were the darkest times... but as hard as it seems right now, it does get better and every cloud really does have a silver lining.  Sometimes that's easier to see in retrospect... My husband's fancy woman has since thrown him out - well... I did warn her!  I kept a journal which I found it very cathartic and I noted this saying \"Sometimes when it seems things are falling apart...they may actually be falling into place....\" I have now found a new love, a truly amazing man who's mother went through this same thing 30 years ago and is still here to tell the tale. I never expected to fall in love again, and truly thought I would be on my own forever.  However, I am happier in many ways than I've been in years.  So.. hang on in there ladies.   Big hugs Gill xx    ",
      "MessageIndex": 3,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Ooh yes, Susie, I'm the same.  Some days I feel so lucky/thankful/happy to be alive after everything...and other days I'm the same as you....where is it lurking and when will it happen?  I totally understand your panic mode description.  Some days I feel I am living on borrowed time.  I have to say, though, that I had CBT for my 'catastrophising' thoughts and it really did help me.  I can't recommend it highly enough - especially if you are used to being in control of your life.",
      "MessageIndex": 8,
      "PostDate": "07/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96243/i-m-growing-a-hairy-furry-face",
      "Title": "I'm growing a hairy,furry face!!!"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Hello Tilly.  I can literally feel your anxiety through the screen.  Big hug.  We've all been when you are.... What type of reconstruction are you due to have?  DIEP?  That's what I had.  My surgery was 7 hours and I spent a week in hospital, which was all what was expected.  There weren't any complications.  There's no denying it's tough, but it's do-able and you are in the expert hands.  Remember this is what they do!  It's new and scarey to us, but it's just their day job! Personally, I am pleased I had the option of reconstruction at the same time, because although it's a much bigger procedure, at least it is just the one procedure, the one anaesthetic, the one hospital stay, the one recovery.  I'm not sure I'd have gone back otherwise! I followed the advice, did the exercises, the physiotherapy, took the painkillers and rested when required and I am still here to tell the tale almost 4 years on. All the very best to you. Gill xx",
      "MessageIndex": 1,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128133/breast-reconstrution",
      "Title": "Breast reconstrution"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Welcome, and you are in the right place for information, guidance, support and making new friends.  Who'd have thought any of us would be in this strange old club...  I had my mastectomy on 1st June. Please don't be too anxious about the chemo, I have had mine this year and just completed the radiotherapy too. As others have said on here, it is all entirely do-able and the drugs they give you to combat any side effects are very effective.  I was told that there is a tablet for any side effect, so don't be scared to ask.  Don't Google anything and keep your internet surfing confined to this website! I am pleased to be seeing the end of this last 7 monthS, and I know you have it all ahead of you but head down, soldier on and let the experts deal with you.  The best advice I was given by another BC survivor was, \"it may be your body, but it's their cancer, let them deal with it...\" I wish you all the best for the 18th.",
      "MessageIndex": 1,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68447/axillery-clearance",
      "Title": "axillery clearance"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Hello ladies.  I also bit the bullet and rang my oncologist.   I have a bone scan and x ray on Monday.   I agree with you both. ..this fear, this black cloud on the horizon never goes away.  I'm trying to stay positive and not ruin the next few days with worrying myself sick over what might be arthritis.  Never thought I'd be thrilled to have arthritis!  Good luck all xx",
      "MessageIndex": 8,
      "PostDate": "07/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126344/really-scared-about-pain-in-pelvis-help-and-advice-please",
      "Title": "really scared about pain in pelvis help and advice please"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Morning, I'm right here with you....awful pain in my hip, kept me awake last night.  I've had it a few months now, on and off, but twice it's been really severe...last night was one of them. I have bitten the bullet and rung Macmillan at my local hospital to get into see my oncologist. I am shared witless at the thought it might be secondary bone cancer, and it's all I seem to see and hear these days too. I had all my breast cancer treatment almost 4 years ago. There's a chance yours could be sciatica though, as the pins and needles matches that.  Have you had that before? Gill x",
      "MessageIndex": 1,
      "PostDate": "05/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126344/really-scared-about-pain-in-pelvis-help-and-advice-please",
      "Title": "really scared about pain in pelvis help and advice please"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Hello ladies, Bursitis sounds exactly like my pain too actually and I certainly have been over-doing the exercise lately, trying to lose the weight I put on over Christmas before I go on holiday.  Fingers crossed.  My pain has much improved with rest and Ibuprofen.  Nevertheless this radioactive scan on Monday will tell me for sure what's going on.  I don't want to know....and I do want to know.....I am sure you will all know how that feels! I've tried really hard not to dwell on it this last few days, and remember that worrying about it isn't going to change it. Good luck ladies and let's keep each other posted. Gill x",
      "MessageIndex": 10,
      "PostDate": "09/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126344/really-scared-about-pain-in-pelvis-help-and-advice-please",
      "Title": "really scared about pain in pelvis help and advice please"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Tanya, hi there!  I absolutely can recommend you a range for wig care, they make shampoo, conditioner and an oil, all of which smell wonderful  It's called DIMPLES, from a firm in Manchester.  I buy it from the place where I bought my wigs, who would post the products out to you if you like, but you may find the company itself has a website.  Please do message me if you would like further information.  I'm in Essex, where are you?  All the best",
      "MessageIndex": 1,
      "PostDate": "06/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93816/nice-smelling-wig-shampoo-conditioner",
      "Title": "Nice smelling wig shampoo/conditioner"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Good morning Kay, I'd just like to highlight my personal experience, which may put your mind at rest.  I was in a very new relationship when diagnosed with breast cancer (after 30 years marriage, I found myself unexpectedly single again and found an amazing new man who I had only been dating for 4 months).  So, having got over the big shock of sharing my body with someone new after SO LONG with one man (which at my age, was bad enough!) I then have had to share my reconstructed/scarred and now chemotherapy stricken one.  He has reassured me that it's ME he finds sexy and desirable, not my breasts and he has proved that beyond bounds.  If it's the right man and the right relationship, and you are still confident in yourself, love will find a way.  I don't know what age you are Kay, but believe me... men of  my age (54) are very insecure about their own bodies (often, quite rightly so!!) and often have a lot that would best remain hidden!!!   Sexy underwear can hide a multitude of sins, and once his glasses are off and the candles are lit... it'll not pose a problem! Good luck and I'd be happy to chat with you. Gill x",
      "MessageIndex": 3,
      "PostDate": "24/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62769/dating-again-after-breast-cancer",
      "Title": "Dating again after breast cancer?"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Oh Kate, I really, really understand exactly how you are feeling. It's almost an anti-climax isn't it? I was directed my a friend (whom I met on here) to the writings of Dr. Peter Harvey, on www.cancercounselling.org.uk.  He has published a series of articles alluding to exactly these feelings and I found it so helpful to read them, and also to pass some of them to family and friends who did not understand why I wasn't bouncing off the ceiling when I got the news too.  This stuff we've been through changes simply everything, nothing is the same, but sometimes change is a good thing... we just need to learn how to embrace it.  I've not been back to work yet, and at the moment I cannot imagine taking anything that happens there seriously every again!  All this is enough to deal with, without all the petty small stuff that worries everyone out there in the 'normal world',  Try and read this guy's articles Kate and I hope they help you as they did me.  I'm happy to chat one-to-one if you want to message me.. Take care Gill xx",
      "MessageIndex": 1,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69973/emotions-i-really-didn-t-expect",
      "Title": "emotions I really didn't expect"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Ooh, I can echo your sentiments so strongly.... very similar circumstances, and like you, I've always been the person people turn to to help/support them. It's been eye opening, since my diagnosis in April, which people have disappeared and which have surfaced... often surprisingly. Comments like keep strong, positive etc do wear thin. I've had a really tough 12 months, emotionally, before all this too with the ending of my 30 year marriage. Had my first round of Taxol chemotherapy last Friday has left me in bed with bone pain but there's light at the end of the tunnel I guess, only two more to go, then radiotherapy begins, but should be over by Christmas. ",
      "MessageIndex": 28,
      "PostDate": "09/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64335/my-experience-so-far",
      "Title": "My experience so far"
    },
    {
      "AuthorID": "Londonbutterfly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/londonbutterfly",
      "Content": "Ooh, I can echo your sentiments so strongly.... very similar circumstances, and like you, I've always been the person people turn to to help/support them. It's been eye opening, since my diagnosis in April, which people have disappeared and which have surfaced... often surprisingly. Comments like keep strong, positive etc do wear thin. I've had a really tough 12 months, emotionally, before all this too with the ending of my 30 year marriage. Had my first round of Taxol chemotherapy last Friday has left me in bed with bone pain but there's light at the end of the tunnel I guess, only two more to go, then radiotherapy begins, but should be over by Christmas. ",
      "MessageIndex": 13,
      "PostDate": "09/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64335/my-experience-so-far",
      "Title": "My experience so far"
    }
  ]
}