{
  "AuthorID": "LoneFox",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
  "Posts": [
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hello Hannah, can I first of all echo the thoughts of the other ladies who replied in saying how sorry I am that your dear Mother is suffering so much pain with Taxotere. I know this may sound very personal, but I do have my reasons for asking this; I am 55 years old and am due to start Taxotere chemo in the New Year. I was just wondering what age group your Mother falls in to ? Is she my age, and if so I am wondering whether I will also suffer as your dear Mother does. I really need to be fully aware of what CAN happen and what lies ahead because my Husband can barely cope at the moment with me on this other Chemo, let alone if I am going to be in a lot of pain as well. I need to get some extra help in place (if I can) before the Taxotere treatment begins. Any advice would be most gratefully received. Thankyou for any advice anyone can offer. LoneFox",
      "MessageIndex": 4,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44163/taxotere-pain",
      "Title": "Taxotere pain"
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hello again Hannah, absolutely NO apologies necessary from you for not having replied until now. I can quite easily understand how stressful and time-consuming this dreadful illness is, and when you are going through it with a loved one, as you are with your dear Mother, I sometimes wonder just WHO its more difficult for - the sufferer or the Carer. Thank you so much for all the information that you have passed on through your own Mothers experiences. At least I know what I should prepare for, and I need to know to take things 'one day at a time' - and I will. I am very very fortunate enough to have a loyal, caring and supportive Husband. I do however have one HUGE obstacle to overcome and I truly don't know how I am going to get through it once I'm on the Tax. I have a very poorly 93 year old Mother who was taken in to Hospital 10 days ago. At the moment, and throughout the treatments of FEC I have been able to visit he daily (since I am her only visitor I ALWAYS have to make the effort.....). However once the Tax. kicks in I truly don't know how I am going to be able to cope, and thats a huge worry that weighs constantly on my mind. She has lived in our home for 20 years and we are close, so you can imagine the pain I feel and the worry KNOWING that I may not be able to visit her in the coming weeks. Can I also ask this, though it may sound stupid and of course you may not know the answer, but I'd appreciate your VIEW on it anyway please Hannah. Obviously you know how they Grade cancers and how they group them and divide them up.....etc etc. Do you think that they MIGHT then have different strength doseages of Tax and FEC etc as well ? I'd just like to know whether you think its a 'one size fits all' blast at the whole darned lot of the cancers or do you think they're diluted for what they deem a 'lesser' aggressive form of it ? Also before I go.....did your Mum suffer any problems with her Nails at all ? I've read somewhere that this Tax can make your nails very brittle with a lot of lines, cracks and breakages. Thanks for ALL your help. I will let you know how I am getting on....... promise. Please also pass on my very very best wishes to your dear Mother and I SHALL have her in my thoughts and prayers for her final session next week - WELL DONE, WELL DONE INDEED ON GETTING THROUGH IT ALL. It heartens me in that if your Mum can do it, the I can do it...... I hope!!!. In deepest gratitude to you both........................... LoneFox (Julie)",
      "MessageIndex": 9,
      "PostDate": "10/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44163/taxotere-pain",
      "Title": "Taxotere pain"
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "I cannot reply to your post Suzie about the Cording because of some kind of website glitch, so I am trying to reply to you by opening a new discussion/post. I hope you will read it. The following is what I wrote but it won't allow me to 'publish' it onto your own post titled 'Cording'. I also sent you a Friend invite in the hopes I could reach you that way as an alternative. Heres what I wrote: Hi Suzie, I hope my experience might help with your concerns. I don’t think that you have ‘Cording’ (though I’m not medically qualified I hasten to add), just a woman who had a Mastectomy back in early October). I did have some Nodes removed though, but hadn’t realised I’d anything other than the Sentinel node removed until I met with my Surgeon a month later. I had wondered why my upper arm was excruciatingly sore. However, to begin with my upper arm (the underneath fleshy part) was very swollen, stinging red-hot and very very tender to touch (in fact touching it was unbearable to begin with). At first I felt as though I had a basketball under my arm between the armpit and the side of my body. The ONLY relief I found was in a small square-shaped plastic bottle which I used to fill with water and put in the Freezer. I then used to hold it under my armpit for hours on end – my under arm was so numb that I couldn’t feel the intense cold from the bottle of ice. The relief it brought to me was unbelievable. I even took it to bed with me. I found as the days went on the ‘ball’ feeling under my arm reduced from basketball sized to softball then to tennis-ball and finally - golf-ball. These days I only ever get the ‘golf ball’ feeling if I over-do things with my arm. It DOES get better though Suzie. I hope it’s NOT Cording that you are experiencing, and I also hope that my own experience has helped you a little. Take good care of yourself, LoneFox",
      "MessageIndex": 0,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44828/cording---reply-to-suzie",
      "Title": "Cording - reply to Suzie"
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hi Everyone, Well I've had many folks say \"Oh you're so brave, I couldn't go through it\" - but I tell them \"You would HAVE to go through it if you were diagnosed with any type of cancer\".  What stupid remarks people do make don't they?  But my favourite one is this, and you WON'T beleive how IGNORANT about any form of cancer that some people are \"Is it catching?\" - and they say this as theyare moving a few feet AWAY from me in case it is!!!!   Come on, admit it, you don't know whether to laugh or cry do you?  All the best to everyone - stay strong and keep up the fight!!!   LoneFox",
      "MessageIndex": 8,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49451/how-to-make-a-woman-going-through-chemo-feel-so-much-better",
      "Title": "How to make a woman going through chemo feel so much better..."
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hi Ruby, You are a LIFE saver........ I've tried the hot-water Honey drink and it DOES seem to have helped. Its certainly improved a lot since yesterday (4th) which was my worst day ever. Seems the digestive problems have increased in severity after each of the FEC treatments. I've had three so far, last one was last Wed (28th). My treatments now change to Taxotere on the 18th and I'm wondering if I have more, even worse (if its possible) digestive problems ahead ? I suppose I could 'post' and ask this, because I need to know the POSSIBLE side effects to expect with Tax besides this bone-pain I've been warned about. Are they the same possible side-effects but with bone-pain and extreme tiredness added or do these two replace some/all of the FEC side effects ? I meet with the Oncologist tomorrow (Fri) so I guess I should ask her, but I'd really like to know from the REAL professionals.....the ladies who have been through it all ahead of me, ladies like yourself, and not some clever woman in a white coat. You know what I mean ? Its not as if she is approachable even (her sidekick is.....she's lovely.......but knowing me I'll get THE main woman). How are YOU doing Ruby ? Whats going on with you in your life ? Did you have a good Christmas and New Year and were you able to enjoy them ? I do hope so. Look forward to hearing from you soon. If you'd like to email me direct rather than keep messing around with this website (don't know about you but I find it rathe difficult to navigate) - my own emails address is this; daltonfox@btinternet.com Love and hugs, Julie",
      "MessageIndex": 3,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45747/digestive-problems",
      "Title": "Digestive problems"
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hi Everyone, I've just finished my 3rd FEC treatment (Wed 28th). After each previous Chemo I have had digestive problems and acid - but with increasing severity each time. This third time is absolutely unbearable. I have a (kind of) block (its not I know, but thats the best way I can describe it) in my centre midriff (stomach area I suppose). When my food (or even fluids) come to pass it, it can be sooo painful. I have a sharp pain of discomfort in each side at the same time AND a pain across my Back - so the side pains meet each other, round in a circle, if you will. Does anyone have ANY advice on what I can do to ease it. What food/liquids should I avoid ? I don't ever drink alcohol so thats not a problem. I need foods to avoid, fluids to avoid and what to purchase to take to ease it because its getting that I cannot take much more of this discomfort each time I take a bite no matter how small. ANY help and advice most gratefully received...... Thanks, LoneFox",
      "MessageIndex": 0,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45747/digestive-problems",
      "Title": "Digestive problems"
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Dear Beckie, like you I too (I have to day 'had' these days and not 'have') very long hair - mine was around 2 foot ong. Wore it swept 'up'. So I KNOW exactly how you are feeling Beckie. I understand all you said about the wig and the headwear. In the house I wear a very lightweight pull-on hat during the day (in case I have to answer the door or go near a window) but in the evening I tend to go 'commando' - I hope this made you smile. Outdoors I either wear the wig or one of several dozen hats I seem to have accumulated over the past few weeks. Actually I prefer a hat to a wig. I have ordered a 'fringe' online last evening. At least its SOMETHING to give the impression of 'hair' poking out from under my hat!! I had my hair cut short in three stages by the way. Long to shoulder-length, shoulder-length to a shortish crop and then of course...... well, you can fill in the blanks but it involved a head-trimmer. I sincerely hope that everything goes well for you tomorrow - I shall be thinking of you Beckie and so will a lot of other ladies on this site. You've come to a good place - THE BEST. We all walk along this road together, some holding hands and other just walk with us, but NONE of us are alone I assure you. Message me ANY time. I'm here every evening. Its good that you have a family around you - they will give your spirits a lift and keep you going and you'll get through this !!!! Hugs by the dozen to you....and very very BEST wishes...... be 'with' you tomorrow, in spirit..... LoneFox",
      "MessageIndex": 9,
      "PostDate": "19/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45340/new-to-all-this",
      "Title": "New to all this ....."
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hi Ellen, well.........I gave mine a 'helping hand' on the way last week......and I'm sure many many other ladies on this site do too. Hey......DON'T be sad. I know how deflating and, in a way, dehumanizing it can be, but just think.....a few months down the line we are ALL going to get BRAND NEW HAIR !!! How many folks can boast THAT ?? Mine was almost two feet long......now....nothing. I could sit and cry and sob my heart out but I haven't and I won't. I REFUSE to let it get me in that state. I've enough to cope with without letting another chink in the 'armour' turn into a crack.. I've bought a Santa hat - to lighten the situation, and several other bits of headgear too. Got a wig weeks ago and though I like it, theres just something about it that I find 'odd'. Can't quite say why I feel like this. I just know that US ladies on this site belong to a very exclusive 'Club' a 'members only' Club. Ok, so there are better 'clubs' to belong to but there are also worse. Its just the passage of TIME thats going to heal us and help us through Ellen. Patience. One things for sure, time NEVER stands still, and is a 'constant'. Lost my own breast back in October. I am two down and four to go with Chemo sessions, finishing the end of Feb. I was VERY sorry to learn of your hospitalisation. I'm astounded that a cold-cap could cause such distress and such problems for you Ellen. I hope its all over now. Hope you are looking forward to a very HAPPY CHRISTMAS. Go on, have a GREAT time!!! You ARE allowed!!! I'm going too..... and my next Chemo is just after Christmas on the 28th. Take care and best wishes, Lonefox",
      "MessageIndex": 2,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45268/has-shaved-my-head",
      "Title": "has shaved my head ! :)"
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hi Gemma I don't know if this helps but I had a mastectomy on Fri 7th Oct (about 3 weeks ago) and was told I'd be in from the Friday till the Monday. Once they were satisfied with the fluids being drained out through the 'drain' then I would be released. Unfortunately errors were made (an auxiliary nurse put the tube clamp into the SHUT position whilst emptying my drainage bottle one morning). It took 2 days for anyone to discover the error despite my dressing leaking from the fluid having nowhere to go, I take it. Anyway this set me back another 3 days and I didn't come home till the following Thurs (13th). I haven't had any support from any medical personnel so your Nan is not alone. It seems to be rampant throughout the breast-care system I'm sad to say. My whole treatment from before the Op, during the Op and now afterwards has been far from good. I wish you a LOT of love and good health for your Nan. Your friend, LoneFox",
      "MessageIndex": 4,
      "PostDate": "29/10/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/43847/support-before-having-your-breast-removed",
      "Title": "support before having your breast removed"
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hi Ellen, just to wish you a very HAPPY BIRTHDAY!!!! Wow, imagine that......you have your 3rd Chemo on 28th as well.............mine isn' till 3pm due to the bank holiday that week and them having to test my blood beforehand. I have to give the sample at 9am for testing and then all being well....3pm Chemo. Do you go onto Taxotere after that ? I think I do....on the 17th Jan. Best wishes, and I'll be thinking of you and hoping all goes well for you this time...... LoneFox",
      "MessageIndex": 8,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45268/has-shaved-my-head",
      "Title": "has shaved my head ! :)"
    },
    {
      "AuthorID": "LoneFox",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lonefox",
      "Content": "Hi Ellen How did things go on the 28th ? I was ok at the treatment (it was my 3rd and final FEC) but side effects kicked in within about 3 days - the worse was digestive troubles - wow, they were on another scale!!! Hope you fared better. By the way - I did get something to help tremendously - lots of ladies on the site told me to ask for Lansoprazole so I did..... its a miracle drug!!! Never looked back after taking one or two. Have to start on Taxotere tomorrow and am a little apprehensive. Think of me about 1pm, although I'm guessing....... are YOU due some treatment any day now ? We seem to be on the same timetable regarding dates. Wishing you well and hope to hear from you but if you don't feel like it its ok. I'm always here......... your friend, Lonefox",
      "MessageIndex": 25,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45268/has-shaved-my-head",
      "Title": "has shaved my head ! :)"
    }
  ]
}