{
  "AuthorID": "looby7",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
  "Posts": [
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi there, my situation is slightly different to yours but I have 2 young boys, ages 8 and 3.  We were all living very happily in Gibraltar when this happened and I was sent back to UK for treatment as the standards are better here.  I am having to live apart from my children and stay with my Mum, which is difficult at times, having just turned 40! I see my children whenever we can..they come here and I have recently been there.  But you are right, it is hard work looking after them when I am feeling rough.  My 8 years old is fine but the 3 years old hasn't got a clue whats going on.  Half the time he thinks I live in the computer because I talk to him on skype! As Kate mentioned above...take all the help that is offered to you, especially when you are feeling at your worst.  Do you have a good support network?  It isn't easy because they don't really understand what is going on, but if you can get help when its needed that will be hugely helpful. Don't worry about having to give up breastfeeding earlier than you would have liked too...it is a shame you had to but you have to put yourself first right now and you should be proud that at least you did breast feed for a while and gave your baby the most wonderful start in life! I hope all continues to go well for you.  Big hugs, Sarah xxxxxxxxxx",
      "MessageIndex": 2,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45162/coping-with-cancer-treatment-and-young-kids",
      "Title": "Coping with cancer treatment AND young kids!"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi there,  I am due to have a mastectomy in approx 3 weeks time (I had chemo first).  I have been advised to have delayed reconstruction but this is mainly because I am having radiotherapy 2 months after op and apparently radio can affect the implant.  So I am having reconstruction in 6 months time and I am also going to opt for removal of my other breast.  They are going to reconstruct that one at the same time. I too have large boobs (32 FF) so I am going to ask to be a nice C cup when I have my new ones! Hope all goes well with the rest of your treatment.  Let me know how your reconstruction goes! love Sarah xxxxxxxxx",
      "MessageIndex": 5,
      "PostDate": "09/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46957/immediate-or-delayed-recon",
      "Title": "Immediate or delayed recon?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi girls...I think it must just depend on surgeons.  I am having mx next Friday and I wanted immediate reconstruction but I am not allowed to have it because I am having radiotherapy.  He said the radiotherapy affects the implant somehow?? So, I have to wait 2 months post surgery before I can start radiotherapy and then 6 months post radiotherapy before I can have reconstruction!  Seem to be forever waiting for something.  Still, as long as it gets rid of this bloody thing I don't care! I've also had some confusion re. when to have expander fitted prior to recon.  A friend has told me that her plastics consultant said she should have had it before radiotherapy and was apparently 'not happy' that this hadn't been done, but my surgeon said that neither him or the plastics consultants are happy to put an expander in before radiotherapy???? Who knows!!!  I guess we just have to go with what we are advised individually...but it is confusing when you hear conflicting advice! Wishing you all well..love and hugs Sarah xxx",
      "MessageIndex": 5,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47229/waiting",
      "Title": "Waiting....."
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Oooh, thank you.  I will give it a go.  Happy to try anything if it helps.  Thanks hun xxxxxx",
      "MessageIndex": 6,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47469/anyone-experienced-painful-ribs-post-mx",
      "Title": "anyone experienced painful ribs post Mx?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi, I had my mx on Friday and I now have very bruised, uncomfortable ribs.  My bruising goes all the way down to my hip and I look like I have been run over by a car!  Spoke to BC Nurse and apparently this is all normal.  I'm taking Ibuprofen and Paracetamol for the pain but think I might see if the GP can offer anything stronger!   I hope you soon start to feel better xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
      "MessageIndex": 4,
      "PostDate": "29/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47469/anyone-experienced-painful-ribs-post-mx",
      "Title": "anyone experienced painful ribs post Mx?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "I am waiting for my op date but I have been told that I will have to wait 2 weeks for my results afterwards too!  I am being treated at the Norfolk and Norwich.  I am dreading those 2 weeks..really not sure how I will get through them.  At the moment, whilst I am waiting for my op, each day feels like it lasts a week!   Really hope you have good news. xxxxxxxxxxxxxxxxxxxxxxxxx",
      "MessageIndex": 2,
      "PostDate": "07/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46912/how-long-have-you-had-to-wait-between-surgery-and-specimen-results",
      "Title": "How long have you had to wait between surgery and \"specimen\" results..."
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi everyone, I was diagnosed with breast cancer yesterday after finding a small lump approx 4 weeks ago.  It has been an awful time.  We have been living abroad as my husband is in the RAF, so I was referred to Birmingham hospital for ultrasound and biopsy.  We had to spend all weekend in a hotel away from our children, friends and family whilst we awaited my results.  It was such a shock to be told I have a grade 3 cancer that is 2.5 cms.  We were referred to a hospital nearer to my mums house so had to drive for 3 hours to get there, eventually arriving late last night.  We have hardly slept and I can't stop crying.  I am also missing my children as they are being looked after by my mum in our house abroad until next week.  I am also worried because since the biopsy was done by lump has become much bigger and sore.  I have a consultant appt on Thursday and the plan is the start chemotherapy as soon as possible, then have the lump removed then possible radiotherapy!  From reading other peoples posts I realise I am not alone in feeling like this but just felt I needed to put something on here.  I am especially worried that the lump feels bigger and just want it taken out.  I would appreciate any advice and guidance. Thank you x",
      "MessageIndex": 0,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Thank you so much for your replies.  I feel a little easier about how the lump feels now.  It is very sore and just feels huge now.  I think once I actually start treatment I may feel a bit better because at the moment i'm just waiting and worrying that it is going to spread.  I'm also worrying about the treatment because I know I'm going to feel ill.  It all just so daunting.  I am pleased I have found this site though because it is helpul to here other peoples experiences.  Thank you again xxxx",
      "MessageIndex": 4,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Thanks Jane, so glad to hear your tumour was the same size and not bigger.  Originally i had to really feel around to actually find my lump but now you can see it by just looking at me.  It is a horrible feeling because you just think its growing rapidly.  So glad to hear it is just due to the biospy.  Good luck with your first chemo.  I am worried about mine too.  I'm worried because I know I am going to start feeling and looking ill and I feel well at the moment. Please let me know how you get on. xxx",
      "MessageIndex": 13,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi Monica, I know exactly what you mean about wanting to get it out of you!  I can't wait for my op but it won't be until Jan/Feb time, once my chemo has finished.  I too have been worrying about my arm pits!  Every ache or twinge I think its the cancer spreading.  I keep feeling my arm pits for swellings, sometimes I think it feels puffy then another day it doesn't.  It's probably all the poking and prodding i'm doing that's making it feel different!!!  I had the same thing happen to me the other day..I thought i felt really uncomfortable and it was the sleeve of my top that was digging in...oh I hope this paranoia will stop one day!   Everything feel a bit on hold for me too.  I hope all goes well with your treatment.  It would be lovely to hear about your progress.  xxxx",
      "MessageIndex": 33,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Thank you for your lovely words.  It really does help.  So glad you had a full response.  It must have been wonderful when they told you such good news.  I can't wait to have some good news.  Sending hugs back to everyone. xxxxxx",
      "MessageIndex": 25,
      "PostDate": "18/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Thanks again for the replies.  Gill, you must be feeling pretty much how I am at the moment then. It is like someone just rips your world up around you and then chucks it back down in a mess isn't it.  I hope all goes well with your surgery.  It's the waiting to find out exactly what is going to happen that's so hard.  You are right, there is such a lot to get your head around.  When I had my first ultrasound I was told it was a birads 3 which means probably benign so to go from that to a grade 3 cancer has been a real shock.  Still can't believe it has happend to me.  Please keep me updated on your progress.   Blue - thank you for your words.  It is very reassuring to hear that your tumour has shrunk.  I hope mine does too.  Thank you all again. xxxx",
      "MessageIndex": 12,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Oh thank you so much.  It is lovely to hear a story like this and I am so pleased you are all clear and are coming to the end of your treatment.  I am trying to remain positive but like you say every now and then something triggers me off and the tears start again.  It is so helpful to hear from others with similar experiences and I am so glad I joined this group.  Thank you xxxx",
      "MessageIndex": 15,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Well I had my consultant appt today and my chemo is starting on Monday!!  I have to have 6 sessions with 3 weeks intervals, then I should be able to have the lump removed, then radiotherapy.  I feel a bit better now at least it is getting started but it is scary because I know I am going to look and feel ill which is a weird thing to get your head around because at the moment I'm just me!  The hospital gave me a tour of the unit and I was surprised at how relaxed everyone looked.  The support from all the staff was absolutely brilliant and I came away from the hospital today feeling a lot more positive.  xx",
      "MessageIndex": 21,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Oh Wench53, that is wonderful news, so glad you are all clear.  Lollo, you really have had an awful time haven't you.  So sorry to hear you had to have a termination.  It is shocking how many young women are affected by this.  My mum also had breast cancer but she was 55 and it was picked up on routine mammogram.  She is 6 years clear now after having a left mastectomy and lymph nodes removed.  She too had chemo and took Tamoxifen for 5 years.  My mum was the first in my family to get BC and now it's me.  No idea why this has suddenly happened.  It is good to be able to support each other here though.  My thoughts are with you all.  I will be staying in England for my treatment because although Gibraltar is a British territory, their healthcare is a little behind that of the UK .  At the moment my husband is planning to stay in Gibraltar with my oldest son who is 8, so that life isn't disrupted too much for him and they will visit every other weekend but I think my youngest son, who is nearly 3 will come and stay with me and my mum and dad.  I'm not sure how this is going to work out but that's my only plan at the moment.  Speak soon xxxx",
      "MessageIndex": 20,
      "PostDate": "15/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi there...the replies really helped me too.  When you are first diagnosed it is just so scary isn't it, but I have found the whole Macmillan website to be helpful and I have used the telephone support line too.  It is good to be in touch with others that are going through a similar experience, I have had a lot of reassurance from this site.  I hope your first chemo goes ok on Friday.  I had my first chemo last Monday and it wasn't as bad as I thought it was going to be; in fact, I think the cold cap was the worst part.  I felt a bit 'fuzzy' afterwards and I was sick a few times in the evening and couldn't eat anything, however, although I still felt a bit queezy for the next couple of days, I wasn't sick anymore.  It is just over a week later now and, apart from feeling a bit tired, I feel fine and have a huge appetite.  You just need to be able to rest whenever you feel like it.  Have you got someone at home to look after you?  Hope all goes well, keep in touch. Love Sarah xxxxxxx",
      "MessageIndex": 27,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi June - that sounds good advice.  I've been trying to drink more than I used to (which isn't hard!).  Probably managing about 2-3 pints of ribena a day.  Have gone off coffee but do have the occassional cup of tea.  Hope all continues to go well for you, please keep us updated, as it really helps to hear about others experiences.  Hi Treen, I expect you must have felt a bit like me then ' too young'!  I am 40 in November and have been dreading it, then this happens which is going to make it miserable anyway.  This has put a lot into perspective though, I can't believe I was worrying so much about becoming 40, now I am going to celebrate and enjoy every birthday.   I have 2 small children, 2 boys aged nearly 3 and 8.  I am the same, couldn't bear the thought of not seeing them grow up so I will absolutely not let this beat me!  I have started my chemo first then I will be having a lumpectomy followed by radiotherapy so I still have a rocky road ahead (i've only had one chemo so far).   I hope all goes well for you, yes I would love to keep in touch. xxxxx",
      "MessageIndex": 32,
      "PostDate": "28/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi Libby,  I had this exact discussion with the nurse yesterday whilst having my 3rd FEC.  The Dexamethazone was causing me to not only have a bright red face for 3 days following chemo but I couldn't sleep and had an awful headache which only went away after I stopped taking them after day 3. Her advice to me was to not stop taking it  as it works well with the other anti sickness drugs but try altering my dose.  I was taking 2 twice a day but she said I could try taking 1 twice a day or just take the full dose but for 2 days.  I have decided to take 1 twice a day.  I took one this morning and although I still have the bright red face I don't have a headache..which is a bonus.  Have a chat with them and see if they recommend the same thing. I also spoke to my oncologist re. blurred vision and that my eye sight felt like it had deteriorated, because I was considering having an eye test, but she said not to as it is a side effect of the chemo.  She said if my eyes were gritty as well she would prescribe me some eye drops, but they're not gritty, just watery and blurry. I hope apart from these annoying symptoms you are not feeling too bad.  Speak soon Sarah xxxx",
      "MessageIndex": 6,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/43972/has-anyone-stopped-taking-steroids",
      "Title": "Has anyone stopped taking steroids?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi there, my situation is very similar to yours.  I have a grade 3, 30mm lump.  I have been having chemo first since Sept.  I started on FEC but after 3 lots they did a scan and said lump hadn't shrunk so they changed me to Docetaxel.  Unfortunately I only had one of those because I had an allergic reaction to it so I am now on weekly Paclitaxel. The reasons they gave me for doing chemo first were; to shrink the tumor so that surgery is less invasive and to check I am on the correct chemo (that works).  They like to monitor the effect of the chemo and can change it if it isn't doing what they want it to do.  They said because I was relatively young at diagnosis (39) they preferred to do it this way, but I know other people of a similar age who have had their lump removed first so i don't really know how they make their decisions. I have 2 more weekly chemo's to go before next scan then they are probably going to do the op regardless of the result.  My lump feels the same size to me but Onc feels that it has become softer which is apparently a good sign.  To be honest, I just want this bloody lump out although I can see why they kept it in. My onc also told me the other day that sometimes the lump itself might not shrink but the cancer can still have been destroyed, but they don't know this until you have had op.  I hope all goes well with you, keep in touch as it would be lovely to hear how you are getting on with it. Sending big hugs xxxxxxxxxxxxxxxxxxxxxxxx",
      "MessageIndex": 3,
      "PostDate": "15/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46140/chemo-first-then-surgery",
      "Title": "Chemo first then surgery?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi everyone,  it's nice to speak to people going through a similar experience isn't it.  I too have had a titanium clip put in my tumour.  I had it put in quite a while ago now so I think I was expecting it to shrink to nothing but that hasn't happened yet.  It's strange because this morning my whole breast felt tender and the lump felt bigger but this afternoon it feels smaller and less tender!!   Can't figure out why that is unless it is the chemo attacking it (which is what I am hoping). I didn't have a sentinal node biopsy but they did do a fine needle aspiration but the results were inconclusive as apparently not enough cells were obtained.  They didn't repeat it because they said it wouldn't change their treatment. It does all get very confusing.  I will be glad when I have had my next scan after my next 2 sessions of chemo and ultimately I will be glad when they take it out which should be in early Feb. Def stay in touch. Sending lots of positive vibes and hugs, Sarah xxxx",
      "MessageIndex": 7,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46140/chemo-first-then-surgery",
      "Title": "Chemo first then surgery?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "That is truly wonderful news.  I am so pleased for you.  It is so awful waiting for results and we get so used to getting bad results.  I know you must be feeling on top of the world. It is lovely to hear when people get good news.  I hope the rest of your treatment goes well and you will soon be able to put all of this behind you.  I wish this for all of us! Hugs, Sarah xxxxxx",
      "MessageIndex": 1,
      "PostDate": "05/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45829/got-my-results",
      "Title": "Got my results..."
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi there,  My Mum also had exactly the same kind of reaction after she had her mastectomy, 8 years ago.  She was waiting for her dressing to be removed and it felt uncomfortable and itchy...when they finally took it off at the end of the day she was covered in blisters and the skin was very red and angry.  It cleared up relatively quickly once the dressing was off and the air got to it. I'm sure people are only usually allergic to certain types of dressings eg. elastoplast (like me and my mum), there should always be alternative dressings available for people who are allergic. Make sure, if you are having a further op that they are aware of your allergic reaction so they can use something else.  There should be something better for you than just steristrips. Love Sarah xxxxxxx",
      "MessageIndex": 1,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45976/allergic-to-dressing-anyone-else",
      "Title": "Allergic to dressing, anyone else ?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi there...Welcome to the community.  I have found the support I have received on here to be amazing.  There is always someone out there who has been through the same or similar to you, so loads of advice available.   I was diagnosed in September and started chemo very quickly (my surgery will follow the chemo).  I think it pretty much depends on which chemo drugs you have, as to whether your hair will fall out, but most of the commonly used ones do cause your hair to either fall out or thin. I opted to use the cold cap to keep mine.  I had long hair but was advised to get it cut to at least a bob, which is what I have done.  I have had 4  treatments so far and I have kept most of my hair.   It has thinned on the crown but I can cover it easily with an alice band.  The condition is still good but they advised me to use Simple shampoo and conditioner.  Now, the only thing is, the cold cap is a horrible thing to wear.  It maintains your head at -4 degrees for 30 min before chemo starts, during chemo and for anything from 45 mins to 2 hours following chemo (depending which drug you are having).  You have ice on your head when they take it off and it feels very uncomfortable, but I have kind of got used to it now.  However, it is not easy and I sometimes wish I hadn't bothered and just let my hair fall out, but I kind of feel i have come to far to stop now! Whatever you decide to do, I would advise you cut your hair sooner rather than later as it will give you time to get used to it.  You don't have to go for a complete crop...do it in stages and see how it goes. Sending you god luck and hugs and hope all goes well once you start your treatment.  Let me know how you get on.  Love Sarah xxxxx",
      "MessageIndex": 4,
      "PostDate": "18/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45340/new-to-all-this",
      "Title": "New to all this ....."
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi flower20 Sorry you didn't get the results you wanted but don't give up yet!  If they are going to take all of your nodes out that is a good thing and am I correct in thinking you had scans a few weeks ago that looked good, with no signs of spread?  Can't remember if you have had chemo yet but if not then you have that still to come and any cancer cells in your body will be zapped! I have my results tomorrow, following my mastectomy and full node clearance and I am really nervous about it.  Trying to prepare myself but feel so anxious. At least my appt is early so don't have to wait too long. Just remember, they have removed your breast and therefore all the cancer that was in it and now they are going to remove all of your lymph nodes as a precaution too!  It is unlikely they will all have cancer in them (My BC nurse told me that the other day). Your treatment is still ongoing and you will beat this.  I know how you feel about losing a boob..it's definitely weird, especially when you have one huge one (like me) left over...but we can have reconstruction for this later and get back to our old selves.  Sending you loads of positive vibes...just let yourself get over each hurdle, one at a time.  It does seem so unfair when you are so young (I was 39 when diagnosed), but we are strong and can fight this! PM me anytime for a chat .  Big hugs Sarah xxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
      "MessageIndex": 66,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46338/age-37-shock-at-breast-clinic-yesterday-totally-dazed-and-reeling-need-help",
      "Title": "Age 37 shock at breast clinic yesterday. totally dazed and reeling..."
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi flower20, I'm so sorry you are feeling like this.  I know how you are feeling, I too have had a bit of a meltdown today but I am further down the line.  I had my chemo first and thought I was going to have a lumpectomy but found out today I have to have mastectomy.  Mine is a grade 3 lump which is now 5cms (was 2.5 orginally).  I have to wait 3 weeks now for my op with this bloody thing in me that I just want out!  I have 2 young sons, aged 3 and 8 and it breaks my heart everytime I let my mind wander to thoughts of me not being here.  It is absolutely natural for you to feel how you are...it is a huge shock when you get this diagnosis.  I think I cried for 2 weeks solid when I got my diagnosis in September and all I could think was the worst! You will start to feel better once you know all the facts and exactly what you are dealing with.  The waiting is the worst.  I am dreading my results from the Mastectomy and I think that's why I had a meltdown today because all my original worries flooded back to me.  I'm hoping it is a blip and I can get back to my positive self . Everything everyone has said on here already is true.  We will beat this but it is probably the toughest thing we will ever have to do.  If you haven't phoned them already, the Macmillan help line is brilliant.  I have phoned them a couple of times. I am thinking of you and sending lots of positive thoughts to you and everyone who is going through this awful time.  There is so much support on here, I don't know what i would have done without it.  PM me anytime if there is anything I can help you with. Big hugs Sarah xxxxxxxxxxxxxxx",
      "MessageIndex": 58,
      "PostDate": "01/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46338/age-37-shock-at-breast-clinic-yesterday-totally-dazed-and-reeling-need-help",
      "Title": "Age 37 shock at breast clinic yesterday. totally dazed and reeling..."
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi Hilary,  do let me know how it looks after the 4 days and if it has helped you feel more like the old you.  I would be really interested.  Also sending lots of positive vibes for your results. Take care, hugs Sarah xxxxx",
      "MessageIndex": 10,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46259/is-botox-allowed-nearly-a-month-since-radio-finished",
      "Title": "Is botox allowed nearly a month since radio finished?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi Hilary,  do let me know how it looks after the 4 days and if it has helped you feel more like the old you.  I would be really interested.  Also sending lots of positive vibes for your results. Take care, hugs Sarah xxxxx",
      "MessageIndex": 25,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46259/is-botox-allowed-nearly-a-month-since-radio-finished",
      "Title": "Is botox allowed nearly a month since radio finished?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Oh that is excellent news.  So pleased you feel more like you!  I think that is the secret with botox, if you have it done in a subtle way it is not obvious that you have had botox...you just look well, and that's obviously what you have had done.  Good for you!  I am seriously going to consider it when all my treatment has finished. Hope all continues to go well for you. Love Sarah xxxxxx",
      "MessageIndex": 28,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46259/is-botox-allowed-nearly-a-month-since-radio-finished",
      "Title": "Is botox allowed nearly a month since radio finished?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi Hilary....I don't know the answer to this question but it is something I had thought about too.  When all this is over, something to make me look a bit more like the old me again because I feel about 100 years old at the moment!   Hopefully someone might know something about it. Hugs Sarah xxxx",
      "MessageIndex": 18,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46259/is-botox-allowed-nearly-a-month-since-radio-finished",
      "Title": "Is botox allowed nearly a month since radio finished?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi Hilary....I don't know the answer to this question but it is something I had thought about too.  When all this is over, something to make me look a bit more like the old me again because I feel about 100 years old at the moment!   Hopefully someone might know something about it. Hugs Sarah xxxx",
      "MessageIndex": 3,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46259/is-botox-allowed-nearly-a-month-since-radio-finished",
      "Title": "Is botox allowed nearly a month since radio finished?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Oh that is excellent news.  So pleased you feel more like you!  I think that is the secret with botox, if you have it done in a subtle way it is not obvious that you have had botox...you just look well, and that's obviously what you have had done.  Good for you!  I am seriously going to consider it when all my treatment has finished. Hope all continues to go well for you. Love Sarah xxxxxx",
      "MessageIndex": 13,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46259/is-botox-allowed-nearly-a-month-since-radio-finished",
      "Title": "Is botox allowed nearly a month since radio finished?"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi there, I used the cold cap throughout my chemo, I had 3x fec and 3x paclitaxel.  I found that I had worse headaches when I was on the fec but I think it was the steroid tablets that i took alongside it.  When I stopped them the headaches were not so bad.  I didn't need to take all the steroids with the paclitaxel and I didn't suffer with any headache at all.  The first 15 mins of the cold cap made my head feel a bit tight but after that it was fine. I finished my chemo last week and I have pretty much a full head of hair, slightly thinner but apart from that it's fine.  I lost a bit of hair on my crown after first chemo but that was because cap didn't fit properly.  They changed the size the next time and by the time I had finished chemo my hair had grown back on my crown. The cold cap is not nice but I am so glad I continued with it because I still feel I look like me.  I wish your friend all the best with her treatment and hope she gets on well with the cold cap.   If her headaches continue advise her to speak to her oncology nurse specialist or one of the nurses at the chemo unit.  When I did they told me to reduce my steroids and that did help. Love and hugs Sarah xxxxxx",
      "MessageIndex": 4,
      "PostDate": "02/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46734/cold-cap-severe-headaches",
      "Title": "Cold Cap...Severe headaches????"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi there.....is it the hand on the side you had your lymph nodes removed?  If so, it could just be swelling that can accumulate because of the clearance.  Sometimes people have to have it removed (my mum did).  I would ring either your GP or your surgeon and explain that you are worrying about it and they may be able to put your mind at rest.  If not, ring the helpline on here because they are really good.  I think this horrible disease make you worry about everything so I'm sure the GP or surgeon will completely understand that you need some reassurance.  Thinking of you xxxxxx",
      "MessageIndex": 2,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/43108/so-frightened-having-a-bit-of-a-moment",
      "Title": "SO FRIGHTENED, HAVING A BIT OF A MOMENT"
    },
    {
      "AuthorID": "looby7",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/looby7",
      "Content": "Hi Ellen,  What a wonderful post!  As of Monday I am switching to weekly chemo (instead of 3 weekly).  I have been using the cold cap but not sure how I will cope with it weekly so I am seriously contemplating stopping it now.  Your post has just re-emphasized that it is only hair and it will grow back!  Thank you xxxxxx",
      "MessageIndex": 3,
      "PostDate": "15/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45268/has-shaved-my-head",
      "Title": "has shaved my head ! :)"
    }
  ]
}