{
  "AuthorID": "LorraineL",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
  "Posts": [
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "Hi there I read these forums with great interest, I came through the journey of three surgeries - final one being mastectomy then chemo, I am a nurse and although planned to be off as long as necessary after my second op ofremoval of all nodes and excision around margins I went back to work.  I had my mastectomy two weeks later back again working as normal - my consultant wasnot pleased but I argued the point my mental health was important to me.  During chemo three FEC then Three taxotere I continued work but was office based due to risk of infections from patients. I had side effects but nothing serious one admission with neutropenia.  My colleagues kept me sane I worked at my own pace and went home early if necessary.  A week after the final taxotere I went off for a fortnight but just due to exhaustion but I was SANE!.  I know reading on this site I am one of the lucky ones as so many of you have had horrible side effects and my heart goes out to you.  Be strong it will soon be over and you will get some normality back. My mood did drop at xmas when all my treatment was over I got happy pills and have had some fantastic counselling from macmillan support. and now go to our local breast support group - there is light at the end of the tunnel Hugs to you all",
      "MessageIndex": 11,
      "PostDate": "11/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51452/will-i-be-able-to-work-through-treatment",
      "Title": "Will I be able to work through treatment?"
    },
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "Hi not used to writing in here but get a lot of support reading the postings.  I am a year into my journey had WLE and biopsy, then further excision and all glands removed and then more Ca found so had a mastectomy.  chemo wasnt bad and I was able to stay at work on limited duties most of the time.  My issue now is I feel like I am getting phantom feelings in the breast that isnt there, itchy that cant be resolved.  I havent noticed anyone else commenting on this so just wondered if I was finally cracking up - most peole would say I did this a long time ago.  ",
      "MessageIndex": 0,
      "PostDate": "24/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49301/phantom-feelings",
      "Title": "phantom feelings"
    },
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "Sacha I dont think we have spoken before but my heart goes out to you, please take my best wishes with you tomorrow Stay strong :)",
      "MessageIndex": 13,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50556/why-does-no-one-understand-what-im-going-through",
      "Title": "Why does no-one understand what im going through?"
    },
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "Sacha I dont think we have spoken before but my heart goes out to you, please take my best wishes with you tomorrow Stay strong :)",
      "MessageIndex": 28,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50556/why-does-no-one-understand-what-im-going-through",
      "Title": "Why does no-one understand what im going through?"
    },
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "This is a traumatic time in your life but you will get through it even if it means wading through the river of tears! Keep on crying it is good stress relief.  The waiting is the worse once treatment starts you feel like you are fighting the b****r, What you are doing with regards your thought processes is something called 'catastrophising' I am sure all of us on this site have done it.  I did whilst waiting for scan results - convinced I was riddled.   Once you have the facts and you know exactly what you are fighting you will feel different.  As many of the ladies on this site have said knowledge is POWER no longer is the old adage ingorance is bliss as you well know it itsnt. With regards pets I have two lovely cavalier king charles dogs - who gave me all the cuddles i needed when family werent about.  I also told my husband I was no longer allowed to clean the bathroom (which I hate) so he did it all through my treatment - I have admitted to him since it was a white lie! eeven my colleagues at work said to their partners they couldnt  do the same - unfortunately they didnt fall for it. Keep positive Annie, we are all here to support you:)  ",
      "MessageIndex": 5,
      "PostDate": "20/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50050/bit-of-a-meltdown",
      "Title": "bit of a meltdown"
    },
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "Thinking of you at this stressful time, be strong we have all been there and no amount of reassurance will stop you worrying until you have seen the specialist and got the results, this is the worse time, but you have started your journey by writing on here good luck ann  As you can obviously guess I am useless with the computor hence the repitiion - I cant even blame the chemo cause i was like that before  lol",
      "MessageIndex": 3,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49674/breast-clinic-next-week-but-expecting-and-trying-to-prepare-for-bad-news",
      "Title": "Breast clinic next week but expecting and trying to prepare for bad..."
    },
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "Be strong Ann all of us have experienced what you are going through, it doesn't matter what folk say to try and calm you you wont be settled until you have seen the specialist and got results.  The wait is hell but we have all coped in our own way.  Talking to the likes of us will help you realise how many of us are here to support you no matter what the results are.  Take one day at a time and as previous ladies have said on this site - you are allowed to feel crappy but give yourself a time limit eg 10 minutes then say enough until tomorrow. Take care our thoughts are with you, I know this site has helped me tremdously and I only joined once my treatment was over.:)",
      "MessageIndex": 1,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49674/breast-clinic-next-week-but-expecting-and-trying-to-prepare-for-bad-news",
      "Title": "Breast clinic next week but expecting and trying to prepare for bad..."
    },
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "Be strong we have all been through this really terrifying time, no matter what folk say to you - you will not be truly settled until you have seen the specialist and got the results.  Take each day as it comes, and give yourself time to feel sad someone on this site gave that advice and I found it very supportive.   Make sure after the eg 15 minutes sadness you put it away and look at things positively until the next days 'reflective time', we have all felt crap but there is light at the end of the tunnel and you have your family to support you or you can carry on telling us how you feel until your appointment.  Remember the BT advert it is good to talk - it definitely is Take care Lorraine",
      "MessageIndex": 2,
      "PostDate": "08/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49674/breast-clinic-next-week-but-expecting-and-trying-to-prepare-for-bad-news",
      "Title": "Breast clinic next week but expecting and trying to prepare for bad..."
    },
    {
      "AuthorID": "LorraineL",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lorrainel",
      "Content": "Hi I was asked to take part in the supremo trial didnot fit criteria for radiotherapy but had chemo.  I decided to go ahead with it as i was willing to accept anything to keep the cancer away.  I was placed in the no radiotherapy group, doesnt bother me too much and the positive thing is if on the trial you get followed up annually for ten years. good luck on your decision whatever you decide it is the right thing for you :)  ",
      "MessageIndex": 7,
      "PostDate": "09/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54066/supremo-trial-for-radiotherapy",
      "Title": "Supremo Trial for Radiotherapy"
    }
  ]
}