{
  "AuthorID": "loubee 27",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loubee-27",
  "Posts": [
    {
      "AuthorID": "loubee 27",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loubee-27",
      "Content": "I just wanted to let you know that we've made the decision to go for a round of IVF after a very testing and heart searching weekend. Thank you so much for your advice and kind words of support. I start with a nasal spray on wednesday. We realised it was some hope v no hope and I just need to feel positive before chemo starts otherwise it would feel that the cancer was going to take over our lives; and i'm going to try and make sure it doesn't affect everthing at least. x",
      "MessageIndex": 5,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63566/ivf-or-infertility",
      "Title": "IVF or infertility?"
    },
    {
      "AuthorID": "loubee 27",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loubee-27",
      "Content": "Hello I wondered if someone can help me with a difficult decision I need to make this week or share some advise? I am 40 years old and found out that I had ductal breast cancer in the middle of June this year. At the time of diagnosis I was on fertility treatment trying for a second child - we had been trying for 2.5 years and suffered 2 miscarriages in that time.  I had a lumpectomy last month and my next form of treament is under discussion. Originally the medical team had advised it would be radiotherapy, but the margin around the tumour was not sufficently clear of cancer cells, and are now saying chemotherapy, mainly due to my age and further breast surgery, maybe a mastectomy. Obviously I have concerns over my fertility considering my age and the fact we were actively trying to extend our family, but am also very aware that my health should be a priority in this choice. The advise I am being given is to have a round of IVF now or face the likelihood of infertility post chemo. I am only going to be given one chance at IVF as they want to get on with chemo soon, hence the urgency on  decision to coincide with my cycle. I am hearing all this this through the fertility team as I have not met the oncologists yet - they seem invisible, yet their input seems crucial to my decision making. I know that certain chemotherapy drugs can preserve fertility and I am wondering whether to challenge the drug choice so that I could try and leave fertility to a chance at the end of treatment rather than pay for IVF now. although I know the quality of my eggs will be significantly lower post treatment due to the age that I will be before its safe for us to try again. I suppose the key thing is, whether I have been through enough already and now have cancer treatment to deal with; so do I really want to go through IVF at the other end. OR, is it the thing that will get me through this, but bearing in mind the statistics of a successful pregnancy through IVF for a woman in her early forties are low - 10% with frozen embryos. And of course I will be an older mum. I'm finding it hard to come to a decision. I have a beautiful little girl, yet still have desire for her to have a sibling if possible - and no-one is telling me its not possible at the moment. Can anyone share a similar experience, decision making process? Thank you",
      "MessageIndex": 0,
      "PostDate": "15/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63566/ivf-or-infertility",
      "Title": "IVF or infertility?"
    },
    {
      "AuthorID": "loubee 27",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loubee-27",
      "Content": "Hello Kelly and Fraggles Thank you very much for sharing your experiences it's really useful and reassures me I'm not alone. You have both recommended that I freeze some embryos and I think this the what my husband and I are coming around to. At the moment we are oscillating but by Monday we will have had to make a decision in order for the treatment to coincide with my cycle. I think if nothing else it is an insurance policy. Then, if I feel fighting fit at the end we'll go fot it, and if not, at least we'll have had a bit more time to comes to terms with accepting our family is complete rather than deal with everything all at once. It's daunting enough embarking on chemo and further surgery let alone anything else to consider. Kelly, I widh you all the very best with this next round of chemo and every success with the IVF at the other end. You have really been through the mill. Better, exciting times will be ahead for you i'm sure. Keep positive and like you say 'keep your eye on the prize!' Louise x  ",
      "MessageIndex": 4,
      "PostDate": "16/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63566/ivf-or-infertility",
      "Title": "IVF or infertility?"
    }
  ]
}