{
  "AuthorID": "Loudwoman",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loudwoman",
  "Posts": [
    {
      "AuthorID": "Loudwoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loudwoman",
      "Content": "Hi cassis Thanks for your post, it’s a good point about other people noticing (or not noticing) which is probably where my angst is focused at the moment :-)",
      "MessageIndex": 8,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155831/nipple-removal",
      "Title": "Nipple removal"
    },
    {
      "AuthorID": "Loudwoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loudwoman",
      "Content": "Hi Helen Fabulous news! Thanks for letting me know. I’ll bet you are so relieved, wishing you a speedy recovery:-) Andy XX",
      "MessageIndex": 10,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155831/nipple-removal",
      "Title": "Nipple removal"
    },
    {
      "AuthorID": "Loudwoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loudwoman",
      "Content": "Hi Helen, thanks for getting back to me. I hope things go well with your results. From my experience so far there are no guarantees. Things can change depending on the discussion at the MDT, I suppose that’s what they are there for and to make sure nothing is missed or misinterpreted. When I went back to have my drain out the results were available they hadn’t be discussed fully. For a couple of weeks I was under the happy illusion that no further action was required, not even tamoxifen. Now it will be back to theatre again and waiting for the next pathology report, however I am hoping that nothing untoward will be found. The surgeon did say statically things like this usually turn out to be nothing. Sounds like your story is similar to mine, I wasn’t expecting the subject of radiotherapy to come up at this stage. I did ask the question about implants and radiotherapy going together and was told it was not contraindicated but there would be an increased risk of capsular contracture. The problem is that you have to make decisions based on what you know as you go along and the most of the time you can’t go backwards. We weren’t expecting this hiccup! Keeping my fingers crossed for you today and hoping the results are good. Andy X",
      "MessageIndex": 3,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155831/nipple-removal",
      "Title": "Nipple removal"
    },
    {
      "AuthorID": "Loudwoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loudwoman",
      "Content": "Hi Eddiboy Thanks for getting back to me. That sounds very encouraging. I wasn’t very keen considering what a good job they did on the reconstruction, but it’s reassuringly shocking to see what can be done. If I don’t have it removed and something goes wrong in a few years I will never forgive myself so I’m of the view the sensible thing is to let it go and find the right surgical option.  Funny you mention the tattoo, I was thinking about that last night. I’ve never had a tattoo before, maybe it’s time to try something new! Sorry to hear you are facing all this again, you’re a brave lady. I hope it all goes well. Thanks for your advice XX",
      "MessageIndex": 4,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155831/nipple-removal",
      "Title": "Nipple removal"
    },
    {
      "AuthorID": "Loudwoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loudwoman",
      "Content": "Hi Helen I understand that feeling! I hope you get the results you want. Andy X",
      "MessageIndex": 6,
      "PostDate": "25/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155831/nipple-removal",
      "Title": "Nipple removal"
    },
    {
      "AuthorID": "Loudwoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loudwoman",
      "Content": "Hi, I’m new to this forum. I was diagnosed with 2 invasive tumours in February through the screening programme. They were both very tiny (one ductal and one lobular) but still ended up with a right mx, reconstruction with implant and SLNB. Everything was excised and the node clear, so I feel very lucky that this had been found and dealt with. Just as I’m starting to come to terms with the new me, there is more news. It’s now 8 weeks after the mx and I’ve been told that there was an ambiguous result from the biopsy of the nipple bed in the form of LCIS and the MDT recommends removing the nipple and that I may need radiotherapy depending on the histo, but I will need to decide if we go ahead with this plan. There is also the option of creating a pseudo-nipple out of skin? How does this work and is it worth it? Any advice appreciated.",
      "MessageIndex": 0,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155831/nipple-removal",
      "Title": "Nipple removal"
    }
  ]
}