{
  "AuthorID": "Louisey2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
  "Posts": [
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Thanks for your reply Mechele and everyone else xx ... my email doesn’t tell me if I get replies so sorry about delay... Wow pop78 that sounds scary! Sounds like you got a good telling off too... it’s so hard knowing if you are doing the right thing sometimes isn’t it... glad you got through that one with a tale to tell. Yes I’m 41 too with a 7 and 9 year old and they are so used to me in and out of hospital that my little trip to A&E didn’t even get an eyebrow raise (lol!) Still got my chesty cough and just finished the oral antibiotics so fingers crossed now... Take care everyone! And if I’m doubt call the hospital/Chemo line Lou xx",
      "MessageIndex": 4,
      "PostDate": "21/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147321/my-rush-to-a-e",
      "Title": "My rush to A&E..."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Hi all, Don’t come on here very often as sometimes I want to pretend everything is normal... I’m sure others do the same Well just wondering if anyone else has been ‘told off’ for not coming to A&E sooner with a temperature? I kind of knew something wasn’t quite right when I had my last Chemo I was coming down with that horrible virus ( that feels like the flu) I spent days shivering unable to regulate temp and having time where I didn’t but feel too bad ( which stopped me going in) The night before I went in my temp got to 38.2 but kept on measuring different values constantly.. it was 1:30am and I was burning up and sweating and worried about ringing for an ambulance... with kids in bed I didn’t want to disturb... so I rang the Chemo hotline in the morning and they said I should have rang up days ago. I felt silly then. The hospital did all the tests and put me on antibiotics drip... my neutrophils were just 1.2 and if they were 1 the hospital would have kept me in (!) So.. sorry about the waffle but please just ring up the hospital if you are not sure ( I know I will now!!)  Anyone been suffering with temperatures or viruses .. how long have you taken to get better? I feel very weak but definitely getting better. Take care, Lou xx",
      "MessageIndex": 0,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147321/my-rush-to-a-e",
      "Title": "My rush to A&E..."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Hi just a quick question... I am asthmatic and have always had my flu jab each year... It's probably even more important to have it now but I'm not sure about what my oncologist suggested... He told me to get my bloods done and if all ok I have a day to get my flu jab done before my next chemo starts... This all sounds a bit complicated to organise but I'm worried that having some side effects from flu jab will mix with side effects from chemo ( I always have a response to my Docytaxel so I'm normally pumped full of antihistamines...)  Anyone had it done, is it worth it? Thanks, Lou ( had 2 EC and 2 T so far....) X ",
      "MessageIndex": 0,
      "PostDate": "26/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115445/flu-jabs",
      "Title": "Flu jabs?"
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Hi all, thanks for replies X My Dad had his ( diabetic) and he was vomiting and very rough for 3 days afterwards... I guess this scared me. I think with having it a day before chemo it makes me hesitate... Maybe I'll wait for one for round of T before I go for it xxx",
      "MessageIndex": 6,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115445/flu-jabs",
      "Title": "Flu jabs?"
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "I’ve just had one put in as this is my second lot of chemo and one of my arms has had lymph node clearance ( therefore can’t be used for any needles etc) So far it’s ok... the sleeve covers it and clothes seem to go over it ok. Slight faff getting the sleeve thing on for the shower but it is great not having to have a needle fest when they try and find your veins.. Lou x",
      "MessageIndex": 5,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143208/picc-line-or-not",
      "Title": "PICC line or not?"
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Hi, I remember having a very sore nose from my first round of chemo last year ( AC and T) they seemed to hang around for months after Chemo finished too... but like having constant scabs inside the nose... ouch ... think they are quite common though, Take care, Lou xx",
      "MessageIndex": 1,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142578/nose-sores",
      "Title": "Nose sores!!"
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Thanks Lynn,  I suppose as it’s been around for a while the doctors have lots of data and know the usual responses to it but on the other hand, an old treatment sounds not so great... would rather have the new stuff... Ah well, fingers crossed! I’m at the Royal Surrey, Guildford. How about you? Lou x",
      "MessageIndex": 5,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142518/jumped-to-breast-cancer-secondary-forum-and-had-no-responses-to-my-2-posts-so-i-ll-come-back-here-and-hopefully-someone-will-reply-xxx",
      "Title": "Jumped to breast cancer secondary forum and had no responses to my..."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Hi Janet, thanks for replying... been feeling quite low ... I’ll have another look around to see if I can find someone on the Gemcarbo.. Good luck with your treatment, hope you don’t have too many side effects, Lou xxx",
      "MessageIndex": 2,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142518/jumped-to-breast-cancer-secondary-forum-and-had-no-responses-to-my-2-posts-so-i-ll-come-back-here-and-hopefully-someone-will-reply-xxx",
      "Title": "Jumped to breast cancer secondary forum and had no responses to my..."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Hi all, So last July on my 40th I was diagnosed... had A  and T ( docytaxel) and herceptin... full mastectomy December, radiotherapy Feb then my CT scan late summer showed up secondary breast cancer...( on the liver) No one around to talk to on secondaries board So. My breast cancer has changed from HER2 + ( everything else negative) to ‘triple negative’ My Chemo started Monday after a picc line was fitted (ouch) I’m now on ‘Gemcarbo’ can anyone else let me know how they are getting on with this to one ( specific to triple neg)... I have to go in day 1 and day 8 for treatment ... Thanks ladies  Lou xxx",
      "MessageIndex": 0,
      "PostDate": "15/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142518/jumped-to-breast-cancer-secondary-forum-and-had-no-responses-to-my-2-posts-so-i-ll-come-back-here-and-hopefully-someone-will-reply-xxx",
      "Title": "Jumped to breast cancer secondary forum and had no responses to my..."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Hi Happygolucky, Sorry about the delay in replying I had to go to my father in laws funeral.. it’s all been a bit much lately Hope your appointment went ok this week? Will they do a liver biopsy on you? Fingers crossed for you, Take care, Lou x",
      "MessageIndex": 6,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142518/jumped-to-breast-cancer-secondary-forum-and-had-no-responses-to-my-2-posts-so-i-ll-come-back-here-and-hopefully-someone-will-reply-xxx",
      "Title": "Jumped to breast cancer secondary forum and had no responses to my..."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Hi all, Don't come on here very often but it's always full of lovely ladies giving advice. I was diagnosed with her2+ BC last July, had chemo, full mastectomy, full axillary lymph node clearance then radiotherapy in Feb this year.....only just finished Herceptin. We asked for a CT scan of the thorax and our wish was granted ( apparently not normal procedure)....  so, they said they can see 3 lesions on the liver and they think it's the breast cancer 'metastasis'.... liver biopsy next week and a CT scan of the brain organised. I'm so scared and aged 41 with two young kids... not in a good place at the moment Lou x",
      "MessageIndex": 0,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137975/scared-i-think-my-breast-cancer-has-gone-to-my-liver",
      "Title": "Scared, I think my breast cancer has gone to my liver...."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Thank you all so so much for your replies, they mean so much. Londonlass thanks so much, it's what I need to hear, I feel sick to the pit of my stomach and husband is just a zombie... I don't want to leave my kids so young I'm so upset I need to fill my brain with positive stories and people who lead 'normal ish' lives with cancer... I really don't know how to feel anymore, I've just finished my primary cancer treatment and now this...  I'm not sure how I'm going to cope in these next few weeks   And yes I can't sleep and keep having loads of weird dreams when I do! Thanks again for the replies. Lou Xxx",
      "MessageIndex": 4,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137975/scared-i-think-my-breast-cancer-has-gone-to-my-liver",
      "Title": "Scared, I think my breast cancer has gone to my liver...."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Thank you Sal and everyone else... I'm in tears reading all your lovely replies... that's what I need right now, lots of hugs and positive stories... you are all amazing people and like they say on the adverts 'this is the toughest fight anyone has to go through' I'm worried about my young kids, I'm worried about my husband and I'm worried that I can't keep my mental health together... I mean wow, how do you start to tell yourself everything will be ok? Lots of love to you all and I will be on here when I can,  Lou xxxx",
      "MessageIndex": 6,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137975/scared-i-think-my-breast-cancer-has-gone-to-my-liver",
      "Title": "Scared, I think my breast cancer has gone to my liver...."
    },
    {
      "AuthorID": "Louisey2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louisey2",
      "Content": "Ah, this did make me smile  ... so sorry you have to go through this again.. 12 years as well! Keep smiling and good luck with your treatment xxx",
      "MessageIndex": 19,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121842/primary-cancer-and-secondary-cancer",
      "Title": "Primary cancer and secondary cancer"
    }
  ]
}