{
  "AuthorID": "Louise Catherine",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louise-catherine",
  "Posts": [
    {
      "AuthorID": "Louise Catherine",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louise-catherine",
      "Content": "Hi Sam - sounds familiar as I was diagnosed in March 2010. I had a similar course of treatment as your wife including the calcifications. Most were benign but some were pre cancerous called DCIS. It doesn't mean the disease has spread but it does need treated. Many calcifications are benign so fingers crossed for you. Louise",
      "MessageIndex": 1,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50156/calcium-deposits-on-mammogram",
      "Title": "Calcium deposits on Mammogram"
    },
    {
      "AuthorID": "Louise Catherine",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louise-catherine",
      "Content": "Hi Gazcaz, I also had my 5th dose of chemo on Tuesday and can't wait for the last one to come round. Radiotherapy at the end of October but again  I have heard it will be a breeze compared to chemo so am considering beginning a return to work at that stage. I definitely couldn't have managed work and chemo too many not so good days. I'm not toobad with this second type of chemo. I had 3 lots of FEC and am now on docetaxel - makes me a bit acey but not as toxic as the first three thankfully. I have to say all the staff in my area (Edinburgh) have been very supportive. I have a great Breast Care Nurse and the Consultants and Nurses ahve all been very helpful. Maggies Centre is also a good place for support and information. Thinking of of you and all the others going through this. I can never get over how many people are affected. Louisex",
      "MessageIndex": 4,
      "PostDate": "15/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31261/coping-with-chemo",
      "Title": "coping with chemo"
    }
  ]
}