{
  "AuthorID": "louise73",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louise73",
  "Posts": [
    {
      "AuthorID": "louise73",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louise73",
      "Content": "Thanks.  Louise xx",
      "MessageIndex": 3,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53324/need-some-comforting-words-too",
      "Title": "Need some comforting words too."
    },
    {
      "AuthorID": "louise73",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louise73",
      "Content": "Hi , I was diagnosed with HER2 +breast cancer in December 2010. This is the first time I have done anything like this but feel I need a little support from others in the same boat. My case is a little unusual I think, as I so far have not met anyone like me, so is there is anyone out there id love to hear from you. Initially everything looked positive I had a lumpectomy, 7 lymph nodes removed everything came back all clear, however the drs said it is grade 3 breast cancer so we want to give you chemotherapy as a back up. I was 5 out of 6 of my FEC chemos when I found a lump under my arm pit, which was then confirmed was cancer. The Drs then switched chemos to Docetaxal, I proceeded to have 2 cycles of this but the lump continued to grow. The drs then suggested removal of all lymph nodes which was carried out July last year. I was due to start radiotherapy in August however a week before that was due a lump came up by my collar bone. Obviously it was cancer, the next step was a drug trial called TDM1, I had 2 sessions of this but the lump kept growing, and an additional lump came up under my armpit. In october last year they switched drugs to capecitabine and lapatanib, which seemed to settle things down and in January this year I had 6 weeks of radiotherapy which shrunk the lymph nodes. We continued on the drugs and after further scans it seemed there was no cancer anywhere else. I pushed the drs to operate and kept asking them why they dont just take it out if its not showing elsewhere. Generally they were concerned of the debilitating factor for me and concerns it would not cure me. So I went againts the grain and privately spoke to other drs who said they would operate. however just before my operation I noticed the lump under my armpit had a scab on it, when i discussed this with my oncologist, he unfortunately confirmed my wost fears thart the drug was no longer working and the cancer was growing again and that I had now made the right decision as he would be putting me forward for an op!!!!! So in July this year I proceeded to have what they call a radical masectomy, which is where they take the pectoral muscle as well,and the lump under my armpit removed. I was just trying to get over this horrendous operation when I noticed lumps under my skin appearing, In August this year I have been told the cancer has spread to my skin.......I have been put on a new drug called Eribullin and have had one cycle, im not sure this is doing the trick either as more nodules are still coming up. Can anyone shed any light on this for me??? I have a scan on wednesday, which I am extremely nervous about. I just want something to buy me some time and stabilise this blasted thing. I was 37 when i was diagnosed, at the time I had one year old twins, who are now coming up to three in November this year, I have a loving husband and family who have been unbelievably supportive throughout this ordeal but I am becoming extremely scared and emotional at the moment, I just keep thinking there is nowhere else to go, how much more crap luck can I get with the drugs not stabilising things just for a while...... Sorry to of gone on, but like I say ive been really positive and strong until now and im not sure how much more I can take. As for all you other lovely ladies who have been diagnosed, my heart goes out to you. There you are one minute getting on with your life and the next, your whole world is turned upside down. Keep Strong and be Brave thats my motto. Thanks for reading my story. Louise xx",
      "MessageIndex": 0,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53324/need-some-comforting-words-too",
      "Title": "Need some comforting words too."
    },
    {
      "AuthorID": "louise73",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louise73",
      "Content": "Hi Angie,  I cannot believe another female would even question what another woman is going through, with any type of cancer!!!!!! I have just been diagnosed with secondary breast cancer in my liver after 6 different chemos not touching the sides, 6 weeks of radiotherapy and 3 ops. So excuse my language but i think she is a complete Bi..h. I would suggest to you, that she sees you as a threat and probably fancies the pants off this guy!!!!!!  My suggestion is just like the others, rise above it, you are the better person however just to annoy her I would keep in touch with the guy, especially if you like him and get on with him. Im a 39 year old female with 3 year old twins and i soooo wish i was not in this shit situation. As if anyone would fake it for attention....... Then they are Twats.   My rants now over!!!! Good luck and all the best. Louise",
      "MessageIndex": 6,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53572/accused-of-making-it-up",
      "Title": "Accused of making it up"
    }
  ]
}