{
  "AuthorID": "louiseb",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louiseb",
  "Posts": [
    {
      "AuthorID": "louiseb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louiseb",
      "Content": "hello everyone, my name is Louise and I am 46 yrs of age, I really need some advice, I recently had a mastectomy and reconstruction which unfortunately hasn't healed and I need to have it removed Tuesday, my dilemma is that I really don't know what to do, have it all removed and leave it as that or go through another 4-5 ops to help re-build again. My surgeon hasn't been avaliable to talk to and I have loads of questions that I need to ask. Can anyone help?",
      "MessageIndex": 0,
      "PostDate": "29/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59211/i-have-a-dilemma-with-my-mastectomy",
      "Title": "I have a dilemma with my mastectomy"
    },
    {
      "AuthorID": "louiseb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louiseb",
      "Content": "hello, thank you for responding, i'm from Bristol...I had my surgery 4th March and had all my breast tissue removed along with my lymph nodes. My muscle was taken from my back to cushion the implant but the surgeon used an old scar from a previous op and the blood supply wasn't good, therefore it hasn't healed and the implant is now showing and has to be removed because of bacteria. So Tuesday I have to go in to have it removed and the area cleaned and stitched up, 2 weeks time I will need to go in and have a skin graft to replace the area of skin that has died........then when that is healed I will need to have something put in to stretch the skin and ultimately another implant. I just don't know wether its all worth it, shall i just have everything removed or put myself through more ops. Could this happen again? Sorry i'm babbling, i'm really upset as I only found out yesterday.",
      "MessageIndex": 3,
      "PostDate": "29/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59211/i-have-a-dilemma-with-my-mastectomy",
      "Title": "I have a dilemma with my mastectomy"
    },
    {
      "AuthorID": "louiseb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/louiseb",
      "Content": "thank you so much for your help xx",
      "MessageIndex": 5,
      "PostDate": "29/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/59211/i-have-a-dilemma-with-my-mastectomy",
      "Title": "I have a dilemma with my mastectomy"
    }
  ]
}