{
  "AuthorID": "lovelyburke",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lovelyburke",
  "Posts": [
    {
      "AuthorID": "lovelyburke",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lovelyburke",
      "Content": "Oh my goodness I am so fed up & miserable with this, do the drug companies & doctors just think we should be grateful for not being dead? My joint pains started with Anastrozole & it felt like I'd been hit by a truck! the oncologist changed me onto Tamoxifen & said the pains would go away which they did not. My GP told me that in the letter to her, the oncologist said it might not make any difference. After taking the tamoxifen for a month my pains were still there so I stopped taking the tablets. My choice, my decision. After two months nothing changed so the BCN suggested going back on the tablets as they didn't seem to be causing the pain. I went back on the tamox but I asked for a rheumatology appointment. I've had blood tests, ex-rays & ultrasound scans & just got the results that there is NOTHING WRONG WITH ME!! There is no evidence of arthritis or joint damage which I suppose is a good thing but it just means there is nothing they can do to help & I'm going to have to do 'pain management'. I want to strangle someone, although I couldn't anyway because my hands don't work properly anymore!! I'm going to try acupuncture next week but I am really struggling with the fact that I seem to have been poisoned by these bloody tablets & it's not going away! My cancer was caught early & had not spread to my lymph nodes so I just had a couple of surgeries to remove the lump & radiotherapy so I was really positive that I was lucky compared to others. I know that is still true but honestly my hands are hurting constantly & my mood is now blacker than I've ever known. I'm just crying Teresa",
      "MessageIndex": 0,
      "PostDate": "27/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98138/joint-pain-update",
      "Title": "Joint pain update"
    },
    {
      "AuthorID": "lovelyburke",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lovelyburke",
      "Content": "Hi Maggie, I decided to quit the day I went for my biopsy whilst waiting outside for my cab home, having a fag I realized I was intentionally poisoning myself. I got the diagnosis a week later. I was recommended a great book ' the easy way to stop smoking' by Allen Carr (not the comedian!!) I haven't touched one since & I really dislike it now. I will never smoke again & have been all through this process without one & luckily without wanting one. The truth is they really don't help that's just what we tell ourselves. It's a big lie!! Good luck to you I really do believe the book changed the way I thought about smoking & you know giving up is all in the mind.",
      "MessageIndex": 7,
      "PostDate": "27/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93374/smoking",
      "Title": "smoking! !"
    }
  ]
}