{
  "AuthorID": "Loving-my-wife",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loving_2d00_my_2d00_wife",
  "Posts": [
    {
      "AuthorID": "Loving-my-wife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loving_2d00_my_2d00_wife",
      "Content": "WOW!  Great input and information you ladies have brought forward so generously, I can't thank you enough.  It's amazing to read about all the varied experiences you have had, in this post and throughout the entire discussion forum.  I have taken each and every one of those inputs to heart and I hope to learn from them all. So...today was interesting.  We went to Tawam Hospital here in our little town of Al Ain, which is where we have lived for 7 years, about an hour outside of Dubai.  It's a regional cancer center and has all the bells and whistles.  Unfortunately for us, we had gone to our regular hospital (Oasis Hospital) initially and got the biopsy done, which had been sent to a lab in Dubai, who then forwarded it to the US for the actual analysis.  This presented several problems.  First, the results gave only partially useful information, and nothing nada zip about the hormonal aspect as well as some other key information the docs need.  So, we figured we'd just get the biopsy slides and bring them over to Tawam for appropriate analysis.  No such luck as they are still in the US and would take 10 days to get back, and probably not be usable as that point.  So...because Oasis doesn't have a breast treatment capability, and sends their samples off to a lab never to be seen again, why in the world even offer the biopsy service??  Just send the patient to a hospital that can do everything on site.  The result of this was that June had to do a completely new biopsy on her LB, and they went ahead and did one on the RB as well since it has two fibroids, just to make sure, and biopsied the axillary lymph node as well.  Her spirit is incredible, honestly - she smiled through the whole thing and came out showing off her big boobs due to ice packs being tucked into her bra! :-)  Anyway, the doc at this hospital is saying that chemo may not be warranted - at least initially prior to surgery - because the tumor is large enough in comparison to her breast size that they will have to remove the entire cavity it created anyway, so if the cancer hasn't spread then the chemo may not be necessary, or done as a precautionary measure after the surgery.  I kinda got mixed signals, which I need to clarify, but it seems that he implied the key benefit of doing the chemo first if at all would be enhancing the ability to do nipple-sparing surgery should the tumor shrink.  The cosmetic surgeon on staff will do the reconstruction op - I'm kinda hoping he can do the entire op start to finish, since I hear that is becoming more popular. Last thing - the doc says they have a genetic examination tool that allows them to predict the probability of recurrence based on the genetic makeup of the tumor.  Sounds interesting. So - another week awaiting the results - standing by! Peace and love to the incredible ladies out there fighting the good fight. Jason and June",
      "MessageIndex": 16,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55792/just-got-the-news",
      "Title": "Just got the news..."
    },
    {
      "AuthorID": "Loving-my-wife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loving_2d00_my_2d00_wife",
      "Content": "Thanks to all the beautiful ladies who have replied! And yes I am an American expat, married to an Indonesian lady, and we are living in the United Arab Emirates!  Definitely an international affair.  Funny how the spelling of \"mommy\" gave that away! This is just all so shocking, as my wife is fairly young (34) and with absolutely no history of cancer, although her mother had a history of fibroid lesions as well.  This is obviously a bad time of the year to have something like this happen, then again is there ever a good time?  Fortunately my parents, who have long considered June their own daughter, are coming out to the UAE next week for a month to visit and help out, and we are incredibly grateful for that.  What are you all's thoughts on the \"hair\" issue?  My wife is a very independent/against the grain kinda girl, and isn't afraid to walk around bald all day long!  That's cool, but I'm a little concerned about how it may affect our children, on various fronts.  What do you ladies think about wigs and/or scarves?  We were laughing the other day when I told her I would shave my head in solidarity, then she would turn around and go get a wig - DOH!  ",
      "MessageIndex": 6,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55792/just-got-the-news",
      "Title": "Just got the news..."
    },
    {
      "AuthorID": "Loving-my-wife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loving_2d00_my_2d00_wife",
      "Content": "Well here we are, 10 months after my initial posting on this website, and I thought I would offer an update.  June is doing absolutely outstanding!  There was a bit of drama along the way - the portacath implantation led to a hemothorax that nearly killed her, but draining 2 liters of blood out of it, and 12 days in the hospital, and she was good to go - but all in all we couldn't ask for a better outcome.  She did the chemo, and the first three doses didn't do a thing to the tumor, but the last 3 (tax and herceptin) were astounding.  The 5 cm tumor was gone - GONE! - after 2 doses!  So she then had a nipple sparing double mx with sentinel node removal and biopsy and all tissue came back negative, completely clear!  The expanders are in and up to I think about 450 mm, which is about the max for her little frame.  Permanent implants go in next month, and she's got 5 more herceptin treatments and that's it!!  The herceptin makes her a little grumpy for a few days but other than that it's all good.  Her hair is back and looking cool in a little pixie style, and she is back to her normal weight. That's about it, hope you all are doing well, and best of luck!",
      "MessageIndex": 17,
      "PostDate": "19/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55792/just-got-the-news",
      "Title": "Just got the news..."
    },
    {
      "AuthorID": "Loving-my-wife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/loving_2d00_my_2d00_wife",
      "Content": "Hey folks, Jason here, my wife June and I just got told that she has BC, a large 5.5 cm tumor in her LB.  There's so much to say, it's such an overwhelming thing to happen - I think I'm taking it much harder than she is, at least on the surface - but for now I just want to ask a couple questions.  June has had fibroid lesions in her breasts for 12 years and had been told a couple times by doctors that it was nothing to worry about, but about 6 months ago one that we thought was a fibroid started to grow and harden.  She went and had a biopsy and confirmed the worst.  I'm just trying to wrap my head around how this happened - did the fibroid just for some reason turn malignant?  Or is it possible that this one was malignant all along and just wasn't growing very fast?  I'm curious what others' experiences are with fibroids turning malignant. Second question, and I'm sure there is already some discussion on this - the oncologist is recommending we do chemo first in order to shrink the size of the tumor and arrest any further spreading, if there is any - we are doing the PET CT on Monday to determine if that has happened (and as a result determine what stage this cancer is at).  We think it's a fantastic idea on many fronts, in addition to the aforementioned it will also potentially enhance any reconstruction that takes place after surgery.  My question is - what are your experiences with doing chemo, then surgery?  Did the tumor reduce in size and thus reduce the surgery from a mastectomy to a lumpectomy?  I appreciate any and all feedback. Last question - I love my wife more than my own life, and can't imagine her not being here with me and our two small children (4.5 and 1.5 yrs old).  I'm trying to figure out the best way to tell the kids about what is going on in a way that doesn't scare them but let's them know mommy is sick.  I've done a little research this evening and it generally says just be honest with them, which is understandable, but I'm curious what your experiences are in this regard. Thanks, and bless you all Jason",
      "MessageIndex": 0,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55792/just-got-the-news",
      "Title": "Just got the news..."
    }
  ]
}