{
  "AuthorID": "Luckbealady",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
  "Posts": [
    {
      "AuthorID": "Luckbealady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
      "Content": "Thanks for helpful info. Still not sure why I am having the carboplatin part!  Also paclitaxel may be easier to take but I have to have it weekly for 9 weeks so it's a lot more hassle especially as it seems I do have to have cold cap for all sessions!! Any info re the carboplatin from anyone would be good. I have put in a call to the oncologist to see what he can tell me that sounds persuasive!",
      "MessageIndex": 26,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "Luckbealady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
      "Content": "Hi LuckyP. I also managed to get through it and kept cold cap on, but not too sure I will carry on, but that might just be as I don't feel so great today, nausea and sick feeling, but keeping it down.  Also very tired.  Just dragged myself out of bed a little while ago!  Generally Ok I guess.  Feeling a bit less sanguine about it all, but no doubt as soon as I feel a bit better will be fine again.  Luckbealady",
      "MessageIndex": 33,
      "PostDate": "05/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "Luckbealady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
      "Content": "Yes I did survive the cold cap, maybe it is because it is a lot better now. It extended the treatment by over 2 hours!!  So it really is a big commitment, Will have to see if it is worth it longer term!",
      "MessageIndex": 27,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "Luckbealady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
      "Content": "I also start chemo tomorrow. I have had a roller coaster of a ride with changes right up to the last minute. I am now having EC for three sessions followed by paclitaxel and carboplatin. Really totally unsure why I have been changed to this from FEC and Docetaxel. I have had to change oncologist and this seems to be the only reason! I am wondering if anyone knows if I try the cold cap, do I have to use it every time even when I have the paclitaxel on a weekly basis for the final 9 weeks. not sure I can tolerate it 15 times instead of 6 (not that I know if I can tolerate it at all)",
      "MessageIndex": 19,
      "PostDate": "02/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "Luckbealady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
      "Content": "HI Claire Coca Cola is really helpful for nausea. It has to be the original.  (Look it up on line, it has the same stuff in it as drugs for nausea). I sipped it when nauseous and also used it to help with sea sickness on holiday!  Fresh ginger is also really good. You can buy stem ginger in packets and chew it, I have also made myself ginger cordial from fresh ginger. I have drunk that when I do not fancy tea, coffee or any normal drink and have metallic taste in mouth.  I have second EC on Wednesday.  Had cold cap for first one, but hair seems a bit 'loose' today when I washed it, so not sure it is going to hold! Linda",
      "MessageIndex": 58,
      "PostDate": "20/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "Luckbealady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
      "Content": "Really hope you do not feel put off by the posts.  I am at very early stages, only had one Chemo, I get tired but not to the point I cannot function.  Reading the posts it is very clear to me that the chemo affects everyone very differently.  I am sure you will be able to do what you need to do, just take care of yourself along the way.  I get the impression that everything is much better targeted and better balanced now so if you were good last time, cannot possibly see why it should be so different this time.  Whatever the outcome and side effects just remember this is something you really need right now, and you will get through it. Take care and think positively, do not change your view that you can handle this, of course you can and you will. Linda",
      "MessageIndex": 60,
      "PostDate": "20/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "Luckbealady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
      "Content": "I went to my yoga class 6 days after chemo and had a really good session, then the following week just felt tired so didn't go, however had it been something I really needed to do, I would have been able to do it, and I have continued doing yoga at home in between times so have not had to give it up. Good luck Linda",
      "MessageIndex": 64,
      "PostDate": "22/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "Luckbealady",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/luckbealady",
      "Content": "Do you or does anyone know why you are having this regime? I have triple negative and this does not seem to be the standard chemo for this. I was to have FEC and Docetaxel and now changed with no new information to cause a change, just different oncologist.  My tumour was small and caught by routine mammogram.  Am really confused and have not had any time at all to process this or decide if it is the right thing!!  I was told yesterday and am starting today!! It's all mad!",
      "MessageIndex": 21,
      "PostDate": "03/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    }
  ]
}