{
  "AuthorID": "lucytravis",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucytravis",
  "Posts": [
    {
      "AuthorID": "lucytravis",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucytravis",
      "Content": "Hi Kaz, I have just finished my course of FEC.  I'm 37 and a single parent to a 5 yr old boy.  I too was scared about all of it, and if you read too much / listen to some people, you may find that you wished you hadn't.  I don't want to tell you (like someone did with me) that you WILL feel this and that, and xyz will happen, because it may not.  Everyone is different, and we all react differently.  My main advice to you is be careful in week 2, but don't stop living!  I found that my side effects followed a similar pattern each time, with changes every couple of days until the end of week one, but by week 2 they had all gone - I felt fine, and didn't notice the drop in my bloods.  You just have to keep checking your temperature, and any probs get in touch with your treatment team.  The chemo period  itself hasn't stopped me from taking the little one to school / going to his concerts etc over Xmas.  I have had a perpetual cold (the joy of having a child at school) since Xmas, but have topped myself up with a multivitamin, which has helped.  The best way I can describe my symptoms of the first week is a cross between a hangover (without the enjoyment...or regrets of the night before) i.e. I was a bit groggy for a day or so, and being pregnant (heartburn and breathlessness).  You coped with pregnancy 3 times, so I'm sure you can take this in your stride! The best advice I can give re coping in general, is to have a laugh every day.  A good friend told me of someone on chemo who spent all day watching comedy films, and they sailed through their treatment.  If you don't feel like laughing, force your mouth into a smile. May sound daft, but it works.  Eat lots of fresh fruit and veg. and drink lots of water as well.  (all things we should be doing anyway, but let your body help you get through this by giving it the best fuel).   I found if I was busy one day, I needed to take it easy the next.  You just have to listen to your body, and not overdo it.   Where possible include your daughters in what is going on - they will undoubtedly be as nervous as you are - they are at an age where they may talk more with their friends and may well have heard that the worst can happen, so it is important to keep them focussed and positive - If they are happy and settled, so will you be.  I was really anxious as to how I could cope as a single parent to a young one, and he has been my little knight in shining armour.  By focussing on keeping things as normal as possible for him, I have sailed through the treatment (although I'm sure some people would have been happier / more comfortable / felt more useful if I had been more ill!). I was determined not to get into invalid mode i.e I got up as normal, got dressed as normal.  Friends did make me some meals , which was really helpful, but to be honest I preferred to potter about the kitchen making up and freezing my own meals when I felt up to it. With regards to hair loss, I was told it's pretty much guaranteed with FEC.  The way I saw it, there are things you can control with cancer and your treatment, and things that you can't.  I didn't want my son being scared by clumps of hair falling out, so I started getting my hair cut shorter in the run up to chemo,  My friends kept talking me out of shaving my head, but I think that was more because they would have felt uncomfortable with it.  Once I'd had my first dose and got over the side effects, I took matters into my own hands, and we had the best afternoon ever playing hairdressers.  I let my 5 yr old loose with a pair of scissors, and he loved it! I shaved it all when he had finished his masterpiece, and took loads of photos while we were doing it.  He may well have found his vocation in life, and came downstairs the next day asking if he could do it again when it grows back.  I did it on my terms, not the cancer's, and it was very liberating - I wished I'd listened to my heart and not my friends, and done it sooner.  I let him massage moisturiser in every day, and he loved doing it.  I haven't bothered with wigs etc - obviously my chemo has been over winter, so I have worn hats outside, but it hasn't bothered me being bald.  The kids at school look curiously at it, then carry on as normal.  Do what is right for you - There are loads of hat / bandana suppliers on the internet - some cheaper than others.  My hospital had a headstrong service, for advice on hats/ wigs etc.  I didn't use them, but they will help you if you need it.  Take your daughters with you / let them choose you some hats/wig styles - have a laugh doing it!  I had my last treatment on the 5th March and have had my hair growing back for about 4/5 weeks now. Keep smiling and stay positive - it will all be over and you will be enjoying the summer hols with your daughters before you know it!   xxx",
      "MessageIndex": 50,
      "PostDate": "18/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/21812/fec-chemo-and-side-effects",
      "Title": "FEC Chemo and side effects."
    },
    {
      "AuthorID": "lucytravis",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucytravis",
      "Content": "Tracey I hope all goes well for you today.  I have my first FEC on friday 20th.  I am terrified, but have found the feedback on the site reassuring. I too am a single mum 37 yr old with a 5 year old boy - I'm not worried about the hair loss, and have gone progressively shorter the last few weeks - with the intention of shaving it before it falls out.  My biggest fear is that I will be unable to look after my boy and be a Mum.  I am having 6 doses of FEC, in 3 weekly cycles.  Hopefully first 2 will go to plan, and won't be too ill over christmas.  The 3rd dose is New Years Eve.  Being on my own, the financial implications are scary, so I understand where you are coming from.  My Breast Care nurse put me in touch with a MacMillan Benefits Advisor who is attached to the local CAB office - There's lots of help out there if you need it.  Also, do you have critical illness cover with your mortgage or any other policies? I had a mastectomy 5 weeks ago and recovered very quickly, get the odd day when I'm tired, and tightness if reaching high up / low down.  I didn't have a drain in at all, and the wound has healed up better than any other wound I have had. Having a young child has been a blessing, rather than a hindrence to my recovery, as I have had no choice than to get on with things.  I feel very lucky to have been diagnosed - I went about a lump on the left, had mammo on both, 2nd mammo on right, and biopsies on both.  At results session, they said left was benign, but results on right were inconsistent with what they saw on mammo, so needed to repeat biopsies.  Result being it was a 3.5cm grade 3 cancer with medium risk of spreading. If the team hadn't been persistent, it wouldn't have been picked up - and where would I be a couple of years down the line?  It's oestrogen receptive, so going on tamoxifen after chemo, and injections for 2 years to stop periods -although my preferred choice would have been to have ovaries out. - Why play god with more drugs??? My little one has been a real star - when he gets home from school, he thinks of new exercises for me.  He has really surprised me how well he has taken it, and seems to be taking it in his stride.  I've tried to be quite jokey about it with him, which hashelped us both.  My prosthetic spends more time up his top than mine (\"We've both got one booby now mummy\")  Boys will be boys!  I don't have much in the way of family (just Dad who's not handling it well, and brother, who's ok, but clearly worried - works shifts as well, so can't help as much with childcare) My friends and workmates have all been brilliant - if anyone offers help, accept it gracefully - from what I have gathered they feel quite helpless, don't always know what to say, but at least if they are doing something practical they feel like they are helping. Roll on the end of March when this part of the journey will be over! I will be thinking of you today x",
      "MessageIndex": 34,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/21812/fec-chemo-and-side-effects",
      "Title": "FEC Chemo and side effects."
    },
    {
      "AuthorID": "lucytravis",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucytravis",
      "Content": "Hi Tracey Glad you haven't had too rocky a few days.  Know what you mean about the veins taking a hike - mine always do as soon as anyone gets a needle out.  At least you have your daughters birthday to look forward to, and it should be in your 'good' week.  The chemo wasn't as daunting as i thought it would be, they were very jovial in there, which is the kind of atmosphere i prefer I was really sick for a few hours after getting home on friday, so need to sort that out for next time.  Other than that, so far, just been tired (like a hangover without the headache / enjoyment or regrets from night before).  Today, I have felt relatively normal, so fingers crossed that's me through the worst of it The district nurse came out to check on me today.  She's going to sort out the flu jab and swine flu jab as well - have you been told to take them?  The hosp said to get my little one done as well, - I'm not sure, but I guess it makes sense. Keep drinking lots, and you'll soon get through the kidney infection.   Take care xx",
      "MessageIndex": 39,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/21812/fec-chemo-and-side-effects",
      "Title": "FEC Chemo and side effects."
    }
  ]
}