{
  "AuthorID": "LucyF",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucyf",
  "Posts": [
    {
      "AuthorID": "LucyF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucyf",
      "Content": "Thanks everyone. Some great ideas here xx",
      "MessageIndex": 10,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82979/pre-op-advice",
      "Title": "Pre-op advice"
    },
    {
      "AuthorID": "LucyF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucyf",
      "Content": "Hello. I'm 33 and have been diagnosed with stage 2 breast cancer. I'm due to go into hospital on Tuesday for a mastectomy and reconstruction then a month later I'm going to start radiotherapy if needed and chemotherapy. I was just wondering if anyone can recommend anything that I might need to either bring to hospital with me for the op or that I may find useful to have at home afterwards. I thought it would be a good idea to get to the shops now while I'm still feeling up to it as I'm sure I won't be feeling too active post-op! I've done lots of research online but any personal advice would be much appreciated. Thanks in advance.",
      "MessageIndex": 0,
      "PostDate": "18/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82979/pre-op-advice",
      "Title": "Pre-op advice"
    },
    {
      "AuthorID": "LucyF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucyf",
      "Content": "I'm 33 and had a mastectomy and a reconstruction and am waiting to heal before the chemo begins. In the mean time as I have no children and would like them in the future so ok I'm going to begin harvesting eggs. I've no partner at the moment but am hoping to meet Mr Right soon! I have to decide whether to freeze the eggs or freeze the embryos. There is a much higher success rate for freezing embryos but as I have no partner I would have to use donor sperm. I've a tough decision to make ladies. I'm wondering what other people have done in the same situation. Anyone been successful conceiving after freezing eggs?",
      "MessageIndex": 0,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83635/freezing-eggs-or-embryos",
      "Title": "Freezing eggs or embryos"
    }
  ]
}