{
  "AuthorID": "Lucy-loo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
  "Posts": [
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Dear Jac, I haven't really posted on here before but get lots of inspiration from reading the other ladies' posts. I felt I should reply to your post though as I had my first Docetaxel 10 days ago (after 3 x FEC) and I experienced a really horrible week after it. I had physical symptoms that were debilitating for about 5 or 6 days which really brought me down emotionally too and I was very weepy. I am like you and normally quite strong so my husband was very worried about me. It only lasted for me while I had the physical symptoms, you don't say when you had your Docetaxel but maybe it will be that way for you too, and hopefully improve as you do physically. Feeling so physically down reminded me that I had had cancer which normally I can put to oneside and I think that got on top of me. I spoke to my BC nurse and she said that next time they would give me steroids for longer which should help with the symptoms. I really hope you start to feel better soon but don't be hard on yourself sometimes it helps to have a good cry but remember there is light at the end of the tunnel. Lucyxx",
      "MessageIndex": 6,
      "PostDate": "10/02/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/57674/feeling-very-depressed-on-docetaxel",
      "Title": "Feeling very Depressed on Docetaxel"
    },
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Dear Sheila. I made a claim on our joint critical illness policy and was lucky to have it accepted. Out of blue one day received a lovely cheque. Was able to pay our mortgage off. So grateful and glad we took that policy out 12 years ago,especially as being made redundant end of this month. Good luck with your policy. Lucy-loo xx",
      "MessageIndex": 8,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58616/insurance-claims",
      "Title": "Insurance claims"
    },
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Dear Benja. Had to respond to your post about Doxetacel as your side-effects are almost exactly that which I have experienced, including the timescale. It is weirdly comforting to hear that someone else has experienced the same. I am due to have my 3rd Doxetacel on Wednesday (actually my last chemo session, I have had 3 x Fec, not really a problem and 3 x Tax) I am jubilant that all this will be over soon but apprehensive about the side-effects again which do seem to be lasting longer with each session.My first Tax I was out of action for about a week but for the second it took me two weeks to get back to almost normal. For the second session I had a painkiller called Dihydrocodene which did help and took most of the pain away but made me very sleepy, my BCN also arranged for me to have more steriods so that they lasted for about 6 days after but to be honest they seemed to mask or put off the majority of the aching in my bones until after I finished them and then the aching started again! I too am having problems with my finger tips and my toes, and again this has lasted longer on the second session so expect the same on the 3rd. I was at my doctors today for my bloods to be taken ahead of Weds and mentioned it to them as I was slightly concerned that there maybe permanent nerve damage but comfortingly he thinks not and should return to normal at some time after the last session. He did say that if it was bad again this time to go back and there is a type of drug that works for nerve pain. Anyway as you said in your post everyone is different and many people will go through this with a lesser degree of side-effects and it is do-able. Good luck with your session on Weds, I hope things are easier this time. Let me know how you get on. Love Lucyloo xx",
      "MessageIndex": 6,
      "PostDate": "11/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58595/finished-fec-and-start-tax-on-wednesday-but-feeling-really-nervous",
      "Title": "Finished fec and start tax on Wednesday but feeling really nervous..."
    },
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Oh poor you. What a horrible day you had, am so sorry to hear. I dont really understand why the different regimes of treatment. I had one lymph node involvement, not sure if it was the semtinal- i never got a pathology report and when i was told verbally i was dealing with my mums illness and two days layer her death so my diagnosis took a back seat. Anyway enough of me. Can you talk to your gp and get their oinion and support? Is there any chance you can persuade them, even by asking for mental grounds? Where abouts are you? Try the nurses on this site. hope you can get this sorted or at least be comfortable with their fecision. My taste starting to go too tonight. Here we go again!  Make sure you have strong painkillers, you dont need to be suffering pain too. Thinking if you. Do let me know how you go. Feel free to send pm if you want. Love and hugs xx",
      "MessageIndex": 17,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58595/finished-fec-and-start-tax-on-wednesday-but-feeling-really-nervous",
      "Title": "Finished fec and start tax on Wednesday but feeling really nervous..."
    },
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Hi. I too am awake, and think the steroids are playing havoc with sleeping. I have my last of 3 tax today at 12. Cant wait to get it over and done with. Good luck to you today, you can see the light at end of tunnel too. Lucy-loo xx",
      "MessageIndex": 9,
      "PostDate": "13/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58595/finished-fec-and-start-tax-on-wednesday-but-feeling-really-nervous",
      "Title": "Finished fec and start tax on Wednesday but feeling really nervous..."
    },
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Dear Benja. I hope yesterday went well for you? Mine was ok but due tp the problems with my fingers the chemo nurse and oncologist decided to reduce my dose. Bit concerned that reducing it also reduces the effectiveness but they assured me not. They were worried about long term nerve damage. Definitely one to avoid if possible. Makes me wonder why they give the higher dose in the first place then! Anyway maybe reduced does will mean reduced side-effects - living in hope on that one. I started to feel a little achy and very tired last evening. Started on painkillers, which helped. Decided not to take the extra steriods beyond tomorrow so we'll see how that goes. Anyway am very happy that the last one is over. YHou'll be glad only one more for you. Am due to go to Edinburgh next Tues to be measured up for radio as I have 5 weeks of that starting 3rd April. Are you due to have radio as well? I hope your sideffects arent too bad this time. Let me know how you go on. Wishing you well. Love Lucy-loo x",
      "MessageIndex": 15,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58595/finished-fec-and-start-tax-on-wednesday-but-feeling-really-nervous",
      "Title": "Finished fec and start tax on Wednesday but feeling really nervous..."
    },
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Hi Janet. Hope you managed to find someone in your area. I am in Dumfries & Galloway and would love to hear from anyone in our area. I am due to have Radio at Edinburgh for 5 weeks starting 3rd April, would be good to hear from anyone who is going to be doing their rads there at that time as I will be staying on site from Mon - Fri. xx",
      "MessageIndex": 20,
      "PostDate": "14/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58614/any-scottish-ladies-out-there",
      "Title": "Any Scottish ladies out there?"
    },
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Hi Mccaan Indeed I have been there on weds. I had my last one the weds just gone. Am very pleased to hear from you. How far through your chemo are you? I too am heading to Ed for rads. Hoping it should be alot eadier than the chemo experience. Have to say though the lovely ladies in the chemo unit at Dumfries have been wonderful. Going to Ed on Tues to get my tattoos! Love xx",
      "MessageIndex": 22,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58614/any-scottish-ladies-out-there",
      "Title": "Any Scottish ladies out there?"
    },
    {
      "AuthorID": "Lucy-loo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lucy_2d00_loo",
      "Content": "Oh I was there at 12! Will have just missed you. Have you had fec?  how are you feeling after first tax? Will let you know how tattooing goes! X",
      "MessageIndex": 24,
      "PostDate": "15/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58614/any-scottish-ladies-out-there",
      "Title": "Any Scottish ladies out there?"
    }
  ]
}