{
  "AuthorID": "Ludo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
  "Posts": [
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Hello Dreamthief you are so knowledgeable and helpful.  I had not previously tested 2nd and 3rd generation chemo, I have now and the difference is only .02 and .04% . So I understand where you are going with this , to put my body through the trauma of chemo is not worth it for such a minimal benefit and chance to minimise the risk of recurrence.  What can I say -An enormous thank you !  I have been in touch with my breast care nurse and informed that Im not going to persue an onchotype test. So I will commence withA nastrozole soonest and radiotherapy will start after Xmas as local hospital is an oncologist down. I am told that this is still within guidelines of treatment following operation. Phew !                                                                                                                    My very best wishes to you, thank you for your time. Xxx",
      "MessageIndex": 6,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Hello Duffnut Many thanks for your reply. Coincidence hey and it was interesting reading your dilemma. With great help from this forum recommending the NHS predict test (tho not entirely specific to individuals) and discussions with friends and family I decided not to go for Onchtype test and I to am happy with my decision. I just feel that I needed to explore all possibilities. I meet with the Oncologist  for the first time next week to discuss my radiotherapy treatment in New Year. I am two weeks into taking Anastrozole and my  already existing hot sweats seem to have increased in severity and number ?!?    I am also experiencing the inability to apply my mind and efforts to absolutely anything, it all seems such a chore, which is unlike me .  My cancer coincided with my retirement (well it beat me to it by two weeks) so I'm thinking its because my life has changed so much and Im having to readjust.?!? Thanks Duffnut and  seasons greetings xx",
      "MessageIndex": 13,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Hey Lisaofshorham many thanks for your reply and good wishes .  I wish you all the best with your treatment, each step is getting closer to improved well being. Yes we are lucky to have a brilliant NHS AND also this really helpful and friendly sharing forum,. good luck xxx",
      "MessageIndex": 11,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Thank you Duffnut Its odd because I had thought that post surgery with most of the anxious waiting and uncertainty behind me I would have expected to feel stronger and happier?   I will be patient and take each day as it comes. I know I am one of the lucky ones. Ludo xxx",
      "MessageIndex": 15,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Hello everyone I was diagnosed 8 weeks ago with a Grade 2 lobular tumour in my right breast under my nipple. It was the location that caught my attention as my nipple had become slightly inverted.  Two weeks ago I had my nipple, areola and lump removed from my breast together with a sentinel node biopsy.  The wounds are healing really well. Today I received the results which were the best results I could have hoped for, all the tumour has been removed from breast with a wide local excision and the four nodes that were removed were all negative which is brilliant news.  I asked if there is any merit in having an oncotype test which would be specific to me and would maybe help me decide if it would be prudent to have chemotherapy to help reduce the risk of recurrence.  I was informed that my 'score' is too low and I do not qualify for an oncotype test on NHS due to cost.  I do understand that there isn't a bottomless pot of money and I consider have been given excellent treatment and care treatment throughout this ordeal. I am prepared to pay for this test myself, and my consultant is OK with this.  I really do not want to have chemo and My breast care nurse has advised of all the problems that can arise having the treatment and has implied that I should really just get on with my life having had such a positive result.  I don't disagree and I know that only I can make the decision about what to do but I would very much welcome anyone's views on this to put into my 'melting pot'.   Many thanks.",
      "MessageIndex": 0,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Hello again  Dreamthief thank you for your help and recommendations.  I have just used the NHS Predict tool with a 5 5 yr recurrence indicator of 95% And 10 yr 88% result  I will be having radiotherapy and meds for 5+yrs.    so I am now thinking with the two replies I've had on this forum , my consultant and breast care nurse advice and recommendations and discussions with my husband and 26 yr old son, I need to be grateful and happy and move on positively and make the most of every minute of my life because I know I am lucky to have choices and that my prognosis could well have been so different.     Good luck to everyone on this wonderful forum . Xxxxxxxxx",
      "MessageIndex": 4,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Hey Caz90 Thanks for your reply. The Onchotype test is available on NHS providing our score is above a certain number. The tool to measure this is called the Nottingham Prognostic Index I believe, my  results from my pathology report were used to calculate whether there would be any merit in me having the test done to obtain an indication as to  likely recurrence, because my results scored too low  by NHS guidelines ie. Nottingham Prognostic Index , I am not eligible for the Onchotype test on the NHS. I do appreciate the NHS does not have a bottomless pit of monies and a line has to be drawn somewhere.  So with the help of my family and thus forum I have decided to accept my all clear results as given by these very clever teams of surgeons and as recommended , get on with my life.        Hopefully I have helped and not totally confused by my probable poor explanation .  Best wishes.",
      "MessageIndex": 10,
      "PostDate": "02/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Hello Londonlass thank you so much for your speedy and helpful reply. Sorry, I omitted to say that the NHS plan is to have radiotherapy and Anastrozole daily (I'm post menopausal ) for 5+ years as my cancer was oestrogen receptive .  my consultant and MDT  has used a Nottingham ?? matrix/scoring system which is where my low score comes from and is why NHS are not prepared to fund onchotype test . This NHS matrix is based pon statistical recurrence and therefore given my score , it is believed I do not need chemotherapy. I do hope that makes sense? I think from what you have said and your obvious experience I should accept their advice and enjoy my lucky escape while I have been given the chance.   Phew-what an emotional rollercoaster it has been as we ALL know .      xxx",
      "MessageIndex": 3,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143701/all-clear-result-still-have-a-dilema",
      "Title": "ALL CLEAR RESULT !! Still have a dilema ?!?!"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Hello there ! One year ago I had wide local excision surgery to remove my Grade 2 tumour followed by radiotherapy. Today I collected the results for a mamogram that I had last week and to have a clinical assessment . Thankfully the mamogram did not show any abnormalities and neither did my clinical assessment carried out by a doctor within the breast care team. I am relieved at  these findings. I feel frustrated with myself as I am not as elated by these results and I feel I should be. The reason , I think, is because when I had my mamogram a year ago with the tumour in situ , it did not show up, it was only when I had an ultra sound scan that it became evident . I was told that one of the reasons the tumour was not apparent on the mamogram was because it was a lobular cancer and harder for a mamogram to detect.  Today I asked to have an ultra sound scan in view of my experience a year ago and was informed that a scan could still not be entirely conclusive . ??  If I wanted further reassurance I should persue an MRI scan of the breast area privately , which could be more accurate. I do understand and appreciate that I would need to pay for this . My husband says that he thinks that if it were him he would accept the results I have been given and get on with living my life. I understand what he is saying , however I can't help wondering if I should have an MRI scan for what I hope would provide reassurance at this moment in time ? Am I overthinking this ??? Any advice , guidance opinions and views would be gratefully received. thank you . Ludo xxx",
      "MessageIndex": 0,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172805/one-year-on---mamogram-and-clinical-assessment",
      "Title": "One year on - mamogram and clinical assessment"
    },
    {
      "AuthorID": "Ludo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ludo",
      "Content": "Following surgery last November to remove a Grade 2 lobular tumour and removal of my nipple. I had appointment on Wednesday with a doctor as part of my 6 monthly check.  I mentioned the constant mild pain I've been experiencing in my breast for the past 3 weeks  . He examined me and couldn't feel anything untoward and suggested it could possibly as a result of the radiotherapy and to take some anti inflammatory meds ie Ibuprofen for five days and if not any better I should have a bone scan to see if any cancer may have spread to my bones. Does this seem a drastic move? More radiation which Would only identify cancer in my bones and not tissue.  Would an MRI scan be more suitable, accurate and less invasive? Has anyone else experienced this kind of pain post rad treatment ? Confused and concerned . Thanks . Ludo X ",
      "MessageIndex": 0,
      "PostDate": "31/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158416/dragging-pain-in-breast-chest-3-months-after-radiotherapy",
      "Title": "Dragging pain in breast/chest 3 months after radiotherapy ??"
    }
  ]
}