{
  "AuthorID": "lumie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lumie",
  "Posts": [
    {
      "AuthorID": "lumie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lumie",
      "Content": "Hello,  I’ve come here for advice, I think, to tell you the truth I’m not really sure, I can’t really speak to my husband and sons about how I feel at the moment or ask them the questions. So I thought I would join here. I will give a brief history on my breast. At the age of 32 I found my first lump in my left breast it was large, it was removed and found benign. Some years later in my left breast my nipple was bleeding, I had some milk ducts removed and this turned out to be a papilloma. This also happened on the right breast. At around 39 I had another small lump found in my left breast and I had a biopsy on this, it was benign, it was not removed.  I am happy to say that I had no problems until August this year, I’m now 52 and out of the blue I had some sharp pain in my breast at first I thought I might of pulled something, it still continued into October, but had become worse affecting my armpit, shoulder and now my neck. I checked and there were no lumps. My GP thought she called feel a pea size lump and sent me to hospital. I had an ultrasound and was told they couldn’t see anything, the consultant examined me and told me that everything is fine most likely I have pulled a muscle. But they would send me for a mammogram. I had the mammogram and then I received a letter asking to go back for another ultrasound. I know people get recalled, but if they could not see anything the first time on the ultrasound what are they going to see again, the mammogram must of shown something? My pain is not easing and I also have a pain in my left groin, and on the left side, I am worried?",
      "MessageIndex": 0,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141658/recalled-waiting-worried",
      "Title": "Recalled, Waiting, Worried"
    },
    {
      "AuthorID": "lumie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lumie",
      "Content": "Hello, thank you so much for welcoming me and your replies. I just assumed that all/anything could be seen on mammogram or US, so am surprised by this. I have occupied myself today and I have a busy week so I think I will be busy and will try not to worry, well not until Friday when I go back. Wombat.23 & Maggie3 I take it by your replies neither of you found any lumps? Again I  assumed bc was always found through a lump or rash on the breast and not pain or discomfort. I know pain or discomfort was alway something I got monthly before my period, but since they stopped 4 yrs ago I haven’t had that problem. Not until now and I will say the pain is wearing  Sheyjay thank you for the hug, I have not had a biopsy yet just an US and mammogram, they may do it Friday when I go for US again.  Thank you and I wish you all well ",
      "MessageIndex": 4,
      "PostDate": "05/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141658/recalled-waiting-worried",
      "Title": "Recalled, Waiting, Worried"
    }
  ]
}