{
  "AuthorID": "Lynndyloo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lynndyloo",
  "Posts": [
    {
      "AuthorID": "Lynndyloo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lynndyloo",
      "Content": "Hi, really glad to read your post as I met my surgeon last week and am in exactly the same position as you. I'm an AA and have been told that an implant is my only option. The surgeon was completely honest that the reconstruction wouldn't look the same as my other breast and I can live with that but want it to look somewhat normal when I'm dressed. It wasn't until afterwards I thought about the possibility that it would end up looking larger. All the images I've seen online seem to be for much larger breasts and it leaves me wondering if I'm stupid even to consider reconstruction for my tiny boob. If I have to pad out my other breast to match it seems to somewhat defeat the object. One of my main reasons for considering reconstruction is that I do a lot of yoga and hillwalking and felt it would be less hassle than worrying about a prosthesis.  Another concern I have is that the surgeon was keen to go for immediate reconstruction and didn't seem too worried that I will likely need radiotherapy as I am having node clearance but all my reading seems to suggest this could lead to problems.  I would be really interested to hear what your BCN has to say, I had a long chat with mine on the phone and am meeting her next Wednesday to discuss further. I have to decide within the next two weeks and it's keeping me awake at night and I'm changing my mind daily. Finished chemo yesterday but finding it difficult to feel happy about it with this decision hanging over me.",
      "MessageIndex": 12,
      "PostDate": "01/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148573/struggling-to-decide-about-reconstruction",
      "Title": "Struggling to decide about reconstruction"
    },
    {
      "AuthorID": "Lynndyloo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lynndyloo",
      "Content": "Glad your session with the BCN was helpful. Well done on reaching a decision and I hope that things move quickly for you now. A few more sleepless nights for me but hope to have a clearer idea after seeing my BCN on Wednesday. Hearing that you have decided against the reconstruction does make me feel a bit more positive about it as an option as a lot of the time I feel like it is just assumed that this is everyone's preference. ",
      "MessageIndex": 17,
      "PostDate": "02/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148573/struggling-to-decide-about-reconstruction",
      "Title": "Struggling to decide about reconstruction"
    },
    {
      "AuthorID": "Lynndyloo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/lynndyloo",
      "Content": "Hi Staffylove, I did end up doing my own injections, supervised by the District Nurses for the first few, mainly because I needed injections over Christmas and was going to be away from home but also because I felt pressured slightly by one of the nurses.  However, I must admit I felt sick with nerves before each one, worrying about them for an hour or two beforehand each time so if you don't feel confident doing them and the District Nurses are happy to come in I would let them. They are the experts after all and we have enough new experiences to cope with during cancer treatment without forcing ourselves to take on anything else.",
      "MessageIndex": 5,
      "PostDate": "09/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154548/immune-boosting-injections",
      "Title": "Immune boosting injections"
    }
  ]
}