{
  "AuthorID": "M-Bear",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
  "Posts": [
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Very very happy for you :) Good news are the building blocks for us that are still going through treatment and such!! So thank you for posting your great news on here, it certainly put a smile on my face, and motivation to carry on fighting!!! Now it's time to relax and put your worries away! Wishing you a Happy and safe future, Lots of Love Dani xx",
      "MessageIndex": 3,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/38076/all-clear",
      "Title": "ALL CLEAR"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hey Jane :) I will be getting Tamoxifen after chemo, not sure when exactl, could be with or after RADS. If we don't fight for our lives, there is no noone who will do it for us! I'm giving it the best chance! For your worries about telling your mum... I was also worried, but I knew if I didn't tell her, she would've been like a Demon on Redbull LOL, she would have giving me a right old bollocking! She's not even 5ft!! hehe And here are exciting news for you..... I am using the cold cap, it's something you should have been given advise about I hope! I had my 4th chemo today, and I am still sporting ALL of my hair. It works for 60% of  people, and as I was told, before my diagnoses, that I had a 50/50 chance of having BC, I thought 60% chance of keeping my hair, or at least most of it, were very good odds :) My mum lives in Germany, (I am German) and she was a bit dumbfounded, however she took it like a trooper! I am the youngest of 4 girls, and one of my sisters took it really bad, she lost a lot of weight, and is underweight now! But she is getting better now :) Even if your mum takes it bad, she will be getting all the help she needs from her GP, but think about your health Jane, you are worth all the extra % you can get... !! I'm sending you a big hug and all the strength Love Dani xxx",
      "MessageIndex": 13,
      "PostDate": "24/06/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39075/zoladex-tamoxifen",
      "Title": "Zoladex & Tamoxifen"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hello Jane :) I am a very similar case to yours. I was 40 when diagnosed in January, I had Lumpectomy but also ended up with axsillery clearance! My mums mum died of cancer when she was 42 in 1954. I know treatment was totally different then. Nevertheless, being still young, I want to give it my all to get rid of it! We never know if it might come back, but I think I owe it to myself, to give it the best shot! Yes, I hate being poisoned every 3 weeks, and I am so anti meds at the best of times, but I was diagnosed with grade 3 and was told it was quite aggressive. So I gonna be as aggressive back, to give it a right good old whooping :) It hasn't been plainsailing, but what is!? Just give yourself the best chances, and sometimes we have to go down, to come back up again!  What ever you do, do it for yourself, not for other people. Wishing you all the best on your journey, which ever parth you may take. Dani xx",
      "MessageIndex": 11,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39075/zoladex-tamoxifen",
      "Title": "Zoladex & Tamoxifen"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hahaa, Clair.louise...I actually just laughed out loud, after reading your comment LOL my daughter and mum thought I was going completely mad!!! Although I have called it lady garden hair myself, it sound so much funnier in your comment :) I've had my 1st chemo 2 weeks ago today, and not (yet) lost anymore hair than usual. I am also using cold cap, it was blooming freezing, but worth it so far! I also haven't washed my hair since 2 weeks ago....how minging is that?! But my sister (she's a hairdresser) told me to not wash my hair and within 6 weeks it will start to cleanse itself! I try anything onse. My hair gets greasy after 2 days of not washing it anyway, and my wig lady told me to only wash it 1s a week. I am so OCD usually, about washing my hair and stuff, but have surprised myself how well I'm coping without washing my locks! I had my hair cut short into a pixie haircut before 1st chemo, and styling it with my fingers and only comb it 1s a day. Hopefully it will prevent hair from falling out! I'm not sure about wearing a wig, as I found it itchy already by trying them on. I have bandannas and scarves, so will stick to them, if needed! I wish you and everyone else, all the best on their journey. Lots of love Dani xxx",
      "MessageIndex": 6,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/37577/hair-falling-out",
      "Title": "Hair falling out."
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Well Clair.... I drink to the lady garden :)  not allowed alcohol at the mo, so I cheers it with a cup of fruit tea LOL My hair is quite fine generally, as in I have plenty, but it might as well be cotton wool, that's how fine the indevidual hair is! Maybe that's the reason I was told not to wash it more than 1s a week! Well, my motto is * I am being FEC'd every 3 weeks, so a bit of grease wont kill me :) *  Good job is, it's such lovely weather, I get away with the summer wet look hehe. I had to have my lymphnodes out, and it crippled my armpit making it impossible to shave, as this ligament thingy keeps popping out when I lift my arm up..... causing me to totally sporting the Nena look *99 red baloons* possibly before your time LOL ...basically I have 1 German, and 1 English armpit....good job I can pull it off being German hehe! Lovce Dani  ",
      "MessageIndex": 9,
      "PostDate": "27/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/37577/hair-falling-out",
      "Title": "Hair falling out."
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hey Looby :) I was diagnosed 5th Jan. I just want to give you my story, to make you feel more at ease! I also had grade 3, and had to have all my lymphnodes out too (axillary clearance), as sentinal biopsy shown micro metastasis! I never thought my world could be so cruelly turned over as it was! However, I'm here to tell the story, and am glad to say that I am clear now! I'm starting my radiotherapy on the 22nd, after finishing chemo last month!  I'm not saying it was easy, emotionally or physically, but there is a light at the end of the tunnel :) luckely I'm quite a positive person by nature, and that is one thing that I believe helped me cope as well as I have! Of course there are days when you well up, and for some bizarre reason it's uncontrollable, but you know what... let it all out when you need to!  Take every day as it comes, ask all the questions you need to have answered, and keep strong! I also felt guilty about having to take time off work, as I only had 2 sick days in 9 years! I thought I'd be back to work by now, but I have been off sick since 2nd Feb. and it looks like I wont be back until at least November! I've stopped feeling guilty about work, as I have learnt that my health takes priority!  I wish you all the best on your journey, and sending you big hugs xxx  ",
      "MessageIndex": 14,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "You are welcome :) we are all on the same Rollercoaster ride, and we experience the highs and the lows, maybe in different ways, but nevertheless we all have to hold on tight at times!! Will you have treatment over here, or are you going to have it done in Gibraltar? I'm sure your husband will get a posting back to UK in no time, if you decide on having your treatment closer to home! It's best to have family around! Even if they end up useless, they sport some needed destructions at times ;) Also remember, your treatment is around the corner, you'll have to be very patient, as it is all done in stages, and sometimes we have to wait, and that can be trying! Take all the help that is offered and that you need, and you will soon put this all behind you! Although... I am not impressed with the early hotflushes, and I am quite forgetful at times... oh maaan, at our age it's quite tragic LOL Take care of yourself xxx  ",
      "MessageIndex": 16,
      "PostDate": "14/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42419/just-diagnosed---very-scared-and-emotional",
      "Title": "Just diagnosed - very scared and emotional"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hello Jayne :) I am experiencing the same as Sandmouse discribed!! I am getting a physio session on 10th of June, and hope that they will sort me out! I can ligt my arm and stretch it properley, but it still hurts alot and also my skin from arm pit right accross my back feels sensitive, especially when there is the tiniest draught, my skin really hurts then! I am looking forward to my physio session, at least I now heard it from sandmouse, that it does help! Maybe I will even be able to sleep on my side, and maybe even on front :)) Good luck Jayne, and thank you sandmouse for positive message xx",
      "MessageIndex": 11,
      "PostDate": "26/05/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/38246/cold-cap-exercise",
      "Title": "Cold Cap & Exercise"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hello again :) ... I'm really angry too, because some of us get just treated without the respect and care to our health... in my hospital a patient gets 2 minutes (if lucky) with oncologist before chemo, there is no time to ask questions! Funnilly enough, my oncologist is also working for private sector! My friend is private health, and she saw my oncologist last week, and asked her, how come she was getting 15min with her, and on NHS there is no consultation. Oncologist said, because they have to hit targets at the hospital! I'm lost for words!!! To be quite frank.... I don't care about their targets! I just hope they aren't rushing to figure out the indevidual treatment plan, and don't just pull something out of a hut!! Although I am glad to know there are  NHS hospitals that are brilliant, and patients get treated the right way and have consultations before each chemo...but unfortunately,my hospital seems to be cutting corners, and that is a worry to me, as I don't feel I can trust them with my life and therefore don't feel too safe!!....",
      "MessageIndex": 12,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40015/chemo-in-affected-arm",
      "Title": "chemo in affected arm"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hello peter rabit Like you, my arm was affected badly after my 2nd FEC. At my 1st chemo, the nurse told me, that along the line of treatment I would probably end up having a PICC line! I wondered at the time what this PICC line was, and asked if it is like a port! She said it's something they will put in the arm, that they don't do prtacaths! I am German, and although I heard from a friend in Germany, that a port is always fitted before 1st chemo, I assumed that this PICC line was something instead of the portacath! I said ok at the time, and thought to myself these people do this every day, and trusted their way of doing it!  A few days after my 2nd chemo, my wrist was very painful,and then it started to go up my arm, got worse by the day. I called BCN on the Monday, explained my pains, and she said it sounds like it's damage from the chemo!!  I then called the chemo ward and asked to have a PICC line fitted before my next chemo. After a cock up, I ended up having the 3rd chemo in my hand too, it took them 40 minutes, 3 nurses and 6 attempts to get the cannular in!!! I was so cross, as it really hurt already, and I definitely didn't want any further damage! I told them that if they didn't fit me with this line in time for my 4th chemo, I wont have it! They managed to get my fitting booked for day before my 4th chemo, but called 2 hrs before appointment to cancel it, as radiologist called in sick! I said fine, but not to expect me next day for chemo!  The nurse said she would try and get someone else from another department to do it instead, without luck, however she called back saying that they had an appointment for Fri, 2 days after scheduled chemo!  I had it fitted at long last WHOOOOOOP, it took only 20min to be fitted. I asked why it had to take over 6 weeks to be done, plus why they don't fit it before 1st chemo as standard proceadure, and why they don't fit a portacath instead, like that we (patients) could still carry on with swimming, showers etc etc as before! She said if it was down to her she would fit everyone with a portacath, but it's all about the cost!!! AAAARGH, surely it costs more due to do it their way! All the time they waste on trying to get cannular in and having to end up fixing our arm plus eveything else!!  She totally agreed with me, but fat cats above  are the ones that make the decissions! GRRRRR No one ever told me about the damage until it happened either, and I have since learned of many other patients that have to suffer unnecessarily, as if we haven't enough to go through! 2 messed up arms instead of the 1  :( ",
      "MessageIndex": 10,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40015/chemo-in-affected-arm",
      "Title": "chemo in affected arm"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hello there :) Don't worry yourself too much, just take every step at a time!   My lymphnodes had to come out, as micro metasteses were found in sentinal + another node! I was happy to find out after the axsillery clearance, that none of the other 19 nodes had traces of these little terrors :)  I wish you all the best  tomorrow, make sure you take something to help you sleep, and don't go on your own, as you need an extra brain ;) Love Dani xx",
      "MessageIndex": 1,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41686/surgery-results-tomorrow",
      "Title": "Surgery results tomorrow"
    },
    {
      "AuthorID": "M-Bear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_2d00_bear",
      "Content": "Hello there :) NOOOOOOOOOOO NO NO... I can't believe they didn't know.... you shouldn't even have your blood pressure taken in your affected arm, never mind a needle entering your arm!! Completely barking.... I also ended up with a very sore arm from the chemo. And I had my PICC line fitted on the day of my 4th FEC. My arm is still very sore, even yhough it's been 7 weeks since since chemo through cannula! I am so glad that they are doing it through PICC line now!  I wish you all the best with rest of your treatment!  xxx",
      "MessageIndex": 2,
      "PostDate": "06/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40015/chemo-in-affected-arm",
      "Title": "chemo in affected arm"
    }
  ]
}