{
  "AuthorID": "M@ry C",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
  "Posts": [
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Ellen Thanks for the hair posting.  I am still 2 weeks away from first FEC, so am grateful for hair advice.  Did you use the cold cap or not bother?  I am sort of planning to go short soon but that will leave me mousy and grey.  If its going to go, I want to be blonde to the last!   Good luck with the rest of your treatment. Mary",
      "MessageIndex": 3,
      "PostDate": "04/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50427/hair-dye",
      "Title": "Hair Dye"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Janey Well done after first chemo. Just did first one mself with coldcap. Won't know if that has helped for a few weeks but I am doing the not touching hair, not brushing my new short cut and washing only once a week to be kind to fragile follicles. Firstly, having just one node out of 2 is good news.  But it is so important to play it safe.  I know the surgery is devastating - I recently had my second mx.  My wonderful surgeon only wanted me to have a lumpectomy for breast conservation (after second BC after 14 years clear) but having already had an mx  I insisted he take the breast.  As it turned out, for me it was the right decision because the lump was bigger than scanned and had spread to 7 out of 10 nodes. That is exactly why you and your surgeons/oncologists are equal team members.  As long as you have informed faith in your surgeon, you should keep excellent mobility post surgery. 7 weeks on after initial reconstruction I went swimming and both my arm movements are great. body image is important to me but that need to feel clear of cancer is even more compelling.  When all the chemo and radio is done and my skin has had a year to recover I am looking forward to complete both reconstructions. Ok, they will never be the same, but what they can do is amazing and I still intend to feel feminine and glamourous about my body. Janey, I hope you are able to make the right decision for you. Stay safe. Think long term. Good luck. Big hug Mary  ",
      "MessageIndex": 4,
      "PostDate": "23/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50992/just-had-my-first-chemo",
      "Title": "Just had my first chemo"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Janey Well done after first chemo. Just did first one mself with coldcap. Won't know if that has helped for a few weeks but I am doing the not touching hair, not brushing my new short cut and washing only once a week to be kind to fragile follicles. Firstly, having just one node out of 2 is good news.  But it is so important to play it safe.  I know the surgery is devastating - I recently had my second mx.  My wonderful surgeon only wanted me to have a lumpectomy for breast conservation (after second BC after 14 years clear) but having already had an mx  I insisted he take the breast.  As it turned out, for me it was the right decision because the lump was bigger than scanned and had spread to 7 out of 10 nodes. That is exactly why you and your surgeons/oncologists are equal team members.  As long as you have informed faith in your surgeon, you should keep excellent mobility post surgery. 7 weeks on after initial reconstruction I went swimming and both my arm movements are great. body image is important to me but that need to feel clear of cancer is even more compelling.  When all the chemo and radio is done and my skin has had a year to recover I am looking forward to complete both reconstructions. Ok, they will never be the same, but what they can do is amazing and I still intend to feel feminine and glamourous about my body. Janey, I hope you are able to make the right decision for you. Stay safe. Think long term. Good luck. Big hug Mary  ",
      "MessageIndex": 19,
      "PostDate": "23/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50992/just-had-my-first-chemo",
      "Title": "Just had my first chemo"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi everyone Thank you so much for sharing your experiences.  They are all so tailor-made and show the resilience of children.  Thank god for this website. I think I would have gone mad without having somewhere to share things.   Let's beat this thing. Mary xx",
      "MessageIndex": 9,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50640/telling-young-children-about-hair-loss",
      "Title": "Telling Young Children About Hair Loss"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Everyone Just to share that I told my girls tonight (6 and 10 years) that Mummy will probably lose her hair.  I had actually found this book aimed at primary aged children called \"Nowhere Hair\" by Sue Glader. Okay, Its from the US but I found it positive and they loved it.  I knew I would get choked telling them so we just cuddled in bed together and read a page each.  Then we chose wigs.  We are all going to the hairdressers soon for new hairstyles.  I will opt for an Annie Lennox blonde crop. Well, it will be less hair to lose.  The positive crown is slipping this week because it is so close to chemo. Its all getting a bit real. Mary x",
      "MessageIndex": 0,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50640/telling-young-children-about-hair-loss",
      "Title": "Telling Young Children About Hair Loss"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Sasha Your sentiments sound very familiar.  Yes, there should be some grieving for your lost breast and sad feelings looking at voluptuous women on show everywhere.  But don't despair about it.  You should focus on what is really important.  I lost my first breast at 31, went on to have 2 gorgeous girls (that were all I ever wanted) and breast fed them amply on one. Reconstruction was scarier then so didn't bother, but I made sure I had a damn positive body image and was able to dress attractively with no one ver knowing, bikinis included.  I met my new husband with only one breast and i have to say it sorts out the true men from the boys.  I have just lost my second breast  with a late recurrence.  Losing that one was an easy decision because I have chosen life.  I have even had one reconstruction.  Its not finished yet but it is amazing.  And, I do still feel sexy in my skin. The surgeons are so good if you can be selective.  When I've had all my chemo etc and am better,  I am going to go the whole hog and have finished reconstructions both sides, as is our right.  I keep a picture of Jane Fonda looking fab on my fridge and aim to look good again. Be kind to your self.  Let the tears out.  You will love your body again.  You are just as sexy.  People will find your positivity when you get there very attractive. Sorry if I went on.   Good luck X",
      "MessageIndex": 3,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50460/when-does-grieving-for-your-breast-stop",
      "Title": "When does grieving for your breast stop?"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Leighjade I can see you are a gorgeous girl and hope I have not made light of anything.  What we do have in common is a young diagnosis (originally for me), so I can relate to what you might be going through and it did take me a long time to get there.  You won't stop being gorgeous.  Be focused on what matters to you. I also tell people, that even if your medical team are great, be your own expert so you feel informed and empowered. Good luck x",
      "MessageIndex": 5,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50460/when-does-grieving-for-your-breast-stop",
      "Title": "When does grieving for your breast stop?"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Kittycat I would agree with Mistymoley about choice but I don't pretend to be any sort of fount of knowledge and it might be harder to choose depending on your NHS Trust.   In my case I did choose:  I was private 15 years ago (ex-hubby's healthcare) and just to keep a relationship with a consultant JUST IN CASE BC CAME BACK  I continued to pay for mammograms and annual check-ups with my team.  Funnily enough (bear with me, you have to find \"funny\" in the world of cancer somewhere, even if its black humour!) the onc and my surgeon both had retired last August.  I was referred to another recommended surgeon by them for my annual checks but had never met him. I found the lump in April and saw the new consultant privately for the first tests the same day.  As soon as it was confirmed as BC I reverted to NHS because the care is as good and asked my GP to refer me out of area to this consultant. It was that straight forward.  Also, you are entitled to a second opinion from another consultant.   It is very hard at the beginning to know where to turn and it is tempting to put all your trust in your consultant.  Don't get me wrong, mine have all been fantastic, but some decisions you have to make because they give you the choices.  That is why I say be your own expert and work with your team, rather than put blind faith into it.  And be focussed.  Now, I'm just fighting to be a Mum to my girls for a very long time.  If that means no hair or breasts, they will still see the love inside me. Mary x",
      "MessageIndex": 8,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50460/when-does-grieving-for-your-breast-stop",
      "Title": "When does grieving for your breast stop?"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Jules I don't know the medical answer but if you had lots of well applied mesh highlights they would not touch your scalp and you would get a lovely look.  I had highlights the week before my first chemo last month when i went for the big chop.  They did not harm my scalp. Keep in touch about the reconstruction.  When all the chemo and rad is over I shall wait a year and get a double reconstruction.   Take care Mary",
      "MessageIndex": 1,
      "PostDate": "05/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51297/changing-hair-colour-from-grey-to-blonde-after-chemo",
      "Title": "CHANGING HAIR COLOUR FROM GREY TO BLONDE AFTER CHEMO?"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Bellee I had strattice on one side 6 weeks ago.  4 weeks is still really soon after surgery so be kind to yourself. I found at that point things were changing and improving slightly on a daily basis.  Yes, it was still tight then and I think that bilaterally it would be especially so and extra tiring.  As long as you have no infection, it sounds normal.  Of course if you have any concerns see your breast care nurse. I cannot actually feel the strattice unless I prod underneath.  Were you told not to lift your arms above shoulder height for a while?  I didn't hear that bit so over-stretched for ages.  I think it is so that the implant can mesh to the chest wall, so take it easy. Despite being happy with my implant, it will probably get damaged by the RT.  That is a long way off though as I have lovely chemo starting on Monday.  Take care Mary x",
      "MessageIndex": 2,
      "PostDate": "13/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50700/implant-question",
      "Title": "implant question"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Tracey and Ellen Look at us: same ages same situation.  had a 14 year gap myself, but only did 2 years on Tamoxifen as was desperate for children. The worst thing we can do is blame ourselves.  Cancer is not a fault thing. My theory is that the whole hamster wheel homelife stress thing brought it back, but the oncologist says, compelling at it might seem, research does not back this up.. I lay crying the other night after first chemo and hating this horrid Hickman line I have. But then in the morning amazingly I started to feel better.  Thank God for anti-emetics! I think we need to be very kind to ourselves.  It is strange living in this cancer bubble.  I am taking things one day at a time and know dark days are ahead.  I've battled with depression during the first BC but it got me nowhere and I felt desperately alone. So, am using every ounce of resilience to get me through. But what really has helped is meeting people on here and the amazing kindness of distant friends.  Always here for a chat. Love and hugs Mary x",
      "MessageIndex": 2,
      "PostDate": "23/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51001/thoughts-and-feelings-after-having-breast-cancer-twice",
      "Title": "Thoughts and feelings after having breast cancer twice"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Annabel You are 2 weeks a head of me too. I really relate to the fear thing also. This has got to be the worst bit by far. Doesn't the list of SE's go on for ever? I agree with the diary idea as I started one after surgery.  I made it nice with little photos and get well messages, so the children won't be too horrified looking back when it they are older. Le me know when how you get on with the coldcap.  I am also going to do the sucking ice-pops thing to keep the mouth ulcers away.   Really good luck Mary x",
      "MessageIndex": 5,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50496/first-chemo-tomorrow",
      "Title": "First chemo tomorrow"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Annabel Thinking of you.  See you when you put your head back above the parapet. Give it hell. Lots of love xxx",
      "MessageIndex": 16,
      "PostDate": "06/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50496/first-chemo-tomorrow",
      "Title": "First chemo tomorrow"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Sassy Don't apologise for your rant.  Having an MRI myself on Wed so appreciate the warning sign.  Hope your crackhead itching is subsiding. It is normal to be nuts in this situation. Mary x",
      "MessageIndex": 9,
      "PostDate": "07/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50347/mri-dye-grrrrrr---3-weeks-on-still-itching-like-a-crackhead",
      "Title": "MRI dye grrrrrr - 3 weeks on still itching like a crackhead"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Annie Sorry you are having a low.  We all need to crash and burn sometimes.  Yes, it sounds like there is lots of hope, especially as you can actually feel the difference your chemo is making.  You are responding well.  Its really hard coping with treatment that takes this long and that any of us only really know we are getting out of the woods at markers that stretch into the future.     I hope you get your mojo back soon. Sending you big hugs Mary xx",
      "MessageIndex": 8,
      "PostDate": "12/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51349/triple-negative-and-lung-mets-is-there-any-hope",
      "Title": "Triple negative and lung mets, is there any hope? :("
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Carol Firstly, good luck with the surgery. Yes definitely take some advice, but I could reccommend the Royce 1006 from the Bra Clinic (cheapest at £25). I wish I could have been as organised as you.  Didn't order mine till post surgery but now I still wear it 6 weeks after mx and recon.  Its good points are that it is a front loader with poppers, you can adjust the straps and it sits slightly lower on the ribs for comfort. It may not be sexy but it is all about the comfort I promise you. What recon are you going for?  I had strattice and saline implant.  Wishing you a speedy recovery. Mary x",
      "MessageIndex": 3,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50637/bras-for-reconstruction",
      "Title": "bras for reconstruction"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Sascha I wish I had answers for you.  You really are a special case.  I am stage 2 with 7 affected. All I can say is something a bit obvious, about getting referred to the Royal Marsden, which I have not had to do. I watched an old episode of Horizon - Beating Cancer. They detailed some cutting edge technology and drugs used in a range of cancers that they pilot there. Perhaps you should Google the episode and get a referral. I wish you all the best luck in the world. Let me know how you are doing. Mary x ",
      "MessageIndex": 2,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50465/anyone-else-with-only-one-kidney-facing-or-had-chemo",
      "Title": "Anyone else with only one kidney facing or had chemo??"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Annabel Just read your thread and feel very sad and angry about your onc's total lack of communication skill.  I remember well the 29th April, 2 days after the mx.  I had 2 doctors in the same team.  One gave me a very upbeat take on only 7 of my 10 nodes being affected.  She left me feeling upbeat. 9pm at night the other dr came and delivered what felt like a death message with the same news ending with \"I'm sorry\".  I did indeed cry.   What I am trying to say is ignore the messenger and focus on the facts.  When I first read about how well you were responding to the chemo I felt upbeat for you.  Shrinkage on tumours is life preserving.  People have attested to tumours actually disappearing. The treatments are so advanced now.  I should know I have been courting cancer for 15 years and I ain't going anywhere. Let it out and tell people what is going on. The really good friends will be inundating you with help. You will get your head around this and regain your inner happiness.   Sending hugs and love Mary x  ",
      "MessageIndex": 20,
      "PostDate": "19/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51664/horrible-onc-appt-horrible-news",
      "Title": "horrible onc appt, horrible news"
    },
    {
      "AuthorID": "M@ry C",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/m_4000_ry-c",
      "Content": "Hi Pinksunfish You finishing.  Me just about to start.  As a fellow hayfever sufferer have noticed that this season is a bit delayed.  Sorry, don't want to rain on your parade! Mary x",
      "MessageIndex": 2,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50635/chemo-and-hayfever",
      "Title": "Chemo and hayfever"
    }
  ]
}