{
  "AuthorID": "mabbze",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
  "Posts": [
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Hi Sharon, I went through a lumpectomy in April and my cancer was more progressed than when I had my Biopsy so landed in going in for a Masectomy in May, if I had known there was a chance It was worse than I thought I would have gone for the masectomy straight away.  As others have said discuss the reconstruction, that made me feel so much better, and in the meantime the silicon temporarys are excellent,  no one can tell I wear one, in fact I have friends ask which side I have lost.  Take care Zena",
      "MessageIndex": 37,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Hi Sharon, Just wanted to wish you all the best for tomorrow.  Will be thinking about you.  I know its easier said than done bit don't worry. Zena x  ",
      "MessageIndex": 96,
      "PostDate": "07/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Hi Sharon, I must admit I'm glad you went down the masectomy option for the reason the consultant said.  I was out of hospital the next day and two days later was at our local cricket club with my drain in a handbag.  All the best for the 8th and I am sure you will be fine. Best Wishes Zena x  ",
      "MessageIndex": 44,
      "PostDate": "29/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Hi Sharon, I had all sorts of thoughts, It was very scary thinking about it because before the operation I was known for my breasts and cleavage (I am a 36G) and have always been big breasted.  I thought everyone would be able to tell,  but I got talking to a lovely lady at our cricket club who I have known for 6 years who un beknown to me and eveybody else in the club had had breast cancer 20 odd years ago. She had a masectomy and to my surprise has never had reconstruction and believe me you can't tell.  She has a new prosthesis every year.  I must say my prosthesis is brilliant.   Try to go out, the first thing I did was tell all my friends and family to treat me as normal as possible, thankfully they did. Any further questions don't hesitate to ask. Best Wishes Zena x",
      "MessageIndex": 56,
      "PostDate": "31/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Hi Sharon, I know there is alot of positivity and it is difficult to take it all off the time.  I have friends and family telling me to remain positive and on my bad days (and yes I have them) I want to scream at them but something inside me tells me its only because they care!   I also know what you mean about the thought that you know you are different,  I do feel like that but I also know that hopefully come March I will be going back to my consultant to have a discussion about my reconstruction and that when my daughter gets married the following year on a beach I will have firm bust and will be hopefully wearing a nice thin strappy dress, something I haven't done for a couple of years.  Thats my positive thoughts for me, having a firm bust and watching my daughter getting married, oh yes and then the Grandkids!! When I first had my masectomy,  I wore baggy tops all the time but when I got my proper prosthesis, has it looked more natural, I went back to my normal fitted tops.  One more thing Sharon, I have suffered from depression in the past and I know how hard it is (I suffered with it for 3 years on my last bout) and bless my youngest daughter has been suffering with it, my diagnosis was the the final straw for her.  So once again just know we are here to support you and  us positive ones have our bad days.  Best Wishes Zena x",
      "MessageIndex": 77,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Dear Sharon, Please don't think that you were upsetting us.  Everbody reacts differently, the way I reacted shocked me, I thought I would have fallen apart but I didn't (I was lucky).  Please keep talking to us you haven't let anybody down, you have to do whats best for you, physically and mentally.  I am having issues at present wether I should have radiotherapy, I have had 7 courses of chemo and my last one is on Monday but I'm not sure wether I am or should have radiotherapy, mainly because I want my life back, I want to get back to work, I'm tired of being at home and lots of other reasons. Please take care and do not let one persons comments stop you talking to your new friends on here. love Zena",
      "MessageIndex": 105,
      "PostDate": "11/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32371/mastectomy-or-not",
      "Title": "Mastectomy or not?"
    },
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Hi, I have gone through 7 sessions of 8 chemo's and up until my 5th I have been fine, mentally very positive that everything is going to be ok.  But when I went to my 5 th session they decided to say that they were now considering to give me Radio,  which at my original visit to the oncologist was not decided on, I would have 4 FEC and 4 Taxotere followed by 5 years minimum of Tamoxifen. This as set my mind all over the place.  I thought I would have further scans and then would be able to progress forward to my reconstruction. Has any body else come across this or have any advice what I should do as I have not a clue? Thanks Zena",
      "MessageIndex": 0,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32717/why-am-i-scared-now-as-i-am-coming-to-end-of-my-chemo",
      "Title": "Why am I scared now as I am coming to end of my Chemo?"
    },
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Thanks guys, it is the not knowing whats next, its good to know that you feel yourself again Sue, how I long for that.  I will try and speak to the oncologist next time I am in the hospital.  Zena xx",
      "MessageIndex": 3,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32717/why-am-i-scared-now-as-i-am-coming-to-end-of-my-chemo",
      "Title": "Why am I scared now as I am coming to end of my Chemo?"
    },
    {
      "AuthorID": "mabbze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mabbze",
      "Content": "Thanks for the replies, its good to know my feelings are quite normal.  People think I'm mad because I keep saying I want to get back to work after my treatment, but I think its because I like routine to much and my cheo has been my routine. I have still got the uncertainty of my RT wether I am having it after my chemo or not but also I have been asked to take part in the Supremo trials as anybody else heard of this. It means that even if they decide I need RT I still may not have it as they are looking at so many women who have it and so many that don't.  Confused I am!!!! Zena xx",
      "MessageIndex": 7,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32717/why-am-i-scared-now-as-i-am-coming-to-end-of-my-chemo",
      "Title": "Why am I scared now as I am coming to end of my Chemo?"
    }
  ]
}