{
  "AuthorID": "machka10",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
  "Posts": [
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Love this site, what a great idea. Just back from walk along esplanade on InverClyde estuary in glorious sunshine. Walked about 6 miles total there and back (\"there\" was a nice wee cafe for a coffee and toastie but at least I walked there and didn't take the car ). Diep (12 hours of surgery) was 16 weeks ago, sepsis and further surgery 13 weeks ago so, as a former couch potato, am very pleased with my improved fitness. This site has been a real inspiration.  Didnt see the orca pod that has been spotted over the last week or so - they are a bit further along the coast I think  - but did see a pod of about 20 dolphins  (might have been porpoises, forgot to take the binoculars) in the sparkling blue water. Brilliant Hugs to everyone xxx",
      "MessageIndex": 1066,
      "PostDate": "30/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Turned out to be harbour porpoises - but still lovely to watch! xxx",
      "MessageIndex": 1084,
      "PostDate": "01/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "beautiful photos and just love the brilliant quote at the end. Just back from the gym - no walking outside as now torrential rain here in west of Scotland. Long overdue so not complaining, well not as long as the sun comes out again soon. love to all, Lesley xxx",
      "MessageIndex": 1999,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Hi folks I think one or two of you lovely ladies are from Yorkshire? Hubby and I heading down from Scotland on Sunday. Staying overnight near Darlington then on to holiday rental - a cottage somewhere between Easingwold and Helmsley. Any suggestions / recommendations for walks?  Nothing too strenuous please. If it's fairly flat, I can do up to 10 miles 12 at a push. If it is hilly, a bit less. The main factor is knowing there are toilet stops possible (Since the DIEP \"do over\" where some muscle was removed and then op for sepsis, I can occasionally have a sense of urgency when I need to go, especially in the morning. Can be rather embarrassing at times so reassuring to know in advance where facilities can be found) so any suggestions gratefully received. Love to all Lesley",
      "MessageIndex": 2195,
      "PostDate": "30/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Dear Seaspirit44 Thanks for that. I got the Maccy toilet card only a few weeks ago  and just having it in my handbag makes me feel more secure  - but the radar key sounds a great idea too.  And you are right, when you mention the C word, it is amazing how quickly some folk back off. Just back from getting my nails done (shellac  - all sparkly - until I had cancer I used to go for quite bland colours, now I want sparkle!) and we will get the suitcases down tonight. Looking forward to some good walks (and  pub lunches too so not likely to come back any lighter - but, then,  it is a holiday) across the North Yorkshire moors and if hubby wants to do a full day's walking and I don't feel up to it, I think there is even a spa nearby.  It is actually a year ago today I found the tiny spots of blood that started my BC journey and in that time have been overwhelmed by so many acts of kindness, by the support from family and friends but also from the wonderful users of this website. This is the one place where I know I can receive honest answers to questions, where I can share my fears (no one here ever says \"Oh, don't worry, I am sure you will be fine\"), where I can always find encouragement and even (much to my surprise) a lot of humour. You have all helped me so much - a huge thank you to everyone. Hugs  to all from Lesley xxxx  ",
      "MessageIndex": 2209,
      "PostDate": "31/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Just wanted to say I feel exactly the same. This has been a real inspiration for me, what a wonderful idea. Have been feeling very down in last couple of weeks - thought once my sister's funeral was over, I would \"move on\" and in fact the opposite seems to have happened. Also have large area of necrosis, giving me quite a bit of discomfort, needs another op - but putting the decision off til August as have had enough for now. So - read all the posts here, gave myself a shake and went off to the gym as much as I could (just 10 minutes cycling, 10 minutes cross trainer and 10 min at a slow 4.6km/hr on the treadmill) and it has definitely helped. Hubby and I are off tomorrow for our first proper holiday since my diagnosis - Ardnamurchan on the west coast so really hoping Storm Hector blows away soon. Have packed everything we will need for a week's hol in Scotland: sun cream and sunglasses (well you never know), waterproofs, thermal underwear, midge hood - but whatever the weather, we intend to do lots of walking. will try to post some photos if someone can tell me how to from an android phone love the photos on here - great ideas for more \"staycations\" love and hugs Lesley xx",
      "MessageIndex": 1572,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Am just back from shuffle around Victoria Park (Glasgow) - 20 swans and 5 cygnets on the pond but didn't stop to take photos (sorry) as have set goal of doing Park Run there later in the year and wanted to see how I would do. Did the 5km in 52 minutes and 33 seconds so really chuffed as my joints are killing me at the moment  - oh the joys of letrozole! Love this inspiring site xxx ",
      "MessageIndex": 1991,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "beautiful photos and just love the brilliant quote at the end. Just back from the gym - no walking outside as now torrential rain here in west of Scotland. Long overdue so not complaining, well not as long as the sun comes out again soon. love to all, Lesley xxx",
      "MessageIndex": 1998,
      "PostDate": "01/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "My lovely elder sister passed away yesterday and I feel totally numb. She was diagnosed with an inoperable brain tumour while I was in hospital having my mastectomy and reconstruction. No warning, one day she was fine, the next she lost her balance and her words were all muddled up. That was 16 weeks ago. The rest of the family is in bits and I cannot cry. The last few months have been so awful I feel as though I have nothing left - yet I need to be there for my two nieces and my brother-in-law. My husband is a great support, I would not have got through the last few months without him but the stress is really getting to him too. I know things will get better but,  today, I am really struggling.",
      "MessageIndex": 0,
      "PostDate": "02/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156417/no-tears-left",
      "Title": "No tears left"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Thank you all so much for your words of comfort. I am better today. My brother-in-law is still not taking things in (very understandably) and has been very vague re funeral arrangements. He \"thinks\" date set is 18th May (exact date and time as I was due to see my consultant again) seems a long time away, but because some of us are travelling from north or south of country to Yorkshire, went with first Friday available. I have spent this morning on the phone, confirming that was the correct date with the various agencies involved, rescheduling my own clinic appointment, booking accommodation and talking to very distressed family (I am normally the \"go to\" when anyone is upset) - so have cried absolute buckets today - and it has done me the world of good. Now putting my face on and about to hit the gym!  I have started using the \"life after cancer\" site but I still rely on this site so much and pop in almost daily to see how everyone is doing. Thank you all again for your words of comfort - you really understand -  and for just being there. I wish I could meet you all in person to give each of you the huge hug you deserve. Love from Lesley xxx",
      "MessageIndex": 8,
      "PostDate": "03/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156417/no-tears-left",
      "Title": "No tears left"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Hi, thanks for that and I am sorry - I think I may have confused things with my ramblings (since all this started, my brain does not work as well as it used to - I sent this reply yesterday but as a reply to the email!!! - so, brain fog again - nothing to do with Christmas sherry, honestly!) so apologies for that. I went into the lumpectomy knowing I had high grade DCIS but when we went for the pathology report following the lumpectomy we were told DCIS was very wide spread  - but that they also found invasive cancer. We are both sure the consultant said I have stage 2 cancer and that it is strongly ER+ -  then we went straight on to discuss the mastectomy and different options. We didn't think to ask any questions about the cancer after that as the focus was solely on the next operation and possible reconstruction. My nurse has now told me it is a 35mm IDC grade 2 - (my friend from \"someone like me\" has lobular cancer and that is what started this discussion as I didn't know what I had) but I have not had any nodes sampled yet. I think that is now going to be done during the mastectomy. Got the official paperwork yesterday for the DIEP, now being admitted a day earlier than we thought, now on 7th Jan, surgery on 8th - so might yet get a bit of birthday cake on the 10th Thanks for all the replies, especially the suggestion of going to see my GP. I will definitely do that as she is lovely, very supportive and we know she would be happy to talk us through this. Had a low day today - was fine till went shopping for support pants and firm support non-wire bras - not something I would choose to wear  - so made it much more real, bit weepy now but trying to remember this is to make me well.  Lesley xxx",
      "MessageIndex": 8,
      "PostDate": "19/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145037/pathology-report",
      "Title": "pathology report"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Thanks, Debs Yes, totally get the screaming, sometimes I want to just kick something very hard - but am sensible enough to know that a broken toe would add to my woes.  Like you, I have never said \"why me?\", it just is what it is and I am dealing (most of the time), and like you, am so grateful none of my family is going through it. I have one sister, 5 lovely nieces and 8 great-nieces (I know men can get breast cancer too and I have a husband, a son, plus a brother, a nephew and a great-nephew too but they are seriously outnumbered) so lots of close family, I am very lucky. A good friend (who went through a crisis a while ago) said she had asked the \"why me?\" question and immediately thought \"well, why not me? - but I am damned if this is going to beat me\" and I think that is a brilliant way to think.  Didn't sleep well but maybe coming down with cold, definitely feeling more positive today. A good cry yesterday seems to have helped. Big hug back to you - and yes, promise to go easy on the sherry Lxxxx  ",
      "MessageIndex": 11,
      "PostDate": "20/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145037/pathology-report",
      "Title": "pathology report"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "I had a rather confusing phone call from my bc nurse. I have been teamed up with a lovely lady through \"someone like me\" and during our chat she asked what type of breast cancer I had - and I realised I didn't know.  So, when bc nurse phoned about something else, I asked her, saying I knew I had stage 2 cancer but nothing else. She replied that I was wrong, no one had mentioned stage as that is not used in the UK, it is an american term, we use grades instead. She did tell me that my tumour was \"bigger than expected\" and grade 2.  Now this has left us very confused as, although one was found during the lumpectomy, we had not been \"expecting\" any tumour at all (mammo and ultrasound clear, was told several times not to worry as did not have cancer but \"just\" high grade DCIS). Put the phone down and asked my husband who was with me to get the pathology results on the lumpectomy what he remembered - he said we were told only that no clear margins achieved and I also had stage 2 cancer then the talk went straight onto mastectomy and options around that. I know we were both a bit stunned by the bad news but I think one of us would have remembered if \"grade\" had been used instead of  \"stage\". So - can I ask to see my pathology report? We both feel my bc nurse, while a lovely person, has a tendency to gloss over things and avoid direct answers - while we would both prefer the full picture, regardless of how bad that might be, so we know what we are facing. To end on a good note, the MRI on my other breast has come back totally clear  - fantastic news - so single mastectomy only on 9 January. Love to all going through this xxxx",
      "MessageIndex": 0,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145037/pathology-report",
      "Title": "pathology report"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Hi there Sorry to hear you have such painful joints. I have had arthritis for some years now (told I will be starting hormone therapy after my mastectomy / reconstruction  - early December -  but don't know what yet, so bit concerned how that will affect me) and, in addition to Naproxen, I was prescribed Feldene gel, which comes in a tube, rub on as needed. I carry it everywhere just in case and have used it on my lower back too. Might be worth a try. I also use a microwaveable \"hot water bottle\" - like a warm, squishable, fleecy bean bag, very comforting for sore joints. Hope that helps xxx",
      "MessageIndex": 6,
      "PostDate": "17/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142622/tamoxifen-problems",
      "Title": "tamoxifen problems"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Hi folks I have been on Accord for about 15 months, still got almost 9 years to go, with low  to moderate level side effects: some joint pain, very thin hair, hot flushes, interrupted sleep - but nothing I couldn't cope with. Early on, my Accord had been changed to Crescent but, within a week, I found a huge difference. I could hardly move my fingers,  horrible joint pain, so after a chat with my local pharmacist it was written in my notes that I must be given Accord - and all good for almost a year.  However a few months ago the joint pain became worse, the flushes were much more frequent and the disturbed sleep deteriorated so much that I cannot remember a night when I slept for more than 3 hours at a time  - and that is on a good night!. On top of that, every so often but increasingly, I felt as if I had taken a huge jolt of caffeine with sudden bursts of racing heart. At the end of March I was admitted to hospital with a pulse of almost 200. Since then I have been diagnosed with sinus tachycardia. Now up til then I had been getting life back to the \"new normal\". I had had the all clear from my annual MRI and mammogram and was moving on. I was back at the gym and probably healthier and fitter than I have been in years. My pharmacist has said that tachycardia and palpitations (on the occasion I was admitted to hospital I had been absolutely fine, fell asleep but woke only 30 minutes later with arrhythmia as well as a racing heart)  could be possible side effects of letrozole. Has anyone else experienced this and if so, did you keep taking letrozole? Am also wondering if this is a sudden unexpected reaction to all the trauma of last year - cancer, diep surgery, then sepsis, the sudden and unexpected loss of my sister - but the racing heart hits me at all times of the day or night out of the blue and I am not the type to dwell on the events of last year.  Am waiting to see a cardiologist but would be interested to hear if anyone else has had a similar experience long after active treatment has stopped but while on letrozole. love to all, Lesley ",
      "MessageIndex": 0,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181459/letrozole-side-effects---sudden-onset",
      "Title": "letrozole side effects - sudden onset?"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Thank you.  That is very reassuring. I have had the 24 hour monitoring done too and it picked up at least 4 episodes, one where I was sitting quietly and calmly reading a book when my heart rate  suddenly shot up. Am still to see a cardiologist. Sometimes it just feels odd but other times, when it is going above 150, it  can be quite scary. Like you, I find as I try to sleep, especially when I turn onto my left side, it is worse. Well I will see how it goes but I appreciate you sharing your experience. hugs xx",
      "MessageIndex": 2,
      "PostDate": "20/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181459/letrozole-side-effects---sudden-onset",
      "Title": "letrozole side effects - sudden onset?"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Thanks for that, seaspirit44. I didn't have chemo so i cannot blame that. I had a really horrible virus Jan / Feb, went on for weeks and I coughed so much I cracked two ribs so maybe a wee tonic or a course of iron would help.  Thank you, everyone, for your replies. None of my friends has had cancer and, 15 months on, I get the vibe from some of them that I should be back to normal (Been there, done that, time to move on...) so it is good to know that I can still bring my worries here and you will understand.  love to all x",
      "MessageIndex": 7,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181459/letrozole-side-effects---sudden-onset",
      "Title": "letrozole side effects - sudden onset?"
    },
    {
      "AuthorID": "machka10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/machka10",
      "Content": "Thank you Moomy, that is reassuring and I think you are correct. I had a hysterectomy 20 years ago and had 10 wonderful years of no periods and HRT  - but was taken off the HRT after that and then went through the menopause, so about 10 years ago. I know I moaned a bit about sleeplessness and flushes at the time but I didn't really have any other issues and nothing to do with heart rate then so all this has been a wee bit of a surprise. I know we all hear about side effects but I always thought they were supposed to be worse at the start and then hopefully eased off - or perhaps we were just supposed to get used to them. I had no idea I could have sudden and extreme side effects more than a year on. The joint pain is also becoming a real issue so I guess it is all tied up together. I will wait to see the cardiologist then maybe try a different brand of letrozole. Thanks again Hugs back to you xxx",
      "MessageIndex": 6,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181459/letrozole-side-effects---sudden-onset",
      "Title": "letrozole side effects - sudden onset?"
    }
  ]
}