{
  "AuthorID": "Macrad",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
  "Posts": [
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Hi shelski You are doing all the right things.  If the spots look like spots you get on your face, stop the Aquamax just where they are and let them dry out. If the spots are prickly heat type spots, carry on with the Aquamax & hydrocortisone. You can take the Piriton reguarly if its helping, and you might find aloe vera gel helps as well.  Also put the Aquamax in the fridge. Sounds a bit barmy, but lovely and soothing when putting it on.  Things might get a bit worse before they get better, but that's completely normal. Hope that helps!",
      "MessageIndex": 2,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122950/skin-care-following-completion-of-radiotherapy",
      "Title": "Skin care following completion of radiotherapy"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Hi ali owl & Aannne1986 Radiotherapy will also reduce the risk of any cancer cells coming back.  The reason they mentioned a wrong operation is because a lumpectomy and radiotherapy combined offers the same benefit as a mastectomy,so if you had refused RT at the start, they would have suggested a mastectomy.   RT alongside hormonal treatments and Herceptin (if applicable) offers the best combination in terms of reducing the risk of recurrence.  It seems like a lot of treatment but your oncologist should be able to go through the statistics with you. Sometimes the Cancer Research UK website has some good statistics that may give you a bit more info.  Please try not to worry about the radiotherapy - it's painless and has few side effects.  The main problem is the inconvenience of having to travel to appointments every day.  If you've got through chemo, radiotherapy is a walk in the park in comparison!   Please feel free to pm me if you want any further information about radiotherapy.  Best wishes. ",
      "MessageIndex": 12,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93090/silly-question-time",
      "Title": "silly question time !!!"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Not wishing to put the cat among the pigeons, but the clinical evidence for the efficacy of R1/R2 is actually really poor.  There have been no controlled trials done on its use; the evidence is anecdotal at best.    The reason that different departments recommend different creams is because there is NO evidence that proves which cream would be best, so a lot of departments do what they have always done. The most recent skincare guidelines from the Society of Radiographers (released Feb 2015) recommend patients use whatever moisturising cream they would normally use.  Ultimately, there is no magic solution to prevent a skin reaction, some of it is genetic, but if your skin is in good condition, it will repair quicker. Therefore, keeping it well hydrated will be of benefit. It makes me cross that different products get marketed as ‘wonder creams;’ and people get anxious trying to get hold of them when actually good old E45 or Nivea etc. would do the same thing. I’m not saying don’t use the R1/R2 (although the applying it straight after treatment sounds like a real pain!) but if you can’t get it, don’t panic – any other moisturiser will be fine. K",
      "MessageIndex": 22,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98915/r1-and-r2-treatments-for-skin-damage-caused-by-radiotherapy",
      "Title": "R1 and R2 treatments for skin damage caused by radiotherapy"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Thanks Dream Thief, I haven't seen that study before so I stand corrected!  It was an interesting read. However, it is based on breast and head & neck patients having chemo-radiotherapy and we don't give concurrent chemo/radiotherapy to breast patients in this country so it is difficult to compare.  Concurrent chemo will always increase the risk of a skin reaction. Also, the study is small (it does recognise this) and based only in one oncology centre.  The study states that it's primary objective is to evaluate whether there was a reduction in progression to severe radiation dermatitis with the use of R1 / R2 treatment. We wouldn't expect to get severe reactions in a lot of breast patients. Only a handful of patients will progress beyond a grade 2 reaction.  It would be more useful to evaluate what percentage of patients developed any kind of reaction. Also, every person is indivudual and will react differently so really, the only way to truly evaluate it's efficacy would be to cover half a breast in 'normal' moisturiser and the other half in R1/R2! Sounds daft, but they have done it before when comparing aqueous cream vs aloe vera gel or aqueous cream vs no cream. It does sound like a positive write-up and I'm sure the products are helpful, in particular the soothing gel. My concern is that ladies will feel that this is a necessity and become anxious about  obtaining it, when they could do without the extra anxiety.    I hope they do further studies for the R1/2 gel.  I know it is a bone of contention in the radiotherapy world about the lack of evidence regarding skin products and it something that is on the agenda for future research.  Watch this space, I guess!",
      "MessageIndex": 27,
      "PostDate": "05/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98915/r1-and-r2-treatments-for-skin-damage-caused-by-radiotherapy",
      "Title": "R1 and R2 treatments for skin damage caused by radiotherapy"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Aw Heather, it sounds like you really got the rough end of the stick with your treatment.  I'm so glad you've found a cream that you like and it is helping. Recovery can be such a long winded process and everyone is different.  It can take up to a year to recover just from surgery alone so when you then get chemo, RT, hormones etc flung at you as well, it all has an extra impact and makes the healing process a little longer.  The fatigue is often the most debilitating side effect following treatment and unfortunately there is no magic pill to take to make it go away - it's just allowing time for your body to recover from everything it's been through. I think sometimes the trick is recognising the small improvements that are going on rather than focusing on the fact that you still feel like you could sleep for a week.  Keep going!  And if you haven't already, take a look at the Macmillan Coping with Fatigue booklet and the Late effects following breast cancer treatment. Some really helpful tips and info in them for anyone at the end of treatment. (Dream thief, any chance you could put links in?  I'm not that technologically savvy!) Kate",
      "MessageIndex": 33,
      "PostDate": "06/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98915/r1-and-r2-treatments-for-skin-damage-caused-by-radiotherapy",
      "Title": "R1 and R2 treatments for skin damage caused by radiotherapy"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Yes, I'd like to think they have changed a bit in that time.  I'm sorry Jackie wasn't given enough info when she had her treatment; I'd like to think most radiographers would give out that kind of information without prompting but obviously not. Certainly over the last few years, there has been a greater awareness regarding the long-term effects of treatment and the importance of informing patients.  I LOVE the idea of post-RT follow ups to check skin, however there are just not enough hours in the day or days in the week!! Jojomomo- try not to worry (I know it's easy for me to sit here and say that).  They won't start your RT until you've fully healed.  The radiotherapy reaction isn't actually a burn - it's caused by the cells below the surface of the skin not repairing in time before we shed our top layer of skin as normal and they come to the surface. Wounds heal from the bottom upwards so the radiotherapy damage will be below the surface of the skin where the wound healing is stronger because it's already happened, if you see what I mean!  Your scar might look a bit angrier and more prominent but it's highly unlikely the radiotherapy would make the scar break down.  As soon as you've healed, whack on moisturiser like it's going out of fashion -  that will keep your skin supple and in good condition and then the radiographers will keep an eye on your skin throughout treatment.  A lot of ladies use BioOil alongside their normal moisturiser with good feedback. K",
      "MessageIndex": 30,
      "PostDate": "06/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98915/r1-and-r2-treatments-for-skin-damage-caused-by-radiotherapy",
      "Title": "R1 and R2 treatments for skin damage caused by radiotherapy"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Hi, Yes, this is true.  There is some evidence that aqueous cream used over a long period of time can cause some thinning of the skin, so it is now no longer recommneded as an emollient but just as a soap substitute. In fact, it can no longer be classed as an emollient because of this.  Some oncologists may not have caught up with this yet, but your radiographers should know.  The Society of Radiographers skincare guidelines, which were released in Feb 2015, stipulate that any cream that doesn't contain sodium lauryl sulphate (the ingredient in aqueous cream which causes the problem) will be fine. Some departments may recommend E45/Epimax or another cream but basically anything that you already use at home will do the trick nicely. Kate",
      "MessageIndex": 3,
      "PostDate": "11/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108970/aqueous-cream-and-radiotherapy",
      "Title": "Aqueous cream and radiotherapy"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Hi Fiddlesticks, I know it's not the same as going shopping yourself, but there are a number of websites that specialist in post surgery bras and do some lovely pretty ones - loads better than M&S has to offer. Unfortunately, they also charge a bit more for them too!   For cheap and cheerful, Asda have some post surgeyr bras that have had some good reviews.  Just remember, as with any bra, you get what you pay for, so a £6 Asda bra isn't going to last as long as one of your £40/£50 ones. Try Amoena, Nicola Jane, Woman Zone, Royce, Anita, Eloise",
      "MessageIndex": 29,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113017/bras---rant",
      "Title": "Bras - rant!!!!"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Lakeslovers is completely right.  When you've had the other side treated, they need to fully replicate the treatment fields to see where they fell then plan your new treatment to make sure there is a gap between the radiotherapy beams.  If the lump was more towards the middle of your body, this can sometimes be very tricky and take a bit longer than a standard breast plan (which they would allow 2 weeks for anyway).    Bear in mind that after your treatment is planned, it then needs to be checked by a physicist then the data transferred to the treatment machine and checked by 2 radiographers.   So, it just means that the planning took a bit longer but now it will be going through the checking process ready for the 19th.  It happens quite a lot so don't worry.",
      "MessageIndex": 2,
      "PostDate": "16/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109092/radiotherapy-date-changed",
      "Title": "Radiotherapy date changed"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "You could also try   www.woman-zone.co.uk www.aboutthegirl.co.uk www.eloise.co.uk www.nicolajane.com   Obviously, these are all mail order so it might take you a few gos before you find one that you're happy with.  Have a Google to see if there is a lingerie shop in your local area. Most will have some post-mastectomy fitting experience and be able to advise you on what to look for. Good luck!",
      "MessageIndex": 4,
      "PostDate": "28/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100464/pretty-post-mastectomy-bras",
      "Title": "Pretty post mastectomy bras????"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Hi Bettyboob, My sister-in-law had chemo last year for a grade 3 breast cancer.  She has lifelong diabetes, lupus, fibromyalgia and has had several TIAs (mini-strokes).  They took a long time to decide whether chemo would be appropriate due to her other health conditions. Eventually chemo won out, and luckily she tolerated it quite well.  I don't know enough about Addison's disease to comment, but if you have something that effects your kidney or liver function that is a big sticking point as that's your 'filtration system' for getting rid of the chemo.  Make sure you ask for the exact reasons why they have decided against chemo so you are fully informed. Perhaps they would press ahead if you were grade 3 but feel the the risk is too great for a grade 2?  As mistymoley says, the oncologist will have weighed up the risks and the benefits for your individual case, but if these haven't been gone through with you in detail, I can understand your concerns.",
      "MessageIndex": 2,
      "PostDate": "07/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107535/refused-chemotherapy-due-to-other-illnesses",
      "Title": "Refused chemotherapy due to other illnesses"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Ah, that's great news Teresa. I'm so glad you managed to get the result you wanted.   Have a wonderful time! x",
      "MessageIndex": 16,
      "PostDate": "14/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107774/delaying-radiotherapy-for-a-few-weeks---could-it-be-detrimental",
      "Title": "Delaying radiotherapy for a few weeks - could it be detrimental?"
    },
    {
      "AuthorID": "Macrad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/macrad",
      "Content": "Hi Peatree, Don't let your oncologist pressure you into this.  You should really have a minimum of a 3 week gap between chemo and radiotherapy. You blood counts will still be low immediatly after chemo and so you will still be at risk of neutropenic sepsis,and slower healing times.  Starting RT just one week after chemo does not sound sensible to me.  If you have had surgery and chemo, and they have declared you 'cancer-free' (woo-hoo!)  then the RT is really just belt and braces, an insurance policy if you like, to reduce the risk of anything coming back.   Yes, it will also destroy any tiny cells that the chemo didn't get (unlikely, that stuff reaches everywhere!), but I really don't think that 2 weeks here or there will make a big difference. Talk to your BCN and see if you can discuss it again. You won't enjoy your holiday as much if you are tired/sore/sensitive from the RT and there is a lot to be said for quality of life and how relaxed you are in how well you fare through this whole expereince. Have a fantastic holiday!",
      "MessageIndex": 13,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107774/delaying-radiotherapy-for-a-few-weeks---could-it-be-detrimental",
      "Title": "Delaying radiotherapy for a few weeks - could it be detrimental?"
    }
  ]
}