{
  "AuthorID": "mae",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mae",
  "Posts": [
    {
      "AuthorID": "mae",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mae",
      "Content": "Hi I've yet to work out how to do anything other post in the discussion here - darn my dinosaur on line skills. I am due my first Taxotere tomorrow having had three FEC so am well interested in the posts on here and the advice. In all fairness I have not found the side effects of the FEC too bad but am somewhat dreadintg the Taxotere. It seems hubby has been researching also and has plans for keeping me mobile - there was a mention of canal walks - I suspect he may be disappoointed!! Hannah, I would echo what other people have said in advising your mum seeks as much help/support as possible  from the professionals in dealing with the side effects. In clinic on Tuesday the Cancer nurse advised that dependent on any side effects there was a variety of help (aka medication) available - so get mum, not to suffer, but to try and get whattever is available to alleviate the pain if not the fatigue. LoneFox I am 52,if it helps am happy to let you know how I find it. I don't know in what respect your husband is findinf it difficult to cope so have no advice on this to offer. Mine can sometimes super irritate me by telling me how lucky I am. I know that compared to many I am................I just sometimes don't feel it!",
      "MessageIndex": 5,
      "PostDate": "17/11/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44163/taxotere-pain",
      "Title": "Taxotere pain"
    },
    {
      "AuthorID": "mae",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mae",
      "Content": "Hi I only had the initial ulatrasound following which a biopsy was carried which confirmed it was cqancerous. My lumpectomy followed very quickly - a week after I was given the diagnosis (the surgeon had a clear diary following leave hence the speed).",
      "MessageIndex": 3,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44960/lumpectomy",
      "Title": "Lumpectomy"
    },
    {
      "AuthorID": "mae",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mae",
      "Content": "Sorry to hear you have had such a nightmare. I think it must vary from area to area. On my first pre-chemo clinic I was given the details of a (fairly) local wig provider and simply visited the shop and all I had to do was provide details and sign a form. Luckily I was very happy with one they had in stock so didn't need any adjustments and walked away with it there and then. I would concur that wig supplying comes via the oncology side rather than the breast care side so you really need to contact your oncology unit I think. Although I had elected for the cold cap at the next pre chemo clinic the cancer nurse made a point of checking that I had sorted the wig side out.",
      "MessageIndex": 3,
      "PostDate": "26/11/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44740/wigs",
      "Title": "wigs"
    }
  ]
}