{
  "AuthorID": "MaggsT",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
  "Posts": [
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Peartree I am now 11 months post-chemo (6 x TC) and still have joint pains that make me walk like an old lady, particularly first thing in the morning or when I get up from sitting on the sofa for a while.  I have seen my GP and also spoken at length with my BCN and the general consensus seems to be that the chemo (particularly the lovely Docetaxel) can continue to cause side-effects for up to two years after finishing it.  So it may be this that you are experiencing. This may not be what you want to hear, but the way I am looking at it is that if it continues for up to two years, I can count down to the end of the pain!  I am also receiving support from the counselling service and the fatigue clinic at my local hospital, and one of the things the counsellor is going to do is hypnotherapy.  So it may be worth looking into whether anything like this is available in your area. Hope you're feeling better soon Maggs xx",
      "MessageIndex": 3,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115816/5-months-post-chemo---terrible-debillitating-joint-pain-is-it-normal",
      "Title": "5 months post chemo - terrible, debillitating joint pain. Is it normal..."
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Jackie I had WLE & SNB in November and after a few weeks I started to use my old deodorant (Nivea spray) again as I felt that I smelled sweaty (my husband and children said I was imagining it, but I really would hate to smell offensive, so had to do something about it.  The only thing I did until I was certain that the scar had fully healed was stick a plaster over it whilst I sprayed and for a minute or so afterwards so that I knew it was fully dry.  Nobody told me I should do this, it just made sense to me to make sure that the spray couldn't get to the scar until I was certain it was properly closed. Maggs x",
      "MessageIndex": 6,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103429/deodorant",
      "Title": "Deodorant"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Fairyelephant Just wanted to say that different hospitals do things in different ways.  Some offer a one-stop shop with the results there and then, whilst others send biopsy samples away and give you the results at a later appointmen.  The timescale at my own local hospital is that you get your biopsy results 2-3 weeks after the biopsy is taken - this is so that if it is cancer, they know a lot about what type/grade/etc and can present you with a treatment plan at the same time as your diagnosis.  All will do a biopsy unless they are pretty certain that there is nothing to worry about, which means that not all biopsies end up with a cancer diagnosis.  I would say always take your mum or someone else very close with you and tell them to ask any questions they think of, that you haven't already asked (I always take my husband or one of my three grown-up children and have found that it's really helpful to go for a coffee with that person and discuss what we've been told before going back and telling the rest of the family - it gives us a chance to make sure we've both understood things correctly and that we know what;s going on. Hope the news is good though, and that you don't need all this advice Maggs xx",
      "MessageIndex": 7,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105567/first-appointment-tomorrow",
      "Title": "First appointment Tomorrow"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Pauline I don't know about eyebrows, but I found a recipe for a massage oil on the internet that I am using on my scalp and my hair is growing really quickly.  I don't think I'd dare use it on my eyebrows, in case I get it slightly wrong and end up with them in the wrong place!  Anyway, here is the recipe in case you want to give it a try:  50ml Sweet Almond Oil, 8 drops Rosemary Essential Oil, 6 drops Lavender Essential Oil, 3 drops Clary Sage Essential Oil - all mixed together. Good luck Maggs xx",
      "MessageIndex": 3,
      "PostDate": "22/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105603/eye-brow-regrowth",
      "Title": "Eye brow regrowth."
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Rosalyn I would get the pains checked out - your BCN may be the best person to talk to in the first instance.  As to the numbness, I had my first breast cancer diagnosis 12 years ago, and had numbness down the back of my arm for many years (probably 8 - 10).  This is quite normal and is apparently due to nerve damage when they are taking the lymph nodes. Hope all is sorted quickly for you Maggs x",
      "MessageIndex": 2,
      "PostDate": "05/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103293/is-this-normal",
      "Title": "is this normal???"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi everyone I have been suffering with sore and stiff hands since starting on anastrozole in December. Today whilst shopping in Asda (seasonal/garden department) something caught my eye. It was a fairly solid rubber bounce-ball, about the size of a tennis ball and with glitter inside that moves (like in a snow globe). After comparing them all, I bought one with red glitter (the colour is probably irrelevant, but I like it!!!). This ball is a revelation. Tonight watching television I'm just moving the ball from hand to hand, rolling it around, squeezing on it, moving my fingers across it piano-style; and already my hands feel better. My husband (former professional rugby player) tells me physios use things like this all the time, but it is a revelation to me so I thought I'd share in case it helps anyone else. Much love Maggs xx",
      "MessageIndex": 0,
      "PostDate": "25/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107121/sore-hands---revelation",
      "Title": "Sore hands - revelation!"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Glad you're liking the oil, Fiona - it really does smell fabulous doesn't it. I'm sure my hair has benefited from it, as it is really growing quickly now. I hope you start seeing some fabulous results (as well as smelling gorgeous!) really soon Maggs xx",
      "MessageIndex": 2,
      "PostDate": "30/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107121/sore-hands---revelation",
      "Title": "Sore hands - revelation!"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Fiddlesticks The scalp oil is something I found on the internet, when researching natural products that stimulate hair growth.  The recipe is: Mix together 50ml of Sweet Almond Oil, 8 drops of Rosemary Essential Oil, 6 drops of Lavender Essential Oil and 3 drops of Clary Sage Essential Oil.  Then, all you do is massage it into your scalp every 1-2 days after showering - hopefully it works (and I believe it has helped my hair), but if not then at least your head will smell absolutely gorgeous!  I bought my oils from Amazon, but I know that some other ladies on here have bought them from places like Holland & Barrett.  My oils cost less than £10 (for 250ml of the Almond and a 10ml bottle of each of the essential oils, so it's not expensive and I have loads left. Hope that if you try it, you like it and it works for you. Maggs xx",
      "MessageIndex": 4,
      "PostDate": "31/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107121/sore-hands---revelation",
      "Title": "Sore hands - revelation!"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Jen Is there a time of day when you have this pain?  I'm just wondering whether it could possibly be cramp?  After my first bout of breast cancer I had excruciating pain in my shins at night.  When I saw my doctor, she told me that it was cramp (this surprised me as cramp is muscular.  But apparently, although the big muscles are in your calves, there is also muscle tissue in front of the shin bone).  I was prescribed with Quinine Sulphate tablets and the pains went away pretty quickly.  I stopped taking the quinine when I was on so many meds during chemo for my second bout, but started getting other cramps in my feet and legs again earlier this year, so am back on it again.  It may be worth asking if this could be the problem. Hope you're sorted soon Maggs xx",
      "MessageIndex": 5,
      "PostDate": "28/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118535/random-aches-and-pains",
      "Title": "Random aches and pains"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Maggie Dot I had lumpectomy, FEC & radiotherapy for breast cancer in my right breast TWELVE years ago and am still going strong.  I was diagnosed with breast cancer again last year but this time it was in the left breast and completely unrelated (i.e. not a recurrence - I have the BRCA2 gene mutation and so this is what was behind the illness both times.  For my second go, I had TC, lumpectomy & radiotherapy and now have no evidence of disease.  I accept that the treatment isn't pleasant, but I would absolutely say to anyone I your situation to go ahead and have all the treatment they want to throw at you - I don't think I would still be here if I hadn't had the treatment. If you want any further information, please ask - either on this thread, or message me. All the best, whatever you decide Maggs xx",
      "MessageIndex": 3,
      "PostDate": "21/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112167/is-there-anyone-who-had-fec-chemo-and-radiotherapy-for-breast-ca-and-is-about-5-10-years-on",
      "Title": "Is there anyone who had FEC chemo and radiotherapy for breast Ca and..."
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi all Just wondering how other people have coped with aromatase inhibitors.  I started on Anastrozole in early 2016, and got a lot of pain in my hands and feet.  At that time, I wasn't sure whether it was a lingering side effect of the docetaxel, or whether it was due to the Anastrozole.  When I saw by consultant in January 2017, she said that this pain was due to  the Anastrozole and swapped me onto Letrozole,  I also started on Alendronic Acid shortly afterwards.  A couple of months ago I started getting pain in my hip, legs and lower back, which doesn't get better with exercise or with rest, wakes me up at night and doesn't respond to the paracetamol that was recommended.  I thought it might be due to the Alendronic Acid, but made another appointment at the hospital to find out.  This morning saw a registrar who told me that the Alendronic Acid will actually reduce the pain not cause it, and that the pain is due to the Letrozole.  He then asked me which of the two AIs was more tolerable for me and explained that I must stay on an AI because these are keeping the cancer at bay.  He asked me whether I'd rather stay on the Letrozole or swap back onto the Anastrozole, which I found a very difficult question to answer - after all, how do you decide which pain you'd prefer, when what you really want is no pain at all.  I have decided to go back onto the Anastrozole as the hand pain will probably interfere less with my mobility, but I will see how I get on.  He also told me to take the full daily dose of paracetamol and then supplement it with something else as needed - starting with Ibuprofen and potentially moving up through Co-codamol, Tramadol and if necessary Oramorph.  I really don't want to live my life on painkillers.  Has anyone got any suggestions on the AIs or the pain control please? Maggs xx",
      "MessageIndex": 0,
      "PostDate": "27/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134594/anastrozole-letrozole-joint-pain",
      "Title": "Anastrozole/Letrozole & Joint Pain"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Gaynor I had 6 cycles of T, which finished in early October. My nails started loosening whilst I was still having my chemo. So far I have lost 2 fingernails and 2 toenails, but several more are still loose. I hope yours decide more quickly what they are doing! As regards care, I'd recommend keeping them short so they don't catch on things and hurt you and wearing gloves whenever you can - I have gloves everywhere - cotton ones for sleeping in, disposable ones for when I'm cooking or looking after the animals, marigolds for doing the dishes and soft comfy ones in my handbag for when I'm out and about. And just watch out for signs of infection, which would make your nails quite sore and would need treatment. And paint them whatever colour you like, as long as it's comfortable to do so! (just not gels) x Maggs x",
      "MessageIndex": 7,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103562/nails",
      "Title": "Nails!!!!!"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Fran Sorry to hear you've joined the second-time-around club, I have also been there although my scenario was slightly different to yours (my second cancer - 11 years later - was on the other side).  However, I just wanted to tell you that in my experience, things have moved on since we had breast cancer the first time - both in terms of treatment and even more in the handling of side-effects, which I found much easier to cope with the second time around. Have they told you what treatment you'll be having yet?  If you know that, it will help us to answer your question more adequately. Much love Maggs",
      "MessageIndex": 4,
      "PostDate": "26/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132415/breast-cancer-2nd-time-around",
      "Title": "Breast Cancer 2nd time around"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Yes, I am also suffering this.  I am now 12 months post chemo (6 * TC) and it is not yet really settling, but my GP has said it could take longer.  In the meantime, I try to be as kind to my feet as possible and find very soft fluffy socks (day and night!) quite gentle for them (Aldi have them in at the moment, I think they call them \"lounge socks\").  I have also resorted to Crocs, although this was initially because I couldn't bear anything touching my toes when my nails were coming off, and Crocs have quite a bulgy front on them.  I have gone for \"kitchen crocs\" (also known as \"chefs' crocs\" or \"bistro crocs\", I believe) as these do not have the pattern of holes in the top and so they are better when outside in these murky winter months.  The other benefit of crocs is that they can easily be removed - I am sitting at work with my crocs beside me and my feet relaxing in their fluffy socks! I have also been wondering about gel insoles, so please keep me posted on whether they help. And when my feet are really sore, I find massaging them with a warming massage oil quite comforting. Sending love & hugs Maggs xx",
      "MessageIndex": 6,
      "PostDate": "17/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116537/sore-feet-peripheral-neuropathy",
      "Title": "Sore Feet/ peripheral neuropathy"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Emma Your Oncologist has a variety of different chemos to offer you, depending on what he/she sees in your test results. I've played this game twice (rather too greedy for my own good!). The first time I had 6xFEC and the second 6xCT. The side effects of both were different, but I lost my hair quite early on under both regimes.  When you meet your oncologist, ask lots of questions about side-effects (nausea, vomiting, hair-loss, nails, taste-buds, etc, etc, etc) and have someone with you to log the answers. If you want to ask me anything, please do xx",
      "MessageIndex": 10,
      "PostDate": "13/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139922/lots-of-questions",
      "Title": "Lots of questions!"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Laura Hope your mum is doing OK.  I have tried both FEC (6 cycles, 13 years ago) and Docetaxel (6 cycles, 2 years ago) and can assure you that in my experience Docetaxel was the better of the two.  I suffered with nausea, sickness and generally feeling wiped out on FEC but had no nausea or sickness whatsoever on tax.  The main side-effects of Tax I did experience were bone & joint pains, tiredness, sore fingernails & toenails (I lost some of both, but not all) and the yukky mouth thing.  But these were nothing compared to what I remember from FEC.  My main advice on either regime would be go to bed when she gets home from her treatment and stay there until at least the end of the following day, as I found that rest really helped with the side-effects of both. All the very best and well done for looking after her so well Maggs xx",
      "MessageIndex": 10,
      "PostDate": "21/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127291/mum-starts-docetaxel-soon-for-stage-3-breast-cancer-any-advice-ladies",
      "Title": "Mum starts Docetaxel soon for stage 3 breast cancer. Any advice ladies..."
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Redd Sorry to hear you're feeling like this.  I know, having been there, that having to go through the cancer thing twice is absolutely the pits. I was \"lucky\" on my second time round in that it hadn't spread, but I'm sure I would be feeling the same way you are if it had.  And like you, I would probably find it difficult to discuss my feelings on treatment with my family - they (probably quite understandably) want me to have every treatment offered, regardless of side-effects, as they want me to stick around - but I think if my cancer should return again or spread, I would reach a point where that didn't feel like the best option for me.  Ultimately it's your decision, but I would suggest the following as a possible course of action: talk to your oncologist about the proposed new chemo - what is it? what is he hoping to achieve from it? what are the side-effects? how often will you have to have it, and for how long? armed with this information, talk to someone like your bcn or macmillan nurse (here in Hull, we have a wonderful place called the Oncology Health Centre, which is staffed by people trained and experienced in the psychological side of cancer, and if you have something similar I would suggest going to them instead) If you are still unsure or need to discuss things more, maybe share some of the above information on here and see what your fellow cancer-buddies have to offer once you have had these conversations, you will probably have made a decision which you are comfortable or can cope with. This will hopefully be the point where you can talk to your nearest and dearest, to tell them what you have decided and why. I hope the above ideas are of some use - even if you decide that they are not for you. Much love Maggs xx",
      "MessageIndex": 3,
      "PostDate": "06/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/130025/not-wanting-anymore-treatment",
      "Title": "Not wanting anymore treatment"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Blue I too have had cancer in both breasts (the right one in 2004 and the left one last year).  On both occasions I had some, but not all, nodes removed.  After last year's operation, I received a leaflet from the hospital telling me how I must avoid injections, injuries, blood being taken in \"the affected side\".  However, I had never received such information after my operation in 2004 so have happily been having blood taken from my right arm since 2004 with (touch wood!) no problems - even the hospital take it from my right arm! So depending on when you had your first cancer, I would suggest maybe ringing your BCN and asking whether you can have blood taken from that side now. Hope you are successful Maggs x",
      "MessageIndex": 5,
      "PostDate": "30/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111190/blood-tests-in-foot-due-to-node-removal-on-both-sides",
      "Title": "Blood tests in foot due to node removal on both sides."
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Just thought I would say that my eyesight has also deteriorated since chemo, and the first deterioration in my eyesight was after my first cancer.  As phoenixmoon's mum is discovering, this deterioration can be quite rapid - not the gently decline we might expect with age.  I don't qualify for any assistance with the cost of glasses or lenses, but I totally agree with you George that it's about time this side-effect is recognised and addressed - we have quite enough to cope with, without then having to spend a small fortune on eye tests and glasses.  The reason I have commented is to try and start a \"log\" somewhere in the system so that maybe someone relevant will see that there is a problem and do something about it",
      "MessageIndex": 2,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121844/repeat-eyetests",
      "Title": "Repeat eyetests"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Well done for raising this subject Karen. I had 6 * FEC the first time I had breast cancer (12 years ago) and 6 * TC the second time (last year).  Yes I had (and still have) some side-effects with the Docetaxel, but it was far easier to come with than FEC was.  And I read on here last week about people who didn't respond to the \"T\", but that doesn't mean it doesn't work for everyone - when I had my surgery in November, they found I'd had a Total Pathological Response to my chemo, i.e. the TC had totally blasted the enemy out of existence, so I am happy to be able to confirm that it works. Hope this puts some people's minds at rest Maggs xx",
      "MessageIndex": 14,
      "PostDate": "18/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112013/taxotere-please-stop-panicking",
      "Title": "Taxotere.........please stop panicking!"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "You are so right scareyclarie I ended up using a knife or screwdriver to open ring pulls,cardboard boxes, stock cubes etc - not sure how safe that was, but needs must!!!! Maggs xx",
      "MessageIndex": 9,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123405/nails-on-t",
      "Title": "Nails on 'T'"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Jane I had gels and my nails became sore and wobbly towards the end of my chemo.  Getting the gels removed from wobbly nails was quite a painful process, so I would strongly recommend getting your gels removed as soon as you can.  In fact, the chemo nurse who did one of my later treatments said that she would have advised me at the start to get my gels taken off. Do not despair though, I have found a nail polish that is far closer to gel-quality than the rest (i.e. I put mine on last Wednesday and only 2 nails are chipped, despite the rough workout my hands get).  It is called Sunset Nails, and you just paint on two coats of colour and the special top coat and it \"cures\" in daylight - stronger than normal polish but removable with ordinary nail polish remover, with no scraping or shoving.  I have just had a look online and it is about £4.99 a bottle.  There are about 15 or 16 colours available, so you could buy a couple of colours and also the all-important topcoat for the cost of having your gels redone.  I am now 15 months post-chemo and still two of my nails are not strong enough to take gels, so I can't live without these polishes! All the very best Maggs xx",
      "MessageIndex": 4,
      "PostDate": "05/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120751/nail-care",
      "Title": "Nail care"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi JMC Yes I had that too, I lost some of the affected nails but kept the rest - not sure what that's all about!  I would suggest keeping them cut short and wearing gloves to protect them as much as you can (I had disposable gloves for odds and ends around the house, mega-cheap fleece gloves for everything outside and my trusty marigolds for dishes, cleaning, etc).  Also, if you start to notice any additional soreness or any smell (a sort of sweaty-feet smell in my experience), go and see your GP or chemo team as it would suggest a fungal infection for which you will need medication. Incidentally, I am now 16 months post-chemo and one of my big toenails is still purple and bruised-looking, although not painful at all.  The flip-flop season is approaching - thank goodness for nail polish!!! Hope your nails hang on Maggs xx",
      "MessageIndex": 5,
      "PostDate": "16/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123405/nails-on-t",
      "Title": "Nails on 'T'"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi jojo As a couple of others have mentioned, the genetics process begins with a questionnaire and consultation, and may then proceed to a blood test - all pretty painless! There is quite a lot of counselling involved, which is good. My own situation is that I have twice had er+ pr+ breast cancer; my mum, grandmother and several aunts all died due to bc and my niece was diagnosed in 2015 at the age of 27 - neither of us were surprised to find out we were brca2 and to us it was almost a relief as it made sense of things. I have not had a mx as my consultant felt it wasn't the best option in my case. I have however had my ovaries and tubes removed. If you want to know anything else, please ask Maggs xx",
      "MessageIndex": 18,
      "PostDate": "07/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120880/genetics-testing",
      "Title": "Genetics testing"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Noodles As a mum of a daughter getting married in 12 days, my advice would be that if your mum says don't postpone then you shouldn't.  If my daughter's wedding had occurred during my treatment, I would still have got there and joined in her day.  In fact, I made it to my niece's wedding during my treatment and wouldn't have missed it for the world. The only suggestion I would make would be to discreetly put things in place in case your mum needs a lie-down or anything.  For example, if your wedding reception is at a hotel or similar venue, let them know the situation and ask if they can make a room available for her - given the circumstances (and what you are undoubtedly paying them for the day), I would hope that they would do this for little or no charge.  And then, once you've arranged it, just let your mum know that the facility is there if she wants it, but that she doesn't have to use it. Hope the rest of the planning goes brilliantly Maggs xx",
      "MessageIndex": 5,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128022/help-wedding",
      "Title": "Help: Wedding"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Bev i had 6 x Cyclophosphamide/Docetaxel last year and suffered with a sore mouth and horrid taste.  I found that Difflam mouthwash and Gelclair (both available from your oncologist on prescription) were really helpful, but if these don't work there are apparently other things (also available on prescription) that may help.  The key is to tell your oncology team about every side-effect so that they can deal with it. I also found that I needed to eat and drink different things at different times during the three week cycles.  Food-wise I needed more taste, but sometimes that was spice, sometimes salt and sometimes sweet - it really was a trial and error thing.  And drink-wise, I amassed a collection of different drinks that appealed to me at different times.  These drinks included Soda with alcohol-free mojito syrup, orange juice (neat or with grenadine syrup to \"soften\" it), plain water, soda water, lime & soda, tonic water, elderflower cordial, schweppes elderflower tonic, ribena and Irn Bru - quite a collection to keep on the shelf/in the fridge. Hope your mouth is feeling better soon Maggs xx",
      "MessageIndex": 16,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106373/sore-mouth",
      "Title": "Sore mouth"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi noodles I found with docetaxel that the main side effects (stiff & achy joints and bones) came in the first week, and by week 3 I was actually feeling fairly well. So I would suggest that your wedding date falls pretty well for her. I also feel that if your mum wants to go, she will make sure she gets there. As I suggested in my previous post, try and arrange a quiet space for her to have a lie-down if she needs one. Also, involve her in the planning as much as possible, but try not to give her any too-tiring jobs (I made a friend's wedding cake mid-way through my chemo, which I probably shouldn't have!!) All the very best for your wedding planning. Maggs xx",
      "MessageIndex": 11,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128022/help-wedding",
      "Title": "Help: Wedding"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Mistia Please don't worry about losing it.  It is part of how we handle this thing.  I too consider myself normally to be a strong person - a wife and mum who the family can lean on - but I had a major meltdown early in my treatment.  Mine happened at about 9.15 one morning, when all the family were out at work and I was alone.  I had gone back to bed because I didn't feel well and then suddenly the tears started and wouldn't stop, and I absolutely howled and sobbed uncontrollably.  For reasons that I still don't know, my husband popped home from work at about 9.30 and found me like that, and was able to sit with me, talk to me and listen to me (probably the most important bit) until I was able to cope on my own again.  That meltdown changed my relationship with my illness, and probably with my husband too, and allowed me to pick myself up and fight again.  And no, it wasn't the only meltdown, just the biggest one - so don't worry if it happens again, it is still normal. Much love Maggs xx",
      "MessageIndex": 7,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103640/had-a-wobbly-and-almost-lost-it",
      "Title": "Had a wobbly and almost lost it!"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi K Reading your post, and it could have been me writing that a year ago.  I was diagnosed with breast cancer in my right breast in 2004.  I had the full works (lumpectomy, second op for margins, chemo, radio and tamoxifen) and enjoyed 11 cancer-free years.  In 2015, I found a lump in my left breast, which was also diagnosed as breast cancer.  The team at the hospital have assured me that the second cancer was not connected to or a result of the first, I just seem to have a predisposition (I was also diagnosed with a BRCA2 mutation last year, which bears out the predisposition theory!). I just wanted to say to you that I fully understand how scary it is to face this for a second time (and after 11 years, which is a long time).  However, treatments have moved on in that time - and in particular, the management of chemo side-effects, so I didn't find it quite as awful. I finished my treatment in October and am now officially a NEDDY (no evidence of disease), so I am doing all the good things in life - like growing hair and nails again!!! If you want to talk to someone who's also been there twice, then please message me - I am happy to message with any information or support you want, as I know just how sh*t this is. Hope all your scan results come back clear and you are just fighting the one that you know about. Lots of love Maggs xx",
      "MessageIndex": 5,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112890/2nd-time-diagnosed",
      "Title": "2nd time diagnosed"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Dulcie I finished 3 weeks of Radiotherapy on Tuesday and have worked from home throughout.  I am lucky in that I have an office job that I am able to do this way (and a very supportive boss), as I the hospital and my office are in opposite directions from home and I couldn't have coped with driving to both.  I normally work 4 days a week, but am spreading my hours over 5-6 days at the moment to shorten my work time.  I am very tired: 9pm is an extremely late night for me at the moment and I sleep for a lot of the weekend too.  Like Kathleen, I have suffered shooting pains and burning - I use paracetamol for the former and gel cool-pads for the latter.  And as Helen says, we continue to cook for 2-3 weeks afterwards, which means the side effects continue for that time, so I am not going back to the office until I feel fully well, and also plan to have a phased return. Sending love & hugs",
      "MessageIndex": 9,
      "PostDate": "11/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105109/how-many-people-worked-through-rt-is-it-doable",
      "Title": "How many people worked through RT? Is it doable ?"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Juliet The waiting is always horrible.  But while you wait, I have another idea that might help you: I found it really useful to have what I called my \"chemo bag\", so perhaps you could go shopping and put one together for yourself.  Mine had the following: A pretty backpack/handbag A little pack of tissues A little pack of wetwipes A small bottle of alcohol cleaning gel A bottle of water A puzzle book or two A couple of pens A colouring book Some colouring pens or pencils A couple of multi-packs of chocolate bars A tube of hand cream A lip balm A diary or note book I also kept my chemo book and all my appointment letters in this bag, so they didn't clutter up my handbook Basically, this little bag (and, despite the long list, it was a little bag!) contained everything I might need for a trip to the hospital, for myself and whoever went with me - no matter how long we might have to wait.  So on the morning of chemo or any other appointments, I didn't have to think about what I might need, I just had to pick up my little bag.  (I also put it in the boot of my car whenever I went to work or anywhere else so that if I had any problems and had to go to the hospital, I had it with me). Hope this helps Maggs xx",
      "MessageIndex": 7,
      "PostDate": "03/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106091/start-of-chemo",
      "Title": "start of chemo"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Liz The first time I had breast cancer (11 years ago), I was told that I would lose my hair and advised to get it cut shorter.  However, I refused to believe that I would lose my prized long hair, and when it started to fall out I was devastated.  I had to go to my poor hairdresser and get it shaved, as it was creating havoc around the house. This time around (diagnosed in June), I knew that they were telling the truth when they said it would go.  I got my daughter to cut it into a short bob immediately (she did a really good job, considering she is a farmer not a hairdresser!).  Then, when it started to come out in handfuls, I gave her a call and she came back and shaved it for me.  Losing your hair is quite uncomfortable physically and very uncomfortable psychologically, and having tried both ways I would certainly recommend taking charge and getting it cut short initially and then shaved when it starts to go.  And giving it to a charity to help someone else is a lovely idea - well done for even thinking about it when your brain is probably all over the place. As for the nails, dark-coloured polishes help some people, but not all.  I think it probably depends on how much of the dreaded \"T\" you have to have.  My niece had FEC-T and managed to hang onto all of hers, but I had six lots of Docetaxel and am still losing mine, even though I finished my chemo in October.  So I would say try the nail polish, but be prepared that it doesn't help everyone.  One thing I would caution against, however, is gel nails.  I have had gels for a few years now, and absolutely love them.  However, I developed a fungal nail infection as my nails loosened (round about cycle 5, I think) and getting my gels removed from sore and wobbly nails wasn't pleasant - nail polish would have been so much more comfortable!) All the very best Maggs x",
      "MessageIndex": 11,
      "PostDate": "29/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102992/hello-newbie-here",
      "Title": "Hello Newbie Here"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Helsbels & Pennymoon I never knew that there was an increased likelihood of getting it again on the other side - nobody ever mentioned that to me! As Pennymoon says though, constant vigilance is the key - I was 11 years between my first primary and my second.  In my case, however, genetics definitely play a part as I was tested after my second diagnosis and found to be BRCA2 (all the more reason for me to be vigilant) Maggs xx",
      "MessageIndex": 11,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123609/increaseed-risk-of-cancer-in-other-breast--why",
      "Title": "Increaseed risk of cancer in other breast -why?"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi mistyblue The genetics test depends upon your circumstances. In my case my mother, grandmother and two aunts had died as a result of breast cancer and my niece was diagnosed just before my second diagnosis. So there was a clear family link, which is why I was tested. If you don't have this kind of family history, you may not qualify for it, but it's worth asking the question. If you have any other questions, just ask. Maggs xx",
      "MessageIndex": 16,
      "PostDate": "21/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123609/increaseed-risk-of-cancer-in-other-breast--why",
      "Title": "Increaseed risk of cancer in other breast -why?"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "thank you Shellb. What you have said makes a lot of sense to me. It is so hard to think straight when you have this illness isn't it. I am definitely going to ask for an oophorectomy, as ovaries are rather uncheckable - and at 52, I'm pretty confident that I've finished with them! And I will then be able to decide with a clear mind, as you did, whether I want to live with my breasts or whether I'd be happier without them. Thank you again xx",
      "MessageIndex": 2,
      "PostDate": "15/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101240/brca2-with-breast-cancer---surgery-options",
      "Title": "BRCA2 with Breast Cancer - Surgery Options"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi All I don't know if anyone else is in the same situation, but would welcome some feedback if there is anyone else like me.  I currently have breast cancer for the second time (right breast 11 years ago, left one this time) and have also recently been confirmed as BRCA2 positive.  I have finished my chemo (which shrank it significantly) and will be having surgery in just over a week.  I was expecting, given my BRCA status and the fact that this is my second diagnosis, that a double mastectomy would be the logical option.  However, the doctors have said that because I have now had it twice, I am at greater risk of metastatic disease than of a third breast cancer and so they only want to do a lumpectomy.  I have got my date for this operation and will go ahead with it because I want this cancer removing.  However, I am still not sure about the mastectomy option.  Has anyone else been given similar (or different) advice? Maggs x",
      "MessageIndex": 0,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101240/brca2-with-breast-cancer---surgery-options",
      "Title": "BRCA2 with Breast Cancer - Surgery Options"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Just read your post and can identify with it.  I had breast cancer in my right breast 11 years ago and, like your wife, went through surgery, chemo and radio.  After 11 years of living my life again (well, apart from a couple of false alarms, which I'm sure lots of us get).  Earlier this year I found a lump in my left breast and, after being fast-tracked through the system, was again diagnosed with breast cancer.  However, the positive to this is that they were able to tell me that this was a new cancer, in the other boob, completely unrelated to what I had 11 years ago.  This means that \"all\" I was fighting was another primary - the same thing as I'd beaten 11 years ago, which made it far more manageable in my mind.  I have had chemo and surgery, and am awaiting the results of my surgery (which I should get just before Christmas).  Then, if all is well, I will have radiotherapy in January and start on the Tamoxifen (or equivalent) again.  So, although I have had all the usual emotional ups and downs, I feel that all is well and I will beat it again. Hope all goes well with you both Maggs xx",
      "MessageIndex": 1,
      "PostDate": "30/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101898/we-think-it-s-come-back",
      "Title": "We think it's come back"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Wendy The ingredient in Tonic Water that helps avoid cramps is Quinine, but different brands have different quantities.  Rather than rely on this, my GP has prescribed Quinine tablets, which really help avoid my leg cramps.  The other advice she gave me was: Make sure my fluid intake is high enough (although I tried a little too hard with this and ended up running to the loo all night, which didn't help my sleep either!) Drinking Tonic Water (with or without Gin!) in addition to the Quinine tablets can't do any harm On nights when my legs hurt at the time I go to bed, I give them a quick massage with a warming oil (rosemary is my favourite), which seems to help a little bit too. Hope your legs are feeling better soon Maggs xx",
      "MessageIndex": 4,
      "PostDate": "24/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116940/anastrozole-leg-cramps-and-tonic-water-information-please",
      "Title": "Anastrozole leg cramps and tonic water. Information please."
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Misty I had 6 * Docetaxel in 2015 and lost most of my eyebrows and about half my eyelashes together with every other hair I possessed.  The other main side effects for me were tiredness & painful bones/joints and losing some fingernails & toenails (in fact, the toenails are still coming off, even though I finished in October!  However, I have to say that even though they are horrid, these side effects are all worth it in the name of kicking breast cancer's butt.  And on the plus side, I suffered no sickness or nausea on Docetaxel (I had 6 * FEC the first time I had breast cancer, 12 years ago, and the overriding thing I remember is the awful sickness if gave me). Look after your nails as well as you can - dark polish but not gel, nail strengthener (Sally Hansen's Hard as Nails or similar), but be prepared that they may be unkind and leave you.  I wonder, however, whether this is less likely when you are getting three cycles of if instead of the six I had? All the very best with it all, sending love Maggs x",
      "MessageIndex": 6,
      "PostDate": "06/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104842/fec---t",
      "Title": "fec - t"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Just to add to the question on the \"blue book\", here in East Yorkshire we have a red book, that appears to be the same thing! Maggs x",
      "MessageIndex": 9,
      "PostDate": "19/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105430/macdonalds-milkshake",
      "Title": "MacDonalds milkshake?"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Pinkus88 I had a Mirena coil prior to BC (in fact, I had it from before my first BC, but nobody suggested changing it!).  After the chemo for my second BC (both mine were ER+ PR+ but HER-), I went to see my GP and she agreed with me that I would be better using something else.  I am somewhat older than you (53), don't have periods and have blood-tested as post-menopausal but my GP didn't want to take any risks as the chemo can cause temporary changes in fertility, so she swapped my Mirena for a copper coil (planned to keep it for a year or so) - yes they are still available!  I had some discomfort for the first few weeks (stomach cramps, etc) but now it just sits there quietly and I don't even know it's there so maybe that is an option for you after all? Coincidentally, however, I have a BRCA2 mutation so am having my ovaries and tubes removed next month as a risk-reduction measure and will never again need the coil. So I think what I am saying is that there is a convenient contraception option, but that if you are never going to have children then sterilisation may be the way forward.  With you being so recently out of treatment, why not ask for a copper coil for a while, just to let your body have a breather, and then go and ask to be sterilised?  That way you could perhaps get the best of both worlds! Good Luck Maggs xx",
      "MessageIndex": 4,
      "PostDate": "16/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114966/sterilisation-to-save-reoccurance",
      "Title": "Sterilisation to save reoccurance"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Aligog I think all families have at least one person like this.  In my case it was my elder daughter (age 25) who kept saying things like \"it might not happen\" or \"so & so didn't lose their hair\".  I couldn't discuss it directly with her as her comments were having a very negative effect on my state of mind and at the same time I didn't want to upset her.  I dealt with the problem in two ways: Firstly I found a family member with a more realistic outlook (I was lucky, this was my husband, but it could have been anybody), I explained to him how these comments were making me feel and how, whilst I wasn't sure whether they were meant positively or just naive, were actually really difficult for me to handle; I asked him to explain this to her very gently and to ask her not to make these comments directly to me.  The second thing I did was actually involving the family in my treatment, so my husband accompanies me to appointments with the surgeon, my elder daughter takes me to appointments with the oncologist, my younger daughter takes me to chemo and my son holds the fort at home and steps in if anyone else can't make their \"designated appointment\" (he has a greater understanding, having been through this with me before - I only met my husband and acquired the daughters nine years ago!).  This has really helped as all family members have heard all the horrid stuff directly from the hospital staff and have been able to ask questions of them not me such as \"will that definitely happen?\" or \"when will that happen?\"  I hope one or both these ways of dealing with things will help you. The journey we are on is terrifying, but you will get through it.  Losing my hair was one of the things that I have found most difficult, but I have travelled this journey previously (eleven years ago) and I can confirm that it will definitely come back.  However, as I write this, I am wearing a hat to cover the bald head that has come from my current round of chemo - I am very self-conscious about it and it really feels like I will never be normal again, even though I know it will.  I think what I am saying here is even though your brain may know these things, don't worry about being worried, it is perfectly normal and once your treatment actually starts and the side effects start to kick in your family's perception will probably change too. All the very best Maggs x",
      "MessageIndex": 4,
      "PostDate": "07/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99542/family-in-denial",
      "Title": "Family in denial"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Scotland I had 6 lots of docetaxel and did lose some nails, but it wasn't as traumatic as I'd expected, although they were a bit sore at times. My suggestions are gloves (fleecy, disposal or woolly depending on the situation), apply Sally Hansen 'hard as nails', if you have gel get it removed before starting the T (nail varnish is good though), use a good hand cream and keep an eye open for signs of infection (soreness and/or smell) xx",
      "MessageIndex": 6,
      "PostDate": "02/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107330/chemotherapy-on-tuesday",
      "Title": "Chemotherapy on Tuesday"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Scotland I had 6 lots of docetaxel and did lose some nails, but it wasn't as traumatic as I'd expected, although they were a bit sore at times. My suggestions are gloves (fleecy, disposal or woolly depending on the situation), apply Sally Hansen 'hard as nails', if you have gel get it removed before starting the T (nail varnish is good though), use a good hand cream and keep an eye open for signs of infection (soreness and/or smell) xx",
      "MessageIndex": 21,
      "PostDate": "02/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107330/chemotherapy-on-tuesday",
      "Title": "Chemotherapy on Tuesday"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Lamg I'm afraid Docetaxel may well hit you with quite a wallop (as it has), but the aches & pains don't tend to last for more than a week in my experience - and at least it doesn't tend to induce nausea or vomiting! As I understand it, Docetaxel is generally given every three weeks, but people who struggle with it may be given the option of weekly Paclitaxel instead (which I believe is a less strong version of the same thing). I had 6 x Docetaxel & Cyclophosphamide and in my case, whilst I had plenty of unpleasant side-effects, it was infinitely preferable to the 6 x FEC I had the first time round. If you have any doubts or worries, please talk to your oncologist, I was told by one of the Oncology dept nurses that we shouldn't have to suffer any major side-effects as there is medication available for most if not all of them. Hope you're feeling better soon. Maggs xx",
      "MessageIndex": 3,
      "PostDate": "02/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128028/taxol-do-not-know-the-full-name",
      "Title": "Taxol (do not know the full name)"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Jen It is possible to work, but it depends on what work you do and how you are affected by your treatment - the latter you will only know once your treatment has started. The first time I had breast cancer I was working with animals and children, and had to stop work as I kept getting infections.  The second time, I was working in an office and my wonderful boss got a link put on my computer so I can work from home whenever I want.  There was no pressure on me to work, it was just what I wanted to do and as I was able to work at home, I only actually missed three days during the whole of my treatment. Hopefully you will be able to work, if this is what you want to do. Sending hugs Maggs xx",
      "MessageIndex": 6,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107552/work-during-treatment",
      "Title": "Work during treatment"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi there Yes I had this both times!  The first time round I had surgery first and, like you, they found the second lump in the bit they'd removed, which meant that there wasn't a big enough margin and I had to go back and have more removed.  The second time (11 years later) I had chemo first, but was sent for scans before starting chemo and those showed two further lumps (as it turned out, one of these was cancerous and the second was not).  So you are not abnormal in this! Hope all goes well with your MRI and second surgery and that you can soon get on with the rest of your treatment. Much love Maggs xx",
      "MessageIndex": 2,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134920/another-lump-found",
      "Title": "Another lump found"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Edwina In the short term I'm adrafr it's a case of drawing them on. If you go to a Look Good Feel Better workshop, they will give you a suitable pencil (among other things) and teach you how to use it so you don't look permanently surprised. If there isn't a workshop near you, ask one of the advisors on the make--up counter at your local boots or department store. Once you are well clear of treatment, hopefully they will come back (most people's do). However if they don't, I can absolutely recommend microblading, which I've recently had done as my brows steadfastly refused to grow. Good luck on your return to work Maggs xx",
      "MessageIndex": 4,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159020/eyebrows-and-eyelashes---what-do-you-do-when-they-are-gone",
      "Title": "Eyebrows and eyelashes - What do you do when they are gone??"
    },
    {
      "AuthorID": "MaggsT",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maggst",
      "Content": "Hi Bjez This is indeed a side-effect of having no nose-hair (which of course is in itself a side-effect of your chemo!).  I found two products that really helped.  One is a gel called Happinose which has all sorts of lovely soothing things in, and the other is a stick (like a lip-salve) called Nosor.  Both of these products are really gentle and soften the skin whilst also having a gentle decongestant effect.  I couldn't find either in my local chemists, so I bought them on Amazon in the end. Hope your nose is feeling better soon. Maggs xx",
      "MessageIndex": 12,
      "PostDate": "12/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122680/sore-nose",
      "Title": "Sore nose"
    }
  ]
}