{
  "AuthorID": "Mags22",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
  "Posts": [
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi Jackie!   My mum was also diagnosed in March with TNBC! On FRIDAY 13th!!! She also finished chemo and her tumour was 2.4cm originally! Just like you, she was suppose to have surgery on the 2nd sept! But it's moved to the 10th now! She wants a double mastectomy! How did you feel going through chemo? And how are you? I hope you do update us on your journey! Will add you as a friend if that's ok? Mum is awaiting her genetic testing! As TNBC a could potentially be genetic if it runs in the family! Best of luck! From both me and my mum xxxx",
      "MessageIndex": 6,
      "PostDate": "23/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97931/any-triple-negative-survivors-willing-to-calm-me-down",
      "Title": "Any Triple Negative survivors willing to calm me down!!??"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi beautiful ladies! Just an update, my mum is 12 days post her first ever chemo. She is on the T from the FEC part first. Today she said her hair is falling out in chunks. So I guess we need to get the clippers out. One problem... She's allergic to the metal in the clippers lol she gets a horrible rash! And she already has one on her kneck!  It has to be done but I know this will be a tough experience and I have a feeling we all might cry a little!  How did you all find the hair part? How hard or maybe even easy was it for you?",
      "MessageIndex": 0,
      "PostDate": "04/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93691/it-s-happening--hair-loss",
      "Title": "It's happening- hair loss"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Thank you so much! My mum says her hair isn't a problem for her because she knows it will grow back! But I know she is touched by it even though she says she isn't! She is beautiful with/without hair. I think my dad and my brothers might find it harder then she will. But I got her a wig the other which is stunning lol I dont think she can wait until she can start wearing it! Thanks Weeble.  Good advice on the washing the head thing. That will Deffo probz be better. ",
      "MessageIndex": 3,
      "PostDate": "04/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93691/it-s-happening--hair-loss",
      "Title": "It's happening- hair loss"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "This made me teary but in a good way! I am so happy you are a survivor! You battled through it and now you can spend even more time with your amazing children! ",
      "MessageIndex": 3,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93141/i-am-a-survivor",
      "Title": "I am a survivor!!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hello ladies! My mum is experiencing stabbing pain in her right lung, when she moves her arm. Ever since she was in hospital and they told her she has coarse bronchovascular markings in her right lung. Have any of you had any similar experience? We will speak to thr onco Doctor on Wednesday before her chemo, but we're just worried it might be something else.... She had a ct scan 4 weeks ago and that was clear, but I know how evil Cancer can be... p.s she hasn't had any surgery yet",
      "MessageIndex": 0,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93993/lung-pain",
      "Title": "Lung pain."
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Thank you Lynda",
      "MessageIndex": 2,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93993/lung-pain",
      "Title": "Lung pain."
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Good on you! I love the fact how your allowing to make it happen and not the chemo! :D I couldn't believe how amazing the wigs are nowadays! I think my mum will make it her new hobby buying new wigs during chemo! ",
      "MessageIndex": 17,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93031/my-hair-has-finally-decided-to-leave-the-building",
      "Title": "My hair has finally decided to leave the building!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Good on you! I love the fact how your allowing to make it happen and not the chemo! :D I couldn't believe how amazing the wigs are nowadays! I think my mum will make it her new hobby buying new wigs during chemo! ",
      "MessageIndex": 2,
      "PostDate": "18/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93031/my-hair-has-finally-decided-to-leave-the-building",
      "Title": "My hair has finally decided to leave the building!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi ladies my mum has been diagnosed with triple negative BC. Today I had a sneak peak of her documents and its says tested positive for invasive carcinom? What is that? Is it worse when you for TNBC???? Also they said mum will never know her stage or grade because she has had chemo first! She also started chemo with Docxetal first then going onto FEC? It all makes me things it worse! When I asked the onco doc she didn't wanna say much...? ",
      "MessageIndex": 0,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94961/invasive-carcinoma-never-no-stage-given",
      "Title": "Invasive carcinoma&never no stage given?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Perfect thank you! And yeah she has two visible tumours in her lymph nodes. She had her scans ct and bone scan clear everywhere else apparently.  yeah I did ask before doctor said after surgery but today the oncology doc said nevet. I think they know but don't want to tell the grade. Thank you for your info! So helpful! Hope you're well ",
      "MessageIndex": 2,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94961/invasive-carcinoma-never-no-stage-given",
      "Title": "Invasive carcinoma&never no stage given?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "I'm glad you are bad work and sorry that mentally things are still tough. I don't blame you. I don't know how my mum acts so strong around us. I would be crying so much! Yet she only cried when she told my brothers and dad. What do you do for living if you don't mind me asking? It's nice to speak to some one who was/is literally in the same boat as my mum! I wish she knew English to be on here and speak to everyone! ",
      "MessageIndex": 4,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94961/invasive-carcinoma-never-no-stage-given",
      "Title": "Invasive carcinoma&never no stage given?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Good luck Lou for Thursday",
      "MessageIndex": 13,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi Ali!!! yeah mums doing fine! Felt a bit achy the last couple of days but I think she's okat! She seems it! Unless she told you I don't think anyone would know that there's something wrong! I'm fine too thank you! Had my birthday yesterday which was a nice day! :) brilliant yeah would be nice to speak to a girl my age! What's her username, do we know? :) How are you doing Ali?",
      "MessageIndex": 155,
      "PostDate": "11/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Ah June! It's crazy to think that 3 months ago today my mum went to see a nurse to tell her she found a lump. Today she is days away from her 3rd chemo! I'm glad it's moving all fast. I'm still confused to why mum didn't have surgery first and wasn't put on FEC first and then T. It all seems like we hardly know much about the cancer itself, other than two lumps in the lymph nodes and one in the Breast.  I alongside with my mum just want to wish you all the best in June. Another hard month ahead but nothing you ladies can't battle through. Also I was thinking but I don't know it would work, but setting up a Radiotherapy Club, just like the chemo club. I know with rads you go in every day if I'm correct? Would it be beneficial for ladies going through this? Or is there one already going, that I just haven't clocked on.",
      "MessageIndex": 2,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Yeah sounds tricky! I don't know much about radiotherapy! No idea when mums would be! Or how it works! my biggest wish would be that by 2016, 1 Jan this all could be over and we never have to return to the oncology department again! I think mums chemo would end somewhere in the last week of August but that's give or take they might give her more chemo then just 6 sesh! She's having her bloods tomorrow! So hope her white cells are fine! Who else is having chemo this week?  Xxxx",
      "MessageIndex": 8,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi Trish, Mum is doing good, there's not been a day when she hasn't stopped! I think it's a way to distract herself from reality? She says she's achy, but she does more than me! Which puts me to shame! I try my hardest to help but she wants things done her way Ahaha. My brother moved out and I think that upset her a bit but she's now redecorating his room! How are you Trish? Other than emotional?? How you feeling Karin after Mr T? I hope you're okay! My mum is having her heart scan on 26th on the day when FEC should start? But last minute I think? Will she get her answer on the day? Also she has her mammogram and ultra sound tomorrow at 9:45am ! I am so scared! We need good news! Hope all you beautiful ladies are all doing okay! Wishing you all luck xxx",
      "MessageIndex": 221,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi Brenda! Me and mum are wishing you all the best for tomorrow! So greatful for technology that can allow this to happen!  SO..... Today mum had her mammogram/ultra sound after her 3 session of Mr T and it's good news!!! The two lumps in her lymph nodes have vanished! And her lump is nearly the size of the marker chip they inserted! So basically nearly gone! It was 2.5cm before! The doctor said mum looked fab and he assumed my mum finished her chemo by now! Nope half way through! & going strong. She apprciares every singel advice from this forum! Means a lot to both of us! She has her onco appointment next wed, then heart scan and hopfully moving onto 1st FEC on Friday 26th! Has anyone one else had their half way through chemo check? Who's having chemo this week? Tomorrows suppose to be really hot, anyone planning anything nice? wishing you all the best! ",
      "MessageIndex": 233,
      "PostDate": "16/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Trishell- Hi sorry for the late reply! I'm glad you feel better now!  I think she has the MUGA Heart Scan on Friday,  A bit worried because it's too check whether she can take FEC, but it's only an hour apart, so no idea how that work?! I phoned, and asked but the lady didn't know, I don't think she got my question! Had a good weekened! I hop you did too, I celebrated my 2nd year uni results! Let us know how your ECG goes! Is Herceptin the tablets? Ali Owl- Hello! Sorry once again for a the delay in replying! Mum is fine. She feels more tired, and still has her aches here and there Especially in her feet. She says its tingling sensation. She had her first ever ulcer too! However she say's she been lucky with her side effects, as it doesn't limit her daily life \"before cancer\" other than just working less at work. I think she worried about how FEC will be to her! I hope all is okay, we have 4 hospital appointments this week! How are you? Did you do anything nice this weekend? HAPPY ANNIVERSARY Karin! Hope both of you had a fab weekend! Love from both me and my mama :) How you feeling at the moment? Sorry to hear about your infection :( Amanda- me and my mum are slightly (okay very jealous) that you live in Portugal! Must be so beautiful there! I know mum loves the heat, she always struggled with joint pain, but going away to a hot country, it eased the pain for her! The same with my best friends mum, she has MS and she always goes on holiday as it eases the pain.  Also just read the posts about friends, It's a shame... Really is, my mum said times like these you always find out who really is there for you!  Everyone had a good weekend so far? Anyone do anything nice for Father's day? I went bootsale with my dad, sold some old goodies!  Sending hugs to all of you! from us both!",
      "MessageIndex": 312,
      "PostDate": "21/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "My mums T takes an hour. Usually were in there for 1hr30 mins +/- it goes rather quickly! They give her some sodium into her first I believe ???? I think. Then at the end a small bag of something to flush chemo thru! If thata any help to anyone! Her next chemo sesh will be at the maternity unit as Ipswich Hospital oncology Center is being all done up! Means more people can have chemo etc done, there's only 12 chairs atm I think, and they will make it to 30! Looking forward to future patients being able to have a fresh new oncology center but I hope mum never needs to return there! ",
      "MessageIndex": 145,
      "PostDate": "11/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi Von, Mum is on steroids just like you before chemo, she still drives. She just is extra careful, however im usually in the car with her. Steroids just give my mum more energy, and she's more agitated on them!",
      "MessageIndex": 156,
      "PostDate": "11/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi ladies! I want to see this film myself, asked few of my friends but unfortunately they don't seem up for it. No pressure though as we all different. I would go with my mum who obv went through Breast cancer but doubt she'll understand much off it due to the language barrier! I do however agree with you about having a happy Breast cancer film! Has anyone seeing Decoding Annie Parker? It's about the BRCA gene. It has sad bits but if I remember correctly the main character survived. I study film at UCS. So maybe one day I can make a positive film! You are all such an inspiration alongside with my mum! ️Xxx",
      "MessageIndex": 4,
      "PostDate": "29/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99301/miss-you-already",
      "Title": "Miss you already"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi beautiful ladies! Birty, sorry to hear about you getting DVT! I hope you feel better soon. I also hope Debbie you feel better now you are home! Nadjie, mum is okay, more tired than usual and achy. Was going to do something tomorrow for my birthday but I think I'd prefer if she rests up. You can tell that the third chemo is getting to her. Pain wise she's alrighr, she did take 3 codein yesterday due to pain in her back. She also slept downstairs and she gets so aggigtated with my dad. He fidgets a lot in bed. I don't think he understands that mum needs some space bless him. Do any of you ladies all have that? ive realised my mum sometimes needs time to herself. She's getting agitated with constant \"are you ok\" I would too! other than running low on \"energy\" (even tho she stills cleans the house, goes shopping and work! Crazy huh) she's doing okay! I was locked out my account for few days. I forgot my password woops! Also got a phone call today and they are moving muns genetic screening a month early! We sent off the letter with all the relatives names who have Cancer and few days after they call. We going on the 7th July. They said they want to do it before surgery.  Nadjie & Karin you have chemo this week right?",
      "MessageIndex": 111,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi Ladies!!! How is everyone this beautiful evening? me and mum went in today waited 2 hours thinking our appointment was at 10:30... Her appointment was at 11:30! There was an hour delay! From now on we are so checking the times before we go Ahah so silly of us heheh Mum had her 3rd round of Docextal today! She's having mammogram and ultra sound in the next week or so! To see if she needs any more of Mr T. Then if all good then bring on the FEC! Unfortunately we weren't told that we had too book weeks in advance the chemo for the 2nd half and mum will have her next round of chemo 2 days then her usual day which will be Friday 26th which she is extremely gutted about. Also I had a sneak peak in her documents today and it said carcinoma postive! What's that?  Sororet ty that we haven't posted muchh recently! Mum is keeping us all busy! I see new names appear on here! Just wanna say best of luck to all you! ",
      "MessageIndex": 63,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Thank you Nadjie and Chrissie! I had a fantastic day :) Hope chemo went okay for everyone Who had it today! Xxxxxx",
      "MessageIndex": 140,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Good luck Karin! I hope it runs smoothly for you, well as smooth as it has bee for my mum! She's been extrs tires!  Thank you you guys for the birthday wishes! I will send Emily a message, I hope she won't mind :)",
      "MessageIndex": 164,
      "PostDate": "11/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Oh no! Sorry to hear your energy levels are low. Do you find it painful at all? How many sessions have you got left? Aww bless you! Me and mum always emotional these days, while watching tv! However sometimes, it feels good? or am I just weird? lol Take care and thank you! Hugs back at you too! xxxxxx",
      "MessageIndex": 314,
      "PostDate": "21/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hello beautiful ladies!  Seems like ole majority of you are going onto T now! Mum starts her FEC on Friday! I think she's worries it'll be tougher than Mr T! The lump went down from 24mm to 10mm apparently! Anytips for FEC? I could prepare my mum for? If it's any help mum said on T as soon as u feel pain in ur joints and it gets bad then check ur temperature and then take pain killers! Massages helped her too! I don't know what FEC does to ur taste buds but mums we're going dodgy on T! Taste went off! Always had to have flavoured water! Also T made her hands extremely dry, so just moisturisers a lot! Im sure the side effects are the similar, (maybe?) but thought i share some things mum had. Good luck to everyone!  <3",
      "MessageIndex": 344,
      "PostDate": "24/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Well done to her! That's brilliant! I was going to do the pretty muddy race this year but I want to find a different way of racing money for triple negative BC foundation! You must be ever so proud of her! I'm wishing you all the best xxx",
      "MessageIndex": 1,
      "PostDate": "10/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93998/race-for-life",
      "Title": "Race for Life"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Thank you! I just wanted a clear answer like yours! I'm very flattered thank you xx",
      "MessageIndex": 2,
      "PostDate": "06/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93824/stage-after-chemo",
      "Title": "Stage after chemo?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Me and my mum got told that we won't know what stage the Cancer is at until the operation. However my mum is having chemo first then surgery, so if the chemo shrinks the tumor (which I hope it will) will we know still what stage the cancer was at? All we know so far is that there's a 2.4cm lymp in the Breast and 2 small cancerous lumps in the lymph nodes. She's got triple negative breast cancer. Sorry this might sound dumb, but for weeks I wondered. Also can we know what grade the cancers at? Or is that through surgery as well? The doctors haven't really told us much about the cancer itself other than TNBC. Hope your all feeling fab!",
      "MessageIndex": 0,
      "PostDate": "06/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93824/stage-after-chemo",
      "Title": "Stage after chemo?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hello beautiful ladies! Yesterday, was the happiest day of my life! My mum got the all clear after her WLE and lymph nodes removal! They said there was absolutely no sign of Cancer left and that the chemo did an amazing job! Now just radiotherapy, 18 sessions and I hope to God that she will never, ever have to return for any more treatment! & that she will continue staying healthy! I just want to say thank you from both me and mum to all you ladies who supported us! I know I haven't been on here regularly but you guys supported us! I just wish you all the best! And will keep you all updated on my mum! Through radiotherapy and what not!  Xxxx",
      "MessageIndex": 0,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99102/good-news-mum-got-the-all-clear-after-surgery",
      "Title": "Good news! Mum got the all clear after surgery!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Feeling the love & support from you all! Both me and mum are happily overwhelmed with all the kind words! I am so happy that today is a day for majority of you ladies to get good news! I hope you ALL have a brilliant weekend!  Me and mum are going Essex with the family, for the Burnham on crouch carnival! So will celebrate there!  Xxxx",
      "MessageIndex": 14,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99102/good-news-mum-got-the-all-clear-after-surgery",
      "Title": "Good news! Mum got the all clear after surgery!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Thank you Ladies means a lot xxx",
      "MessageIndex": 4,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99102/good-news-mum-got-the-all-clear-after-surgery",
      "Title": "Good news! Mum got the all clear after surgery!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Thanks! Carnival was lovely! yes, Jrip mum is having rads. Got her CT scan plan next week, I think she's having 18 sessions, targeted to 3 places. Yes TNBC too!  Nadjie, how's you? & treatment going? Xxx",
      "MessageIndex": 19,
      "PostDate": "28/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99102/good-news-mum-got-the-all-clear-after-surgery",
      "Title": "Good news! Mum got the all clear after surgery!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Yay! Glad they dropped it to less rads! Mum has her CT prep scan with tattoos next Tuesday the 6th got my fingers crossed for both! We will be thinking about you! Xxxx",
      "MessageIndex": 24,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99102/good-news-mum-got-the-all-clear-after-surgery",
      "Title": "Good news! Mum got the all clear after surgery!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "That's brilliant, so what's next for you? Is that all the treatment done? or are you also having radiotherapy? If I remember correctly you already had surgery before chemo? Xx",
      "MessageIndex": 21,
      "PostDate": "29/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99102/good-news-mum-got-the-all-clear-after-surgery",
      "Title": "Good news! Mum got the all clear after surgery!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "My emotions are still fresh we only got the result of the scans yesterday! My mother is such a strong woman but even she was worried! It's just human nature. Sometimes it's annoying to hear stay positive but that's literally all you have to do. From what I know it's standard for them to do scans :) just to rule anything out! Please update on how it all goes! ",
      "MessageIndex": 3,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92981/scans",
      "Title": "Scans"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Usually they take 10 days? I think. My mum had an appointment on the 22nd of March, when they said she needed scans. She had her bone scan, and ct scan and blood test. They said she needs to come back on the 15th April for the results. So I think they will usually arrange a meeting with you and tell you the results. Maybe ask your BC nurse? ",
      "MessageIndex": 6,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92981/scans",
      "Title": "Scans"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "My mum got told that she had to have them because they found the lump in her lymph nodes! I think it's standard? They just need to double check. My mum got her cat scan and bone scan come back clear. She has regional cancer which is in her breast and 2 lymph nodes. I hope your scans comes back fine too! I know how worrying the wait can be, but just stay positive! X",
      "MessageIndex": 1,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92981/scans",
      "Title": "Scans"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi Nina, So sorry to hear this. Must be so hard having to relive everything again, but both me and my mum have our fingers crossed for you, and hopefully it's nothing more than just a normal cyst. My mum has been diagnosed with Triple Negative Breast Cancer, it's in her lymph nodes too. So I'm sure she understand the frustration, especially waiting for the biopsy. She had her ct scans/bone scans and I remember how stressful that was! There' a possibility she needs another scan due to her lungs! People like you, who have beaten cancer are such an inspiration to people like my mum who are going through cancer! and for the family as well. No matter what the outcome is, you'll just have to stay strong, which I'm sure you know about as you've beaten cancer before, which is amazing to hear. My mum's manager, his wife went through cancer three times! and she's still here today. Beat it every single time! Our mind is a beautiful thing and it can heal a lot! However, I don't doubt for a second how hard this is for you and your family! Please keep us updated! I hope to God it's nothing serious!",
      "MessageIndex": 7,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93543/waiting-for-biopsy-result",
      "Title": "Waiting for biopsy result"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "I wish your sister all the best in the future! With your support and the loved ones your sister will feel so much better! I haven't got cancer myself but my mum is diagnosed with TNBC and unfortunately she can't speak English so I use this forum to not only help myself to understand things, but mainly for my mum. When you have cancer the whole family has it too. Such a horrible disease! I personally would say carry on posting on here, especially if it helps you and your family. I can't express how much of a help this forum has been and I've only been on here for a week! xx",
      "MessageIndex": 8,
      "PostDate": "21/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93136/am-i-allowed-to-join---or-would-you-prefer-this-group-to-be-just-patients",
      "Title": "Am I allowed to join - or would you prefer this group to be just patients..."
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hello beautiful ladies! Long time no post. Hope all those ladies my mum shared her chemo journey with are doing brilliant! & Good luck to all you other ladies who are starting this Journey, or half way through! My mum finished her chemo this Friday, just gone.  Everyone seems pleased with how well she coped! The doctor said they can't feel a lump no more! She has another appointment on the 21st, with the surgensand mammogram! Then hopefully surgery on 2nd Sept! Just wanna say how useful this club has been not only to my mum but to me too! I'm sorry recently I haven't been as active. I do think about you all every day! So does my mum! Love to you all! ",
      "MessageIndex": 76,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "I hope someone replies, i would also love to get hold of my mums results! As we still are in unknown about certain things!",
      "MessageIndex": 1,
      "PostDate": "21/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95707/how-do-i-get-copy-of-pathology-report",
      "Title": "How do I get copy of pathology report?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Oh deary me Karen! I feel for you! So much stress! I don't see why they just couldn't refer for you for a biopsy in the first place? Would save so many trips to the hospital etc! I'm sorry to hear your mini getaway just ended up being stressful! It's silly how sometimes different doctors/wards just DON'T communicate! It make this journey a little bit harder! Sending you love from both me and my mum! Update us! and we got out fingers crossed for you! Hopefully you'll have your surgery soon, and the liver is just going to be nothing major!",
      "MessageIndex": 3,
      "PostDate": "11/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94050/please-help-me-i-need-advice-regarding-reconstruction-being-cancelled-for-the-second-time-for-the-same-reason-my-liver",
      "Title": "Please help me ( I need advice regarding reconstruction being cancelled..."
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hi Ladies, Quick question. Is it normal for my mum to start growing when shes currently on her 2nd round of Docetaxel (Taxotere) She starts her 3rd round on Wed. She hasn't had FEC yet, but after the first round of T her hair fell out, but now mum says that her armpit hair is growing, also I can tell it has grown on her head too. I heard a rumour years ago that if your hair isn't falling out then chemo isn't working? Most likely a silly myth?",
      "MessageIndex": 0,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94839/hair-regrowth-during-chemo",
      "Title": "Hair regrowth during chemo!?!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Thank you Crystal! This whole chemo is so anxious! More for my mum even though she doesn't show it! the what if's etc! Thank you for putting out mind at rest! Hope you are doig well! :) xxx",
      "MessageIndex": 2,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94839/hair-regrowth-during-chemo",
      "Title": "Hair regrowth during chemo!?!"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Okay! Thank you ladies! My mum isn't a seafood kinda lady anyway! Does anyone if there's like a healthy recepy book for people on chemo? Like healthy meals you can prepare etc? I would love to join in too alongside with my mum and eat healthier! ",
      "MessageIndex": 4,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93150/marker-clip-and-chemo",
      "Title": "Marker clip and chemo?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Thank you ever so much everyone! Brilliant advice and links! I feel like all you ladies are the nurses! I was concerned about the food because my mum adores Polish foods and they can be a bit heavy at times! I think I'm more anxious then my mum about this bless her! She's so brave! I literally have not heard her complain one bit! The only time she cried is when we found out it hasn't spread and when she told my dad and brother. I have a feeling she will cry again when she tells my older brother who lives in the US! Which is perfectly normal. I'm so ready to help her fight this and everyone else around her feels the same and mainly my mum ofc!",
      "MessageIndex": 12,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93150/marker-clip-and-chemo",
      "Title": "Marker clip and chemo?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Hello ladies! Here we go again me with my questions! my mum starts her chemo FEC-T on Wednesday. However, we just received a phone call from the breast clinic telling us my mum needs the marker clip (chip) inserted into her lump... Tomorrow?!!! I asked the lady if that's okay considering she starts chemo the next day and that she'll be on steroids and she said it should be ok but she isn't sure and we need to ask oncology. So I tried phoning my oncology nurse but I think she went home so I phoned the oncology dept. they also had no idea and I think I spoke to 3 nurses and they said they're not sure but to call my mums onco nurse tomorrow! We dont want to go all the way to the hospital if it's something they can't do? Like surely it won't heal properly if she's on chemo? Or am I being dumb? I will deffo call my mums onco nurse tomorrow morning to make sure but it's a bit confusing!  another q: what can my mum eat on the day of chemo? It stars at 2pm. We're stillconfused to what she can or cannot eat. Thanks and sorry for the Q!!!",
      "MessageIndex": 0,
      "PostDate": "20/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93150/marker-clip-and-chemo",
      "Title": "Marker clip and chemo?"
    },
    {
      "AuthorID": "Mags22",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mags22",
      "Content": "Brilliant! I havent been on this forum for long, and I'm usually posting for my mum but I get very happy reading about beating cancer! X",
      "MessageIndex": 9,
      "PostDate": "16/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92971/survivor",
      "Title": "survivor"
    }
  ]
}