{
  "AuthorID": "Maisymoo1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maisymoo1",
  "Posts": [
    {
      "AuthorID": "Maisymoo1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maisymoo1",
      "Content": "Thank you so much - stay strong x",
      "MessageIndex": 16,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127630/good-news-story-for-a-cold-tuesday",
      "Title": "Good News Story for a cold Tuesday"
    },
    {
      "AuthorID": "Maisymoo1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maisymoo1",
      "Content": "Hi there. I was diagnosed with grade 2 invasive on June 6th. I am now 2 weeks post surgery and last Friday received the most wonderful news that the surgeon had cleared it and there was no lymph node activity. I cried more that day than when I was told I had bc.  I have my oncologist appointment Wednesday but it is likely to be radiotherapy and hormones.  It has been the hardest and most emotional roller coaster I have ever been on. One day you feel invincible and positive in the extreme the next day you are worrying about how your other half will manage without you. All I can offer you is to go with the flow, you will be in great hands with your team, don't read everything you can get your hands on it will just confuse you further.   Waiting for the next appointment is the hardest thing to do without worrying but as each of us is different just take simple pleasure in that you are in the system and though it will take time you will get through this.  Lots of hugs. Michelle x",
      "MessageIndex": 8,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113070/i-have-just-been-diagnosed-with-invasive-ductual-carcinoma-stage-2-grade-2",
      "Title": "I have just been diagnosed with invasive ductual carcinoma stage 2..."
    },
    {
      "AuthorID": "Maisymoo1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maisymoo1",
      "Content": "Thank you so much. Good luck - stay strong",
      "MessageIndex": 15,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127630/good-news-story-for-a-cold-tuesday",
      "Title": "Good News Story for a cold Tuesday"
    },
    {
      "AuthorID": "Maisymoo1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maisymoo1",
      "Content": "just 12 months ago I joined the club no-one wants to join. At the height of all the emotional and physical roller coaster my partner asked me to marry him. His reason - \"because I love you more than this thing can throw at you and together we can have a good go at beating it. It hasn't been plain sailing, and I consider myself one of the lucky ones. Last week the good old Tamoxifin threw me another curve ball - so I'm off for yet more investigations. BUT the real good news is I get married this Sunday I can't express how grateful I am to have made it through to this day, as the usual head gremlins take over on more than one occasion! ok I might have a consultant appointment for two days after, but everything can be dealt with. Please all you ladies who have been recently diagnosed and the world seems at its blackest - Have hope, keep smiling through and keep strong, take one day at a time and remember I'm off to walk up the aisle just 12 months after diagnosis , sobbing my heart out every step of the way with an overwhelming happiness. ",
      "MessageIndex": 0,
      "PostDate": "25/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127630/good-news-story-for-a-cold-tuesday",
      "Title": "Good News Story for a cold Tuesday"
    },
    {
      "AuthorID": "Maisymoo1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maisymoo1",
      "Content": "Hi. I'm 14 days out of 15 in. Tomorrow being my last day. I was one of the lucky ones, got through to last Saturday without too many issues and any that presented themselves (got unrelated infection) were treatable and totally 'doable'. Then on Saturday I was hit by a freight train doing 100 miles per hour, the damned thing then reversed and added a steam roller just to make sure. After spending the last three days horizontal Im starting to feel ok again so am sure it is only short lived. During my rads I've started a new business (kept me occupied and out of mischief) which as its a market stall it has taken a fair bit of physical activity and early mornings. I've also planned a wedding, booked a holiday and a honeymoon, and thrown a big engagement party. I've managed it all until Saturday - the moral of this is 'stay busy, stay positive and keep going, your body will tell you when it needs to rest'. Good luck and keep strong Xx ps. I used R1R2 (prescription from doctors) as a cooling gel and moisturiser - seemed to work. ",
      "MessageIndex": 8,
      "PostDate": "27/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115443/rads---panic",
      "Title": "Rads - Panic?"
    }
  ]
}