{
  "AuthorID": "MammaP",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mammap",
  "Posts": [
    {
      "AuthorID": "MammaP",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mammap",
      "Content": "Thank you seaspirit44, just about to take the dog out for a walk, no hills today though! xxx",
      "MessageIndex": 4,
      "PostDate": "17/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176595/two-cancers-four-tumours-and-a-gsoh-just-saying-hello",
      "Title": "Two cancers, four tumours and a GSOH! Just saying Hello!"
    },
    {
      "AuthorID": "MammaP",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mammap",
      "Content": "Thank you ronstar! Yes, I’m looking forward to getting the next op out the way before summer arrives, I’m planning to do a sky dive in June to celebrate! xxx",
      "MessageIndex": 5,
      "PostDate": "17/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176595/two-cancers-four-tumours-and-a-gsoh-just-saying-hello",
      "Title": "Two cancers, four tumours and a GSOH! Just saying Hello!"
    },
    {
      "AuthorID": "MammaP",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mammap",
      "Content": "Thanks Happyfeet, I have been very lucky re side effects but I think being able to talk and laugh about it all with friends and family is the thing that’s getting me through. Also staying away from ‘Dr Google’ has worked well for me! What you don’t know, you can’t worry about!",
      "MessageIndex": 6,
      "PostDate": "17/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176595/two-cancers-four-tumours-and-a-gsoh-just-saying-hello",
      "Title": "Two cancers, four tumours and a GSOH! Just saying Hello!"
    },
    {
      "AuthorID": "MammaP",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mammap",
      "Content": "Hello, I’ve been reading people’s stories on this site for some time and found great comfort, hope and helpful practical information so I thought it was about time I stuck my pennies worth in. All I really have to tell is my journey so far, and say to others just starting theirs that although it seems totally terrifying at the start,  it’s not always so bad. Of course, everyone’s journey is totally unique, but here’s mine... At the beginning of 2018 I had just turned 50, I went to the gym regularly, ate really healthily, had never felt fitter. Then in February after a routine mammogram I was diagnosed with breast cancer, bit of a shocker but was told that a mastectomy and DIEP surgery reconstruction would do the trick (boob job and tummy tuck! Silver linings!) and I wouldn’t need chemo. My family and I dealt with the diagnoses as we do everything else - with a positive down to Earth attitude, by dealing with each day as it comes and lots of love and laughter. Tumour humour all the way! Which helped a lot as shortly afterwards I was diagnosed with kidney cancer in both sides. Four tumours in four weeks! It was decided that we would deal with the breast cancer first then deal with the kidneys afterwards as they were slow growing less urgent tumours that had probably been there for twenty years so could wait another six months! The mastectomy and reconstruction operation went great, a few days in hospital, lovely new left breast, no pain, I was up and about in no time, even if I was a little bent over from the tummy tuck for a week or so - well worth it for a flat tummy!, However, post surgery histology showed that it was 25mm, grade 3 invasive ductal carcinoma, ER positive but HER2 neg, and had spread to three lymph nodes,  so chemo and radiotherapy were necessary after all. This was a bit of a blow as I wasn’t expecting it and chemo was the thing that scared me the most, but, I gave myself a talking to, rolled my sleeves up and prepared for tough times ahead. I was prescribed four rounds of three weekly EC and four rounds of three weekly Paclitaxel and advised to use the cold cap to prevent hair loss. As it turned out, and I know this isn’t the case for everyone by any means, I was very lucky and the chemo was a breeze. I had no problem using the cold cap, (They swapped the three weekly paclitaxol for 12 weekly sessions  so I could continue using the cold cap), I only got slightly tired on one or two days, I had no sickness or nausea and although I did have some hair loss, it hardly showed. Life carried on as normal and cancer just became this thing that lurked around in the background. The three weeks of radiotherapy gave me no problems either. So then it was time to think about the kidney issue and the first op was scheduled for late January this year. We did the left one first and I had an open partial nephrectomy (two tumours removed through big hole in my side) three weeks ago and although it has been a more painful recovery than the mastectomy, I was only in hospital three days and I’m now up and about, albeit taking things easy. My next op on my right kidney is going to be in about four weeks and I’m still waiting to hear if the whole kidney will be removed or if they think they can just remove the awkwardly placed tumour. We will see. The journey continues... I think about everyone on here dealing with their illness and fears often and I wish everyone love and luck. Please get in touch if you want to chat xxx",
      "MessageIndex": 0,
      "PostDate": "15/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176595/two-cancers-four-tumours-and-a-gsoh-just-saying-hello",
      "Title": "Two cancers, four tumours and a GSOH! Just saying Hello!"
    }
  ]
}