{
  "AuthorID": "mandy derbyshire",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mandy-derbyshire",
  "Posts": [{
    "AuthorID": "mandy derbyshire",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mandy-derbyshire",
    "Content": "Hi Ponymad, Probably the biggest shock in your life, being told..\" yes, its cancer! \" I went numb and was sick( first time round).and I was on my own as I wasnt expecting that outcome. your brain shuts down, dosnt it. I had a WLE 9 yrs ago, followed by 4 wks Rad. clear lymph nodes, I was offerred a mastectomy at that time but I declined, that was the right choice for me at the time. Now though, Ive been recently diagnoed with breast/secondary liver cancer. local recurrance in the scar tissue from previous op..and cells have escaped and attached to the liver, so this time the breast cannot be operated on. I have found it so frustrating not being given enough information to make your decisions, in the past and now. You have to put your faith in the medical team, dont you?, cos they know what they're doing. After I flipped out in clinic, as I wasnt being told \"everything\", I've found even though the oncologist is still limiting info, the breast nurses at the hospital are there for you. You must let them know how your feeling ( they're not mind readers) and they will help you through it. I have called in to go through all the scans , tests, blood results, anything I have questions or concerns over. They have given me much information and booklets to read up on, which then enables you to ask the \"right\" questions. Also Ive been put in touch with a breastscancer support group in my area. Lotsa love Mandy xxx",
    "MessageIndex": 14,
    "PostDate": "06/08/2009",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10984/hi-newly-diagonosed-and-feeling-overwhelmed",
    "Title": "Hi newly diagonosed and feeling overwhelmed"
  }]
}