{
  "AuthorID": "Margieb",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margieb",
  "Posts": [
    {
      "AuthorID": "Margieb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margieb",
      "Content": "Hi Bippy ,I have declined Chemotherapy and agreed to go ahead with 3weeks of rads so waiting for an appointment to begin. Meanwhile the Oncologist prescribed me Letrozole  and I am on my third day.I have read a lot about side effects and it seems some brands are  causing real problems for some people. I was fortunate that the Pharmacy gave me Femara which seems to cause less side effects although it costs more. I live in Spain and our Health service which is the responsibility of the Communidad of Valencia is very good and never seems to quibble about cost. Like you my husband has been very supportive,he understands that it is really important to me to feel as much in control about my health care as possible.I think some people are surprised but I firmly believe  that each individual knows what is best for themselves bearing in mind that it is important to get all the information possible to help you understand the facts. I am 76 and feel that a course of chemo would be disastrous for me so I am very comfortable with that decision. I am also ok about rads but not so sure about the hormone therapy so I am willing to give it a go and see how I  feel . I can always decide to stop taking it. Very best wishes to you.",
      "MessageIndex": 33,
      "PostDate": "08/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127385/declining-further-treatment-after-breast-surgery",
      "Title": "Declining further treatment after breast surgery"
    },
    {
      "AuthorID": "Margieb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margieb",
      "Content": "Hi Stevi Q The Calcium was prescribed at the same time  as the Letrozole...he said it was a preventative measure because a side effect of Letrozole is bone thinning /osteoporosis. He did ask me if I had suffered with Osteoporosis but didn't arrange a bone density scan then . He said He would arrange it for January 2018 when I am due a mammogram as it will be a year after my diagnosis. The calcium is chewable with a strawberry flavour .......not bad !",
      "MessageIndex": 13,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133318/letrozole---side-effects-and-supplements",
      "Title": "Letrozole - side effects and supplements"
    },
    {
      "AuthorID": "Margieb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margieb",
      "Content": "I have been taking Femara since 6th May .I have not really experienced any side effects ,I do have very occasional hot spells but I live in Spain and it is exceptionally hot here at the moment so  I shall have to wait for cooler weather before knowing if it is a side effect. As far as joint stiffness is concerned , when you are 76 as I am most joints are a bit stiff. Overall I am really relieved as I don't feel I am experiencing any debilitating side effects! I was worried after reading how so many people were suffering after taking Letrozole.  I have read a lot about Letrozole and it seems that the cheaper brands do cause problems. I am always going to insist on Femara , here in Spain all prescriptions have the price of the drug listed,  €90 a pack , so I feel there won't be a problem. Hope it works out well for you. The Oncologist also prescribed a daily calcium supplement and said he would arrange a yearly bone density scan to check on bone thinning",
      "MessageIndex": 10,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133318/letrozole---side-effects-and-supplements",
      "Title": "Letrozole - side effects and supplements"
    },
    {
      "AuthorID": "Margieb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margieb",
      "Content": "Hi Smarchez ,I also live in Spain...on the Costa Blanca near Alicante. I am 76 so able to benefit from Spanish NHS ,which has been brilliant. I was diagnosed in January  and had a lumpectomy in early March .The tumour was 3cm ,grade 2 with clear margins and clear lymph nodes. The Medical Oncologist sent a sample of the tumour to Mamaprint which is a genomic testing service in Holland ( he told me it cost €4000 ) He explained that this would help determine whether the type of tumour was high a risk of reoccurring and would benefit from Chemo. Unfortunately it did come back as high risk of reoccurrence  and so he recommended 4 chemo sessions over 3 weekly intervals  with all the usual side effects  followed by 15 sessions of radio therapy  and at least 5 years of hormone therapy ( Femara  Letrozole ). I was really reluctant to undertake the chemo therapy ,I feel that at my age the side effects would cause  such a reduction in the quality of my life and when we looked at the survival rates after 5/10 years there really wasn't a significant difference....obviously only time will tell on this but my family supported my decision so I refused the chemo and went straight onto radio therapy This went relatively well with just some soreness at the end of the sessions. I was recommended Ureadin RXRD cream especially for radiated skin and used it liberally throughout the treatment. The Farmacia was able to order for me ...cost about €18. The staff at the Radiotherapy Centre in Elche were wonderful ! I am now in the third month of taking Femara and not experiencing any ide effects ...although I could be experiencing hot flushes but with the weather so hot here I probably wouldn't know.  Next steps are 3 monthly appointments with Oncologist ...with blood test taken the day before at our local clinic then annual mammogram and bone density scan to check any side effects from  Letrozole I would be interested to know more about your experiences and treatment and hope your appointment with the Oncologist went well and you are staying well and positive Very Best wishes",
      "MessageIndex": 35,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132766/july-2017-chemo-club",
      "Title": "*** July 2017 Chemo Club ***"
    }
  ]
}