{
  "AuthorID": "margym",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
  "Posts": [
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Happy birthday Ali Owl, hope you have a good day xx",
      "MessageIndex": 5,
      "PostDate": "14/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96529/happy-birthday",
      "Title": "HAPPY BIRTHDAY"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Well done to you all, great achievement xx",
      "MessageIndex": 10,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95086/race-for-life-done-and-dusted",
      "Title": "Race for Life done and dusted ...."
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi ladies, just a question, had dexa scan 4th June after starting Letrozole following WLE , starting 3 weeks rads 1st July. At dexa scan I asked if I would be sent copy of results, the radiologist (or whatever theyre called) just said it would be sent to my referring doctor, which I presume would be my surgeon? So many people involved and so many tests it can get confusing to know who to ask for different things. Do I now have to go to the oncologist for information or to the original surgeon or breast care nurse? Rads are being done at a different hospital to where the breast clinic and surgery was done. Do they send you a copy of the dexa results? Its all so confusing, so many people involved. Anyone have any info on this, thank you x ",
      "MessageIndex": 0,
      "PostDate": "21/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95700/dexa-scan-results",
      "Title": "dexa scan results"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thank you ladies, I shall check that out.  Nothing was mentioned to me Helen when I was prescribed vit D  about taking vit K2, however I was advised I would need a blood test 8 weeks after starting vit D to check my calcium levels  I have just had that blood test and it has come back normal",
      "MessageIndex": 3,
      "PostDate": "28/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100435/cod-liver-oil-glucosamine-for-joint-pain",
      "Title": "cod liver oil/glucosamine for joint pain"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thank you ladies, I actually got a letter from my GP practice yesterday asking me to make an appt so they must have been sent something from the hospital, last time I went to GP they didnt know anything about my hospital treatment and I had such a fuss trying to get a repeat prescription of Letrozole. I suppose all the bits of info get sent to the whole team treating you so they all know whats going on, never seen so many health professionals in my life so it can get a bit overwhelming at times!  ",
      "MessageIndex": 4,
      "PostDate": "21/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95700/dexa-scan-results",
      "Title": "dexa scan results"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi ladies, just a question regarding joint pains while taking Letrozole.  Have been on this for 6 months now and seems to be getting slightly worse, particularly pain in ankles and hands on getting up in morning.  Have read that lots of you take cod liver oil or similar to help this.  I am on prescribed vitamin D, would I need to see doctor or is it ok to just take something along with my vitamin D without seeing doctor.  Thanks, Margy x",
      "MessageIndex": 0,
      "PostDate": "26/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100435/cod-liver-oil-glucosamine-for-joint-pain",
      "Title": "cod liver oil/glucosamine for joint pain"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thats brilliant news, congratulations!!! love Margy xx",
      "MessageIndex": 16,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97535/fantastic-news",
      "Title": "Fantastic News!"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, how are you doing? Just to confuse matters I went through menopause 10 yrs ago aged 53 and am on Letrozole.  I think Letrozole and Anastrozole are both for women who have gone through menopause.  Just wondering how they decide who gets which tablet as we have both gone through menopause and are on different tablets?? Love Margy x",
      "MessageIndex": 6,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98588/anastrozole-versus-tamoxifen",
      "Title": "anastrozole versus tamoxifen"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thanks Bids24 and Dreamthief, just a case of waiting now. GP said she would ring me if anything significant on blood test but otherwise just got to make another appointment for results in couple of weeks.  Am due to go camping with family in a couple of weeks so hoping its sorted by then. Staying positive until then.  Best Wishes Margy x",
      "MessageIndex": 3,
      "PostDate": "14/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111790/chest-xray-and-blood-tests",
      "Title": "chest xray and blood tests"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Morning all,  blood test results inconclusive, GP has requested 2nd test  but just for BLS and Electrolyte profile.  I know what electrolyte profile is but not BLS.  Anyone know what that means on a blood test? Thanks Margy x",
      "MessageIndex": 4,
      "PostDate": "19/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111790/chest-xray-and-blood-tests",
      "Title": "chest xray and blood tests"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Morning all,   Just come back from seeing GP. Have been having shortness of breath and niggly cough lately so thought I'd better get it checked.  She has ordered a chest xray and blood tests which I'm having tomorrow morning.  Looks like she's checking for lots of things, liver function, electrolytes, c reactive protein, vitamin D levels and also thyroid function.  I did have an overactive thyroid several years ago but it cleared up.  A bit worried about chest xray (obviously thinking about lung mets).  My BC was diagnosed just over a year ago, wle and radiotherapy, now on Letrozole.  Suppose I'm panicking in case its gone to my lungs.  Trying not to worry but it will be at the back of my mind until results come back, 10 - 14 days for xray results but just a few days for bloods.  Keeping fingers crossed.  Regards to everyone,  Margy x",
      "MessageIndex": 0,
      "PostDate": "12/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111790/chest-xray-and-blood-tests",
      "Title": "chest xray and blood tests"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thanks for that Marlog, couldnt find it anywhere on google, Regards Margy",
      "MessageIndex": 7,
      "PostDate": "21/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111790/chest-xray-and-blood-tests",
      "Title": "chest xray and blood tests"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi everyone, just popping in to say I saw an article on BBC news this morning about research in America which says that staying on AI's for up to 15 years can reduce the chances of recurrence by up to 34%. Don't  know anything else about it but when I was started on Letrozole a year ago my bcn said I could be taking it for up to 10 years but would initially be 5 yrs.  Anyone else seen this and any thoughts? Wondered what people thought especially given that so many of us have side effects from them.  All the best, Margy x",
      "MessageIndex": 0,
      "PostDate": "06/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110068/ai-s-for-up-to-15-yrs",
      "Title": "AI's for up to 15 yrs"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thats wonderful news Mags, good luck to your mum for her radiotherapy, happy for both of you, love Margy xx",
      "MessageIndex": 1,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99102/good-news-mum-got-the-all-clear-after-surgery",
      "Title": "Good news! Mum got the all clear after surgery!"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Hulahoop,  I had lumpectomy in April and developed quite a large blood clot afterwards.  When I went for results the surgeon decided to remove it with another operation as she said it would hold up my radiotherapy treatment if it wasnt healed properly.  The surgery got rid of it, I still have a very small lump underneath where it bled again, surgeon told me it would go but may take several months but as it was small it wouldnt interfere with my radiotherapy.  Did they not try to drain it afterwards for you? The nurse attempted to with mine but couldnt get anything out. Hope it improves for you, love Margy xx",
      "MessageIndex": 1,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97571/blood-collection-under-scar",
      "Title": "Blood collection under scar"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, lets hope this is the start of healing for your poor boob!  Your holiday in Scarborough should help take your mind off it.  The tablet reactions are just something we have to live with I suppose although I find with my Letrozole that I have stiff joints in my legs in the mornings or when I have been sitting for a long time but it goes away once I start moving.  I am going to Yorkshire this weekend to spend some time with my son and his wife and 3 yr old grandson, so I'm sure he'll keep me busy!!!  Enjoy your holiday, love Margy xx",
      "MessageIndex": 3,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97836/peeling-like-a-snake",
      "Title": "Peeling like a snake!!"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Fabulous news Crystal kitty, always good to hear positive news xx",
      "MessageIndex": 7,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96029/result-of-first-mammogram-today",
      "Title": "Result of first mammogram today ..."
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Shaz,  I understand where youre coming from, I'm feeling the same.  I only had a lumpectomy and radiotherapy and now on Letrozole.  Everyone seems to think that once your treatment is finished you are back to your normal pre-cancer self and its difficult to explain to family that its not that easy.  Most of the time I am ok,just a few aches from the Letrozole and the odd funny pain in the affected breast (which I've been assured by the doctor is normal).  I have times when I am on my own and just feel down and all the 'what ifs' appear.  I  have been considering some sort of counselling, there is a Maggies centre attached to the hospital where I had my rads and they offer a 7 week group counselling course for people who have finished treatment.  Still not decided whether to go or not as part of me wants to just forget about cancer and not talk about it anymore (not easy to forget though).  Maybe it could be an option for yourself, have heard that Macmillan do a course called Moving On, perhaps it might benefit you.  Hope you feel better soon, take care of yourself, love Margy x",
      "MessageIndex": 1,
      "PostDate": "02/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99391/getting-back-to-normal",
      "Title": "Getting back to \"normal\""
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Susie, good to hear you're not having any side effects, hope I'm the same, take care x",
      "MessageIndex": 4,
      "PostDate": "26/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94619/radiotherapy-planning-appt",
      "Title": "radiotherapy planning appt"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, I'm a couple of days ahead of you in rads, I was given some cream by nurse to use twice a day but told not to use it just before treatment.  My boob started to feel hot a few hours after the second treatment and my scar was a bit itchy, no redness or soreness yet though. The cream I got is quite nice to use, not sticky and feels quite soothing, not sure if you can buy it in pharmacies but its called QV cream. On my second treatment I too had a male radiotherapist, he was nice but it felt odd as I've only seen women doctors so far, my surgeon was female too. Had a bit of a laugh with my daughter later and told her how a man was drawing on my boob lol!!! My appointments are all over the place, had my second one at 8 in the morning and I have a couple at 5 and 6 pm which is a bit of a nuisance, take care xx",
      "MessageIndex": 3,
      "PostDate": "06/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, were getting used to this now, hope your pain eases up, are they giving you anything to ease it? I haven't got any pain but boob is getting hotter and pinker with every treatment, hoping I dont get too 'sunburned' ! Take care, love Margy x",
      "MessageIndex": 12,
      "PostDate": "07/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi ladies, glad your first one went well Kathy,  its not too bad is it? I can definitely  see a change in my treated boob, its a different colour, like a suntan on one side, still not painful, I keep waking  up in the morning expecting it to be sore but its ok at the moment.  Its a bit like a hot water bottle though, lol! Well, 6 down, 9 to go, now its well under way it seems to be going quickly, getting used to organising my life around the daily appointments, going to feel a bit lost when treatments over, just thing of all that time to ourselves again, love Margy x",
      "MessageIndex": 26,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Kathy, I dont have Aloe Vera but considering getting some, lots of people have mentioned it.  I've already been started on hormone treatment, Letrozole as I'm post menopause, no problems so far, its supposed to cause joint and muscle pain but I'm ok so far, hope it stays that way, love Margy x",
      "MessageIndex": 32,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce and Kathy, well, had my 9th today so 6 to go, still feeling ok, just pink and hot but no pain, read a leaflet today while waiting for my treatment which said symptoms can carry on and get worse up to a few weeks after treatment finishes, hope thats not normal for everyone!  Joyce where did you get your bone scan results, were they posted out to you?  Had my dexa scan on 15th June and havent heard anything yet, have appt for the osteo clinic on 24th July so maybe I'll find out then.  Hope you are  both well, were getting there,  love Margy x",
      "MessageIndex": 48,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, sorry to hear about your sleepless night, glad you are feeling better today though, how lovely to have another grandchild to look forward to as well, that will keep you busy. Hope its a boy for you.   I am doing fine, had my clinic review today and all is well, she did give me some gel to use as my scar  gets very itchy sometimes but other than that its all ok.  Looks like I am getting a suntanned boob!! Well, only 4 to go now, nearly done, was thinking about it today and hoping I wouldnt get worried when the treatments over, its been a bit like a comfy blanket in a way, knowing were being looked after.  Be lovely to have my days back but as I am retired I'm going to have to keep busy to keep my mind on other things. Take care Joyce and Kathy, love Margy x",
      "MessageIndex": 56,
      "PostDate": "15/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Afternoon ladies, well the weekend starts here, two lovely peaceful days to do with what we want, 13 down, only 2 more to go, early appt today and was in and out within half an hour again, lovely!   Am getting a bit sore in the nipple area now but the cream from the hospital is nice and cool and soothing so hopefully it wont get much worse.  My last treatment on Tuesday is a late one, 5.30, so going to pick up a nice bottle of wine and a cake so me and my daughter can have a treat to celebrate the end of hospital treatment, its got to be done!   Hope you are doing well, have a good weekend, love Margy xx",
      "MessageIndex": 73,
      "PostDate": "17/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce and Kathy, hope all the banging in your house isnt giving you a headache Joyce!  Wish I had a cooling pad for my nipple, very tender. I'm putting gel on it though and still  using the cream daily to moisturise. I was given extra gel and cream after my last session so didnt have to buy any. I had my appt with the osteo nurse this morning, all is good, my bones are in excellent condition and my blood test results showed plenty of calcium, no anaemia and kidneys and liver function excellent.  Nice to know, didnt realise they checked all that!  My vitamin D is low though and she said that was common as main source is sunshine and we dont get a lot of it in Britain.  They are prescribing me vitamin D supplements and have been told that I wont need any more bone scans,  just a risk assessment after 2 and 5 years to see if any problems so I'm a happy bunny.   Not long for you now Kathy, only 3 to go, have a nice weekend ladies, love Margy xx",
      "MessageIndex": 93,
      "PostDate": "24/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "its like a running commentary this isnt it?? Ive just had my 4th rad today, starting to get used to it now, boob is starting to swell slightly and feels hot but not painful, slightly pink and scar is a bit itchy. Was told this might happen as I have very fair skin and burn easily in the sun if I dont plaster the suncream on. Hoping it doesnt get too bad, told to just keep using the cream I was given twice a day and to shower with Simple soap or shower creme. Oh well, another day tomorrow, love to all x",
      "MessageIndex": 6,
      "PostDate": "06/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Mumra, yes I'm having 15 treatments. just had 5th today so a third of the way there. Majority of my appointments are mid to late afternoon, I have a day off tomorrow as the machine I use is offline for routine maintenance so having to go in on Sat morning instead. Dont worry about the treatment, I was nervous for my first one but you get used to it within a couple of sessions and the staff are really nice. Let us know how you get on on Thursday,  we can compare notes lol, love Margy x",
      "MessageIndex": 10,
      "PostDate": "07/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi  Kat40.  You have a CT scan at your radiotherapy planning appt. Its nothing to worry about, they just take pics so they know where to direct the treatment, its completely painless. You will probably get a few tiny tattoos as well, and they will draw on your boob quite a bit, lol!  Dont worry about the tattoos, theyre just tiny pinpricks and don't hurt at all. love Margy x",
      "MessageIndex": 16,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, hope all is well and they get something sorted out for the pain, also hope you got something from shopping as well as hubby!! Take care, love Margy x",
      "MessageIndex": 27,
      "PostDate": "09/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi ladies, sounds like the effects are still ongoing, hope you are soon both feeling better. My boob just looks very suntanned with a bit of a red rash underneath, nipple has all healed now. I do find I am having some soreness under my scars.  I have a small lump under my breast scar where I had to have a second surgery 2 weeks after my lumpectomy to remove a large blood clot left over from surgery.  Been told it could take several months to settle down and this is now sore, probably from the radiotherapy.  Bit sore under the arm where the sentinel node scar is as well, no doubt also the effects of rads.  Had a bit of a grumble today about all these niggles and the fact that I still cant go running but then pulled myself up and thought 'what have I got to complain about, my cancer was caught early and is now gone, I didnt need chemo, and I'm on the mend with a future to look forward to.  There are people worse off going through nasty treatment so I'm counting myself very lucky.  Just felt like I had to say this.  Good luck everyone going through treatment. love Margy xx",
      "MessageIndex": 135,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Kathy, I'm really hoping I don't have any bone problems, really hate taking tablets, have had to set alarm on my phone to remind me to take my Letrozole every night!  I do a lot of exercise, walk every day and run three times a week and they do say that exercise strengthens bones so keeping fingers crossed.  Hope you're keeping ok, wont be long before were finished rads, going to feel odd not going to hospital everyday, but good though, love Margy xx",
      "MessageIndex": 50,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi ladies, hope all is well, sorry to hear your not feeling well today Joyce, hope it improves soon, not long now till we have our days back, number 10 for me today, 5 to go, yay two thirds through!! I've got a nicely suntanned boob (and one white one!!)  Looks funny ! Have a nice evening on the sofa Joyce and just rest, sounds like you need it, hope youre feeling better tomorrow, love Margy x",
      "MessageIndex": 53,
      "PostDate": "14/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Kathy, hope youre ok, not long now for you, my boob seems to have got worse in the last 24 hours, sore and itchy and have a nasty rash underneath, hope it clears soon, take care, love Margy xx",
      "MessageIndex": 89,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Kathy, hope youre doing ok, only 2 to go now, yippee!  Nice having time to do things other than visit hospitals.  I'll feel better when I get this nipple problem sorted, its not sore anymore but stopping me from running as I cant wear my sports bra without it rubbing on my nipple.  Bit annoying as running is a release for me, takes away stress and makes me feel normal (whatever that is lol!) Heres hoping you dont have any problems after rads although we are told it may get worse before it gets better.  Never mind, soon be over, take care, love Margy xx",
      "MessageIndex": 96,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, nice to know your are doing well, bet you are looking forward to your grandchild arriving in November, I've got 5 and they keep me busy.  I've been walking every day too instead of running, will help me keep some fitness up without pain, my runnning shoes will have to wait a while.  Have a lovely weekend with your son and daughter in law, love Margy xx",
      "MessageIndex": 109,
      "PostDate": "29/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Kathy, what a lovely gesture from your daughters, little thoughful things like that mean a lot. Hope your swelling goes down soon and you feel more comfortable.  I am wearing a lovely soft croptop bra which doesnt rub underneath and my boob is healing well now.  Take care, love Margy xx",
      "MessageIndex": 121,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, I have had today off as machine off for servicing. Got to go Sat morning instead. My 6th tomorrow - nearly halfway yay! Are you used to the machine now? Hope the painkillers are helping you, if not maybe check with a nurse, they may be able to give you something stronger. Hope it gets better soon, love Margy x",
      "MessageIndex": 17,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Just had phone call from hospital advising that my planning appt for rads is Thurs 4th June. Didn't realise you have to have a CT scan at this appt. All looks a bit daunting, got to have 20 sessions so 4 weeks treatment. Cant wait for it to be over. Have to have my DEXA scan on 15th June so am assuming rads will start after that. Been a bit down the last few days when I think about all thats happened in just a few weeks since diagnosis. Shouldnt complain really as I am lucky to be only having radiotherapy and not chemo, feeling a bit like a yoyo at the moment though emotionally.",
      "MessageIndex": 0,
      "PostDate": "26/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94619/radiotherapy-planning-appt",
      "Title": "radiotherapy planning appt"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thank you for the info Dreamthief, theyve already started me on Letrozole, been taking it just over 2 weeks now,  have heard a lot about painful joints and muscles on this but no side effects so far so keeping fingers crossed either I wont have any or they may be just mild, just hoping there is no more treatment involving needles as getting a bit fed up having my boob used as a pincushion!! Lol xx",
      "MessageIndex": 2,
      "PostDate": "26/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94619/radiotherapy-planning-appt",
      "Title": "radiotherapy planning appt"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Morning all, radiotherapy planning appt yesterday, only having 3 weeks not 4 so thats good. Oncologist was lovely, she explained everything to me about my cancer type etc and what would happen in rads, answered all my questions, ct scan wasnt as scary as I thought and even the little tattoos were ok (they like sticking needles in you don't they lol!)  Just waiting for start date for treatment now which they say should be 2-3 weeks.  Got dexa scan next week, Letrozole seems to be ok, having slight stiffness and leg muscle aches on getting up in morning and if have been sitting for a while but it goes away when I start moving, hopefully it wont get worse. Good luck everyone with your treatment x",
      "MessageIndex": 5,
      "PostDate": "05/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94619/radiotherapy-planning-appt",
      "Title": "radiotherapy planning appt"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi ladies, well todays the day, my last rads treatment, its not till 5.30 though so a bit of a wait.  Boob is not as bad as I thought, nipple quite sore and itchy but otherwise its looking more lightly tanned than pink. Got a nice bottle of prosecco in the fridge and a lovely cake to share with my daughter tonight, staying over at her house tonight and then a whole weekday to myselft tomorrow!!  Its going to seem odd not having to go to hospital every day. Good luck with the rest of your treatment ladies, not long to go, enjoy your baking Joyce, love Margy xx  (ps I will have a toast to us all tonight) xx",
      "MessageIndex": 79,
      "PostDate": "21/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Kathy, just to wish you luck for your first treatment tomorrow, once the first ones over and you know what to expect you'll be fine, as you say going into something unknown is always a bit scary, love Margy x",
      "MessageIndex": 18,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi ladies, looks like were all 60 something going on 16!!, I just had my 63rd birthday last month. Which reminds me Belated Happy Birthday Kathy, didnt see post till today. Hope you had a good day.  Had my appt on time today, was in and out of hospital in half an hour, must be a record!  Only 3 to go for me now, hurray!!!, youre not far behind me ladies. Am starting to get a bit tired with all this travelling, and also,  much as I love my grandchildren and see at least one of them every weekend,  I am having this weekend all to myself, need some peace and quiet, do a bit of sewing and catch up on some tv. Love Margy x",
      "MessageIndex": 70,
      "PostDate": "16/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Kathy, yaaayy youre finished treatment!!  Hope you have a lovely meal and enjoy your bubbly.  Heres hoping your skin stays ok also.  As to the emotional side, I felt very down and weepy the day after but am fine now and enjoying doing other things instead of going to hospital daily.  My skin seems to be improving 8 days after treatment, bit sore and red underneath boob but a nice soft comfy crop top seems to be helping as well as the gel and cream.  Take care, love Margy xx",
      "MessageIndex": 108,
      "PostDate": "29/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Well done on finishing rads, I was also advised  not to swim for a few weeks after as chlorine could irritate the skin, Margy x",
      "MessageIndex": 10,
      "PostDate": "28/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100495/finished-radiotherapy",
      "Title": "Finished Radiotherapy !"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, I wasnt aware there was a follow up appt after rads, am due a review next Wed so will ask about it then.  I am a bit like you with painkillers, was given codeine after surgery, it worked for the pain but made me feel really dizzy and sleepy so stopped taking it. My boob is still pink but not sore at all, been using the cream they gave me twice a day, hoping it doesnt get too bad as the treatment goes on, take care, love Margy x",
      "MessageIndex": 21,
      "PostDate": "08/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Well, 7 down, 8 to go, bit of a long delay today as my machine broke down so had to wait to use another one, was in the hospital an hour and a half, longest time yet.  Sorry to hear youre still having pain Joyce but glad its nothing serious.  I was very bruised after my op and had to have surgery again 2 weeks later to remove a large blood clot, surgeon wasnt happy to leave it as she said it would hold up my rads treatment, it went down quickly after that. Hope the pain eases for you. I'm getting quite pink now and just a little bit sore around my scar but the cream I am using is quite soothing.  I have a treatment tomorrow as was cancelled last Wednesday but its early morning so I'll still have most of the weekend to enjoy. Have a nice weekend Joyce and Kathy, were getting there!  Love Margy",
      "MessageIndex": 30,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce and Kathy, I'm enjoying my first hospital free day, nice not to have to plan everything around appointments, although I do have an appointment with the orthopedic dept on Friday regarding by bone scan. Havent had results yet but may get them Friday, hope I'm ok.  Not long for you both now, last one for you tomorrow Joyce and your well over halfway now Kathy. Hope youre both doing ok, my boob is starting to get quite a red rash mainly underneath, thinking it could be where my bra is rubbing, it doesnt hurt at all, was told yesterday just to keep using the cream and gel for another week or two as will still be effects from the treatment. Onwards and upwards ladies, I did enjoy my cake and wine last night, love Margy xx",
      "MessageIndex": 83,
      "PostDate": "22/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Joyce, glad your all finished, funny that, I felt a bit weepy and down last night, I suppose its all the emotion coming out just thinking of all weve gone through and now suddenly feels as if were on our own. Feel much better today though, got my appt with orthopedic nurse tomorrow re bone scan, hope thats ok.  I didnt get anything for my nipple and underneath boob area, they are quite sore and itchy today, have a nasty rash as well, hope it clears up soon. The gel I was given helps a bit and nurse advised me to go to GP if I had any problems as he would have all my details and be able to prescribe anything if I needed it.    Have a lovely evening out, love Margy xx",
      "MessageIndex": 88,
      "PostDate": "23/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi ladies, well looks like a busy few days for you Joyce, hope you find a bit of time to relax.  Nice to have your family around though.  I've been spending time with my daughter and grandson doing nice things like shopping and having cake and coffee.  I am healing very well, its now 10 days since last treatment and my nipple has healed well, still have a bit of a rash under my boob which I am moisturising but no more itching or soreness so all good.  Glad I didnt have to contact my breast nurse as I have never found her very approachable.  Have a lovely weekend, hope your tea party on Sunday goes well, love Margy xx ",
      "MessageIndex": 120,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Well done Joyce, thats brilliant, sounds like you had a lovely day and glad to hear your improving, hope the pains ease up for you. Take care, love Margy xx",
      "MessageIndex": 130,
      "PostDate": "04/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96151/feeling-better",
      "Title": "Feeling better"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi  ladies, havent posted in a while, have my one year mammogram and review tomorrow, this year has really flown by.  Must admit to being very nervous, have been a bit on edge this week and a bit moody.  Have recently changed Letrozole brand and have had a lot of mood swings which I didnt have on other brands, not sure if this is the Letrozole or just worry about the mammogram tomorrow.  Have been over checking breast and worrying too much and had a bit of a meltdown yesterday.  My daughter is coming with me tomorrow so at least I will have company, was on my own last year when I was diagnosed and it was awful.  Hopefully everything will be ok.  Hope you are all well xx",
      "MessageIndex": 0,
      "PostDate": "10/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106419/one-year-review-tomorrow",
      "Title": "one year review tomorrow"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Pinksparkle,  just to let you know I had same symptoms as yourself and Ali Owl,  my radiotherapy finished last July and I was fine.  Last few weeks started having itchiness and dimpled skin, also inverted nipple.  I too was worried about inflammatory cancer.  Had my first year mammogram 3 weeks ago and a thorough examination with bcn.  She assured me that symptoms were common after radiotherapy.  Had results of mammogram a couple of days ago and all is well.  It is worrying but we just have to remember not to google symptoms and not to overthink things, take care, love Margy x",
      "MessageIndex": 7,
      "PostDate": "28/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107132/going-crazy---inflammatory-breast-cancer",
      "Title": "Going crazy - inflammatory breast cancer?"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Snowys mum and Strong96, just to echo Kathy and Joyce, weve been where you are now and have come through with the support of lots of lovely people on this site, you too will get through it, I was also grade 2 and ER positive, finished my radiotherapy just over 2 weeks ago  and the hormone treatment is to prevent it coming back. Take care and remember there is a lot of help and information on this site. Love Margy xx",
      "MessageIndex": 15,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97385/understanding-letter-received-by-gp",
      "Title": "understanding letter received by GP"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Back home from mammogram and review.  Was able to chat to BCN and she put my mind to rest regarding a couple of niggles I had. I think we all have a small niggles which seem to get blown up out of all proportion.   Mammogram was much easier that I thought it would be, was expecting it to be painful but wasn't.  Feeling much better now, just waiting for results but not worrying anymore as all seems good after examination.  Best wishes to all x",
      "MessageIndex": 3,
      "PostDate": "11/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106419/one-year-review-tomorrow",
      "Title": "one year review tomorrow"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thank you ladies for your replies. I am taking ibruprofen and the odd codeine for pain, my nurse did try to aspirate but then said it was just heavy bruising and that unfortunately it would just take a bit longer to settle down.   I do tend to bruise easily anyway.   I have my second appt next Wednesday to remove dressing and also to get my results so will check again then. My breast does not feel hot and I feel well and have had no bleeding so hoping that all is well, its just a bit of a nuisance. Think my biggest fear at the moment is the thought of having to have any more surgery, really keeping everything crossed that this wont happen.",
      "MessageIndex": 3,
      "PostDate": "01/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93562/painful-bruising-after-op",
      "Title": "painful bruising after op"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi, just wondering if anyone has had similar, had lumpectomy just over a week ago, wounds healing well but I have a very large swelling which nurse advised is a bruise which will take a while to go down. It is very painful and heavy and is so frustrating as it aches constantly. Anyone had this and how long does it take to get better? Thanks",
      "MessageIndex": 0,
      "PostDate": "01/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93562/painful-bruising-after-op",
      "Title": "painful bruising after op"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi everyone,  Ive been on Letrozole since my WLE in April and have been fine with it, brand is Accord and all Ive had is slight stiffness in leg joints on getting up in morning or after sitting for long time.  Once I start moving it goes away.  Today I collected my prescription and pharmacist gave me a brand I havent heard of, brand is Niche Generics Ltd.  Wondered if anyone is using this and if you have any side effects.  Pharmacist said they had no Accord and just have to take what comes with their deliveries.  He did say he would see if he could get some Accord and would contact me after their next delivery.  I'm hoping I wont have any side effects with these new ones.  Anyone got any info on these I would be grateful. Thanks, Margy x",
      "MessageIndex": 0,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98031/changed-brand-of-letrozole",
      "Title": "changed brand of Letrozole"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Thanks for the reply Dreamthief,  I've had a look at the ingredients of both the new tablets and the Accord ones and some of the other ingredients are different.  I'll be starting on the new ones in a couple of days so will see how it goes and post here in case anyone else gets this type. Thank you x",
      "MessageIndex": 2,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98031/changed-brand-of-letrozole",
      "Title": "changed brand of Letrozole"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Green & Blacks dark chocolate with ginger and I'm in heaven, love it x",
      "MessageIndex": 16,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94008/the-perfect-chocolate",
      "Title": "The perfect chocolate"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Pat,  I was told not to use cream just before treatment but to use it a couple of times a day, my appts varied between 8am and late afternoon so I just applied the cream after treatment and in mornings when my appt was a late one.  Dont think theres any set time really, just a case of keeping the area moisturised. Good luck with rads, love Margy x",
      "MessageIndex": 1,
      "PostDate": "14/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98685/quick-question",
      "Title": "Quick question."
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi 58petals,  sorry about your diagnosis but stage 1 is very treatable, I had stage one back in April, had lumpectomy and 2 lymph nodes removed which were clear,  had radiotherapy after that and am on Letrozole for 5 years.  Its easy to say to you 'don't worry', but I know you will, we've all been there and it is very scary but you will get a lot of information and advice on this site.  Everyone is very supportive and friendly, I would have struggled if it hadnt been for this site.  Keep posting and asking whatever you need to know, there are lots of ladies going through this and lots more who have finished treatment and recovering.  Hope your husband is recovering well also. Take care, love Margy xx",
      "MessageIndex": 4,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97842/diagnosed-yesterday",
      "Title": "Diagnosed yesterday..."
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Brilliant Kath99, well done and good luck for the run.  My daughter is running for Breast Cancer Now, will be her second GNR.  I have recently finished radiotherapy and am trying to get back my fitness and running again. Have fun, love Margy xx",
      "MessageIndex": 6,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98593/great-north-run",
      "Title": "great north run"
    },
    {
      "AuthorID": "margym",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/margym",
      "Content": "Hi Ajem, I have just finished radiotherapy after having lumpectomy with clear nodes, I was prescribed Letrozole two weeks after surgery and started them straight away, So far been well, very mild stiffness of knees and ankles when getting up in morning or after sitting for long time but goes away when I start moving, occasional hot flush but was having them anyway having gone through menopause several years ago.  The radiotherapy was fine, its painless and easy, just had pinkness and a little bit of tenderness in the nipple area but was given cream and gel by hospital and its fine, nowhere near as bad as I expected.  Not sure what tablets youre on but I only know about Letrozole. Good luck with your treatment, I'm sure you'll be fine. Love Margy x",
      "MessageIndex": 3,
      "PostDate": "22/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96839/radium-and-hormone-tablets",
      "Title": "Radium and hormone tablets"
    }
  ]
}