{
  "AuthorID": "Marie G",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie-g",
  "Posts": [
    {
      "AuthorID": "Marie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie-g",
      "Content": "Hi pixielix, Letrozole is femara, the original femara brand is very difficult to get hold of now and expensive and I'm told you can only get it if it's written on your original prescription. There are many different brands of letrozole, I've found the 'accord' make of letrozole hardly gives me any ache's and pains but yes weight gain is a problem even if you're careful. But if it works in the long run I'm not complaining. Marie x",
      "MessageIndex": 11,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82168/letrozole-are-dreadful",
      "Title": "Letrozole are dreadful"
    },
    {
      "AuthorID": "Marie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie-g",
      "Content": "Hi Karen, I had the same problem on mine, couldn't open it , but now it's mysteriously disappeared! I think this site does weird things sometimes. X",
      "MessageIndex": 1,
      "PostDate": "25/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75799/private-message",
      "Title": "Private message"
    },
    {
      "AuthorID": "Marie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie-g",
      "Content": "Hi , I've been on letrozole for a couple of months now and monthly jabs of prostrap and Denosumab, however the last few days I've been feeling very weepy, like pmt and it can hit me anywhere. I've got secondary bc in my bones and lung and had an operation to repin my back after the cancer attacked it in September. I'm not sure if the depression is coz of the drugs or because I'm suddenely left to get on with it until my next appointment at end of May. Maybe my brain is trying to catch up with everything that happened so quickly, I'm functioning ok looking after my 17 year old and all the other things life offers, friends etc, but something doesn't feel right, any advice or thoughts anyone ? X",
      "MessageIndex": 0,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75555/letrozole-does-it-make-you-depressed",
      "Title": "Letrozole , does it make you depressed."
    },
    {
      "AuthorID": "Marie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie-g",
      "Content": "Hi bongo and thanks for your advice , I have noticed I haven't had so much pain this month but I haven't kept the packet. I tend to put them in a nice little tin so I don't have to see piles of meds but I will look at the branding when I get my next lot. What do they put in them that's different are you on 2.5mg? I have a few more questions but will wait for the to pm you. Thanks again. Love Marie x",
      "MessageIndex": 2,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75555/letrozole-does-it-make-you-depressed",
      "Title": "Letrozole , does it make you depressed."
    },
    {
      "AuthorID": "Marie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie-g",
      "Content": "Thanks bongo, dream thief and jane for your advice, very interesting that there are soo many different brands out there and why. It looks like I'm going to have to experiment and see as suggested which brand gives me the least aches and pains. Jane I'd be interested to know what supplements you take to try and combat the side effects, the doctor suggested today to try Naproxen with paracetomel for the joint pains, has anyone tried this? Marie x",
      "MessageIndex": 4,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79056/letrozole-question",
      "Title": "Letrozole question.."
    },
    {
      "AuthorID": "Marie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie-g",
      "Content": "Sorry I meant Janet not Jane..",
      "MessageIndex": 5,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79056/letrozole-question",
      "Title": "Letrozole question.."
    },
    {
      "AuthorID": "Marie G",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie-g",
      "Content": "Hi everyone, I've just been given 3 months of different brands of letrozole, one manufactured by accord, another by Sandoz and lastly zentiva. My worry is that from what I've read previously on this site, different brands create slightly different side effects, some worse than others . Can anyone recommend the best brand from those of us who have to take this every day, or any advice . I'm thinking of taking them back and requesting them to all be by the same company in case my battered immune system objects! I already suffer from aching joints fingers and toes from these tabs. Thanks.",
      "MessageIndex": 0,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79056/letrozole-question",
      "Title": "Letrozole question.."
    }
  ]
}