{
  "AuthorID": "Marie50",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie50",
  "Posts": [
    {
      "AuthorID": "Marie50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie50",
      "Content": "Hello Nikki, Your post reached right out to me, I do feel for you. I was diagnosed in February with low grade breast cancer and had axillary clearance as 2 of my sentinel nodes had 'flecks' of cancer. They removed 21 lymph nodes and 1 was 'fully involved' - I said to my surgeon 'does that mean it's cancerous?' and he nodded. I started chemo on 30th May and while it's no bloody picnic and that's for sure, it is DO-ABLE! Look how many of us on here have been / are going through it...and not everyone is ultra strong, believe me, but do take offers of support from anyone who comes to support you - it's so important that you're not alone and I have some chatterbox friends who visit me and talk till the cows come home, but it's such a great distraction from worrying and pain. Try to distract yourself from the waiting game - don't sit dwelling on what might happen - read a good book, get into Big Brother and lose yourself in reruns of old shows, download the box set of Breaking Bad and get stuck into it (it's quite shocking in parts but so great to watch as a series of distraction!!) Treatment for breast cancer improves all the time and you must try to stay positive - I'm a firm believer in positivity and as hard as it is, you have to try to stay focussed on the fact that you found it, they've diagnosed it, they're going to treat it and you're going to get through it. I wish I could hug you now and give you some of my positive vibes, so I'll send them through cyber space instead and hope they reach you. Much love, Hannah xx",
      "MessageIndex": 31,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135289/new-diagnosis---feel-like-i-m-living-a-nightmare",
      "Title": "New diagnosis - feel like I'm living a nightmare"
    },
    {
      "AuthorID": "Marie50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie50",
      "Content": "Yeah, I had to take mine off - sorry - hope it goes well xx Hannah",
      "MessageIndex": 2,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125974/acrylic-nails",
      "Title": "Acrylic nails"
    },
    {
      "AuthorID": "Marie50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie50",
      "Content": "Hello mistyblue, I can only add to what everyone else has said - such a mean and insensitive comment to make, really it is. Cancer does change how we feel about ourselves, our lives and especially our futures. My boss said to me on the phone the other day 'well, you're vulnerable now and you probably always will be' and I wanted to protest and rant but you know what, she's right - I am bloody vulnerable now and after a life of constant struggles, I'm determined that once I've knocked this cancer malarkey on the head, I'm going to completely change my lifestyle - we're moving out of London, nearer to our siblings, and I'm not going to devote my life to working 50+ hours per week - oh no, part time working and full time living - that's my plan! No one truly understands what the diagnosis, waiting, surgery, waiting, treatment and yes, WAITING - for results all the time - does to a human being and those really close to them until it really touches them and no, we wouldn't wish this awful ride on anyone. So take a few deep breaths and appreciate that your 'friend' is speaking with sheer ignorance. Big hugs xxx Hannah",
      "MessageIndex": 11,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127746/really-bloody-angry",
      "Title": "Really bloody angry !!!"
    },
    {
      "AuthorID": "Marie50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie50",
      "Content": "Hi Mazza10, Had my first chemo on 30th May and sure enough, on day 16 my head became really sore. By day 19, (Friday 16th June) I felt well enough for my husband and I to drive over to France for the weekend & so literally with cap (& sun hats) in hand, off we drove to a lovely B & B where my hair promptly fell out - during the night & then in the shower. It looked awful, really pathetic, so once home on Sunday evening, my husband first shaved my head with the clippers and then did a very gentle wet shave. It's taking some getting used to, but to be honest, it feels better knowing that I won't have to worry about waking up with a mouthful if my own hair - yuk! I have lots of hats too, Amazon have lovely soft sock-type head covers which are very comfortable for sitting around in. I will say that even though I've always had really short hair, I'm still finding it tricky to accept so for people with lovely long hair, it must be very, very tough. But we're all in this together & we're not alone in our fears, worries and dilemmas - which for me has been wonderful. Big hugs xx Hannah",
      "MessageIndex": 10,
      "PostDate": "24/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129612/scalp-pain-and-impending-hair-loss",
      "Title": "Scalp pain and impending hair loss"
    },
    {
      "AuthorID": "Marie50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie50",
      "Content": "Hello Nicola, I'm a week further on than you (had lumpectomy and node biopsy on 14th March) so I really do sympathise with you.  I too got a bit fed up with people asking about results, but they are only trying to show that they care - I just try to politely say that I'll let them know when I know. The sadness is part of the rollercoaster of this dreadful situation we've found ourselves in and I think that it's okay to cry, but try not to let it take you over because you might get so down that you can't  get back 'up' again.  Try and do things to keep your mind occupied - easier said than done I know, but I'm knitting a new baby blanket for a friend, helping my daughter write a children's book for her degree, I've downloaded the first 2 series of Broadchurch to watch and I'm reading 'Apple Tree Yard' (the brilliant drama that was recently on BBC1). Have you got friends that can come and keep you company? If they offer to come round, try and say yes even if you don't feel like it - it could be good for distracting you for a few hours.  The trouble is, this thing we face is so all-consuming and you'll keep coming back to thinking about it, but trust me, the more distractions you can bring into each waking hour, the better. I'm thinking of you and sending you a big virtual (((hug))) xxx Hannah x",
      "MessageIndex": 2,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125866/struggling-today",
      "Title": "Struggling today"
    },
    {
      "AuthorID": "Marie50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie50",
      "Content": "Hello LondonLass, I hope that knowing you're not alone in the Big Wait is some comfort to you... I could almost bet on it that the MDT are discussing me right now and then I'll get a call from my BCN at about 4.30pm tomorrow when she'll say ' We'd like to see you on Monday morning, but I haven't had sight of your results yet...' which as we all know is totally untrue because she's in the bloomin' meeting!  It may not be this week for me, as my second surgery (axillary clearance) was only 8th April so that may be too soon, but yesterday - while suffering the worst pain since this life changing experience plopped itself into my unsuspecting life - I began to have those negative thoughts, just gently floating around at the back of my brain...the 'what if's' and suchlike. As others have said, worrying about what they're going to tell us doesn't change it, so it's wasted negative energy I suppose - when I was first diagnosed, a good friend who was going through it said 'try not to let it take over your life...' and I am trying, but sometimes, it just does. I am knitting again - to while away the time - and I've started watching that 'Second Chance Summer' on BBC (download it on the iPlayer if you haven't seen it) about 10 people at some sort of crossroads in their lives who are out in Italy for two months to see if it's the life for them and whether they want to stay there and although I've cried at their 'you only get one life, so you have to live it' moments, it is great to watch! I hope that whatever the news, you have the strength to push on through. Love and hugs, Hannah x",
      "MessageIndex": 7,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127224/it-doesn-t-get-any-easier",
      "Title": "It doesn't get any easier....."
    },
    {
      "AuthorID": "Marie50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/marie50",
      "Content": "Hi Lynnieb, I had my WLE and SNB on 14th March followed by axillary clearance on 8th April and the actual surgeries were fine.  The hospital staff couldn't have been nicer to me, from the nurse who prepped me and actually helped me put my surgical stockings on to the anaesthetist in the pre-op room both times.  I was home same day for WLE/SNB and stayed in one night for axillary clearance due to low blood pressure. A week and two days on from second surgery and my arm and shoulder are intermittently painful with a soreness that is a cross between an ache and a burning feeling, but pain management really is the key - don't let the pain relief wear off before you take the next lot, take them as if it's a course of antibiotics, that's what my consultant said to me. My husband has been great but I know it must be hard for him especially when I feel low (which has happened for a couple of days) and just want to cry all day.  This too, I'm told, is perfectly normal and to be expected and it's all to do with the drugs and the inability to do anything along with the pain and discomfort.  Just hang in there and be kind to yourself, it's all totally alien to us and the only way to cope is to take each day one at a time, take deep breaths through the tough bits and have a cry when you need or want to. Thinking of you tomorrow and hope that it all goes as well as it can for you - big cyber ((((hugs)))) coming out to you! Hannah x",
      "MessageIndex": 5,
      "PostDate": "17/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127032/panic-setting-in-before-operation",
      "Title": "Panic setting in before operation"
    }
  ]
}