{
  "AuthorID": "Martika1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/martika1",
  "Posts": [
    {
      "AuthorID": "Martika1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/martika1",
      "Content": "Thank you. Light a at the end of the tunnel",
      "MessageIndex": 11,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127180/getting-hair-back-to-normal-after-chemo",
      "Title": "Getting hair back to normal after chemo"
    },
    {
      "AuthorID": "Martika1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/martika1",
      "Content": "Thanks Sarah. You have given me the confidence to go and sort out the patch test. I usually have the tint and then next time have highlights or lowlights depending on how I feel/the season. Will go for the tint first. I haven't had skin or scalp problems so am hopeful that it won't be a problem. Oooh - excited now",
      "MessageIndex": 4,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127180/getting-hair-back-to-normal-after-chemo",
      "Title": "Getting hair back to normal after chemo"
    },
    {
      "AuthorID": "Martika1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/martika1",
      "Content": "I have recently had a second bout of breast cancer - first time was an oestrogen feeder, with lumpectomy, radiotherapy and then tamoxifen treatment for 5 years. Ten years later, I got triple negative breast cancer, followed by mastectomy and chemo of 3 x EC and 3 x docetaxel. Have just had last filblastil injection, so am now at end of all systemic follow up. Have been hit hard physically by the docetaxel, but the alternative is worse!  I have managed to retain a decent covering of hair, due to the cold cap. It is starting to grow back along with eyebrows, eyelashes, body  and other hair. I am just wondering when I will be able to have my hair coloured again, as I usually have it done every 6 weeks. It hasn't been done since last November, and I am looking a bit ragged now. Can anyone help? Thanks in advance",
      "MessageIndex": 0,
      "PostDate": "18/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127180/getting-hair-back-to-normal-after-chemo",
      "Title": "Getting hair back to normal after chemo"
    },
    {
      "AuthorID": "Martika1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/martika1",
      "Content": "Thanks Buttermere Fan. I understand where you are coming from. I collect the hair each time I wash my hair to check that the shedding is less than last time (it usually is)  I am still in the side effect phase of the chemo - bone and joint pain, along with  breathlessness and very weak muscles. I guess that's because I have been taking it easy for the past few months and the muscles are wasting away.  I am planning a pamper weekend at a spa with some good friends who have been there for me with bells on. Just need to feel a little more like myself than I currently do.  Good luck with your recovery too. I'm not sure what to recommend for getting out ofthe chemo bubble. I guess I'm still in that too",
      "MessageIndex": 6,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127180/getting-hair-back-to-normal-after-chemo",
      "Title": "Getting hair back to normal after chemo"
    },
    {
      "AuthorID": "Martika1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/martika1",
      "Content": "Hi Sarah, I am going to  book the spa. Just need to get a date arranged with my friends. The chemo whilst being a life saver, is absolutely a poison. The way I see it is that the chemo is trying to kill the cancer that might be left before it kills me! So I know what you mean about it having a dreadful impact on health. I would like to be able to empty the dish washer without the need for a lie down afterwards :-) I have to think about what I want before I go upstairs so that I don't have to do it too many times.  I am about 2 weeks after my final chemo cycle now, and have to admit that this final time has affected me much worse than previously. I guess that's because the start point of each cycle has been a lower base. All the same, it would be good to know how long (about) the energy/capability etc start to return. My brows are fine, but my lashes have suffered. Mostly the lower ones on the outer corners. I just pretend there are still lashes there and mascara the skin!! Have you tried the single lashes? I have had them done pre chemo, and will use them again if the lashes take their time to return. They last about 4 weeks and really thicken and lengthen. Have yourself a wonderful spa weekend xxx",
      "MessageIndex": 8,
      "PostDate": "23/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127180/getting-hair-back-to-normal-after-chemo",
      "Title": "Getting hair back to normal after chemo"
    },
    {
      "AuthorID": "Martika1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/martika1",
      "Content": "Thank you - I will have a word with my hair dresser and see what she suggests. I won't be her first I'm sure. She can sort the patch test. I haven't had any skin problems at all, so am hopeful that my scalp is fine too. Is there a time when I can relax that what hair I have left will not be on my pillow one morning? ",
      "MessageIndex": 3,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127180/getting-hair-back-to-normal-after-chemo",
      "Title": "Getting hair back to normal after chemo"
    }
  ]
}