{
  "AuthorID": "Mary Louise",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mary-louise",
  "Posts": [{
    "AuthorID": "Mary Louise",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mary-louise",
    "Content": "Dear Jinete I've just been reading through the various posts and perhaps I can offer a different perspective. Unfortunately I have two different primary cancers, breast cancer and leiomysarcoma of the inferior vena cava. This has meant that the sarcoma oncologist has advised that they cannot treat the sarcoma at all without it having a devasting effect on the breast cancer and I can only receive minimal treatment for the breast cancer because anything more radical would set the sarcoma off. I just had a rather grim appointment with the sarcoma oncologist in which he reiterated that there was no possible treatment and that unfortunately the sarcoma was growing more rapidly than they had at first thought. The only thing he could think of but which he couldn't totally recommend was aggressive radiotherapy to my abdomen but he warned that this would badly damage my bladder, bowel and kidney (I now only have 10% function in my right kidney anyway - the sarcoma has done for it) - I did decline this. When I was first told that I wouldn't be treated (or at least only receive Femara for the breast cancer), I was shocked - I couldn't believe I was attending one of the best cancer hospitals in the world (the Royal Marsden) but they could do nothing for me. However, the upside has been, that although I am very sick indeed, I actually feel very well - like you, Jinete, I had no particular symptoms before diagnosis and apart from very bad back ache (well controlled by Co-codamol), I have no particular symptoms now. This last year, I have just carried on working, went on holiday to Costa Rica (against medical advice - I now have a pulmonary embolism to add to my woes) and really sometimes have to pinch myself to realise that I am in fact dying. This is just to say, that living without treatment can be surprisingly pleasant - although I do have to add, that if I was offered a chance of effective and not totally debilitating treatment, I would go for it without a second thought. Anyway, Jinette, I hope that things work out well for you. All my very best Mary",
    "MessageIndex": 18,
    "PostDate": "24/09/2008",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10771/declining-treatment",
    "Title": "Declining Treatment"
  }]
}