{
  "AuthorID": "mavey",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mavey",
  "Posts": [
    {
      "AuthorID": "mavey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mavey",
      "Content": "One way of putting it would be what if this happens again to you in 3 years you will say what if I had taken the chemo. At least if you take the chemo you will never have to think that. It is tough but not like it was 20 years ago. I even managed to work through mine.  If you had a bad prognosis surely then you would question more harsh treatments but sounds as if things are pretty positive for you . Good luck xxx",
      "MessageIndex": 12,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23014/to-chemo-or-not-to-chemo---that-is-the-question",
      "Title": "To Chemo or not to chemo - that is the question?"
    },
    {
      "AuthorID": "mavey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mavey",
      "Content": "No its OK. I started in August and at first I found it so dreadful. The nights were still so hot and my office was hot and it felt like the last exhausting straw on this journey. I dont think it helped that after the chemo and radio you are so run down. However over the months I have got used to it. I have changed my nightwear completely. There is a thing called a chillow you can buy - I have not got one but people think they are fab. At the end of the day the other reply is right it is just our menopause but full on at once. I have got a cream from my doc for my skin. Two of my friends were post menopausal and put on different drugs which caused them muscular pain but when they told their oncologist their drug was changed in fact one finds Tamoxifen better than the rest. If you approach it as something that was coming to us anyway with age and go with the flow you will get there - just another step in this journey...an added benefit for me at least - no periods (-:",
      "MessageIndex": 2,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23712/tamoxifen-it-sounds-awful-is-it-really-that-bad",
      "Title": "Tamoxifen It Sounds Awful Is it Really That Bad?"
    },
    {
      "AuthorID": "mavey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mavey",
      "Content": "I had a port fitted privately and I have to say of all my decisions it was my worst one. My port moved every time they tried to use it and I was like a pincushion on occasion. I endede up in x ray theatre for accesssing of it every time I had my chemo.....When it was taken out I needed another cut to deal with all the scar tissue that had built up. I now have on top of everything else an extra scar and a lovely mark on my nexk where it was. At the end of teh day I had a sore chest from teh port, a sore neck and still had a sore arm form where I had my initial chemos...so be careful what you wish for the grass is not always greener....",
      "MessageIndex": 9,
      "PostDate": "19/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/26143/help-has-anyone-requested-a-port",
      "Title": "HELP ! Has anyone requested a Port ???"
    },
    {
      "AuthorID": "mavey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mavey",
      "Content": "in the summer I wore nothing and now I have some cotton PJ bottoms from M&S and separate vests. I have devised the way to get through the night is just to fling the covers off me, try to stay as sleepy as possible and then when I get really cold put them back on again. Also rather than go to bed straight after my bath I let myself cool down. Good for you Jules just think every time you take that tablet it is beating the return of teh cancer thats how I look at it !!   How are you doing otherwise with your treatment",
      "MessageIndex": 5,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23712/tamoxifen-it-sounds-awful-is-it-really-that-bad",
      "Title": "Tamoxifen It Sounds Awful Is it Really That Bad?"
    },
    {
      "AuthorID": "mavey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mavey",
      "Content": "and ps dont be afraid if you find it isnt suiting you to call your oncologist or your GP and get it changed !",
      "MessageIndex": 6,
      "PostDate": "16/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23712/tamoxifen-it-sounds-awful-is-it-really-that-bad",
      "Title": "Tamoxifen It Sounds Awful Is it Really That Bad?"
    },
    {
      "AuthorID": "mavey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mavey",
      "Content": "i finihsed chemo on July 31st and was told I would start radio on August 24th but I started on September 1st. It depends on how your bloods etc are. I worked right through both although just mornings with radio as I found teh travelling too much.It is now I need the rest",
      "MessageIndex": 13,
      "PostDate": "14/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10875/chemotherapy-and-radiotherapy",
      "Title": "chemotherapy and radiotherapy"
    }
  ]
}