{
  "AuthorID": "MayaMoo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mayamoo",
  "Posts": [
    {
      "AuthorID": "MayaMoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mayamoo",
      "Content": "I am 53 & have been on tamoxifen for nearly 2 months now, having finished my treatment. Almost immediately I was experiencing mild aches, tolerable, and a full hot flushes. On Wednesday, bizarrely, I started to feel the most shocking pain in all my joints/bones. Usually my pain threshold is very high, sailed through all three of my childbirths & was able to control my pain. Had surgery at the end of November last year & coped with no pain relief. The pain is relentless and really impacting on my life. I’ve succumbed to pain relief but it’s not even touching the pain. I’m assuming it’s the side effects of the medication and with that in mind I am seriously contemplating stopping the medication. Like you, I’m in a dilemma..! ",
      "MessageIndex": 5,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152144/early-side-effects-of-tamoxifen",
      "Title": "Early side effects of tamoxifen"
    },
    {
      "AuthorID": "MayaMoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mayamoo",
      "Content": "Thank you for response.That’s wonderful to hear that your percentage of reoccurring was only 1%, I bet you were thrilled.  I have an appointment this coming Tuesday with the consultant & that is something I will establish more clearly as I am unclear but hopefully will have a better understanding very soon.  I know to some I may sound wreck-less but for me even if my percentage is slightly higher I will look at different approaches other than conventional medicine - what I’m experiencing is horrendous & impacting so much so that I’m struggling to function. It’s no quality of life..! ",
      "MessageIndex": 7,
      "PostDate": "21/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152144/early-side-effects-of-tamoxifen",
      "Title": "Early side effects of tamoxifen"
    }
  ]
}