{
  "AuthorID": "Maysie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maysie",
  "Posts": [{
    "AuthorID": "Maysie",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/maysie",
    "Content": "Hello Everyone, This is my first post on this website, so hiya to you all!  :) Please, is there anyone else out there who has pain from their treatment site years later, even though they had no lymph node involvement?  I'd love to hear from you if so, please. I had two lumpectomies and radiotherapy for  DCIS in 2001, and then a mastectomy of the same breast in 2010 for Paget's disease of the nipple.  I've never had to have tamoxifen, and both my cancers were very early stage, so I was lucky in comparison with a lot of other people. My problem is that I have pain, which I think must be because of the operations and the radiotherapy.  I've had the pain for five or six years now, and take paracetamol for it, and occasionally nurofen.  A warm pad feels lovely and really helps.  I've never spoken to the hospital or my GP about it, because to be honest I feel a bit of a fraud, because I think they'd say that as I've had no lymph node involvement at all, then it's unusual to have such pain. The pain is mostly just above where I had the mastectomy, but sometimes it's at the end of my mastectomy scar near the armpit (that's also where the DCIS scar was).  The pain can also be in my clavicle - thankfully I never have the pain in all those places at the same time. The worst pain is when it's just above where the scar is - it's a really intensive pain when it comes on, and it feels like a spasm and as if the pain is about to lock.   I have my annual follow up at the hospital soon, and I'd like to say about the pain, but I just feel a real fraud and that they're going to say that it's unusual for anyone to have the pain I have when it's been such simple and successful treatment without any lymph nodes being taken out.  When I had the mastectomy, they talked about it as a simple mastectomy - it might have been simple as opposed to with nodes out, but I still lost the breast, and I had two haematomas, one in 2001 and the other in 2010 that I had to go back to theatre to have suctioned out. I spoke to a really good nurse on this website this evening, and he said he thought that my pain problems could be due to the radiotherapy years ago, and he suggested I came on here or a similar website to talk to other people who may have had similar. Please is there anyone who could comment here, based on their experiences.  I'd be so grateful if so - the only information I find when I google my symptoms is about people who've had lymph nodes tested and removed. Thankyou very much for reading this! PS  I wanted to end on a bright note - my mastectomy scar looks like it has a little smile on the end of it, because there's a tiny little bit of the lumpectomy scar going in another direction!  :)",
    "MessageIndex": 0,
    "PostDate": "04/10/2013",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65525/does-anyone-else-suffer-from-pain-in-surgery-radiotherapy-site-years-after-treatment",
    "Title": "Does anyone else suffer from pain in surgery/radiotherapy site years..."
  }]
}