{
  "AuthorID": "Mazzie5",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
  "Posts": [
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "I was recommended medulla yoga feeding bras. I know ... odd choice but... they are soft, adjustable straps which the sloggi ones do not have and easy access to boob. I find them really good. Xxxx",
      "MessageIndex": 4,
      "PostDate": "05/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180656/bras",
      "Title": "Bras!!!"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Thank you for the good luck vibes I am feeling them wash over me I'm at the point of...let's just get on with it lol. Although you are phase returning remember to keep looking after yourself xxx Mwah, Sending love n hugs x",
      "MessageIndex": 12,
      "PostDate": "26/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179008/april-2019-breast-cancer-radiotherapy-chat",
      "Title": "***April 2019 Breast Cancer Radiotherapy Chat***"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hi there I had a chat with a consultant radiologist first. Went through radiotherapy pro's and con's etc and signed a consent form. Two weeks later I had the CT mapping appointment and two weeks later started RT. Different NHS trusts might differ but that is my experience. Hope that helps x",
      "MessageIndex": 14,
      "PostDate": "26/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179008/april-2019-breast-cancer-radiotherapy-chat",
      "Title": "***April 2019 Breast Cancer Radiotherapy Chat***"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hi again, Before radio therapy they need to know how to line up the imaging machine. To do that they put sticky electrodes on you and then you have a CT scan. A CT machine is a bit like a large polo but sounds like a washing machine and you get moved through the central hole. Totally painless and not scary. From that they can then figure out what position you and the machine are needed in to best cover the whole breast. They put dots on you so when you go for the sessions they can line you up easily. Hope that makes sense. X",
      "MessageIndex": 16,
      "PostDate": "26/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179008/april-2019-breast-cancer-radiotherapy-chat",
      "Title": "***April 2019 Breast Cancer Radiotherapy Chat***"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hello all, I am due to start 15 sessions on May 1st. My question is ... what is the likely hood that I  will be able to self drive to and fro appointments for the three and a half weeks? Would it be advisable to get lifts for the later sessions? On my own so would be relying on friends etc Thank you in advance x",
      "MessageIndex": 7,
      "PostDate": "21/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179008/april-2019-breast-cancer-radiotherapy-chat",
      "Title": "***April 2019 Breast Cancer Radiotherapy Chat***"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hi there I had endometrial cancer in 2017 and have just been diagnosed with DCIS, currently nursing boob post lumpectomy. It sucks, there are no other words really. Sending hugs x",
      "MessageIndex": 4,
      "PostDate": "09/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177814/2-primary-cancers-in-three-and-half-years",
      "Title": "2 primary cancers in three and half years."
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Thank you Sandie,  that is really helpful. Onwards and upwards x",
      "MessageIndex": 9,
      "PostDate": "21/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179008/april-2019-breast-cancer-radiotherapy-chat",
      "Title": "***April 2019 Breast Cancer Radiotherapy Chat***"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hi Foxtrot I had a total hysterectomy, tubes and oves removed in September 17. I was lucky in that it was grade 1 stage 1A although it never really feels 'lucky' does it lol!  I had 15 weeks off work and went back, albeit a bit too soon I think. I go back next week for my results and see where I go next.  The annoying thing is I feel really well whereas I didn't before my hysterectomy (so tired and lethargic).  When I got my recall letter from the mammogram .. I just knew...and my current mantra is FFS ... excuse the language. Regarding the lumpectomy - having been initially sore now it just aches as the internal stitches are obviously healing and it feels more tender than it did - but nothing that paracetamol doesn't help and no other infection signs or that so just putting up with it ...as you do. Initially signed off for 2 weeks which is up on Monday but I really don't feel ready to go back yet ..at all! Trying to keep hands and mind busy. My second mantra - The only way is forward! Mazzie",
      "MessageIndex": 12,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177814/2-primary-cancers-in-three-and-half-years",
      "Title": "2 primary cancers in three and half years."
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "We do not walk your path - but we can walk beside you A bit of Robbie Williams never goes amiss:  LOVE MY LIFE I might not be there for all your battles But you'll win them eventually I'll pray that I'm giving you all that matters So one day you'll say to me I love my life I am powerful I am beautiful I am free I love my life I am wonderful I am magical I am me I love my life Trees need to be battered by the storms to gain their strength so they don't topple over.",
      "MessageIndex": 4,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178366/breast-cancer-the-gift-that-keeps-giving",
      "Title": "Breast cancer the gift that keeps giving!"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Me too! Sending hugs right back at you x",
      "MessageIndex": 6,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178366/breast-cancer-the-gift-that-keeps-giving",
      "Title": "Breast cancer the gift that keeps giving!"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hey there I'm doing it alone too. I have children and family but they are not near me (overseas, army and over 100 miles away) It hasn't helped that my sister was diagnosed with BC 6 weeks after me so she is now focused, as she should, on her own journey. I have made sure that all medical peeps knew I was on my own and had little back up. This meant that I stayed overnight in hospital after my lumpectomy instead of being a day case. I have good friends and good neighbours but they are not family. I am aiming to self drive to RT sessions realistic that I might need to use some friends for lifts towards the end ....but maybe not. Again my plan is to ask someone once so the 'burden is spread. I have found the worst problem is actually feeling isolated ... even with 3 cats in the house! My work colleagues are working, my friends are working and I am at home alone. My coping mechanism is to baten down the hatches and keep close to home but that doesn't help the isolation.  I agree with the other comment ... even when people say you can call them day or night ... i just know i couldn't do that to them unless life threatening. I have read an immense amount and know the possible complications but I  am not stressing these as I  might not get any side effects, might get some or all but I  am savvy enough to know I am not crossing this bridge today. So it's not today's problem. I have my feet on the floor, I am aware of what could be, not stressing until I have to and keeping the rest of my life as normal as possible. On step at a time, one day at a time - remembering to live life too. Clichė perhaps but wise words too. This forum is great so many lovely ladies here with pearls of wisdom. We are not truly alone when strangers reach out to us in kindness. Sending hugs. You can do this. I have faith in you - this too shall pass! Xxx ",
      "MessageIndex": 3,
      "PostDate": "23/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180030/single-life-with-cancer",
      "Title": "Single & Life with Cancer"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hello Ladies.. So off for a wire and lump removal tomorrow...and as I was sitting here...waiting for the clock to tick forward (like you do) I had this wicked thought of turning up with nipple tassels. Wouldn't their faces be a picture! Unfortunately I do not own any but..if nothing else...I hope I have made a couple of people chortle at the thought  Let's get on with it Mazzie",
      "MessageIndex": 0,
      "PostDate": "28/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177327/nipple-tassels-or-no-nipple-tassels",
      "Title": "Nipple tassels or no nipple tassels?"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "This dude is awesome! So glad to have found kindred spirits Mwah to you all x",
      "MessageIndex": 4,
      "PostDate": "01/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177327/nipple-tassels-or-no-nipple-tassels",
      "Title": "Nipple tassels or no nipple tassels?"
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hi My radiographer told me any moisturiser was ok AS LONG as it didn't have SLS (sodium lauralsulphate) in it.  I have bought the r1/r2 gels but only use them on rad days am/pm using aveeno at other times. I find with the r2 cream I have to use 2 x 6g sachets per use as I have big boobies! Lol. So hence intermittently using an alternative.. I also have aloe Vera in fridge waiting ... just in case. I like to cover the bases I suppose! Good luck ... I'm just starting week 2, so far, so good xxx",
      "MessageIndex": 6,
      "PostDate": "07/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180759/can-anyone-advise-which-creams-are-best-for-moisturising-after-radiotherapy-on-breast",
      "Title": "Can anyone advise which creams are best for moisturising after radiotherapy..."
    },
    {
      "AuthorID": "Mazzie5",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzie5",
      "Content": "Hi Crazyknitter I can't answer your question and for that I am sorry but I do know that when you post a question, any question, it is usually because you need a soul to reach out and touch you. This is such crap news. Right now your world has tipped and it feels like it's not the same place it was a few hours ago. Stand strong and know that we ladies stand with you at this time. On your journey ahead remember you can scream, shout and wail and we will be here x Sending you hugs and Love.",
      "MessageIndex": 1,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179210/breast-cancer-liver-mets",
      "Title": "Breast cancer liver mets"
    }
  ]
}