{
  "AuthorID": "Mazzamo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzamo",
  "Posts": [
    {
      "AuthorID": "Mazzamo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzamo",
      "Content": "Hello again Since my last sortie onto the site, have been feeling extremely fatigued with low (sacro iliac) and leg pain which has become severely limiting to daily ativities.  Pain is worse every dayand interrupting sleep.  Balance not good.  Severe  Have had fatigue for a long time put down to Arimidex and/or thyroid imbalance (Had thyroid cancer 6 months after BC)  but these isues now sorted,  Saw Onc yesterday and asked for referal to neuro query MS or other neuro prob.  Spread / recurrance of cancer never ocurred to me.  Treated in 2011.  He ordered bloods, MRI and CT.  Wants to eliminate this first.  Found out today bllods ok but ESR is raised.   I know what this can mean. Have a heavy cold and laryngitis.  Could this raise ESR?  White blood count normal.  I would have thought this would be raised if infection. Can anybody shed light on this? Many thanks Maureen",
      "MessageIndex": 0,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109328/mets",
      "Title": "Mets"
    },
    {
      "AuthorID": "Mazzamo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzamo",
      "Content": "Hi Misty They've been working on thyroid meds and levels for 2 years and thy're now just right, with suppressed TSH (as required) and optimal levels. Hope Dreamthief drops by soon! Thanks for reply M xx",
      "MessageIndex": 2,
      "PostDate": "18/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109328/mets",
      "Title": "Mets"
    },
    {
      "AuthorID": "Mazzamo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzamo",
      "Content": "Thank you Kate.  I've only just changed thyroxine dose so am due a blood test at end of October. Sorry Binny to hear about your health.  You'll probably find that the BC is so much easier to manage than the thyroid.  I'm currently on 175 mcg Levthyroxin.  They started me off on 200 mcg on March 1st.  I felt fine - had loads of energy but I know I was running too 'high' because I had some weight loss and heat intolerance but no other 'hyper' symptoms.  They did blood tests at the hospital and said I had to reduce by 25 mcg as my levels were too high.  They gave me the blood work results and I was out of range.  They do give you higher doses after thyroid cancer to prevent recurrence and they expect high T3 and T4 readings but mine were just a bit too high.  I wouldn't have thought that a 25mcg would send me from a bit 'hyper' to feeling low, but these symptoms started about a fortnight after I reduced the dose.  Is there a 'transition period where you feel rubbish and then start to feel ok again?  Still wondering about the Arimidex as I've read on this site that it can have similar s/e.  It just seems a bit late in the day for these to emerge although I understand that it's quite usual up to 2 years on the drug. It's not that easy being looked after by two oncs but they are very good and do listen.  I suppose it's going to be a case of trial and error.  I might have to come off the Arimidex anyway as I have osteoporosis that's not being treated at the moment because I can't tolerate the drugs they give me.  Both Arimidex and Thyroxin are thinning my bones even more. Anyway - onwards and upwards!  Thank you both for responding.  Best wishes Maureenx",
      "MessageIndex": 3,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63658/arimidex-help",
      "Title": "Arimidex? Help!"
    },
    {
      "AuthorID": "Mazzamo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzamo",
      "Content": "I am new to this group.  I was diagnosed with ILC in November 2011.  No lymph node involvement.  Had lumpectomy followed by radiotherapy and then given Arimidex in February 2012 - about 18 months ago.  Apart from the inevitable hot flushes, had absolutely no problems.  Two or three months ago, started with severe dry eyes.  Couldn't open eyes in morning.  Saw optician and she gave me drops which don''t help at all.  I walk for about an hour a day and have had loads of energy up to about a month ago.  Started to feel very tired and thought I was going down with a virus.  Got an enlarged lymph node in my neck and a sore throat and vague sinus symptoms and feeling dizzy when turning over in bed nd getting up out of bed.  Lymph went down after about a week but vague sore throat, sinus, dizziness etc has remained and I feel tired and very tearful.  Don't want to walk as calf muscles and muscles above my knees on front of  are really sore and tender.  No joint pain.  Have been putting all this down to some ongoing virus but I'm wondering if Arimidex s/e are starting to kick in. I was 'incidentally' diagnosed with thyroid cancer while having the radiotherapy for breast cancer and had a total thyroidectomy and now have high doses of replacement thyroxin.  It's quite difficult sometimes to sort out what s/e belong to which drugs but I don't think these symptoms are thyroxine related. I have an appointment with Onc in a couple of weeks to discuss, but in the meantime would like to hear from anyone whose had similar symptoms. Feeling lousy and sorry for myself which isn't like me:(  ",
      "MessageIndex": 0,
      "PostDate": "18/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63658/arimidex-help",
      "Title": "Arimidex? Help!"
    },
    {
      "AuthorID": "Mazzamo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazzamo",
      "Content": "Hi again Binny Your post above sent me on a trail of research today which I think may have solved my problem.  When I was on the 200 mcg dose, I had Activis for all my scripts.  Felt great.  When the dose was reduced to 175 mcg, had to accept an alternative (Wockhardt) for the 25 mcg tab, as Activis don't do one.  I'd been told to always stick to the same manufacturer so wasn't happy at having to mix two in my dose.  Opinions varied among pharmacists and contributors to various support sites as to the importance of sticking to the same one - but interestingly, the pharmacist I spoke to at Lloyds Head Office said that some of the generic drugs made her ill!  Anyway, as Activis don't do a 25 mcg, I didn't have much option.  After reading your post today, I've done some research of my own (too knackered to do much else!) and found that lots of people have had identical effects to me from the Wockhardt 25 mcg (it's the only strength they do).  I've phoned my Thyroid Onc and her secretary will get her to call me back tomorrow.  I'm going to run this past her although she never mentioned the 'brands' issue.  Think the way forward will be to buy a pill cutter and split the Activis 25 mcg tablet.  Hard to tell whether it's affected my thyroid levels yet, or whether it's just made me feel lousy.  Have also discovered today that this Wockhardt drug company which manufactures in Mumbai has had a MRHA recall on several of its drugs on 11 July this year because of quality control issues. My God - they tell us not to 'Google'.  Thank goodness we do and that we pool our experiences.  Thank you so much.  Maureen x",
      "MessageIndex": 5,
      "PostDate": "19/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63658/arimidex-help",
      "Title": "Arimidex? Help!"
    }
  ]
}