{
  "AuthorID": "Mazziex2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazziex2",
  "Posts": [
    {
      "AuthorID": "Mazziex2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazziex2",
      "Content": "Hi Annca I had my reconstruction 8 weeks ago (diep flap) and so far so good. I did have a bit of swelling in the tummy but this was only fluid and my consultant drew this off last week. Everyone that has seen mine has commented what a good match it is to my other breast. I can honestly say I have not regretted one moment of having this done and can't wait for the nipple reconstruction. Good luck and let us know how you get on.",
      "MessageIndex": 14,
      "PostDate": "28/11/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10762/after-reconstruction",
      "Title": "after reconstruction"
    },
    {
      "AuthorID": "Mazziex2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazziex2",
      "Content": "I felt exactly the same, wanted to feel whole again. It's ok everyone saying you can't see any difference by wearing a prothesis but they didn't have to live with it. Once you have the operation you can't do much for the first 6 weeks but I found that doing a little walking everyday helped also I would advise you to do the exercises that the physio gives you. Must say you really do have to rely on family and friends for help with domestic tasks. Boredom was the thing I found hardest to cope with, when you are normally a very active person then all of a sudden you can't do things it is very frustrating but at least I can drive now and get out and about. As I have previously said I have not regretted one moment of having this operation and can honestly say I feel whole again!",
      "MessageIndex": 17,
      "PostDate": "30/11/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10762/after-reconstruction",
      "Title": "after reconstruction"
    },
    {
      "AuthorID": "Mazziex2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mazziex2",
      "Content": "Hi Von I had my reconstruction (diep flap) 6 weeks ago and the area around my belly button is swollen although I do have a nice flat tummy. Do you know if this is normal and how long will it take to go down. I am seeing my consultant next week but any advice would be great.",
      "MessageIndex": 12,
      "PostDate": "05/11/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10762/after-reconstruction",
      "Title": "after reconstruction"
    }
  ]
}