{
  "AuthorID": "meganx2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meganx2",
  "Posts": [
    {
      "AuthorID": "meganx2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meganx2",
      "Content": "Hi Diane I had a lumpectomy 2002, followed by chemo, then a back flap recon like you (no implant), and then the radiotherapy. Why the recon before the radiotherapy.....i don't know. The lumpectomy left a large \"hollow dent\", due to having to remove a large amount of surrounding breast tissue. Following the radiotherapy, after time, i noticed the \"dent\" seemed to be \"sinking in\" again. I looked as i did before the back flap recon. It was later explained that the radiotherapy treatment had damaged the tissue/muscle, so hence it had \"sunken\". The surgeon explained that another back flap was not an option to correct it, so suggested implants would be a good choice. I had the implant recon last Oct and am very pleased with the result! Hope this is of some help to you Diane. Good luck with the rest of your treatment, let us know how your doing Megan X",
      "MessageIndex": 1,
      "PostDate": "14/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10738/radiotherapy-following-reconstruction",
      "Title": "Radiotherapy following reconstruction"
    },
    {
      "AuthorID": "meganx2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meganx2",
      "Content": "Hi Smiler, The test you are refering to is called a DEXA test, which will measure your bone density and confirm if oesteoporosis is apparent. Can't help with advice on Tamoxifen...just had the Zoladex. Good luck with check up next week, hope it goes well. Megan",
      "MessageIndex": 4,
      "PostDate": "17/04/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10714/zoladex",
      "Title": "Zoladex"
    },
    {
      "AuthorID": "meganx2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meganx2",
      "Content": "Hi All Don't know of anyone else who has been on Zoladex, the norm seems to be tamoxifen or arimadex. I have been on Zoladex for 5 years now with a few side-effects, but the worst being it has caused me being diagnosed with oestoporosis (sorry prob spelt wrong!).Anybody else on this?",
      "MessageIndex": 0,
      "PostDate": "18/03/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10714/zoladex",
      "Title": "Zoladex"
    },
    {
      "AuthorID": "meganx2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meganx2",
      "Content": "Hi Patri, thanks for taking the time to reply. I was 36 when diagnosed and have just finished my 5 years of zoladex. Oncologist thought it would be the best thing for me to help preserve my fertility. Can't agree more about the hot flushes! Only came off it 1 month ago, so still getting the flushes. I have asked the oncologist if it's likely my periods will return, but they can't tell me for sure....they say a 30% chance of returning. It was only when ihad a fall a year and a half ago, and fractured my foot and broke several toes that i was sent for a bone desity test. Discovered i had osteoporosis then, which was caused by my time on the zoladex. I asked if now that i was coming of the zoladex, would the osteoporosis get better, but was told unfortunateley no,the damage has been done. How you finding the tamoxifen? I hear many different stories about it. How much longer do you have left on it? best wishes Patri Megan",
      "MessageIndex": 2,
      "PostDate": "04/04/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10714/zoladex",
      "Title": "Zoladex"
    }
  ]
}