{
  "AuthorID": "Meggie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meggie",
  "Posts": [
    {
      "AuthorID": "Meggie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meggie",
      "Content": "Thanks for your replies ladies. I am trying to keep positive while I wait for my op  and then the results. Angiosarcoma is a very very rare cancer (of the blood vessels) which can very rarely be caused by radiotherapy. My oncologist has only seen one case in 10 years and said the chances are 10,000 to one of anyone who had had radiotherapy developing it. I'm trying not to panic but I don't want to be that 1 person!  I guess they are being super cautious but I was hoping that there might be someone else out there that had had a similar scare? Xx",
      "MessageIndex": 3,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81532/angiosarcoma-result-of-radiotherapy",
      "Title": "Angiosarcoma, result of radiotherapy"
    },
    {
      "AuthorID": "Meggie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meggie",
      "Content": "Hi I am hoping someone out there may have some information/advice on this condition. I had 2 WLE LAST year followed by radiotherapy x 15 which ended in August and tamoxifen (now changing to Arimidex). At my oncology review last week my oncologist commented on a small red mark on my breast ( a bit like a birthmark). The mark appeared in January this year and at the time I showed it to my surgeon and BCN at a time when I was having problems with a seroma. Both said it was nothing to worry about and it hasn't grown since. Now my oncologist is saying it has to be removed as a possible angiosarcoma although he has told me this is very rare and a result of radiotherapy. Saw the surgeon yesterday and due to have yet another WLE in two weeks. No scan, and having had a mammogram in May feeling very confused why that didn't show anything. Does anyone out there know anything as I'm am feeling more worried than I did after initial diagnosis!! Having felt back to my old self for a few months I now feel like the ground has given way beneath me....",
      "MessageIndex": 0,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81532/angiosarcoma-result-of-radiotherapy",
      "Title": "Angiosarcoma, result of radiotherapy"
    },
    {
      "AuthorID": "Meggie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/meggie",
      "Content": "Oh QueenofSwords and Gillywilly thank you so so much for posting! It is such a relief to hear from you both and to hear your positive stories.  I have been worried sick!  My oncologist seems to be a regional specialist in this cancer as he told me he has patients referred to him from other hospitals. I am in Northampton.  I have faith in him but unfortunately the surgeon I have been referred to is the one I saw for my first two WLE. At the first op he completely missed the tumour and was fairly arrogant about it. He only apologised months later when I was still having problems as a result of the 2nd op. He saw me six months ago and told me the red mark was nothing!  He is doing the surgery again and I do feel anxious. What are my options? I have been told he will take the red mark away along with a clear margin. I was wondering why I have not had a scan or would this, like the mammogram not necessarily help? I agree Gillywilly that I need to be assertive with this as so few medical people seem to have knowledge. I would be interested to know what you would expect for me at this stage? I will join the Facebook group too, thank you for that info too - I had made the mistake of scouring the internet and have felt very scared as a result, it is so good to hear your experiences and positivity. Again you are two immensely kind ladies, thank you again and much love to you both and your families xx",
      "MessageIndex": 6,
      "PostDate": "23/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81532/angiosarcoma-result-of-radiotherapy",
      "Title": "Angiosarcoma, result of radiotherapy"
    }
  ]
}