{
  "AuthorID": "merlin885",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/merlin885",
  "Posts": [
    {
      "AuthorID": "merlin885",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/merlin885",
      "Content": "HI Lola  Im not in your group but thought I could offer a little reassurance to you . I had my first post treatment examination under anaesthetic in Sept after chemoradiation for anal cancer . I was told that the mass was still there so the surgeon had taken biopsies for pathology .  An agonising week later I went for the path results and was given the all clear .My surgeon explained that it is not unusual for there to still be \"something\" there particularly if the tumour was a large one to begin with and that with time it should improve the lump could be still breaking down even thou it is no longer cancerous or it could be scar tissue from the rtx . Try not to worry to much at this stage as this could be an explanation for your results too.. I think the non stop crying is to be eexpected  after all the trauma and upheaval of diagnosis and treatment it's almost like post traumatic stress and hardly surprising. Huge hugs  Michelle  xxx",
      "MessageIndex": 3,
      "PostDate": "09/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55821/so-why-cant-ibstop-crying",
      "Title": "So why cant ibstop crying?"
    },
    {
      "AuthorID": "merlin885",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/merlin885",
      "Content": "Hi Karen, Im not in your group, different cancer, but wanted to re-assure you that you won't need the nasty sickness and diarhoea inducing poison for the RT mapping scan. You'll be scanned and then marked by tiny dot tattoo's that will be used to line you up with the laser for RT to be directed exactly where needed. Quick and simple, and nothing to worry about. Good luck and hugs Michelle xxx",
      "MessageIndex": 3,
      "PostDate": "14/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55955/pre-radiotherapy-question",
      "Title": "Pre Radiotherapy Question"
    }
  ]
}