{
  "AuthorID": "met428",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/met428",
  "Posts": [
    {
      "AuthorID": "met428",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/met428",
      "Content": "Thank you so so much for your kind words. Each time some thing wasn't right I text my friend, and my daughter, so I have a record of all dates. I was truly happy that the surgeon who did my lumpoctemy and msstectomy, the nurses too, but from their it went down hill. I found a top consultant at another NHS hospital, he also teaches plastic surgery and specialises in breast cancer reconstruction. My GP referred me the same day I went to see her, today I recieved an appointment for 6th December :) I cried with relief, the BC nurse there told me there has been medical negligence, no way should a surgeon doing a mastectomy cut across the cleavage to the other breast, I explained it looked like a web on a ducks foot, it's like having a piece of string on the edge of my boob, running along my mastectomy to my arm, each time you move your arm sidewards the string is already taught, but you have to move your arm, so from my boob it pulls the skin out ( forward) I bet if I could see under my skin you would see my other boob underneath. The scar is quite high so I can't hide it. The stitches were pulled so tight all the scar except across my cleavage is inverted, I have to get a cotton bud to clean all across the scar like going into a deep groove, scars should be on the surface and flat. You are spot on, as I do feel mutilated, im going to complain and fight all the way, I've now got to have surgery to put this mess right, I was NOT going to have reconstruction, so to put me through this is unbelievable. The surgeon who did my first 2 operations was on holiday. But who ever sewed me up was old and blind, or young and learning, but to tell me they do surgery and don't really think about what you will look like after was very hard to hear, I could tell the way I was stitched up like a nothing, but didn't expect to hear a consultant say it. Surely a surgeon should take that into consideration, if not, why not.? I would love to chop his b- Los off and sew them some where else, see how he likes it! Xxx",
      "MessageIndex": 4,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143082/not-happy-with-surgery",
      "Title": "Not happy with surgery."
    },
    {
      "AuthorID": "met428",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/met428",
      "Content": "I was diagnosed with invasive duct breast cancer, my right side. I was told I caught it early, such a small lump, nothing to worry about. I had the lump removed and waited 4 weeks for the biopsy results. The results were cancer cells were found in my lobulars and in my glands, also not enough clearance, so I opted for a mastectomy. The same surgeon did my mastectomy, he removed a scar I had on my breast from surgery at 16yrs old, he said it wasn't a nice scar and now in left with one neat scar. I ended up with a seroma, I kept telling nurses I had an infection, they insisted I had not by touching my chest with the back of their hand. I told them I was on fire but still they said I wasn't. The following week I had chemo, I phoned that night to say I felt I had, had a reaction, she phoned me back to say the nurse said you can't be, phone the BC clinic tomorrow.  I phoned BC the filling morning and was told to go there, I just made it and collapsed, my heart racing then slowing right down, felt cold, then raging hot. Nurses insisted no infection and took me to Oncology, they said a blood clot, gave me an injection and sent me home. I went back the next day for a scan, no clot. I told the consultant I felt so I'll but he insisted I went home. The next day I was taken to A & E and was taken immediately to reside, given fluids and antibiotics and they got my heart beat back to normal. I was admitted. Tests revealed I had cystitis in my scar, a seroma and absess. I had also had a severe reaction to chemotherapy, the Oncologist removed me from having any more chemo stating in lucky to be here and if I had any more it would kill me. After 12 days in hospital the BC consultant I never had an infection in my scar and suggested the medical team look elsewhere,eon, he was going to reopen my scar and sew even though I had a bright red rash over my right side. He said to go home. I was sent home with no medication. 2 days later rushed to A & E a temperature of 38.9 I was put on antibiotic drip, paracetamol. I had to have urgent surgery to remove the seroma, absess and infection. I was told by a different surgeon he was going to open my scar, remove the problem and sew me back up, I would look the same. I was discharged the next day, I got home and looked at my scar. I was in shock, nothing like my thin scar, , stitch lines, a huge 1 inch fold going up towards my neck 4 inches long, he had pulled my top skin to the right, so folded it to fit, he pulled the stitches so tight that it's gathered, he cut further than my scar and cut across my cleavage, it is so tight it lifts like a ducks webbed foot. I contacted the hospital immediately, they refused to see me until it healed, I finally got to see the BC clinic and they said no one will operate to put it right because of infection. Im so angry, I have not been listens to and treated like I didn't matter. ",
      "MessageIndex": 0,
      "PostDate": "22/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143082/not-happy-with-surgery",
      "Title": "Not happy with surgery."
    },
    {
      "AuthorID": "met428",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/met428",
      "Content": "Hi, not long winded, ((((( Hugs )))))sorry you've had that news too. While I understand they rely on the mamagram, as ' experts' They should know that results of these machines are never accurate, so should never tell a person \" oh it's early a simple operation's \" The devistation it causes to your family is awful, yes we need hope, but to what extent? So in my case, 22mm removed, but ended up getting a good clearence so they said. But waking up with half a boob? So I asked the registration, his reply \" no concern of yours we saved your life\" REALLY? I then found out that after my operation they had an urgent meeting and all I was told by the nurse it was very close to my chest wall, Doesn't that say it all? So in for my results 3 weeks later, that consultant read my results, never looked at me once, refused to answer questions ask the nurse. Invasive duct carcinoma, estrogen possitive, pr possitive, HER2 Negative, very close to chest wall. DCÎ found in the lobulars. C has spread in to 3 possibly 3 LYMPTHno nodes. So 2nd op, if it doesn't work a 3rd operation to remove.This is not the best for me, they are not being honest, So I phoned and told them NO not having 2nd then 3rd, get rid now. So these machines DO NOT WORK, all they do is show yes or no. I've been told I have a nodule in my lung behind where my cancer from my boob is, saying it's 4mm too small to see, so I've to wait 6 months for another CT scan. Meanwhile all this waiting, it's spreading. Sorry, but I'm annoyed and they are not telling me the whole story, so I'm going sign consent Tomos and I'm demanding the true facts of their urgent meeting. My op is 26th but I'm expecting the same out come as your self, I just want to deal with it with facts. I'm not a person that can't deal with it, but I can't have my head spinning. Now that's long :) xxxx",
      "MessageIndex": 3,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133876/why",
      "Title": "Why?"
    },
    {
      "AuthorID": "met428",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/met428",
      "Content": "Hi Abby, I find it's best to have an open mind, every one is different, you may have good equipment at your hospital, but I know mine doesn't. Try not to worry, focussed on going through each stage one at a time to get through that, you need to be strong minded to get back on the road to recovery. You can do it, stay positive. (((((( Hugs ))))))) xxxxxxx",
      "MessageIndex": 4,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133876/why",
      "Title": "Why?"
    },
    {
      "AuthorID": "met428",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/met428",
      "Content": "I went for a mammagram in May, I was told I had breast cancer \" don't worry, you've caught it in time, it's only come up as highly suspect\" 3 weeks later I am told, \" you got it early, stage 1, just a simple operation to remove it, then tablets, that's it, you'll be fine\" Operation June 22nd, \" good news, we removed your tumour, a good clearence, I'm sure we got it all, no LYMPTHno nodes removed, all looks good\" Next day I found I had half a boob, this doesn't sound right. 3 weeks later, the clearence isn't enough, we going to reopen you to remove more, unfortunately it's spread to lymph nodes, so we will remove all of them, and really sorry we found another type of cancer but in your lobulars, we will remove 2. If this doesn't work in 3 weeks, we will do Mx.\" So yes, \" You got it early\". Why? Why say this, why play it down. I'm not having 2nd operation, I'm going straight for a mastectomy, I'm not taking the risk thank you very much! Why can they say \" your lucky you got it early\" when clearly I haven't!!!",
      "MessageIndex": 0,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133876/why",
      "Title": "Why?"
    }
  ]
}