{
  "AuthorID": "Mich25",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mich25",
  "Posts": [{
    "AuthorID": "Mich25",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mich25",
    "Content": "Hi, First post in the group but already a member of the Eye Cancer Group (diagnosed 6 yrs ago).  Wondering if anyone would be willing to share experiences of having an excisional biopsy (realising that no 2 people have the same experience!).  A few weeks ago I found a tiny lump on the edge of my right breast. Left it a few days then decided I should get it checked out. Saw my GP, got referred to breast clinic via the 2 week cancer pathway. Initial appointment; mammogram, ultrasound. Ultrasound scans picked up suspicious areas I hadn't felt. An FNA was done on the original lump (ouch! no warning how painful it would be without local anaesthetic!). The Dr wasn't happy doing a core biopsy on the larger mass because it was against my chest wall. I went back a week later for that, during which 4 samples were taken. A week's wait and then back for all the results. I expected to be discharged but all the results had come back inconclusive. The MDT had discussed my case and because of the previous (high risk) eye cancer, wanted to remove the lumps via an excisional biopsy. This was done last Weds (28th), under GA. I've had multiple GAs before (this was my 16th) so expected the tiredness from that. Incision is 6/7cm long, quite high on my right breast. Pain wise, it's not too bad, more aches than pain. The incision is glued, internal stitching inside. I was told I'd get the results in 10 days - 2 weeks, via letter. My mood since the op has been rock bottom, endless crying, zero appetite (I have multiple health problems). Yet everything I've read says recovery is quick etc etc etc. Would really value hearing from anyone else who has had the same procedure. Huge thanks :-)",
    "MessageIndex": 0,
    "PostDate": "02/04/2018",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154098/recovery-after-excisional-biopsy-under-ga",
    "Title": "Recovery after excisional biopsy under GA"
  }]
}