{
  "AuthorID": "Mighty Mouse",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
  "Posts": [
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Morning Ladies Thanks for all your replies. I know what you're all saying makes sense. Thing is, I've just passed 2 years since my diagnosis, had 3 ops (diep took 10 hours), chemo, Herceptin, seromas, neutropenic sepsis and what appears to be permanent peripheral neuropathy, a family bereavement and faced it all with positivity and good humour. I even relished being bald and never wore scarves or a wig. How could such a thing as a belly button be such an issue? Maybe the bats have finally taken residence in the belfry. I've already been told I'll probably need some tweaking so I'm sure however it ends up, it can be improved. MM x",
      "MessageIndex": 4,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115863/navel-gazing",
      "Title": "Navel gazing"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi I've just had my dressings removed today and wounds checked after my diep recon last week. I had a look in the mirror when I got home and the one thing that I noticed is that my previously very neat little 'innie' belly button now looks very ugly and I'm sure isn't even central after it's repositioning. It could be that this will all settle down in time when the swelling goes down etc but I was just wondering if anyone else has experience of this. It seems a bit fickle to be bothered by it after everything else I've had done but I was looking forward to wearing bikinis again and I might be going down the Bridget Jones pants route to hide it. My surgeons may have been drop dead gorgeous but think they may have forgotten their specs on that day lol! MM x",
      "MessageIndex": 0,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115863/navel-gazing",
      "Title": "Navel gazing"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi I just had recon last week about 18 months after my double mx. I didn't want it done immediately so by the time I made the decision, the plastc surgeon said he wouldn't do it till after I'd finished Herceptin. I'm not sure if that's the norm or just his personal preference. I was lucky, all 3 BCNs at my hospital are excellent and I was told I could just contact them at any time to start the ball rolling. What I did though was ask to be added to the list when I saw my consultant at my first follow up a year after diagnosis. It also depended what kind of recon you wanted as my breast surgeon does implants and  LD flap and he just pencilled your name in to his diary but I wanted diep to he made the referral for me. Maybe you could even go through your GP. Do you know what kind of recon you want? MM x",
      "MessageIndex": 1,
      "PostDate": "05/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115904/reconstruction-after-treatment",
      "Title": "Reconstruction after treatment"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi Rosie I'll give you my side and my mum's. Mum was diagnosed 7 years ago at 70. Had 2 WLEs and then a mastectomy. She had 1 positive node and was advised to have chemo and radiotherapy. She turned down both but might have considered radiotherapy if she hadn't had to travel to another hospital 20 miles away to have it. After turning those down she felt she had to give the letrazole a chance. She stuck it for the 5 years but it was a difficult 5 years as she found the side affects really hard to cope with and has said if she found herself in this position again she'd not be taking any treatment at all. Currently, she's doing great and feeling 10 years younger than she did while on the tablets. I was diagnosed in 2014. 35mm tumour, grade 3, her2 and er positive. I had wle and bilateral mx. Also had chemo and Herceptin. After all that I was prescribed tamoxifen. I lasted a few weeks on it and then stopped. I've turned down zoladex, ovary removal and a hormone test to see if they could give me any of the aromatase inhibitors. I decided enough was enough. I wanted my life back and the side effects of tamoxifen were so awful, it wasn't worth living. I was making everyone's life hell and it just wasn't worth it. My surgeon, GP and bcn have all agreed quality of life is what's important. The problem is no one knows what's going to work so they throw everything they have at everyone. I'm not so sure the Dr who prescribed tamoxifen to me would be quite so keen on it if he'd had to live with me when I was taking it! I've no regrets. Yes, it might come back but it could come back even on the hormone treatment. I'm not going to waste time worrying or dwelling on it. I would never try and tell anyone what to do. I'm just saying go with your gut and do what's right for you. All the best x  ",
      "MessageIndex": 14,
      "PostDate": "22/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127385/declining-further-treatment-after-breast-surgery",
      "Title": "Declining further treatment after breast surgery"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi I had diep in September and still finding it tough at times. Be prepared to be in it for the long haul and don't rush things. I was pretty fit beforehand and have bounced back from everything else but seem to have lost my bounce this time. Mine was delayed so unlike you I didn't have the mx and node clearance to contend with at the same time. For weeks after, I had to roll out of bed and a couple of times my foot slipped on the carpet. OMG that hurt! Turning over in bed still hurts a bit and I feel like I'm wearing control pants as my abdomen is so tight. I'm planning on returning to work the week after next .That will be 4 months I've been off which is longer than I expected. It'll be good to get back to some sort of normality. Good luck with your recovery. Be kind to yourself. MM x",
      "MessageIndex": 4,
      "PostDate": "12/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121150/recovery-after-mastectomy-diep",
      "Title": "Recovery after mastectomy/diep"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hey Pepys You have my sympathy here. Trust me, it's not just you. I had bilateral mx last year and only decided on recon about 6 months later. I was messed around with appts, letters and phone calls which were all unnecessary and a waste of everyone's time for 6 months until I cracked and made a complaint. Initially I got a letter saying it was taking longer than expected to investigate than they thought. Then I got a letter just telling me the treatment times. Then one saying 'sorry you weren't seen on time'. Really? And that' my final response? My issue wasn't so much the waiting but the incompetence and stress of being messed about. I don't think we are seen as people with lives. We're just numbers and faceless names on a list. My employer was great considering how much they were also being messed around but it was really stressful and embarrassing. I finally had my surgery at the end of September. I was in touch with my BCN throughout who also had no success chasing but at least I knew she was trying and I could sound off to her. Could you try speaking to yours? MMx",
      "MessageIndex": 1,
      "PostDate": "10/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117871/still-waiting-for-diep-reconstruction-help",
      "Title": "Still waiting for DIEP reconstruction! Help!"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi Pepys I had diep too which accounted for the long wait. I had been prepared for that as I know 2 consultants are required and a long theatre slot. The plastic surgeons split their time between other hospitals too which makes it even harder. I didn't have a problem with them as it must also be frustrating for them but the admin was a disaster. I'm north of the border so there is no PALS here and you make a complaint to a centralised NHS dept so you don't even get to meet anyone. I gave up after the last letter as I didn't have the energy for it any more and as I've now had the op, it seems pointless although another part of me knows they're being let off the hook. My BCN is amazing. She works for Macmillan too and I can pop in locally to speak to her whenever I need to at a drop in centre. I've heard how unhelpful some can be which is a real shame. I was also told pre ops have to be done again after 3 months. I got away with being just over. A lot of it was done again on my admission anyway. I really hope you get a date soon as I know only too well how much it all messes with your head. I'm more than happy to answer any questions. If you want to send a friend request, you can pm me if you prefer. MM x",
      "MessageIndex": 3,
      "PostDate": "11/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117871/still-waiting-for-diep-reconstruction-help",
      "Title": "Still waiting for DIEP reconstruction! Help!"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi Spudzmum I'm 14 weeks post diep and my abdomen is still really tight and very uncomfortable at times. I had a follow up 2 weeks ago with the plastic surgeon and I mentioned it. He just said it was early days. I still struggle with clothes and mostly wear things with elastic waistbands. If I wear jeans, I can't use a belt and can't wait to change out of them after a couple of hours. I have a friend who had her diep last February and she says she still feels like that at times too. Looks like we're just going to have to be patient. I can't eat as much as I used to be able to without getting bloated but as I'd had to gain weight for the op to begin with, that may be no bad thing. MM x",
      "MessageIndex": 1,
      "PostDate": "02/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120641/tight-abdomen",
      "Title": "Tight abdomen"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi I was told I couldn't have diep if I had any abdominal scars but that might have just my surgeon's preference. I'd worked really hard after chemo and my mastectomies to lose weight and get fit only to be told by the surgeon I didn't have enough stomach fat so had to put it back on again. My bmi would have been closer to 30 but still had barely enough fat for an A/B cup. It's obviously just down to the fat distribution on my body. If he'd been taking it from my backside and thighs, it would have been a different matter lol.",
      "MessageIndex": 1,
      "PostDate": "15/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125059/diep-after-c-sections",
      "Title": "DIEP after C-Sections"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi Lou Mine are Amoena and are excellent but I saw an Amoena fitter at the hospital who tried different shapes and sizes before we came to a decision. It's not something which would be easy to buy online with confidence I wouldn't have thought. Have a look at Amoena's website. They have a help page regarding fitting but also have shops all over. Have you spoken to your BCN? If you were given a prosthesis which isn't suitable, maybe you'd be entitled to a replacement. MM x",
      "MessageIndex": 2,
      "PostDate": "18/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115103/buying-a-prosthetic-breast-on-line",
      "Title": "Buying a prosthetic breast on line."
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "Hi there I had diep recon 2 weeks ago. Mine was delayed so I'd had the mastectomies about 18 months ago. I was in surgery for about 10 hours so it is a long op. I imagine the surgeon has already prepared you for what to expect. I woke up in high dependency with 4 drains, 2 drips, a morphine pump, oxygen, a catheter and also connected up to ecg monitor and blood pressure cuff which inflates about every hour to check your obs. Also, the nurses will check your flap/flaps regularly to make sure the blood supply is ok so you'll get very little peace for the first couple of days. I won't lie, I did think a few times. why on earth did I do this but once the catheter comes out and the physio comes in and you can get out of bed and move around, you start to feel much better very quickly. Just go with the flow, do what the staff tell you and take as much pain relief as you need. Don't let yourself get constipated which opiates tend to do. It's not pleasant having to strain on the loo with your abdomen wound. I am finding the abdomen the worst thing. There is very little pain from the new breasts but my abdomen is tight and really tender. Be careful when sitting up and getting out of bed. Hold on to your stomach if you need to sneeze as that hurts. I'd forgotten that they also reposition your belly button and that was a shock when I looked in the mirror. It's not to pretty just now but I'm assured it will look a lot better when it's healed. I got home after  days and am trying to get out and have a walk every day. It would be all too easy just to vegetate on the sofa. Do the exercises the physio gives you as they help a lot. If you want to know anything else, please ask away. MM x",
      "MessageIndex": 6,
      "PostDate": "11/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116261/operation",
      "Title": "Operation"
    },
    {
      "AuthorID": "Mighty Mouse",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mighty-mouse",
      "Content": "I used Nivea q10 for years but suddenly during chemo it didn't suit me any more. My daughter uses Clinique dramatically different so I borrowed some of that and it's fabulous and you only need a small amount. It soaks straight in. I've carried on with it ever since. I'm sure if you went into Boots or Debenhams, they would give you some testers to try. I also found that chemo made my skin look amazing and was told I looked nothing near my real age. MM x",
      "MessageIndex": 3,
      "PostDate": "13/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116376/looking-for-a-good-light-thin-moisturiser",
      "Title": "Looking for a good light (thin) Moisturiser ?"
    }
  ]
}