{
  "AuthorID": "Millie99",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
  "Posts": [
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Hi there I had the oncotype dx test earlier this year, this is for anyone who is considered borderline as to whether chemo would be of benefit.  Depending on your score, your oncologist will then be better placed to advise whether chemo for you is a good option.  Its about probability of recurrance and as the test is actually on your own tissue is really helpful in determining how likely it is that your cancer will recurr. The waiting is awful but at least this way you will know whether you actually need chemo or not.  Wishing you the absolute best.  x",
      "MessageIndex": 8,
      "PostDate": "06/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114413/oncotype-dx",
      "Title": "Oncotype dx"
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Hard to believe it I know, but these days will end.  Life will one day get back to much as it was before this horrendous thing called breast cancer entered your life.  Im 18 months down the line.  I do not think about BC all the time, its more it pops in and out of my head .  I even forget I had it then, I remember, I think wow, Ive come a long way. The awful anxiety, fear and everything associated with this, does go (for most of us). I really wish you the very best of luck. Try not to look too far ahead, get yourself over the hurdles as they appear. x",
      "MessageIndex": 2,
      "PostDate": "24/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127458/that-morning-sledgehammer",
      "Title": "That Morning Sledgehammer"
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Hi there Its difficult knowing what decision to make.  Being told you are in the intermediate group is not very specific.  Are you just over the threshold of low risk or are you at the upper end of intermediate therefore with a higher risk?  Knowing this information would be much more helpful to you.  Different oncologists will have a slightly differing view on this anyhow.  In my area, as a group the oncologists agreed that in the intermediate group, a score of 25 + indicated chemotherapy is desirable.  Less that 25 benefits are significantly less and therefore its not recommended.  My score was 19.  I did not have chemo and felt the decision had been based on sound fact rather than opinions. Wishing you all the luck possible.  xxxx",
      "MessageIndex": 31,
      "PostDate": "14/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117969/oncotype-results-and-should-i-have-chemo",
      "Title": "Oncotype results and should I have chemo?"
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Within 24 hours my operated breast went reddish all over. Already seen Consultant and had mammolgram/ultrasound and biopsies. Inflammatory breast CA cant be ruled out even though both mammogram and U/S were clear as apparently its difficult to detect without biosies.  Im terrified. I happened to have a flu job 24 hours previous and wondered if this could have anything to do with it. My consultant mentioned it could be a reaction to the radiotherapy, albiet it was 18mths ago, possibly triggered by the vacciine. Any thoughts from anyone.xx",
      "MessageIndex": 0,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139363/red-breast-came-on-suddenly-18mths-after-radiotherapy",
      "Title": "red breast came on suddenly 18mths after radiotherapy?"
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Oh bless you, its the best possible news.  Great to be sort of out the other side. Have a wonderful Christmas, Im sure you will.x",
      "MessageIndex": 30,
      "PostDate": "21/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120010/i-have-my-results",
      "Title": "I have my results"
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Hi all Im due to have my 1st mammogram/review following diagnosis & treatment 1 year ago. I didnt have chemo in the end because I had the oncotype dx test which showed that chemo in my case would have little benefit as my score was 19. Now Im worrying that my chance of recurrance is higher because i didnt have chemo, and whilst Ive managed to have a pretty good year, put much of this behind me, bang its all back.  I feel afraid, can barely face going in  case its more bad news.  i want to be strong but just now feel unable to be. Does anyone know much about statistics of recurrance in 1st year?",
      "MessageIndex": 0,
      "PostDate": "04/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117572/1st-mammogram-checkup-after-treatment-one-year-down-the-line",
      "Title": "1st mammogram/checkup after treatment. One year down the line."
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Hello.  This is a difficult decision for you to have to make.  Your result is in the intermediate group.  I believe the threshold agreed by the oncologists  (in the area I live) is 25 and anyone over that would be advised to have it.  The number 25 is to try and main some continuity between different oncologists. My result was 19, I didn't have chemo.  My friends result was 27 and she was urged to have it. No one can decide for you, all I can say is given that result I would have agreed to have it. Let us know what you decide.  Hugs.xx",
      "MessageIndex": 14,
      "PostDate": "02/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124218/should-i-or-should-i-not-have-chemotherapy",
      "Title": "Should I or Should I not have Chemotherapy?"
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Hello there I just want to tell you that in November 2015 I too was diagnosed with grade three breast cancer.  I have just had my first mammogram/check a year later and Im clear of cancer. At the start the diagnosis is devastating, having tests and waiting for results is just gruelling, you have to live through this as we have and do to understand. The statistics for survival are now impressive, think of that, your life more than likely will get back to something representing \"normal\". Try to just get through each hurdle as it happens. Wishing you the very best of luck.  I include a virtual hug..............",
      "MessageIndex": 23,
      "PostDate": "09/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117779/the-long-wait",
      "Title": "The long wait."
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "I really hear what you are saying and how frustrating it can be when people say things about how lucky you have been and it could have been worse and that as you hadnt had chemo you surely are ok.  I too have felt at times that their is something of an exclusivity between those that have chemo and those that dont. If you havent had chemo, there are still so many emotions, not least, should I have had chemo, would my chances have been improved if I had?  W eve all had cancer, we all have our needs., whether its grade 1 or 3 stage 1 or 5.  I think to those looking at this from the outside, we are in a certain group and that determines how we are and how we should be treated. I wish you all the luck in the world for a great recovery. x",
      "MessageIndex": 14,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122931/your-cancer-wasn-t-bad-then",
      "Title": "Your cancer wasn't bad then...."
    },
    {
      "AuthorID": "Millie99",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/millie99",
      "Content": "Hi there. The oncotype dx test determines how likely it is that your cancer will recur. This is based on a sample of your tissue. A low score, under 19 means recurrance is so unlikely that chemo is not worthwhile. Its a more accurate way of making the decision. If your tumour was grade 3, along with one or two other things,you are likely to be invited to have the test. Xx Best of luck",
      "MessageIndex": 6,
      "PostDate": "24/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105701/possible-chemotherapy",
      "Title": "Possible chemotherapy"
    }
  ]
}