{
  "AuthorID": "Milo1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/milo1",
  "Posts": [{
    "AuthorID": "Milo1",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/milo1",
    "Content": "Hi everyone I'm having 6 cycles of FEC-T chemo prior to surgery to (hopefully) shrink my large (7cm)tumor.  Last week i had cycle 2 and my side effects are quite manageable (the usual nausea, taste/stomach changes and hair loss) and I'm sure I'll handle it  if they get worse. If I'm honest I have never accepted chemo treatment - i feel it is such an all-over body attack with potentially serious long term side effects that i have always questioned do the benefits really outweigh the risks?  I talked to my onc and the bc nurses at great length before starting treatment and as much as everything they said made logical sense it has still never sat easy with me.  We didn't have the full results before starting treatment but they were adamant that treatment should not be delayed and so its began.  Now we do know - the microbubble shows that it has not spread into the lymphs and the bone and ct scans are clear (i know I'm very lucky).  However it is invasice ductal cancer, grade 2 (poss 3) and HER2+. I'd really like to know how other people have got their heads around whether chemo is right for them or not - I can't be the only one to have doubts.  The day to day side effects are not concerning me - i know my body will repair itself as far as skin, nails, hair are concerned but what about the studies that show long term damage to heart muscle, long term damage and possible cancer of the stomach, long term kidney and liver damage, irreversible damage to bone marrow? The doctors have told me its a low risk and very small percentages but it can still happen. I'm no new age hippy whose \"body is a temple\" type but it seems to me the complete \"blanket bombing\" of the whole body by chemo for a tumor restricted to the breast is way over the top. I really want to accept this treatment and believe it is the right way forward but I need convincing.  Before I talk again to my onc (he will be pleased!) I just wanted to hear your views.  Thanks for any words of wisdom xx",
    "MessageIndex": 0,
    "PostDate": "05/07/2011",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39996/concerns-about-chemo",
    "Title": "Concerns about chemo"
  }]
}