{
  "AuthorID": "MinaC",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/minac",
  "Posts": [
    {
      "AuthorID": "MinaC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/minac",
      "Content": "Thanks for your replies. The main reason I had posted re this  was to see if anyone else had anything new to try. I can assure you all I am not sitting waiting. After the first dose of chemo you are never sure what is expected or normal during it. Once I was over the initial few days, I felt great and was happy to wait to see onco. The oncos were great I have the best anti sickness drugs. I am the sort of person that like to be proactive in my own care too, so I tend to research symptoms/treatments so that I have as much info as possible (its the nurse in me). This second dose has surprised me. I guess I hoped that the new drug would have helped avoided the same symptoms and it did help but I understand that what is happening is that my GI lining is simply reacting to the chemo (as is expected), it is inflamed. I have taken ranitidine with some good effect and I am getting a call from my GP today and I will ask for omeprazole which should help also. In my area we have a Cancerline (like calling NHS24/direct) but the end result is call GP anyway. When I see the oncos next I will obviously be discussing all of this so that my dose/meds etc can be altered accordingly. I guess with each dose I am going to have to play it by ear and see how my body reacts.",
      "MessageIndex": 5,
      "PostDate": "16/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75240/feeling-sick-for-6-days-post-chemo",
      "Title": "Feeling sick for 6 days post chemo"
    },
    {
      "AuthorID": "MinaC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/minac",
      "Content": "Hi JoanLeslie No I haven't tried fasting. I looked at some of the research - looks v interesting. Let me know how you get on if you do fast. Mx",
      "MessageIndex": 7,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75240/feeling-sick-for-6-days-post-chemo",
      "Title": "Feeling sick for 6 days post chemo"
    },
    {
      "AuthorID": "MinaC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/minac",
      "Content": "Hi to everyone present and past with this nasty disease. I just wondered if anyone had any new advice that may help. I've just had my second FEC treatment and still feeling pretty awful. Following the first treatment I had vomited and felt nauseous for five days, then the feeling lifted and I was able to get pretty much back to normal. Don't get me wrong I did all that I was supposed to, took anti emetics, drank and ate small amounts frequently, rested etc. My oncologists were great and gave me aprepitant for my second dose. Unfortunately, even tho I've had no vomiting, I feel as if I have had stomach flu for last 6 days. My whole GI tract feels inflamed all the way to my rear end! I've even had diarrhoea.  My temp is fine.  My anti emetics (other than stop vomiting) have hardly helped. I'm worried about having to go through this 4 more times, about spending more time feeling this poorly despite having being given excellent meds and doing all the right stuff. I'm wondering if my chemo dose is too high. I'm happy to discuss all this with my oncology drs before the next treatment and I am sure they will try their best to help but I wondered if anyone had similar experience of these side effects and how they (and their onco) managed it? Many thanks in advance Mx",
      "MessageIndex": 0,
      "PostDate": "14/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75240/feeling-sick-for-6-days-post-chemo",
      "Title": "Feeling sick for 6 days post chemo"
    },
    {
      "AuthorID": "MinaC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/minac",
      "Content": "Hi Anniegirl1 thanks for your reply.  I'm at day 10 of 2nd cycle now and the feeling is starting to ease. My gp prescribed omeprazole and i'm still taking my ondansteron. i find that eating almost constantly helps...thank god i'm thin! Surprisingly my mouth is fine. I floss and brush as normal but use corsadol regularly. I had been drinking lots of fruit teas but after this round i can only drink plain water. Too much acid I'm afraid in most fruit for me now...which is really annoying as I love my fruit and veg. Hopefully I can get back to it now that it is easing a bit. I wish I could take honey as I thoroughly believe it can do miraculous things but unfortunately, I hate it! And yes, taking the yoghurt to get some friendly bacteria back in my gut. I'm dreading my next round but I think they will reduce the dosage as i can't, don't want to tolerate that again. I can't imagine how low my blood counts will be. Just need to avoid people and places for a while to keep safe. Well done on reaching your last chemo...what a relief for you. Good luck...I can't wait till I'm at that place too.",
      "MessageIndex": 9,
      "PostDate": "18/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75240/feeling-sick-for-6-days-post-chemo",
      "Title": "Feeling sick for 6 days post chemo"
    }
  ]
}