{
  "AuthorID": "mirandamuses",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mirandamuses",
  "Posts": [
    {
      "AuthorID": "mirandamuses",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mirandamuses",
      "Content": "I posted a question and thanks to those who replied. I also sent an email to the nurse via this website, to which I received a reply in two days. It was reassuring and highlighted that the information I had read and quoted, see above, was a little ambiguous. It just goes to show how important it is to check anything that one is unsure about. There is so much information available and it can sometimes be unclear, misleading, even wrong. This is part of the email I received, for those who are interested and who contacted me: \"The information you’ve found about cells in the liver not being affected by chemotherapy applies only to the normal cells that make up the substance of the liver. These cells don’t have a high turnover and so don’t suffer too much from many of the side-effects associated with chemotherapy drugs. That appears to be what the author is emphasizing. In contrast, because cancer cells are growing and dividing relatively quickly, the chemotherapy still acts on them. This true no matter which organ they have spread to. Secondary and primary tumours should be equally affected because drugs such as epirubicin and cyclophosphamide penetrate throughout the body in the bloodstream.\"",
      "MessageIndex": 5,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10857/question-about-efficacy-of-chemo-treatments-on-secondary-cancer-in-liver",
      "Title": "Question about efficacy of chemo treatments on secondary cancer in..."
    },
    {
      "AuthorID": "mirandamuses",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mirandamuses",
      "Content": "My mother has been diagnosed with secondary breast cancer. It has spread to her lungs and liver in small volume. She has two tumours in one breast, it has affected the lymph nodes, a tumour of 1.5cm in one lung and a small mass 8mm in the liver. Hello, I thought I would join this online group so that I could ask some questions and for support for myself. She started taking Arimidex before Xmas and has been taking it for two months. Next week she has elected to start chemo. It will be six cycles, as a day patient, with three week between sessions. I wanted to see if anyone can give me some information regarding the efficacy of these chemo treatments on the primary breast cancer sites, as well as the secondary tumours in the lung and liver. I read that \"It's also important to remember that organs in which the cells do not divide rapidly, such as the liver and kidneys, are rarely affected by chemotherapy\". www.breastcancer.org. If this is so, should we expect to see the tumour stay the same or grow, rather than shrink? And what about the lung? If so, does anyone have any experience of how quickly this type of cancer can spread? She will be given two chemo treatments: Epirubicin and Cyclophosphamide Thanks for taking the time to read this, and if you respond, to reply.",
      "MessageIndex": 0,
      "PostDate": "06/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10857/question-about-efficacy-of-chemo-treatments-on-secondary-cancer-in-liver",
      "Title": "Question about efficacy of chemo treatments on secondary cancer in..."
    },
    {
      "AuthorID": "mirandamuses",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mirandamuses",
      "Content": "Thanks so much for replying, it means a lot, esp as your stories indicate that this is not necessarily the case. That is good to know. My mum, 66, is dearly loved and has always been so healthy, so the diagnosis came out of the blue. It knocked me back a bit when I first read the statement on www.breastcancer.org. I had no idea that this could be the case with the ineffectiveness of chemo on bc cells in the liver (and kidney). Having read your replies, it seems that this is not necessarily the case. I know that it is important to check info and sources carefully, particularly on websites. I will call the Helpline on Monday, thanks for the number, and will talk to someone. I am also going to write to the oncologist to see what she says. I understand that everyone is different and it is difficult to compare treatments/prognosis etc, but to both of you, thanks again for taking the time to reply. Keep smiling.",
      "MessageIndex": 3,
      "PostDate": "08/02/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10857/question-about-efficacy-of-chemo-treatments-on-secondary-cancer-in-liver",
      "Title": "Question about efficacy of chemo treatments on secondary cancer in..."
    }
  ]
}