{
  "AuthorID": "Mishtoon",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
  "Posts": [
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "Good luck to you!!  I am sure you are trepidacious (sp?),  I feel the same as starting in two weeks but echo your feelings of doing something about it.   It is what it is and I'm sure you will deal with every step as it comes along. Thinking of you and sending you loads of positive vibes!! Mel",
      "MessageIndex": 1,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80053/hooray-hooray-starting-ec-chemo-today",
      "Title": "hooray hooray....starting EC chemo today!!"
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "HI there, I would also take in earplugs and if you have one, one of those eye covers with an elastic back that you can get on planes to shut out the light.  I found the hospital incredibly  noisy so it's hard to get rest.  Nurses did not quieten down until around midnight and then the noise started up again around 5.30am.  I did at one point ask for a sedative/sleeping pill to help me sleep as I was 'wired' after the operation which they were reluctant to give me, but did in the end.  that helped me sleep around 5 hours in a row.  I took feminine wipes and also general wipes to wipe under armpits and other areas (!) as it is difficult to wash and you will feel horribly smelly until you can manage a shower.  Also change for the shop trolley that comes round as you will find it hard to walk far for a while.  My family borrowed a wheelchair and took me out around the hospital grounds which was lovely.  An ipod for music is good as I found it hard to read. I am six weeks post-op (mastectomy).  it is hard to begin with but does gradually get easier, believe me.  Also do your exercises as instructed as I missed out three days in a row for one reason or another and my arm ceased up.  But then don't overdo them either... Good luck, it will all be fine. xxxx",
      "MessageIndex": 3,
      "PostDate": "28/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80213/any-advice-for-mastectomy-op",
      "Title": "Any advice for mastectomy op?"
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "Hi, Home alone and sad as driving home from work today I scratched my head and a big clump of hair came out.  It is coming out loads all over my head.  I was expecting it (first FEC 6th August) but not for another couple of weeks so it was sort of a shock but I'm not sure why as it was going to happen.  Have been feeling so positive lately and I cried in my car all the way home :-(  Another step in this journey that none of us wants to be on, I guess. Anyway, trying to be positive I've just ordered myself two bandanas and am looking at Raquel Welch wigs online.  The question is, do I wait to see if it falls out or go and get my head shaved tomorrow?  Any thoughts on that one? Mel",
      "MessageIndex": 0,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "Thank you Moo46. I've had a referral to a hairdresser near to me for a wig, but have to pay towards the cost which is okay. It's a good idea about a fringe when wearing a bandana, I hadn't thought about that. Yes, I wonder about condition when it grows back. I guess what will be will be. Many thanks, Mel",
      "MessageIndex": 11,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "Hi Noodles77 Mine is coming out now, 2 weeks after first FEC.  My head started to feel sore and then it started itching before, when I scratched my head, a reasonable lump of hair came out in my hand.  I find it painful at night, I think where I am lying on my head in one position for a while, and it has woken me up as it's very painful.  But I have a warm shower in the morning and that seems to help.  I didn't try the cold cap as I can't stand cold.  I've had my hair cut very very short, I hate it, but it is helping with the transition to no hair at all.  I've got my wig and am taking it to the hairdressers on Wednesday so she can shape it.  Off to buy a couple of lovely new hats today too!  I've decided to embrace the whole headwear thing - wig, hats, scarves, anything new for the head, quite exciting at one level :-) Good luck and I hope you don't lose too much of your curly hair :-) Mel",
      "MessageIndex": 16,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "What a lot of lovely replies and so fast!  I love this site.  Thank you all.  It helps to talk it out on here and not feel so alone as I know we are all in it together and facing the same rollercoaster ride.  I've gone ahead and ordered a wig and two bandanas!  I already feel more empowered.  Hubby is away but when he is back tomorrow I might get him to just shave it all off.  I am losing loads all over and its quite depressing so yes, I might just take control and go bald.  It won't be that long before it grows back.  People keep telling me they know people whose hair grew back a completely different texture or colour.  It will be interesting to see what happens. Thank you all for taking the time to reply.  I appreciate it!! Mel",
      "MessageIndex": 6,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "So sorry to hear what has been happening for you Willow74.  That is all particularly stressful, upsetting and all you really need is for the NHS to 'do it's stuff'.  Perhaps you have got your bad experiences out of the way now and moving forward things will be better.  Fingers crossed for you. My own experiences have only been positive - great breast care nurses, fantastic surgeon, lovely chemo nurses, everything has flowed smoothly.  Maybe I'm unusual?  I also agree that working for the NHS must be at times very, very difficult.  Would you feel up to, at some point, feeding back your experiences so that they can perhaps take this into account in their processes?  I won't help you now but might help with a positive outcome for others moving forward. The best of luck to you, I hope things get better. xx",
      "MessageIndex": 4,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81581/not-so-great-experiences-with-nhs---good-news-stories-please",
      "Title": "Not so great experiences with NHS - good news stories please!"
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "HI All, I had my first fec last wednesday.  I was terrified too but I have to say that the staff were fantastic and I very quickly stopped being scared.  The nurse who put in the picc line was a real hoot and we were laughing loads by the time he had finished, he was worth his weight in gold.  Then the nurse who administered the chemo was so clear, supportive, consistent, I felt very well supported.  I felt incredibly nauseous the first evening but the meds have been great and I can't say I have felt very sick.  I have been incredibly tired however and today is the first day I feel more 'me'.  As everyone else says here, I think it is important to listen to the nurses, take the meds as prescribed and rest when you need it.  And the nurses are on the end of the phone so it's important to phone with any and all small or large concerns.  That's what they are there for. I've just completed my form to go for a wig consultation - feeling quite excited actually.  I had my hair cut short three weeks ago in preparation and am going to try to find a wig which sort of matches my new style.  Mainly for my 13 year old son who is a bit worried about having a bald mum. At least now we have started treatment, it is one step nearer to the end.  I have a calendar and am crossing off each day.  And am planning in some lovely treats along the way, depending on how I feel. Hang in there everyone. xxxxx",
      "MessageIndex": 7,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80978/starting-chemo-and-terrified",
      "Title": "Starting chemo and terrified!"
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "Hi booklover.  I had a mastectomy on 9th June (having been diagnosed on 19th May).  I spent the two weeks after the op in tears, feeling very low.  I put it down to everything - the diagnosis and the op - all catching up with me.  Even now if someone is remotely nice to me, I feel tearful.  But I sought support via a cancer support charity which is helping.  I think only time will help plus the support of friends and family. I would recommend counselling and if you can find this via a cancer support counsellor even better as they will understand what you have been through and are going through. Good luck! xx",
      "MessageIndex": 5,
      "PostDate": "13/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/79593/discomfort-and-general-low-feeling-after-mastectomy",
      "Title": "Discomfort and general low feeling after mastectomy"
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "Hello everyone, Thank you for your lovely supportive comments. I've decided not to go with the cold cap.  I had decided I would just lose my hair as I don't want to lose some hair and not all so yesterday I went and had my hair cut dead short.  In fact I love it and I've had so many positive comments about it I think I might try and find a similar style wig for the duration, that way people may not really notice.  My lovely hairdresser said to find one and she will style it for me. At the moment I'm feeling very positive as feeling much more myself post-surgery which is a shame considering I'm just about to be blasted with nasty chemicals.  But it is a means to an end and I'm determined to focus on the end goal. I do hope to sail through FEC, poemsgalore, you do tend to read and hear both ends of the spectrum.  Fingers, toes and everything else crossed :-) xxxxx",
      "MessageIndex": 4,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80010/chemo-starting",
      "Title": "Chemo starting"
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "I'm three months post mastectomy and reconstruct. Feeling loads better. Hang in there as there is an end to it all. U can only put one foot in front at a time and that's where r u at that moment. Don't feel bad about it. You will get there and it sounds like you have support which is great. Good luck xx",
      "MessageIndex": 4,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82114/bad-sunday-hoping-for-better-monday",
      "Title": "Bad Sunday ! Hoping for better Monday!"
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "Hi, I know I'm not the only one.  Starting FEC treatment in two weeks (following diagnosis 19th May, mastectomy right breast 9th June, fortunately not in lymph nodes but chemo and radio just to be sure as one can be).  My head is in the right place to start treatment now.  It was not a few weeks ago, post surgery when I felt pants. This site is so great for information about the whole process, I do really value it.  I might well be posting on here as treatment starts and progresses, for advice and support.  Hoping it won't be too 'bad' but who knows.  It is what it is.  In fact I am having my hair cut short today mainly as I think this will help my family make the transition from my nearly shoulder length hair to bald, assuming that happens. Wish I wasn't part of this club but as I am thank you to everyone on here for all the advice, it really valuable.  Thanks to MacMillan for all the supportive guidance, etc, it really does help!! Mel",
      "MessageIndex": 0,
      "PostDate": "22/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80010/chemo-starting",
      "Title": "Chemo starting"
    },
    {
      "AuthorID": "Mishtoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mishtoon",
      "Content": "Hi Katie123, I wondered how you are doing following your first FEC? I am starting chemo on Wednesday so am also a newby in that sense so very interested to hear any and all side effects and how to deal with them. Hope you are not feeling too 'bad' but as you have not posted on here (from what I can see), hope you are okay...?? Hang in there. Best wishes, Mel",
      "MessageIndex": 8,
      "PostDate": "04/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80256/i-am-a-newby-and-potential-guinea-pig",
      "Title": "I am a Newby......and potential guinea pig!!!!!!!"
    }
  ]
}