{
  "AuthorID": "MissyB78",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/missyb78",
  "Posts": [{
    "AuthorID": "MissyB78",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/missyb78",
    "Content": "My mom (who has won the fight twice) only told us after she finished treatment the 1st time around and there was a family fallout.  2nd time around, she told us when she got the diagnosis and we really ralled around for her. My MIL has recently been diagnosised with stage 4 (not BC - kidney that has now spread to her liver ) and has decided not to tell the rest of the family. Its only me, FIL and herself that knows. My OH doesn't even know. She doesn't want to burden them as they battled when she first got diagnoised and they thought the removal of the kidney would be it. Alas this not the face.   I admire you for telling them - they have time to digest whats going on.  They have the opportunity to spend time with you and get prepared. When I spoke to my mom to find out how to handle this (keeping MIL secret from my husband), she told me to encourage her to tell people that she had cancer.  She (my mom) was told by her doctor to speak about it and let people know.  She didn't listen to his advice the first time around (nearly 25 years ago) but 2nd time around she did.  She said she felt better for it and she didn't feel like she was keeping a secret and could focus her energy on fighting the fight.  I know of friends that have family members whose cancer went to terminal and I have heard them repeated on a number of occassions 'why didn't they tell me sooner?' My question to you is, have you got someone who you can talk too?  Who you can have an open and frank discussion  with and not worry about upsetting? A person that will make you smile when days are grey and knows how to get you to have a good belly laugh?  I guess the reason my MIL opened up to me, was cause: 1) I called at the wrong time (she was at the doctors and upset and I know something was up) 2) I have been through similar to my mom Sending you loads of healthy wishes - remember to keep positive!",
    "MessageIndex": 4,
    "PostDate": "08/03/2013",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58415/protective-mum",
    "Title": "protective mum"
  }]
}