{
  "AuthorID": "Moiry",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/moiry",
  "Posts": [
    {
      "AuthorID": "Moiry",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/moiry",
      "Content": "Hi,  I have just had my third and this is the fuzziest!  If anyone has any cure for that spacey feeling I would love to hear about it.  I, too, have found that it takes a good 7 days before you feel back to normal.  The first three to four are the worse althought I don't get the fatigue just the horrible metallic taste, the nausea and this horrible \"not really here\" feeling.  Conversations are proving really difficult. It is frustrating being at home and not being able to do things or go out and look for scarves etc as once you are back to normal you are back at work! Good Luck Mary-Jane",
      "MessageIndex": 4,
      "PostDate": "11/05/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/37883/just-had-first-fec",
      "Title": "Just had first FEC"
    },
    {
      "AuthorID": "Moiry",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/moiry",
      "Content": "Thanks for this Tessa, I am at the same stage as Clair and this chain has been really useful.  I visit Guys Chemo Unit tomorrow.  So far the Breast Cancer section has been fantastic but a two hour wait in Oncology nearly finished me off.  But...I am going to take a leaf out of your book and think go with the flo nothing is going to happen quickly. Apart from the hair I just don't do nausea very well so hoping you are right that most things can be managed.  Is the gap between treatments three whole weeks and you go back on the fourth or you go back in the third week?  Just need to plan my start to avoid clashing with the long weekend that I have had booked for over a year. Really inconvenient this breast cancer...! Mary-Jane",
      "MessageIndex": 40,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36121/1st-chemo-on-wed",
      "Title": "1st chemo on wed!!!"
    }
  ]
}