{
  "AuthorID": "mom23",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
  "Posts": [
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Sending you a big hug. I am in a similar boat.  Mam got cancer four years older than I am but unfortunately, she didn't survive.  But things have moved on massively since 2009 and she wasn't receptive to chemo.  I went to GP on Friday for routine check and got referred due to what I hope is a cyst. Doc found lump, I cant find it but it hurts a lot.   Half term here too so aiming to stay busy.  I don't have appointment yet.  I am going to ring hospital on Monday to see what they say. Did your appointment come through on the same day you saw your doc?   Fingers crossed for all of us :-)  ",
      "MessageIndex": 3,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149704/keeping-fingers-crossed",
      "Title": "Keeping fingers crossed"
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "woohooot fabulous news. Hope you have a nice celebration. Look after yourself x",
      "MessageIndex": 12,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149704/keeping-fingers-crossed",
      "Title": "Keeping fingers crossed"
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "thats a great service.  Hopefully - all will be clear - very best of luck x",
      "MessageIndex": 5,
      "PostDate": "11/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149704/keeping-fingers-crossed",
      "Title": "Keeping fingers crossed"
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "thanks so much Mrsox.  Didnt make it for coffee, fell asleep instead when I was supposed to be working! Thanks everyone, this place is wonderful x",
      "MessageIndex": 13,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Bel64  - Oh your waiting is worse than mine. My heart goes out to you and sending you a huge hug.   I have a daughter but she is only 7 (surprise present lol) so I haven't said anything. But my mind is going overboard with the implications of this and her etc. Then I tell myself to shut up - it's a cyst and all will be fine.  My sister rang last night all chat about her new job and upcoming wedding and while I played along, it was hard.  My other sister is dealing with her own issues.  I am really glad you have a supportive hubby and am keeping my fingers crossed for you for tomorrow.  I hope everything turns out great.  As you said the treatments for BC are way ahead of what was available for our moms.  And they are both looking down on us from somewhere - at least i hope they are.  Please let us know how you get on. Sending you big hugs and keeping fingers and toes crossed for tomorrow.   Take care of you x",
      "MessageIndex": 17,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "ahhhhhh  so I promised myself I wouldnt tell anyone until this was over.  Hopefully I will never have to say a word and it will all pass like a storm in a teacup. But my sister emails me asking can she come and stay for a visit.  She has to book a flight. I email back to say kids arent off that week (true) and I may have a work thing (false)  but I dont want her coming into the middle of this if its the wrong news.  So now I get an email saying we (her and teenage son) want to come for weekend  \"but if you dont want us to....\"   AHHH.  Do I ignore and wait to tell her on Tuesday why I dont really want anyone near me at the moment or do I just come clean and tell her why I dont want anyone near me.  We aren't that close anymore - used to be but then life got in the way.  So by not answering, I could cause family rift.   But I just want to hide and press fast forward to Tuesday afternoon.  I know I am luckier than anyone else on here as they have yet to find anything and I will probably get all clear but my hormones must have gone into overdrive.  I am like a witch. My 77 year old dad rang last night with his LONG list of complaints and illnesses and those of the extended family - who has gone in for an op and who is fighting cancer and who's pet goldfishes grandmother took a walk in the park.  See I am a witch!!! ",
      "MessageIndex": 30,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Thanks Bel54 - I hope your sisters were supportive :-)  I always thought the one stop clinic meant you got all the results that day. I never realized you would have to wait again.   I copied and pasted LeoLady's advice more or less.  Why didn't i just say I was sick at the moment?  That would be easy.   My brain isnt working.  It's too busy going into overdrives.  I am being such a wimpy goose over this whole thing it isnt funny. ",
      "MessageIndex": 34,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Have a question for you lovely ladies. I found some mammograms and ultrasound reports that were done back in January 2006 - (I feel old!!) I somehow remembered the breast doctor said to keep them for when she saw me next.  My husband reminded me as he corrected her and said it was \"if\" I saw her again. He didn't like her implying I would be back lol Anway I was wondering if I should bring them with me or just leave them at home.  They show what I think was a cyst or fibroadenoma - 0.36cm in the left breast - its highlighted - looks like a black blob in the middle of the grey - the one I have issues with now. But at that time I dont remember having a lump. It was when my mam was really ill and someone suggested I get tested.  I had private cover then so it was a self referral. She said at the time I had lumpy boobs. I suppose it could be a fibroadenoma which would make more sense with the lumpy boobs comment.  Do you think if I show up with these in hand they will think I am a fruitcake?  Would it be better to forget about them and start over so that I get fully checked?  I know I never had a biopsy done but this yoke back in 2006 couldn't have been anything sinister as it's like 12 years ago.  Finding them has made me feel better.  The pain could be coming from that yoke and the lump the doctor found could be it as well.  ",
      "MessageIndex": 36,
      "PostDate": "19/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "thank you Leolady (you are like my lucky charm xx) and Bigguy - no you are not too late x I will bring them with me.  Just had the letter with the questionnaire arrive so filled it in. I am feeling good now - funny last week I was beyond scared. Now I just want it over and done with.  I am sure it is a cyst or something like that.  This time tomorrow all will be revealed - give or take an hour or so. ps that does not sound nice bout your legs, hope that was sorted out. x",
      "MessageIndex": 39,
      "PostDate": "19/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Leolady  Everyone has been amazing but you were the one who really held me together. I thank you from the bottom of my heart and wish you every bit of luck and success I can. I would love to have a drink with you.  You are an amazing woman.  Like all the women on here.  Thank you xxx",
      "MessageIndex": 41,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "thank you GBear, what a nice thing to do :-) Very best of luck to you too. x",
      "MessageIndex": 48,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Hi there I am torn between wanting to cry and wanting to give myself a kick in the butt.  I do not panic. That is not me.  When my mum was ill with breast cancer, all the medics thought I was one of them as I stayed so calm and remembered her meds etc etc.  She was four years older than me when she found the lump. She died in 2009.  I think this experience is bringing all that back. I went to the GP yesterday for a routine check as I had just been on HRT for three months. I had a hysterectomy at 42 for endo and adenomyosis. I didnt want HRT due to my mom but recent hot flushes made life uncomfortable so I started it. Doc suggested breast exam at three-month check.  I am 48 in three weeks.  My left breast was annoying me on and off - sharp pain every so often but no lump.  So I turned up yesterday at his office and he had a lady doctor with him due to chaperone. As he was examining me,  he said to her you always start exam when the patient is sitting up and then you ask them to lie down if you find something. He did three years in breast clinic before being a GP.  Then he told me to lie down! Behind my nipple hurt like anything when he pressed against it.  He said he had felt something when I was sitting up and that something had moved to behind my nipple.  Possibly a cyst but he was fast tracking me just in case for a mammogram, ultrasound and biopsy.   I just said thank you but seeing you can move it it will be fine.  His response was yes it could be a cyst but if I got that wrong you would be seriously pissed off.   So I think he wasnt worried. But since i got home I can't think straight.  Most of all it's made me understand the hell my mom went through - she found a lump and a week later had a mastectomy and it had already spread to the lymph nodes.  Six months prior she had a clear mammogram. She had top private cover in another country though.  I know it's likely to be a cyst due to the pain and movement etc. But how the heck do I get my head to sit on my shoulders? I told my hubby, he was so lovely. But can't tell anyone else.  My sisters would freak - they get checked annually as they live in the same country as mam did and thats procedure. They are both younger than me.  My best friend is just recovering from pancreatitis with serious complications so I can't burden her.   Ah even reading this back i want to shake myself.  Did you guys feel that?   ",
      "MessageIndex": 0,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "OMG I feel like crying.  So post came and went with nothing. I rang the local BC clinic and dealt with a horrible woman. She was a .... had a nasty case of morning blues. She told me they would be in contact, it wasn't the private service you know and the two weeks start from when they have the referral.  She was so horrible, it wasn't funny.   Then rang the doctors, they hadn't sent off paperwork. Got missed on Friday but they were so lovely to me.  They are sending it today.  I think that's why I feel like crying - they being so nice after the witch in the breast clinic.  (Arent they supposed to be nice in the breast clinics?)  Do you guys get numbness down your arm as well.  The pain is coming and going - stabbing pains - with numbness down the arm. But still can't find the lump GP found.  Maybe I've burst it with pressing it so much lol ",
      "MessageIndex": 9,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "I would love to join you for a coffee Lindsay :-) I rang the GP and they were lovely. Then I rang the hospital and turned out they had booked me for a routine appointment on the 23 Feb.  They seemed more concerned with how I got their phone number!  I asked them if I needed to bring ultrasound photos from 10 years ago (last time I had any issues) and they said - \"No sure it's a routine appointment.  Bring them if you want.\" I said it should be the one stop clinic and they said we don't do that here, you got the wrong hospital!  I had to restrain myself.   Rang the GP back, the secretary didn't know why the hospital didn't just transfer appointment to sister hospital. But she was lovely. She sorted it all out and my appointment is for 20 Feb at 14.40.  I am so glad I rang as otherwise, I would have waited three weeks to see the wrong people.   Mmm maybe I should go eat Chocolate cake!!",
      "MessageIndex": 11,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "I've been thinking of you all day today.  So sorry you didn't get full picture and have to go through more waiting but I think its fabulous how you are dealing with it.  The fact its so small is hopefully great news.  Keeping fingers crossed again for you.  and Sending you a big hug.  You are bound to be up and down for a while so be kind as Leolady says.  Pretend you are someone else going through this and be as nice to yourself as you would be to that person.    Hugs, Rach",
      "MessageIndex": 25,
      "PostDate": "14/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "How do you always pop up with an amazing answer Leolady - thank you so much xxx I have emailed her virtually what you said lol Thank you xx No matter what news i get on Tuesday, this place has already helped me so much.  I am determined to help as a volunteer once this is over.    Thank you again  -have a wonderful weekend.   Now where is my broom,  ha. ",
      "MessageIndex": 33,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Very best of luck Bel64 we will be there with you in spirit.  Hope you get good news.  Will be thinking of you tomorrow.  Take care x",
      "MessageIndex": 22,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Ah phone just rang again. Hospital confirming the appointment which they also confirmed last night and this morning. Maybe they want me to cancel lol  Tuesday can't come quick enough.  I have stopped googling but I keep checking things on this site. The women (and men) are nothing short of amazing.  Makes me feel like a fraud for even posting yet I know you guys understand.   Take care everyone.   ps I just learned today that Amazon prime do a seven day trial on MGM movies.  I might just pull a duvet day on Friday, Sat or Sunday and watch old movies. ",
      "MessageIndex": 26,
      "PostDate": "14/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "That is so true Grogg.  At this point, my boob feels like it is going to fall off.  LOL My husband came home with seeds and fruit for me to eat to cure my arm :-)  He is sweet.  Take care x ps public servants are usually kind and nice, the one I got this morning mustn't have had her coffee yet.",
      "MessageIndex": 15,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Bel64 Not 54 .  AHHHHHHH I can't read anymore lol ",
      "MessageIndex": 35,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Thanks Gail :-)  Yes doing my best to stay away from Google.  Nightmare stories on there.  Thank you :-)   It helps that people understand.  And I am lucky not to be going through the stuff other people are having to deal with. ",
      "MessageIndex": 3,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Thanks Jammy I hope you are right :-) ",
      "MessageIndex": 4,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Ah Grogg, thank you for the lovely reply. I am so sorry about your mom and sister.  My mom was 66 when she eventually died.  She was the most positive person going. My dad has survived prostate cancer so yeah the big C is a delicate topic in our house. That's why I am not saying anything to them.  From reading on here and the sites like Breast cancer care, I am sticking to its a cyst and I won't have to tell them anything. I really really appreciate all the good wishes.  Initially I was told no HRT due to Mom but my sister is on it due to her hysterectomy and her doc said it was fine.  I dont think I will go back on it though. Thanks again everyone.  xx",
      "MessageIndex": 8,
      "PostDate": "10/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Thanks Bel64 I will :-)  Following your journey too. The waiting should be a great weight loss diet apart from I appear to be on a \"see it, eat it\" diet lol  Take care everyone",
      "MessageIndex": 29,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Ladies, thank you all so much. I am clear.  Mammogram and Ultrasound showed up nothing but a group of cysts which account for the pain. I am so relieved. Thank you each and everyone of you for your support. I am in awe of every one of you and wish you all the very best in your journey.   Thank you xx",
      "MessageIndex": 40,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    },
    {
      "AuthorID": "mom23",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mom23",
      "Content": "Thank you all so much guys.  And leoLady  I Love curries.  xx Good luck all of you x",
      "MessageIndex": 46,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149665/went-for-checkup---fast-tracked-to-breast-clinic-freaking-out",
      "Title": "Went for checkup - fast tracked to Breast clinic, freaking out."
    }
  ]
}