{
  "AuthorID": "moonicorn",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/moonicorn",
  "Posts": [
    {
      "AuthorID": "moonicorn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/moonicorn",
      "Content": "Hello Restory This is my first time posting but Ive been reading posts since I was diagnosed last year.   was in almost the same situation as you as there is only my and my 14 year old daughter living together and no other family close by.  I found that for the first 3 or 4 days following chemo I was okay so I would stock up on ready meals for day 7 to 14 (as these were the days I felt most ill.  My daugher would help out with putting the food in the oven etc and I allowed her to order pizza and chinese takeaways on days I could not get out of bed.  If I needed to stay in bed she would come into bed with me and we'd snuggle.  It was hard for her but I kept saying that the more she didn't complain the quicker it would all be over.  After day 14 my energy levels would increase and i would start to feel better so we would have days out, shopping sprees and basically have a laugh together.  I wont lie, its hard on your own and you daughter may feel grieved that you can't do certain things, but it is doable.  My advice would be to do nice things with your daugter on the days you feel well and before you know it the chemo is behind you.  xxx",
      "MessageIndex": 11,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159461/on-your-own-with-breast-cancer-chemotherapy",
      "Title": "on your own with breast cancer chemotherapy"
    },
    {
      "AuthorID": "moonicorn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/moonicorn",
      "Content": "Hi taralou Annoying isn't it.  Most likely chemo related - the same thing happened to me - constant running in just one eye.  Mine lasted a good few weeks after chemo and radiotherapy finished.  I tried drops etc but nothing worked, then one day it just stopped.  Hang on in there Hun and it will stop - eventually.  I was more vexed that I couldn't wear eyeliner for weeks  - shallow I know lol xx",
      "MessageIndex": 5,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160048/3-5-weeks-post-chemo---watery-eye",
      "Title": "3.5 weeks post chemo - watery eye"
    }
  ]
}