{
  "AuthorID": "Mountainhiker",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mountainhiker",
  "Posts": [{
    "AuthorID": "Mountainhiker",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mountainhiker",
    "Content": "I first want to say, I am amazed by the wonders of medical science in treating breast cancer. Secondly, the courage and bravery of all the mothers, wives, sisters and daughters who are dealing with breast cancer is something I can never imagine having in light of such a challenging situation.  I just want to get paid my grief off my chest. My mother is 61 years old and she was diagnosed back in June 3rd. I am my mother’s youngest son and I am 34 years old. In the U.S. we do not have the National Health Service but I am blessed that my mother has outstanding medical coverage with a Preferred Plan Provider through her retirement from working with the county  and my father’s supplemental coverage through his employment so all her medical expenses are convered. My mother is retired and receives a pension and I am glad she does not have to work. I realize how blessed and fortunate we are as a family because many people in the U.S. struggle financially when a cancer diagnosis arises. My mother’s diagnosis hit me very, very hard. I think a cancer diagnosis hits the family members harder than the person who has it! My mother has demonstrated tremendous bravery and she continues to live a very normal life. In fact we still do things together and she even takes care of my grandmother who has dementia. She cleans my grandmother’s house and does all the chores. My mother is the kind of person who doesn’t like to talk about things. She is very stoic and doesn’t say one word about it. In fact she has lived with her HER positive breast cancer for five years. She is the kind of person who does not want to upset people and like her mother and grandmother they are both very private about their health. I can understand why my mother did not want to upset me. My mother also used to in the past years mute the TV when breast cancer commercials would come on television. She is stage 4 because the breast cancer has spread to her sternum and back. She always used to say it was rhematoid arthritis and I sort of went along with it. She also has been taking medications that slow down bone deterioration and a drug called Ibrance. But when she started to develop a numb chin and she started to lose some weight, I knew something was wrong and that was when she finally sat me down and told me about it. My mother said she takes it one day at a time. Apparently her cancer is very slow growing and she said her PET scans continue to show no metasis into the liver or other vital organs. I am still sad because cancer is cancer.  My question is that is it possible to live a long time with HER positive breast cancer? From what I gather my mother said her breast cancer is estrogen related? My mother does not have breast cancer genes in her family so,I never thought she would get it. thanks for listening.  Cancer is such a whirlwind.",
    "MessageIndex": 0,
    "PostDate": "25/11/2018",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172200/my-mother-told-me-after-5-years-of-hiding-it-she-is-her-positive-breast-cancer-stage-four",
    "Title": "My mother told me after 5 years of hiding it she is HER positive breast..."
  }]
}