{
  "AuthorID": "mum and mia",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
  "Posts": [
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "I'm going into hospital tomorrow for a single mastectomy and sentinel node biopsy.  I've just finished cleaning the house and have packed my bag.  I'm not a brave person - I'm terrified of needles, birds, spiders, blood, everything and I cry at films with happy endings - and sad endings!  So why do I feel totally detached - why am I not crying?  I feel I have no emotion - has it not sunk in yet?  I think I'm in denial.  Is this normal. I have had to be brave for my 13 year old as it's just the 2 of us but she's out with friends right now so I don't need to put a brave face on, yet I still feel emotionless. Maybe it will sink in tonight or tomorrow and Ill totally loose it :-) I would be really interested to know how others felt just befor their mastectomy.",
      "MessageIndex": 0,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134426/why-am-i-not-nervous",
      "Title": "Why am I not nervous"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "Thank you ArgyMargy, r, Jo Jo, Grogg, Terrybear55, Kerry and p - i feel more positive today (although i must admit that some serious retail therapy has helped lol).  Im going to see how i feel when i wake up (thats if i manage to get to sleep) and take it from there , although ive made up my mind that i dont want to work during chemo so if i do go back tomorrow its only for a matter of 3 or 4 weeks. Ive ordered a wig from Trendco (they didnt have the right colour in the shop) and it should arrive in a couple of weeks as its on back order.  in the meantime i went and got some root cover up stuff and i dont think it looks too bad.   Thanks for the bunnies Kerry, anythng cute and furry is always welcome.   Ive discovered two things during the last 2 months: (1) Cancer certainly messes with your head, (2) This site is full of the most understanding, amazing people - thankyou Karen xxxx",
      "MessageIndex": 8,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137123/fed-up-and-need-a-rant",
      "Title": "Fed up and need a rant"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "I dont have breast cancer anymore - i was told that after my mastectomy on 26 July.  I just need chemotherapy and radiotherapy HER2+ and ER+ I met my oncologist on Tuesday and came away feeling quite positive.  Im having TC which is kinder in terms of side effects to FEC.   So why am i anxious, moody and fed up? I see that others who had their mastectomy around the same time as me have already started their chemo or due to start next week. I know that there are different reasons etc but my appointment came today for my MUGA scan and its not until 12 SEPT ! so i wont  be starting till mid to late Sept at the earliest. Im due to go back to work on Monday (i work term time only). I really didnt think id be back on Monday as i thought my chemo would be starting.  Ive not bothered with my hair since i was diagnosed as i thought there was no point - it would be falling out in afew weeks wouldnt it.  Well it looks a flipping mess but i refuse to pay £100 for a cut and colour now, if id have known id still be waiting to start chemo id have kept my appointment and had it done the day after diagnosis.  Ill be going to work like worzel gummage. (Ive got no clothes for work either as ive lost some weight since diagnosis) To top it off i cant find a wig that makes me look like im not wearing a wig! Sorry for the rant - I know it all sounds pathetic compared to others and in the grand scheme of things all this is insignificant but i cant stop feeling like im in limbo i just want to get started and then hopefully i will stop being irrational and grumpy.",
      "MessageIndex": 0,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137123/fed-up-and-need-a-rant",
      "Title": "Fed up and need a rant"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "Hi hope no one minds me joining in and asking for advice.  I was diagnosed with stage 3 invasive ductal carcinoma and also high grade DCIS. I am due to have a mastectomy in 2 weeks.  My worry is that it may have already spread - for the past few weeks I've been feeling a little breathless, have slight pain in my back and seem to be yawning a lot due to feeling faint. I should have mentioned this yesterday but didn't and now I'm really worried as it says in my letter that if I feel ill prior to the pre op I should see my gp.  My sister rang the breast cancer nurse and she said it could be nothing but make an emergency appointment with the gp - I've just tried they are 'closed' right now.  I know it doesn't look good but  I just wondered if anyone else had these symptoms prior to treatment.  ",
      "MessageIndex": 0,
      "PostDate": "12/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133540/hi-newly-diagnosed-and-scared-it-s-already-sprea",
      "Title": "Hi newly diagnosed and scared it's already sprea"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "Thank you for the replies. Well, after calling 111 and then seeing a dr (my doctors were closed for training) I was sent to a&e.  I had a blood test, ecg and a chest X Ray and 7 hours later was told everything was clear - it could be I have had a muscle problem, reflux or anxiety - you were right.  I've only been diagnosed a day and I'm already thinking every ache and pain is deadly lol.  I've given myself a good talking to and I'm not going to panic again.  Oh and on the plus side, for the first time ever my 13 year old made me a cup of tea tonight - and I didn't even have to ask her - it has certainly been a strange day!",
      "MessageIndex": 3,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133540/hi-newly-diagnosed-and-scared-it-s-already-sprea",
      "Title": "Hi newly diagnosed and scared it's already sprea"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "I am also ER+ and HER+. If it helps, when i met my oncologist i did say i was upset about being HER+  His reply was \"well you shouldnt be - your having herceptin\". Im not very knowledgable in terms of the different types of breast cancer etc but that was good enough for me. Good luck and I hope all goes well for you xx",
      "MessageIndex": 3,
      "PostDate": "09/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137634/er-and-her2",
      "Title": "ER+ and HER2+"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "thats good to know and hopefully it wont take too long for the results  Karen x",
      "MessageIndex": 7,
      "PostDate": "10/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137634/er-and-her2",
      "Title": "ER+ and HER2+"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "Good luck with your result.  Im gong for a muga scan on tuesday prior to hopefully starting chemo - does it hurt. ",
      "MessageIndex": 5,
      "PostDate": "09/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137634/er-and-her2",
      "Title": "ER+ and HER2+"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "thankyou toxophilite.  i read about pertuzumab yeaterday and i did wonder if it was something i could have had - now i know why not, thank you.  i wont know what chemo drugs i am getting until i see my oncologist - tbh i assumed the anastrozole was the chemo drug - as you can see im clueless ! (ive only just plucked up courage today to start researching/googling)  hugs to you too xx",
      "MessageIndex": 3,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136273/her2-positive-and-oestrogen-receptor-positive",
      "Title": "HER2 positive and oestrogen receptor positive"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "gthanks  Karen - i am being very careful at what im looking at.  im so sorry that you have had issues with your heart, treatment is quite brutal isn't it and i hope it all gets sorted. ive had high blood pressure for 13 years (due to pre eclampsia when my daughter was born) xx Thanks Jo - i will keep an eye out for neratinib in future.  i hope all goes well with if you need overy removal or not.  hormones are a pain in the backside arent they - im 54 xx thanks ArgyMargy - i have now looked at NICE guidelinesn- not happy already as i will be outside the recommended that chemo should start within 30'days of surgery.  i meet my oncologist 35 days after and not sure how long will have to wait till chemo starts.  i see youbare futher down the line and hope you are doing well xx thanks Shey - we are similar arent we i wonder if my chemo regime will be the same as yours.  good luck with your 2nd round on thursday xx Karen xx",
      "MessageIndex": 11,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136273/her2-positive-and-oestrogen-receptor-positive",
      "Title": "HER2 positive and oestrogen receptor positive"
    },
    {
      "AuthorID": "mum and mia",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mum-and-mia",
      "Content": "hi.  i am really hoping someone can help me understand my diagnosis and treatment plan.  i had a right side mastectomy and sentinal node biopsy 3 weeks ago. i had - right invasive ductal cancer grade 3 24mm with vascular invasion and associated DCIS.  the total tumour size was 51mm 0 of 2 lymph nodes showed no spread tumour is oestrogen receptor positive and HER2 positive i have been told that i will have chemotherapy, herceptin, radiotherapy and anastrozole 1mg daily for 5 years. my question is does this sound like i am being given the most up to date treatment, or if i was a private patient would i be offered anything different and if so what? i am due to have my first meeting with the oncologist in 10 days time and would like to go in with at least some knowlege by hearing differing  opinions.  so far i have gone along with everything i have been told - as i believe they are the experts but i am worried that lack of funding means i could be missing out of more up to date treatment and if there is anything inwould like to have a look. i would be grateful for any comments thanks xx",
      "MessageIndex": 0,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136273/her2-positive-and-oestrogen-receptor-positive",
      "Title": "HER2 positive and oestrogen receptor positive"
    }
  ]
}