{
  "AuthorID": "mumbud",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mumbud",
  "Posts": [{
    "AuthorID": "mumbud",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mumbud",
    "Content": "Hi everyone. I was diagnosed on 21st May and was told had grade 2. I have had my op and went for the follow up to be told that is was in fact grade 3 and I am being refered to the Chemo department. They told me that I would be able to discuss why I would benefit from the treatment and then decide what I want to do. Having read all the posts I think I probably will have the chemo as I want to fight this and I am not prepared to give up. I am 54 (my children 30,27 and 25) but no grandchildren yet. I am sure that they would not offer this kind of expensive treatment if they did not think it would at least give you a longer life expectancy. This is just my opinion but for me the treatment and speed have excellent. I first found a lump and went to the doctors on May 14th, was refered to the hospital on May 21st, they did all the tests and had a needle biopsy got my results within an hour. News not good and was told they wanted me in Hospital on 15th June, all in a matter of hours quite a shock. I had to say no because I had booked a holiday to Turkey and after receiving that news I wanted to go on Holiday and enjoy myself. When I asked it it would make any difference they said two weeks would make no difference at all and I should go and have a good time. I think I was lucky as it has not gone to my lymph nodes. Obviously going for Chemo is a personal choice but when I look at my children I want to hang around and be the annoying Mum they love. Andree",
    "MessageIndex": 45,
    "PostDate": "31/07/2009",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10850/has-anyone-chosen-not-to-have-chemo",
    "Title": "Has anyone chosen not to have chemo?"
  }]
}