{
  "AuthorID": "MummyBH",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mummybh",
  "Posts": [
    {
      "AuthorID": "MummyBH",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mummybh",
      "Content": "Thank you for your responses.  It's lovely to see such caring people here. All day I have been feeling sick and headachy and i know that's through worry, so goodness knows what im going to be like next week. doesnt help with hubby being away, but my mum is going to come with me, so i wont be on my own. Rusty62, the idea of a mammogram doesnt fill me with joy, but a few moments of pain will be worth it to know what's going on. Lesley, yes I hope I won't be on here for long Jane304, I think you are right about getting the phone call and email first thing this morning (8.30am) when I'd only had my appointment at 2.30 yesterday afternoon.  I think it's the speed that's making me so upset worried.  but yes, if that's the process then im glad I won;t have to wait long. I have a question, the lumpy area is between my breast and my armpit (my boobies are large so the two practically meet lol), so how will that be seen in the mammogram?  Or will it be the ultrasound that picks it up there? Thanks again.xxx",
      "MessageIndex": 4,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160257/lumpy-area-and-sore-armpit",
      "Title": "Lumpy area and sore armpit"
    },
    {
      "AuthorID": "MummyBH",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mummybh",
      "Content": "Hi, I went to my doctors yesterday because i've been getting a sore area between my left armpit and my breast.  i cant find a lump specifically but it doesn't feel right and it gets more sore when i prod it. I've had it for a while and been putting it down to my bra not fitting properly, as i've been putting on weight.  but now i've been waking up with it sore. The doctor examined me and said she couldn't find a lump either but wasnt happy with the lumpy area. There's history of breast cancer in my Mum's side of the family (her cousin and my cousin)  Then the doc made an urgent referral with my hospital.  this morning the hospital rang with an appointment for Wed next week. I'm 49 so haven't had a mammography before, so have been looking on this website for details of what to expect. My husband is away for the next 2 weeks, I don't really have any friends that I could share this with and i'm really scared.  Just wanted to post something somewhere. x",
      "MessageIndex": 0,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160257/lumpy-area-and-sore-armpit",
      "Title": "Lumpy area and sore armpit"
    }
  ]
}