{
  "AuthorID": "muskrat",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/muskrat",
  "Posts": [
    {
      "AuthorID": "muskrat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/muskrat",
      "Content": "Hi Smiler, When my partner was given Tamoxifen, she was given a lot of leaflets explaining what side effects she might or will get. The major side effect she had was very bad hot sweats, even when it was cold she would lie in bed at night with no clothes on , no bed clothes and a fan on as well, and some nights she would also need a cold fannel on her head as well. she got them through out the day too but not as bad as she did at night. thew main side effect that she had with the Tamoxifen was the wieght gain which has made her very unhappy, what with the change in body shape because she had a double mastectomy, but the weight gain as well, sometimes i find her crying because of it. she also got cramps in her calfs that made her scream out during the night and i would have to gentle massage her legs as you could feel how solid the muscle had become when the cramps were there After her scare in January she had her Tamoxifen changed to Arimidex, and although she has the occassional hot sweat the seem to have almost disappeared, she still gets some calf cramps, and we think she may have lost a bit of weight hope that this helps",
      "MessageIndex": 4,
      "PostDate": "22/07/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10972/alternatives-to-tamoxifen",
      "Title": "Alternatives to Tamoxifen?"
    },
    {
      "AuthorID": "muskrat",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/muskrat",
      "Content": "Hi Anna,  Hope that you are feeling ok. My Partner had Breaast Cancer and had FEC before she had Docetaxol, she was frightened after the Oncologist told her about all the signs and symptoms of the chemo. They have to tell you this as it is the law that they inform you of any symptoms that you might or will get whilst undergoing this chemo. The chemo she found was slightly better in the fact she didnt feel nauseus like she did  with the Fec she was awful couldnt do much. but with the Docetaxol she got a sore mouth and sore feet which is easily treated with a mouth wash which you take before each meal, or you can get fruit drinks that contain all the vitamins and minerals that you need they are called um will look it up for you and send you another message. she had two lots of cream for her feet and her hair started growing back quick funny at first like a clowns top was still bold but it grew all around the sides and at the back that was two years ago and she had just had her hormone tablets changed from tamoxifen to amaratiosol Wrong spelling i think will check for you. most important thing is when you feel tired have a rest, dont fight it, well at times you probably wont be able to fight it many a time my partner fell asleep in her meals, but i found that when she slept i would sleep so that i wasnt knackered. just have a positive attitude and you will fly through it any other questions just ask if i can answer  the question i will best wishes Julie best wishes",
      "MessageIndex": 1,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/20216/docetaxel",
      "Title": "Docetaxel"
    }
  ]
}