{
  "AuthorID": "MWilder",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mwilder",
  "Posts": [
    {
      "AuthorID": "MWilder",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mwilder",
      "Content": "Hi Gill, like you I have been recently diagnosed .  In my case I found a lump in my armpit and was sure the results would confirm it to be a cyst, therefore totally devastated to be told it was cancer. I had surgery to remove all lymph nodes earlier this month, and have recovered well.  I had my pre-chemo assessment last week and am booked fir first chemo session on Friday 13th December, glad I am not superstitious!! My advice would be to take someone with you to any appointment whee you may receive lots of information as there is so much to take on board. I agree that Google is not your friend as things I have read on there have terrified me. I hope all goes well next week, stay strong and keep your sense of humour over the coming weeks Big hugs to you",
      "MessageIndex": 6,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67494/just-diagnosed",
      "Title": "Just Diagnosed."
    },
    {
      "AuthorID": "MWilder",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mwilder",
      "Content": "Go for the PICC line. Makes treatment and taking blood so much easier .  My chemo is finished but now on perception which I have through a portacarh, again a good decision.  Good luck with your treatment.  Loads of love xxx",
      "MessageIndex": 10,
      "PostDate": "14/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84328/picc-lines",
      "Title": "picc lines"
    },
    {
      "AuthorID": "MWilder",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/mwilder",
      "Content": "I have recently had surgery to remove lymph nodes under my arm and had my ore chemo assessment today.  Up until this afternoon  I have nit had too many problems.  I have had the wound drained twice in the last two weeks. This afternoon when I returned from my hospital appointment I noticed that the area around my wound has become swollen, it is hard to the touch and looks bruised to me. I am not sure I can face another trip to the hospital so soon and wondered if I should be concerned or wait a few days to see if it improves. Has anyone else experienced anything similar?",
      "MessageIndex": 0,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67385/bruising-after-lymph-node-removal",
      "Title": "Bruising after lymph node removal"
    }
  ]
}