{
  "AuthorID": "my3girls",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/my3girls",
  "Posts": [
    {
      "AuthorID": "my3girls",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/my3girls",
      "Content": "Hi, finished all surgery, chemo, rads and now on Letrozol tablets, been on those for about 6/7 weeks just wondering if anyone else had experienced bouts of severe diarrohea since startin on the hormones  . It has happened a couple of times but only lasts for about 4 hours, but now I am having a little vaginal bleeding .  I am 67 years and loooong past the change but also had hystercetomy when I was 32, (kept ovaries) due to pre cancer cells.  I don,t want to go running to docs for every little thing so if anyone can advise, must stress it is only a little bleed. thanks Pam",
      "MessageIndex": 0,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58278/letrozol-and-bleeding",
      "Title": "letrozol and bleeding"
    },
    {
      "AuthorID": "my3girls",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/my3girls",
      "Content": "Hi, thanks Kate and Dorothee for your replies, I will get it checked out on Monday. It was just niggling at the back of my mind that it may  just be related to taking Letrozol and nothing sinister. As if we didn,t have enough to worry about IT coming back , the medication  can cause worry too. Thanks again, will keep you posted, Pam",
      "MessageIndex": 3,
      "PostDate": "01/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58278/letrozol-and-bleeding",
      "Title": "letrozol and bleeding"
    },
    {
      "AuthorID": "my3girls",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/my3girls",
      "Content": "Hi Kate and Dorothee, got it checked out, nothing sinister (doc said), after examination told I have inflamation due to my age ( made me feel ancient) and hormones, usually treated with hormones but due to the breast cancer can,t be treated that way so had to be referred to gyny for tests and treatment. Not a 2 week referral as she said didn,t think it was urgent. So I am NOT going to worry, just taking it in my stride. Thanks for the advice, knew really I should have it checked but  needed to know if it was a common problem.  x  my3girls",
      "MessageIndex": 4,
      "PostDate": "05/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58278/letrozol-and-bleeding",
      "Title": "letrozol and bleeding"
    },
    {
      "AuthorID": "my3girls",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/my3girls",
      "Content": "Hi Cat, I also had the oncotype test, our clinic does it on NHS, I had lobular BC  grade 2 with  1 node involved,  had mx and anc. the result of onco test came back as intermediate risk so was advised to have chemo. I completed that on 30 Nov and start rads this Wednesday. Started on Letrozol tablets last week (so far no side effects from that). The chemo was very hard, but I did it, I believe rads are much easier. good luck, ope all your treatment goes well. Pam",
      "MessageIndex": 13,
      "PostDate": "14/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56170/chemo---should-i-have-it-or-not",
      "Title": "Chemo - Should I have it or not?"
    }
  ]
}