{
  "AuthorID": "Myshittit",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/myshittit",
  "Posts": [
    {
      "AuthorID": "Myshittit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/myshittit",
      "Content": "Hi Sparkle, Being scared is natural but you need to go and get checked. Like some other members have said make sure you get a referral to breast clinic. I got referred due to severe breast pain with no feelable lump and they found me to have breast cancer at 26. Very treatable for me simply because I went and got checked out soon enough.  Hope you had a good appointment.  Myshittit ",
      "MessageIndex": 37,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134956/breast-concern",
      "Title": "breast concern"
    },
    {
      "AuthorID": "Myshittit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/myshittit",
      "Content": "Hiii, I'm 26, got diagnosed with breast cancer in may. Had lumpectomy and sentinel node biopsy in may and started my 6 cycles of FEC-T two weeks ago. Doing fine and keeping positive!  I need good suggestions for remedies- mouth feels like it's falling apart, very red gums and little blisters on roof of mouth, have ice and chlorhexidine mouthwash, baby toothbrush and kids toothpaste so far!! Anything else would be a bonus!! Feet very sore and cracked around toes. Am covering them in coconut oil 3 times a day but not really helping!  Also bit too much info but really sore bum when going to the loo!!! If anyone has any super suggestions I'd be super grateful!! Thanks in advance, Myshittit x",
      "MessageIndex": 0,
      "PostDate": "10/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133373/fec-side-effect-remedies-needed-please",
      "Title": "FEC side effect remedies needed please!!!!"
    },
    {
      "AuthorID": "Myshittit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/myshittit",
      "Content": "Wow! So much good info! Thank you all so so much!!!  Unfortunately no chemo trots- can't shit despite a cocktail of laxido, lactulose, apricots, dulcolax and senna hence the painful arse! I am now the proud owner of some anaesthetic gel which has helped! Difflam for mouth is helping a bit too!  I opted for a head shave pre chemo with some mates and accidentally made £5000 for coppafeel so hair is very short. Not noticed any falling yet but it's started being itchy the last few days- unsure if that's a pre falling out thing?  Think my lovely past 10 days have been pure luck and I'm starting to feel very chemo-y!! Hopefully short lived!!! Have lots of counting down to look forward to which makes it more bearable...5 more chemos, LAST chemo in October then new tits in November!  Myshittit",
      "MessageIndex": 5,
      "PostDate": "11/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133373/fec-side-effect-remedies-needed-please",
      "Title": "FEC side effect remedies needed please!!!!"
    },
    {
      "AuthorID": "Myshittit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/myshittit",
      "Content": "THIS IS BRILLIANT!!!! Such a good idea! During my chemo, even a two minute stroll outside could do wonders for my mood. Me and my little doglet walk everyday now and it really does make me feel that little bit brighter. I have a new app that converts your outdoors steps into vouchers and I’m basically earning while walking which feels like a mega achievement too! Here’s  to happy walking tales! Xxxx",
      "MessageIndex": 94,
      "PostDate": "03/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "Myshittit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/myshittit",
      "Content": "Hello everyone! Had lumpectomy and sentinel node biopsy end of may- no spread with clear margins ER+8/8 HER2-. Chemo now then double mastectomy 6 weeks after finishing! Had first FEC on 29th June. Day one perfect, day 2 very sicky very tired, day 3-9 ok just very achy from filigrastim injections, from day 10 to now I am horrendously constipated, have athletes foot (new for me), mouth ulcers, eyebrows falling out!! Got lots of lovely potions from the GP which are helping plus brilliant advice on here!  I'm 26 and have regular periods with a copper coil- can anyone advise if FEC-T completely stopped or altered anyone's cycle?  Thanks in advance! Myshittit",
      "MessageIndex": 25,
      "PostDate": "13/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/132766/july-2017-chemo-club",
      "Title": "*** July 2017 Chemo Club ***"
    }
  ]
}