{
  "AuthorID": "Naid",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/naid",
  "Posts": [
    {
      "AuthorID": "Naid",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/naid",
      "Content": "VJRPBraehead Hi, I was diagnosed with DCIS in February this year. There is nothing that can prepare you for the gut punch of being told you have cancer. Struggling with this is completely normal and what makes it harder is knowing it's not just you who struggles - this affects everyone who loves us too.  I coped by trying to focus on one day at a time (harder than it sounds!), taking care of myself (fresh air, healthy eating etc) and allowing myself to lean on the people I love when I needed support (this was a new experience for me). I also phoned the Macmillan helpline when I felt overwhelmed and they were always amazing. Sending hugs xx",
      "MessageIndex": 3,
      "PostDate": "03/06/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/182233/just-been-diagnosed-with-dcis-lost-afraid-numb",
      "Title": "Just been diagnosed with DCIS, lost afraid, numb!!!"
    },
    {
      "AuthorID": "Naid",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/naid",
      "Content": "Hi Fleet1 You're going through so much at the moment, it's no wonder you feel anxious. Plus, you're normal routine is gone and you're used to being very active (and physical activity is great for burning adrenaline, therefore, reduces anxiety) I've not had chemo, so I can't help with that. But, I underwent Prolonged Exposure Therapy for PTSD and had horrible panic attacks and other anxiety responses. I tried a few things to help with the panic: Firstly: a simple rebreathing technique, which I practised several times everyday (and more when I was not feeling anxious). Basically, breath in normally, then hold the breath gently for a count of five, then exhale slowly, so that the exhale lasts longer than the 'holding'. this technique helps to rebalance levels of oxygen and carbon dioxide in the blood, which go all out of whack when we're experiencing anxiety. Secondly: mindfulness. I'm not suggesting sitting down and meditating for 30 mins because when you're experiencing anxiety this can be nigh on impossible. Instead, I recommend doing normal activities 'mindfully'. So, while you're doing any activity (ie making a cup of tea, getting dressed, hugging a loved one etc) Try to be fully in the moment, focus on your senses - the sensation of how something feels, how it looks, how it smells etc. try to keep your mind focused and when it wanders, try to bring it back to the moment. Even if you only manage a few seconds at a time, it can help and it begins the process of 'retraining' the brain Thirdly: try to be really kind to yourself. The bottom line is, you are going through a hellish time at the moment. A time that would test any person on earth. You need to take time out for yourself, and be kind to yourself about the anxiety, be kind to yourself about the strain on your body and your emotions and keep reminding yourself, this time in your life will pass (your brain might not believe you but keep saying it - the more we repeat things the easier it is for our brains to 'update' and build new neural pathways, new ideas, new coping strategies) All of these things take a few seconds to do. I found it took a while before they began to work but, in the long run, they all helped me cope better with anxiety. Ultimately, you need to find what works best for you but I really do wish you well big hugs, Naid xxx",
      "MessageIndex": 2,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181604/anxiety",
      "Title": "ANXIETY"
    }
  ]
}