{
  "AuthorID": "Nanny Jan",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nanny-jan",
  "Posts": [
    {
      "AuthorID": "Nanny Jan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nanny-jan",
      "Content": "My daughter starts chemo on Friday and is considering having the cap that prevents hair loss.  Has anyone experienced this? Initially, she wasn't going to use it but after posts she has read on other sites, she is now seriously considering it. I know it is her choice, but I would like to hear other people's opinions. Thanking You  x",
      "MessageIndex": 0,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119348/any-thoughts-on-the-cap-to-avoid-hair-falling-out",
      "Title": "Any thoughts on the cap to avoid hair falling out?"
    },
    {
      "AuthorID": "Nanny Jan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nanny-jan",
      "Content": "Thanks for responding. As she has changed her mind once already, I feel she may well change it again during treatment. I've bought her some little woolen hats to wear, just in case.  They are however very difficult to come by in the shops.  She really needs them lined doesn't she? She is looking online for them but they are £30/£40 each!",
      "MessageIndex": 4,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119348/any-thoughts-on-the-cap-to-avoid-hair-falling-out",
      "Title": "Any thoughts on the cap to avoid hair falling out?"
    },
    {
      "AuthorID": "Nanny Jan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nanny-jan",
      "Content": "Thanks. Will pass it on to my daughter.  X",
      "MessageIndex": 6,
      "PostDate": "08/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119348/any-thoughts-on-the-cap-to-avoid-hair-falling-out",
      "Title": "Any thoughts on the cap to avoid hair falling out?"
    },
    {
      "AuthorID": "Nanny Jan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nanny-jan",
      "Content": "My daughter is currently in hospital with an infection that doesn't seem to be cancer related.  Both her hubby and kids have had the hacking cough thing going round and inevitably she has caught it.  She is on antibiotics which don't seem to be shifting it.  Oncology doc today said that it was probably a viral infection.  Her chest is now clear, which is a good thing.......but the cough persists.  Her hubby has had it for weeks now  necessitating in him having a chest X-ray, which was clear. Oncologist said she can go home when she feels better, but what if the cough lasts for weeks? Her obs seem to be better although nurses say she spikes sometimes.  They have given her additional antibiotics (she is allergic to penicillin).",
      "MessageIndex": 0,
      "PostDate": "10/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121062/currently-in-hospital",
      "Title": "Currently in hospital"
    },
    {
      "AuthorID": "Nanny Jan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nanny-jan",
      "Content": "LondonLass Hi Jan, sometimes there are few words that can help when things like this happen. So I'm not going to try and offer words, other than to send you a much deserved and very much heartfelt ((((((((((((hug))))))))))))) xxxxx Thank you......I think that's just what I need right now. X ",
      "MessageIndex": 2,
      "PostDate": "30/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120461/will-it-ever-end",
      "Title": "Will it ever end?!"
    },
    {
      "AuthorID": "Nanny Jan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nanny-jan",
      "Content": "I've just got in after spending 5+ hours in Cancer Centre.  My daughter was booked in for her 2nd Chemo, with her hubby keeping her company. First thing this morning I received a frantic call from her saying that her daughter  (2+ post treatment for leukaemia) had a rash and some unexplained bruising on her leg. Panic!! So we all went along to the hospital and whilst my daughter was receiving her medication, her daughter was being assessed for the unthinkable.  Blood was taken from my Granddaughter and the wait for results......once again agonising.  We finally received them - good news! All good there!   She was then whizzed off to Nana's as originally planned. The feeling of relief is indescribable but a short, sharp reminder of what we have already been through as a family.  As soon as I left my daughter, after hearing the news, a safety valve burst and I found myself crying quietly in the adjoining corridor  (still in the Cancer Centre).  The nurse who was looking after my daughter walked over sympathetically and offered me water. Of course, I apologised for what I saw as weakness and then noticed the nurse was crying also.  She told me she had a young child at home and I guess I had hit a nerve.  So there we were both reaching for tissues!! I am absolutely drained now but eternally grateful to the nursing staff who have my family's lives in their hands.  Their compassion and care is without question the one thing we can always rely on and I thank the Lord for that. They are angels......each and every one of them.  Jan x",
      "MessageIndex": 0,
      "PostDate": "30/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120461/will-it-ever-end",
      "Title": "Will it ever end?!"
    }
  ]
}