{
  "AuthorID": "Nat1525",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nat1525",
  "Posts": [
    {
      "AuthorID": "Nat1525",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nat1525",
      "Content": "Dear Kat, I just saw your post from a while agai as like you I have been searching and researching another he presence of LVI since I've noticed in my report, however neither of the professionals (my breast nurse, my surgeon and my oncologist are giving any significance to it. Like you, i have been diagnosed with 15mm-totalling 24mm invasive ductal carcinoma, hormone receptor positive, lymph nodes negative, lumpectomy in March and April 17. Then 4 weeks of radiotherapy and on Tamoxifen for 5yrs.  I asked about chemo, however was told that I am in a low risk group of recurrence and there would be no benefit to having chemo. I never got a straight answer re LVI. Always the same...you are low risk! Nothing to worry about! However, more I read about it online I realised a) they don't know much about it! And b) LVI isn't even included as a factor in any of the staging process of factor! I read multiple articles and studies and all say the same...LVI is an independent prognostic factor, a high risk factor, associated to higher mortality...however nobody is including it in the staging and neither are we particularly informed about it in the clinic room). As you can imagine I am sick with worry. I asked if there is any way of monitoring the progression of this (in case it spreads to other blood vessels in the body) in a way of taking bloods, etc. But all I got was...no, you don't need any bloods, we removed your tumour, you are low risk (according to their other prognostic factors) you had therapy and you will be getting yearly mammograms. That's it! Did you get any further with your answers Kat? If you did, pls let me know and I wish you all the best. ",
      "MessageIndex": 4,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105256/lympho-vascular-invasion",
      "Title": "Lympho-vascular invasion"
    },
    {
      "AuthorID": "Nat1525",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nat1525",
      "Content": "Hi Boobylou, I asked my breast nurse to post me all my pathology reports. LVI did not show in the first one (biopsy), not in second after first lumpectomy, but the third one after re-excision. I remember being in the clinic room with the breast surgeon who informed me that my margins are clear this time and there will be no further surgery, however I saw the report on his screen with an addendum saying...LVI present. He didn't even mention it to me. I decided to request all on paper and they kindly obliged so that I could talk to my Oncologist. However, he didn't seem bothered about it while I am terrified to this day. Love to you all!",
      "MessageIndex": 9,
      "PostDate": "22/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105256/lympho-vascular-invasion",
      "Title": "Lympho-vascular invasion"
    }
  ]
}