{
  "AuthorID": "natkat14",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/natkat14",
  "Posts": [{
    "AuthorID": "natkat14",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/natkat14",
    "Content": "Hi .......... I had a mastectomy in June and stayed in Hosp for 3 nights, I could have been out after one night but I chose to slow down the pace myself. I have three very young boys and realised that I would not be able to do half as much as I did before and the youngest at least would have no comprehension of this. I too had lymph glands removed. I made a great recovery, so good infact that my chemo started three weeks to the day of the op................ Now chemo that was a different matter for me as i was as sick as a dog everyday with FEC (Have just 2 lots of T left......gosh 8 sessions doesnt sound much but boy it is lol) . The operation was a total walk in the park, more inconvenience than anything else. I took no pain killers at all and made sure that I did my exercises as much as possible getting dressed was hard I realised that I possessed no tops that did up at the front and everything had to go over my head that was hard. i dont know if you have a bra sorted????? I was recommended a crop top sports bra which was good but i couldnt get it over my head at first but i then found a sports crop bra that has trad fastners at the back like a trad bra....... that was far better and fitted my softie really well. Think comfort and try to wear soft clothes as much as possible. I WAS GLUED and it was fine although I thought I was ok with the whole losing a bit of me i did find the first viewing quite sad and emotional plus the first shower was an emotional affair. Good luck my thoughts are with you.   natkat",
    "MessageIndex": 6,
    "PostDate": "13/11/2012",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55045/mastectomy-operation---eeeek",
    "Title": "Mastectomy operation - eeeek!"
  }]
}