{
  "AuthorID": "nellvans",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nellvans",
  "Posts": [
    {
      "AuthorID": "nellvans",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nellvans",
      "Content": "I was diagnosed in September when my son was 3 weeks old. Also had to give up breastfeeding though in my case that was a relief as I was really struggling with only one working boob and in a lot of pain. I've been doing chemo since September - last cycle on 5th January. Mx probably in early Feb then rads to follow.  It's been hard and I am really struggling even though I've not suffered too badly from chemo-related se. Probably in a worse state emotionally than physically and really fearful about potential long-term effects of treatment. Not in a good way at the moment - pretty depressed about my life at the moment and angry most of the time. Not a good combination when looking after baby!  ",
      "MessageIndex": 8,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45162/coping-with-cancer-treatment-and-young-kids",
      "Title": "Coping with cancer treatment AND young kids!"
    },
    {
      "AuthorID": "nellvans",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nellvans",
      "Content": "I would second the suggestion to try a buff. I've bought various bits of headwear as I don't like wearing my wig, and buffs are the best. Very versatile, easy to wear, cool and warm, non-irritating to scalp. Only downside is that they're not exactly cheap considering they're simply tubes of fabric, without even a hem! However they're so good, it's a flaw I can overlook. If money is an issue - try eBay..",
      "MessageIndex": 6,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45902/headwear",
      "Title": "Headwear"
    }
  ]
}