{
  "AuthorID": "Newboobies",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/newboobies",
  "Posts": [
    {
      "AuthorID": "Newboobies",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/newboobies",
      "Content": "Hi Amy I had a double mastectomy last June and was home the following day!! Drains were removed before I left so all the stuff I took was surplus to requirements. I wore jogging bottoms for comfort and a shirt after and a sports bra (I had immediate reconstruction). Only my sentinel node was removed but I was surprised at how mobile I was after such a big op and at the range of movement in my arm . Even went to a party 9 days after. Chemo wasn't too bad either, nothing like I imagined. I used the cold cap and although my hair thinned I never lost it all and the chemo didn't really make me feel tired or rough until the third cycle. I felt great after the first two. I wondered if they'd injected wine by mistake lol cycle 3 and 4 were tiring though and I got a horrible taste in my mouth but the drugs are great and never felt remotely sick. Radiotherapy....you can have invisibly uv tattoos (that's what I have). The marks are tiny and you can only see them under a uv light. Rads is quick and easy but......be prepared for the after effects. I wasn't. Came out of my last session thinking that was a doddle then 2 weeks later...bam!! Raw skin, bruising and all sorts (I did have to have some sort of wax layer on me though which kind of intensified the dose so not sure if these were normal reactions). These coincided with my most down town emotionally which didn't help. But overall, the best advice I can give is be positive, keep a sense of humour and take all the help you're offered. Overall it wasn't the journey I expected. It was not as bad as I had imagined, not easy by any means but you get to the end and think how the hell did I do that but you do!  Good luck for your op and any ongoing treatment xxx sorry for the essay Oh and I actually love my new boobs x",
      "MessageIndex": 27,
      "PostDate": "07/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109923/practical-post-mastectomy-stuff",
      "Title": "Practical post mastectomy stuff"
    },
    {
      "AuthorID": "Newboobies",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/newboobies",
      "Content": "Yes it was the chemo that frightened me the most I think. Initially I was told my tumours were small and that all I should need was surgery and tamoxifen but it was larger than first thought so ended up having the works! I know it's different for everyone but it really wasn't as bad as I thought. It was the whole hair loss thing I dreaded the most I think. Silly really when you consider what you're dealing with but that's what I dreaded the most. But there are some great wigs out there. I bought 2 but never actually used them. Using the cold cap I kept enough hair and kept my fringe so I got away with wearing a bandana and just pretended I was being trendy  :-)",
      "MessageIndex": 31,
      "PostDate": "07/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109923/practical-post-mastectomy-stuff",
      "Title": "Practical post mastectomy stuff"
    }
  ]
}