{
  "AuthorID": "NiceCuppa",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
  "Posts": [
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Me personally i would not travel abroad during chemo and was told not to due to risk of infections etc. I am not saying that you will be as unlucky as me but i have had to have iv antibiotics, extra wbc stomach injecrions etc the thought of having to deal with all of that abroad does not appeal .You should be able to claim on insurance as @annjac said. Better to have a fab holiday abroad at the end to celebrate. Also you are probably already aware but have to be very careful in the sun when on chemo.",
      "MessageIndex": 4,
      "PostDate": "16/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/178185/chemo-travel",
      "Title": "chemo & travel"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thank you TheScriptFan, I needed that hug :-) I wish I had said belly dancer but I was so shocked I thought I had misheard her so I said pardon and yep, she said it again.  I spoke to oncologist just before my last docetaxal and asked if they would reduce it and they said no they would just do daily blood tests on me instead which worked up until it showed that it wasn't normal! I have finished that one now and supposed to be moving on to x3 EC next. The rude nurse told me rather flippantly  that I will be like this for al my chemos.  I don't feel like I am doing very well at the moment. I stupidly thought I would just get my head down and get through it with minimum fuss..like deciding that would stop anything bad from happening. I am clearly am idiot",
      "MessageIndex": 13,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177013/fuming-with-comment-from-nurse-in-chemo-unit",
      "Title": "Fuming with comment from nurse in Chemo unit"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi Aspen blimey having to be in hospital without your family being able to visit. Thank goodness for video calling eh? I love what you said about not being broken, just a bit bent! I will try and remember that. Xx",
      "MessageIndex": 15,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177013/fuming-with-comment-from-nurse-in-chemo-unit",
      "Title": "Fuming with comment from nurse in Chemo unit"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thank you everyone for all your kind supporting comments. You have all made me feel less alone and supported through all of this poop. Apologies for not thanking each and everyone one of you individually. I had started but am on my phone and losing track. But know that you have all been brilliant.  AnnJac, I am gobsmacked that the male auxiliary said that to you. I have heard that I must keep positive many times but never keep positive and you may not die! Good to hear that some have had better time on EC...gives me some hope. Snowys Mum that is really helpful information thank you. I am not sure I am ready to write this down officially yet but I may at the end of it all.i certainly wasn't aware of this so its really useful to know.  I am worried about being treated by her again and what having this down in writing means for me. And I know they have a tough job and I don't want to send anyone over the edge. Unfortunately there is much more that she said to me that  have not covered here. I will have a think when I am hopefully a bit stronger mentally  X",
      "MessageIndex": 17,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177013/fuming-with-comment-from-nurse-in-chemo-unit",
      "Title": "Fuming with comment from nurse in Chemo unit"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "TheScriptFan thank you. Thank you x you are brilliant. I am going my best to try not to think about this now. Hopefully at some point today stop feeling so Ill and sick and sit out in the sunshine. In a slightly bonkers way it's reassuring to hear that othe r s have felt like this through treatment as well. Have a lovely weekend x",
      "MessageIndex": 18,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177013/fuming-with-comment-from-nurse-in-chemo-unit",
      "Title": "Fuming with comment from nurse in Chemo unit"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thank you moomy xx Thank you HappyFeet1, I think you are right she was trying her best but has no people skills. She had told me off over the phone in the morning and had a right go when I was ill and she just wasn't listening to what I was saying or the facts.  I am going to try and meet with my oncologist next week and discuss next steps. I am utterly terrified at the moment so my partner is well aware I want to decline further chemo, I feel like I am more at risk from chemo than cancer at the moment. However I am reluctantly agreeing to see them next week to discuss and we will discuss. I may speak to a nurse on this site but at the moment I burst into tears every 2 mins so not practical! Xx",
      "MessageIndex": 14,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177013/fuming-with-comment-from-nurse-in-chemo-unit",
      "Title": "Fuming with comment from nurse in Chemo unit"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "So you may all think I am being oversensitive but I have been having a specauclary rubbish time of chemo (neutropenic sepsis x3) and my hospital have not looked after me at all.  So yesterday I was in hospital having iv antibiotics and the nurse (who is very good at telling people off but not actually listening to what you are telling her) said, \"so what did you used to do\"? Used to do? I am on sick leave. I am going back to work. I may be broken but somewhere underneath all of this poop I am still me... I think.  It was just another thing that made me cry (I don't do crying so I know I am broken). I felt like she was saying well you know you are never going back to work. You've had it!  I am sure it wasn't meant like this and this nurse just has zero people skills but when you feel like hell and struggling with who you are and what place you have in your families life (I feel like I am just a constant hindrance at the moment) this was the final straw. Like I said you all probably think I am being oversensitive and I am sure once I feel better! I will think the same but at the moment I am utterly terrified of setting foot anywhere near that hospital",
      "MessageIndex": 0,
      "PostDate": "22/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177013/fuming-with-comment-from-nurse-in-chemo-unit",
      "Title": "Fuming with comment from nurse in Chemo unit"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Totally relate to all of this. This forum is the only place I can vent and say how I am.. Only one friend I can sort of tell how it really is. Scared to even open up at home as to how I really am and my acting skills deserve an Oscar sometimes! Don't want to scare the kids and partner quite frankly is extremely stressful to live with at the moment (Not his fault he has a lot going on but difficult to take the brunt of it when I feel so hellish) I am finding it easier not to respond to people now when they ask how I am as I get told, well it's saving your life (yep that's magic that, I will instantly feel better now!) Or when I get upset about losing my hair I get, oh well you knew it was going to happen. Does that make it any easier to deal with then?! Although to be honest there are very few people that bother to contact me now or even send a hello thinking of you message. Probably because they are not thinking of me and have their own lives to lead. But that means the friends who stick with me are true friends so have to be happy about that.",
      "MessageIndex": 5,
      "PostDate": "02/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/175840/protecting-others",
      "Title": "Protecting others"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi Miss Wolfie Thats good news.  I had my last one today (had 10 in total). Had the back spasms on doxatexal but they didn't stop me in my tracks like it has with EC. I am due 2nd round of EC next week. I am hoping by tomorrow night they will have gone. I hope you enjoy your last few days of feeling ok before next one. I have to say though apart from feeling totally wiped out and the back spasms, oh and low neutrophils I defo feel better on EC. Xx",
      "MessageIndex": 107,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "WeCanDoThis I am so sorry it has taken me so long to respond to your question. Am all over the show. I have been given antibiotics since very first chemo. Seems all the patients are given them to start taking from day 8. However for first 3 doxectal I had to start taking them sooner than that normally on day 6 and on one occasion I had to double up my doses.  Interested to hear if others have antibiotics given to them as a matter of course. We a ree told to take them whatever our temp etc",
      "MessageIndex": 113,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thanks We can do this I think I am going to sleep on the sofa tonight, all this lack of sleep is getting to me on top of everything else! Ooh and I have purchased a heat pad (type you plug in) and it's fab. You can lie on it, unlike hot water bottles etc. And it helps with the spasms. Unfortunately doesn't help with the hot cold flushes I keep having. I suppose it's the chemo but I need to get used to it as they are going to put me through menopause after chemo :-(",
      "MessageIndex": 120,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi All So now into EC and have had difficulty swallowing my dinner tonight. It's like it starts to go down but only able to swallow the food by drinking. Also having trouble swallowing generally. I know I am likely to get more issues with my m9uth with EC but didn't think  swallowing would be an issue. Also feel really sick despite them putting me on same ones as last time.. the expensive ones.  Anyone else had swallowing issues on EC?",
      "MessageIndex": 19,
      "PostDate": "08/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thanks for everyone's replies to my query the other day 're swallowing issues after EC.  The top tip about rice pudding,  soups etc was very helpful. It seems to keep coming and going. All very odd. I was told that EC would cause me more mouth problems and sores etc so trying to brush teeth after eating absolutely anything! Horsing Around yes I was put on emend and ondansetron anti sickness but now finished them. Sorry to hear you have been sick with it. How are you now? I have had sickness queasy feeling through all 4 chemos so far. Are you having 6 rounds in total? I have 2 left after this current one. Also thinking I may take some ortis now to try and get bowels moving. Legs aren't hurting as much on EC as they did with doxatecal.  Ijust keeping everything crossed ! No the oncologist did not have time to see me before the day of my chemo and I didn't have energy to call private bods etc so just went with the flow. I just want chemo to be over and done with now. I also decided to wait 're counselling and instead going to do something prior to returning to work so I can see how I can deal with anxiety,  expectations on me at home and work etc. I have seen a place that is not at the hospital but is for cancer patients so that is ideal as they will hopefully get where I am coming from. Hope everyone is doing ok and apologies for not responding  sooner. Haven't been sleeping but not had focus to reply but have read responses. You are all so fab and supportive and I really appreciate  all your kind words.",
      "MessageIndex": 45,
      "PostDate": "12/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Horsing Around, so sounds like we are both feeling pretty pants and at the same stage of chemo. Please have a big virtual hug.  I too feel very weepy and down in the dumps and have done for last 3 weeks or so. I feel the same I want to be done with all of this and want to get up to do something and not be exhausted and as weak as a kitten! It's our new normal I know but I don't really like this new normal. Do you have any treatment after chemo? I will be radiotherapy for 18 days and then 5-10 years of tablets to put me in early menopause. I am dreading the SE for the tablets and mildly worried about SE for radiotherapy but at the moment it's the blasted chemo that is doing my head in.  Thinking of you and hope we will both be feeling a bit brighter soon. We can do this. 4 down.",
      "MessageIndex": 48,
      "PostDate": "12/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi All. Just a quick question.  I have had occasional back spasms (lower back like I am being electrocuted!) For first three chemo (docetexal) and thought I had got away with getting them with EC. But sure enough a week after chemo they started last night as soon as I tried doing anything...walking around, emptying washing machine, just any movement other than just lying or sitting on sofa. And sure enough today as soon as I start to do anything it starts. Am I alone with these? Or is anyone else experiencing them? I don't normally get them.this late after chemo.  I am wondering what the hell causes them.  Hope everyone gets some sleep tonight. I am currently not sleeping much due to spasms and a foghorn  next to me (partner snores so loudly it's impossible)",
      "MessageIndex": 80,
      "PostDate": "17/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi WeCanDoThis I had temps with every round of docetaxal. Normally worst at day 5,6 and 7 for me. Been fine temp wise on EC. I think it's just one of those things about how your body responds, but it's awful and stressful.  I hope it's just a one off for this first round for you but great news that they will let you take paracetamol. My hospital wouldn't let me .",
      "MessageIndex": 110,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi Miss Wolfie Thats good news.  I had my last one today (had 10 in total). Had the back spasms on doxatexal but they didn't stop me in my tracks like it has with EC. I am due 2nd round of EC next week. I am hoping by tomorrow night they will have gone. I hope you enjoy your last few days of feeling ok before next one. I have to say though apart from feeling totally wiped out and the back spasms, oh and low neutrophils I defo feel better on EC. Xx",
      "MessageIndex": 122,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi WeCanDoThis I had temps with every round of docetaxal. Normally worst at day 5,6 and 7 for me. Been fine temp wise on EC. I think it's just one of those things about how your body responds, but it's awful and stressful.  I hope it's just a one off for this first round for you but great news that they will let you take paracetamol. My hospital wouldn't let me .",
      "MessageIndex": 125,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Miss Wolfie how odd that we both had spasms! I still have them today but now my stomach is sore. Just had the last of 10 stomach injections this afternoon and unfortunately nurse turned up whilst still in fridge and ouch did it hurt.  Hope you are feeling better today",
      "MessageIndex": 104,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thanks We can do this I think I am going to sleep on the sofa tonight, all this lack of sleep is getting to me on top of everything else! Ooh and I have purchased a heat pad (type you plug in) and it's fab. You can lie on it, unlike hot water bottles etc. And it helps with the spasms. Unfortunately doesn't help with the hot cold flushes I keep having. I suppose it's the chemo but I need to get used to it as they are going to put me through menopause after chemo :-(",
      "MessageIndex": 105,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "WeCanDoThis I am so sorry it has taken me so long to respond to your question. Am all over the show. I have been given antibiotics since very first chemo. Seems all the patients are given them to start taking from day 8. However for first 3 doxectal I had to start taking them sooner than that normally on day 6 and on one occasion I had to double up my doses.  Interested to hear if others have antibiotics given to them as a matter of course. We a ree told to take them whatever our temp etc",
      "MessageIndex": 128,
      "PostDate": "27/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177284/march-2019-breast-cancer-chem-chat",
      "Title": "***March 2019 Breast Cancer Chem Chat ***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi All I am having a specauclary horrid day which I won't bore you with...but I am on blood thinning injections for next 5 weeks as I have blood clots in my arm. Today I had my first zoladex implant injection and boy did it hurt going in. I then bled quite a bit at the injection site which the nurse said wasn't normal so she checked with Dr and she came back and said it was fine. However I have had to lie down for the rest of the day and am still in bed flat on my back because when I sit up I can feel the lump in my stomach and it is really painful, walking also hurts. I couldn't even put a cup in the dishwasher as I was crying with pain. Now is this normal or something else? I am wondering if the blood thinning stomach injections and the zoladex are arguing?!! I don't think I can cope with this every month for next 5 years as I.will end up being off sick  each month  To be honest I am not sure I can do any more treatment anymore. Today I am.broken and it's all too much Help!!",
      "MessageIndex": 0,
      "PostDate": "02/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180575/zoladex-implant-injection-is-this-much-pain-normal",
      "Title": "Zoladex implant injection...is this much pain normal?"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thanks LondonLass for your reassuring words, i really do appreciate it. Today I am a bit sore in my stomach but I can sit down ok today and don't feel / can't feel what felt like a lump in my stomach today. Thank goodness! Good tip about the numbing cream I think I will get some from nurse for next time. She warned me it was a big needle and said she was going for it (ie. Doing the injection quickly). I think if i experience this when I am not on the blood thinning injections then I will have to speak to the nurse / oncologist but keeping everything crossed  Thanks once again xxxx",
      "MessageIndex": 2,
      "PostDate": "03/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180575/zoladex-implant-injection-is-this-much-pain-normal",
      "Title": "Zoladex implant injection...is this much pain normal?"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "This thread is brilliant! In the last two days I have been told: , \"well at least you have had your children\" (I am being put through early menopause after chemo) By a cancer nurse \"breast cancer is the best one to have\"....Really? I know that there has been a lot of research into BC etc but since when should I feel grateful for having cancer I had a friend visit me and her well meaning but crap advice to me on how if I had a different diet it may have prevented cancer. For the record I eat very healthily and cook from scratch. She is the type of person that frowned when I pour cows milk in my tea! She then insisted she was going to send me lots of recipes to change my diet and I said, do what you like but I won't be using them, I will be using the macmillan cancer cook book if I use anything! (I am afraid i got a bit cross, if I hear take turmeric one more time i will scream...) On having chemo...well at least you will save money on haircuts and highlights. Or at least you can wear a wig On losing your pubic hair..at least it will save you having to shave and going for waxes I have even been told that I am too young for cancer...someone had better tell the consultant then! I know it's difficult not just for the person who has cancer but for their friends and family and sometimes people don't know what to say, and it's coming from a good place, just their messages that aren't quite right or as supportive as they think!",
      "MessageIndex": 41,
      "PostDate": "19/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/174843/at-least",
      "Title": "\"At Least\""
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "hammie the waiting is awful, I think we all say that ..not sure it gets easier! Once you know the plan that will help. 're MRI I never had one but my diagnosis has been rather long winded. All BC are different and present in different ways so what test one person has may not be relevant for another. I was told no need for me to have MRI! And 're your son, just make sure school are aware when you know of course next steps. Schools are great nowadays and supporting children and providing counselling if required. Xx",
      "MessageIndex": 10,
      "PostDate": "13/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/173161/waiting-waiting-waiting",
      "Title": "Waiting, waiting, waiting"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "I was told very little detail in consultations ..so had to ask but you dont know what you dont know! I just ask my GP for copies of all the letters from consultants and piece together missing info from that. That's how I found out that my cancer is a hormone driven cancer.",
      "MessageIndex": 5,
      "PostDate": "07/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177702/how-much-information-should-you-be-told",
      "Title": "How much information should you be told"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "I hate all cancer words where people say, fight, battle ,journey,  kick it's ass,  urghh and don't get me started on people that say keep positive...a lot of them in the medical profession!! Like we have any choice in what cancer is doing to our bodies. All we can do is follow medical advice. I hate this theory if you don't think positive then you won't get rid of it.",
      "MessageIndex": 6,
      "PostDate": "12/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177795/the-phrase-kicked-cancers-ass",
      "Title": "The phrase \" kicked cancers Ass\""
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi Horsing Around I have my tattoos /planning meeting for radiotherapy scheduled for next week. It made me excited , glad, sad, terrified all at the same time. Back when they thought my cancer was DCIS I had planned to have my op and work through radiotherapy. Best laid plans and all that as 6 months on 2 operations, stage 3 cancer , chemo and now radiotherapy I am in absolutely no position to work whilst undergoing radiotherapy despite what my boss wants. They will have to wait. I have got really scared about returning to work and quite frankly terrified as to how I am going to manage. I Am thinking I may give myself 2 to 4 weeks after radiotherapy finishes before I go back to work. After all I have not actually been well since the first op and to rush back may actually be false economy  for everyone if I end up Ill/ having a breakdown.  Sounds like we are in same boat 're having to work full time.  I think you are a day ahead of me with chemo so I hope you are feeling better today. My throat is on fire but hoping the antibiotics and antifungal meds kick in soon. I only have 5 days of steroids after chemo but never took them after 4.30pm to try and help me with sleep. But am having hot flushes all the time so not had any sleep for a few months now.  Xx",
      "MessageIndex": 66,
      "PostDate": "24/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "I am in again this month. Last one at Easter ",
      "MessageIndex": 28,
      "PostDate": "04/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi Horsing Around Congratulations on your last chemo. I had my final chemo yesterday...whoop. although I am not counting it as done until I feel better. It's had its ups and downs, docetexal was the worst for me, EC has been better although it has well and truly knackered my veins. Feeling so tired. Used to be bouncing back by middle of week 2 now it's week 3 and even then not quite right. Good luck to those of you starting or on the chemo train. You can do it. Horsing Around, what is next for you? I have 19 rounds of radiotherapy ahead and then I suppose back to work which will be very odd indeed. I can't afford to go back part time so may just use my accumulated annual leave to work a 4 day week or something! xxx",
      "MessageIndex": 55,
      "PostDate": "19/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Horsing Around, honestly some of these managers need a kick up the backside.  Don't be pushed into anything and make sure you give yourself time to settle at work. Last thing you need is changing jobs etc soon. I have 19 rounds of radiotherapy to look forward to! So imagine I will be returning to work around same.time as you. Although in my head I have told myself if I am back by beginning of July then that will be ok. Yep have mouthwashes etc but not doing much good. Had 2 bowls of icecream this am already! Also have the painful lumps back in my chemo arm. GP and oncologist and chemo unit didn't know what it was last time and didn't seem to care that I had painful lumps app wearing in my arm..convinced it is chemo related as appears approx a week after chemo Yep get on waiting list for acupuncture.  I am still not sure if I believe in acupuncture but if it makes you feel better doesn't really matter. I am going to give it a whirl. Nothing to lose. ",
      "MessageIndex": 70,
      "PostDate": "25/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi all.  Hope you are all doing ok. Soubds like Beachwalker19 we are in similar timing with our treatment. Do you start radiotherapy soon? I am having my tattoos next week! I may not have told you all I had a lump in my arm and it was qui tte painful at my penultimate chemo. GP, chemo line and onco  didn't know what it was and none of them investigated so I feel let down by them. I had a suspicion at the time it was a blood clot. I should have trusted my instincts as a few days after my last chemo it started again and then became very hot and swollen. Luckily I decided after a few days to call them because it turns out it's blood clots so now I have 6 weeks of injections and different antibiotics and meantime I am in agony and going to have to get taxis to hospital costing me a small fortune.  So lesson learned if you think it is something just say it and ask them why not. If I had of done this I might not be in so much pain now. I will always  always question Drs and nurses now.  And finally a hair related question. I cold capped but have no hair on top and towards back of head. At the moment I am.still washing it couple of times a week max. I know.we are all different but when does hair start to come.back after chemo and when should I start washing hair as normal? Any ideas anyone? Have a lovely Sunday everyone xx",
      "MessageIndex": 76,
      "PostDate": "28/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "I think getting your hair cut short makes sense. I got my long hair cut into a very short do after 2 cycles otherwise I would have looked like those ageing rockers with the hair in a ponytail and a bald patch!!! I could get away with wearing a big headband then for a couple of months but now to patchy / bald everywhere else to get away with it!! I found it quite nice having short hair , no faffing about, very little styling and dries sooo quickly. I just want my hair to start growing again, and i am being impatient as chemo was only 2 weeks ago!",
      "MessageIndex": 78,
      "PostDate": "28/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179007/april-2019-breast-cancer-chemo-chat",
      "Title": "***April 2019 Breast Cancer Chemo Chat***"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi All I suspect major chemo brain is at play here, but when i was on chemo one of the nurses said to stay out of the  sun. And then when I had my radiotherapy planning meeting they said of course you know about staying out of the sun. But other than slapping on lotion what should I actually be doing and for how long..? Anyone know? Are we supposed to sit indoors if it's a nice day or is a case of keeping arms etc covered? And also say if I want to start running (or perhaps walking more accurate at this stage) I will overheat if I put on too many layers etc. Sorry if it's so obvious it's just other than this 2 passing comments I have never been old anything 're this!",
      "MessageIndex": 0,
      "PostDate": "01/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180486/the-sun",
      "Title": "The Sun"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thank you so much both. Good tips as well..Will get myself some aloe Vera as well! Do you reckon a month after radiotherapy ends is when you have to set up being quite so worried? Obviously I will still wear sun protection but not sure I can cope with running in long sleeves in summer!",
      "MessageIndex": 3,
      "PostDate": "01/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180486/the-sun",
      "Title": "The Sun"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "So it's the early hours of the morning. I haven't slept properly since the op and just cannot get comfortable. Because of lack of sleep and being uncomfortable and in pain I don't trust my judgement.   I  had my op on Wednesday and sent home next day. Last night it felt like my arm wasn't resting down properly  against my side. I expect it to sore etc but this feels like I am more swollen than when I was in hospital.  Is this normal?  I will call BCN in the morning but just seeking others advice who have been there before. I hope I am worrying about nothing. My immediate thought is fluid but is there anything they can do? Will they have to stick a drain in again or will it sort itself out? Thanks in advance",
      "MessageIndex": 0,
      "PostDate": "26/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170502/lumpectomy-licap-and-lymphnodes-removed-is-this-swellling-normal",
      "Title": "Lumpectomy, LICAP and lymphnodes removed. Is this swellling norma..."
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thank You so much for replying  Purplepants.  And yes it helps that you have experienced the same thing. (Although obviously I don't want you to have experienced this!l) It seemed to come after I had got home so is reassuring that you have also experienced this. I suppose  it's because of the immense amount of bruising that will be taking place!  No I didn't get a heart shaped pillow. They sound great so I will order myself one now from the cancer research website. Thank you for the tip I have a duvet folded up behind me and about 5 pillows and I just cannot get comfortable at all. I may try sleeping on the sofa tonight! Just waiting for 9am to roll around so I can call BCN",
      "MessageIndex": 2,
      "PostDate": "26/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170502/lumpectomy-licap-and-lymphnodes-removed-is-this-swellling-normal",
      "Title": "Lumpectomy, LICAP and lymphnodes removed. Is this swellling norma..."
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "How is it June already? Anyway I am in. Half way through just another 9 to go!",
      "MessageIndex": 5,
      "PostDate": "01/06/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/182130/june-breast-cancer-radiotherapy-chat",
      "Title": "**JUNE BREAST CANCER RADIOTHERAPY CHAT**"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "TheScriptFan, I think they all had insurance policies with critical care cover before cancer. I stupidly thought I was too young to worry about policies likes that (couldn't have afforded it anyway). I doubt we will get insurance cover now and imagine you have to be clear of cancer for a number of years before anyone will accept you. I am also on reduced pay and things are very very tight!",
      "MessageIndex": 5,
      "PostDate": "19/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177997/well-women-now-reassure-cancer-insurance-anyone-had-a-claim-in-recently",
      "Title": "Well Women now Reassure cancer Insurance. Anyone had a claim in recently..."
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Sorry, meant to add that I found this website and its very helpful. Looks like you have to wait 2 years  but in some circumstances you may only have to wait 12 months depending on circumstances",
      "MessageIndex": 10,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177997/well-women-now-reassure-cancer-insurance-anyone-had-a-claim-in-recently",
      "Title": "Well Women now Reassure cancer Insurance. Anyone had a claim in recently..."
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "TheScriptFan, yes it is a bit poop but I can also see it from insurance companies point of view. If you do manage to find a company that will cover you now do let me know! It may be that you can get cover for everything else but not cancer!!",
      "MessageIndex": 8,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177997/well-women-now-reassure-cancer-insurance-anyone-had-a-claim-in-recently",
      "Title": "Well Women now Reassure cancer Insurance. Anyone had a claim in recently..."
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "TheScriptFan www.the-insurance-surgery.co.uk/.../",
      "MessageIndex": 9,
      "PostDate": "20/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177997/well-women-now-reassure-cancer-insurance-anyone-had-a-claim-in-recently",
      "Title": "Well Women now Reassure cancer Insurance. Anyone had a claim in recently..."
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "I am afraid I haven't got any tips yet as not back at work however have you checked with your hospital if they have any support? Our local.unit has all sorts of support including return to work session. I know you have already returned but I still think it could help including managing your works  expectations and hopefully reducing your stress.  Best wishes xx",
      "MessageIndex": 4,
      "PostDate": "01/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180301/stress-at-work-after-cancer",
      "Title": "Stress at work after cancer"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi Mazda19 I am sorry that you find yourself here. It's totally understandable that you are so frightened.  It's worth checking out the monthly chemo thread.  Chemo is different for everyone. I have had a bad week but unknown next week will be better and by week 3 back to normal (whatever that is!). However some people are just fine and dandy and some even work through chemo.  There are lots of drugs available nowadays that means your mum does not have to suffer. I was terrified about sickness but they give you anti sickness tablets. Your mum will be given a 24 hour chemo line to call whilst she is going through treatment and they are only a phone call away. I am sure someone else will be along in the morning with much better well written advice that I cannot think of at this time in the AM :-) Xxx",
      "MessageIndex": 1,
      "PostDate": "30/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/175656/my-mum-s-1st-chemo-on-friday-1st-feb",
      "Title": "My Mum’s 1st Chemo on Friday 1st Feb"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "So in typical after the horse has bolted fashion I am thinking about insurance. I know I won't get insurance whilst I am in active treatment but want to get insurance once I am done. I am young to have breast cancer and we have a young family. So although we have cover should I die, we don't have anything in place for longer term illness etc. Does anyone know of any good insurance providers for life insurance including critical care after you have had cancer?  I know it is expensive regardless but feel like I have let my family down by stupidly thinking that I would not get ill at my age! Thanks in advance",
      "MessageIndex": 0,
      "PostDate": "29/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170678/insurance-including-critical-care-after-cancer",
      "Title": "Insurance (including critical care) after Cancer"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Thanks Jo",
      "MessageIndex": 2,
      "PostDate": "30/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170678/insurance-including-critical-care-after-cancer",
      "Title": "Insurance (including critical care) after Cancer"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "My chemo unit arranged for the district nurse to come everyday to do my injections. Apparently a lot of patients have the district nurses come out to do their injections.",
      "MessageIndex": 10,
      "PostDate": "11/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181064/advice-on-giving-injections-after-chemo",
      "Title": "advice on giving injections after chemo"
    },
    {
      "AuthorID": "NiceCuppa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nicecuppa",
      "Content": "Hi Haysie, I don't really have anything to add to what has already been said but I just wanted to send you a big virtual hug and I am so sorry you are having to go through this again. Xxx Can I ask a question of you all that know things like scores. How did you find that out? Did you ask or did you onco / surgeon provide you with the info. I feel like I am being kept in the dark with some info.  And I don't know what I don't know...if you know what I mean! ",
      "MessageIndex": 31,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/177630/cancer-for-a-second-time",
      "Title": "Cancer for a second time"
    }
  ]
}