{
  "AuthorID": "NickF",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nickf",
  "Posts": [
    {
      "AuthorID": "NickF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nickf",
      "Content": "It seems like there's a lot of variation in treatment approaches at different hospitals - my wife had cancer in the one sentinel node that they removed and she was initially offered a place on the POSNOC trial which is trying to determine whether we have historically over treated patients with limited node involvement. The US approach is different and they no longer reach immediately for the surgeon's scalpel when some nodal involvement is found. The full axillary clearance is a bit 'old school' according to our hospital. I used the Hopkins Breast Center 'ask an expert' free service to enquire about my wife's specific circumstances and I found that quite illuminating. There's lots to know and learn about this disease - my advice is keep reading and keep asking questions! One final point - it seems to be ingrained in most people that 'node involvement' is really really bad. I was as guilty as anyone in this respect. I now know better. For certain it's better to have no nodes, but if you have, your prognosis does not fall off a cliff. I went through this with our oncologist using NHS Predict. If you're tough enough to see your own stats, I recommend it - the predict tool will tell you accurately what having positive nodes actually means, and it's not the doom and gloom situation that your head-tilting friends probably imagine.",
      "MessageIndex": 7,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122915/received-lumpectomy-results-2-sentinel-nodes-have-cancer---what-happens-next",
      "Title": "Received Lumpectomy Results, 2 sentinel nodes have cancer - what happens..."
    },
    {
      "AuthorID": "NickF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nickf",
      "Content": "Hi Tasha, it depends - our breast surgeon initially said we'd do the oncotype and then decide on chemo. Then the sentinel node result arrived and coupled with other factors like grade 3, there was a general feeling that chemo was the way forward. They asked us how risk averse we were - my wife said 'very', and that was the clincher. The oncologist proposed 6 rounds of the hard stuff, TAC. She's heading for round 4 next Tuesday. Helsbels - we sought a lot of advice about the surgery/RT decision. One important factor was they said we could consider having RT not just to the armpit but to the collar bone area as well. They described that as 'belt and braces' and the most 'complete' treatment available, as it would treat an area that would never be touched surgically. I think that fact will prove to be decisive for us. We're seeing the onc tomorrow so we'll no doubt discuss this again with him.",
      "MessageIndex": 20,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122915/received-lumpectomy-results-2-sentinel-nodes-have-cancer---what-happens-next",
      "Title": "Received Lumpectomy Results, 2 sentinel nodes have cancer - what happens..."
    },
    {
      "AuthorID": "NickF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nickf",
      "Content": "Hi Ronstar, yes, I don't think any given approach is significantly better than any other. Because of her sentinel node being positive my wife was offered surgical clearance, radiotherapy or the POSNOC trial. We declined the trial because we could have been randomised into a no further treatment arm, which we didn't think was a good idea. Faced with the choice of surgery or RT, they said there are no wrong choices here - they are not allowed to offer choices if one treatment is known to be better than another. My wife is still at the chemo stage so we don't have to choose yet but we are leaning towards RT because the lymphoedema risk is possibly slightly lower we are told. Stay well! Regards Nick",
      "MessageIndex": 15,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122915/received-lumpectomy-results-2-sentinel-nodes-have-cancer---what-happens-next",
      "Title": "Received Lumpectomy Results, 2 sentinel nodes have cancer - what happens..."
    },
    {
      "AuthorID": "NickF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nickf",
      "Content": "Hi Tasha, you might want to ask why they are definite about chemo. I appreciate there is the nodes issue but you will get RT for that. For sure, if you were in the US they would get the oncotype DX test before deciding on chemo. With grade 2 and 100% ER responsive there is a fair chance of getting a lowish oncotype score meaning there would be little benefit in having chemo. There may be other factors that we don't know about and chemo may be the right decision but always worth checking everything I think Regards Nick",
      "MessageIndex": 16,
      "PostDate": "09/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122915/received-lumpectomy-results-2-sentinel-nodes-have-cancer---what-happens-next",
      "Title": "Received Lumpectomy Results, 2 sentinel nodes have cancer - what happens..."
    },
    {
      "AuthorID": "NickF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nickf",
      "Content": "Hi, another opinion for you! First off, i need to be wary of claiming chemo is 'manageable' as i'm the husband, not the patient! However, if my wife were posting she would say, yes, it's definitely manageable. She's just coming up to round 5 of TAC, which i think is one of the most aggressive chemo regimes. She feels well. She has about 3-4 bad days each cycle, 5 or 6 middling days and about 10 days feeling normal or close to normal. Everyone's experience is different i guess, so you just don't know. I suppose one consideration is that, given your situation is on the margins, if you started chemo and had a really bad time you could always stop it - the consequences of that would not be as bad as for people who definitely need chemo. In terms of the oncotype result, i think carolyn's links about Endo Predict are really useful. When we thought my wife was going to get oncotyped we did a lot of reading. There is some evidence out there that oncotype is really good at predicting recurrence in the 0-5 year timeframe, but it is under predicting in the 6-10 year area. Endo Predict is thought to be better in this respect. Based on our own research we had set a personal oncotype threshold quite a bit lower than 25, around 15 perhaps. We talked it all through with the oncologist and he asked how risk averse we were - 'very' was the answer!! In the end chemo was a given for us, but in your situation we would have definitely agreed to chemo. Just an opinion. I am not a medic, nor is my wife! Good luck Nick",
      "MessageIndex": 15,
      "PostDate": "02/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124218/should-i-or-should-i-not-have-chemotherapy",
      "Title": "Should I or Should I not have Chemotherapy?"
    }
  ]
}