{
  "AuthorID": "Nightjar3",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nightjar3",
  "Posts": [
    {
      "AuthorID": "Nightjar3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nightjar3",
      "Content": "are actually still together.  Full axillary node clearance was on Friday.  The District Nurse didn't turn up on Saturday as they had only been asked to come in Weds to remove the drain. A lovely nurse did come on Sunday at my request and said everything is fine,  did I want daily phone calls, so I said 'No', I would ring them ifI thought it necessary.  I have never disliked anything as much as this drain. It's a damn nuisance. I get the tube caught on door/drawer handles, the bottle is a pain,  it smells (the contents of bottle) I'm so glad my BCN gave me a knitted shoulder bag to put it in as I hate looking at it,  makes me want to vomit and it is heavy now as it has 420mls of yuk in it. On the plus side I have had hardly any actual pain just really odd sensations in my shoulder, arm and boob. The back of my arm is numb as is part of my boob. The nerves go nuts every now and then, its like I have ants running around under my skin. I have an excellent range of movement in my arm and shoulder at present.  I hope to get my results on the 15th Dec so I know what will happen next.  I've also had two brilliant night's sleep without dreaming of operations, cancer and hospitals!  My body just aches with lack of movement as due to drain and weather I've not been out of the house yet (I am resting lol) but hopefully after weds I can go for little walks. Best wishes to all you amazing ladies,  keep the faith!  xx",
      "MessageIndex": 0,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144052/my-drain-and-i",
      "Title": "My Drain and I"
    },
    {
      "AuthorID": "Nightjar3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nightjar3",
      "Content": "Hi I am in Norfolk and had my WLE & SNB on 10th Nov waited 2 weeks for results. My scars were healing beautifully but as my SNB was positive I had a clearance last Friday so original scar has been re-opened under arm. Drain removed today thank goodness. Got letter through today for results appt on 21st Dec. Going to ask if it can be brought forward as they told me it would be two weeks. I can't wait that long to find out the next steps. xx",
      "MessageIndex": 3,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144245/waiting-for-results-is-the-worst",
      "Title": "Waiting for results is the worst"
    },
    {
      "AuthorID": "Nightjar3",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nightjar3",
      "Content": "Hi I agree with you about ask the abbreviations, I think it's all a bit like speaking a foreign language! Yes, the 'clearance' was an axillary node dissection, all my lymph nodes were removed.  Everyone on this site is wonderful,  so welcoming and helpful. Good luck with everything. xx",
      "MessageIndex": 14,
      "PostDate": "07/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144245/waiting-for-results-is-the-worst",
      "Title": "Waiting for results is the worst"
    }
  ]
}