{
  "AuthorID": "Nikkiluz",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkiluz",
  "Posts": [
    {
      "AuthorID": "Nikkiluz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkiluz",
      "Content": "im hoping too that the weird pains i get in my side, liver area and back is too just my mind playing me up. they're not there all the time, can only describe the feeling as like a wave of pain., only got the pains after being told a tumer had been found in my breast. i've got what I hope is the last of my tests tomorrow, a bone scan , only then will i get some idea of what treatment is in store for me. Feeling nervous for tomorrows ct.",
      "MessageIndex": 5,
      "PostDate": "17/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53356/spining-room-and-nausea",
      "Title": "spining room and nausea"
    },
    {
      "AuthorID": "Nikkiluz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkiluz",
      "Content": "My first time on these blogs, although this is the 2 nd time round for me. Had breast cancer 12 years ago, had a lumpectomy, chemo and radio and really thought that was it. However after my annual ultra sound they spotted another small lump. Had a biopsy and yes it really is there! Now waiting for cat scans and and bones scans to see if it has spread. Feel so scared but trying to put on a brave face? I live in Portugal so it will be intersting to read how my treatment compares with the uk. I 've been told the best scenario is having a mastectomy in approx 3 weeks, the worst is doing chemo first to shrink anything that is there and then a mastectomy, seems strange to be praying for my breast to be taken away!!",
      "MessageIndex": 17,
      "PostDate": "05/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53020/hi-i-m-new-here",
      "Title": "Hi I'm new here..."
    },
    {
      "AuthorID": "Nikkiluz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkiluz",
      "Content": "Got the blessed news that all the doctor can see in the many scans I've just had is just wear and tear ( old age) .... And this at 52!!!!! So, booked in for a mastectomy on friday and they will put an implant in straight away. Not exactly what I had wanted, but it is the only kind of immediate reconstruction they will do here in Portugal. The relief of knowing that there is nothing showing in my other organs is immense, I feel elated, I can deal with this op, and fingers crossed that nothing else is found that will be it. As the tumour is so small,8mm, another lumpectomy could have been done, but the radiologist said that there really should have been radiotheraphy afterwards and even after 12 years it is not ideal to undergo another batch. It would also mean a daily trip of 3 hours .... and I just want to get on with my life. Thank you for your support everyone, I have found this site such a comfort. hugs to you all, Nikki",
      "MessageIndex": 0,
      "PostDate": "19/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53460/feeling-upbeat-today",
      "Title": "Feeling upbeat today"
    },
    {
      "AuthorID": "Nikkiluz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkiluz",
      "Content": "hi, I am in hospital at the moment after a mx and immediate implant. i had two drains in, the op was on friday morning, feeling great, I have good movement in my arm and have just had one of the drains taken out today. Looking to have the 2 nd drain out either tomorrow or wednesday. Then I'll be heading home. I'm in Portugal having my treatment so I think it is a bit different from how it is in UK, here they will not let you out with the drains in.",
      "MessageIndex": 18,
      "PostDate": "24/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53548/post-mastectomy-tops-with-drain-pockets",
      "Title": "Post Mastectomy Tops with Drain Pockets"
    },
    {
      "AuthorID": "Nikkiluz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkiluz",
      "Content": "I remember 12 years ago when I was doing my first treatment watching castaway with Tom hanks and telling my friends that I was fed up of watching films about cancer!! It is such a tiny part of the film, but I had totally zoomed in on the 'breast cancer' scene. Now, I have just finished reading two chick flics and both of them in my eyes were about cancer. I bet if someone else read them that tiny bit of the story wouldn't even stick in their minds",
      "MessageIndex": 8,
      "PostDate": "12/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53217/the-film-thread",
      "Title": "The Film Thread"
    },
    {
      "AuthorID": "Nikkiluz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkiluz",
      "Content": "The holiday will do you the world of good. After my first bout of cancer I was very down, couldn't even bring myself to buy next years clothes in the sales as I doubted whether I would be there to wear them. So, my husband booked a magical trip to Mexico, dolphin swim, beach and a complete change of enviroment.... Wow I came back with such a change of outlook, I can honestly say that the holiday completely pushed the depresssion away. This time, 12years later, the cancer was caught early and apart from a mastectomy and five years of arimidex I need no further treatment, hurray!! So this time I have booked the holiday, In 3 weeks we'll be in Venice, maybe not the best time to go but the two weeks we will be away will give me and my husband 'us' time, and time to reflect on future holidays and not this stupid cancer that seems to take up so much of our thoughts. Book the holiday and enjoy your life don't let this dam cancer bring you down.",
      "MessageIndex": 11,
      "PostDate": "20/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54033/tempting-fate-ridiculous",
      "Title": "Tempting fate....ridiculous"
    }
  ]
}