{
  "AuthorID": "NikkiS",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
  "Posts": [
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi All I have been offered a mastectomy with immediate reconstruction using a tissue expander and then in time a silicone implant and a reduction on the other breast.  I went to my appointment today with my mind more or less made up that I didn't want a reconstruction. My reasons were mainly recovery time, also I am a bit of a wuss and a flight risk when it comes to hospitals, blood, surgery, scars, pain. I also have read a lot about infections and problems with recon and radiotherapy ( which I am likely to have). My BCN thinks I should go for the recon as does my husband (his reasons are in the interest of my self confidence and he will support me whichever I decide). I am 49 and a 34e so I would likely have a reduction on the other breast even if I decide on no recon. But that would be later when (hopefully) cancer treatment is finished. I would like to hear if anyone had a recon using tissue expander and subsequent implant who had or didn't have problems. Also anyone with a largish bust who didn't have the recon and is happy/not happy using prosthesis ( I'm thinking it will be heavy if its going to match the other one). Thanks in anticipation....I need to let her know my decision tomorrow and I am changing my mind every hour!  X",
      "MessageIndex": 0,
      "PostDate": "17/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133874/advice-please-reconstruction-or-not",
      "Title": "Advice Please....Reconstruction or Not??"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Thank you everyone and yes DoraD I have decided on no reconstruction. Mainly because I want less recovery time, and less time in hospital. Also because I will definitely be having RT. My priority is getting rid of this cancer and if I really hate only having one boob......well I will worry about that later. A week ago I was waiting for all my scan results and luckily I got all clear of secondries (nearly, there is a question mark over a nodule on my lung, but they just want to re-scan me in six months for that).  So although there do seem to be a lot of ladies happy with their reconstructions, there also seem to be a lot who aren't. On balance, I may regret it but I have been promised a reduction on healthy breast further down the line so that I shouldn't need as big a prosthesis, I just want to get through treatment first. Wishing you all the best Nikki X",
      "MessageIndex": 9,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133874/advice-please-reconstruction-or-not",
      "Title": "Advice Please....Reconstruction or Not??"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Yes - they explained that to me yesterday about radiotherapy affecting the skin and causing problems with expanders, which strengthens my decision towards no recon.  X",
      "MessageIndex": 5,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133874/advice-please-reconstruction-or-not",
      "Title": "Advice Please....Reconstruction or Not??"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi everyone Just an update really....I had a mx ( no recon) and lymph node clearance on Wednesday. I Was home that night and yesterday was okay, in a little more pain today but not bad at all, just a bit restricted by these drains, I will be glad when they are out, district nurse coming daily.  I am feeling better that my treatment has started and I have my appointment to discuss Path results on 7th August. I haven't seen 'wound' as surgeon put a pressure dressing on and it hasn't been changed yet, not gonna look if she changes dressing today. Just wanted to say 'thanks' for all the replies and advice. In the end I went with my 'gut' feeling which was get the cancer out with the least surgery and recovery possible so that I can get on with the next step.  Nikki X",
      "MessageIndex": 14,
      "PostDate": "28/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133874/advice-please-reconstruction-or-not",
      "Title": "Advice Please....Reconstruction or Not??"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi Gill Metoclopramide - but haven't needed them for a few days now. Just can't stay awake today and y'day couldn't sleep at all. Weird, but I think you just have to go with whatever your body feels like and it's good to be able to as I have time off work on a doctor's note. Nikki x",
      "MessageIndex": 12,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "I spoke too soon,Again! Hair started falling out on day 15, It was halfway down my back, but had it cut in a short bob, waste of £40 really as it started coming out the same day. Only side effect I'm feeling atm is that I'm really head sore, I didn't expect that, anyone else finding that? Second dose this coming Friday, so preparing myself for that now. Nikki X",
      "MessageIndex": 78,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "I spoke too soon! nausea hit about 11pm and took the anti sickness meds, fell asleep about 1.30am - 4.30am  then managed to get off again around 7am until 10am. I couldn't believe that a couple of hours before I'd managed to cook and eat a full on pork evening meal.  Can't face food but had to take the steroids with food so forced myself a cup of tea and a plum. Just taken another anti - sickness tablet so hopefully will feel able to eat something in an hour or so.  Don't get me wrong it's not unbearable but not pleasant and inconvenient, luckily both children are on holiday and husband is easily pleased so I can please myself whether I cook and when I sleep etc. It must be hard if you have children dependent on you and my heart goes out to those of you in that situation. I'm sure I didn't need to tell you all that but it makes me feel better to get it out! Nikki x",
      "MessageIndex": 9,
      "PostDate": "02/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Okay - Thanks, I will phone chemo nurse tomorrow. Nikki x",
      "MessageIndex": 20,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi Happymum Sorry didn't see this. I'm fine atm, just back from 2nd FEC and I was starving so had a cuppa and a piece of chocolate fudge cake! This is my chemo timeline. It may be of interest? 17th August - 1st Oncology appointment. I was given the option to go on a trial and I thought about it overnight and decided not to participate.  24th August - Talk/dvd/ look at chemo dept ( at this meeting I was given chemo start date) 1st Sept  - 1st chemo - lasted about 2.5 hours altogether due to form filling etc. Given steroids by IV and anti sickness and F & E & C all through IV but the nurse has to manually push the E (epicirubin, I think) very slowly, this one takes the longest and is red (makes your wee red for a couple of days). I was given 7 syringe injections to take to boost white blood cells, they offered for a district nurse to come and administer these and I said yes as I am ridiculously squeamish.These have to start on day 3, day of chemo being Day 1, however, when DN turned up she said she couldn't do it as they hadn't signed an authorisation form. So my husband was shown how to do it, it is spring loaded and goes in your stomach. I was also given 2 steroid tabs to take each day for first 3 days. This, of course may be different by area, oncologist etc but it seems pretty standard for FEC, Are you having the T part? I am having that for last 3 sessions (docetaxol).  22nd Sept - 2nd infusion - administered same as 1st one but lab had problems making up the drugs so was there 6 hours. Yes I was able to live fairly normally, I have been signed off work and youngest child is 22 so I didn't have the stresses that others have. I found insomnia to be the worst of my symptoms. Oh and hair loss, I was convinced my very long, thick hair was firmly attached but on day 15 it all started to come out. now had it shaved and got my wig. Eyebrows and eyelashes still attached but not sure for how long, Bear in mind also that leading up to each session, you have to go for a blood test, 2 days before and i had an appointment to see oncologist y'day to check I was okay for next chemo ( this took all afternoon as clinic was running behind) left at 6.30pm, so glad I didn't have to worry about work as busy enough with appointments.. Obviously everyone is different, but so far not as bad as I thought it would be, the SE are real and as I'm off work if I want to get in bed for a nap mid afternoon I can, be kind to yourself and if possible, be off work, at least for 1st cycle. I found day 4, 6 and 9 were my worst, nausea and tiredness mostly. But yes, accept offers of help and try not to put pressure on yourself to do things that can wait. I hope things start moving for you soon. Love and hugs Nikki x",
      "MessageIndex": 109,
      "PostDate": "22/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi Happymum I think the injections are standard but I wasn't told about them either until my first session. Not that scary as they are spring loaded and my husband is happy to do them. I am just a complete wuss!  Everyone I was in with today on FEC was given them to take home, so maybe be prepared that you will too. I lost 8lbs from diagnosis to chemo, but put on 4lb already in last couple of weeks. I decided I was eating whatever I fancied, unfortunately that was mostly cake! I must....will def...get a grip. Soon...ish. Lol X",
      "MessageIndex": 113,
      "PostDate": "22/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi I am on day 14 now and I am amazed how well I feel, taste has come back, had a couple of mouth ulcers and a cold sore. I haven't lost any hair yet either and I didn't wear the cold cap but after reading other posts it seems that could happen any day now. Does the FEC-T have a cumulative effect? should I expect to be worse after next session? Hugs to those suffering bad side effects. Nikki X",
      "MessageIndex": 54,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi Happymum.. I think there is a thread called AWAKE for  non - sleepers. type in it search ( i think it's im main breast cancer group). Just seen that you have got your appointments now. Nikki X",
      "MessageIndex": 110,
      "PostDate": "22/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi Can anyone tell me if they have had bleeding from the bottom during chemo? I noticed it yesterday, (sorry, bit delicate) but as I am on a period too, I wasn't sure where the blood was from.  I am on day six after 1st cycle of FEC. Thanks Nikki x",
      "MessageIndex": 13,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Thanks Ann x",
      "MessageIndex": 15,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "NikkiS",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nikkis",
      "Content": "Hi all Not sure how to 'join' this club? Started Chemo today, wasn't too bad at all, just feel a bit light headed and ever so slightly nauseous but not enough to stop me having my tea! I am having FEC x 3 and then Docetaxel x 3.  Just wanted to compare/ share experiences. Good luck to us all! Nikki x",
      "MessageIndex": 5,
      "PostDate": "01/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    }
  ]
}