{
  "AuthorID": "ninjawarrior26",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ninjawarrior26",
  "Posts": [
    {
      "AuthorID": "ninjawarrior26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ninjawarrior26",
      "Content": "Such disappointment on Friday when I went in to have my 5th cycle of chemo (previously had 3 x FEC and 1 x Docetaxel/taxotere) to be told they were delaying the chemo due to a skin toxicity reaction with my feet....my toes have come out in huge blisters, and they have not resolved enough for them to administer more treatment, plus they are going to reduce the last 2 doses! I had started taking the double dose of steroids on Thursday and continued with them on the Friday before I knew the chemo was not going ahead, and I now realise how awful the side effects/slump from the steroids are on their own without the chemo there. I've always assumed the horrid bloating, low mood and awful tiredness and appetite change were all down to the chemo, but now I see that most of my worst side effects during the chemo may have actually been caused by the steroids alone! Has anyone else experienced this please? I am considering asking to see how I get on with my 2nd docetaxel without steroids at all, or at least reducing this :-( I thought I had a few more days off feeling ok whilst the chemo is delayed, but have been feeling worse than ever. My temper is short with my poor girls, and I can barely move from the sofa :-( Sorry for the moan. I've tried not to moan at all throughout this whole process, but delayed chemo is hard (I just want it over!) and steroid slump is nasty!! Thanks xxx",
      "MessageIndex": 0,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138191/delayed-docetaxel-and-now-realise-how-bad-the-side-effects-from-steroids-are-on-their-own-you",
      "Title": "Delayed docetaxel and now realise how bad the side effects from steroids..."
    },
    {
      "AuthorID": "ninjawarrior26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ninjawarrior26",
      "Content": "Thanks Foxie84! So it seems to be the same days as the zero immune days that you are feeling your worst with pain etc, that's good to know in advance thanks :-)  xxx",
      "MessageIndex": 7,
      "PostDate": "24/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136530/stabbing-pains-docetaxel-herceptin",
      "Title": "Stabbing pains Docetaxel + Herceptin"
    },
    {
      "AuthorID": "ninjawarrior26",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ninjawarrior26",
      "Content": "Do you mind me asking what other side effects you had from the docetaxol? I am starting the 1st of 3 tomorrow, have heard that the nausea is almost non existent with docetaxol compared to the FEC which was awful! Would be happy to hear what other side effects people had :-) Thanks, Nina xxxx",
      "MessageIndex": 5,
      "PostDate": "24/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136530/stabbing-pains-docetaxel-herceptin",
      "Title": "Stabbing pains Docetaxel + Herceptin"
    }
  ]
}