{
  "AuthorID": "nollie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
  "Posts": [
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "Just stumbled across this http://news.bbc.co.uk/2/hi/health/6611009.stm - thought you might find it interesting.  Guess I'm off the pop as well as cutting back the dairy now.",
      "MessageIndex": 0,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22549/breast-cancer-alcohol",
      "Title": "Breast cancer & alcohol"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "Hi folks, I'm new to this forum.  I was diagnosed with a Grade 1 breast cancer a few weeks ago and had a lumpectomy last week.   They also found cancer in my sentinel lymph node so took my lymph nodes out at the same time (I'm not sure how many - I'm waiting for my next appointment with my consultant to find out). I guess I was a bit naive because I wasn't expecting too much pain after the op and was expecting to be back up and at 'em very quickly afterwards.  However, I have a lot of pain in my armpit, and feel like there is a ball stuffed under the skin.  I was just wondering how long this is likely to last, and how long it is likely to take to get my mobility back.  I have a lifestyle which is very physically active (horses) and feel like I am putting my family (particularly my children) under a lot of pressure to do many of the day to day tasks I'm not currently able to manage.",
      "MessageIndex": 0,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "Thanks Tess, had a lot of walking to do yesterday and there was a lot of swelling last night and this morning - a bit like when you've been at work all day and need to get home to breastfeed your baby if you've been there, but much worse. Physio again today, hopefully a good massage will move some of the lymph fluid along. I know everyone is different but it's still helpful to have an idea of timescales.",
      "MessageIndex": 9,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "I had a fantastic (if brutal!) massage from the hospital physiotherapist yesterday, who should also be a psychotherapist. She seemed to shift quite a lot of whatever was building up and although there's quite a bit of inflamation today (which she warned me about - in her words 'You won't think I'm your friend today, but at least I know I'll be in your thought for the next three or four days') I feel that real progress has been made.  Managed to ride without wincing today :))))",
      "MessageIndex": 19,
      "PostDate": "25/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "Sorry you both have to be here at all, but you're in a good place.  I've found it far easier to come here than to talk with my family.",
      "MessageIndex": 3,
      "PostDate": "08/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23424/bit-of-a-shock",
      "Title": "Bit of a Shock!"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "Thanks Steff, that's really helpful.  Guess I've just got to be patient.  Saw the physio this evening and she thought I had very good mobility after only a week - very frustrating not to be riding though.",
      "MessageIndex": 2,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "Hi Jeni, sorry to hear you have to be here at all, but glad to find someone whose going through the same sort of thing. Definately know where you're coming from with the grapefruit under the arm (although this morning mine feels more like a melon), and I too have the body-builder's walk.  My physio didn't think it was anything to worry about and that it was more likely to be bruising after the op, rather than lymphowotsit that I can never spell. My next appointment with my consultant is in a fortnight, but I guess it might be wise to give them a buzz in between times to check that it's normal.  ",
      "MessageIndex": 4,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "I'd definately go and see someone (physio) about the cording. Spoke to my mum (who also had breast cancer) about it yesterday and she has some on the inside of her elbow which she never got looked at and now has quite a few mobility issues with that arm.  It might've been a bit sore, but after they broke my cords yesterday the movement in my arm increased by around 30%,  Go sooner rather than later though, aparantly they're much easier to break when they're not too thick.",
      "MessageIndex": 13,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "Good luck with the chemo Malmor. My mum had a full mastectomy and didn't have any problems other than a loss of feeling in some of the nerve endings.  I too have been in constant pain since my op - a bit like I have the world's biggest blister under my armpit and have to go marching with a boot that doesn't fit.",
      "MessageIndex": 15,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "I live in France so it's a bit of a different (a lot, acually) system over here.  I saw the physio today who said it was normal to have that much swelling so soon after the op and that I didn't need to contact the hospital and that it didn't need draining.  She did some massage work to drain the lymph glands and I have another appointment to see her on Monday. I will give the clinic a ring on Monday if it's still causing me problems just to be on the safe side.",
      "MessageIndex": 7,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "Hi folks.  Well, things got progressively worse over the weekend, and I was in a lot of pain with much less mobility than I had when I came out of hospital a fortnight ago.  My local physio said it was quite 'normal' after such an op, although there did seem to be more swelling than usual.  I went to see my GP on the Monday, unfortunately she was away and I had a little boy who really didn't have much of a clue.  So I phoned the hospital physio up directly and she was wonderful - she deals with lots of breast cancer & gynae cases on a daily basis.  She said it was absolutely not normal, and the upshot is that I had an hour's session with her today, popping capsules of lymph fluid and breaking what she described as 'cords' (ropes in French, I guess some sort of ribbon-like scar tissue), then a massage to clear the lymph glands. Ouch!! But if it eases the pain in the long term then it's worth it.  Then went on to see my surgeon as two of the 'cords' are thick and close to a tendon. Think he's going to have a bash at those next week after some regular massage by a different physio.  He also gave me the results of my op (upgraded to Grade II, bah humbug, with a 2.8 cm tumour and cancer found in four lymph nodes) and outlined the treatment planned (6 sessions of chemo, 5 weeks of radiotherapy & 5 years of hormone treatment). It was nice to be taken seriously at last, it's been really frustrating feeling that I was going backwards rather than starting to recover.",
      "MessageIndex": 11,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22504/pain-after-lumpectomy-lymph-node-clearance",
      "Title": "Pain after lumpectomy & lymph node clearance"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "For me one of the most important factors is that my illness should affect my family as little as possible. I want them to go on living their lives to the full and find it incredibly frustrating that they are having to take on, even if only temporarily, things that I would ordinarily be responsible for. Just my two-penneth's worth - Life is for living, don't ever 'put it on hold'.",
      "MessageIndex": 7,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22361/helping-family-to-cope",
      "Title": "Helping family to cope"
    },
    {
      "AuthorID": "nollie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nollie",
      "Content": "You're in good company here, and I've found virtual talking really helps.  Thinking of you tonight xx",
      "MessageIndex": 2,
      "PostDate": "31/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/24146/ilc-talk-about-a-bombshell",
      "Title": "ILC, talk about a bombshell!!!"
    }
  ]
}