{
  "AuthorID": "nonnynoel",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nonnynoel",
  "Posts": [
    {
      "AuthorID": "nonnynoel",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nonnynoel",
      "Content": "Hello All, I was diagnosed with breast cancer in 2012 at the age of 35. I've since had a mastectomy, chemo, radiotherapy, herceptin & now on tamoxifen. Nearly two years on, I feel the next stage for me is a prophylactic mastectomy & reconstruction. After putting up a fight, my breast surgeon has agreed. My reconstruction options were quite limited as I've had previous stomach surgery when having my gall bladder removed in 2009 & I don't have much body fat. So I have decided to go for tissue expanders. I would love to hear from anyone who has gone through this. I am not really that bothered about the cosmetic result, I just want my other boob removed as I feel like its a ticking time bomb. I'd be quite happy to hang my prosthetic boobs up at the end of the day, but as I've got young daughters, I've chosen expanders. Is this the right decision?",
      "MessageIndex": 0,
      "PostDate": "30/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71073/prophylactic-mastectomy-tissue-expander",
      "Title": "Prophylactic mastectomy & tissue expander"
    },
    {
      "AuthorID": "nonnynoel",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nonnynoel",
      "Content": "Hello All, I'm new to the site! I was diagnosed with breast cancer in April 2012 at the age of 35. In the past 18 months I've had a mastectomy, lymph removal, 6 cycles of chemo, 3 weeks of radiotherapy, started tamoxifen in November and have had 17 cycles of herceptin with just ONE MORE DOSE to go!! Before I started my chemo, I remember the nurse telling me that I'll probably feel quite anxious about the end of my active treatment. At the time, I thought to myself that I'd be too busy celebrating to feel anxious, but I was wrong!!! After having a drip every 21 days for the past 16 months and realising I have only one dose left next month, I'm really scared. I have 2 beautiful daughters aged 4 and 7. I feel I want to stay on herceptin forever!! I'll do anything it takes to see my gorgeous girls grow up. I've been so positive and determined throughout my treatment but now I'm scared and feeling quite negative.",
      "MessageIndex": 0,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64960/one-more-dose-to-go",
      "Title": "One more dose to go!"
    },
    {
      "AuthorID": "nonnynoel",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nonnynoel",
      "Content": "Thank you for your replies ladies. Yes I am on tamoxifen & am very lucky as I have very few side effects. I'm sure daily life will take over once more & my anxiety will become less. It's my prognosis that scares me the most, but I need to embrace life & enjoy it!!",
      "MessageIndex": 3,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64960/one-more-dose-to-go",
      "Title": "One more dose to go!"
    }
  ]
}