{
  "AuthorID": "Noodles123",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/noodles123",
  "Posts": [
    {
      "AuthorID": "Noodles123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/noodles123",
      "Content": "Thanks for the advise, she should be finished in Aug if everything goes to plan so was thinking of delaying it untill nov or May time. However mum does not want it to be delayed, she wants it to go ahead this summer. I think she is worried that her parents (my grandparents) may not be here if wr delayed it till next year and has said if shes tired at all she can lie down. But I am just worried about the side effects of thr docetaxol and how that would effect her, as it will be such a long day for her. ",
      "MessageIndex": 2,
      "PostDate": "01/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128022/help-wedding",
      "Title": "Help: Wedding"
    },
    {
      "AuthorID": "Noodles123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/noodles123",
      "Content": "Thanks for this. What drugs were you on? I am just worried as this will after she has her first doxectol treatment and I have read that the side effects are different.",
      "MessageIndex": 8,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128022/help-wedding",
      "Title": "Help: Wedding"
    },
    {
      "AuthorID": "Noodles123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/noodles123",
      "Content": "Hi please help. Mum has recently found out she has breast cancer. She had the surgery and everything was fine, it hasnt spread into the lymp nodes but there is a high risk of it coming back so she has to start chemo and will be on the 21weekly sessions. We are due to get married in the summer and this will be after her forth treatment (first treatment of doxeaxtol). We now do not know whether to postpone the wedding (this can be done with no extra charge) as we are unsure how the treatments will be afffecting her or how she will be feeling in the lead up to it and on the actual day itself. The wedding is 18days after her first doxetal treatment if everything goes to plan. Can you give me advise or past experiences of how you have felt and what you would do in this situation. ",
      "MessageIndex": 0,
      "PostDate": "01/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128022/help-wedding",
      "Title": "Help: Wedding"
    },
    {
      "AuthorID": "Noodles123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/noodles123",
      "Content": "Thanks for this. I al just worried as she will have her first treatment of the second drug before the wedding and I know all the side effects can change. ",
      "MessageIndex": 9,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128022/help-wedding",
      "Title": "Help: Wedding"
    },
    {
      "AuthorID": "Noodles123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/noodles123",
      "Content": "Thanks for your reply gilly! Thats what i am worried about the second drug as this if everything goes to plan will be 3 weeks before the weddig and at that point it would be to late to postpone. It is so difficult trying to make this decision ",
      "MessageIndex": 10,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128022/help-wedding",
      "Title": "Help: Wedding"
    },
    {
      "AuthorID": "Noodles123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/noodles123",
      "Content": "Thanks Mags, if everything goes to plan she will be due her second docetaxol the day of the wedding (which will then be postponed), so its just the worry of the side effects from the first one previous to late, but thats what she is hoping for because if its the day she is due she should hopefully be feeling better. Yes we are having the whole thing in a hotel so mum has said if worst comes to worst she can go the day before and stay there the night before and the night of the wedding. Its just so hard as I know the side effects she will start to experience when shes starts EC will be different to the docetaxol. ",
      "MessageIndex": 12,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128022/help-wedding",
      "Title": "Help: Wedding"
    }
  ]
}