{
  "AuthorID": "NotGeoffrey",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/notgeoffrey",
  "Posts": [
    {
      "AuthorID": "NotGeoffrey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/notgeoffrey",
      "Content": "Hi everyone.  If I may, I'd like to introduce myself and the reason why I have joined this online community. Before I give details about the cancer situation, I feel it is necessary to give a little information about myself to contextualise where I am coming from.  I suffer from severe and prolonged mental health issues and tend to see everything from the bleakest perspective, and this is the reason I have decided to come on here to get some real information instead of relying on the picture I paint for myself. About a month ago my mother (in her 60s)  told me that she had been diagnosed with stage IIb breast cancer, with confirmed spread into an unspecified number of lymph nodes.  She underwent a simple mastectomy yesterday and also had nodes removed.  How many and from where I do not know.  We now have to wait two weeks for the histology to come through before we know what the exact situation is.  To complicate matters she has a rare bone condition that means radiotherapy is not a real option, as it has been shown to turn her bone condition malignant in 50% of cases. I am doing my level best to not show her how upset I am at this time, and I think that so far I have succeeded.  Anything that upsets me upsets her - she is a mother after all :0).  I want to keep a positive perspective as far as is possible for both our sakes, and I am hoping that the people on this forum will be able to give me some information and support that will help me to help my mother. As you can see, it's a bit of a complex situation we find ourselves in as a family right now, so thanks in advance for anything you can do to help. NG",
      "MessageIndex": 0,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36768/in-need-of-some-reassurance",
      "Title": "In need of some reassurance."
    },
    {
      "AuthorID": "NotGeoffrey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/notgeoffrey",
      "Content": "Thanks to both Sandra and Smelly_Cat_Lady for your kind words. It helps me immensely to know that there are people around who will provide some support to someone they have never and will never meet.  It's one of the better sides of human nature that we do not hear about often enough. I am going to stay with my parents for a couple of days on Saturday, and with it being Mother's Day on Sunday I would obviously like to take a gift of some kind.  I could take a purple hedgehog in strawberry jelly and my Mother would love it because it's from me, but I'd like to take something that could be of practical use to her following the operation and recognising the need for her to be exercising her arm.  I don't suppose there are any suggestions? I realise that this is a fairly trivial question given the situation, but I also recognise that in such times small gestures can make the biggest difference. Thanks once again. NG",
      "MessageIndex": 3,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36768/in-need-of-some-reassurance",
      "Title": "In need of some reassurance."
    },
    {
      "AuthorID": "NotGeoffrey",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/notgeoffrey",
      "Content": "Love both the answer and the attitude :0)  Now... where to find a hedgehog that will stay still long enough for the jelly to set?",
      "MessageIndex": 5,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36768/in-need-of-some-reassurance",
      "Title": "In need of some reassurance."
    }
  ]
}