{
  "AuthorID": "nuttytart58",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nuttytart58",
  "Posts": [
    {
      "AuthorID": "nuttytart58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nuttytart58",
      "Content": "Hi Lynne,  Thanks for you reply. I go for my first consultation next week when I will be told when my chemo starts, but after talking to some people about the cold cap I have had different opinions so am really unsure about what to do. Please let me know how it goes for you. Jean (nuttytart58)    ",
      "MessageIndex": 5,
      "PostDate": "17/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58811/new-to-all-this",
      "Title": "New to all this"
    },
    {
      "AuthorID": "nuttytart58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nuttytart58",
      "Content": "Hi everyone, diagnosed with breast cancer 7 weeks ago, had a masectomy 5 weeks ago and am waiting for chemo, apparently I'm triple negative?? struggling to come to terms with the thought of hair loss, sick of people saying how strong & brave I am and don't worry that my hair will grow back, want to go into the cupboard, curl up into a ball and sob my heart out. Will these feelings get any better? will I struggle with chemo and why do I have to be brave when its the last thing I feel? Sorry, I have so much to say but not sure how!!",
      "MessageIndex": 0,
      "PostDate": "16/03/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/58811/new-to-all-this",
      "Title": "New to all this"
    },
    {
      "AuthorID": "nuttytart58",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/nuttytart58",
      "Content": "Morning, its 4.15am and no I'm not sleeping either. I've just had number 5 of 6 FEC. I have found all the way through that I am awake at this time all the while I am taking the steriods but it soon passes. Little naps seem to be the order of the day, I spent the first 2 sessions laying awake in bed, thinking all sorts of things but now I get up, have a hot chocolate (right off coffee for the first week which is just as well!) and put the computer on or read for a bit. Just go with the flow hunnie, follow what your body tells you to do and what you feel like doing. You are at the start of your journey, and remember, its your journey to take the way you want to. Take care and I hope all goes well for you. There is light at the end of that tunnel. x",
      "MessageIndex": 4,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62078/not-sleeping",
      "Title": "Not sleeping"
    }
  ]
}