{
  "AuthorID": "ogre",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
  "Posts": [
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hello all, I just wanted to thank everyone who helped me to get through the Christmas period alive. I would not have made it without you all.  Well, so much for all being done and dusted before Christmas. A whole year has passed and I am still in limbo.  The MD team seem to be assessing each test or exam and then making a decision on how to proceed. I had additional imaging on the Thursday before xmas week and this was being seen first but of course the following Thursday when they were supposed to meet was boxing day which meant the meeting didn't happen. I have been told by the M Nurse that  I am on their list today. She told me that all she could tell me was that the images looked fine and there was a request for a stereotactic biopsy on the notes. Still not helpful. Does that mean that there is nothing wrong or does it mean I don't have to go back for more images and they were able to see what they need to, to be able to work out a treatment plan before they see me next? I just don't know.  I have a brain and spin MRI to look forward to on Saturday. I hope they find that I actually have one.  On the plus side, I am feeling more positive about everything what ever the outcome and have decided I am going to take my mind off it all by ….. moving house. Why do I do this?  Anyway, again, happy new year to all the very special people on here, diagnosed, waiting for treatment, going through treatment or years down the line. You are all fantastic people and I hope 2014 brings you everything you wish for. ",
      "MessageIndex": 0,
      "PostDate": "02/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69247/happy-new-year",
      "Title": "Happy New Year"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi Kat, I am sorry to hear you have jumped on the worry bus. All I can do is echo what everyone else here has said. Get it checked out and don't be fobbed off by GPs.  The only advice I can give you based on my own personal experience so far is that there can be a lot of waiting. Many on here seem to have had speedy diagnosis but I am still in limbo and have been since October. This may be because I am not a priority because I don't actually have anything seriously wrong but it is difficult to tell because others have shared their waiting stories too.  Stay in touch with everyone on here. They have kept me sane (to a certain extent) with their stories of amazingness and courage and excellent advice. I will be thinking of you tomorrow. I have to call to find out my results (or to book an appointment anyway) tomorrow. Hopefully good news for us both but if not for you, remember that you are going to be referred to the right place and they will find out what if anything, it is.  Take care",
      "MessageIndex": 10,
      "PostDate": "29/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69051/nervous-for-my-tests-on-tuesday-trying-too-keep-busy",
      "Title": "nervous for my tests on Tuesday. trying too keep busy"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "yet another update Today  I went for yet more mammograms.  When I arrived, the radiographer said she only wanted one picture on the left breast. When I pointed out that I thought that was the wrong side, she had to go to speak to the doc to confirm. I was right. My goodness. Anyway, I have an appointment booked with a specialist and she couldn't tell me when because she can't see on the system. She will be sending all the pics to the specialist and now, yet again, I wait.  So basically, I have been waiting from the first appointment 3rd Dec unit now so far.  Does that seem like a long time to anyone else or is it just because I am the one waiting? ",
      "MessageIndex": 23,
      "PostDate": "23/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "As suspected I am not tired and just had a thought. The letter I recieved from the Breast Consultant said that he had aspirated a cyst on my right breast that had very dark fluid. Then the letter went on to talk about sending the fluid for testing to cytology (cant spell) for testing and saying that there were lumps (not cysts) on each breast. Is an aspiration the same as a biopsy? I had aspiration of the left cyst too and that didnt hurt at all. The right one we extremely painful. Felt like a knife being pushed in and out of my boob. Just wondering if rather than a biopsy tomorrow, I will actually get some results fed back to me or both. Anyone know what the difference is and if this could be possible that an aspiration turns into a biopsy?",
      "MessageIndex": 6,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "ERRRRRRRRRR!!!!!!!!!!!! I went along today expecting follow up tests aka biopsy to be presented with the same details as were on the letter I received. Good news is that the lumps are benign. Not so good is that they are concerned about the micro-calcifications and want to do further radiology screening and biopsy. Well I knew that (not about the lumps). I will receive a letter some time next week and the consultant gave be a breast nurse contact number and told me to speak to the doctor I saw before. He said I would have answers before Christmas.  I have no way of knowing how to contact the doctor. I thought I would be seeing the same person today. I know nothing of the system, who is who and how to go about things and why they have given me a breast care nurses number.  I now refuse to worry about any of it. I have spent the last week in an absolute frenzy and I am not doing that for another week.  Just going to play the waiting game AGAIN but in a calmer, don't give a ……. fashion. Thanks everyone for all your kinds words and hugs to those of you who are receiving treatment right now. I can only imagine what you are going through and this situation I am in is really nothing in comparison.  xxxxx",
      "MessageIndex": 8,
      "PostDate": "13/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Emma that is hilarious. Thank you. Normally I am a glass half full and would have been ecstatic about this situation but because there is so much else going on I have been a bit half empty. Now I have seen the sheep I am going to shape up and man up. If I get even better news on the stupid calcification rubbish I expect video footage set to music. Haha. Lots of love.xx",
      "MessageIndex": 15,
      "PostDate": "15/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi all, Firstly, all your stories are so amazing and inspirational. I have said this before but to take time to reply to this when I don't even know I have anything yet is so kind.  I sincerely hope you are all doing okay and that you all have plenty of support and love around you this coming Christmas.  I have called the Macmillan nurse today and she managed to get the consultant to call me. Thank you for that advice Emma. It has made the world of difference.  He has called back and told me that I will have a diagnostic mammogram this week and depending on the results of this, a biopsy the following week. Apparently, this takes a while to organise because I may need a stereotactic biopsy and they don't have at the equipment to do it at my local hospital. I will have to go to another town if I need that.  In conclusion, still waiting but much more informed now. Sending love and hugs to everyone on this thread. ",
      "MessageIndex": 19,
      "PostDate": "16/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Update Still no biopsy date and apparently they have done one biopsy already. I didn't even realise. I have a date for another mammogram for Monday. So close to xmas. Will they do anything over the holiday or will I be waiting AGAIN? I hope they find what it is they are or are not looking for before that so that I know and can enjoy xmas.  Love to all",
      "MessageIndex": 22,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Well, it is the night before I go for my biopsy and I am feeling very anxious. I face spending the night alone once my kids have gone to bed. I think I might put my daughter in with me tonight and give her lots of cuddles. I am anxious about what will happen tomorrow and have no idea. Will I go there and they say what they found was nothing? Will I have the planned biopsy and will I be waiting again or find out there and then one way or the other? How long will I be there? I am in my head saying that it has all been nothing and that I am fine. I have learnt some lessons through this process already about who my friends and loved ones are so its all positive if its nothing and if I get a diagnosis that is not so good, at least I know what I am dealing with. Too many emotions.  I want to go to bed tonight with someone who will tell me all the things I want to hear and cuddle me all night but that isn't going to happen. I suppose I could ask my mum or dad but thats not really what they are for is it? I want someone to tell me what a fab future we have in store but that isn't going to happen either. I know I have a new start alone but to be honest the though of that petrifies me right now too. I know many of you brave amazing people have gone through this alone but I have only had a month to get used to being alone. Its been tuff.  Oh well, will keep you all posted and thank you for all your stories that have made me less anxious about a negative result. I just want to know now so that I can get on with what ever it is I need to get on with.  Lots of love to everyone especially the guys I met on the chat room the other night when I was at my worst. ",
      "MessageIndex": 0,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Thank you all so much for your kind words. I have just managed to get the kids to bed. They know something is up I think. Now sitting here and I don't know if it is psychosomatic but my breast are creeping if that makes sense.  I am 42 and have a 13 and 7 year old. Married 11 years. I was worried last week about the prospect of being divorced with no boobs and alone forever. You guys have immediately quashed that fear.  I have also noticed just now that the lump on my left breast that was drained, is in fact still there. I have been so busy with work and looking after the kids on my own that I hadn't even bothered to check. I have also been thinking that all the other tests I have been through this year may be linked in some way. (I have been having symptoms which neurologists thought were signs of MS but they are not sure now and I await repeat MRI on brain and spine). I was also diagnosed with hypothyroidism back in December of last year so now of course i am thinking OMG is that linked too. I have lost nearly 3 stone over the course of this year but I think that is stress. I did read a very useful quote on here that said that people with neurological illness get other illnesses too, just like anyone else.  I don't really think I will sleep much tonight. I may have to resort to the wine as someone else on here suggested. (only one glass of course). My friends have both called me and my parents have been round tonight so I know I am not completely alone. My ex did say this morning that he wanted to (not would) come to the appointment with me but I said that he had nothing to offer me that I didn't have from other people already. I think he is just wanting to do this for his own reasons, not because he has any feelings for me. He has as good as said this recently. That he would be there for the kids but not me. (no change from the last 5 years of marriage anyway). Lastly, you guys are the ones who are stopping me from keeling over. I seriously mean that. If I hadn't found this site I would be a wreck.  Will let you know what happens tomorrow and I really hope you are all doing fine. You certainly give me hope. All of you. virtual hugs back at you all. xxxx  Helen",
      "MessageIndex": 5,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Ah ok. That is good to know. I will contact her on Monday.  Thank you Emma. As always xx",
      "MessageIndex": 12,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Thanks Emma. you truly are a source of inspiration and joy. I ignored advice today and went searching the internet but I decided my line of enquiry was going to be benign breast conditions. Of course, human nature dictates that I have now diagnosed myself with one of those and the world is good again.  I have been signed off work and given anti-depressants but after a good chat with the GP I realise that the waiting for appointments, results is not actually my real problem. I am actually ok with any outcome now and I am just going to get on with getting over my separation sorting out paper work at home that I have neglected for so long and focus on getting me back. I feel like this because I have spent the last week researching and reading peoples stories and had to kick myself up the a$%£.  I am a very strong person and normally this type of thing I would have dealt with with ease. I would have taken one look at someone else's position from a story on here and thought what on earth am I doing worrying at this point.  I am sending love and hugs (just had a typo there and wrote jugs) to all you amazing people who have really really inspired me to stop flipping worrying and count my blessings.  xxxxx",
      "MessageIndex": 21,
      "PostDate": "17/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68346/friday-the-13th-is-upon-me---feeling-lonely",
      "Title": "Friday the 13th is upon me - feeling lonely"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "I agree with what everyone has said on here.  I found a lump last year and got it checked out. I felt silly going but am glad I did. I was told it was nothing to worry about but a cyst. I felt great afterwards.  A year later and another lump. This time I have been back to the doctor and was waiting for the sigh, not you again. But he referred me again and I when I arrived the breast doctor examined by hand first and said he remembered this lump from before and would I like him to drain it. He did that and then told me I had another one on the opposite side and whilst I was there, he may as well get rid of it. However, this one was extremely painful and made me cry. I had a mammo and ultra sound and they have now told me I have calcium deposits and an unspecific thing (don't know what).  I get the results back on 13th Dec.  My point is, never feel that you shouldn't get things checked out. If its, good news great, if its not so good news, you have found something to get treatment for and hopefully a cure.  Good luck and go.",
      "MessageIndex": 5,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51189/how-can-you-tell",
      "Title": "How can you tell?"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "To everyone on this site who has helped me through this traumatic waiting game. I wanted to say a huge thank you to you all. I would never have got through all of this waiting without you all. I received news today that I have fibro cystic benign. All I need to do now is have them drained when they become a problem and have the micro calcifications monitored every six months for the next few years.  I am so happy but I am mostly so grateful to all you wonderful people here who gave up your time and have supported my wait.  I will keep dipping in to check on my new cyber friends progress and whether you are in the waiting room, newly diagnosed, receiving treatment or completed I will be thinking about you all and sending hugs and prayers for your health and happiness. Feel free to share my posts with any other newbies who are worried and waiting.  Good luck everyone. xxxxxxx",
      "MessageIndex": 0,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69530/fantastic-news-and-thank-you",
      "Title": "Fantastic News and thank you"
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi everyone, I am looking for somewhere to read others story's because I went to the doctor last year with a lump, had a mammogram and ultra sound and was told I had hundreds of cysts. The doctor offered to drain them if they were a problem but at the time I said it wasn't too bad and that I obviously just have lumpy boobs.  More recently, I have been having tests for symptoms of MS where the doctors have been ruling everything else out to try to get to the bottom of it. During this time I have lost a lot of weight and I discovered a lump on my left breast which I very matter of a fact, pointed out to my doctor whilst on a visit for the MS related ongoing saga. I only highlighted it to him because it had started to become painful when my daughter jumped all over me as she often does. I was expecting him to send me to the breast clinic to get it drained this time.  Anyway, as suspected, the doctor at the breast clinic said \"oh yes, I have seen you before, are those lumps giving you problems? Do you want me to drain them?\" He drained the one on my left breast that was giving me problems and that was fine. He then pointed out that there was another on my right breast and would he like me to drain that too. \"Why not\", I said and he did. This time however, I suddenly felt a stabbing pain that took my breath away. It hurt so much that I was crying. He didn't seem to concerned about this only apologising for hurting me, which was sweet.  So I though that was it, sent home with pain killers but no, they wanted to do another mammogram and ultrasound. This time however, the ultra sound only scanned my left breast. He told me they had found something non-specific and that the doctor would want to discuss it. I took my mammo and ultrasound results back to the breast Dr and in the waiting room (it was dead and no one else was coming in apparently) he opened the report and started to read it. There were numbers 2 to 4 (any ideas?) on the report and after a lot of uming and arhing he said \"you had better come into my office\". He then proceeded to tell me that they had found changes since my previous mammogram and that there were calcium deposits on my right breast. I asked him what this meant and he said, very nonchalantly, it means you might have cancer or you might not. I was to go back on Friday 13 Dec (ha) after he had spoken to a team of people and that they may have to do a biopsy.  Now I am waiting. waiting waiting.  I don't know if this is the right place to be lurking and waiting but reading your stories is keeping my pecker up because everyone on here is so very brave and supportive.  In a good way, I hope I don't have to lurk around here at all. You are all amazing and I am in awe.  If anyone knows of any stories like \"it was a spec of deodorant\" I would be most grateful to hear them. Lots of love and luck to you all.",
      "MessageIndex": 0,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi, I wondered why they didn't too. He said he wanted to take the results to a team to discuss what to do. It was quite late I suppose, as well. 4:30 is that late? As I said in my post, I had a mammogram and ultrasound a year ago and it was clear. What you have said could make sense, that if it is cancer, it is new and small which is a good thing right? I have never heard of the term pre-cancer. Can they pick something up before it starts then? That puts a different spin on my worry.  So now, its either nothing at all or something minimal that will be quick to dispose of.  Thank you for taking the time out to write this. All the best and will keep you posted. ",
      "MessageIndex": 5,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi Emma, Thank you for the advice and I know what you mean about google.  Also, I hope you don't think I was in anyway trying to trivialise the pre-cancer as I am certain even that would be the most petrifying news I could have. I was just responding in a way that means I would be grateful for this (obviously clear would be most perfect) rather than the terrible things that so many people are going through on here. I have so much respect for all of them.  I am also really truly grateful I  have found this site because if you read my previous post from last year, I felt really pathetic even coming on here to state that I was worried about a lump when I didn't know what it was.  I am currently going from really positive most of the time to short pangs of thinking the absolute worse and this site along with people like yourself have made me feel normal. The feeling this anxiety is okay at this point. This is something that friends and family I have told just don't seem to understand at the moment. It is all very well to say to people, no point worrying until you know but they don't seem to understand. This site is also helping me to sound off without running around telling anyone who will listen, how I feel and if people want to read and post a reply they will. It saves people walking off mid-conversation. Haha People on this site, going through hell and real worry, anxiety, still have time to post and reply to messages from people in my position. Amazing and a god send. thank you",
      "MessageIndex": 10,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi Fiona, Thank you for the information. I will keep this on hold until next Friday. I will write down anything I need to and then if necessary do some serious searching.  Stories like yours give me a lot of confidence that if the worst is suspected then others have been through it and come out the other side.  thank you for taking the time to reply and good luck. x",
      "MessageIndex": 15,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi Patricia, Hoping your treatment is going well and it is not too tricky for you.  Its not that the docs have been funny, very kind actually. I just felt they were being very matter of fact about it all. To be honest and in some ways I prefer the straight talk. No biopsy yet. This is the thing. Following the mammogram, they told me to come back next Friday as the doctor wanted to discuss biopsy with a team of people in a meeting.  Can I ask, did they do a biopsy and then you waited two weeks? What tests did they do and what did they tell you? I am just interested in the process really and hoping that their attitude is because they think it is nothing but just want to double check.",
      "MessageIndex": 6,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "I am sorry you have gone through this Jacky. Could it be that it had been there for 25 years? That is some slow growing c.  Don't worry about scaring me, I am in a good place right at this minute. I tend to come on here when I am feeling like it's all nothing. It is useful to hear journeys others are going through because if it is bad news, I know I am not alone and if it is good news, I will feel I have learnt some lessons and information that I might pass on to others (hopefully not necessary). I just thought I was going to get already known cysts drained. The one on my left breast was fine and didn't hurt at all. The one on my right was really painful after the needle was removed and this lasted for about ten minutes. wave after wave of knife stabbing.  What I can't understand is that the doc said their was a non specific on the right breast but the ultrasound was only on the left. Very odd.  Anyway, I hope you are recovering well. I can understand about the lopsidedness too. This is one of my worries about the future. That if i do have cancer and do have to have my breast or breasts removed I will be a 43 year old divorcee (my husband and I have separated recently and I doubt there will be any hope of reconciliation although he has been helping with our children this week), two kids and no breasts. I have no thoughts of death at all. Just thoughts of a grim future alone. I am sure I will get over it and just be grateful to be alive to see my kids grow up but right now its unknown. ",
      "MessageIndex": 14,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi Trudi, Thank you for your reply. I am trying really hard to stay positive until otherwise necessary but its tuff. It is my daughters birthday today and with xmas coming up as you say, we have to just get on with it.  Very grateful you took the time out. I will keep posting.  At this moment in time, I am telling myself the calcium is in fact deodorant as I only wiped it off with baby wipes when I got into the X-ray room. Fingers crossed. Your situation sounds horrendous and yet here you are helping me out so that gives me hope and inspiration to just get on with it.  Lots of love to you too and thank you again.  H",
      "MessageIndex": 2,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi Emma, Thank you for this. I saw your profile and the sheep.  Where are you at now? Have you had treatment and I hope it is successful. I was wondering if you or anyone else who has replied to my post have any advice on preparing for my appointment. Should I prepare some questions? If so, what should I be asking? I really have no idea. If it turns out that they find nothing, what do I need to ask? Because they have found the calcifications, should I demand to have something? Or should I rely on their knowledge and professionalism to do the right thing? If it is cancer, what do I need to know there and then? What can wait until a later date? Any advice gratefully received.  Good luck with the rest of your journey too Emma and thanks again.",
      "MessageIndex": 17,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Hi all, Having had a ruff few days I have finally received some information by means of a copy of a letter sent to my GP from the wait for it…….. Consultant Onocoplastic Breast Surgeon as follows: On this occasion H had a new lump in the outer aspect of her left breast together with a lump superior to her areola on the right side. Both lesions felt cystic and I aspirated 10mls green fluid from the left and 5mls very dark fluid from the right. I sent the right side fluid for cytology testing. Mammogram and ultrasound scan revealed fibre-cycstic changes in both breasts with some deep micro-calcifications on the right side. Our radiologist wanted to discuss this in more detail in our multi-disciplinary meeting. (that is what they have done this week). He said he had explained to me that he would see me in 10 days (which will be this Friday) to go over the results of the discussion. Feeling: Better as I have some information at last.  Question: Can anyone shed any light? Is this still up in the air? Probably benign or should i take someone with me to see the consultant on Friday ready for the news? I don't really like dealing with other peoples emotions and if i have or haven't go cancer, I would personally rather deal with the news and take it in first and then tell anyone I need to. Thanks for the constant support on here and god bless you all once again. You are all amazing. ",
      "MessageIndex": 19,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Thanks Alison.  As I said, I do feel much better and either way I will be okay with it having read all these amazing posts on here. It really does help.  I just want to know. xxx",
      "MessageIndex": 21,
      "PostDate": "11/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    },
    {
      "AuthorID": "ogre",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ogre",
      "Content": "Thank you for replying to me. It is very kind of you.  So LCIS requires not treatment? How often will you need to be monitored? Where the specks calcifications?  I am guessing you are receiving treatment for the invasive lump. I hope that is going well for you. Please keep me posted on your progress and thank you.",
      "MessageIndex": 11,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68027/undiagnosed-and-waiting",
      "Title": "Undiagnosed and waiting……….."
    }
  ]
}