{
  "AuthorID": "olliedon1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/olliedon1",
  "Posts": [
    {
      "AuthorID": "olliedon1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/olliedon1",
      "Content": "I was diagnosed with CLL three months ago and have gradually seen people who I regarded as 'friends' become less available.  It's became increasingly obvious that they are 'too busy' socialising with other people.  I felt increasingly aware that I was being put 'on the back burner' for when they could spare an hour or so!  It's so hurtful to feel sidelined like this when you are already trying to deal with the impact of a cancer diagnosis.  It seems obvious that I'm no longer regarded as good company because of this.  I seem to have lost all my confidence because of this and despair at facing the future feeling so alone. It seem harder to make friends when you're older but I have found a Cancer Support Group not too far away so perhaps it's now time to get out there and meet new people instead of putting up with an unacceptable situation.",
      "MessageIndex": 28,
      "PostDate": "12/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116206/we-want-to-hear-about-your-friendships-during-your-cancer-experience",
      "Title": "We want to hear about your friendships during your cancer experie..."
    },
    {
      "AuthorID": "olliedon1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/olliedon1",
      "Content": "Since my diagnosis of leukemia three months ago, somebody who I regarded as a close friend quickly became 'too busy' although she doesn't work, being retired.  It became all to obvious that she had 'better fish to fry' and she was 'busy' socialising with other friends who probably were deemed to be better company.  The diagnosis of an incurable leukemia had come as a real shock to me which was further added to by this and also another 'friend' who just drifted away after holding her sister-in-law who had suffered cancer up as an example in that 'she never spoke about it and nobody knew she had it' meaning that I shouldn't either . It certainly shows you who your real friends are but feels like a bitter pill to swallow.  When I mentioned the diagnosis to my neighbours (also from a musim country) whom we have lived beside for over 15 years, I was urged to 'be happy' and have subsequently been shunned ever since - perhaps they associate it with bad luck or that it may be contagious.  It really is an 'eye-opener' how people react to a cancer diagnosis and one I would not have expected.  If the roles were reversed I would feel happy to offer support and time to people I consider friends.",
      "MessageIndex": 37,
      "PostDate": "19/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116206/we-want-to-hear-about-your-friendships-during-your-cancer-experience",
      "Title": "We want to hear about your friendships during your cancer experie..."
    }
  ]
}