{
  "AuthorID": "OneTooManyBiscuits",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/onetoomanybiscuits",
  "Posts": [
    {
      "AuthorID": "OneTooManyBiscuits",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/onetoomanybiscuits",
      "Content": "Hi Joski, Just to chime in with what everyone else is saying - my wife Jen used Alo Vera gel (from the fridge) straight after each radiotherapy session, then Aveeno the rest of the time. Hope this helps. Dom.",
      "MessageIndex": 9,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181041/advice-on-which-moisturiser-to-use-during-radiotherapy",
      "Title": "Advice on which moisturiser to use during radiotherapy"
    },
    {
      "AuthorID": "OneTooManyBiscuits",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/onetoomanybiscuits",
      "Content": "Hi noswad1, My wife and I were very much the same as you in the early days of her diagnosis. It's very difficult not to think about what we came to call the 'what ifs'. Eventually we took a somewhat philosophical approach: without knowing more about it, thinking it's all going to be worst case is no more correct than thinking it's all going to be best case. If it's bad, you've put yourself through a load of worry twice. If it's good, you've put yourself through it for nothing. Similarly, thinking it's going to be bad doesn't actually help solve the problem. From there we took the practical approach of keeping our minds on the present and acting on the facts we had to hand. Of course, it didn't stop us worrying entirely - we still worry today even though the treatment is finished. For what it's worth, Jen's tumour was very aggressive and has a high chance of returning in force. But we don't know whether it will and therefore choose not to live in fear. Keeping our minds in a neutral state and not dwelling on the what ifs lets us live our lives to the very fullest. With that in mind, the community here may be able to shed some light on things for you and perhaps give you some direction on how to prepare? For example, do you have any more details about the tumour? The grade? Whether it's ER or HER2 positive or negative? How big it is? Whether it's been caught early? Similarly, has the consultant indicated what treatment plan is provisionally in place? This would be particularly useful to know because folk here would be able to offer practical advice on how to prepare and thus allow you to do something that might take your mind off things, if only for a short while. I hope this doesn't come across as offhanded or in any way condescending. The lessons Jen and I have learned have been through shear necessity. I hope by sharing with you that they help you find your calm centre and refocus on preparing for what's ahead. It's meant very much from the heart. Wishing you the very best. Dom.",
      "MessageIndex": 1,
      "PostDate": "22/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181647/grade-2-er-pos-ductal",
      "Title": "Grade 2 ER pos ductal"
    },
    {
      "AuthorID": "OneTooManyBiscuits",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/onetoomanybiscuits",
      "Content": "Hi Welshmakem, My wife had a bilateral (double) mastectomy despite 'only' needing a single. She also needed lymph node clearance on the affected side. She'd suffered from breast cysts for some years which is how it was discovered - during a routine scan prior to draining a particularly painful one.  The consultant thought it was a normal cyst and the mammogram didn't pick it up either. The guy who did the ultrasound was suspicious of it and ordered the biopsy, which confirmed. She opted for the double because: - she was worried her quality of life would suffer, ie constantly worrying if it had come back in the healthy breast and thus undergoing almost monthly prods, pokes and scans; - worried if it did come back it would be missed.      When we discussed it with the Oncologist, she (the Oncologist) suggested there might be push back from the surgical team as they don't like to remove healthy tissue. However, the Oncologist supported Jen's position and argued the case. It certainly made sense to me and, being the average bloke that I am, I prepared to do verbal battle with anyone who stood in the way, using testicular lumps as an analogy (the surgical team at our hospital are predominately male), but that's a story for another day, perhaps. However, however, the surgeon in question was agreeable to the bilateral approach so Jen had to have a psychological assessment to ensure she was of sound mind - essentially making the choice for the right reasons. I'm telling you all of this as it's possible you may be met with resistance or you may not. But hopefully forewarned is forearmed. Also keep in mind that the surgery is longer and thus fractionally more risky. Jen's took 7 hours in total, but it entailed immediate reconstruction. Recovery time is also longer, of course. The mastectomy was skin sparing but the placement of the tumour meant removal of the nipples. Dressed, the reconstruction is brilliant and only apparent to people intimately familiar with Jen - basically me, some immediate family and the wonderful medical folk who saved her life. I mean, it's brilliant unclothed if you ask me, but there is prominent scarring. So you need to balance the risk of the cancer returning against the risk of doing longer surgery, plus the increased surgical and recovery times, the greater risk of infection (more wounds, more bacterial entry points) and the potential change in physical appearance.   Definitely open dialogue with your oncologist and breast care nurse, as well as the surgeon. Discuss your concerns with them about quality of life and ask if they can gauge the likelihood of recurrence. You'll not be pressured to make an on-the-spot decision. At least, Jen wasn't. Jen was given a great deal of latitude in the surgical approaches available and, frankly, I think she made the right choice. Suffice to say it was difficult but the right course of treatment (for Jen). ..but we both have a few (more) grey hairs as a result. Wishing you the very best. I truly hope this helps.",
      "MessageIndex": 2,
      "PostDate": "24/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/180121/last-chemo-and-approaching-surgery",
      "Title": "Last chemo and approaching surgery"
    },
    {
      "AuthorID": "OneTooManyBiscuits",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/onetoomanybiscuits",
      "Content": "Hi Lellyv, My wife had 7 rounds of chemo - 4 x DTP and 3 x EC. Each chemo cycle was administered every 3 weeks. The pattern for her, approximately, was: totally wiped out and bed ridden for the first week, mostly bed ridden with some upright sofa time the second, with the third week mostly back to normal but feeling very delicate. So I'd lose my wife two weeks in every three. Obviously everyone's different, as are the medications being administered, so the norm for my wife probably won't be the norm for you. However, you will start to see the pattern as your treatments continue. My advice would be to keep a list of side effects to discuss at your regular oncology appointments. The Oncologist will know what's normal and what's not. Anything too unbearable should be discussed with your key worker/breast care nurse/GP as soon as possible as they are often able to use either a different medication or offer additional medication to counteract the side effects. Once you come out the 'other side' of this chemo cycle, and before the next one, I would also recommend that you spend some of your recovery preparing for the next cycle. Things like sports drinks (think Lucozade or similar), bottled water, long lasting comfort foods - preferably high in energy and nutrients - are all useful to have to hand. Fresh fruit (of course) and either pre-cooked meal batches in the freezer or even ready meals - stuff that's quick and easy to prepare. Also consider having your shopping delivered. If you can afford it, someone to come in and help you stay on top of housework a couple hours a week would also be beneficial. Anything that will lighten the load during your down time, essentially. Make sure you keep your fluid intake high - you need to be aiming for a couple of litres of water per day, give or take. This will help aid a speedy recovery. Finally, have some boiled sweets, lollipops or similar sweets to hand as they are packed with energy and help with knackered taste buds. My wife's chemo was a waking nightmare, quite frankly, but we got through it and it destroyed her tumors, so it was totally worth the ordeal. I hope yours goes a similar way...without the waking nightmare bit, or course. I hope this helps in some small way.",
      "MessageIndex": 13,
      "PostDate": "16/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179673/morning-ladies-advice-please",
      "Title": "Morning ladies advice please."
    },
    {
      "AuthorID": "OneTooManyBiscuits",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/onetoomanybiscuits",
      "Content": "Lellyv - there's really nothing to be sorry for. You're in an extremely unenviable predicament so feeling low is perfectly normal right now. If anything, I'm sorry for suggesting potentially unrealistic things. It was presumptuous of me. My wife is still healing but she's making steady, incremental progress. We're 5 weeks post surgery today (yay!). She has a herceptin jab this afternoon though, so it's very much ongoing. As Bustysusy suggested, your best bet right now is to contact Macmillan. They've been wonderful in the support they've provided my wife and me over the past year. More so my wife - I always struggle to ask for help and I hate to rely on the kindness of strangers (no idea why) so it took me having a minor nervous breakdown to reach out. But that's probably a story for another time. In short, it's an awesome organisation. The number's plastered all over the website here but just in case, it's freephone: 0808 808 00 00 This is a link to the page which provides a bit more info on the financial side of things: https://www.macmillan.org.uk/information-and-support/organising/benefits-and-financial-support/benefits-and-your-rights I've also seen https://www.turn2us.org.uk/ mentioned on a number of forums but it's an unknown organisation to me, so definitely try Macmillan first. It's one of those things - a pain to get it done but, once it's done, you can focus on what's important. Stay resolute and don't give up.",
      "MessageIndex": 16,
      "PostDate": "16/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179673/morning-ladies-advice-please",
      "Title": "Morning ladies advice please."
    }
  ]
}