{
  "AuthorID": "owsmum",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
  "Posts": [
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "Hi, does anyone have any advise on these drains? Had my op on Friday, 1st drain came out on Monday the second seems to have started increasing, had out put of 50 on Monday but is slowly creeping back up and was over 60 again  this morning and is also gathering under my arm.?? Any advise would be great fully received. Thanks",
      "MessageIndex": 0,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137451/mastectomy-post-op-day-5-one-drain-out-the-other-still-very-lively",
      "Title": "mastectomy, post op day 5, one drain out the other still very liv..."
    },
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "Hi, I had my second FEC yesterday. I was feeling really sick last time, ginger beer and biscuits helped with nausea and ice lolly's for mouth and throat. Look up a company called gel lair on the Internet,  if you fill in your details they will send you some free samples of their gel mouthwash. BUT you should be able to request this on your next oncology appt. You also need to request the antisickness EMEND, I had them this time and feel a lot better. They will give them to you as they want to make this as easy or us and them as possible. You'e doing great, won' take long and it'll soon be over with, at least you should feel relatively ok for Christmas and new year. Next one 13th December! Take care and let everyone else wait on you. ",
      "MessageIndex": 28,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115388/struggling-to-drink-recommended-fluids-after-chemotherapy",
      "Title": "Struggling to drink recommended fluids after chemotherapy!"
    },
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "Hi linsw, I too am a control freak!! I had my mastectomy on the 1st Sept,  the surgery or thought of surgery for me was the worst bit. really, it wasnt as bad as I imagined, I went down late afternoon. I woke in recovery and was absolutely fine, no pain nothing. the next morning I was out of bed, taking myself to the bathroom etc. I even had a look at what had been done before my surgeon come on his rounds. And to be perfectly honest that to was a nice surprise, nice and tidy. I have to wait until after radio for reconstruction too.  I got a couple of nice post surgery bras from m&s and their inserts, put one on for the first time yesterday, although I looked my old normal, I thought it looked ridiculous. My 10 year old son came in from school and stared at me, he said \"have you had your book job today\" hilarious!!! Try not to worry too much, it's out of our control. you'll be fine, we all are! we're all here if you need a vent. BE STRONG, BE AMAZING!!",
      "MessageIndex": 15,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138012/having-a-mastectomy",
      "Title": "Having a mastectomy"
    },
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "That's \"have you had your boob job\"!!!",
      "MessageIndex": 16,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138012/having-a-mastectomy",
      "Title": "Having a mastectomy"
    },
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "Hi linsw, ha ha, they're so funny aren't they. my son, doesn't want to see, he was asking questions about my op so I asked him if he wanted to see, he had that horrified look on his face that they get \"noòooo way you're alright\" was his reply!  You've got to laugh at them.",
      "MessageIndex": 21,
      "PostDate": "25/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138012/having-a-mastectomy",
      "Title": "Having a mastectomy"
    },
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "***UPDATE*** Hiya, from what I can gather it's, invasive ducal carcinoma, stage 3 grade 2. He got 14 glands from under arm. ET+ & HER2+ one of the tumours was 4cms. Chemo, tamoxifen and herceptin.  Got to wait for oncology appt now. I think he said 4 months of chemo maybe radio to follow but the tamoxifen and herceptin will be years I guess. Feeling positive and ready for what lays ahead.",
      "MessageIndex": 0,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138327/todays-post-surgery-update",
      "Title": "todays post surgery update"
    },
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "Fantastic attitude! PMA. Big hugs",
      "MessageIndex": 6,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137953/need-some1-to-talk-please",
      "Title": "Need some1 to talk please"
    },
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "I'm sure I would be the same in your shoes. My story is, gp appt 3rd August,  mammogram, ultrasound and biopsys 10th August,  ct scan 13th August,  confirmation that hormone+ and HER2+ 16th August,  surgery 1st Sept,  home 4th Sept. All of that within a month, still don't know type, stage or grade until I go back on the 20th Sept for path report and treatment plan. All in all its been crazy and quick so haven't really had time to think about it too much. It's easy for us to say don't worry or be scared but whatever we all need to get on and get it sorted. big hugs, try to be positive. We're all here for you whenever you need a chat or a moan or to scream from the rooftops. It will get better and just remember......... YOU ARE A STRONG WOMAN, YOU'VE GOT THIS AND WE'VE ALL GOT EACH OTHER. Xx",
      "MessageIndex": 5,
      "PostDate": "14/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137953/need-some1-to-talk-please",
      "Title": "Need some1 to talk please"
    },
    {
      "AuthorID": "owsmum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/owsmum",
      "Content": "Hi Peanut 1,  I too am HER2+ ER+ Had my surgery 1st Sept, started FEC-T chemo on 1st Nov. The first 3 were the FEC part you have this every 3 weeks, I found that reading the stories on here sometimes helped, you get worst case scenario so then it doesn' semi so bad. Positive mental attitude goes a long way, be strong you can beat this. I had my first \"T\" part along with my first Herceptin on 3rd Jan, they didn' tell me before but I had to stay on the ward for 6 hours just incase I had a reaction. I wasnt prepared for a stay so was sat there bored for hours. It took 2 hours for the \"T\" to be administered. So I'm 2/3 of the way through chemo, i'll have to have 18 lots of herceptin in total, they continue every 3 weeks, so basically it works out 12 months. I will also, at some point start tamoxifen tablets, I hink they're for 10 years. Radio therapy after chemo too. It' all very doable, don't sacred or overwhelmed, if youre unsure or having a wobble there is always someone on here to talk to. Good luck Big hugs",
      "MessageIndex": 3,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146297/her2-and-er-positive",
      "Title": "Her2 and ER positive"
    }
  ]
}