{
  "AuthorID": "Pakamac",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pakamac",
  "Posts": [
    {
      "AuthorID": "Pakamac",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pakamac",
      "Content": "Hi Coco, I had the LD Flap with small implant in 2016 (expander was exchanged in 2017) and know how little time you have to make a decision.  I had complete faith in my surgeon that he was giving me the right option, although my decision, you do have to put a lot of trust in their expert recommendation.  Yes it’s a long operation, and recovery takes time and you must do the excercises to regain movement.  My surgeon has matched my shape, size and appearance to my other breast very well.  Happy to answer any questions you might have.",
      "MessageIndex": 8,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/157896/advice-please-cannot-decide-between-ld-flap-and-implant-or-expanders-and-implant",
      "Title": "Advice please! Cannot decide between LD flap and implant or expanders..."
    },
    {
      "AuthorID": "Pakamac",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pakamac",
      "Content": "Hi Coco, I had the reconstruction at the same time as my mastectomy, with the expander fitted at that time and then the permanent implant 8 months later.  I was 6 days in hospital but this was mainly due to the morphine not agreeing with me and making me sick for the first few days (I refused any for the second op and was fine).  Recovery was a slow process and at first I thought I wouldn’t get movement back, difficult for the first two weeks, but it’s amazing how your body repairs and with exercises you see changes each day. I was off work about 4 months.  Pain was mainly controlled with ibuprofen and paracetamol (codeine if you can take it) and not long term.  The back wasn’t too painful actually.  It doesn’t affect your strength in your arms long term, I can still carry heavy stuff, the only thing I notice is if I try and pull something towards me that’s heavy, I feel it pull on the muscle in my breast. No nerve pain but it does still feel a little tight especially when I’ve done a lot and I’m tired.  On the plus side, as I’ve said, it’s a good shape and look and I still have a nice cleavage so can wear nice sundresses. A lot to think about I know. xx",
      "MessageIndex": 12,
      "PostDate": "27/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/157896/advice-please-cannot-decide-between-ld-flap-and-implant-or-expanders-and-implant",
      "Title": "Advice please! Cannot decide between LD flap and implant or expanders..."
    },
    {
      "AuthorID": "Pakamac",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pakamac",
      "Content": "Hi Blaster, it took a few months to be fully ready to go back to work.  There’s a lot of healing both external and internal plus exercising to get movement back in the arm and shoulder.  My surgeon advised before the operation that he couldn’t match my other breast with muscle alone so recommended an implant.  Alternatively I could have just gone with a smaller breast reconstruction and then used a prosthesis in my bra but I didn’t want this.  If you’re worried about implants talk to your BCN about how safe they are today.  All implants are registered now so they know exactly when implanted and what type each person has.  I don’t have any residual back pain, just tightness still but that should get easier.  You obviously have pain at the time of the op but that is controlled effectively with pain killers.  It’s a hard decision I know and usually not a lot of time to make it in xx",
      "MessageIndex": 8,
      "PostDate": "01/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153846/ld-flap---back-flap-reconstruction",
      "Title": "LD flap - back flap reconstruction"
    },
    {
      "AuthorID": "Pakamac",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pakamac",
      "Content": "Hi Blaster, you’ll be fine for September if you’re due to have the op soon.  I had an expander fitted so had regular expansions to stretch the skin ready for a permanent implant so that probably added to my recovery time.  Good luck with your decision, if you want to know anything else once you’ve decided, just ask xx",
      "MessageIndex": 10,
      "PostDate": "02/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153846/ld-flap---back-flap-reconstruction",
      "Title": "LD flap - back flap reconstruction"
    },
    {
      "AuthorID": "Pakamac",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pakamac",
      "Content": "Hi Blaster,  I had LD reconstruction in Nov 2016.  In order to match my other breast the surgeon also recommended a small implant, so I had an expander fitted at the time and then a second op in July 17 to exchange the expander for the permananet implant. The surgeon has matched the shape and size very well.  I must advise you that it is a long operation and you may stay in hospital for a few days.  I was in for 6 days but I reacted badly to the morphine.  I had three drains and getting to the loo was difficult at first as you can’t move you arm on the affected side.  I found it was a long recovery and it’s important to do your excercises to get your movement back in your arm. I still find that my back and new breast can feel tight at times, and can ache when I’m tired.  It’s not affected my strength too much, I can lift quite heavy stuff but have a little weakness when pulling things.  I’m pleased with how I look, I can wear bikini tops and no one can tell I’ve had reconstruction.  More than happy to answer any further questions you have to help you make a decision.  I remember how overwhelming it all was.",
      "MessageIndex": 5,
      "PostDate": "31/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153846/ld-flap---back-flap-reconstruction",
      "Title": "LD flap - back flap reconstruction"
    },
    {
      "AuthorID": "Pakamac",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pakamac",
      "Content": "Hi HopeRu I will certainly raise that again when I next go back to the Breast Unit.  I am due a mammogram in November and they will certainly be keeping an eye on me. I haven't been offered chemo as there hasn't been any spread to the Lymph nodes and I assumed that this wasn't required. I will be interested to see what your research on this shows. Thanks for the hug, sending one back.",
      "MessageIndex": 4,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/35697/hodgkin-lymphoma-survivor-with-breast-cancer",
      "Title": "Hodgkin Lymphoma Survivor With Breast Cancer"
    },
    {
      "AuthorID": "Pakamac",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pakamac",
      "Content": "Hi, I had Hodgkins Lymphoma thirty years ago with RT (chemo 2yrs later) and last year was diagnosed with DCIS in my right breast.  I've had annual mammograms for the last 13 or so years, since the link was found with BC, and had become a little complacent that it wasn't going to happen to me.  Then last year the fatter envelope dropped through the door and I knew then that things weren't right. I subsequently had a right mastectomy with LD Flap reconstruction with tissue expander and recently had the expander exchanged for an implant.  Bilateral mastectomy was never mentioned as an option as they couldn't say whether this would develop in both breasts.  It's been a tough year but grateful that it was at least picked up early.  I do wonder how many people go on to develop BC after Hodgkins. ",
      "MessageIndex": 2,
      "PostDate": "11/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/35697/hodgkin-lymphoma-survivor-with-breast-cancer",
      "Title": "Hodgkin Lymphoma Survivor With Breast Cancer"
    }
  ]
}