{
  "AuthorID": "PanTuco",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pantuco",
  "Posts": [
    {
      "AuthorID": "PanTuco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pantuco",
      "Content": "Hello Ginacarla That has just happened to me, yesterday at my initial Oncologists appointment, when I was fully expecting to be told I had to start chemo and be given a date, the oncologist floored me by using the NHS Predict tool that gave the result of only 3.6 % benefit from chemo - Letrozole and Radio were of more use... unfortunately she would not commit to saying ‘it’s of no use really’ and left it to me to decide! Needless to say I am agonising over this - having two positive nodes meant I was certain that chemo was the next step...  Can I ask what you eventually did ? It’s because I am HER neg I think, the OPTIMA trial was also an option but again, very likely that would lead to chemo and without knowing if test recommended it ... Best wishes  Thistle ",
      "MessageIndex": 30,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159772/nhs-predict-tool",
      "Title": "NHS predict tool"
    },
    {
      "AuthorID": "PanTuco",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pantuco",
      "Content": "Hello Jac Thank you so much for that, I was actually considering ringing my BCN but felt reluctant to bother her, she is really nice though...l have asked to see the oncologist again, I do need to get some things clarified as you say!  I really appreciate your kindness, it means a lot.... Gratefully  Pan ( sometimes Thistle.. wrong username, wrong forum ) ",
      "MessageIndex": 33,
      "PostDate": "26/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159772/nhs-predict-tool",
      "Title": "NHS predict tool"
    }
  ]
}