{
  "AuthorID": "Parsley lion",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/parsley-lion",
  "Posts": [
    {
      "AuthorID": "Parsley lion",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/parsley-lion",
      "Content": "Hi just back from my nurse review, before my first T tomorrow, more worried about this one as its clearly harder to do, up to now apart from a week of feeling a bit grotty each time I have got of quite lightly with FEC. Unfortunately I got the \"glass half empty\" nurse today who has given me a whole long list of SEs always good news! She did suggest that I paint my nails black/purple has anyone else done this? My previous BC nurse ( always happy but on holiday unfortunately)told me that in 17 years she had never seen anyone paint their nails (except with nail hardener) and she was not sure it would help as you would not be able to tell if there was a problem. So now I am a bit confused. on the hair front I did not use a cold cap, basically because I did not want to have to sit in the unit any longer than necessary and I decided that in the grand scheme of things losing my hair was the least of my worries, as I stated in July when it was hot (remember that) I did not bother with a wig but treated myself to a couple of hats which look like cleverly tied scarfs from suburban turban, a bit more expensive that the cheaper caps I got from a local shop but worth it, I have had so many people ask me how I tied them and how good they look ( don't like to say there fake!) felt a bit self conscious the first time I went out but now don't even think about. I do still have some hair it's very thin but has stopped coming out thought the rest would go with 3rd FEC but I still have it all over with more around my ears and a bit of a punk look across the top, very strange, but I guess everyone is different, I can only say that in my case I lost a little with 1st FEC a lot with 2nd and none with 3rd, who knows what the T will do.  Think there are a few of us due the next dose tomorrow, hope it all goes well for everyone. Just thinking of it as one more down, getting closer to the end. jackie   ",
      "MessageIndex": 176,
      "PostDate": "02/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Parsley lion",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/parsley-lion",
      "Content": "Hi All have been missing for a while as all kinds of problems logging in, back up and running now. Gearing up for FEC 3 on the 13th seams to be a popular day to be having treatment.  Smoothie I am with you on the shopping front, I have become an avid Internet shopper, so much easier, to be fair years of working in retail has also made me a bit jaded on that front. I have never worn much make up and would not how to draw on an eyebrow without a lot of tutoring, so don't think I will bother, at the moment mine are still intact. I have injections for 5 days a starting on the 5th day after treatment, does not appear to be a standard way these are given out, I find these really knock me sideways, more than the chemo, not looking forward to these becoming 7 once I start on the T.  My hair seams to have stopped coming out leaving me with this mad professor look as I have hair over the top of my ears and a long bit which appears to have kept growing as I had my hair cut short drapped across the top. I have not used a cold cap so I am not sure why I have kept some. I have been living in a sleep cap which is very comfy and has stopped me finding hair in tea, food ect which is good. jackie",
      "MessageIndex": 53,
      "PostDate": "10/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    }
  ]
}