{
  "AuthorID": "patrb",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
  "Posts": [
    {
      "AuthorID": "patrb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
      "Content": "Good Luck Ansti.  I have recently been diagnosed.  I had a lumpectomy, but there was not a clear margin around the tumour, so had a second op (not too much pain at all, and my sis who had a mastectomy did not suffer - found the chemo more difficult) and there are still some cancer cells floating  around near to the tumour site!!  So now have to decide whether to have a mastectomy or have radiotherapy and hope to destroy those remaining cells.  I was quite determined to have a M, but now am thinking of going for RT in the first instance. Long term effects of RT worry me more than thought of M.  It is a difficult decision!! Like others say here, it does seem to be a drip feed system for info - I have felt ok mentally from the start, but beginning to go down as the info goes from lumpectomy and RT, to possible M, to chemo and surgery................. Experiences here are really helpful. patrb",
      "MessageIndex": 20,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139537/surgery-in-10-days-then-no-idea",
      "Title": "Surgery in 10 days, then .... no idea"
    },
    {
      "AuthorID": "patrb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
      "Content": "Hello Maz, good to hear that you are positive - I also made that decision, and have mastectomy on the 29th Nov.  I had a couple of smaller lumpectomies, but there was no clear margin and so decided that I'd go the mx route before radiotherapy and see what happens.  I won't have reconstruction either, I think it is becoming more understandable just to reduce ops and be flat or lopsided!  I've looked at nicolajane which do good bra's with prothesis.  All will go well and stay positive! x",
      "MessageIndex": 4,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142751/i-ve-made-my-mind-up",
      "Title": "I've made my mind up!"
    },
    {
      "AuthorID": "patrb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
      "Content": "Hi All, Have been taking Anastrazole for one week - and felt slightly itchy, but this morning woke with rash and redness around hips and tum and top of arms.  Have looked into this with different responses (back in 2015 it seems rash was not even on the 'side effects' listing).  Anyway, come onto this site to find up to date experiences of this drug, and if such a quick adverse reaction is normal (before getting in contact with bcn.   Thanks.  patrb",
      "MessageIndex": 339,
      "PostDate": "26/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "patrb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
      "Content": "Some relief choecat that the sight is likely to improve.  So apart from having your monitor, where are you left with different meds you need to take? I am going to try taking Thistle Milk, which helps the liver deal with toxins, and see if that improves my reaction to anastrozole rather than it flushing out with skin rashes! Worth a try................... x",
      "MessageIndex": 345,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "patrb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
      "Content": "Hi Chloecat.  Just read through all of this thread.  Brilliant on you for your ongoing questions and research and postings.  Totally agree that we HAVE to question for ourselves what is proposed for our bodies.  Newdawn, why, out of interest, are you questioning having had a mx?  I recently diagnosed with ER+ HER- stage 2.  Had lumpectomy, but no clear margin, 2nd op and after this shows rogue cells still lurking, though it appears that no cells yet as far as sentinel.  I don't want the chemo or radio route (at this stage, because I don't want the side/long term effects that I've witnessed close to me), but am now asking for mx (double if they will), as I see this as a way to be clear of cancer and get on with life.  My friend and sister had mx with reconstruction, which I am not interested in having (reconstruction). Both had chemo and RT, one here, one not.  There really is no absolute guide book! Thanks and thoughts for all.",
      "MessageIndex": 333,
      "PostDate": "15/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "patrb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
      "Content": "Thanks chloecat.  and I missed the bit of your ongoing maladie about the stroke and the eye check.  I wish you well for wednesday. I do understand that the radiographer didn't want to comment as my sister is a radiographer and can't say anything about diagnosis, in theory they just have to make sure a good xray is taken, but they do 'hot foot' any worrying xrays through. I am seeing surgeon tomorrow to discuss further surgery, this will be mx, which I wish I'd had in the first place!  I would have that and no other treatment as I am not reacting well to the Anastrozole and already have back and bone problems. Sending strength and positive thoughts to all that are affected by cancer diagnosis. x",
      "MessageIndex": 341,
      "PostDate": "30/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "patrb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
      "Content": "Thanks Kacang and Dreamthief!!  Stopped me in my tracks before getting to herbal store!!  Going to do some reading up instead!! (it is intriguing what things can react or stop other meds and remedies from working - I used to be an animal nurse and was up on these things, obviously gone rusty!!) pat",
      "MessageIndex": 348,
      "PostDate": "04/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "patrb",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patrb",
      "Content": "All the best chloecat, enjoy christmas. x",
      "MessageIndex": 362,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    }
  ]
}