{
  "AuthorID": "Patsy plum",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
  "Posts": [
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Flower, I asked about this only a few days at my GP practice, apparently I am on the practice list but they have advised me to check with my surgeon, follow up appt next week, to ask if they are having to give the go ahead prior to my next treatment, which at present I don't know the next step. Perhaps a quick phone call could clarify this for you. Hope all goes well for you, best wishes, Pat.",
      "MessageIndex": 1,
      "PostDate": "24/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99078/flu-injection",
      "Title": "Flu injection"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Cew, I also have some bras which aren't mastectomy bras, but my softee tends to move around a bit, nothing massive, but I do have to adjust it. My breast nurse said I could sew ribbons on the bra and softee to secure  it or even small saftey pins. I just wanted something that I didn't have to adjust several times a day, when I get my permanent prosthesis this very small annoyance may not happen. I sent my pre mastectomy, underwired bras to the charity 'Smalls for All' xx",
      "MessageIndex": 6,
      "PostDate": "28/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99142/bra-shopping",
      "Title": "Bra shopping!"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Medusa, 3 weeks on from mastectomy and I am wearing a mix of bras, I bought some lovely mastectomy bras from Debenhams, all were £20 or under. My normal bras are not unsderwired, I got rid of those, but I find my softee travels, haha, which is why I went for the pocketed bras. My scar line is across of the centre of where my breast was, but because I had full node clearance I didn't want wires at present as it will just touch the top of the surgery site. Asda sell a range of mastectomy bras, which come in around the £10 mark, not sure if hey are in stores or online only. M & S also do bras, my local branch was online online only, and again they are very reasonably priced. I went to Debenhams as they had them in store and I wanted to come away feeling cheered up. Xx",
      "MessageIndex": 1,
      "PostDate": "01/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99360/prosthetic-boobs",
      "Title": "Prosthetic boobs :)"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Today I phoned my local Debenhams and spoke to one of the staff as to whether they had mastectomy bras or online only, they had them in store and some were in on sale she told me. I was so excited that my husband told me to switch the oven off, he was about to do some lunch, and we would go shopping straight away! Arriving in the lingerie dept, I asked where the mastectomy bras were, she asked me if I was the person who phoned earlier, to which I said yes. Well, what amazing service I received, first she looked through the sale rail for me, but nothing I my size, showed me all the different styles available, and then offered help should I have any problems putting my softee in the pockets. I wanted some matching briefs to go with one of the bras, which they didn't have, and whilst I was changing she sent my husband back to the changing room with an almost exact match. My husband was allowed to come in and see me once I had the bras on as I wanted his opinion on the fit. Amazing service and I love the very feminine and pretty bras. I have chosen moulded cups as I look even, I am on every happy bunny!",
      "MessageIndex": 0,
      "PostDate": "26/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99142/bra-shopping",
      "Title": "Bra shopping!"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you J for your reply, it is very much appreciated. Roller coaster it is, and I've never been fond of them, but I'm aboard now, lol!",
      "MessageIndex": 3,
      "PostDate": "10/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97510/newly-daiagnosed",
      "Title": "Newly Daiagnosed"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "So pleased your recovery is going well. Well that is a blow, you have already come so far, you will get through this next part of your treatment. Please leek me posted how you are doing, And before long I may well be joining you on the chemo trip!",
      "MessageIndex": 4,
      "PostDate": "10/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97510/newly-daiagnosed",
      "Title": "Newly Daiagnosed"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hello! I was diagnosed with stage 2 lobular breast cancer, 6-8-2015. Hormone medication started. My lovely doctor has told me I will have a mastectomy. Awaiting MRI scan and follow up appt with doctor, will then know the decision of the MDT as to my treatment after surgery. So far it's been one hell of a ride!",
      "MessageIndex": 0,
      "PostDate": "10/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97510/newly-daiagnosed",
      "Title": "Newly Daiagnosed"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Fiddlesticks, I don't think I can add anymore that what the other ladies have said. Waiting for results is very hard, there is o right or wrong way to deal with it, and letting your emotions out is a good thing. Pent up worry and anxiety is not helpful. Like most women, I can be fine and then from nowhere I can be crying, and now I no longer try and 'pull myself together' it's what Ineed to do, goodness knows I've the earned the right to have a boo! As have you. Sending you a big hugxxx",
      "MessageIndex": 23,
      "PostDate": "26/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100391/not-coping-coping-with-the-wait-for-results",
      "Title": "Not coping/coping with the wait for results."
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Narna, take a look at the look good feel better website. www.lookgoodfeelbetter.co.uk I did a quick look and there is a Masterclass in Skipton on Friday 11th September. Phone 01274 776688. I have heard they are really good, skin care and makeup, which you get shown how to do etc, plus you may get a goody bag to take away with you!",
      "MessageIndex": 2,
      "PostDate": "06/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98425/pamper-cancer-east-sussex",
      "Title": "Pamper Cancer, East Sussex"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Fiddlesticks, I'm ok, been keeping my head down, had scans and oncology appts, just been a whirlwind. Chemo starts Friday, Fec T, 6 cycles, and then rads. Preparing for the worst, so anything better is a bonus. The joy of it all! Absolutlely, let it all out, my husband and I laugh and cry together, it's the best way. That's lovely that you have people around, it really does help, just to feel life is not all about cancer. xxx",
      "MessageIndex": 28,
      "PostDate": "26/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100391/not-coping-coping-with-the-wait-for-results",
      "Title": "Not coping/coping with the wait for results."
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "If you live in East Sussex and close enough to get to Ringmer, The Hair Barn, is offering Pamper Cancer apps on the 2nd Sunday of each month. These apps are free, and offer hair and beauty treatments, including cuts, head shaving, manicures, head massage and scarve tying ideas. It is open to men and women. The apps are open to anyone diagnosed with cancer no matter what stage of treatment. Here is their web address. Scroll down the home page for the pamper cancer link. www.thehair-barn.co.uk",
      "MessageIndex": 0,
      "PostDate": "06/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98425/pamper-cancer-east-sussex",
      "Title": "Pamper Cancer, East Sussex"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I also didn't have any stitches, I was glued,and then had little steri strips over the scar line and a protective dressing over the top. The result is very neat. I also use bio oil.",
      "MessageIndex": 3,
      "PostDate": "27/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100459/feeling-anxious-what-can-i-expect",
      "Title": "Feeling anxious....what can i expect?"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I don't know about brave and an inspiration JJsailor, but your comment has made me smile. I hope that my post has given even a little bit of an insight as to how it can be, and is for a lot of us undergoing breast surgery. I have been up for a few hours during the night, but I think that is mostly to do with my sleep routine being disturbed in hospital, it is definitely not to do with terrible pain. I do feel somewhat stiff, and am now getting what I can only describe as little shocks or tingling where the nerve endings are already starting to find a new path, this again is not painful, just a little odd! I have kept on the move from the first day after surgery, I now know the corridors of my local hospital as well as the staff. Am doing my exercises to help with the stiffness and hopefully regain full movement. I shower from the waist down and sponge was my top half, my BCN said the dressing is really not waterproof. Other than not sleeping that well last night, I feel ok, planning some fresh air today, a walk, which is preferably close to somewhere to have afternoon tea! Pat xx",
      "MessageIndex": 4,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98595/home--post-mastectomy",
      "Title": "Home- post mastectomy"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Tilly, Hair washing for me today, with the help or hindrance of husband. I think our tiny bathroom may end up being more of a wet room! I have a bra on, a very soft sports style one from Asda and my softie is inside and I feel good. Pat xx",
      "MessageIndex": 6,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98595/home--post-mastectomy",
      "Title": "Home- post mastectomy"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Clump and Helen, things are still going well, I have very good arm movement, but do exercises every day. I do have a little bit of swelling under my arm and on the inside of my upper arm, keeping a close eye on it. The little shocks like to do their own thing, still odd and so far only had one that made me yelp! I have cut the meds down to half the amount, as I feel that level is right for me, plus I find they have made me constipated which I find more uncomfortable. I have had a few more tears, but that is fine, and I am ok with my body, I do have a knitted knocker which arrived this morning, it is so very comfortable and fits really well. I am truly grateful to the staff at the hospital, everyone of them was fantastic, and I think that helped with the all important start to my recovery. Clump, I wish you well for your surgery, everything will be fine, and you will be on the road to physical healing. Be gentle with yourself, and let others help, rest when you need to, try the exercises every day, and get well very soon, Pat xx",
      "MessageIndex": 10,
      "PostDate": "14/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98595/home--post-mastectomy",
      "Title": "Home- post mastectomy"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I had my mastectomy on Wednesday and came home today. I went down for surgery at 3pm and was back on the ward at 6.40pm, I was a bit sleepy in recovery! My surgery went well, and by 10am the next morning I was washed, dressed, and had done my makeup. I had looked at my wound site but obviously the dressing was in place, but I was not horrified by any means and can only say I felt a huge sense of relief that my breast had gone. I had one drain in place, my breast care nurse advised me to stay in two nights, as she felt it better to make sure the drain didn't collect more than 50ml, and to have it removed before I went home, and I was happy with that. The drain was removed today, it gushed a bit, and was probably placed about 4-5 inches under my arm. It wasn't painful coming out, just a slight stinging. Both nights in hospital I had an injection in my tummy, this is usual practice to prevent blood clots, and neither injection hurt. The pain killers I had in hospital and came home with are paracetamol and naproxen, an anti inflammatory. I am not in pain, I just feel a bit stiff. I tried on my bra about an hour ago with the help of my husband and placed the softie inside. Then the tears came, he was amazing and told me I looked fabulous, and without the bra I was just as gorgeous as ever! I must mention one all important thing, from the lady who came with the early morning tea to my surgeon, I was treated with great kindness, and professionalism. I do not have the words to express my gratitude to all those involved in my care.",
      "MessageIndex": 0,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98595/home--post-mastectomy",
      "Title": "Home- post mastectomy"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Wonderful news! Very, very happy for you, Pat xx",
      "MessageIndex": 3,
      "PostDate": "12/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98624/finished",
      "Title": "finished"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I had my MRI this week and went in feet first. I had my arms stretched out in front of me with some very comfortable pads placed under my arms to support them. I had headphones with music although the whirring of the machine at times did at times block the music out. The staff were all really lovely and chatty and spoke to me regularly throughout the scan. Beforehand I was given a very thorough explanation of the procedure which set my mind at rest. The room was also cool, I was offered a blanket but felt that if I had a hot flush I would become too hot. The staff were really so caring, helping me off the scanner and covering me up before I was fully up on my knees to preserve my dignity. Although I was a bit apprehensive at first, they made me feel so well looked after, that everything was just fine.",
      "MessageIndex": 4,
      "PostDate": "21/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97940/mri-claustrophobia",
      "Title": "MRI claustrophobia"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi weemaw, I had full node clearance a little over two weeks ago, I have that burning sensation, pain etc. my BCN said it could be massaged. My husband massages my whole arm from wrist to and underneath pit. The BCN said to massage up NOT down. I have found. This really helps, especially after a bath before I go to bed. It enables me to get a full nights sleep. I use an Argan oil based moisturiser, butI would think any moisturiser which is not perfumed could help. Hope the discomfort eases for you soon xx",
      "MessageIndex": 1,
      "PostDate": "26/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99122/new-pain-under-arm",
      "Title": "New pain under arm"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I will be having a unilateral mastectomy, and wondered whether I will need to have a bra for when I leave hospital, and whether I should be buying one that is the same size as I currently wear or go up a size to accommodate any swelling. I would prefer to buy from a shop rather than online, does anyone know if the M&Srange are any good? Thanks for your help, Pat.",
      "MessageIndex": 0,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97694/bra-recommendation-post-surgery",
      "Title": "Bra recommendation, post surgery"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you both for your replies, both very helpful. I am usually an under wired girl, so these will be redundant very soon, but I know of a charity that accepts bras to be sent to girls and women in Africa, so I know they will be helping someone else and makes me feel a little better. I will definitely talk to my bcn, as I have no idea what my hospital offers in the way of advise, fitting or ordering bras, if any. At present I am erring on the side of no reconstruction, my doctor has said he can do it at the same time as my mastectomy, but until I have spoken further with him and my bcn I haven't fully decided. One step at a time suppose xx",
      "MessageIndex": 3,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97694/bra-recommendation-post-surgery",
      "Title": "Bra recommendation, post surgery"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you both for your replies. I like the idea of the camisole tops and will look into those further. I discovered that Amoena offer a private fitting service and will make an appt with them. Amoena is only a couple of hours drive away so well worth a visit. Before hand I will talk to my bcn thoughts see what she recommends for me. Pat x",
      "MessageIndex": 8,
      "PostDate": "16/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97694/bra-recommendation-post-surgery",
      "Title": "Bra recommendation, post surgery"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thanks Hevbojangles, I think I may well be in the same situation you were in. There are so many positive stories of reconstruction, and equally women who have decided to go flat. All the balls are up in the air at the moment, just not sure which way to turn!",
      "MessageIndex": 5,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97694/bra-recommendation-post-surgery",
      "Title": "Bra recommendation, post surgery"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I have pqcked my bag, written a note for myself to NOT forget chargers, just have to remember to read the note in the morning! Then I'm off, have to be at the hospital for 7.30am, I will be going to theatre, so my surgeon has told me later in the day. His team like to treat day case patients first, which makes sense, plus he told me, you don't want to go down early, I don't, I responded, thinking he's having a laugh here, no he tells me, we will have warmed up later in the day! Everything still feels quite unreal, as I don't feel unwell, and I'm sure many ladies have felt this. I have no idea how I will feel mentally once post op, I just have to come to terms with the fact that it is vital. This evening I am pampering myself at home, having something nice to eat, and I have told my lovely husband and son that 'the precious' (TV remote control) is all mine! So ladies, and gentlemen, I'm signing off now for a couple of days, as hope to be home asap. I hope that you all have some very good days and for those that are upset and confused that you find peace and comfort. There are lots of lovely people on this forum to help. My very best wishes to you all, Pat.",
      "MessageIndex": 0,
      "PostDate": "08/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98501/mastectomy-tomorrow-9-9-15",
      "Title": "Mastectomy tomorrow, 9-9-15"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you everyone for your wishes, so very kind of you all. I am home now and feel ok, I have written a new post encapsulating everything in a nutshell. All I can say is that the fear of waiting has been worse than the surgery and I am now on the road to recovery from this stage of treatment. Hope that everyone is doing ok, best wishes, Pat.",
      "MessageIndex": 11,
      "PostDate": "11/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98501/mastectomy-tomorrow-9-9-15",
      "Title": "Mastectomy tomorrow, 9-9-15"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "You will look amazing! Whenever I have seen women with head scarves I always think how beautiful they look and you will be no different. Xx",
      "MessageIndex": 3,
      "PostDate": "21/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98939/work-with-head-scarf-on",
      "Title": "Work with head scarf on !"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you Chloecat45 for your input, very helpful. I will bear in mind the brand of Anastozole, mine is the Accord brand. Yesterday was a tricky day, I had zero energy, sweating like never before, and by the time I went to bed felt as though I had flu! But, today is a better day so far and I take heart in that and continue to move forward. My very best wishes to you Chloecat45.",
      "MessageIndex": 5,
      "PostDate": "21/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97893/anastozole-neoadjuvant-treatment",
      "Title": "Anastozole, neoadjuvant treatment"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you also much for helping me. Every word you have all said rings true. I am retreating a little to have a quiet time, so many phone calls, lovely gifts and visits , appreciated beyond words, but now I need the time as you say JJ to lick my wounds, and start the process of coming to terms with things in my own time, with just my family. Still I did get a very gentle arm and arm pit massage from my husband, that was a first! Love to all of you xxx",
      "MessageIndex": 6,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98984/tearful",
      "Title": "Tearful"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I have been taking Anastozole as a neoadjuvant treatment for 2 weeks. I have found lots of info regarding side effects, but not up to date info regarding the effectiveness of this medication. Some internet searches bring up things from around 10 years ago. I have stage 2 lobular breast cancer, lymph nodes seem to be unaffected and as yet I do not know the size of the mass. At my last appt my doctor said my treatment would be surgery first, mastectomy. I am coming to terms with that, but wonder if any of you lovely people actually know if Anastozole does actually slow down, stop cell growth or even shrink a tumour. Many thanks, Pat.",
      "MessageIndex": 0,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97893/anastozole-neoadjuvant-treatment",
      "Title": "Anastozole, neoadjuvant treatment"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Tilly, your words are very reassuring, even though I wished you still didn't have tears, butI realise now that it will take allot longer than I realised to recover, not just physically but mentally. Hope you are having a relaxing evening xxx",
      "MessageIndex": 8,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98984/tearful",
      "Title": "Tearful"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I suppose it had to happen but the floodgates seem to have opened. The tears have kicked in along with the tiredness. The pain from the axillary clearance and some cording from pit to mid arm, along with what feels like a sunburnt patch on the back of my arm (I have not had rads) remind me all the time that my breast has gone. I'm going to contradict myself her, when I say that I don't miss my breast as it was trying to kill me, I liken it to a person if they were attempting to kill me, I wouldn't miss them one little bit! The physical symptoms in my arm remind me all day of the surgery that has been done. It seems such an age to wait for my follow up appt, and yet it will only be 3 weeks since surgery so not long. Just feeling a bit pathetic at the moment xxx",
      "MessageIndex": 0,
      "PostDate": "22/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98984/tearful",
      "Title": "Tearful"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hello Heather and G'n'J, Thank you both so much for the amazing information you have given me. It is very insightful. Heather, what can I say, so very, very pleased that your treatment has been a success. I see my doctor in another 2 weeks, it will be 4 weeks since I last him and was diagnosd. Since last seeing him I have had another biopsy and MRI. Now I can ask what he hopes the Anastrozole may do for me. He did say surgery would probably only be a few weeks away, so I need to understand as much as possible about the medication. Your replies and the link are a huge help, and so we move forward! I have found that I do not have the energy I had two weeks ago, one minute I'm fine, the next I could curl up and go to sleep. I had some nausea, but that seems better. Not sleeping as well, some mad hot flushes, and I don't know if this linked to Anastrozole, but I feel as though I am on the edge of going down with a virus, felt like this for a few days. Appetite has not been great, so I suppose when I add these together it may well make me feel as though a virus is coming. Still life goes on, and I am grateful for a two week break from apps, awaiting the arrival of my overdue grandchild, and I want to enjoy every precious moment! Thank you both again, you are both amazing ! Pat xx",
      "MessageIndex": 3,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97893/anastozole-neoadjuvant-treatment",
      "Title": "Anastozole, neoadjuvant treatment"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hi Tilly, just wanted to say hello, and I am sure someone can help you with your quandary. I have yet to know about my next treatment plan, but like you I just want to get on with whatever has to be done. At the start of all this, I wanted everything to slow down, now I want it all to speed up. To a certain extent I no longer feel in control of my own life. I think what you are feeling is very normal for us all just waiting, it just isn't easy. I hope you get the answers you need, Pat xx",
      "MessageIndex": 1,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98803/can-i-speed-up-treatment",
      "Title": "Can I speed up treatment"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Just a thought, following my mastectomy and lympth node removal, I use a feather pillow to support my arm and where the breast was, I know you don't have the 2nd issue, but I find the pillow very supportive and comforting. xx",
      "MessageIndex": 7,
      "PostDate": "05/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99480/bras-after-surgery",
      "Title": "Bras after surgery"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Yesterday I went for a 2nd biopsy on a different area of my breast. I felt fine about the appt as I knew the drill. But since the appt I have confused and upset. Firstly the radiographer seemed to have no idea where she was to take the samples from, I pointed to the diagram on my notes where 'X' marked the spot and also the area of my breast where I knew the biopsy should be taken, but obviously not he exact spot! She huffed and puffed saying it was difficult. She then asked me why I was having the biopsy, so I told her because I had been diagnosed with breast cancer. She then asked my treatment plan, I told her that my first treatment was surgery, a mastectomy. To my amazement, she said very curtly, well why does your doctor want another biopsy if you are having a mastectomy, I was stunned, all I could say is because he does. She muttered some more and then said off the cuff, do you want a mastectomy. I could feel tears welling up as she carried on with biopsy saying it's not top of my wish list. When the procedure was over, she asked if I was having an MRI, which I am on Wednesday, good she said as that will confirm whether you have cancer in your right breast as well. I told her indications and test results regarding that breast showed no abnormalities, but that I was aware the MRI might show something up. I left feeling angry, firstly she didn't know where she was taking the samples from, obviously hadn't read my notes or would have known why I was there. Questioned my doctor's reasoning for the biopsy, which I know why, even though my response was lame as I had a brain freeze moment! Asked me if I wanted a mastectomy, now I am a bit confused, did she see something that made her think I don't need a mastectomy, , that's the thought whizzing through my head. Anyone else been in a similar situation?",
      "MessageIndex": 0,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97777/confused-and-upset",
      "Title": "Confused and upset"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you Babara, Helen and Monika for taking the time to reply, very much appreciated. I have been feeling very positive about the mastectomy, I have faith in my doctor and know he would not be recommending a mastectomy if there was an option he felt was better for me. But.... A niggle is now there, which I don't want to have. I have called my BCN and left a message, just saying there are a couple of things I want to discuss, not going into detail. I hope this is just an isolated incidence, as I have received nothing but kindness, courtesy and excellent information along the way. Thank you once again, Pat x",
      "MessageIndex": 4,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97777/confused-and-upset",
      "Title": "Confused and upset"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you Julia and Judith for your excellent advise. I will indeed follow this up. Hopefully my time of having biopsies is over, maybe not, but I would not like to think of another woman or man being being placed in a tailspin and upset. Thank you all once again, I think the niggle is beginning to go! Love to all you wonderful ladies, Pat xx",
      "MessageIndex": 8,
      "PostDate": "18/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97777/confused-and-upset",
      "Title": "Confused and upset"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Hello 58petals. I was diagnosed(stage2) only a couple of weeks ago. I totally understand your thoughts and fears, they are the ones that flip in and out of my head. But as the dust has settled, and joining this wonderful online community many of my worries are abating. You say you are on hormone meds, as I am, Each day I take one I think I am nearer to the end of my treatment, it helps me to try and remain positive. I know it is a hard time with your husband having health issues, it indeed sounds as though it has been a year you want to forget, but you will get through this and it will be behind you. I have a 16 year old son and a 29 year old daughter and awaiting the overdue birth of my 3rd grandson, there is much joy to be had in this world and when your thoughts and feelings settle down you will be just fine. My children and husband have been amazing, even my eldest grandchild knows. In fact my 7 year old has a very important job, he is chief scarf and hat hunter (should I have chemo) and he has already shown me a couple of items which are exactly my style! This community is full of great information and there is a lot of humour, I would feel a little lost without it, so am very pleased you found it. Pat x",
      "MessageIndex": 7,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97842/diagnosed-yesterday",
      "Title": "Diagnosed yesterday..."
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "I went to have an informal chat with my BCN on Monday afternoon. I'm so pleased I went, armed with my list of questions, as well as those that popped into my head, she answered every single one, I was never rushed and I left feeling more positive and informed about my forth coming surgery, what the process will involve, when I will be referred to an oncologist etc. we even discussed whether I need mastectomy bras immediately after. I thoroughly recommend an informal chat, especially once the dust has settled after being diagnosed and there are a million things whirling around in your head. ",
      "MessageIndex": 0,
      "PostDate": "26/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98117/bcn-chat",
      "Title": "BCN chat"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you lovely ladies! Most of the time I am very positive, but there have been a few tears, but better to let it out than bottle it up. Each day is getting easier, I have such wonderful family and friends and this great online community has given me hope, encouragement, determination, information and not feel so alone. Hope you all enjoy and good nights rest, nighty night! Xx",
      "MessageIndex": 5,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98793/mastectomy-a-week-on",
      "Title": "Mastectomy, a week on"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "Thank you s-j I will bear in mind what you have said about the swelling, very useful to know. Hulahoop, I have yet to know whether I will have chemo, follow up appt with surgeon isn't until 1st October and I don't know whether he will tell me my next treatment or when I see the oncologist. Hope you are both continuing to headland that life is being kind to you, Pat xx",
      "MessageIndex": 8,
      "PostDate": "18/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98793/mastectomy-a-week-on",
      "Title": "Mastectomy, a week on"
    },
    {
      "AuthorID": "Patsy plum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/patsy-plum",
      "Content": "A little over a week on from my mastectomy an axillary node clearance, and things are still good. Went to my GP this morning regarding swelling under arm and bingo wing! It has felt huge, and wondered what a normal amount of swelling was and when it tipped over to being a problem. Pleased to say it is normal, looked in the mirror which is better than my one at home and could see it actually isn't too much. He changed my dressing, and although the butterfly sticky things are in place, he announced with great joy it was one of the neatest surgical scars he had seen, hooray! No pain to the surgical site where my breast was and the chest area, and just for good measure I got the full once over of my remaining breast, great joy, haha. Underarm and bingo wing is the most sensitive and there have been a couple of occasions I have woken with a jolt and a yelp during the night, which has meant a very disturbed nights sleep. Other than that, all seems well and I have my follow up appt with my lovely surgeon on the 1st October. Hope everyone is having a good day, sending you all my very best wishes, Pat xx",
      "MessageIndex": 0,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98793/mastectomy-a-week-on",
      "Title": "Mastectomy, a week on"
    }
  ]
}