{
  "AuthorID": "PaulGD76",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/paulgd76",
  "Posts": [{
    "AuthorID": "PaulGD76",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/paulgd76",
    "Content": "Hi Abbey, My partner had his hickman line inserted over 2 years ago and he swears it's the best thing ever.  His veins are very thin, or non-existant, so the line is a godsend, they don't have to keep stabbing him to take blood. Before having it inserted he was like you, he was dreading it.  He had the chance to speak with the nurse that was going to do the proecedure and she totally put his mind at rest.  For Ian the worst part would have been having the initial injection as he has a needle phobia, he mentioned this to the nurse and she said not to worry.  They can use a cryo-spray on the area first which will totally freeze the skin so he wouldn't be able to feel the anaethetic injection.  Once the aneasthetic had taken he said he couldn't feel a thing and it was all over nearly as soon as it started.  It might be worth asking if they can use a cryo-spray on you, then you won't feel a thing. He came out of the proecedures room smiling and said how easy it was. The beauty of the line is that if any blood tests are needed it comes straight out of the line, and the chemo goes straight in.  On Monday he had a blood transfusion through the line and that was also dead easy. So I would say all in all don't worry.  I know that's easy for me to say though, but it really isn't that major a proecudure.  You'll get through it and sit back wondering what you were worrying about, I guarantee you. Please try not to stress, that doesn't do you any good at all. Let us know how it goes. Take care, Paul  ",
    "MessageIndex": 5,
    "PostDate": "12/09/2012",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53212/worried-about-having-a-hickman-line-reassurance-needed-please",
    "Title": "Worried about having a hickman line...reassurance needed please!"
  }]
}