{
  "AuthorID": "Pennymoon",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennymoon-",
  "Posts": [
    {
      "AuthorID": "Pennymoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennymoon-",
      "Content": "hi all,  Does anyone have any tips on things to eat that might not aggravate a throat utterly raw and shredded? I'm swigging the Difflam (shudder), sipping Cherries & Berries squash and overdosing on Clarnico Mint Creams. Everything seems to dry my mouth out and contribute to the raw sandpaper feeling. Worst mistake last night was a Bacon, Marmite, Philly and Cucumber sandwich (my favourite), but the pain was excruciatin! Tried custard and apple pie filling for breakfast...custard sort of coated my throat but made me feel nauseous.  Costa Strawberry Cooler is ok, but a bit sickly as all I can taste is the sugar!",
      "MessageIndex": 0,
      "PostDate": "22/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125449/oh-my-mouth",
      "Title": "Oh my mouth..."
    },
    {
      "AuthorID": "Pennymoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennymoon-",
      "Content": "Hi Cehfin, Does your Macmillan Centre run a session on Demystifying Chemotherapy?  If it does, why not book a place and see what it's all about. Having had Breast Cancer 12 years ago, and already having experienced chemo, I thought twice abut whether to go along after my current diagnosis. I am so glad that I did; it answers all your questions, as well as giving a realistic view of what it's actually like-and oh my, haven't things come along since 2004! It's run by oncology nurses who can answer specifics for you, in a relaxed atmosphere with tea and biscuits :) If your local centre does not run this-perhaps find out where they do-I'm at the Queen Alexandra Hospital in Portsmouth. Good Luck! Michelle",
      "MessageIndex": 1,
      "PostDate": "01/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124218/should-i-or-should-i-not-have-chemotherapy",
      "Title": "Should I or Should I not have Chemotherapy?"
    },
    {
      "AuthorID": "Pennymoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennymoon-",
      "Content": "I think the message has to be constant vigilance; I made it 12 years before another lump manifested. However, at least I found it.",
      "MessageIndex": 10,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123609/increaseed-risk-of-cancer-in-other-breast--why",
      "Title": "Increaseed risk of cancer in other breast -why?"
    },
    {
      "AuthorID": "Pennymoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennymoon-",
      "Content": "Following on from the way that partner's react to the news of Breast Cancer...hopefully this might raise a smile :) After my diagnosis first time around, I was really worried about how he might feel about my forthcoming mastectomy/reconstruction. He's always been wonderful, and has always been there for me, but it made me feel very insecure, so I asked him...  His response was that 'I married you, not your tits' which, once we stopped laughing, and then crying, sorted everything out. Fast forward 12 years, and here we go again on the other side. He's working abroad a lot of the time now, and before he left for the USA, he made me really laugh by gently stroking my breast like a pet whilst muttering, 'Just in case you're not here when I get back, goodbye old friend...' Daft sod! He's due back in 2 weeks and I don't even start Chemo for 3, let alone the 'big' surgery!",
      "MessageIndex": 14,
      "PostDate": "22/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121842/primary-cancer-and-secondary-cancer",
      "Title": "Primary cancer and secondary cancer"
    },
    {
      "AuthorID": "Pennymoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennymoon-",
      "Content": "I completely understand about not wanting to talk about Cancer all the time, or worry about being seen to 'go on' about Cancer all the time. It works both ways too; having been overwhelmed with information by my Oncologist last week (so much more than last time, which is good), I then found it tiring having to explain it all over and over again. You don't want to leave anyone feeling left out, especially when friends and family are conspicuously rallying round, calling much more often than usual. I ended up on the phone for hours for 3 nights straight! It seems ungrateful when they're being so caring... ",
      "MessageIndex": 21,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121842/primary-cancer-and-secondary-cancer",
      "Title": "Primary cancer and secondary cancer"
    },
    {
      "AuthorID": "Pennymoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennymoon-",
      "Content": "Oh-and one of my favourite moments from last time amongst so many bizarrely funny moments occurred just before I went off to theatre for nipple reconstruction. My gorgeous plastic surgeon and his sidekick were debating where my new nipple should go,both knelt on the floor in front of me, whilst I stood there topless like some sort of Page 3 girl, It wasn't helping that I couldn't  stop giggling at the absurdity of it! In the end they handed me a round ECG sticker and told me to go off to the bathroom where there was a mirror and stick it on where I wanted it!",
      "MessageIndex": 22,
      "PostDate": "23/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121842/primary-cancer-and-secondary-cancer",
      "Title": "Primary cancer and secondary cancer"
    },
    {
      "AuthorID": "Pennymoon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennymoon-",
      "Content": "Has anyone else suffered these sorts of side efffects with Herceptin? Severe bone pain in the legs (especially whilst seated or in bed) Extreme fatigue Nausea Galloping anxiety and panic attacks Initially, I didn’t connect these with the Herceptin. It was only after I restarted injections after a break for suspected heart failure, that I realised what was happenin. Mind you, I did have a full body bone scan to rule out anything nasty that I really twigged. The worst though is definitely the anxiety; I’m not usually someone who suffers with this, and certainly not when everything is generally ok! I’m working full time, in a really target driven stressful job, and really struggling to calm my mind. I know it’s the drugs, and logically I understand that it’s just a short term thing-only 3 more doses, but on some days I just feel like throwing it all up in the air and hiding under the covers. my employers have been brilliant over the last year and a bit, my friends and family have been amazing and I feel as though I’m letting everyone down. I’ve always been the one folks turn to when they need help, and I’m not one who has ever asked for help for me. Does anyone have any tips for coping?",
      "MessageIndex": 0,
      "PostDate": "06/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149217/herceptin-side-effects",
      "Title": "Herceptin Side Effects"
    }
  ]
}