{
  "AuthorID": "pennyred",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
  "Posts": [
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Sorry to hear you are feeling rough at the moment, but it will pass! I've just had my second FEC and feel much better than I did the first time ( when I honestly thought I could never go through it again!). I took my meds in the morning, but although they were anti-sickness, they were not the ones you mention, and my instructions were clearly on the boxes, so I'm afraid I can't help you with that. This time the nausea has been dreadful - until my son came home with fresh root ginger and a lemon last night. He peeled about 1\" of the ginger, grated it into the bottom of a pan, added a mugful of cold water, and brought it to the boil, leaving it to stand for 2 or 3 minutes, before straining the liquid into a mug with a hefty squeeze of  lemon.It has made such a difference. I hope your ok feeling lasts, too! Be kind to yourself.x",
      "MessageIndex": 1,
      "PostDate": "26/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83358/1st-fec",
      "Title": "1st Fec"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Hello Bev, During my 2nd cycle of FEC I had an infection under a wisdom tooth. The dentist felt that the infection was deep seated and the tooth should be removed. With the agreement of the Chemo unit, I had a week of strong antibiotics before the tooth was extracted, and 2 courses of antibiotics afterwards. Although I was terrified to be having it done during chemo, the only real consequence was that the gum took much longer to heal than it would normally have done. Good luck, I hope you get good dental / medical advice quickly, and that you are soon out of pain.",
      "MessageIndex": 4,
      "PostDate": "15/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89967/bad-tooth",
      "Title": "bad tooth"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Thank you in advance for tomorrow's toast ! Congratulations on your great achievement - losing weight isn't easy and with everything else you've had to contend with, you've done amazingly. Enjoy the dressing up and the party........ lets all remember that life is for having fun. X",
      "MessageIndex": 1,
      "PostDate": "30/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85111/raising-a-glass-to-everyone-going-through-treatment",
      "Title": "Raising a glass to everyone going through treatment"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Now I'm really confused ! I have had the flu jab in previous years, and have already had 2 FEC treatments. When I had an appointment with my Oncologist on Thursday, and asked him how to time this years flu jab  in relation to the treatment cycle( because my GP is only starting offering them from next week) he said he would prefer me NOT to have one at all until treatment is complete - and that will be just before Christmas !! I'm uneasy about not being protected, but also uneasy about not taking his advice. his reasons were because \" if you became ill, it would confuse the issue\".  Any sane, informed advice would be very welcome please !!!! So far I'm relying on vitamin C and Manuka honey. Good luck with the winter germs every-one . X",
      "MessageIndex": 8,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83381/disappointed",
      "Title": "Disappointed :("
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Thanks for your input G n' J.  It's the fact that it was the advice of the oncologist, not the GP that  concerned me, and as I said, the reason he gave was that if I had the jab, and subsequently became ill, it would \" confuse the issue\". I will speak to the people in the chemo unit this week and see what they say. I've followed your link, thank you and found it useful. ",
      "MessageIndex": 10,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83381/disappointed",
      "Title": "Disappointed :("
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Hi everyone. I was given antibiotics for an infection in a vein on Tuesday, and yesterday the extra present turned out to be oral thrush. I've got Fluconazole to take for five days ( 2 tablets used already), I use manuka honey, am being meticulous about mouth hygiene, but my tongue remains swollen, white and extremely painful. Just wondering if I might have overlooked anything that could speed up recovery ?  Any ideas would be appreciated, thank you. X",
      "MessageIndex": 0,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84848/any-extra-tips-re-oral-thrush-please",
      "Title": "Any extra tips re oral thrush, please."
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Thanks, Mandy. I don't think there's a room in my house without some kind of anti-bac protection!! I was greatly reassured to find that there's at least one other professional advocating flu jabs after treatment..... you made my day. Here's hoping the polishing works for us both !! XX",
      "MessageIndex": 13,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83381/disappointed",
      "Title": "Disappointed :("
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Thank you both for taking the time to reply, and for your advice. I'll try to get the things you've suggested. Meanwhile, it's very quiet here....... too painful to talk much, and my husband is getting away with eating his way through fridge and cupboards cos I can't waste my energy on objecting ! XX",
      "MessageIndex": 3,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84848/any-extra-tips-re-oral-thrush-please",
      "Title": "Any extra tips re oral thrush, please."
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Thanks so much Jenny and Jan, it's such a help to hear of other people's experiences, and to have the advice from you both. The\" relaxing\" bit is certainly not coming easily this morning, but I will take a hot water bottle in the car to keep my arm warm ( I'm not driving!) Yesterday I went through the arm warmer and 2 buckets of hot water scenario to no avail, but will try everything I can. Don't quite know whether it's nerves or fluid overload that is making me feel sick, but you have both helped me a lot. Best wishes and cyber hugs X",
      "MessageIndex": 3,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86383/help-my-veins-are-giving-up",
      "Title": "Help ..... my veins are giving up !"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Good morning every-one, I could really do with some advice today. Yesterday I went for my 5th FEC treatment ( without the 'F' bit which they withdrew last time because of the severity of the s/e.) I've staggered from one session to another with infections and antibiotics, and yesterday they were unable to access an accepting vein, and had to give up after 3 attempts. I have to go back at 12.30 today after drinking pints and pints of water, in the hope that extra hydration will help. I've had chemo twice before for long periods, and guess that my arm has just had enough. Obviously they don't want to use the other one, next to the WLE , having had some lymph nodes removed. What do I do now??? I really wanted to see this treatment through to the end, even with a reduced dose, but the thought of maybe having to have a line inserted at this point is scary. has any-one else been in the same position, please ?",
      "MessageIndex": 0,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86383/help-my-veins-are-giving-up",
      "Title": "Help ..... my veins are giving up !"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Hi Sarah, I'll keep my fingers crossed for you that the PICC line means you don't ever have to go through what we've both endured in the last 24 hrs. Amazingly, 24hrs of drinking litre after litre of water, keeping a hotwater bottle on my arm on the way to hospital, being immersed in consecutive buckets of water that you would never normally dream of plunging your hand into, let alone your whole arm, has resulted in ONE vein rising to the occasion this afternoon ( thank heavens that one is all you need) and I've had my 5th FEC. Thanks to you all who responded to my post, and allowed me to set off with a bit more courage than I was feeling this morning! X",
      "MessageIndex": 5,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86383/help-my-veins-are-giving-up",
      "Title": "Help ..... my veins are giving up !"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Bon soir, Littlesusie !  I hope you are having a fantastic time ( you've certainly earned it!!) and that you'll come home refreshed  and bursting with positive thoughts. What an inspiration for the rest of us , may we all have lots of \"normal\" days. Enjoy Montmartre, there's nowhere quite like it. Hope next week goes well for you too. X",
      "MessageIndex": 1,
      "PostDate": "11/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84190/i-m-so-very-lucky",
      "Title": "I'm so very lucky"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Hi, Dorothee, George and Jackie, Many thanks for the moral support, good advice and information from you all. I'll click on the links to find out more, and speak to the oncology team.... and who knows, Dorothee, I might even get to the plate throwing yet! Meanwhile, the crying was taken care of by missing my daughter's birthday, but the boot camp image is one I will keep in my head to retain both my sense of humour and my perspective on all of this. Thanks to you all for taking the time to reply. X",
      "MessageIndex": 3,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83157/sore-mouth-sore-scalp-sorely-in-need-of-advice-please",
      "Title": "Sore mouth,sore scalp, sorely in need of advice, please!"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Thanks, Mandy, have sent you a message! X",
      "MessageIndex": 5,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83157/sore-mouth-sore-scalp-sorely-in-need-of-advice-please",
      "Title": "Sore mouth,sore scalp, sorely in need of advice, please!"
    },
    {
      "AuthorID": "pennyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pennyred",
      "Content": "Hello every-one. For a normally upbeat person, I'm feeling very low. I've only had 1 FEC treatment, and I think the days after were fairly standard - severe head-ache, nausea, almost total sleeplessness and feeling as if every ounce of oomph had been syphoned out of me. Since then it has largely been onwards and upwards. I've tried to do all the right things, drinking lots of water ( guess what, still sleep starved, cos lots of water= getting up in the night to go to the loo/ mind starting working/ no more sleep, so the average is 4 hrs!) regular use of salt water mouthwash, careful hand-washing, using hand gel when I'm out, keeping my skin hydrated etc. Week 3 was feeling good, until Friday.... sudden dreadful head-ache, aching all over, everything hurting above the shoulders.Rang the out-of-hours chemo support person from the hospital just before 10pm cos by then I was feeling really ill and looked as if I had been painted with vivid clown's cheeks. However, my temp was only 37.2 ( which is high for me) so I was told that as it was within the normal range, I was not to take antibiotics, but that it was probably a virus or the beginning of a cold. The week-end was much the same, plus an increasingly sore scalp, considerable hair loss and 2 huge white ulcers under the side of my tongue. Yesterday was my lovely daughter's 40th birthday. She lives over 200 miles away, and I was meant to be there, but felt so unwell....so lots of tears too ! This morning, nothing hurts except scalp and mouth, I just feel very week and there is some peeling on the palm of one hand...not to mention enough hair in bed to build several nests. Tomorrow should be blood test, Wednesday should be FEC (2nd) and I don't know what will happen. I've had 2 long courses of chemo before for a different cancer, and don't know whether that affects what is happening to me so soon this time.   So sorry to moan",
      "MessageIndex": 0,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83157/sore-mouth-sore-scalp-sorely-in-need-of-advice-please",
      "Title": "Sore mouth,sore scalp, sorely in need of advice, please!"
    }
  ]
}