{
  "AuthorID": "Pentewan",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pentewan",
  "Posts": [
    {
      "AuthorID": "Pentewan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pentewan",
      "Content": "Hi Lynne, I had the same as you done, two weeks ago. Under the arm still feels sore and if you can, please try and do your exercises. My breast is also still very tender. I think this is all quite normal. I have to go back tomorrow for a second operation as not enough margins were removed. I would be only too happy to give you more information if you want, just let me know. Good luck and take care. Val xx",
      "MessageIndex": 1,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45161/what-to-expect-after-surgery",
      "Title": "what to expect after surgery"
    },
    {
      "AuthorID": "Pentewan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pentewan",
      "Content": "Hi Lynne, I had my lumpectomy on Monday and had an ultra sound. I think this is quite normal and mine was so the surgeon knew where to operate. Green marker pen was used. Also had radioactive injection so lymph nodes could be marked on as well. All done so there is no mistake as to what they are doing. I am sure all will go well for you and if you need anymore info please just ask. Hope all goes well for you, take care, Val xxx",
      "MessageIndex": 4,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/44960/lumpectomy",
      "Title": "Lumpectomy"
    },
    {
      "AuthorID": "Pentewan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pentewan",
      "Content": "Hi Helen, I had my first SNB and lumpectomy on 28th November got results the following week and told I needed second operation as they hadn't got clear margins. Had second operation on 12th December got results now and told they have got it all now. See oncologist on 12th January for next stage of treatment. I guess some hospitals do the SNB and lumpectomy separate but I had mine done at the same time so had two cuts, one under the arm and one on the breast. Are you due to have lumpectomy ? Hope that helps, let me know how you get on If there is anything else I can help you with, take care. Val",
      "MessageIndex": 3,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45532/sentinel-node-biopsy-without-injection-day-before",
      "Title": "Sentinel Node Biopsy without injection day before?"
    },
    {
      "AuthorID": "Pentewan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pentewan",
      "Content": "Hi, don't know if this info will help but I had SNB on same day as my lumpectomy. I had a scan then went for radioactive injection, not very nice but soon over. You then have a short wait while it gets into your system. The next step is a large machine that shows the staff where your lymph nodes are. They then mark with a pen the first three in my case. Once I went for operation and was put to sleep, they inject a blue dye into the breast that shows the surgeon where to operate and remove them. Hope that helps but if you need any more info please feel free to contact me any time. All the best. Val",
      "MessageIndex": 1,
      "PostDate": "25/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45532/sentinel-node-biopsy-without-injection-day-before",
      "Title": "Sentinel Node Biopsy without injection day before?"
    },
    {
      "AuthorID": "Pentewan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pentewan",
      "Content": "Hi Helen,  So sorry to hear you will need mx, I can never work out why some people have to have one and others don't. My lump was found on a routine mammogram and I was told it was 4mm which is very small.  After my first operation, I was told it was twice the size they first thought but still only 8mm. I was told it isn't always to do with the size of the lump. It is all down to the spread of cancer cells. Some big lumps haven't spread and some small ones have. They have removed quite a lot of breast tissue and as the swelling has gone down I can see the hollow and it looks very odd. My lymph nodes were clear thank god, so don't need anymore removed. I do hope all yours are clear when you get your results.  Don't know about you, but I have found it very uncomfortable with the lymph nodes and it still hasn't completly healed five weeks down the line. Oh well, next step for me I think is four weeks radiotherapy. Hope all goes well for you next week Best wishes   Val x",
      "MessageIndex": 5,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45532/sentinel-node-biopsy-without-injection-day-before",
      "Title": "Sentinel Node Biopsy without injection day before?"
    },
    {
      "AuthorID": "Pentewan",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pentewan",
      "Content": "Hi, sorry you find yourself here. I too had lumpectomy and three lymph nodes removed. I wore a very loose vest top that I could take down over my hips and a loose cotton shirt. Some people find it ok to wear a sports bra or similar, but as I am quite small, found it more comfy for me to go without one at all. Hope that helps, any other info please feel free to ask. Hope all goes well for you Love Val x",
      "MessageIndex": 2,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46202/hello",
      "Title": "Hello"
    }
  ]
}