{
  "AuthorID": "persephone47",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/persephone47",
  "Posts": [
    {
      "AuthorID": "persephone47",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/persephone47",
      "Content": "I am dozy knew i would leave something out lol, i am on letrozole, i have found that ok, trying to lose weight with a view to lowering the risk further, which is proving challenging but it is coming off, the Letrozole i feel is not helping with the weight, but i am determined to get the best possible chance. I feel quite lucky, i do have the odd wobble, but who doesn't. I will say with the letrozole, the chemist changed my brand and i had a bad reaction to it so my doctor now specifies the brand i want which is accord, it would appear different brands affect different people so you may need to try different ones to see which suits you, i have read this for tamoxifen too although have no experience to offer. I take mine with breakfast as i found i sleep better, rather than take it at night, again whatever suits. I will keep my fingers crossed for you, i hope you get a low score, but if not you will get through it, anything you want to ask, ask away i dont mind. You take care Linda xx",
      "MessageIndex": 5,
      "PostDate": "11/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152286/er-positive-clear-nodes-grade-3-and-waiting-on-oncotype-results-to-chemo-or-not-to-chemo",
      "Title": "ER positive clear nodes grade 3 and waiting on oncotype results....."
    },
    {
      "AuthorID": "persephone47",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/persephone47",
      "Content": "Hi, i had grade 3 IDC upgraded from 2 after wle, er+ pr+ 8/8 for both, her- 3cm.  My onco score was 6, blew me away. I had 15 radio therapy sessions, i found it ok, worst bit was travelling. I had decided whatever the score i would have everything on offer lol. As it turned out no chemo so i feel quite lucky. Hope that helps. Linda xx",
      "MessageIndex": 3,
      "PostDate": "10/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152286/er-positive-clear-nodes-grade-3-and-waiting-on-oncotype-results-to-chemo-or-not-to-chemo",
      "Title": "ER positive clear nodes grade 3 and waiting on oncotype results....."
    }
  ]
}