{
  "AuthorID": "Pfom",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
  "Posts": [
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi All, I am having my 1st session of EC chemo next week ( first of 4 plus 4 of T). I need to decide if I should use the cold cap or not.  I suffer from migraines, triggered by stress ( actually they strike when I start relaxing)  and by my periods ( so at least once a month I have a crisis that will last 1 to 3 days). Usually I take a pill (my lucky pill) that reduces the pain to bearable levels and allows me to have a \"normal\" life. This medication still hasn´t been approved by my oncologist as it is not a migraine medicine. Most of the migraine medication doesn´t work out with me and the pain without medication it is unbearable. If I didn´t suffer from migraines I would give at least a try to the cold cap but just the thought of the cold cap triggering one of my migraines crisis and have to deal with them together with the chemo side effects it is scaring me. Can anyone who suffers from migraines tell how the cold cap affected their migraines? And the chemo itself does trigger migraines as well? Any personal experience shared will be much appreciated. Thanks. Paula ",
      "MessageIndex": 0,
      "PostDate": "20/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115218/migraine-ladies",
      "Title": "Migraine ladies"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi JudyR58, Thank you for your email. The possibility of not having migraines while on treatment is very comforting. Hope it will happen the same to me.  I used very short hair ( almost men style) for 15 years and I actually enjoyed it. The hair doesn't define me as a person ( actually I am more worried in loosing eyebrows and eyelashes) but the image of me bald it has been quite hard to imagine and accept. I am also very practical and the extra time and extra care that you have to put into it doesn't attract me either.Put extra pain on top.... Tomorrow I am going to try some wigs and head accessories and if I feel comfortable with it I decided not to use the cold cap. At the moment I am in the middle of a light migraine crisis of 3 days and If I had to put sickness on top of it I wouldn't be able to handle it. Nothing like reality to force you to make a decision lol Thank you for sharing your thoughts. Paula",
      "MessageIndex": 9,
      "PostDate": "22/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115218/migraine-ladies",
      "Title": "Migraine ladies"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Dreamthief, I think \" the cold capping is so much hassle I don´t think I can be arsed camp\" is winning lol Let´s see how wigs shopping will go. Thank you for replying to my posting. This website and the sharing of experiences by everyone, that what has been keeping me calm through all this crazy process. Paula",
      "MessageIndex": 10,
      "PostDate": "22/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115218/migraine-ladies",
      "Title": "Migraine ladies"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Nix Moonminsmum, The love of a mum is quite strong and motivation and strength to do the impossible. I think you were very courageous in the entire process. My reason it will be only vanity as I don´t really value my hair as much as other people. Having no eyebrows or eyelashes it will hit me harder I think.Or gaining weight :( :(( Really happy at the end you din´t regret it. Congratulations for your anniversary ! Don´t forget to open a bottle of champagne and celebrate :) :)  - any reason is a good reason to celebrate lol Paula",
      "MessageIndex": 11,
      "PostDate": "22/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115218/migraine-ladies",
      "Title": "Migraine ladies"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Mazza10, I renewed my passport with my wig on. No one suspected at all that i was wearing a wig. My problem with the photo was that I didn´t had any eye brows or eyelashes and when I took the picture the make up was all gone ( for all the waiting and my watery eyes). I look awful in the picture with a very suspicious look. I am actual contemplating the idea of \"loosing\" my passport and apply to a new one. Good luck. Paula",
      "MessageIndex": 9,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135482/passport-photo",
      "Title": "Passport Photo"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "When I was diagnosed last August I started researching as much as I could about cancer. I got to the conclusion that having or not cancer it comes down to our immune system to be prepared to kill the cancer cells when they “show” up. If in one of these moments our immune system is not in conditions to protect us that is when we are in trouble.  I also had a proper lifestyle before I was diagnosed but unfortunately I coudn’t keep that lifestyle through the entire year. There were several periods (sometimes up to 3 months) of stress and lots of overtime at work when my diet was crap and I didn´t have the time to go to the gym- perfect conditions for cancer to develop . We just need the bad luck of the faulty cells to come up in one of these periods... I know it is a very simplistic explanation but it works for me ;) I am triple negative, grade 3, which means that after the chemo, the surgery and the radio, conventional medicine can´t do anything else for me. I am on my own until recurrence… But I have a powerful ally: my immune system. And I decided to help this friend of mine, which so many times I neglected, as much as I can and not leave it to luck: 1. Stress leaves immune system vulnerable. So I will have a balance between work and private life and will find techniques to stop worrying too much. Things eventually will be sorted out, even if you don´t worry about it. Please be aware “don’t worry” doesn’t mean not taken action. 2. I am trying yoga, meditation, acupuncture, massage shiatsu, Qigong . They help with stress. There are several charities that will offer you some classes for free or at affordable prices. I will select 2 for after treatment and will attend them religiously. 3. Going to the gym 4 days a week religiously 4. Beauty products (make up, creams ...): I am sourcing ones that are made of natural and organic ingredients. Your skin is the largest organ you have and when you start investigating the things you put on it is appalling. 5. Diet: my main changes were: - I try to buy organic as much as I can afford. For me is important to not overwhelm my immune system with the chemicals that non organic food might have. At the moment I am having chemo so order using Ocado as they deliver at home and they have very vast organic offer. - Lots of vegs and fruit – I was doing this already but I am trying new recipes where I can include garlic, quinoa, spinach , fennel, kale, avocado, broccoli, etc - I eat whenever possible whole foods: processed foods not only loose most of the nutrients you need to reinforce your immune system but some will also have added preservatives or other chemicals - Alcohol: stop drinking on my early 30's - Red meat: very rarely used to eat it so stop having it for good - No refined sugar: I replaced by xylitol. Outside home use brown sugar. - Dairies: the ones that come from cows might have hormones, antibiotics and other chemicals. I miss cheese so sometimes buy organic cheese or feta cheese just to end with the cravings. - A recent study came for triple negative only: they found out a direct relation between cystine  levels and TNBC: today.duke.edu/.../breast-cancer-cells-starve-cystine Controlling cystine levels might reduce cancer cells or even eliminate them. I am only doing this while I think I have cancer cells inside me. Yes, reducing food that produces cysteine might not affect cancer but if I replace the list of items by vegetables or fruit , with same nutrients while I am still in treatment, will this harm me? These are MY conclusions and my decisions but the fact that I am doing something that can help me to win cancer is very important to me. My diet before cancer wasn´t very different from the one now (the hardest one is to cut with the cheese and reduce bread) so the \"sacrifice\" I have to do is a lot less than to other people.  In case of recurrence (hope not ) I prefer to be in a position where I can say “ I did all I could” than wondering “if I had all of this I could have avoid the recurrence?!”  But probably is a trauma of being triple negative… In your case, act accordingly with your conscience and belifs, with no regrets, while still enjoying life in full J     ",
      "MessageIndex": 13,
      "PostDate": "29/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120367/changes-to-diet",
      "Title": "Changes to diet"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Julia, In both cases we did have the BRAC results on time (just before finishing EC) . Because we are TNBC we were immediately referred to do the genetic test and the results came in about 6 weeks (not urgent). Mine were negative and I am having Docetaxel and the other woman, unfortunately,  came posiive and she is having Taxol weekly (when initially she was expecting to have docetaxel as well). And this was initially explained to me by the oncologist.  Paula",
      "MessageIndex": 9,
      "PostDate": "29/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122237/neoadjuvant-chemo",
      "Title": "Neoadjuvant chemo"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Jo, What I was told was that if the genetic test results came negative I would have Docetaxel and if they came positive would have Taxol. The same happened to another woman. We both are TNBC. Paula",
      "MessageIndex": 7,
      "PostDate": "29/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122237/neoadjuvant-chemo",
      "Title": "Neoadjuvant chemo"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Julia to be honest until now I thought it was standard procedure in the UK. It seems not . I am being treated at Guy's hospital in London. My appointment was less than 2 months from diagnosis.",
      "MessageIndex": 14,
      "PostDate": "29/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122237/neoadjuvant-chemo",
      "Title": "Neoadjuvant chemo"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Turbo, I had 4 EC+T every 3 weeks. My oncologist authorised to extend the period between my last EC and T by a week, which means that between the day I had my last EC and the day I had my first T passed 28 days. The doctors didn´t raise any issue with that but there were several health safety issues that I had to address as I suffered from very low white blood cells count: - I requested a declaration to the oncologist authorising me to fly. Ensure with them that you won't have any extra appointments or exams to do over the period you are abroad. - I had to carry with me filgrastim injections so I needed a declaration from the oncologist so I could carry them with me in the plain. I also contacted the flight company so I could put them in their fridge - I decided to fly in the days which my immune system was stronger: the day after chemo or from the 15-16th day after chemo. You need to check your own cycle and side effects pattern - you don´t wanna spend the entire flight vomiting... - I bought some masks to use at the airport and inside the plane. After investigating I bought these online as I wasn't happy with the ones sold at the pharmacies : Mask Pro3 (Pack10) FFP3 Masks CE Certified FFP3 Respirator Face Masks Valved Highest Graded - In Portugal I was staying at my mums place so I could control cleanliness and the environment surrounding me, inclusive the people who would be close to me ( it was winter and colds are very common in the north of portugal) - I searched for travel insurance but or they were to expensive or they wouldn´t cover private treatment. As I was staying with family and had my European Health insurance card ( I requested a new one online which came in less than a week) I decided not to subscribe the insurance but you need to look into your personal situation as you are going to stay in a hotel and most probably is worth to have one - but have the the European Health Insurance card as well. You need to look into your particular situation and make your own decisions. At the end I spent a lovely Christmas with my family with no health issues . I hope you can enjoy your holidays as much as I did mine. Paula",
      "MessageIndex": 5,
      "PostDate": "21/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129197/break-between-ec-taxol",
      "Title": "Break between EC &taxol ?"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi 4paws, About financial support, I was advised to call first Dilberby Cancer Care 02071885918 ( they actually have an office at Guy´s Hospital).  Unfortunately they have a big backlog so they forward me to Macmillan 08088080000. They were amazing. After the moment they create a registration with your name you can always come back to them for help. They also offer a small grant for people in need. Ask them for it to see if you are eligible. Prepare yourself. I never applied to benefits in my life and my process has been very hard on me. All the benefits process is very humiliating, they make you feel like you are begging. For a couple of times I just felt like telling them to stick all the bureaucracy and paperwork where the sun doesn´t shine. I applied in August and with all the errors that they have been made with my process I am still waiting for approval!!!   About infections please be careful. I was lucky. Although I was put in isolation for a week in an hospital room because my blood cells were very close to zero ( actually they hit zero 1 day!), receiving strong antibiotics through a canula, I didn´t have any infection. The detection was simple luck! I frequently go out for a 30 minutes walk and sometimes get home very very tired. I then measure my fever that can range from 37.5 to 38 - which is not normal. But I knew, at that time, that it was an abnormal reaction just to the walk. It would be impossible to catch an infection just for walking on my own!!! After a couple hours of resting, eating and drinking the fever would go down to normal. One day I decided to do some exercise at home and twisted my ankle. Went to the hospital to show it to the nurse and request advice for the treatment. In conversation I told her about my unusual spike fevers and she decided to do some blood counts on me. And that was how I found out about my big exposure to infections and how lucky I had been when I twisted my ankle lol. So please check constantly your fever and if something like this happens talk to your nurse. One week in the hospital as preventive measure is nothing compared with staying with infections with high fever for longer periods.  A very good advice that was given to me when I started my chemo: drink lots of water. I always try to drink between 2 to 3 litres a day and I think is helping a lot my side effects.  This process is a life changing process. Not having all the pieces of the puzzle is the worst thing we have to handle and learn how to manage so take one step at the time. Don´t stress: at the end the solution will come at the end of the tunnel :) Good luck with your treatment and any other information you need please feel free to ask. Paula",
      "MessageIndex": 26,
      "PostDate": "15/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118000/just-diagnosed---any-advice-please",
      "Title": "Just diagnosed - any advice please?"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Totally agree",
      "MessageIndex": 403,
      "PostDate": "10/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "For me EC it was a lot easier. I started to grow hair after 3rd session which fell when I started docetaxel. Light side effects with EC, several and intense side effects with Docitaxel . As you can see each one is different. Just \"hope for the best, and expect the worst\" and you won´t be caught by surprise, but don´t be petrified. In a very strange way we adjust to the situation and  all the side effects become bearable and at the end we all survive to them. And this is the most important thing  ",
      "MessageIndex": 9,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137244/truth-about-doxetaxel",
      "Title": "Truth about doxetaxel"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi, Prior to find my lump I found myself very tired for 3 or 4 months. More than tired I felt without energy, lack of interest in anything,  like a zombie which main hobbie was watching TV ( I am usually a very very active person, cant stay still). This was one of my reasons to visit the GP. My blood tests came Ok. But at this time I found a lump on my breast which I thought it was a benign fat lump ( I have a couple of them over my body). No such luck this time. Good luck. Paula",
      "MessageIndex": 8,
      "PostDate": "12/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123115/tiredness-and-aches",
      "Title": "Tiredness and aches....."
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Jbelle,  This happened 7 years ago. I was 33. Something changed in my life and my future as I saw it would change. I like to be in control always and on that situation I lost control. I still dont fully understand why it happened but what I felt at the time was a struggle between my rational side ( that all will be  alright with time) and my unconscient side that raised panick attacks and didnt let me eat. Everything that I would eat I would vomit. I lived 1 month on orange juice and 2 months on soup. Not really good times, the worst period of my life. I had counceling for 2 years, CBT for 3 , propanolol I am stil taking it but just because it is treatment for migraines as well. Over the cancer treatment i stop having it, because I stop having migraines, and didnt trigger any anxiety. Actually for me managing chemo side effects compared with my period of panick atracks was easier. So I cant imagine how hard must be for you have to manage the 2 simultaneously. The good news is that both illnesses can be treated. I am now cancer free and working and I havent had any pick of anxiety for the last 4 years ( even during the treatment). If you are in a low budget for councelling there are certain associations that offer that service and you only pay what you can afford- 2 years of councelling can be very expensive. Mine was in Waterloo. Let me know if I can help with anything else and be hopeful: there is light at the end of the tunnel with a new life for you to live ☺ xxxx",
      "MessageIndex": 20,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134324/constant-anxiety",
      "Title": "Constant Anxiety"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Jbelle,  This happened 7 years ago. I was 33. Something changed in my life and my future as I saw it would change. I like to be in control always and on that situation I lost control. I still dont fully understand why it happened but what I felt at the time was a struggle between my rational side ( that all will be  alright with time) and my unconscient side that raised panick attacks and didnt let me eat. Everything that I would eat I would vomit. I lived 1 month on orange juice and 2 months on soup. Not really good times, the worst period of my life. I had counceling for 2 years, CBT for 3 , propanolol I am stil taking it but just because it is treatment for migraines as well. Over the cancer treatment i stop having it, because I stop having migraines, and didnt trigger any anxiety. Actually for me managing chemo side effects compared with my period of panick atracks was easier. So I cant imagine how hard must be for you have to manage the 2 simultaneously. The good news is that both illnesses can be treated. I am now cancer free and working and I havent had any pick of anxiety for the last 4 years ( even during the treatment). If you are in a low budget for councelling there are certain associations that offer that service and you only pay what you can afford- 2 years of councelling can be very expensive. Mine was in Waterloo. Let me know if I can help with anything else and be hopeful: there is light at the end of the tunnel with a new life for you to live ☺ xxxx",
      "MessageIndex": 35,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134324/constant-anxiety",
      "Title": "Constant Anxiety"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi Jbelle, Many years ago I had severe anxiety levels that generated serious panick attacks. CBT helped  a lot and also started taking propanolol which helped to control the anxiety. Hope you get better. Paula",
      "MessageIndex": 14,
      "PostDate": "25/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134324/constant-anxiety",
      "Title": "Constant Anxiety"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Merry Christmas and in the immortal words of Tiny Tim \"God bless us, every one!\" :) ",
      "MessageIndex": 10,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120183/xmas",
      "Title": "Xmas"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi, With me at certain point nothing worked and eating was a punishment so I had long periods without eating. The solution I found was to make a vegetables soup  ( tomatoes, mushrooms, onion, garlic, potatoes, celery, etc) , blend all and add kayle. This avoided me to loose to much weight and be fit for the next chemo.  Paula",
      "MessageIndex": 8,
      "PostDate": "10/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131421/everything-tastes-awful",
      "Title": "Everything tastes awful!"
    },
    {
      "AuthorID": "Pfom",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pfom",
      "Content": "Hi, The secret of this illness is to manage one step at a time. Don' stress about something it might not happen ( and I truly hope it wont happen). And everything will have a solution, your health is your main priority. Macmillan online suport is very good to support cancer patients. I used them and they are amazing. I can only recommend them. Good luck.",
      "MessageIndex": 3,
      "PostDate": "12/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123081/in-panic-mode",
      "Title": "In panic mode"
    }
  ]
}