{
  "AuthorID": "pinkshoe",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
  "Posts": [
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hey lovely people! I've been on Letrozole and Zoladex for about 5 months.  No serious side effects, except swollen and achy feet especially around the ankles.  I go for long walks which helps a bit.  Any other advice would be very welcome... XXX",
      "MessageIndex": 0,
      "PostDate": "13/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110332/letrozole-zoladex-and-swollen-feet",
      "Title": "Letrozole, Zoladex and swollen feet"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Thanks all for your responses. I know it's the right treatment for me, but occasionally I panic.... xx",
      "MessageIndex": 4,
      "PostDate": "08/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106167/letrozole-and-zoladex",
      "Title": "letrozole and zoladex"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hey all, I'm pre-menopausal and was given letrozole instead of tamoxifen. I also take zoladex. I was told that, because I have a slight tendency towards thrombosis, it is better to go on letrozole. I questioned that at the time as tamoxifen seems to be the gold standard. My oncologist insisted letrozole with zoladex should do the job. She said that latest research suggested letrozole has slightly better results if combined with zoladex in pre-meno women.  Has anyone else has had a similar experience?",
      "MessageIndex": 0,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106167/letrozole-and-zoladex",
      "Title": "letrozole and zoladex"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Thanks guys for your encouraging words - I have come to rely on you terribly! :) Thank you also for the suggestions for the help-courses. Unfortunately, I no longer live in the UK and where I am there isn't as much help. There are a couple of charities - principally Europa Donna - but they only offer one-to-one Freudian style therapy. I seem to benefit more from group discussion. I've been seeing a cognitive therapist. He is great and does help me a lot when I see him, but it only takes a couple of days to sink back into depression. Looking up my condition and treatment from an academic perspective has helped a lot - but again I need to learn when to stop. So it's fun and interesting to know that the latest studies on the effectiveness of aromatase inhibitors have found that they are probably more effective than tamoxifen, but is it helpful to know their rate of failure as well???",
      "MessageIndex": 4,
      "PostDate": "15/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103699/everything-spells-cancer",
      "Title": "Everything spells cancer"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hi All, Feeling so overwhelmed by it all - I was diagnosed last April, did chemo, had surgery and now awaiting radiotherapy. I'm terribly worried about everything. If I cough, I think it's lung cancer. If my back aches, I think it's bone cancer. If my hair feels funny, I feel it's hair cancer! :) Do any of you feel the same way? How do you reach a balance between caring about your body and becoming paranoid about cancer?",
      "MessageIndex": 0,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103699/everything-spells-cancer",
      "Title": "Everything spells cancer"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hiya, thanks so much for your response. It really helped me put things in perspective. Yes, my cancer is hormone receptive. It was indeed a 40 minute scan. What you say makes absolute sense now that I think about it! I got the results yesterday. The scan was clear - just old age, I was told. :) I'm only 40 so I'm not taking that seriously. Unfortunately the necrosis is ongoing and I seem to have an infection now. My surgeon has inserted a drainer onto the affected area of the breast. It is this little machine which I  have to carry around all the time.  He said I might have to wear it for a month. Aargh... Hugs to all -",
      "MessageIndex": 4,
      "PostDate": "11/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102231/post-surgery-waiting-for-radiotherapy",
      "Title": "Post-surgery waiting for radiotherapy"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hi All, I had chemo and surgery (lumpectomy with lymph node removal) and now I'm waiting for radiotherapy. I had the surgery five weeks ago. My surgeon says I can't start radio before I heal completely.  Unfortunately, I don't seem to be healing fast enough - I had a necrotic nipple which we had to remove and now there seems to be more necrosis. I'm feeling very anxious - I hate waiting around for the next stage to begin.  I also had a bone scan a few days ago and I haven't had the results back yet. That is another source of anxiety as you might imagine! Has anybody else had similar experiences? Any help would be much appreciated as I feel utterly lost and miserable.",
      "MessageIndex": 0,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102231/post-surgery-waiting-for-radiotherapy",
      "Title": "Post-surgery waiting for radiotherapy"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Thanks so much jojomomo for your response. Sorry to hear the post-operation period has dragged on for so long for you as well. I hope it works out OK for you in the end. One question: is the Vac Pac meant to be on continuous mode all the time? My nipple has started to hurt and my breast feels hard and swollen. xxx",
      "MessageIndex": 6,
      "PostDate": "12/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102231/post-surgery-waiting-for-radiotherapy",
      "Title": "Post-surgery waiting for radiotherapy"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hi All, I have to have a Vac Pac to help the wound heal so that I can move on to radio. Has anybody else had a similar experience? Is the Vac Pac supposed to be on continuous mode? Mine goes off continuous mode occasionally and I just put it back on. Am I supposed to do that or am I making things worse? Any advice would be much appreciated! Best to all xxx",
      "MessageIndex": 0,
      "PostDate": "12/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102363/vac-pac",
      "Title": "Vac Pac"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Thanks jojomomo - I hope my experience with the Vac Pac turns out OK as well. I've only had it for a few days and I can't wait to get rid of it! xx",
      "MessageIndex": 2,
      "PostDate": "13/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102363/vac-pac",
      "Title": "Vac Pac"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hey all, I have posted about my ongoing saga with wound healing post-lumpectomy. Well, nearly 12 weeks after the operation I'm still having trouble with my wound - as a consequence, I haven't started radiotherapy yet. Two days ago the surgeon put some stitches in the wound to help it close. The next day it started bleeding profusely. The surgeon saw me immediately and sorted it out, but it was so scary. I can't believe three months on it seems like I'm exactly where I started! What can I do to help the wound heal? I've been eating well (I have a nutritionist on speed dial!), I've lost some of the weight I put on during chemo, I do moderate exercise, I do all the exercises I was told to do and I'm genuinely very well and happy. What else can I do???",
      "MessageIndex": 0,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104496/problems-with-wound-healing-after-lumpectomy",
      "Title": "Problems with wound healing after lumpectomy"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Thank you jojomomo!",
      "MessageIndex": 2,
      "PostDate": "30/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104496/problems-with-wound-healing-after-lumpectomy",
      "Title": "Problems with wound healing after lumpectomy"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Thank you all for your replies - what a lovely bunch you are! My oncologist wanted to start me on the hormone tablets within three months of surgery, but I was wondering if there was a specific time frame for them? Obviously, I'd like to be on them as soon as possible especially since my response to chemo (which I had before surgery) was partial. The tumour and the cancer in the lymph node shrank a bit but not nearly as much as we wanted it too. I'm also going a little crazy because I still have the vac pac nearly five weeks on... jojomomo why so many operations if you don't mind me asking? xxx",
      "MessageIndex": 4,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103473/how-soon-after-surgery-should-hormone-therapy-start",
      "Title": "How soon after surgery should hormone therapy start?"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hey jojomo, really feel for you too. I hope everything goes ok. Sending the bestest of vibes your way... xxx",
      "MessageIndex": 6,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103473/how-soon-after-surgery-should-hormone-therapy-start",
      "Title": "How soon after surgery should hormone therapy start?"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hiya to everyone I finished my chemo in October. I had my operation in November and now doing therapy. This is the problem: about a month after the operation suddenly two fingers on my non-operated on hand started to go numb and painful at the same time. It was much worse at night and would wake me up. I told my oncologist about it and she said sometimes they hit a nerve during chemo and that we should monitor it. Since they were mostly hitting my other arm, I don't think this was done during chemo. At my operation I remember the anesthetist hitting me at the spot that hurts so I think, if nerve damage happened that way, it was probably done then. It started to get better gradually so I was happy about it. But about two weeks ago it came back and it's getting steadily worse. It wakes me up and night. Not sleeping well combined with radio, work and kids means I'm permanently knackered. Has anyone had a similar experience?  Thanks!",
      "MessageIndex": 0,
      "PostDate": "13/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106573/numbness-and-pain",
      "Title": "Numbness and pain"
    },
    {
      "AuthorID": "pinkshoe",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pinkshoe",
      "Content": "Hi All -  I'm due to start hormone therapy soon, which I'm going to do at the same time as radiotherapy. Unfortunately my radiotherapy was delayed because of problems with wound healing. How soon after surgery should hormone therapy start? My operation was on November 4. Any advice would be much appreciated! Pinkshoe",
      "MessageIndex": 0,
      "PostDate": "08/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103473/how-soon-after-surgery-should-hormone-therapy-start",
      "Title": "How soon after surgery should hormone therapy start?"
    }
  ]
}