{
  "AuthorID": "PixieandtheDragon",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
  "Posts": [
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "Hi, Just been reading this thread and found it very useful. I'm not on ''C\", but started my first round of Docetaxel with Herceptin and Pertuzumab 10 days ago (already done 4 rounds of FEC).  Had horrid \"wasps in my mouth\" feeling and burning throat, I went to the GP and he gave me antibiotics and a fungicide gel as he suspected I had a throat infection and oral thrush. I really do hope it's a one off and not the side effects of the chemo! Really helpful to hear from people going through similar treatments and side effects. Good luck to everyone xx",
      "MessageIndex": 33,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "Hi Jo Jo, Damn, thought that might be the case, reading everyone else's description of their side effects. At least it's a bit better today, and gives me an excuse to eat mini milks!! I will be sure to talk to my ONC about it next time and see what they think/if there's anything they can offer. Hope your sore throat improves soon. Xx",
      "MessageIndex": 35,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "Hi Sarahmuggles, Sorry to hear you had a reaction to Docetaxel. It sounds like you have very similar side effects to me. I get the achy bones, I got it on my first type of chemo (not because of the chemo itself, but the injections I was given to take at home afterwards). It got easier the more rounds I had, or at least easier for me to manage. My ONC warned me that the bone pain can be worse on Docetaxel (I've had the first of four rounds), and I am still on the injections, but now I know how to deal with it, it isn't too bad. Check with your oncologist and the chemo suite/specialist nurses what pain meds you can take - I take paracetemol and ibuprofen and it keeps on top of the bone pain really well. I couldn't manage without it as it feels as if my skeleton is having electric shocks sent through it! The stingy mouth really sucks - l can recommend mini milk ice lollies, and anything else cold and/or smooth - yoghurt, milk, milkshakes, soups, mashed potato etc. The not sleeping despite being very tired has plagued me from the beginning of my chemo (start of July), but I'm not a great sleeper anyway. I just try and sleep when I can, and not worry about it too much. I figure even if I'm not sleeping, at least my body is resting, and I try to do relaxation exercises etc. Yoga also helps me, but we're in the middle of a very late spring clean at the moment, so not much space to put a yoga mat down! Good luck with the rest of your treatment and keep us posted. xx",
      "MessageIndex": 39,
      "PostDate": "09/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "I am so glad there are other baldilocks out there! I have finished my fourth round of chemo (out of eight) and have only worn a hat twice (once when freezing cold, once when really sunny and I was worried about sunburn). I have yet to see another openly bald woman, either out and about or at the hospital.  I have had a couple of weird looks from extremely ignorant adults, and some hilarious comments from young children that I don't mind at all (their parents are normally mortified)!!  99% of people are just lovely and friendly, keen to chat (not about cancer). I get great service in shops etc and tend to forget about it completely until I get the \"double take\" - people look, then look away quickly. I am starting to think I should take up an alternative career as a master criminal as I swear people are so concerned with NOT staring that I could get away with anything!! Babies are the best, they just stare and smile, I wonder if they think that I am a giant baby!! ",
      "MessageIndex": 9,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138069/no-headscarf",
      "Title": "No headscarf"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "Geordiegirl47, Yeah, we get these little capes to cover our modesty (a little bit like the ones you put on when you're having your hair cut, but made out of fabric). Seems a bit pointless to me, but I think it's so that they can move you around from room to room (I went back and forth from the ultrasound room to the mammogram room in the breast clinic in mine) without you having to get dressed/undressed all the time. I guess it also provides a bit more modesty for women who may prefer it. B xx",
      "MessageIndex": 21,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138069/no-headscarf",
      "Title": "No headscarf"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "Lol, so glad you took the plunge, I actually find it very liberating, and it's made me realise how hard it must be for woman with non-cancer related hair loss; there just aren't the examples out there to make it \"normal\", so I hope that I am doing my bit to help break down some prejudices.  I was talking to my 5 year old niece on the phone and explaining that I was bald \"I know, like daddy\" she said!  Well, not quite, but how many guys walk around with shaved heads etc. and no one bats an eye! I just wish that women didn't feel that they have to hide it...I consider it a badge of honour... the equivalent of my superhero cape! \"I am a woman, Phenomenally. Phenomenal woman, That's me.\" Maya Angelou  By the way, is it just me, or should all the little capes they make you wear for ultrasound etc be Wonder Woman themed, think that I am going to make one for myself :)",
      "MessageIndex": 14,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138069/no-headscarf",
      "Title": "No headscarf"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "Yay Ann, you look absolutely gorgeous! Is that your sister/daughter? You have the same beautiful eyes and smile xx",
      "MessageIndex": 11,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138069/no-headscarf",
      "Title": "No headscarf"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "Hi Jo Jo, I'm sure you are aware, but it might be worth mentioning for those that don't know that Docetaxel and the T part of FEC-T are the same drug (T part just refers to the trade/brand name that Docetaxel often goes under) - edited to add, I think that is what the THCP refers to, the initials of the drugs you are taking: T - Docetaxel  H - Herceptin  C - Carboplatin  P - Pertuzumab  I have started on FEC, but now going on to 4 rounds of Docetaxel with Herceptin and Pertuzumab. I don't know about the carboplatin, but from the research I have done I have read that Pertuzumab isn't widely available, so perhaps it's the same with Carboplatin? If you Google the drug name, there are several trustworthy sites that have good information on them. Good luck with your treatment xx",
      "MessageIndex": 73,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "Hi Nikki, I got a very sore head too (another woman I met through chemo had the same thing as well). It lasted a couple of weeks but did go away. Whilst it was sore it also looked quite red at points. I found soft fluffy material to lay my head on at night helped. It's probably one of the reasons I have never bothered with hats/scarves/wigs, they would have been painful to wear, and to be honest, I just didn't see the point in putting myself through any more discomfort than was absolutely necessary.  Hope it wears off soon, B xx ",
      "MessageIndex": 79,
      "PostDate": "18/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "PixieandtheDragon",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pixieandthedragon",
      "Content": "I have found spicy food (curry's, Mexican food etc.) the best, also lasagne (I seem to crave the creamy texture of the white sauce! Same goes for really smooth vegetable soups)  I try and batch cook and then freeze individual portions so I have plenty of options and can have what takes my fancy that day. I have gone off sweet things, and like lots of vegetables in everything, lots of salad etc. It seems to taste 'cleaner' to me and is simply more appealing.  It can also be a good idea to go for small portions to prevent over facing yourself, you can always go back for seconds!! Keeping your food intake up is obviously important, so if all else fails, just eat whatever takes your fancy. Good luck in finding foods that works for you xx",
      "MessageIndex": 4,
      "PostDate": "29/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138895/eating-and-drinking",
      "Title": "Eating and drinking"
    }
  ]
}