{
  "AuthorID": "Pmcd",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
  "Posts": [
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Hi ladies, Has anyone tried anything that will help with eyebrow regrowth.  I'm searching the Internet and have come across every oil under the sun. Castor, coconut, olive, emu???  And beauty products by the ton. According to the reviews they all work.  Sorry but I'm very sceptical about the reviews. So.... Has anyone tried any thing and it worked.  I'm nearly a year post treatment.  Taking tamoxifen. Know that slows the hair growth.  My daughter wants me to get eyebrows tattooed on.  Not sure about that. Let me know your experiences with any of the above.   Many thanks  Pauline Xo",
      "MessageIndex": 0,
      "PostDate": "21/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/105603/eye-brow-regrowth",
      "Title": "Eye brow regrowth."
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Hi, firstly ive had to stop reading that article after the 'doable' phase in the first 3 sentences.  Yes chemo is doable..... Basically becasue because there's nothing else you can do but do it.  What's your other option.  2ndly -she's getting paid quite a few pennies to write something so she'll not make it boring lol. She's a smart lady.  Chemos shite but she's right doable.  Off to read the rest of it. hopefully with change my opinion",
      "MessageIndex": 12,
      "PostDate": "04/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109960/decca-aitkenhead-in-the-guardian",
      "Title": "Decca Aitkenhead in the Guardian"
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Naz' hope everything's going ok for you..sending you lots of love and best wishes.....",
      "MessageIndex": 17,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104129/diep-flap-or-implants-how-to-choose",
      "Title": "DIEP flap or Implants... How to choose?"
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Hi Naz, and ladies,  Great question.  And brilliant info. I'm now 18 months post masectomy (6 chemo, 25x rads after surgery) I've a review appointment in July of this year and am hoping to discuss the reconstruction. Wasn't offered at time of diagnosis and surgery.  Don't know why.  Think the focus was on get in, get sorted, get better.  So, this conversation is great as I'm trying to gather information and questions that I might need to ask when my appointment comes up.  If you know of any good web sites with graphic pic let me know.  Sorry if that sound morbid, but just to get my self ready what I'm about to do.  My main concerns: What's the best option.  Diep or implants.  What's the difference.  Further treatment ....is it needed.  Do I decide or does the surgeon decide what's best.  What's the recover like.  Will I be able to manage the down time again. (I've found recover a bit slow for my liking at the moment) I'm also only back to work this week.  So how much more time will I need off.  Will I every look normal!!!!!  I didn't even think about my belly button until I read this blog..... Is it worth all the bother.   Basically..... What would you ask the medical team if you where going to go through it again.... Also just how scary is it going back into hospital again.   I have to say I was one of those, ignorance is bliss, people when I had my masectomy.   However I feel I need to take control of this.  Ladies also is there like a reconstruction monthly group like with the chemo and rads that I can read through......  Pauline  xoxox to you all",
      "MessageIndex": 9,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104129/diep-flap-or-implants-how-to-choose",
      "Title": "DIEP flap or Implants... How to choose?"
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Yep... 'in the grand scheme of thing'.... that just about sound so right.  I think that I actually stopped naturally complaining when I was diagnosed.  I nearly adopt a 'Thank god I'm still here.  I'm never going to open my moth again'.  I couldn't have given Pollyanna a run for her money.  I'm now three years post diagnosis and have started to complain again.  About anything lol.  I nearly forgot what it was like and how much I enjoyed it lol So ... you go a head and rant. You entitled to it.  Same way everyone else is.  And let see face it you've more to rant about than anyone else.  Save the money and go face the hordes of squealing children and work colleagues.  They'll be glad to see you no matter what you look like.  I bet you a £10 at least 6 people will tell you your 'looking great' tomorrow.  Go and find a good confidential friend to rant to.... or just do it here. We've all used these page s for something make this your 'agghhhhh rant' site.  NO ONE will hold it against you.  Good luck tomorrow  P",
      "MessageIndex": 7,
      "PostDate": "03/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137123/fed-up-and-need-a-rant",
      "Title": "Fed up and need a rant"
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "ladies I've a pending question.  I had my masectomy in August 2014.  All my chemo, rads finished March 2015.  Things are good and my energy etc is all coming back.  I'm planning to return to work in next few weeks. And I don't have to go back to see breast care team until next year.  I've always wanted reconstruction. It was never mentioned at time of diagnoses or surgery.  I guess my priority then was get the cancer sorted and see what happens.  I know that some people have had masectomy and reconstruction on same day.  Should I have asked for it? What's the standard procedure for reconstruction. If you don't get it at time of masectomy do you not get it later.  Do you have to be cancer 'free'?  Is age and weight a factor? Also what 'kind' do you get, what's best?  let me know the advantages and disadvantages of surgery.  Some people I've heard don't get it done. Why? Also others have said its soooo false looking it's worse than scar.  Feel free to bombard me with advice and experiences as I need to have as much info before I go start asking the professionals questions. Tell me about the surgery and all the lovely things that you only discover when in the tick of it.  Thank you....",
      "MessageIndex": 0,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100869/reconstruction-advice-and-info-please",
      "Title": "Reconstruction advice and info please....."
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Xoxo oh thank you everyone.  You've given me good thoughts and also some more good questions to ask when I go. And as usual lots of hope and clear advice.  AliG58, you keep the faith girl... All will be good. Xo. Dream thief thank you for the attachments.  Mistymoley, I going to look out for that group here. Do t think I've heard of it but will be searching now lol. Weeble lol my friends will be all donating bits come the time, and your right the LD flaps does sound to much. Crystlejuju , your right I need to find out what the options are and tell them what I want. I think secretly that's my problem. I've been told by everyone what's going to happen to me over the past year and haven't had to make a decision.... Need to grow a set' and start making decisions again. Xoxoxox",
      "MessageIndex": 10,
      "PostDate": "06/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100869/reconstruction-advice-and-info-please",
      "Title": "Reconstruction advice and info please....."
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Awh dream thief....everytine... You brighten my day and make me laugh lolol ",
      "MessageIndex": 5,
      "PostDate": "08/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104906/tablets",
      "Title": "Tablets"
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "My thoughts and good wishes are with you today and always xoxoxo ",
      "MessageIndex": 9,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99068/breast-clinic-tomorow-im-worried-sick",
      "Title": "breast clinic tomorow im worried sick"
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Don't drive is good advice.  Take some mints or something to suck on during the chemo to take away the 'tangy' taste of chemo. Be prepared for nail changes. As In they will change colour, strength, texture and even fall off.  I kept mine for a few months by getting them painter dark colours.  No scientific evidence but had heard it helps and it did. Small drinks. No fizzy stuff. Kidney dishes for you to be sick in when coming home in car .... Majorly important Lolol...Do what you can to keep you bowels and kidneys working as in drink water, eat food that help with bowel activity. I had reflexology for the nausea as well which helped me more than the anti sickness tablets.  Sit back and focus on one thing.... Getting better. Good luck xoxox thoughts and prayers are with you...I'm just heading to the 1st anniversary off starting my chemo. It was FEC and dosataxol.... First 2 of FEC felt like a hangover .... Dosataxol was definitely different.  But above all else ....keep breathing, and know that you are going to get better xo",
      "MessageIndex": 5,
      "PostDate": "14/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101254/hi-im-new-here-is-there-a-newbies-site-how-do-you-cope-with-chemo",
      "Title": "Hi Im new here is there a newbies site? How do you cope with Chemo..."
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "I'm now nearly a year post chemo finishing.  Taking tamoxifen daily.  Out walking.  Trying to get back to work...... But why am I still feeling awful...... My bones are sore, I've nocturnal waking, little bladder control, nausea..... When do I go back to being me.?????..... The post cancer me... Is this the bit where I realise, it just ain't going to happen.....please tell me this is not the new normal...... I feel like a geriatric (apologies to elderly people) ... I just want to feel well again.",
      "MessageIndex": 0,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102461/when-does-this-end",
      "Title": "when does this end....."
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Lolol note your time of posting Judith. Yeah, I used to be able to sleep on a razor blade, as my family put it.  Now, I'm watching box sets of tv shows during the night or running to the loo .... Lolol Definitely changed times. Hopefully, when I get back to work the sleep will settle.  Pauline",
      "MessageIndex": 6,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102461/when-does-this-end",
      "Title": "when does this end....."
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Lynda, thank you for the light bulb moment.  Bless your common sense socks. I take the tamoxifen in the morning. I hadn't even thought of that. Your so right. Thank you xoxox  I'd had sickness and bone pain when I first started but it all wore of eventually.  It has just started up past few weeks and was starting to annoy me that I wasn't 'moving on' as we say.  This why I love these blog pages.  You've made my day. Bless.   Hope reinstalled. ",
      "MessageIndex": 2,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102461/when-does-this-end",
      "Title": "when does this end....."
    },
    {
      "AuthorID": "Pmcd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pmcd",
      "Content": "Thank you June.  Your right I need to be more patient with my self.  I'm so trying. To get back to normal.  But at times I'm beginning to wonder just what normal was.  I think I'm deluding myself by saying i was like this or that before cancer and want to get back it that. im starting to question my actual fitness pre cancer.  It does my heart good to hear your back full time. I'm a single income now and am keen to return to full time pay.   Yes I need to just focus on being a bit more gentle with my self.  I remember the nurse in my GP surgery saying that to me one day.  Thank you again. Xoxox I'm ",
      "MessageIndex": 4,
      "PostDate": "15/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102461/when-does-this-end",
      "Title": "when does this end....."
    }
  ]
}