{
  "AuthorID": "PODGEO",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/podgeo",
  "Posts": [
    {
      "AuthorID": "PODGEO",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/podgeo",
      "Content": "HI BECKY I cannot actually find you on this forum; but hope you can read this. I am actually node positive,postmenopausal;therefore not in group you wanted to talk to...............but; I have asked for and had the Oncotype DX test. It cost me £2,400. It could be available free for node negative, patients if you are on the borderline of needing or not needing chemo. Also if you have Aviva health insurance,they will sometimes pay fot this test. Ifound the results useful, because I did not want chemo, which is routinely recommended to node pos patients. the test put me in a lower category for recurrence, so chemo would not improve my outlook. The test is not universally accepted by all oncologists; but 2 trials are under way in England; ine in Bristol, and one in Oxford I think. Like you I found Adjuvant On Line wooly and unhelpful The test can be through as soon as 5 days from when the US lab receives your specimen;so even if you have started chemo,it's not too late to have it done best wishes   ",
      "MessageIndex": 0,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42215/oncotype-dx-test",
      "Title": "oncotype dx test"
    },
    {
      "AuthorID": "PODGEO",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/podgeo",
      "Content": "This test which is currently widely available in the US for early breast cancer, and has been for some time, is only currently being assessed by NICE, and may not be available here in the UK for some time due to it's cost. I am concerned for all the ladies who will be coming after me, because my oncologist advised me that it is the way forward, and will supersede the current tests being used to assess the need for chemotherapy. He thinks the current tests are obsolete. How do you think we should start a campaign for general public awareness of this test ?",
      "MessageIndex": 0,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/43011/do-we-campaign-for-general-availability-of-oncotype-dx-test",
      "Title": "do we campaign for general availability of Oncotype DX Test"
    },
    {
      "AuthorID": "PODGEO",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/podgeo",
      "Content": "HI CAROL  I had the Oncotype DX recently; which placed me in the \"intermediate group\"  by Recurrence Score. I am node positive, post menopausal, early breast cancer, and oestrogen receptor positive My oncologist recommended  \"routine chemotherapy\" and his opinion remained unchanged after getting the Oncotype results. An oncologist in California, who I consulted, said if \"low \" or \"intermediate \"  Recurrence Score results , he would not recommend chemo; if results come back \"high\"  Recurrence Scores, he would recommend chemo Everyone is different ; and the Oncotype test I believe helps to \"individualise \" treatment. I have opted out of chemo Best wishes  ",
      "MessageIndex": 2,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42797/onkatype-dx",
      "Title": "Onkatype Dx"
    },
    {
      "AuthorID": "PODGEO",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/podgeo",
      "Content": "hi; I am due to start radiotherapy tomorrow; 10 weeks after my breast surgery. Is this other people's experience ? NICE (National Institute of Clinical Excellence)  recommends that chemotherapy or radiotherapy, whichever you are having first, should start within 31 days of breast surgery, for early breast cancer. ",
      "MessageIndex": 0,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42735/waiting-time-for-adjuvant-treatment",
      "Title": "waiting time for adjuvant treatment"
    }
  ]
}