{
  "AuthorID": "poet40",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poet40",
  "Posts": [
    {
      "AuthorID": "poet40",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poet40",
      "Content": "Read my post. It quite clearly states that I’m not advocating the approach, that it’s my own personal choice, that much of the www ‘advice’ is probably nonsense, that some oddball alternative therapies (none of which I mention here) could potentially interfere with conventional treatment and that anyone should consider the points raised in the wider context of their treatment. Finally, I suggest that people should talk to their doctor. I'm not sure how many other caveats I could have included without treating potential readers as simpletons. The post has absolutely nothing to do with PROMOTING alternative remedies which, as my post also acknowledges, is banned from this site. As a long-term user of WN, I do know the rules & would be the first to flag-up supposed miracle cures. There has been a problem with this in the past on this site, which is why I was so very careful in my initial post. However, I think we're in danger of becoming overly-sensitive on such issues with knee-jerk reactions to anything that might be considered as 'alternative'. The site reference I mentioned has been discussed widely before - there are other links to it on WN. Should you ever come across the books then they are not explicitly alternative remedy publications. You will note that I mentioned that these books should be used to form a 'wider view' of treatment options. I would happily delete the link, but you've reported my post so am unable to alter. However, a quick google would find the same anyway. OK then, there is a massive difference between promoting alternative therapies and acknowledging an interest in the same. As regards evidence as to what works in combating cancer, if there were absolutes regarding the use of certain diets then we’d all be on them. The suggestions are presented as remedies to enable your body to fight cancer. All I've said in my post is that I choose to boost my immune system through some of the measures mentioned – green tea is acknowledged to be high in antitoxins. Equally, as a precaution, I’d rather not consume high quantities of nitrates and pesticides so filter my water – I live in an intensively farmed area where these are particularly high. Such measures might be an irrelevance to my condition. But, as stated, this is merely my personal take and choice after having done what I can to read widely on the subject. Waiting for science to provide absolute evidence is akin to sitting on one's hands. I will discount such measures when the medical fraternity can say for sure what has caused my cancer. Until then, there are more questions than answers and I think that people should be allowed to at least consider the issues raised.",
      "MessageIndex": 3,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10958/diet",
      "Title": "Diet"
    },
    {
      "AuthorID": "poet40",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poet40",
      "Content": "Hi there! I certainly tried to take control of my cancer through diet when I was first diagnosed. This was basically by following healthy eating principles rather than by focusing on any one food group. There is, of course, a huge amount of information on the web. However, much of this is, at best, well-intended nonsense and, at worst, there to exploit vulnerable people such as ourselves. My own very personal take on this was to read books by Chris Woollams - whom many might disregard. I don't necessarily advocate his particular approach - indeed, we're all quite rightly asked not to post 'miracle' potions on these boards. However, his books together with a sensible approach to diet might help you to form a wider view on what might best suit you. For my money, I began to drink green tea, changed my water supply to a reverse osmosis system, fed myself with selenium and reduced my reliance on a meat products. I also try to limit my exposure to environmental factors such as household chemicals which can, it is suggested, interfere with the immune system. As I have cancer of the immune system itself this would seem to be a sensible precaution. Indeed, I've always known that I'm chemically sensitive. Given the variance of cancer rates around the world there might a good case for linking this, in part, with diet. I'm in total sympathy with 'alternative' therapies, but some can interfere with conventional treatments. I know you don't have cancer, but much of the above is intended to help boost the immune system! So please take any advice within the wider context of your condition and obviously talk to your doctor if you're interested in any of the points raised. Sorry this is SO long-winded.",
      "MessageIndex": 1,
      "PostDate": "20/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10958/diet",
      "Title": "Diet"
    },
    {
      "AuthorID": "poet40",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poet40",
      "Content": "No upset caused Tricia. I think it can be difficult to get a full understanding from someone via type alone. Hence the reasons why there can be many misunderstandings on this site. Which, given our shared affliction, is sad. 'Alternative therapies' immediately conjure up images of free love and tree-hugging hippies (not such a bad image). However, if you cut beneath the surface, there is considerable interest in this area and other countries have embraced such arguments more enthusiastically. Gary's point is perfectly valid if I were to advocate that people should adopt 'alternative' remedies in place of conventional ones. The book reference I made explicitly makes the point that conventional treatment should always be followed. Besides, I'd have been dead many months ago without such treatment!! I hope I have, at least, widened the argument. Enjoy the sun!",
      "MessageIndex": 5,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10958/diet",
      "Title": "Diet"
    },
    {
      "AuthorID": "poet40",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poet40",
      "Content": "Thank you Gary, Firstly, can I just say how much I deeply sympathise with your own daughter's diagnosis. I find that, as middle-aged bloke of 46, cancer is enormously difficult to deal with. However, my powers of coping would be stretched beyond measure if it were my son who was in this position. Having a child with cancer must be an unbelievably tortuous predicament - sorry, that's not even the right word. I do agree with your points entirely that claims must stand up to medical scrutiny. Of course, I don't know whether my small changes will ultimately have changed the course of my cancer and I am deeply sceptical of wild and wonderful claims made by others. I guess I've just adopted what I feel is a common-sense attitude to my diagnosis. At worst, I've spent money on things which have done me no harm - although green tea has been revered for its remedial properties for centuries. I like to consider that I have a reasonable take on things and don't accommodate what I might term 'lazy science'. I do research well beyond the www . However, I'm by no means an expert. Equally, I'm not a fool (I'm not suggesting you inferred otherwise.) I do believe that medical science sometimes has to play catch-up with emerging 'evidence' - anecdotal or otherwise. I don't think we'll agree as I can't provide you with a watertight case. However, there is a much wider debate on such issues in other countries. In the meantime, I do sincerely wish you and your daughter well. Thank you for your supportive and dignified reply. This site remains overwhelmingly one of support. I hope that I have done nothing to challenge this view. Yours Andrew",
      "MessageIndex": 7,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10958/diet",
      "Title": "Diet"
    },
    {
      "AuthorID": "poet40",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poet40",
      "Content": "Welcome Gary! I'm all for compromise. Andrew",
      "MessageIndex": 9,
      "PostDate": "23/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10958/diet",
      "Title": "Diet"
    },
    {
      "AuthorID": "poet40",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poet40",
      "Content": "I told my brother and sister in 2007 and I'm still waiting for the visit! (Sorry, am bitter old git) Seriously, I take your point entirely. Communication is not the strongest attribute of 21st century man. I now wear my heart on my sleeve and am 'happy' to tell all that matter about my condition. In the end, you do find there are few that really care. However, it's entirely a case of quality over quantity. I'm grateful for those who have supported me ... and I was only joking about being bitter - life's too short. And, God knows we understand that more than most on this site. Andrew",
      "MessageIndex": 2,
      "PostDate": "24/01/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10848/an-appeal-to-families",
      "Title": "An appeal to families"
    },
    {
      "AuthorID": "poet40",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poet40",
      "Content": "You've come to the right place Melanie. So sorry about your diagnosis. However, it looks as if you're getting near-instant treatment. I know the ladies of the site (ie 95% of members) will be able to offer more insight and support than I might. Please be assured that you'll get loads of support here! Andrew",
      "MessageIndex": 1,
      "PostDate": "11/10/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10787/new-club-member",
      "Title": "New club member"
    }
  ]
}