{
  "AuthorID": "Poppylisa",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppylisa",
  "Posts": [
    {
      "AuthorID": "Poppylisa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppylisa",
      "Content": "Thank you  x",
      "MessageIndex": 17,
      "PostDate": "26/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106701/bit-of-a-ramble-starting-to-wobble",
      "Title": "bit of a ramble starting to wobble!"
    },
    {
      "AuthorID": "Poppylisa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppylisa",
      "Content": "Hi Kath I've just joined this group too. I'm 37 and found out the end of March I've got breast cancer (stage four). I am just about getting over the initial shock. I was living overseas when I found out am now so glad to be back. I did have to stop looking stuff up on the Internet for a while as it all sounded far too gloomy for my liking and was making me feel worse (as I feel pretty positive most of the time!!), plus much of the info and stats online may well be out of date so bear that in mind. Also of course, you are you and unique and this is your story. I've just had one round of fec chemo which (touchwood) went fine. Very tired for a few days afterwards but I took all the meds the nurses advised for those first days which I'm sure helped as I didn't feel sick, just mildly 'off' and now I feel my usual self which I take as a good sign. Lots of love  D",
      "MessageIndex": 11,
      "PostDate": "26/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106701/bit-of-a-ramble-starting-to-wobble",
      "Title": "bit of a ramble starting to wobble!"
    },
    {
      "AuthorID": "Poppylisa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppylisa",
      "Content": "Thank you G n J. Yes has spread to bones..spine and pelvis...although I wouldn't have a clue about that at present. Basically it seems the breast lumps were misdiagnosed a year ago when I was living overseas but not dwelling on that now  as its pointless. I just joined a secondary group too, although I'm kind of thinking of it in stages at present!  I know, I'm hoping I feel ok after the next cycle too. I've got two little ones who keep me busy which I think helps keep me grounded and stops my mind wandering too much. I had some reiki after the first chemo too which seemed to help me. If nothing else, it was just nice to get an hour of peace, listening to soothing music whilst lying down! I am feeling strangely positive most of the time at the moment.. it's some others I've had to have a pep talk to   D",
      "MessageIndex": 14,
      "PostDate": "26/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106701/bit-of-a-ramble-starting-to-wobble",
      "Title": "bit of a ramble starting to wobble!"
    },
    {
      "AuthorID": "Poppylisa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppylisa",
      "Content": "Thanks cazwaz xx",
      "MessageIndex": 19,
      "PostDate": "03/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106701/bit-of-a-ramble-starting-to-wobble",
      "Title": "bit of a ramble starting to wobble!"
    },
    {
      "AuthorID": "Poppylisa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppylisa",
      "Content": "Yes you're right, keep putting on the make up even if you don't feel like it some days. That's what I intend. It was a shock and we were in the process of moving back anyway so were super busy with moving etc. Then we had to check in to this lovely beachside hotel for the last few days which under other circumstances would have been great but it just felt really sad as just wanted to be home already and everybody else was frolicking about unawares. Anyway that's that and I'm just glad to be back with my people and feel so much better now so am lucky in that sense, like you. Definitely getting outside for a walk is a help, despite the freezing weather. ",
      "MessageIndex": 15,
      "PostDate": "26/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106701/bit-of-a-ramble-starting-to-wobble",
      "Title": "bit of a ramble starting to wobble!"
    },
    {
      "AuthorID": "Poppylisa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppylisa",
      "Content": "Hi Sarah I am sorry you find yourself on here. I got diagnosed in March and I have to say In terms of shock, it was so much worse during those first weeks and early months. We were just about to move home to UK from overseas anyway as timing would have it and frantically packing up our lives, schools and hubbie was running round here there and everywhere sorting out admin. Hopefully you will find, like me and others that once you do get a treatment plan in place, it does get quite a bit easier to deal with. I've got two little ones-4 and 6 yrs and was going straight to chemo. So for them, I just told them the basics of what they would notice in their little world and that was enough for them. I guess as yours may be a little older they will want a bit more info. I think someone shared a link and I am sure if you ask your nurse, they may guide you.  It will get easier....It's a horrid situation to be in, but there really is so much around these days to help Xx",
      "MessageIndex": 16,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114088/stage-3-breast-cancer-help-how-to-tell-my-children",
      "Title": "Stage 3 breast cancer help & how to tell my children"
    },
    {
      "AuthorID": "Poppylisa",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppylisa",
      "Content": "Xxx",
      "MessageIndex": 20,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114088/stage-3-breast-cancer-help-how-to-tell-my-children",
      "Title": "Stage 3 breast cancer help & how to tell my children"
    }
  ]
}