{
  "AuthorID": "Poppyred",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppyred",
  "Posts": [
    {
      "AuthorID": "Poppyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppyred",
      "Content": "I git some great ones from sainsburys. They were super comfy and washed well.",
      "MessageIndex": 1,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143237/pyjamas-to-wear-in-hospital",
      "Title": "Pyjamas to wear in hospital"
    },
    {
      "AuthorID": "Poppyred",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/poppyred",
      "Content": "Hi there, I had exactly the same regime as you which finished in January. Re nails, I was advised to have mine painted in a dark colour before my first treatment as apparently there is a theory that the lack of uv light can stop the nails being so affected. I had mine done for my last three treatmentstar and although they were weak they did not fall off. They're growing back as good as ever now. I'm still having them done as they are discoloured at the ends. Re side effects, the docetaxel was harder to manage. I had terrible pains  in my legs which I was informed was a common side effect. I ended up taking co-codomol and also, on advice from my oncologist, took my steroids over a longer period of days.  I lost lots of eyebrows and eyelashes and also had very dry skin.  My tip would be to get yourself a pamper kit together. It needs to have some good moisturiser, hand cream, aloe vera eye gel from the body shop (under my eyes was painful and swollen when my eyebrows/ lashes fell out and this was fab) and anything else that will be comforting. Consider taking some co-codomol at least a couple of days prior to treatment and then for a couple of days after (this was advise from the nursing staff where I had my chemotherapy). This will mean you have some pain relief in your system prior to treatment. It helped me greatly to remember that I was moving towards the end of the chemo journey with each treatment. 6 months on it's  a distant memory and all the nasty side effects have been forgotten. Best of luck. Sending hugs xx ",
      "MessageIndex": 3,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159027/round-3-of-fec-t-getting-nervous-about-docetaxel",
      "Title": "Round 3 of FEC-T, getting nervous about Docetaxel!"
    }
  ]
}