{
  "AuthorID": "Princess Fiona",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/princess-fiona",
  "Posts": [
    {
      "AuthorID": "Princess Fiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/princess-fiona",
      "Content": "Hi Jet, like you I had a lumpectomy and am half way through my FEC chemo with 3 more treatments to go. I have experienced various kinds of pains around my scar and tenderness to the left of the nipple. When i asked about it i was told that its the nerves repairing themselves, some do this quicker than others and the fusing process will continue. Not sure if this is right, but the pain comes and goes - its more like a tenderness and dull pain generally but I have had on odd occassions had a sharp stabbing pain in the area. Again, was told the same and to take paracetamol. I know this probably wont help much as I dont know what the answer is but its sometimes nice to know its not just you! Hope your pain subsides. Fiona",
      "MessageIndex": 1,
      "PostDate": "09/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10989/scar-pain",
      "Title": "Scar pain"
    },
    {
      "AuthorID": "Princess Fiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/princess-fiona",
      "Content": "Hi, Like you all I was worried about losing my hair - its our crowning glory so they say. I had so much hair loss after my first chemo (FEC) I couldn't take it anymore and shaved it off one lonely Monday morning. People say it suits me (not many have seen the baldy napper but the headscarf look) but it doesn't take away that feeling that everyone is staring. I have discovered that if I dont think about it no one looks more than a coursery (?) glance and its my own fears that were making me self conscious. I have a wig which I have never worn and I doubt I ever will as it feels too much like a wig, I would rather have people look and say \"Ah, lok at her with a headscarf she must have cancer\" than the comments when people look harder to check if it is a wig you are wearing - I know this is my own person thing! I have surprised myself though as I can cope more with the hair loss, and weight gain but not the fatigue and sickness. Just had my third round of chemo and have never felt so down with it and wanting to stop. What I wouldn't give now to be able to blow dry my hair as a distraction from the sickness. Anyway girls, I keep getting told it will grow back stronger and healthier - but maybe a diffeent colour and curly -lets see what the future brings x",
      "MessageIndex": 11,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10978/hair-loss-cold-cap-and-fec-t",
      "Title": "Hair loss/cold cap and FEC-T"
    },
    {
      "AuthorID": "Princess Fiona",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/princess-fiona",
      "Content": "Hi Susan, My situation isn't the same as yours, but I had a lumpectomy and Sentinel node biopsy - followed by 6 treatment of FEC. I've just finished by fifth session. The side effects from the chemo have kicked in quite quickly for me each time, but they have varied in length of time and degrees. My friends have likened my symptoms to being pregnant, whilst I thought it was more like a constant hang over. The think to remember is that it does improve, and you are doing this for the best reasons. This website is so useful as people are so supportive, even if they dont have the same type of cancer or situation. If you do want to pm me please feel free to do so. Good luck, and it will improve from here Love Fiona x",
      "MessageIndex": 2,
      "PostDate": "12/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/18784/breast-cancer-primary-not-found",
      "Title": "? Breast cancer primary not found"
    }
  ]
}