{
  "AuthorID": "prudence",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/prudence",
  "Posts": [
    {
      "AuthorID": "prudence",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/prudence",
      "Content": "Hi, I am just over half way through chemo ( 3 FEC 3tax 15 radiotherapy) I live in Newburgh, nr Wigan. Just had my 1st tax last Wednesday and had rough ride but think I am on the light side now. I am here to help if you need to chat. I had a mastectomy and full lymph node clearance 24th jan. It is a bum by ride but you will get there and beat this. Love Suzanne xxxxx",
      "MessageIndex": 4,
      "PostDate": "11/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77997/could-i-suggest-buddy-system-you-could-have-a-bosom-buddy-too--",
      "Title": "Could I suggest buddy system? You could have a bosom buddy too :-..."
    },
    {
      "AuthorID": "prudence",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/prudence",
      "Content": "Hi, I'm sorry you have joined the club. I was working , loving life and live on a farm with lots to do and two boys age 20 and 18 who race cars. I now have no control over this crap cancer and have to do as I am told to be clear. I was told 17 Dec invasive ducal grade 2 with lymph nodes affected. Had mastectomy and full lymph node clearance 24 th Jan and have just had my 2nd FEC. You have to take a back seat now and go with the journey and try to stay positive. Have a good meltdown when it happens but keep it in your mind you will not be beaten with this. It is a setback of a year in your life but you will get there and chemo like everyone says on this site is doable. Keep eating well and nice walks and it is good they can do so much to help and support you. Thinking of you love Suzanne xxxxxx",
      "MessageIndex": 6,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75021/new-cancer-patient",
      "Title": "New Cancer patient"
    },
    {
      "AuthorID": "prudence",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/prudence",
      "Content": "Hi angel, I know how you feel and it is so daunting. All the tests are necessary and once you get on your chemo you will feel like you are at the start of your next journey. I am having chemo five next Wednesday and it has been a real roller coaster ride but you will get through it. I had three FEC and had my 1 of 3 tax, like everyone says it's not easy but it is doable. Be strong and keep positive. Big hugs Suzanne. Xxxxxx p.s. There is so much support on this site and everyone is so helpful. Xxxx",
      "MessageIndex": 3,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78536/so-my-nightmare-begins",
      "Title": "so my nightmare begins"
    },
    {
      "AuthorID": "prudence",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/prudence",
      "Content": "Hi Clarie, I had IDC stage 2, 46 lymph nodes removed and 6 cancerous. Mastectomy on right side. I had my mastectomy 24th January 2014, then 3 lots of FEC and 3 lots of Taxotere, 15 sessions of radiotherapy. I am just waiting for my reconstruction as I had an expander which is basically a bag that is injected with saline every week until the right amount is in. I had 650mls (50mls each time) not sure if you are having an expander as different hospitals and surgeons do different things. I am on tamoxifen and I am perri menopausal which makes you a bit stiff and creaky in the morning and hot sweats. If you have chemo it is all doable and all this has made me a stronger person. Try not to worry and take each day as it comes. Get a diary for all your appointments and ask for help if you need it. I know your head will be in a whirl and you feel sad and angry but you will be ok and get through this. Stay strong and try to be positive. Let me know if you want to know anything else. Take care and gentle hugs Suzanne xxxx",
      "MessageIndex": 2,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103244/another-newbie-stage-2-idc-sentinel-lymph-node",
      "Title": "Another Newbie... Stage 2 IDC & Sentinel Lymph Node"
    },
    {
      "AuthorID": "prudence",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/prudence",
      "Content": "Hi Jane, yes is the answer to sore fingers and toes. my finger and toe nails went weak and fingers nails fell of and peeled. I have finished all my treatment now and just need my implant next year. My nails have started to grow back and I have been using OPI nail envy to strengthen them and it's worked a treat. Got hair now and nicer than before. Hang in there, you can do this. Gentle hugs x.  Suzanne xxxxx",
      "MessageIndex": 1,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86385/sore-fingers-and-toes-after-docetaxel",
      "Title": "Sore fingers and toes after docetaxel"
    },
    {
      "AuthorID": "prudence",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/prudence",
      "Content": "Hi Kate, I had mastectomy on right boob January 24th and they put an expander in. Had all my chemo and on theirs rads now. The expander felt a little odd at first but you soon get used to it. It doesn't hurt and when you have it filled by them finding the magnet it felt funny the first time then the other times I didn't now they had done it. I have 650 mls in and it does feel solid like you are carrying a small child clipped on. You can sleep however you like once it has settled. I am looking forward to my implant though. Good luck love suzanne",
      "MessageIndex": 1,
      "PostDate": "09/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/80968/expander-implant-advice-please",
      "Title": "Expander Implant advice please"
    },
    {
      "AuthorID": "prudence",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/prudence",
      "Content": "Hi, mine felt like this for the first two weeks and I could feel it catching and it looked a bit red. I don't really notice it now but at first I kept checking it for infection(bit obsessive). Hope it's ok love Suzanne xxxxxxxx",
      "MessageIndex": 1,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75159/picc-line-problems-itching-and-redness",
      "Title": "PICC line problems itching and redness"
    }
  ]
}