{
  "AuthorID": "psorias",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/psorias",
  "Posts": [
    {
      "AuthorID": "psorias",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/psorias",
      "Content": "Hello I have just been diagnosed with BC 3 days ago.  I am to have a lumpectomy in 6 days time and the lymph nodes removed then some radiotherapy.  Am I to expect any tablets as well.  I have been having a little read on here and see people talking about different drugs.  I already take medication for emphysema in the form of steroid inhalers and ventolin, which I have had for 5 months since my breathing became bad after pneumonia and pleurisy.  Was wondering if these will stop me having any meds I might really need for the cancer.  Thank you for any advice you may have.  I feel sick scared at the moment.  Been an awful year.  ",
      "MessageIndex": 0,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63858/just-been-diagnosed-bc",
      "Title": "Just been diagnosed BC"
    },
    {
      "AuthorID": "psorias",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/psorias",
      "Content": "Hi Mamam, thank you, I have just looked through all the papers booklets and forms I got given and I did get given a card and it does say breast care nurse and a number, sorry I had seen that but I thought that was for if I got sore from the biopsy - I shall give her a call tomorrow.  No I did not get told a lot at the diagnosis.  But then it was 5pm before I got called and I was the last one waiting, so I think they may have run out of time.  I had swabs done and they did explain about the shower gel I am to use for 3 days before op.  To be honest they asked me do I have questions, but I could not think straight.  Thank you for replying.",
      "MessageIndex": 10,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63858/just-been-diagnosed-bc",
      "Title": "Just been diagnosed BC"
    },
    {
      "AuthorID": "psorias",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/psorias",
      "Content": "Thank you Kate, I do have a very active imagination, so your words about it not being as bad as your's are comforting. And about getting the power back, that is it, I do feel totally powerless and very unknowledgable about anything to do with cancer.  I am fortunate that I do not know anyone that has had or suffered cancer.  So the 'Tamoxifen' tablets, they are hormone tablets?  And do you know when they find out if my cancer is oestrogen-positive?  I had biopsies done would the doctors already know from that? Sorry so many questions, ",
      "MessageIndex": 8,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63858/just-been-diagnosed-bc",
      "Title": "Just been diagnosed BC"
    },
    {
      "AuthorID": "psorias",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/psorias",
      "Content": "I will be on the ward next time I see them for the operation.  So maybe after that I will think clearer.  I hope so.  It is hard for me to speak (and breathe) with my emphysema.  It makes me slow because i say a couple of words and then get breathless, so need to do some deep breathing and then continue to speak.  That makes the telephone hard but it is also hard when face to face, I find typing so much easier.  So I thank you and the others for the responses I have had.  I feel a little calmer.  But scared of anaestetic because of my damaged lungs.  Before I had pneumonia and pleurisy I was running about and a member of an athletic club.  My life has done a complete 180 on me.  And just as I had my first grandchild.  But I am lucky because they found it.  So I have a good chance.  Thanks again for replies",
      "MessageIndex": 12,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63858/just-been-diagnosed-bc",
      "Title": "Just been diagnosed BC"
    },
    {
      "AuthorID": "psorias",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/psorias",
      "Content": "Hello Jints thank you for your reply.  I am 50, and have been pre-menopausal for 7 years. ",
      "MessageIndex": 2,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63858/just-been-diagnosed-bc",
      "Title": "Just been diagnosed BC"
    },
    {
      "AuthorID": "psorias",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/psorias",
      "Content": "Hello Binny, Thank you for your reply.  It is interesting to learn all this, before I speak again, with whoever at the hospital, as at least I will kind of know what I am asking about.  Would the oncologist be who I saw at the breast clinic when I was diagnosed?   I know he was a surgeon cos he said he hoped to do the operation himself.  He was a lovely and kind man called Casper, so I hope so too.  ",
      "MessageIndex": 6,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63858/just-been-diagnosed-bc",
      "Title": "Just been diagnosed BC"
    },
    {
      "AuthorID": "psorias",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/psorias",
      "Content": "Thank you for taking time to reply to me Jints.  I really appreciate it.  I think you are right of course, I should just think about next Wednesday's op. And worry about everything else after that.  I will let you know how I go.  thanks again.",
      "MessageIndex": 4,
      "PostDate": "22/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63858/just-been-diagnosed-bc",
      "Title": "Just been diagnosed BC"
    }
  ]
}