{
  "AuthorID": "Purplerules",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/purplerules",
  "Posts": [
    {
      "AuthorID": "Purplerules",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/purplerules",
      "Content": "Hi all, i was diagnosed with TNBC in Jan 16, had surgery, chemo and rads. All finished in sept 16. But found a lump in my neck this year and had some cells taken for tests. Went for results today and doc says the cells look suspicious and i have to have a full body scan to see what is there. They think its likely to be cancer. Has anyone else had either a lump in their neck or had results of suspicious cells?  Bit worried now especially as they told me 2 weeks ago they were 90% certain it wasn't cancer. Also know of a woman who had breast cancer and docs think the radiation has sent the cancer to her brain as she now has a brain tumour. My mind is buzzing! ",
      "MessageIndex": 0,
      "PostDate": "29/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125912/suspicious-cells",
      "Title": "Suspicious cells"
    },
    {
      "AuthorID": "Purplerules",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/purplerules",
      "Content": "Thank mistymoley,  I was shocked to hear that story of the woman with the brain tumour because i had never ever heard that radiation can send cancer to the brain. I was horrified and it sent me into a real panic, so it was a relief to read your reply.  I haven't had a cold recently and i did have  this small lump in my neck before my chemo last year but my husband and other family members kept saying there's nothing there so i thought i was imagining it and after my first chemo it went so i didn't think any more of it. Then in late November i felt a tiny lump again and again everyone said they couldn't feel it. It played on my mind though and i finally went to my GP and asked him if i was imagining it. He said straight away there was a lump and referred me back to the hospital.  The docs last night said they are quite concerned about it and have now decided they will test me for genetic cancer after all. I'm so annoyed about that, it's still the same family history i had last year when i was worried but now they decide it's something to worry about.  Just have to wait for a full body scan now but they are trying to rush it through so I'm assuming they highly suspect cancer. They did have those serious, grave faces on when they spoke to me.  I only went back to work in January after 10mths off,... this can't be happening to me again!!  I am keeping busy, my work load is huge and i don't have time to dwell on anything else. I also have the MacMillan  Murder Mystery evening next week to plan and look forward to.  Thank again for your reply x ",
      "MessageIndex": 2,
      "PostDate": "30/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125912/suspicious-cells",
      "Title": "Suspicious cells"
    }
  ]
}