{
  "AuthorID": "Pussycatgirl",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pussycatgirl",
  "Posts": [
    {
      "AuthorID": "Pussycatgirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pussycatgirl",
      "Content": "Hi cords thanks so much for sharing your experience. Its very reassuring the details of after the op. I had lots of thoughts about how i feel it will impact my image of myself. I decided my breasts dont define who i am so taking those positive thoughts into the op. However im also aware reality sucks so i wont know if i will still feel that way after the op! Yeah im looking for nice mastectomy bras too!  Im with you will look at recon later just want to get rid of this and get on with getting better. Thanks again for all the info good luck with everything hugs Helen xx",
      "MessageIndex": 6,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138012/having-a-mastectomy",
      "Title": "Having a mastectomy"
    },
    {
      "AuthorID": "Pussycatgirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pussycatgirl",
      "Content": "Hi everyone. I was diagnosed with stage 2 breast cancer on 1 august. Ive had a lumpectomy and 2 nodes removed but they found a tiny amount of non invasive cancer cells. So had another op last week and again they found more non invasive cancer cells. Ive pretty much decided to now have a mastectomy and would really like to hear your experiences in this area. I dont need any more nodules removed and they only found a tiny bit of cancer in the first one. So im counting myself very lucky indeed!! Thanks guys xx",
      "MessageIndex": 0,
      "PostDate": "15/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138012/having-a-mastectomy",
      "Title": "Having a mastectomy"
    },
    {
      "AuthorID": "Pussycatgirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pussycatgirl",
      "Content": "Hi jo thanks for sharing your story it really helps. Yeah consultant said i could have a third lumpectomy and take the chance or have the mastectomy knowing they may not find anything. Im sorry to hear you were HER2 + im HER2 - so count myself very lucky. Ive found the strain mentally just awful waiting for each result hence why im not going for the third lumpectomy. It it what it is. Good luck with everything hun hugs Helen xx",
      "MessageIndex": 5,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138012/having-a-mastectomy",
      "Title": "Having a mastectomy"
    },
    {
      "AuthorID": "Pussycatgirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pussycatgirl",
      "Content": "Thanks Lennie01 the more stories i hear the more comforted i get thanks for sharing Helen x",
      "MessageIndex": 17,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138012/having-a-mastectomy",
      "Title": "Having a mastectomy"
    },
    {
      "AuthorID": "Pussycatgirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pussycatgirl",
      "Content": "Thanks guys, im or and pr positive and her2 negative which im told is good. Ive been told if i have to have rafiotherapy it could damge a reconstruction plus there will be a delay in have the mastectomy as i need to see plastic surgeons. So i decided to wait and just have the mastectomy X",
      "MessageIndex": 4,
      "PostDate": "16/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138012/having-a-mastectomy",
      "Title": "Having a mastectomy"
    },
    {
      "AuthorID": "Pussycatgirl",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/pussycatgirl",
      "Content": "Hi C I had my mastectomy 2 weeks ago today. I was a day patient so had to go back last week to have it drained and will again next monday. Im still pretty exhausted after small tasks but it was my third op in 8 weeks as had 2 lumpectomys. Dont worry bout feeling tired be gentle with yourself and take one day at a time. Definately check your temperature just incase of infection. Cold and shivery could be shock after the op but could be infection. You can get other strong painkillers but they do have side effects paracetamol is working for me. Anyway good luck on your journey and take care  Helen xx",
      "MessageIndex": 6,
      "PostDate": "11/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139806/fatigue-and-shivers",
      "Title": "Fatigue and Shivers"
    }
  ]
}