{
  "AuthorID": "RACHELLx2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rachellx2",
  "Posts": [{
    "AuthorID": "RACHELLx2",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rachellx2",
    "Content": "Your cousins GP will be a good start maybe write your concerns you have listed and send to GP then make a double slot to discuss when thay have had a chance to digest points tell them you will be making an appointment so they prepare for your questions, is your cousin going to specialist cancer hospital or is it just bog standard general hospital , their are specialist cancer hospitals around the country birmingham womens, london etc . you could also see if thier are NICE guidelines for your cousins conditions , also is thier a nurse specialist who can advocate on your behalf for the blood disorder and also breast cancer specialist nurse get them on board , you can seek out advocay services in your area who will take some of the pressure off, patients health councils etc, speak to somebody from the specialist team dealing with the blood disorder or better still get GP to fax for urgent opnion. You and cousin have to be your own research get your cousin to go to libary and research I have a very rare condtion that i diagnosed after CA cervix and requested breast cancer sceening which subsequently caught my breast cancer earlier (im 40 not due for screening until 50) if I had not done internet resaerch and been in contact with specialists via e-mail in USA , and web sites I would not have diagnosed my condtion told the Consultants got on the correct screening and may be seriously ill now. Remember USA have more people to research on so may be more info on your cousins condition, but be careful make sure from specialist web sites not somebody trying to flog u something p.s your cousins lucky to have somebody looking out for her , we all need our living angels and you r your cousins.",
    "MessageIndex": 2,
    "PostDate": "09/06/2009",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10937/help-cousin-with-bc-denied-chemo-and-radiotherapy",
    "Title": "Help! Cousin with BC denied chemo AND radiotherapy!!"
  }]
}