{
  "AuthorID": "racheinderbys",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/racheinderbys",
  "Posts": [
    {
      "AuthorID": "racheinderbys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/racheinderbys",
      "Content": "Thanks for the reply, Little My (love the name btw, an important part of my, and now my children's, childhood!) I certainly agree that Denmark (and Scandinavia in general) is a friendly, open society and we all enjoyed the holiday tremendously. We would like to go back - or to other parts of Scandinavia; we had a lovely holiday in Stockholm before we had children and it would be great to show them Sweden. Also we would all like to see the Northern Lights sometime. I know what you mean about the people at the gym, but I did find the people in Denmark, more than averagely good-looking, or perhaps it is just the general self-confidence and lack of defensiveness about their bodies.  I also agree about children not being naturally fearful, only inquisitive, but I suppose the embarrassment is my own...mind you my Danish is VERY limited!",
      "MessageIndex": 2,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52783/relatively-trivial-query-about-swimming-pool",
      "Title": "Relatively trivial query about swimming pool"
    },
    {
      "AuthorID": "racheinderbys",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/racheinderbys",
      "Content": "Hi all, I am new here, but \"old\" in cancer terms, i.e. I had my surgery 4 years ago and rarely think about it now. I know that my question is trivial by comparison with those of you who are still going through treatment. But I had an incident the last week which I wanted to discuss with others who have had mastectomies. We've been on holiday in Denmark, where on the last day we decided to go swimming in the big public pool as the weather was not great. The rule there was that you had to have a nude shower before going into the pool. This is quite explicit and clear in the (bilingual, illustrated) signs. There did not seem to be any private showers and of course, being Scandinavian, all the other (extremely attractive, tanned all over) women and girls were showering naked. But apart from close family and my medical staff, no-one else has seen my post-mastectomy top half. Not that I was exactly flaunting it beforehand, but in such circumstances I wouldn't have bothered. I did not want the many children to be scared by the single-breasted woman.  In the end I just showered with my costume on,  making sure I soaped all the relevant areas. What would you have done? Does anyone have experience of living in Scandinavia and know what the attitude to the post-mastectomy body is? I found Denmark a friendly country, but they did seem to be the \"beautiful people\".",
      "MessageIndex": 0,
      "PostDate": "27/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52783/relatively-trivial-query-about-swimming-pool",
      "Title": "Relatively trivial query about swimming pool"
    }
  ]
}