{
  "AuthorID": "Rach12",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rach12",
  "Posts": [
    {
      "AuthorID": "Rach12",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rach12",
      "Content": "Thanks for the replies.  I'm off the exercises for the rest of the weekend as the fluid built up again and actually burst this morning which was like your waters breaking but from under your armpit....  It is slowly starting to build up as I can feel it.  Hoping that my body will start to realise that it needs to absorb the fluid else where.",
      "MessageIndex": 4,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113213/axillary-node-clearance---1-week-on-feeling-worse",
      "Title": "Axillary node clearance - 1 week on feeling worse"
    },
    {
      "AuthorID": "Rach12",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rach12",
      "Content": "Hi, this is my first post. I've been following for a few weeks now and it's a great source of info and support. After having a lumpectomy and node bioposy 6 weeks ago (only got one node which was positive) I have had an axillary node clearance last week. I've felt more in pain as the days go by instead of less.  I had fluid drained off the swelling 2 days ago (not infected) I'm struggling to do the exercises as its so painful and really trying hard not to worry about developing  lymphademea. Got another week till next lot of results. I'm feeling like it's (C) now becoming a permanent fixture in my l Any shared post op experiences would be welcome ",
      "MessageIndex": 0,
      "PostDate": "10/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113213/axillary-node-clearance---1-week-on-feeling-worse",
      "Title": "Axillary node clearance - 1 week on feeling worse"
    }
  ]
}