{
  "AuthorID": "reddi",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/reddi",
  "Posts": [
    {
      "AuthorID": "reddi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/reddi",
      "Content": "(Ack! I wrote so much!)",
      "MessageIndex": 83,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156458/may-diagnosis-group",
      "Title": "May diagnosis group"
    },
    {
      "AuthorID": "reddi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/reddi",
      "Content": "Hi Israel! The waiting is the worst part. And now that things are kicking into motion, I feel short on time to both prepare and relax (SNLB tomorrow, then chemo beginning Monday next).  Hope your radiotherapy and hormone therapy go super smoothly!",
      "MessageIndex": 86,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156458/may-diagnosis-group",
      "Title": "May diagnosis group"
    },
    {
      "AuthorID": "reddi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/reddi",
      "Content": "Like Israel, I just spotted this discussion, too. Slowly catching up, but thought I'd join the journey with the other Maybies. My diagnosis was made on 2 May -- bilateral breast cancer, different phenotypes in each breast.  I felt a lump in my left breast on 3 ApriI in my self exam, went to GP on 4 April, and got referred to the Breast Clinic 18 April per the lovely NICE guidelines. They conducted a biopsy on the lump -- 1.5cm self-contained lesion which US and mammogram suggested would be benign, but it wasn't. Instead it turned out to be a mucinous lesion, ER+ (8), PR+ (4), HER2-. Radiographer saw microcalcifications in the right breast that were suspect, so I went back on 24 April for a mammogram-guided vacuum biopsy of 2 sites in right breast. One is invasive ductal cancer (IDC), the other is DCIS/LCIS. The IDC is ER+ (8), PR+ (6) and, after FISH, HER2+. There was a bit of delay to get my MRI done and reviewed, but it didn't show macroscopic evidence of cancer elsewhere in the breast tissue or lymph nodes. One lymph nodes was enlarged but biopsy came back benign.  I'm now scheduled for bilateral sentinel lymph node biopsy on 19 June to see if there's any microscopic cancer in the nodes.  I've also got my pre-chemo MUGA heart scan on 21 June, with chemotherapy starting maybe week of 2 July, possibly earlier, possibly later, depending on how quickly the team can review the SLNB results. We'll also get results of my test for BRCA1, BRCA2, or PALB2 mutations around end of July to fold into the plan and post-treatment monitoring. At times, things have seemed to be moving super slowly, but now things are kicking into gear. I'm a planner, so I've got everything lined up -- but work is going to be the big question. (I'm self-employed, as is my husband, which may prove somewhat complicated.) The treatment plan feels like the kitchen sink: neoadjuvant chemotherapy (8 cycles FEC T + Herceptin/Perjeta), then surgery TBA in January(?) (it could be 2 mastectomies and axillary dissection, or 2 lumpectomies -- we don't know yet), then adjuvant radiotherapy and hormone therapy. I was super happy to hear I'll be getting Perjeta -- potential fx sound tough, from my read of the boards, but the results from the clinical trials were so very good, and I think of the right breast IDC as the stealthy, evil one.  Like Israel, it's really nice to find people going through this at around the same timeline. Although we've all got different diagnoses, treatment plans, and responses, it's incredibly useful to hear all these human, emotional experiences, to round out my understanding beyond the informational pamphlets and journal articles. Thank you!",
      "MessageIndex": 82,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156458/may-diagnosis-group",
      "Title": "May diagnosis group"
    }
  ]
}