{
  "AuthorID": "Reemee",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/reemee",
  "Posts": [{
    "AuthorID": "Reemee",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/reemee",
    "Content": "Hi Leen, sorry to hear you've been diagnosed I was diagnosed on 17 th dec mine too was directly behind my nipple I was told I could have a wide local excision or mastectomy plus sentinal node biopsy & dont think it actually sank in as I felt I was coping very well & everyone around me told me so..... But within a couple of days my head was crammed with questions, why can't they just take the lump? Why lose my nipple? I'm definately not coming out with half a boob, or I want immediate construction .... Telling my husband, \"no way am I letting you see my scar when I'm home\" I was awful!!! But truely once I'd got my head round the news & started to think more clearly/rationally I opted for mastectomy. It helped thatmy BC nurse showed me pics of reconstuction done at my hospital by same surgeon, & that really helped a make my decision.   I was back home same night showing off my \"war wound\" to my daughters & hubby, & anyone else, friends that visited. Seriously you just want to know they getting rid of the little **** I know I have a long way to go yet and that every person is different & we will all follow different paths in our treatment, but you are in a good place here, I only joined a couple of days ago, but already have had amazing support....just wised I come here from beginning I know I would have had the support & info I needed. Don't get me wrong my kids (all grown ups) & hubby been amazing but it's great to find other people going through same! Sorry for such a long post, I do tend to go on! Btw I havent had a single blood test to date, which I too thought odd, but have to have one next week before my CT scan.  wishing you a speedy recovery after your op, take things easy afterwards! Lots of hugs, Marie x",
    "MessageIndex": 10,
    "PostDate": "21/02/2015",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90182/newly-diagnosed-invasive-ductal-carcinoma",
    "Title": "Newly diagnosed invasive ductal carcinoma."
  }]
}