{
  "AuthorID": "Rhonz",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rhonz",
  "Posts": [
    {
      "AuthorID": "Rhonz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rhonz",
      "Content": "Just back from the hospital to get my Portacath fitted - with sedation - piece of cake. I was awake but I really can't remember the process now - I know I had my face covered and I asked them not to tell me what they were up to - I had already read the process online. When I got back to my room I dozed until the sedation wore off and now I am home - been out for a walk and now catching up on my emails ! My neck is sore and I have 2 dressings one on the port itself and one over the stitches in my neck - neck a bit stiff but all ok. I know the NHS are not that keen on offering these and I am private but I would certainly not be put off by the process if you got sedation - really wouldn't fancy it without - I would worry that I might panic Happy to answer any questions - first chemo using it is Monday R",
      "MessageIndex": 33,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10914/portacath",
      "Title": "Portacath"
    },
    {
      "AuthorID": "Rhonz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rhonz",
      "Content": "hi - I have a portacath and I think its probably a good idea particularly if you need herceptin to follow as I did. I have finished my chemo and had a horrid time and I am sure my veins wouldn't have held up a cannula - Mine was fitted in October and will come out next April when I complete my herceptin course - really looking forward to that day !!! to answer your qustions though :-   1) the surgeon who fitted it asked me where I wanted it to go so mine is on my right hand side (tumour was left) under my bra strap. The scaar is about an inch long. I don't worry about scars myself not bothering to hide them from anyone - they can ask or not .  I wear strappy tops and halter necks without bothering - there are folk with way worse scars than that !   2) it is a local and I opted for a sedative also - the sedative is really quite strong so whilst technically you are awake you are completely away with the fairys ! I could hear what was going on but didn't bother me one little bit !! getting it out I understand I won't need the sedative cause there is less going on - ie they are not trying to enter your jugular vein ! so I think that will be fine. I know it's a worry but all in all a good investment if your veins are tired or absent, it is not sore once it settles down - I get Amitop gel for the days I get herceptin /chemo days which numbs the site a bit to make sure there is no pain when they access the port. if they don't offer ask as it can be a bit sore without it   Hope this helps - good luck - whatever you decide it will be the right decision xx",
      "MessageIndex": 36,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10914/portacath",
      "Title": "Portacath"
    },
    {
      "AuthorID": "Rhonz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rhonz",
      "Content": "hi - I think I am having one fitted on Thursday - I say I think because the schedule of treatment from the hospital says a portacath fitted but the info they sent was about a Hickman Line - sounds like a portacath is easier to live with albit a bit of ouch sore every three weeks ! I live miles away from the hospital so am hoping that me /my OH can do any necessary cleaning if required.  ",
      "MessageIndex": 31,
      "PostDate": "13/10/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10914/portacath",
      "Title": "Portacath"
    }
  ]
}