{
  "AuthorID": "Rose2018",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
  "Posts": [
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi Polly, good to know you’re feeling up to posting :) As far as I know any exercise that gets your legs moving and your heart pumping is good. It certainly sounds like you’re usually active! I hope you get hold of someone and get sorted out tomorrow. Rose",
      "MessageIndex": 8,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159058/surgical-stockings-and-breast-nurse",
      "Title": "Surgical stockings and breast nurse"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "I’d probably call the nurse, I was advised I could take mine off that night but it will depend on the risk level, I went out for a walk on the same evening but I’d only had a lumpectomy and sentinel nodes taken out and I’m 37, fit and very active and have perfect blood pressure. Your Mum’s Nurse will know best as she will know her medical history.",
      "MessageIndex": 1,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159058/surgical-stockings-and-breast-nurse",
      "Title": "Surgical stockings and breast nurse"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Morning, I was getting over one when I had mine. I still had a bit of a tickly cough and a sore throat. Three people checked my chest before they went ahead so they seemed concerned enough about it. My chest sounded clear so I had the op but they might delay it if it’s still causing noises in your lungs. I’d take the advice and get to your GP to see if they can help you get it cleared up before your operation.",
      "MessageIndex": 1,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159831/the-op-and-a-cold",
      "Title": "The Op and a cold"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi Pointer, It might not be the same for you but the doctor who took my biopsy and a nurse were in the room with me. Bring someone with you if you can, if not bring a notebook. I forgot half of what they told me and had to ask my sister who was there with me. I’m not saying that with any assumption, if it does turn out to be benign you’ll probably still not be thinking straight. You could ring them and ask, it’s not a silly question. Don’t worry about reacting however you feel like reacting, I’m sure they’ve seen every possible reaction and they certainly won’t judge you, they will offer support. You’ll have been running on adrenaline for the last few weeks so don’t beat yourself up if you have a “moment”. Wishing you good news x",
      "MessageIndex": 2,
      "PostDate": "17/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159698/results-day-looming",
      "Title": "Results day looming"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "I’m in my 30s, I had only heard of one other woman my age that I knew who had it. I’ve been really open about mine and I found that people started talking about it when I did. I hadn’t even known that my paternal aunt had BC many years ago, I wasn’t previously aware of any blood relatives having any form of cancer except for my grandmother who got lung cancer in her 80s after smoking like a train all of her life.  I’ve heard now of a few younger women in my workplace who have come through it as well as friends of friends. My best friend in work has a sister who was diagnosed at the same age as me and he had never mentioned it previously. I think it’s still a bit taboo and I guess it’s also that some people just want to keep their diagnosis private, we don’t generally talk about health issues in the UK, stiff upper lip and all that but I think it’s changing as it becomes more and more treatable and once you start talking about it other people seem to too.",
      "MessageIndex": 8,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158257/amount-of-people-with-breast-cancer",
      "Title": "Amount of people with breast cancer"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi Staffylove, absolutely, I’ve had several offers of support and chats from friends of friends, people who I’ve maybe only met once or twice, some I’ve never met. I hope that when I get through this I’ll be able to pay that forward",
      "MessageIndex": 10,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158257/amount-of-people-with-breast-cancer",
      "Title": "Amount of people with breast cancer"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi Betty, yes, unfortunately still stuck here. I’m actually feeling fine but apparently there’s an infection. Only sign was a high temperature. The main problem seems to be my penicillin allergy, they’re having to mess around with different antibiotics until they get one that works and no joy yet. On the plus side the PICC has been so handy and I’m in a room of my own with air conditioning!!",
      "MessageIndex": 219,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi Betty, It went really well, wasn’t scary at all and very quick. I’m feeling slightly nauseous but not too bad. The picc is definitely better now I’ve had it cleaned :) ",
      "MessageIndex": 76,
      "PostDate": "12/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi everyone, question about anti sickness tablets, did anyone find them harsh on your stomach? I’ve had quite bad stomach pain since my first chemo (11th), I stopped taking the anti sickness tablets yesterday and it’s all but disappeared. I’m not sure if it’s coincidence or if it’s linked. Also, has anyone else been getting food cravings? I’ve had really strong ones for scrambled eggs. Rose",
      "MessageIndex": 111,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi Bettie, I did indeed thanks for asking, it’s annoying me a bit so I’m going to ring today to check that the pain I’m getting from it is normal (bit stabby and the dressing is making me itch). ",
      "MessageIndex": 50,
      "PostDate": "08/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi all, just popping in to say hello. I had my lumpectomy on the 25th May. I’m getting my picc in on Thursday to start FEC on the 11th. I’m 37, 29mm, oestrogen, progesterone and HER2 positive with no node involvement. Looking forward to getting started so I can get finished!",
      "MessageIndex": 17,
      "PostDate": "03/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hey everyone, I’ve just read about some frozen vegetables being recalled in the last few days because of a listeria outbreak. Info is on the Food Standards Ageny website. Just thought I’d give a heads up to anyone with low immunity x",
      "MessageIndex": 45,
      "PostDate": "06/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Morning all, I’ve been in hospital with an infection since Thursday although the only real symptom was a temperature. They’re still trying to figure out the source of the infection and I’m still getting temperature spikes. I’ve had a really sore stomach, it took them three days to get me some pepto which I’m not particularly happy about. I only got it when I burst into tears because I couldn’t eat my breakfast. The nurses have been pushing to get something prescribed. They suspect it wasn’t done because it can impact the bloods.  Ive never had indigestion or heartburn so I’m not entirely sure that’s what it is. It’s only in one very specific area, not moving up my throat or anything. Has anyone heard of stomach ulcers as a result of chemo or any of the steroids / anti nausea drugs? I’m wondering if that might be the cause of the infection.",
      "MessageIndex": 190,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "I didn’t take mine regularly and only realised I was ill when I’d felt sweaty. By that time my temperature was 38.5, I’ve been in hospital for a week now with no other symptoms apart from feeling suddenly tired but my blood has had high levels of inflammatory markers and my temperature has been spiking up to the 38.5 for most of the week (coming down now!) They kept asking me if I had a sore throat, cough, pain passing urine etc but there’s nothing. They said about half the time they don’t find a source of infection. I’d originally been told not to bother checking temperature unless I felt ill, I guess because they don’t want us turning into hypochondriacs but I’ll be keeping a closer eye on it for the rest of my chemo.",
      "MessageIndex": 3,
      "PostDate": "25/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164814/temperature",
      "Title": "Temperature"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Thanks Lesleyhelen, I did question the three month timescale with the first oncologist and he was adamant that it had to be that long, the second was adamant that three weeks was long enough, he was originally telling me I could stop it as soon as the PICC was taken out so I’m not sure going back to either would do anything other than end up with me going round in circles :-/  I’ve asked two friends who are pharmacists and they’ve said it won’t do any harm to be on it for the longer period unless it’s impacting on my kidney function (no symptoms to suggest it is) but aren’t sure on the logic for the two time periods. I don’t know if I should be asking to be referred to some sort of specialist or getting another ultrasound or whatever, it seems that because it’ a side effect it’s fallen between the cracks.  Both oncologists are in the same hospital so actually ringing the breast care nurse is a good idea I hadn’t thought of, maybe they can mediate!",
      "MessageIndex": 2,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172498/picc-related-thrombosis-and-clexane-forte",
      "Title": "PICC related thrombosis and Clexane Forte"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Thanks for the reply, I spoke to the breast cancer nurse which didn’t help so I went to my GP. She agreed with the second consultant and told me to stop as she was worried about me bleeding out because it was such a high dose and I’m getting more active. I’m still getting a nipping feeling and the skin above is still discoloured so I’ve made another GP appointment, I’ll ask for a referral to ultrasound to see if it’s still there or if I’m imagining things!",
      "MessageIndex": 4,
      "PostDate": "17/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172498/picc-related-thrombosis-and-clexane-forte",
      "Title": "PICC related thrombosis and Clexane Forte"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Bluebell, my GP told me I was very lucky to not to have had a stroke, sorry to hear you ended up with the PE :-/ ",
      "MessageIndex": 10,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172498/picc-related-thrombosis-and-clexane-forte",
      "Title": "PICC related thrombosis and Clexane Forte"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "PS what dose is your husband on Jill? I was on 120 clexane forte ",
      "MessageIndex": 5,
      "PostDate": "17/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172498/picc-related-thrombosis-and-clexane-forte",
      "Title": "PICC related thrombosis and Clexane Forte"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi :) So my GP did a blood test for me yesterday to check the levels of D-Dimer which indicates if you might have a clot. The levels are low so it looks like it’s gone and that’s given me reassurance about stopping the Clexane.",
      "MessageIndex": 9,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172498/picc-related-thrombosis-and-clexane-forte",
      "Title": "PICC related thrombosis and Clexane Forte"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Ha! I know where you’re coming from, I had sepsis for three weeks, no idea how serious it was until I got out of hospital. You don’t imagine that what they use to treat the cancer can cause life threatening side effects, especially if you feel perfectly well and fit at diagnosis. I thought I’d breeze though it, eh, no lol!",
      "MessageIndex": 12,
      "PostDate": "21/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172498/picc-related-thrombosis-and-clexane-forte",
      "Title": "PICC related thrombosis and Clexane Forte"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi everyone, I’ve got a bit of a problem and I’m not sure where to go for advice. I developed a clot in my armpit which is thought to have been caused by the PICC (missed twice by the hospital when I told them about the symptoms but that’s another story!). I’ve been self injecting with high dose Clexane Forte since they found it. I should note it’s not a “full” clot as in it’s only partially blocking the vein at a junction. My oncologist told me I’ll have to continue taking the clexane for another 3 months (PICC removed last week as I had my last chemo). Fine, annoying but fine. Except I then saw the other oncologist who is the person overseeing my radiotherapy who told me to stop talking the clexane three WEEKS after my last chemo. I had confirmed the timescales with both oncologists so I’m very sure of the two significantly different timescales they’ve given me. I’m still getting symptoms from the clot (swelling and sometimes pain) so while I’m quite happy not to have to keep injecting myself every day I don’t particularly want to risk an embolism! If anyone who has been on Clexane for a clot caused by a PICC reads this could you tell me how long after you continued taking it and for anyone else, any suggestions as to where I should go for a third opinion?",
      "MessageIndex": 0,
      "PostDate": "30/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172498/picc-related-thrombosis-and-clexane-forte",
      "Title": "PICC related thrombosis and Clexane Forte"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hi there, I’m just replying to let you know I had pain in my collarbone and up my neck which turned out to be a small blood clot in my armpit. I didn’t have any swelling or redness which is a sign of a clot because it was so small. Tamoxifen can increase your risk of clots so that’s a possibility. They found mine with an ultrasound scan. I know my hospital have what they call “patient led referrals” which is basically contact the breast care nurses if you have any concerns in future. I know they told me that around my time of diagnosis but it had completely gone in one ear and out the other at the time. Give them a ring, I’m sure they’ll be able to advise you.",
      "MessageIndex": 1,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181425/two-years-since-chemo-what-now",
      "Title": "Two years since Chemo what now"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Oh and the clot wasn’t one they were particularly worried about, I had to have clexane daily for three months but once they knew I was on that any concern the doctors had seemed to disappear.",
      "MessageIndex": 2,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/181425/two-years-since-chemo-what-now",
      "Title": "Two years since Chemo what now"
    },
    {
      "AuthorID": "Rose2018",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rose2018",
      "Content": "Hclare, I was told 4-6 weeks after surgery for chemo to allow healing after the lumpectomy, I’d imagine RT would be similar Rose",
      "MessageIndex": 13,
      "PostDate": "06/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    }
  ]
}