{
  "AuthorID": "Rosemary B",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosemary-b",
  "Posts": [{
    "AuthorID": "Rosemary B",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosemary-b",
    "Content": "Hi Rachel, Although I have not had breast cancer myself - a few scares, but thankfully all ok - but my s-i-law and 3 other close family members have had various forms of b.c. The reason I've decided to reply to you is to do specifically with the possible side effects of Tamoxifen. (I posted this information a month or two ago, but it is under  a \"Radiotherapy\" thread and also a \"Tamoxifen\" thread in this Group) . I don't know if you are on Tamoxifen Rachel, but I think Tina may have hit the nail on its head when she says she now suspects possible side effects from Tamoxifen. My sis-in-law was put on Tamoxifen before she'd even had surgery, chemo or radio and was finding it hard to cope with. She likes to in as \"in control as possible\" as so did some research on Tamoxifen. What she discovered was astounding and I'm hoping the information may help some of you. Her worst side effects were the dreadful weariness, feeling sick and terrible joint pains and the inability to \"get going\" first thing in the morning. She found that Tamoxifen is made by several different manufacturers and that most of them use \"fillers\" to \"pad out\" the Tamoxifen. It appeared from her research that it was the fillers that were doing the damage / causing the bad side-effects - NOT the Tamoxifen itself!  So she looked around and found that \"Boots\"own brand Tamoxifen does NOT contain fillers and there may be another brand too that does not. Ironically she'd just had her prescription filled at Boots, but they'd given her another brand of Tamoxifen, so she went back and discussed what she'd discovered with the pharmacist. Long story, but they ordered in their own brand and within 24 hours of swapping the brand of Tamoxifen for one that does NOT contain \"fillers\", her overwhelming weariness and aches and pains had almost gone. She was able to get out of bed in the morning as she'd always been able to, prior to being on the Tamoxifen, and was astonished at the difference. My s-i-l is now 20 months down the line and she's still on Tamoxifen, but ALWAYS makes sure she has a brand without the \"fillers\", and I'm happy to report that she is feeling very much better. 2 of the 3 other close family members have also changed their brand of Tamoxifen and are also saying that they too are feeling less exhausted and their aches and pains and nausea are less! Rachel, Tina  and any others of you who are experiencing joint pains and are taking Tamoxifen, maybe you could ask your oncologist about this, or your breast care nurse, or your local pharmacist, as it could be the \"fillers\" you're having a reaction to, not the actual Tamoxifen. Obviously everyone is different and some do not have side effects, whilst others do not. Tamoxifen has been proven to be an excellent drug for bc and if all one has to do is \"change the brand and not the drug\", then surely it's worth looking into. I hope this has been of some use to you. Hoping you soon have this sorted out. Love, Rose x",
    "MessageIndex": 4,
    "PostDate": "05/04/2012",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48715/aching-joints",
    "Title": "Aching joints????"
  }]
}