{
  "AuthorID": "RosemarieC",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosemariec",
  "Posts": [
    {
      "AuthorID": "RosemarieC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosemariec",
      "Content": "Hi Carolyn, When the oncologist assured me with surgery there would be no cancer left and it would be down to Chemo I was fine I coped well and so did the family. I have 4 kids and 7 grand-Children and 2 great grand babies and I have my 2 sisters and have friends I keep in touch with from time to time so I have many around me which I'm thankful to have! I had Ductal Carcinoma and the hospital said it's thankfully a very treatable cancer especially with surgery so that calmed me. The drug I'm going to be on is called and sorry if I don't spell it right (Carboplatin) it's a drug mainly used for primary cancers and was told I won't lose my hair but it will become very very thin and I have super thick hair so I'll see what happens they said I can feel super nauseous and possibly lose weight with this drug so I'm going to try and eat a everyday properly. I've never been one to put weight on which I've always to done to metabolism.  Rosemarie - xxx ",
      "MessageIndex": 4,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/130006/nervous-of-my-first-chemo-treatment",
      "Title": "Nervous of my first chemo treatment!"
    },
    {
      "AuthorID": "RosemarieC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosemariec",
      "Content": "I'm pretty scared of starting chemo and the side effects. I watched my daughter in laws mum have breast cancer had a lumpectomy and then had chemo only to find out her cancer was advancing so she went through hell with surgeries more treatments and she passed away the week after Christmas 2 years ago I always think of her and that's how I'll end up though I know everyone is different. Luckily mines was caught early enough. Had a lumpectomy 3 weeks ago and now starting chemotherapy for 6 weeks every Monday. I think what I'm scared of is the side effects I've seen people lose hair, vomiting and lose so much weight and I just don't want that to be me at all. I go on Monday to start treatment and come back Tuesday and Wednesday so I'll see how it goes! And then I come back the week after next week. x ",
      "MessageIndex": 0,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/130006/nervous-of-my-first-chemo-treatment",
      "Title": "Nervous of my first chemo treatment!"
    },
    {
      "AuthorID": "RosemarieC",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosemariec",
      "Content": "Hi Carolyn, Well I actually asked that question myself as they took the cancer out with surgery but what they told me was that without chemo there is a very high change of the cancer returning now they said it's down the type of cancer I had so I guess I could understand that. Thanks I'm happy to have made the 70 milestone I've got many years ahead of me I'm sure!  The oncologist said it was 2A stage cancer so it was bigger than 2cm but not as large as 5cm if I can recall it also hadn't spread yet to the lymph nodes but it was about to do was caught on time. I had the chemo today actually went okay it was an open area room so I was sitting next to people, I was actually sitting next to a woman about the same age and was given a terminal breast cancer diagnosis but she's having chemo to try and extend her life. My heart went out to her but she was so positive about it she told me she's at peace with her self. She said she done all she wanted to in life like Get married, have children, see them grow up  , have grandkids and buy a little cottage and live by the coast so she was happy with what she had and accepted this was her fate! I drank water and eat dinner just now I'm feeling fine long may that last!  Rosemarie x",
      "MessageIndex": 6,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/130006/nervous-of-my-first-chemo-treatment",
      "Title": "Nervous of my first chemo treatment!"
    }
  ]
}