{
  "AuthorID": "Rosie75",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosie75",
  "Posts": [
    {
      "AuthorID": "Rosie75",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosie75",
      "Content": "Hello, sorry to hear your news. I was recently diagnosed with high grade DCIS and had surgery 4 weeks ago. So far, based on what I’ve been through, i think the diagnostic stage is worse than the surgery. My brain went crazy and to all sorts of awful possibilities. It took  3 months for me to get final diagnosis and you realise there’s always a caveat when you get good news that some other test will be due. So, do your best to stay strong now and try to live in the moment of what you know to be true, not what could be. i had 9cm dcis removed plus 4 lymph nodes which were clear. I do need further small op to get clear margins and radio next. Given i’m large, they did a reduction on my good side (which i’m actually quite enjoying!) and matched the other side up with some crazy rearranging and lipo. my recovery was hampered by an allergic reaction to the glue but good now and it was only the first few days which were particularly painful. I should stress though that I feel a million times better now than when I was where you are just waiting on results and not knowing so hopefully things will improve! Still a road to travel but further down it every day. Good luck! x",
      "MessageIndex": 7,
      "PostDate": "19/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168236/newly-diagnosed-with-high-grade-dcis",
      "Title": "Newly diagnosed with High Grade DCIS"
    },
    {
      "AuthorID": "Rosie75",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosie75",
      "Content": "Thank you, lots of great advice. I start 5 weeks of radiotherapy tomorrow. Sadly runs right through Xmas and into January but could do with this stage being over with so happy to finally be starting. Good luck to everyone else starting soon.  X",
      "MessageIndex": 39,
      "PostDate": "28/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170852/november-2018-radiotherapy-thread",
      "Title": "November 2018 Radiotherapy Thread"
    },
    {
      "AuthorID": "Rosie75",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosie75",
      "Content": "Thank you! So helpful to hear this. Guess I need to wait till my appointment on Monday to see what they say is possible first but think my initial horror at the thought of reconstruction has eased!  Xxx",
      "MessageIndex": 12,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10810/advice-on-reconstructive-surgery-and-reduction-of-good-breast",
      "Title": "Advice on reconstructive surgery and reduction of good breast"
    },
    {
      "AuthorID": "Rosie75",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosie75",
      "Content": "Hi Moresleep,  thank you so much for your reply, it's given me some positivity that there may be light at the end of this! A few more questions if you don't mind! How long were you out of action for following surgery? I'm quite concerned as to the impact on my job, and income... Do you actually have any feeling in your new boob or is it that it feels the same to touch? Do you now feel physically recovered to do all that you did before? Last one, if you've just had a single reconstruction, I assume if at a later date your other side got DCIS they would need to reconstruct in a different way? I'm just weighing up whether given how big the op is  if it's worth considering having both done. Sorry for all the Qs! Best of luck with your ongoing recovery.",
      "MessageIndex": 9,
      "PostDate": "09/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10810/advice-on-reconstructive-surgery-and-reduction-of-good-breast",
      "Title": "Advice on reconstructive surgery and reduction of good breast"
    },
    {
      "AuthorID": "Rosie75",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rosie75",
      "Content": "Hi I'm going through this too. Large area of high grade DCIS and through a very drawn out diagnostic period they are now floating possible mastectomy as opposed to lumpectomy. I am 34FF so some room for movement... i'm finding it hard to find good information on how people who have been through different reconstruction options feel about them a few months/ years after surgery. They all look like terrible options right now! do you retain any feeling/ sensation at all? Has anyone had lumpectomy and reduction and not had to have nipples removed? How do partners honestly feel about the end results? its such an awful decision to be faced with. MRI today may mean some options are outwith my control anyway...",
      "MessageIndex": 7,
      "PostDate": "03/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10810/advice-on-reconstructive-surgery-and-reduction-of-good-breast",
      "Title": "Advice on reconstructive surgery and reduction of good breast"
    }
  ]
}