{
  "AuthorID": "Rover600",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rover600",
  "Posts": [
    {
      "AuthorID": "Rover600",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rover600",
      "Content": "Hi George & Jackie, Glad you are still getting your meds. Price differences are crazy so whilst for patients its often disappointing or unsettling to be moved from the brand to the generic and all the psychological effects the changes can bring on - but truly be assured the same active ingredients/molecules are used. For the NHS it is a 'no brainer' to ensure they get the same quality for the best value for money, we like to think the NHS has unlimited funds but I think we all read daily how far in debt they are.   Good luck to you.",
      "MessageIndex": 31,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75972/letrozole-manufacturing-problem",
      "Title": "Letrozole manufacturing problem?"
    },
    {
      "AuthorID": "Rover600",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rover600",
      "Content": "What isn't common knowledge is that even the generic manufacturers (of which Sandoz & Teva are) often manufacture most of the market supply it's just 'branded differently. I'm not saying this is always the case but to a lot of patients a change of pack or packaging or even the same identical branded product but as a PI(Parallel Import pack) are perceived as being different when they aren't. I'd certainly discuss different/new symptoms with your team for there is a strong possibility it is nothing to do with the 'different drug' and it's coincidental.",
      "MessageIndex": 27,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75972/letrozole-manufacturing-problem",
      "Title": "Letrozole manufacturing problem?"
    },
    {
      "AuthorID": "Rover600",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/rover600",
      "Content": "Ella, I'm lets say involved in the pharmacy sector (but not a pharmacist) I've checked the main wholesaler's status for Letrozole today (22/5/14). The situation is this: Femara (the original brand) is completely out of stock, I believe it has been for some time. There are generic versions available today - but not Teva brand. Your pharmacist should not have problems getting Letrozole.   Often a brand will all but disappear from the market once its patent expires (10 or 12 years after launch). The reason being is the manufacturer will charge high premiums because they had all the R&D costs etc. So Femara for example the price of it is £84.86 for a 28 pack. The exact same product but as the generic (once a drug goes off patent anyone with a licence can manufacture it as Letrozole) is available at £3.20-£3.26 Most prescriptions are written by the generic name - Whilst patent protected if a prescription read Letrozole or Femara the pharmacy would have to dispense 'Femara'. once 'off patent' if a prescription is written Letrozole any brand of Letrozole can be dispensed, IF Femara was available as the brand a pharmacy would be highly unlikely to dispense you Femara against a prescription written as Letrozole, legally they could but the pharmacy would only be paid the generic £3.26 price despite having had to buy the Femara at £84.86!   Hope this helps",
      "MessageIndex": 28,
      "PostDate": "22/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75972/letrozole-manufacturing-problem",
      "Title": "Letrozole manufacturing problem?"
    }
  ]
}