{
  "AuthorID": "Ruthington",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthington",
  "Posts": [
    {
      "AuthorID": "Ruthington",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthington",
      "Content": "Hi Sarah, Thanks so much for your reply and reassurance about the op. Glad you are doing well yourself :) Yes, I'm having back flap (if that's the latissimus dorsi one?), although having some of the tissue removed from my thighs was certainly something I wouldn't have minded! We looked at the options and I decided this was best for me. I've been told three months wearing a sports bra night and day - how did you/do you find that? Best wishes, Ruth",
      "MessageIndex": 3,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32933/risk-reducing-mastectomy-for-brca-carriers",
      "Title": "Risk-reducing mastectomy for BRCA carriers?"
    },
    {
      "AuthorID": "Ruthington",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthington",
      "Content": "Hi Wardy - thanks for your reply :) The genetics nurse where I was tested (Guys) was excellent before and after I find out the result. You should get the chance to have a really good chat with the nurse and ask all those sorts of questions so you can make a decision to get tested or not, and what it would mean if you didn't. Did they discuss removing your other breast at the time of your first op? I completely understand that you want the peace of mind that removal and recon would bring. Can I ask you, do you have any tips for making life in hospital and immediately at home easier? Ruth :)",
      "MessageIndex": 4,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32933/risk-reducing-mastectomy-for-brca-carriers",
      "Title": "Risk-reducing mastectomy for BRCA carriers?"
    },
    {
      "AuthorID": "Ruthington",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthington",
      "Content": "Hi, I'm looking to make contact with women in a similar situation to me. I'm 31 and in a couple of weeks I'll be having a risk-reducing double-mastectomy and reconstruction. I'm totally healthy and have never had cancer but pretty much every woman in my family has (at an early age) and last year I tested positive for BRCA 2. I'd just like to be in contact with anyone who is going through or has recently gone through this. I know it's the right thing to do for me, but it's daunting. Thanks, Ruth :)",
      "MessageIndex": 0,
      "PostDate": "03/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32933/risk-reducing-mastectomy-for-brca-carriers",
      "Title": "Risk-reducing mastectomy for BRCA carriers?"
    }
  ]
}