{
  "AuthorID": "Ruthy1953",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
  "Posts": [
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "I've just finished my course of 20x rads and had no problems at all.  The staff were brilliant and there were changing rooms which had a second door that opened in to the rad unit.  There were always gowns to put on and I didn't have to lower mine until I was lying on the table.  The staff always made sure my other breast was covered once they had finished lining up the machine so only the one being nuked was uncovered.  I sometimes had only male staff but they were just as professional and efficient.  I was always told what they were doing and why, and how long they would have to leave the room.  There was music playing in the background (it was so hard not to tap my feet!) and pretty pictures on the ceiling to look at.  I had 3 tattoos which are so small it took me ages to find them!  They are just tiny dots, as small as a tiny freckle and will fade over time.  I've no problem having tiny tattoos as I forget they are there.  Maybe the country you live in don't realise what they are doing to you as you deserve to be treated with total dignity at all times. You should talk to one of the staff and tell them how you feel, make them realise they need to change their procedures.  I consider myself very lucky to have been treated at one of the best cancer hospitals in the country where they bend over backwards to help and make me feel as good as I can. My skin has been ok and I've used only aloe vera gel 2 or 3 times a day.  My nipple is feeling a little itchy and has darkened in colour so I make sure I slap extra gel on it!  They told me the rads keep going for 2 weeks after treatment has finished and to keep on using the gel. You are NOT a wimp and have been treated really badly and I feel so sorry for you.  It's bad enough going through the whole cancer s**t without you being treated like this. xx",
      "MessageIndex": 20,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52248/is-rads-always-like-this",
      "Title": "Is RADS always like this?"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hi I never had the metallic taste with my FEC but have you tried pommegranet juice, lemon & lime flavoured water (not fizzy) or any drink that has a strong flavour to cover the metal taste?  Sorry can't be of more help.  Apparently curries are good to eat to get rid of the metal taste! x",
      "MessageIndex": 1,
      "PostDate": "12/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52338/what-to-drink",
      "Title": "What to drink?"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "  I've now finished my 6x FEC chemo's and had cravings for cabbage (why!!), eggs and burgers!  Hosp did warn me I might have them the same as pregnancy cravings but I never had those so wasn't sure what to expect.  It's been 7 weeks since I've finished and all my cravings have gone.  Shame I never had any for ice cream, lol.  My hair went after my 4th chemo (I used the cold cap twice but it didn't work for me) and I had it totally shaved off after number 5.  It's started growing back already and I have soft fluffy hair - I like to think I look like Sinead O'Connor when she was young! Go with your cravings and enjoy them all! x",
      "MessageIndex": 5,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51866/cravings",
      "Title": "Cravings"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hi I've just had the test for the gene, it was a straight forward blood test the hospital did at the same time as my normal chemo blood tests which I'm having for bc at the moment.  As soon as I was told I met the criteria and was offered the test, I accepted immediately as I want to know if I have the gene and how it affects my sons future health and also for my nephew as his mum (my sister) had ovarian cancer.  I felt that's the least I could do for them. I had a very lengthy phone call from a genetics nurse who explained what a positive result could mean - I may have to consider a double mx and having my ovaries removed and my son could be at risk from prostate cancer so he would be checked from 40 upwards.  I also had to complete a very lengthy family history to see if there had been cancer in any one else (there was) and send in a copy of my sisters death certificate.  I've got to wait 9 weeks for the results.  It's opening a bit of a minefield if its positive as I then have to tell my son and nephew and also think about whether to have other operations as they said checks and screening for ovarian cancer weren't very good.  I'm hoping I'm negative and my bc is one of the random ones but who knows.  I felt I had to have the test done for my son's sake as I don't want him being at risk of any cancer and suffering like me and I don't want any of his future children having that risk without us all knowing. For me it was a no brainer, I'd rather know than not know but everyone is different and you may feel you don't want the test.  Whatever you decide is the right decision for you. Good luck xx",
      "MessageIndex": 8,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49361/genetic-testing",
      "Title": "genetic testing"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hi Louise I am 58 and had a WLE in January and as a couple of nodes had cancer cells, am being given 6 FEC chemo's followed by radiotherapy and Letrazole for 5 years.  I was given my figures for whether the cancer will come back again and without chemo, I was told I had a 50% chance it might not come back but with chemo and radiotherapy, there was an 85% chance it might not come back.  My hospital (Marsden) said even at my age I was considered young and would receive every treatment they had.  I want to take everything to try and stop it coming back anywhere else ever.  Have you been given your  figures?  If not, ask for them.  They put all your details in to a special programme that works how your percentage and this might help you make up your mind.  There is a test that can be done to see whether chemo is worthwhile having or not but it depends on the type of bc that you have.  I have a hormone based cancer and this type wasn't suitable for the test.  It might be worth asking your onc about it.  There was an article in the Daily Mail about this test a couple of months ago so you could look it up on line and read about it. Personally I would opt for chemo in the hope that it kills off every stray cell you may have and helps to stop it ever coming back.  Chemo isn't nice but its only for a few months and if it gives you many more years of life, then a few months is nothing. Good luck x",
      "MessageIndex": 11,
      "PostDate": "13/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48921/confused",
      "Title": "Confused......."
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hello Knotofpeace I had a savoury/salty craving as well for a few days and got a huge tub of salt and vinegar Pringles which I enjoyed munching!  I also had a craving for eggs which I don't normally eat but I got myself an egg sandwich yesterday which I really enjoyed and now the craving has gone!  I still get the odd feeling of nausea but it's mild and once I crunch on an extra strong mint, tends to go away quite quickly. I hadn't been given any indigestion tablets but I do normally take one that is prescribed by my GP anyway due to diverticolosis.  However I stopped taking them just before my 1st chemo as they do cause thinning of the hair and I didn't want anything else to increase early hair loss!  I tend to know what foods upset me so am keeping clear of them. I'm now on day 10 and apart from being a little low, feel ok.  I haven't been sleeping much which has left me feeling tired but apart from that, I'm doing ok.  I did have a very small mouth ulcer appear this morning but that seems to have disappeared!  The hospital gave me mouthwash as I've always suffered from gum infections so I have been using it a couple of times a day to try and stop any ulcers coming.  Maybe the mouthwash made it disappear? Most days I've been waiting for various side effects to appear but they haven't yet so I'm hoping that the next FEC will be the same and I'll get through it ok.  Well done on doing so well with yours; there's still hope we will get through it ok! I experienced the same depression after my op in January but didn't think to let anyone know; I thought it was because of the anaesthetic but now I know it was the anti sickness drug; so partly my fault for not letting the hospital know of my reaction. Good luck Ruthy xx",
      "MessageIndex": 5,
      "PostDate": "03/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47529/a-good-fec-experience",
      "Title": "A good FEC experience!"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Well done on your good FEC! I had my first FEC last week and it all went really well.  The nurse warmed my arm with the pack and I didn't feel anything going in at all on any of the drugs.  Did get a funny prickling in the 'nether' regions but that passed in a few seconds and I also felt a little light headed for a day but nothing horrible. The next couple of days went really well for me but I was unlucky in that I experienced a severe reaction to the anti sickness meds which made me really ill.  After reading the side effects of the steroids and talking to the hospital,  I'm one of the few where they cause instant depression, anxiety, panic attacks, crying, etc but at least I know it was the steroids and not the FEC!   Hospital made a note on my records and I will see a doctor about it when I have my second lot of bloods tests, to make sure I have a different type of meds next time.  It did put me in bed for a couple of days but if I hadn't suffered that reaction, I would have got through my first chemo without a problem.  They did stop the nausea thought so they do work really well!  I did feel tired after a few days but I'm pretty sure it was the steroids causing that as well.  Today is day 9 and I feel really good today.  The steroids are out of my system and I feel  'normal' again. It's true what they say, everyone is different and everyone reacts to chemo in a different way.  To anyone who is waiting to start FEC I would say please don't worry too much, go in with a positive frame of mind, cross your fingers and see what happens. Ruthy x",
      "MessageIndex": 3,
      "PostDate": "02/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47529/a-good-fec-experience",
      "Title": "A good FEC experience!"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hi I had all my nodes on my left side removed at the same time as my lumpectomy as the sentinel biopsy done during my op was positive.  Luckily there were only tiny cancer cells in 1 other node. I had 19x nodes taken out in total.  I didn't have any drain, just a huge dressing over my op site.  My arm felt really heavy and numb straight away but this has worn off now I'm 10 months post op and I have just some numbness but the 'feeling' is getting better all the time.  My husband made sure I did all the arm exercises every day from the day after my op and I'm so glad he did!  He also made sure I didn't sleep on the op side for a few weeks by putting lots of pillows and cushions next to me, to stop me rolling over! My arm movement is now 99% and some of the numbness has worn off.  It does take a while for your arm to recover.  I found it took quite a few months before I could use the keyboard and mouse without my arm aching or feeling like I was getting pins and needles.  Whenever I had this feeling, I just shook my arm around for a few seconds and it felt ok.  I still can't carry a heavy shoulder bag on that side for too long or the pins and needles feeling comes back so I wear a cross the body bag now which luckily, is quite trendy!  As I had radiotherapy after my FEC chemo, I try to remember to do some arm exercise every day or I notice my arm and chest area feels stiff.  I've been lucky and haven't suffered from the swelling some people do.  I always make sure I never carry or lift anything heavy with my op arm, always wear long sleeves and gloves when gardening and don't sit out in the sun for too long.  Mostly it's just common sense and it doesn't stop you doing anything - just make sure for the rest of your life that you take care of your arm, be sensible when using it and if you do anything that makes it hurt or ache, stop doing it straight away and use the other arm.  I was also treated at a Marsden hospital and can't praise them enough :)",
      "MessageIndex": 7,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54909/lymph-node-removal",
      "Title": "Lymph node removal"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Good for you, having chemo is a good choice.  I had 6x FEC which I finished last month and whilst it wasn't always pleasant, it wasn't as bad as I expected.  I spent 3 days in bed after each one as I felt so tired I couldn't move but this might be because I'm allergic to the steroids they give you so couldn't take any.  I had a couple of sessions when I was sick but again it wasn't that bad and I always felt fine afterwards.  And I always had about 2 weeks of having loads of energy after each session so went out as much as possible.  I had cravings for foods such as eggs,cabbage and some smells reminded me of chemo which made me feel sick but this bit was all in my mind!  I had to have injections after each session as my blood count was always low but this is normal so nothing to worry about.  If I hadn't had chemo I would always have wondered if I was 'missing' out on treatment so I was glad my consultant told me I was having it!  FEC chemo is bearable and you WILL get through it.  My hair is growing back already and although I didn't lose all my eyelashes and eyebrows, they are definitely getting longer and thicker so yippee to that!  I dreaded chemo as I had read some real horror stories but once I started, I was glad I was having it and the whole thing seemed to fly by. The Oncotype test is very expensive so it's great that you were offered it but I believe you've made the right decision for you.  I had a genetics test to see if I carried the gene as I was worried about potential cancer for my son; it was really worrying waiting for the result but I was lucky as I tested negative. Good luck It's ok to fall down as long as we get up again! x",
      "MessageIndex": 5,
      "PostDate": "26/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51815/chemo---decision-made",
      "Title": "Chemo - decision made"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hello Carole I used the cold cap but it didn't work for me and I could tell by the 2nd FEC that it wasn't working.  I've just had my 4th FEC and still have some hair although it is very thin and am glad the cap helped me keep my hair a bit longer.  I have 2 wigs and bandanas and wear these when I go out as my head feels cold and I still want to look like the 'normal' me again.  I never used conditioner on my hair as my hat was a different type but it was still very cold! Do give it a try as it does work for some women and you might be one of them.  You can get the NHS wig in ready in case you lose your hair or you just might have thinner hair for a few months. Good luck Ruthy  x",
      "MessageIndex": 6,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49418/cold-cap-does-it-work",
      "Title": "Cold Cap. Does it work?"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Well done and give yourself a BIG pat on the back!  You've gone through so much and come out smiling. I too have finished my 'journey'  Diagnosed December 2011, lumpectomy and total node clearance January 2012, 6x FEC from Feb to June, injections after each chemo, 20x rads which finished 2 weeks ago!  Now on Letrozole for 5 years, possibly 10 but feeling good.  Bone scan results were good but taking a calcium and Vit D supplement to be on the safe side.  Mammogram in December when it will have been a year and bone scans every 2 years. I really can't believe I've got through it all.  I could never imagine finishing all the treatment and feeling so good!  I'm happy, positive about having a long future again and am going back to work in a few weeks.  It's not been easy, far from it, but I have got through it all so very pleased with myself!  It's been quite hard financially for the last few months but got through it and will try to get everything back on track when I start earning full money again!  We've had a couple of holidays in Devon and Cornwall and are having another week in Cornwall in 2 weeks time which I am really looking forward to and I'm going to make sure I have a brilliant birthday this year, in December! This site has been a godsend and without it I would have felt totally lost.  There are so many people on here who can help with questions and make you feel better when you are feeling down, I'm so glad I found it. Tinkers, you and I are living proof that we CAN get through it and we DO come out the other side again feeling more positive about our futures. Good luck to you and everyone who needs this site x",
      "MessageIndex": 11,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52618/finished-my-treatment-today",
      "Title": "Finished my treatment today!"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hi I tried th cold cap but after 2 sessions I couldn't stand the cold which made me feel really sick.  I'm glad I tried it as I would always have wondered.  My hair came out quite a bit after the second go so I thought why put myself through the cold agony just for my hair!  I went and got myself a fab wig which looked identical to my normal hair and everyone thought the wig was my real hair!  I wanted hair as I didn't want to look like a 'victim' but wanted to still look like 'me'.  My hair did come back grey but as I was in my 50's it was only to be expected!  Once it had grown back and felt strong again, I went back to colouring it. Good luck with it.  It's different for everyone and you might find you can tolerate it better than me and keep your hair :) xx",
      "MessageIndex": 17,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/78815/cold-cap",
      "Title": "cold cap??"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "I've been taking Resveratrol for a while as it is supposed to help control oestrogen based breast cancer.  I've read about I3C and it has had lots of research in to it but it is also a natural ingredient found in broccoli, cabbage etc so eating plenty of greens would help.  I check a lot of things on the Cancer Active web site which has loads of information on everything to do with all types of cancer, diets, etc and it's all in easy to understand wording.  Have a look at www.canceractive.com and see if it helps. xx",
      "MessageIndex": 6,
      "PostDate": "09/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52251/i-need-to-make-a-decision",
      "Title": "I need to make a decision"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hello You WILL get through the rest of your FEC - I had 6x of them and felt totally exhausted after each one and always had 3 or 4 days in bed sleeping but always felt better after that.  I also had an injection after each one and had a couple where I was sick but it was bearable.  You will find you will get more energy about a week after each one and will feel able to do things and go out so try and arrange something when you have this good spell - it will give you something to look forward to.  We are lucky as FEC isn't as bad as some other chemo's.  My wig has been great to wear going out but my hair is growing back now and looks like a very, very short haircut! Be strong, you are getting through the worst of it and radiotherapy is easy peasy after chemo! good luck xx",
      "MessageIndex": 2,
      "PostDate": "08/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52223/tired-and-sick-wth-fec",
      "Title": "TIRED AND SICK WTH FEC"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "It's guaranteed you will lose all your hair including body hair on FEC.  Sometimes the cold cap helps but not always.  Why not wait to shave your hair until it has got thin?  It takes a few weeks before it starts to come out and you may find you adapt to not having any better if you wait a little longer.  If you like the idea of a wig, get one in ready before you shave it off or get some pretty scarves and bandanas.  I got a wig that looked exactly like my own hair and no one could tell the difference so I still felt like I looked like 'me'.  I also got bandanas which I wore around the house or in the garden but once I had my hair shaved, I didn't bother wearing anything in the house. I got really used to being bald and I quite liked it, saved a fortune of shampoo!  I finished FEC in June and my hair is growing back really well :) Good luck x",
      "MessageIndex": 2,
      "PostDate": "13/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52362/fec-and-hair-loss",
      "Title": "FEC and hair loss"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hi Jessica They usually wait a while after operations to make sure you have healed before starting chemo as chemo will affect the healing process plus you need to be as fit as possible before you start it.  Why not give your breast cancer nurse a ring and have a chat with them about the waiting and how you feel forgotten - they really are brilliant at answering your questions and chatting.  You may not need any more tests as they would have biopsied the lump they took out.  Try not to worry as now you've had the lump and nodes removed there is a huge chance they have removed everything anyway so the waiting to start chemo won't make anything get worse.  Good luck with everything xx",
      "MessageIndex": 2,
      "PostDate": "16/12/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/55986/jessica1",
      "Title": "jessica1"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Hi I'm ER positive and was diagnosed in December 2011.  I had a wide local incision in January and recovered well.  I had my nodes removed (19x in total) and 2 of them had micro cancer cells hence the chemo.  I am grade 3 (fairly agressive) but was never given a stage as the hospital said they don't do staging any more.  However I was told it was still early stage bc.  I had 6x FEC chemo's which weren't pleasant but not as bad as I expected!  I'm now having 20x sessions of radiotherapy; it was going to be 15x sessions but a clinical trial proved that an extra 5x sessions were beneficial with my type of breast cancer so am having the extra.  I've just started on Letrozole (Femara) and will be on it for at least 5 years.  I had a test done to see if I carry one of the cancer genes and luckily I don't.  If I had, I would have had to consider having my ovaries removed and preventative mastectomies.  My consultant said my chances of getting cancer again is almost the same as anyone else and put my bc down to either bad luck or something I was born with and they did not feel the need to recommend having my ovaries removed or a preventative mastectomy.  They did say that ovarian cancer screening is poor as there is no early test that can say if you have it or not.  Every case is different as everyone is different so your treatment might be different to mine or someone else. Good luck, we are all here for you and believe me, it really DOES get better in time! x",
      "MessageIndex": 3,
      "PostDate": "24/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51814/results-today---invasive-ductal-breast-cancer-er-and-stage-2b",
      "Title": "Results today - Invasive ductal breast cancer, ER and stage 2b"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "Counselling is a brilliant idea and I had a few sessions which were really helpful. I kept looking at my son and wondering if I would still be around for his wedding (which was going to be this November but now it's not - long story!).  My BC nurse told me everyone thinks they are going to die from BC and says it's part and parcel of being diagnosed.  It's great that your husband is good with your kids as you won't have to worry about them if you end up in bed after each chemo for a day or two so that's one worry sorted!  Don't beat yourself up about feeling like you do, it's all so very normal and it will pass and bit by bit, you will start to feel better about everything and start to enjoy life again. Chin up! x",
      "MessageIndex": 7,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51814/results-today---invasive-ductal-breast-cancer-er-and-stage-2b",
      "Title": "Results today - Invasive ductal breast cancer, ER and stage 2b"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "How you're feeling is very normal although you might not think so!  Do you know what type of chemo you are having?  I had 6 FEC which weren't too bad at all and totally bearable even though I did have some side effects.  I had a couple of chemo's where I was sick but funnily enough, it wasn't horrible being sick, not like when you are ill, and I always felt better straight after. Keep you chin up, you WILL get through your op ok and you WILL get through chemo ok, it's a long haul but with a good ending. Lots of cancer patients take anti-depressants and if you feel low enough to need them, talk to your gp and don't for one minute think it's a sign of weakness to take them because it isn't. Falling down sometimes is ok so long as you get up again! x",
      "MessageIndex": 5,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51814/results-today---invasive-ductal-breast-cancer-er-and-stage-2b",
      "Title": "Results today - Invasive ductal breast cancer, ER and stage 2b"
    },
    {
      "AuthorID": "Ruthy1953",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/ruthy1953",
      "Content": "I was totally scared when told I had bc, I was diagnosed last December.  I never, ever thought it would happen to me, even though my sister died from ovarian cancer I still thought I wouldn't get it.  I did an awful lot of crying after being told.  We were told a couple of weeks before Christmas that I would need an operation and radiotherapy and I thanked God that it didn't sound like I needn't chemo although funnily enough I did wonder why they weren't suggesting chemo as I didn't want to 'miss out' on any treatment!  I saw my surgeon 23rd December who confirmed I had breast cancer, that it looked like it had been caught early and she would do a wide local excision and a sentinel node biopsy to check it hadn't spread to my nodes. I was given a date in early January for my op.  We decided not to tell my son (who's 25) until after the new year as he and his fiance were having both families over to them for christmas day and I didn't want anything to spoil their first christmas in their new home. I only told my boss and my 2 closest friends I had bc as I found it so hard to deal with the news.  After a few weeks I told more people at work who were all very supportive. I kept hoping it was a nightmare and it would go away.  I lost my mum years ago and often wanted her with me to hug but was also glad she wasn't around to see me going through this as it would have broken her heart.  But I really wished I still had my sister for support.  When I got my results I was told I have a hormone based bc that had spread to the main node and one other and because of that I would now have to have chemo.  That's when I did really cry for a long time.  That's when it really hit me that I had cancer and couldn't do anything about it but leave it to the experts.  I felt so guilty about being ill - my son gets married this year and it should be a happy year planning it all but I feel its been spoilt by me having this bloody awful disease, and I felt so awful about him worrying about me.  I only got married 3 months before I was diagnosed so our plans for a happily married future were shot to pieces.  I was dreading chemo as my sister really suffered with hers but I've just had my 4th and it hasn't been too bad.  Yes I've always been in bed for 3 days afterwards and I was sick for a couple of days after the 4th but other than that, I've got through it ok.  Only 2 more left then 15 lots of radiotherapy plus a hormone drug.  I never thought I would get this far but I have and I've been so lucky to have the support of my husband, son, friends and work colleagues who have encouraged me all the way.  I've also found it so helpful using this community as I know I am not alone and there is always someone's post I can read that gives me some positive thoughts about getting through it all. You are never alone here and can shout and scream any time you want.  Never give up hope and you will get through it all, one day at a time like the rest of us. xx",
      "MessageIndex": 31,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48753/scared",
      "Title": "Scared!!"
    }
  ]
}