{
  "AuthorID": "Sabadee",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sabadee",
  "Posts": [
    {
      "AuthorID": "Sabadee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sabadee",
      "Content": "Good luck Scaredgirl for tomorrow, you can do this xx Hi Lady Penelope, you are very welcome, glad I could be a help xx",
      "MessageIndex": 3,
      "PostDate": "04/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Sabadee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sabadee",
      "Content": "Well done Sam, you are on the way to getting better again. If you get a white furry tongue ask for nystatin. ondansetron is great for combating the sickness and loperamide for just in case. If you don't have a thermometer get one and take your temperature if you feel shivery when you hit the low blood days.  At my local cancer clinic, Beacon centre in Taunton, they have a dedicated helpline and when my temperature hit 38c I had to call it in and go in for antibiotics. I had sepsis twice, but this doesn't happen to everyone. I am not trying to scare you, just warn you   Be kind to yourself and eat what you want when you can, listen to your body xx  Big hugs and love to everyone going through this 'orrible treatment xxx ",
      "MessageIndex": 17,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Sabadee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sabadee",
      "Content": "Hi Scaredgirl I was utterly terrified when I started TCHP on the 30th December 2016, had 6 rounds and had a 100% response of my breast tumour and one lymph node that was cancerous. I am still having herceptin every 3 weeks, but my surgery was in May this year and I have also had 15x RT in July. I am now back to full time hours at work and looking forward to reconstruction next summer.  I can honestly say it was worth the treatment, despite it being a challenging 4 and a half months of chemo. What I have learnt is that everyone is different and people react differently to the chemo. Be kind to yourself and keep posting on here/reaching out when you need to. If you have a good cancer team at your local hospital, they will be a great support aswell.  Hugs Saba xx",
      "MessageIndex": 1,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "Sabadee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sabadee",
      "Content": "Hi Phaedra Yes I have and no you are not being unrealistic! I am very happy that my treatment is coming to an end and the next hospital (onc) appointment isn’t until the end of January, it means I am winning at this getting better thing. I have 3 herceptin left after gruelling chemo, mastectomy and rads, and although the oncology team at my local hospital have been amazing and such a great support, it’s a comforting feeling to know I don’t have to ring the cancer helpline when my temperature hits 38c or I’ve run out of loperamide!!! As for getting on with life I am back at work full time and we are moving house   I think you have a brilliant attitude and I wish you a happy healthy recovery xx ",
      "MessageIndex": 7,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142750/finishing-treatment",
      "Title": "Finishing treatment.."
    },
    {
      "AuthorID": "Sabadee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sabadee",
      "Content": "For anyone thinking about creams to use during radiotherapy, I totally recommend Hydramol cream.  I was dreading the effects on my sensitive skin and declined the trial to condense 15 days of RT to 5, after horrendous chemo and surgery.  I need not have worried.  My local cancer centre, the Beacon centre, provided Hydramol cream and it was totally brilliant at protecting my skin. I slapped on the hydramol twice a day and the results were much better than expected. Yes you could see the area being treated (armpit and mastectomy scar up to my neck) was slightly pinker and felt warm at times, but it did not break down at all. The cream felt lovely and cool......and free!  It is almost 5 weeks post RT and I slap on abit of cream once a day if I remember, my skin looks great. It is not discoloured or damaged and I am very very lucky to be able to say that RT was a breeze...well compared to chemo!  Good luck lovely ladies x ",
      "MessageIndex": 0,
      "PostDate": "03/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137254/rt-on-sensitive-skin",
      "Title": "RT on sensitive skin"
    },
    {
      "AuthorID": "Sabadee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sabadee",
      "Content": "No worries Anitajane. One thing this cancer experience has taught me, is that everyone is different and reacts differently, but I was so happy with the hydromol I had to share!! I hope your treatment goes well x ",
      "MessageIndex": 5,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137254/rt-on-sensitive-skin",
      "Title": "RT on sensitive skin"
    },
    {
      "AuthorID": "Sabadee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sabadee",
      "Content": "Good luck with the rest of your treatment Terry37 xx ",
      "MessageIndex": 2,
      "PostDate": "04/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137254/rt-on-sensitive-skin",
      "Title": "RT on sensitive skin"
    }
  ]
}