{
  "AuthorID": "Sajmo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sajmo",
  "Posts": [
    {
      "AuthorID": "Sajmo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sajmo",
      "Content": "Hi there. Well- indeed, where does one start? You've made an incredibly positive start by joining this group and admitting how you feel... I was diagnosed in September 2018 with invasive ductal cancer, grade 2, HER2+ and OR and PR + after my first mammogram aged 52- no lump detected myself- it was a shadow on the mammogram and a small lump was found under ultra sound. I teach in a special school and lead a department of 6 classes and staff and I spent the first 3 weeks comforting my friends and my colleagues whilst breaking the news to them...I was weirdly calm and accepting of the diagnosis I think that this is because by breast care team were so positive and supportive... My team, based in Derby, were very open and honest and explained(patiently) what my choices were. I had two surgeries to remove an early small cancer (lumpectomy)- no lymph node involvement. I've recently finished chemotherapy - which wasn't a walk in the park but also wasn't as bad as I expected! Continuing with Herceptin until March, being monitored closely every three months- heart scans I'm just back after my first radiotherapy session and all went well. I start back to work this week too.. so I can testify that there most definitely is light at the end of the deep dark tunnel that we find ourselves in on some days.. It's not yet all over for me but I'm well on the way. The best advice I was given was to be true to yourself and honest with those that you trust. Carry on as best you can and take one small step at a time. Tick off every treatment; treat yourself... and last of all ASK FOR HELP- people want to help but don't know how...this was the hardest thing of all for me to do! But it has bought my friends and I closer than ever. I'm a control freak and fiercely independent but I couldn't have got to where I am now without the understanding of my friends and close family. It's OK to feel how you feel...if you're tired rest.. if you're sad cry' if you're happy laugh. don't let cancer define who you are. Accept that folks will never know what to say to you and that they come from a place where they want to help and support... I smile inwardly when I get the all too common remark of 'Wow, you look really well!!!'... Because ??? how are you supposed to look when you are being treated for cancer?LOL I have lost a little weight- but I'm quite glad about that- my hair is growing back and I'm beginning to feel like myself again. I truly hope that all goes well for you and that you get the support and care that you deserve. I hope that my outpouring may help you to see that whilst the journey may not be what we planned for ourselves it can be conquered and we do come out the other side!!! Take care and huggggssss xxxxx",
      "MessageIndex": 5,
      "PostDate": "03/06/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/182233/just-been-diagnosed-with-dcis-lost-afraid-numb",
      "Title": "Just been diagnosed with DCIS, lost afraid, numb!!!"
    },
    {
      "AuthorID": "Sajmo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sajmo",
      "Content": "Hi all I had my first radio session of fifteen today and all went well! I was told that it would be far less invasive than the chemo that I have survived!!!! Top tips for surviving this greatly received. I have very sensitive skin, so am hoping that I avoid getting sores etc etc. I also start back to work this week as I've been off for 8 months now and going stir crazy- just one half day per week to begin with... good luck to all xxxx",
      "MessageIndex": 13,
      "PostDate": "03/06/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/182130/june-breast-cancer-radiotherapy-chat",
      "Title": "**JUNE BREAST CANCER RADIOTHERAPY CHAT**"
    }
  ]
}