{
  "AuthorID": "sallyj78",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
  "Posts": [
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "Hi there, I was diagnosed in Feb this year when my daughter was 7 months and my son was 3 year old. I had a lumpectomy and all my lymph nodes removed, had 4 cycles of fec, 4 of docetaxil and have just finished my 6 weeks of radiotherapy yesterday. It is hard going through it all with the children being so small, just accept all the offers of help you get- and dont be afraid to ask for help either. We told my son I had poorly boobies and hes been fine with that. Have a rest any time you can, and dont worry about the housework too much! Just accept that you cant do everything, my laundry pile was always huge with having the kids!! Hope that helps, good luck with your treatment. xx",
      "MessageIndex": 6,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45162/coping-with-cancer-treatment-and-young-kids",
      "Title": "Coping with cancer treatment AND young kids!"
    },
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "Hi all, My hair is really falling out now, 2 weeks after 1st fec. Had it cut really short, but my head and scalp are so painful I wondered if anyone had any ideas on pain refief? Paracetamol don't work, nurofen are a bit better. But it is so itchy and tender, I dont know what else to try- was thinking about watching tv with a bag of frozen peas on my head to see if that helped!! LOL Having second fec on Thursday, so guess it will really go after that. Will it stop hurting when its all finally gone??? Hope so!!   Any ideas/tips would be great, thank you. Sally xxxxxxxxxxxxxxx",
      "MessageIndex": 0,
      "PostDate": "15/05/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/38126/painful-scalp--hair-falling-out--any-tips-on-pain-relief",
      "Title": "Painful scalp- hair falling out- any tips on pain relief?"
    },
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "Hi, and thanks for your replies!  Head feeling a little better today, loads more came out in the shower this morning- helped by me running my fingers through it!! Got lots of \"fluff\" left on head and a few tufts here and there- looks very odd- but at least its not as painful today.  Thanks for the tip on the tablets Meg, but I think (well, hope) Im over the worst pain now! Yes Kate, I think it is usual to start falling out so soon. I was told it would start falling out 2 weeks after 1st fec, and it actually started about 12 days after my first session. It started on the Monday gradually, with only small bits. Then on the Friday loads came out so I had it cut really short and started wearing my wig/bandannas. Then the rest fell out Sunday and this morning. Now all I have is fluff and a few tufts here and there!!! Once it started properly it really went fast! Be prepared!!    Thanks again for all your replies, so handy to \"speak\" to someone who has gone/is going through the same things.    Sally xxxxxxxxxxxxxxx",
      "MessageIndex": 5,
      "PostDate": "16/05/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/38126/painful-scalp--hair-falling-out--any-tips-on-pain-relief",
      "Title": "Painful scalp- hair falling out- any tips on pain relief?"
    },
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "Hi all, I'm new to this site/group. I found out I had Breast Cancer on the 17th Feb. I've had a Lumpectomy and a Wide Local Excision (I think thats what its called!). I am seeing the doc tomorrow and Im guessing I will be starting chemo within a few weeks.  Im feeling so scared of the unknown, I know everyone reacts to chemo differently so no-one will be able to say \"this is exactly what will happen\". But, how did you feel before your first chemo, how do you cope? I am usually quite a practical person and have a 'just get on with it' outlook on life, but with this I keep finding myself crying at the thought of the stuff Im going to go through in the next few months.  Thanks, Sally xxxxxxx  ",
      "MessageIndex": 0,
      "PostDate": "28/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36710/new-to-group--so-scared-of-whats-to-come",
      "Title": "New to group- so scared of whats to come..."
    },
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "Thanks for your advice ladies! I guess I'm allowed to be scared, I just don't really want to go through all this- but Im sure none of us do. I keep thinking 'why me'? But I know thinking like that is not a good way to look at it. Seeing the doc tonight, and guessing I may be starting my first round of chemo next week. They don't have the cold caps where I am, the nurses said everyone looses their hair- just hope my kids don't pull my wig off in the middle of Tesco's!!! (Thanks for the Anna Bandana info Clair- website is good and much cheaper than others I had looked at- and hope all goes well with your chemo tomorrow :0) ).    Thanks for your advice & support so far- I'm sure I will be back with more questions!!  LOL Sally xxxxxxxxx    ",
      "MessageIndex": 4,
      "PostDate": "29/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36710/new-to-group--so-scared-of-whats-to-come",
      "Title": "New to group- so scared of whats to come..."
    },
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "thanks again for all your kind replies!!  Saw doc today and am having another op next week, as they didn't remove enough tissue from around the lump so they need some more. Not too worried about it to be honest. Its the problems under my arms that are the worst- had 33 lymph nodes removed and only 2 were infected. Although the scar isn't infected something around there is and its lumpy and painful (but its not fluid), got antibiotics now though so should be ok for op next week.  Due to start chemo in the next 2/3 weeks- think it will be the week of Good Friday. :0( Not a good Easter, but it has to be done. Just want to get on with it really, all this waiting around is the worst. The quicker I start it all the quicker its over- then theres the radiotherapy! Oh the joys!! LOL Right, children are out- I'm going for a well deserved siesta! Thanks again for all your advice ;0) Sally xxxxxxxxxxxxxx ",
      "MessageIndex": 7,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36710/new-to-group--so-scared-of-whats-to-come",
      "Title": "New to group- so scared of whats to come..."
    },
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "Hi Angela,  Just wanted to say I hope all goes well with your op today. Don't worry, Im sure it will be fine!  I had all my lymph nodes removed, and have to go in again to get more tissue removed from around the lump on my breast on Thursday. The op really isn't too bad.  I have to straighten my hair every other day too, so having a straight wig will be great- and save me so much time!! LOL Thinking of you today, Sally xxxxxx",
      "MessageIndex": 11,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36710/new-to-group--so-scared-of-whats-to-come",
      "Title": "New to group- so scared of whats to come..."
    },
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "Hi Clair, Thanks for your reply. I guess I am quite an upbeat person. I don't want to have to deal with all this stuff, but there is nothing I can do about it so Ive just got to get on with it really!! To be honest, I have two small children (3 years & 8 months), so I dont really get much time to dwell on it. My day is mostly spent watching Toy Story 3 and changing dirty nappies!!! LOL Im actually quite looking forward to buying  my wigs and looking forward to wearing them too, I cant believe Ive just put that!!!. Cant decide at the moment wether to get one/two similar to my hair at the moment, or if I should get one like my hair now and one completely different. Decisions, decisions...  :0) Sally xxxxxx  ",
      "MessageIndex": 9,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36710/new-to-group--so-scared-of-whats-to-come",
      "Title": "New to group- so scared of whats to come..."
    },
    {
      "AuthorID": "sallyj78",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sallyj78",
      "Content": "Hi all, dont know if anyone cam help me, but was just looking for a bit of advice. Have had 4 sessions of fec,  and 1 of docetaxyl (sp). Had my long hair cut to 3 inches (as hairdresser said it wasnt good for hair to shave it off) after 1st fec. Most of my hair fell out but I am left with wispy bits here and there. Now it is just starting to grow back, so I have my old 3 inch hair in bits and new short stubble hair too. What should I do? Should I go ahead and shave the longer bits off??? Just unsure as it looks so odd at the moment, would have been better if I had gone completely bald.... Any advice would be greatly apreciated!! many thanks. Sally xxxx",
      "MessageIndex": 0,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41108/hair-growing-back-but-also-have-bit-of-old-hair",
      "Title": "hair growing back but also have bit of old hair...."
    }
  ]
}