{
  "AuthorID": "Salxxx",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/salxxx",
  "Posts": [
    {
      "AuthorID": "Salxxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/salxxx",
      "Content": "Hi there I’m in a similar position to you - tnbc on my own with teenage daughter! I was able to get the tube to and from hospital on my own throughout the 4 x 2 weekly sessions of AC chemo and the first half of the 12 weekly sessions of PC chemo but a lovely friend offered to accompany me for every session thereafter which was great because I was weak on my legs towards the end. Worked 5 afternoons a week which kept me from climbing the walls with boredom and self-pity but had the odd day off when side effects were too much. Although the side effects were worse with AC, I found the travelling on my own easier at the start of treatment as I wasn’t so weak. Just be aware that you may get a temperature when your white blood count is low so be prepared for visits to A&E to check you haven’t got neutropenic sepsis. You may be kept in overnight at best so make sure someone can be there for your daughter. Wishing you all the best and sending big hugs Salxxx P.S: I’ve had a complete pathological response to neoadjuvant chemo so stick with the poison and don’t give up - it works well at killing tnbc cancer cells!!",
      "MessageIndex": 12,
      "PostDate": "15/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159461/on-your-own-with-breast-cancer-chemotherapy",
      "Title": "on your own with breast cancer chemotherapy"
    },
    {
      "AuthorID": "Salxxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/salxxx",
      "Content": "Hi Lesley Thank you so much for your excellent advice. I saw a different BC nurse yesterday and she used the Inodine dressing so fingers crossed and I’ll resist the temptation to air it!!! It’s also a relief to hear you didn’t start radiotherapy until 3 months after surgery.  Feels like I can breath now so thank you again Salxxx",
      "MessageIndex": 2,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159849/blistering-after-lumpectomy",
      "Title": "Blistering after lumpectomy"
    },
    {
      "AuthorID": "Salxxx",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/salxxx",
      "Content": "Hi everyone I’ve (thankfully) finished 6 months of AC & PC neoadjuvant chemo for tnbc and had a wide local excision wire guided lumpectomy and sentinel lymph node removal 3 weeks ago. The tissue removed measured 90 x 74 x 28mm so breast size (F cup and saggy) very much reduced and lifted - YAY!!! All healing well apart from the area under the nipple where I had quite a sizeable blister which popped and won’t heal. Has anyone else had this and, if so, do you have any advice on dressings you found helped the healing process. I’ve been going to my breast nurse twice a week to get the dressing changed and am getting worried about the length of time it’s taking to heal. I’m wearing sports bras during the day for support but feel like ripping off the dressing and going topless to get air to the wound! I’m guessing radiotherapy will have to be delayed because of this and am getting anxious. Any advice would be extremely gratefully received!! Salxxx",
      "MessageIndex": 0,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159849/blistering-after-lumpectomy",
      "Title": "Blistering after lumpectomy"
    }
  ]
}