{
  "AuthorID": "sam37",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sam37",
  "Posts": [{
    "AuthorID": "sam37",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sam37",
    "Content": "Hi Ang31aa.1, I echo Kay's words that I'm sorry you find yourself here but we are all in the same boat and can offer pearls of wisdom when you need it, we're also here for you to cry, rant and rave and of course have a laugh with.  Trust me, it may not feel like it now but you will have days where you laugh. Right then to business...........If you can't work for reasons of ill health, you will be entitled to receive the new Employment & Support Allowance benefit which has replaced the old Incapcity Benefit.  You will need to go see or ring your JobCentre Plus office who will help you with the application forms, etc and I would advise you to look at the Direct Gov website as it explains this benefit in its entirety.  Broken down to basic terms E&SA pays £65.45 per week living expenses and then additional payments of £13.65 pw of Disability Income Guarantee, and then a cost towards your rent or mortgage depending on the mortgage amount and your interest rate.  Because you would be in the Support element of the benefit as you unable to work due to illness, you will receive another £31.40 per week.  Now the figures I've given you here are the actual amounts that I receive on this benefit and to be honest I'm not sure whether they are tailored to individual needs or whether everyone receives the same amount and obviously the mortgage help amount varies from person to person.  The benefit is either paid by Contribution Based or by Income based, the former is where your own NI contributions pay you if you've worked and contributed NI for the previous 2 years.  If you haven't, then the you receive income based.  As well as this, on this benefit you're entitlted to Council Tax relief too.  Just had a thought, if you contact Macmillan Benefits (via this website) they will talk you through all you're entitled too - that's how I got this benefit!!  Also if you have your gas and electric with companies such as NPower, or Eon or British Gas (amongst others) Macmillan benefits will also negotiate a special needs rate so you pay the very minimum per month.  For example, I'm with NPower and when I rang Macmillan benefits I was paying £120 per month for gas and electric, Macmillan negotitated a new rate with NPOwer for 12 months of £19 per month for both gas and electric.  So it really is worth ringing them, they are lovely.  They will also tell you when you are entitled to apply for Disability Living Allowance.  At the time I contacted them I hadn't had cancer long enough (?) but was to call them back in 10 weeks.  I did and as per the advice given I was rejected the first twice, by the time I came to do a third application I couldn't be bothered.  Please be bothered as if I had done it I probably would've been accepted and be receiving another £95 per week but I didn't so I don't!!!!! As Kay said, i don't think you'll be well enough to work through your chemo.  Even if you don't suffer too badly with the side affects (I didn't suffer really) you are incredibly vulnerable when your blood count drops through the floor and your immune system no longer has the strength to fight.  As you know, children are prone to coughs and colds and without wanting to scare you, you have to be so so careful.  As my Oncologist said to me, a simple dose of cyctitis could kill you!!  So be careful and remove yourself from obvious situations.  Shop when they're quieter (shop online is better still), try to avoid crowds, no swimming, etc etc. I know I've gone on a bit, but I hope I've helped. Good luck and let us know how you get on Love Sam xx",
    "MessageIndex": 2,
    "PostDate": "24/04/2010",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/27300/chemo-and-work",
    "Title": "chemo and work"
  }]
}