{
  "AuthorID": "sammyh1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sammyh1",
  "Posts": [
    {
      "AuthorID": "sammyh1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sammyh1",
      "Content": "Hello all, I first had breast cancer nearly 9 years ago. Now the retched thing is back, a small tumour in the same breast. I had my yearly mammo in November, but they mislaid my call back, so only just got the diognosis.  The radiologist said I'd most likely need a masectomy, hopefully will miss out on chemo. I'll be really annoyed if the delay causes me to have to have more treatment. Last time I had WLE, chemo, and radio, for grade 3, 7cm triple negative tumour, so my risks have always been quite high, but to say I'm surprised its back after all this time is an understatement, as I was told the risks with triple neg go down a lot after the first 3 years. So now have to wait till Thursday to find out what they have planned.  Sam x",
      "MessageIndex": 0,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88452/new-one",
      "Title": "New one!"
    },
    {
      "AuthorID": "sammyh1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sammyh1",
      "Content": "Thank you.. I've tried to explain to people who have always banged on about the 'all clear' sorry to say they kinda get it now!  Still I know the lay of the land, the nature of the beast, so feel very different than from first time around! Sam x",
      "MessageIndex": 2,
      "PostDate": "17/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88452/new-one",
      "Title": "New one!"
    },
    {
      "AuthorID": "sammyh1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sammyh1",
      "Content": "My triple neg did respond to chemo really well the first time round, was such a monster, I could almost feel I could see it shrinking, which was pay off for the horrid stuff! The tumour is so small compared to last time I can't believe I'd have to have chemo, but I have learnt the hard way not to second guess this bugger!",
      "MessageIndex": 5,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88452/new-one",
      "Title": "New one!"
    }
  ]
}