{
  "AuthorID": "Sammi J",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sammi-j",
  "Posts": [
    {
      "AuthorID": "Sammi J",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sammi-j",
      "Content": "Hi everyone, thank you so much for all your support. Sorry about delay in getting back to you all. No excuse except tiredness, I am back at work between treatments. The black feeling stayed for a week after first T treatment, I felt such a wimp don't think I have ever whined so much in my life. Got slowly better after that, now feel fine apart from me feet but that's nuffink compared to what it was. Next chemo tomorrow, this time I'm prepared - got deep freeze, pain killers, hot water bottle - c'mon side effects if you dare!!!!! Stay strong everybody and love and hugs to you all.  Thank you xxx",
      "MessageIndex": 9,
      "PostDate": "27/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85907/when-does-it-end",
      "Title": "when does it end?"
    },
    {
      "AuthorID": "Sammi J",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sammi-j",
      "Content": "I am finding it very hard to stay positive. It seems I take one step forward and four back.  I had my first T treatment a week ago. Three days later I had to call the doctor out due to real bad muscle pain. Took accidental overdose of said pain killers. Been in bed for five days. I live alone and have no one locally. Is the pain normal? I had a mastectomy and reconstruction four months ago. The pain from this is still immense, can someone tell me if they think that's normal? Sorry to whine but I just feel I've had enough x",
      "MessageIndex": 0,
      "PostDate": "17/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85907/when-does-it-end",
      "Title": "when does it end?"
    }
  ]
}