{
  "AuthorID": "Sandy62",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sandy62",
  "Posts": [
    {
      "AuthorID": "Sandy62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sandy62",
      "Content": "Hi Gill522, I had BC in 1999 and had a good 10 years before it came back in 2009, it had spread to my skin and lungs.  But.... 3 years on I am still here, working and living my life as full as possible.  I hope that you find some positive support because thats what you need to get through this.  I take everyday as it comes but always try and find a positive in everything and try not to dwell on what if's.  Much love.",
      "MessageIndex": 5,
      "PostDate": "17/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61580/newly-diagnosed-please-someone-reassure-me",
      "Title": "Newly diagnosed. Please someone reassure me"
    },
    {
      "AuthorID": "Sandy62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sandy62",
      "Content": "Hi there.  I have been through the dreaded chemo twice now and both times my hair came back pretty quickly and nice and thick.  I never shaved it off again just had a little trim here and there by my very understanding hairdresser.  The first time I grew it back and had it quite long again, but this time I have left it very short and grey which I love and at 50 years,  feel very liberated with my new colour!  But I have say a friend of mine who is older than me, her hair came back a lovely brown mink colour which she loves as she always had blonde dyes on before.  Good luck ladies with your new hair!",
      "MessageIndex": 6,
      "PostDate": "17/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61571/hair-regrowth",
      "Title": "Hair Regrowth"
    },
    {
      "AuthorID": "Sandy62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sandy62",
      "Content": "HI.  Your reaction to sunlight sounds very much what I experienced although mine was not on such a bad level as yours.  I did have to make sure that I kept out of the sun as I had quite a bad reaction whilst on Tax.  So I would say this is not unusual.  I bought a big hat!!!",
      "MessageIndex": 2,
      "PostDate": "23/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61701/tax-and-side-effects-esp-sunlight",
      "Title": "Tax and side effects...esp sunlight?"
    },
    {
      "AuthorID": "Sandy62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sandy62",
      "Content": "Hi Guys.  I had a bilateral ophrectomy 3 years ago by choice, not realising what I was letting myself in for in the long term!  I just have some questions about how other in the same situation have or are coping with some of the side effects, or if I am just being unlucky with the ones I am getting. ",
      "MessageIndex": 0,
      "PostDate": "04/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72985/ovary-removal---3-yrs-on-advice-needed-pls",
      "Title": "Ovary Removal - 3 yrs on advice needed pls"
    },
    {
      "AuthorID": "Sandy62",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sandy62",
      "Content": "Hi Rebecca. The main issue is the dryness down below, to the extent that sex is out of the question and has been for 3 yrs. This makes me quite sad and I do miss this part of my relationship with my husband, who is fantastic by the way and has never made a big issue over this. When I have tried to broach the subject with my gp/gynea they don't have any answers and I am just left feeling a little sad. I wondered how others were dealing with this but I havnt found anyone else who has gone through this and not been given hrt which is something I cannot take as my cancer is estrogen positive and is now in my lungs.",
      "MessageIndex": 3,
      "PostDate": "06/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72985/ovary-removal---3-yrs-on-advice-needed-pls",
      "Title": "Ovary Removal - 3 yrs on advice needed pls"
    }
  ]
}