{
  "AuthorID": "SarahLx",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarahlx",
  "Posts": [{
    "AuthorID": "SarahLx",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarahlx",
    "Content": "Hi This week I am completing 5 years of Tamoxifen and yes, 'stress' in the widest possible sense has been a trigger for me. I've had all the usual symptoms for the full 5 years; the hot flushes and sweating were exacerbated by tea, coffee, alcohol, exercise (just walking the dog was sufficient) - the sweats kicked in about 10 minutes after stopping exercise, eating a hot meal, needing the loo, even just normal interactions with a shop assistant or bank cashier. I was prescribed Clonadine but it produced additional side effects so I stopped taking it. As my job was in PR and involved endless social situations it was very embarrassing and distressing and eventually, two years ago, I gave up work because of it. I did find (as a number of people have mentioned) that different brands produced worse effects than others. The worst for me was Wockhardt which my local Boots kept trying to give me. Eventually a sympathetic pharmacist told me they had to source the cheapest brand unless the GP stipulated otherwise so I got my GP to specify no Wockhardt. I am now being moved on to Letrazole for 5 years and I am praying the SEs are no worse. If they are, I am seriously considering giving up taking anything and taking my chances. I'm still 5 years off retirement age and apart from being at my wit's end with the red, dripping face and body, I want to feel my real age, not 20 years older. I'd like my muscles and joints to stop aching, my energy levels to improve, my brain to de-fog, my concentration to improve, and my libido to return (so does my long-suffering husband!). I wish you the very best of luck - despite all the negative effects of the medication, I am hugely grateful that I have survived for nearly 6 years after mastectomy, chemo and radiotherapy for stage 3 cancer. But I am mystified as to why the pharmaceutical companies have not developed anything better than Tamoxifen which has been around for over 30 years and causes such problems for so many of us.",
    "MessageIndex": 10,
    "PostDate": "30/10/2016",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116555/are-hot-flushes-stress-related",
    "Title": "Are hot flushes stress-related?"
  }]
}