{
  "AuthorID": "Sarah32",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
  "Posts": [
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "I am very fair and burn in the sun straight away but tolerated RT quite well. I had 15 sessions and my skin did go red and a bit rashy but no blisters or broken skin. I used aqueous cream morning and night and washed my breast area with aqueous cream in the shower and I think this helped. I kept applying the aqueous cream for six weeks afterwards and only started using normal shower cream 4 weeks post RT as advised by the doctors. I didn't wear a bra for the whole time I was on RT and for 4 weeks post - I am small so it didn't really make much difference but if you need the support you should try a vest top with a support panel fitted in. You mustn't use any deordorants or any other products on your skin except aqueous cream. It is worth asking your consultant if you can have higher doses each day and go for 3 weeks instead of 6. I was supposed to have 6 weeks but it was changed to 3 weeks with double doses each day and this was definately better because going to the hospital every day makes you very tired. Good luck xxx",
      "MessageIndex": 6,
      "PostDate": "09/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30894/radio-therapy---cream-oil",
      "Title": "Radio therapy - cream/oil?"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Ruth, I am 32 years old and was diagnosed with BC in Oct 09 so had a mastectomy then chemo and radio. I had a genetic test and found out I was BRCA1 positive so 3 weeks ago I had my other breast removed with reconstruction in both sides. I am doing well and feel ok. It is very daunting when you are waiting to have the op. Have you discussed with your surgeon what type of reconstruction you are going to have? I have sub-pectoral implants. He couldn't do the back flap because I am too thin! But I am pleased with the implants. You will be given exercises to do post op to ensure that you regain full movement of your arms relatively quickly. Obviously you will feel discomfort after the op but it isn't as bad as you think. The thing I wasn't really prepared for was the loss of sensation but this does slowly start to come back over time. It is a really brave thing you have decided to do and will give you peace of mind for the future. I was very keen to have my healthy breast removed when I found out I was BRCA1 positive to remove the constant worry about it. I think you are definately doing the right thing and you will be fine. Sarah xx",
      "MessageIndex": 1,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32933/risk-reducing-mastectomy-for-brca-carriers",
      "Title": "Risk-reducing mastectomy for BRCA carriers?"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Ruth, The latissimus dorsi (back flap as I called it!) is supposed to give the most natural result and be the recon of choice for most surgeons. I wish I had eaten more cake so I could have had it - trying to be healthy obviously didn't do me much good anyway... I didn't have to wear a sports bra because I had implants only so it is different to the LD recon you are going to have. I didn't have a choice of recon because of being too thin so it was implants or nothing! After the op I was up and about the next day and managed to wash myself and sit in the chair for a bit. I was walking around the ward the next day and was home after 3 nights in hospital. So it wasn't all that bad. Just take things easy and don't try to push yourself untill you feel ready. It will be a shock to your system but you are young and healthy so will bounce right back. I only needed paracetamol and ibuprofen for the pain. It won't be as bad as you think. Sarah xx",
      "MessageIndex": 5,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32933/risk-reducing-mastectomy-for-brca-carriers",
      "Title": "Risk-reducing mastectomy for BRCA carriers?"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Char, I also had triple negative BC and had 3x FEC and 3x TAX and 15 radio. I was given zolidex to try and protect my ovaries and started getting menopausal symptoms almost straight away. The hot flushes were the worst - I was having one every hour day and night!! They finally stopped about 3 weeks ago - thank god! I have been getting some lower stomach aches over the past week but no spotting or any sign of periods yet... I had a blood test on Tuesday to see what my hormones are up to and am waiting for the results like you are. Try not to worry about what your doctor said about biopsies and smear tests - he is probably just being extra cautious and if your hot flushes have stopped it seems very likely that your body is just reacting to having oestrogen again and nothing sinister is going on.  Sarah xxx",
      "MessageIndex": 1,
      "PostDate": "17/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31496/menapause-or-not",
      "Title": "menapause or not?"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi, I had a port fitted privately and it has been really good. They have not had any trouble finding it (in fact it is quite prominant) and it makes the whole chemo experience a lot easier than it would have been. The down side is that I will be left with two scars. One is small (1cm) and just below my collar bone, but the other one is about 3.5cm and is quite prominant and will show in summer when wearing a vest top. But if I had the choice again I would still have the port because my veins are really rubbish! sarah x",
      "MessageIndex": 10,
      "PostDate": "19/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/26143/help-has-anyone-requested-a-port",
      "Title": "HELP ! Has anyone requested a Port ???"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi all, I'm so sorry to hear both of your news. You will still be in shock this early on and it will be very difficult to speak to people about it. I found that being so young and being diagnosed with this made it really tough because it is just not expected and people really don't know how to act around you or what to say. I found that as soon as I mentioned cancer I would just burst into tears and it just didn't seem real. It becomes easier to talk about as time goes on. Everyone on this site is really supportive and I have found it helpful for finding info on all kinds of things. Sarah x",
      "MessageIndex": 4,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23424/bit-of-a-shock",
      "Title": "Bit of a Shock!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Fran, Sorry to hear about your recent diagnosis but you will find this site really helpful for finding stuff out and answering any questions you have. I decided to not have the cold cap and am kind of regretting my decision now because finished chemo in April and am soooo impatient for my hair to grow back so I can loose the headscarf and feel normal again. At the moment I have a thin covering of about 1cm but not enough to look normal. I wish I had tried the cold cap so I think maybe you should give it a go and if you doin't like it at least you tried. I had a portacath and was really pleased I did. Each time (I had 6 chemo) it was so quick and easy to get the needle thing in and I had no issues with finding veins or painful arm afterwards etc. I was very grateful for that. The scar I am left with is about 1.5 inches long and just above my right breast and is fading quickly so think with some bio oil and a bit if time it will fade away nicely.  Please try not to be scared - easier said than done when you are at the begining of treatment but I promise you once you have started it will go really quickly. I had my last radiotherapy session today and can't believe how quickly the chemo and radio went. If you have any other questions about anything let me know. Thinking of you Love Sarah xx",
      "MessageIndex": 6,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/28961/should-i-have-a-portocath",
      "Title": "Should I have a portocath?"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Andrea, Sorry I didn't mean to scare you... but I had a bad reaction to the chemo. I think most people do a lot better than me. I have always been quite 'fragile' and this is lke my body's worst nightmare!! I have two more Tax to go so I am getting near to the end which is definately keeping me going on the bad days. Good luck for Tuesday - the first is always the worst because you don't know what to expect. I will be thinking of you. Sarah xx",
      "MessageIndex": 148,
      "PostDate": "19/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25099/had-first-chemo-fec-what-else-to-come",
      "Title": "had first chemo Fec what else to come!!!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi, I started my chemo on 8th Jan. I'm having 3 FEC and 3 Docataxel. Like you I was really really scared before the first one because I didn't know what to expect. I was very very sick for the first one but I took a drug called Emend for the second and didn't throw up at all - just felt very sick. I found the first cycle quite easy after the inital sickness had passed and just felt tired but nothing too bad. But the second cycle seems harder. My tummy feels quite tender and I have a horrible taste in my mouth all of the time and an upset stomach nearly every day! I just feel generally weak and not myself at all and very tearful at the slightest of things. My hair started comng out in clumps on the day of my second chemo so my partner shaved my head before we went to the hospital! It was a bit traumatic because I had long thick hair but I have a wig and several hats to wear when going outside and it will grow back.. I found that my my scalp felt sore to the touch when the hair started really coming out. I have been given the immune boosting injection on the day after each chemo and hopefully that will mean that my white count isn't too low. They are going to continue doing this for the course of my treatment. I hope that everything goes ok for your next cycle. Thinking of you Sarah xx  ",
      "MessageIndex": 7,
      "PostDate": "03/02/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25099/had-first-chemo-fec-what-else-to-come",
      "Title": "had first chemo Fec what else to come!!!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Bev,  I had my 3rd FEC on 18th Feb and am now feeling ok.  I felt so panicky on the day of it and felt really nauseous before it had even started! Afterwards i had 7 days of feeling reallysick (even with all of the anti-sickness) and very low. I kept crying at the smallest of things and felt totally helpless. But on day 8 I felt a lot better and felt like I had turned a corner and am hoping that the next two weeks will be ok now. I have noticed this time that my mouth is a little sore and swollen with a few ulcers but nothing too bad. I totally understand how you are feeling and the feeling of dread but you will get through it. The depression is hard to cope with especially if you are normally a cheerful person but take comfort in the fact that we all feel it and you are not alone. I was feeling so rubbish this time last week but that passed and now I feel ok - you will too. The first week will pass and you will have two ok weeks to look forward to and another one to tick off the calender. Sarah xx",
      "MessageIndex": 50,
      "PostDate": "28/02/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25099/had-first-chemo-fec-what-else-to-come",
      "Title": "had first chemo Fec what else to come!!!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi All, I had my first Taxofere a week ago so I thought I would let you know how the week has been as I know a few of you are having this drug soon. With the FEC I really suffered with nausea and vomitting (even with Emend) and the nausea lased for 8 days for each of my 3 FEC. With Tax the nausea has been much much less and only really lasted about 3 days. But I have had a really sore mouth and an absolutely awful taste in my mouth (much worse than FEC). I have some difflam mouthwash which helps with the soreness to an extent but my tongue is very swollen. I have been drinking lots of ice cold milk which is soothing and staying away from anything spicy.  I had heard that with Tax you get awful bone pain from day 4 -6 but my hospital said that paracetamol and ibuprofen should be enough - and it was. The pain started on day 3 and is still present now but nothing too bad. The chemo nurse said that because I was on high dose steroids for day before chemo, day of chemo and day after chemo, if I was to suddenly stop these it can cause intense pain (and other complications), so they got me to gradually reduce my dose over 4 days and it seemed to work! The other major side effect I have had is fuzzy head and feeling really really tired. This lasted for 7 days and I really couldn't think straight. It probably didn't help that I had awful hot sweats day and night so couldn't really get any more than an hours sleep at a time. I was feeling very low yesterday and had a good cry and feel a bit better today. I have painted black nail varnish on finger and toe nails (looks horrible!) to try and preserve my nails but both thumb nails feel sore today....hope they are not on the way out. Does anyone know how long it takes for your nails to fall out?? I hope everyone is ok today and feeling positive. Each day really does bring new challenges but we are all moving closer to the end of this awful time with each day that passes. Thinking of you all Sarah xxx",
      "MessageIndex": 142,
      "PostDate": "19/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25099/had-first-chemo-fec-what-else-to-come",
      "Title": "had first chemo Fec what else to come!!!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Katrina, Thanks for your post. I have also been getting lots of chocolate cravings and also cake and biscuits and basically been eating whatever I fancy. I am finding honeydew melon good and very refreshing. I am also eating a lot of grapes with dairylea triangles and ready salted crisps. My next dose is 18th Feb and that will be my last FEC so hopefully the last cycle where I feel so sick. But I guess the Docetaxel will have it's own selection of lovely side effects instead! Take care Sarah xx",
      "MessageIndex": 14,
      "PostDate": "06/02/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25099/had-first-chemo-fec-what-else-to-come",
      "Title": "had first chemo Fec what else to come!!!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Everyone, I hope you are all doing ok. It seems tomorrow is a popular day for chemo, I have my third FEC tomorrow and not looking forward to feeling sick for a week.. Hi Bev51 - I had a mastectomy with immediate reconstruction back in October of last year and am small breasted. I had a expandable implant put in under my chest muscle which was gradually filled up with saline to stretch the skin. The idea is that after my radiotherapy I will have another operation to remove the temporary implant and put in a permanent one. They have stretched the skin using the expander so when the permanent implant goes in it looks more natural. But the down side of this is that I am rather uneven at the moment!! After the op I found that most of the pain and discomfort came from my arm because of the lymph node removal. What I wasn't expecting was to loose feeling in my breast and under my arm where the nerves under skin had been removed with the breast. I'm not sure if this is the same for everyone though. Because I was small breasted they didn't need to take any muscle from my back or stomach like they do for bigger ladies so the operation was less complicated than most but still took about 4 hours! Do you know what type of reconstruction you are having?? Sarah x",
      "MessageIndex": 41,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25099/had-first-chemo-fec-what-else-to-come",
      "Title": "had first chemo Fec what else to come!!!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Bev, You should definately mention it when you go for your next pre-chemo check and ask that the surgeon or breast care nurse takes a look at it. I had my bloods on Monday and also saw the breast care nurse and she had a look at how things were gettting on. Because they have expanded my implant to nearly two cup sizes bigger than my natural breast I am having to wear post surgery bras (M&S do some nice ones) and put some foam pads in the small side to balance things up. My breast care nurse said I could have a posthesis to put in my bra if I wanted but I'm not sure I want one and will stick to the foam pads for now. I find that my breast feels tight and tense when I am stretching or moving around a lot and it sits higher than my other one. It feels pretty solid as well and doesn't about move at all (probably due to it being overfilled). I think that after you have finished chemo they will be able to sort things out for you but I guess it will mean another operation.. But in the long run will be worth it if you can get a result you are happy with. I think you were very brave going for the augmentation as well. I thought about it because I am small but decided not to. I will keep you posted on the side effects I get this time round - oh joy! Sarah x",
      "MessageIndex": 43,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25099/had-first-chemo-fec-what-else-to-come",
      "Title": "had first chemo Fec what else to come!!!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi All, I hope you are all feeling ok this weekend. I have been following the discussions on nutrition and wanted to mention a book I recently bought which is very good. It is called  ' Anticancer: a new way of life ' by Dr David Servan Schreiber. He had cancer and then decided to research into how best to work with the body to prevent it recurring. It has lots of helpful advice on what foods are good and not so good etc. I got my book on Amazon for £9.00. Take care all Sarah xxx",
      "MessageIndex": 79,
      "PostDate": "07/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25099/had-first-chemo-fec-what-else-to-come",
      "Title": "had first chemo Fec what else to come!!!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi there, welcome but sorry you had to join us...  I also was diagnosed with Grade III breast cancer which was 3cm. I have had a mastectomy and 12 lymph nodes removed - which were all clear (amazingy). I had the operation on 19th October and only managed to start driving again last week. I was very swollen and had a large haemotoma which meant a second operation about a week after I had the mastectomy. I have finaly got nearly full movement back in my arm as well but am still feeling a pulling and pain under my arm. I know you feel rough now but it does get better - just takes a bit of time. It is very frustrating being in pain and not able to do the things you used to be able to, but it will heal and you will get better. Take one day at a time Good luck with your results on Tuesday. I will be thinking of you. Sarah x",
      "MessageIndex": 1,
      "PostDate": "09/12/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23422/second-breast-opp-and-axillery-clearance",
      "Title": "second breast opp and axillery clearance"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Jo, I'm in the same position as you. I finished chemo and Zolidex in April and am still having hot flushes and no return of periods yet. My oncologist said it can take 2 - 3 months for the zolidex to get out of your system and for the hot flushes to stop but could be longer for periods to return. I really hope we don't have to wait too long!! Sarah x",
      "MessageIndex": 2,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/28723/periods-after-zoladex-and-chemotherapy",
      "Title": "Periods after Zoladex and Chemotherapy"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Judith, I was told to buy some vest tops with a supportive section inside and some non underwired comfy sports bras for after the surgery. I wasn't able to wear my normal bras after the surgery due to a fair amount of swelling. I found the vest tops were most comfortable and offered support without being too tight. Please let me know if you have any other questions about anything. Sarah x",
      "MessageIndex": 14,
      "PostDate": "24/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22860/new",
      "Title": "new"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Akpede, I am also new to this forum and trying to get used to how everything works. I know exactly what you are going through. I had a mastectomy on 19th October and was really really scared leading up to the operation. But it went ok. They injected the anesetic into my hand and I don't remember a thing untill I woke up feeling very groggy and a bit out of it. I was attached to a drip with a morphine attachment so if I felt any pain I could control it with the morphine. It wasn't half as bad as I was worrying it would be and I hardly used the morphine. The nurses at the hospital were brilliant and really looked after me. I know it is a scary thought but you will be ok. Sarah xx",
      "MessageIndex": 8,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/22860/new",
      "Title": "new"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "I had a port-a-cath fitted before I started chemo and I must say it was great. It was very easy for them to access and painless due to skin numbing cream applied before hand. I had it removed a few months ago and have a scar on my chest about an inch long but nothing too bad. Overall I would say it was definately worth it. I hope you have a positive experience too xx",
      "MessageIndex": 2,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30413/fec-with-a-port",
      "Title": "FEC with a port"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi All, I hope you are all doing well. I wondered if anyone got a sore itchy rash come up on their hands?? Over the past week it has come up on both hands and is getting really sore. I have tried E45 cream but it doesn't seem to be helping. Sarah x",
      "MessageIndex": 17,
      "PostDate": "26/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi All, Well I had my first one yesterday and am ok today just feeling a little queasy but nothing like with the FEC. I also feel very tired. I asked for strong pain relief but they said to take paracetamol and ibuprofin if I feel pain... I also have some co-codamol left over from my egg collection op in Dec so can also take that. If the pain gets too bad then I was told to go to see my GP. Day 4 will be Monday so I am waiting to see how it is... Amanda - how are you getting on?? Did you get the dreaded bone pain on days 4-6?? I hope it wasn't too bad for you xx Thinking of you all Love Sarah xx",
      "MessageIndex": 7,
      "PostDate": "12/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Amanda -I hope you are feelng a little better today.. I am starting to ache in my legs and neck but nothing too extreme yet.. Just feels like a case of the flu. The worst thing I would say has been exhaustion because I have been unable to sleep due to blasted steroids. Only getting about 2 hours a night. My mouth is also really swollen and sore and feels weird and it's making eating and drinking really difficult. I might ring up oncology about getting a mouth wash if it is still like it tomorrow. Hi Noj - I'm sorry that you found Tax so awful. I hope you are doing ok now. It seems like a neverending uphill struggle at the moment but I am trying to hold on to the fact that it will be over in few months. Sarah x  ",
      "MessageIndex": 12,
      "PostDate": "15/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Tess, Lisa and Kay, Thanks for your responces. The day is drawing near now and I am getting worried but know it has to be done. I have my black nail varnish at the ready! I hope all of you are having a good wekend and enjoying the sunshine Sarah xx",
      "MessageIndex": 4,
      "PostDate": "07/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi, I have had 3 x FEC and am now due my first of 3 Docetaxel and am really apprehensive about what to expect... I hear that it is nastier than the FEC and I found FEC hard work so I am starting to get really worried about it. If anyone has any advice on the side effects I would be really grateful!!! Sarah x",
      "MessageIndex": 0,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Noj, I had my last tax about 5 weeks ago and all of my finger nails have white and yellow patches on them and the ends of my fingers are painful. I am really scared that they are all going to fall out. Both of the middle finger nails are 50% white and feel weird when I wash my hands as well. I was hoping and praying that I wouldn't loose my nails but it looks as though I will be one of the unlucky ones and they are all going to go. Was it painful when the nails actually fell out and have your finger tips stopped being painful yet? Sarah xx",
      "MessageIndex": 25,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Tina, everything about this awful disease is so unfair but it seems magnified when we are only 32... I am praying for you that the results come back negative and it turns out to be some sort of skin irritation or allergy. Try to think positive thoughts if you can  - easier said than done I know but it will help you get through the next few days. The triple negaitve thing I think must be down to some sort of genetic influence because it does seem to affect more younger women who are otherwise healthy. I think that a trigger like a stressful event or ongoing stress on the body could be involved because this lowers the immune system then any stray cancer cells in the body can start to replicate unchecked. I went through a really tough time about 18 months ago which went on for many months and I think this is what enabled the cancer to grow. More research is definately needed on triple negative BC.... I have bought a really good book called 'Anti-Cancer - A New Way of LIfe' by Dr Servan-Screiber which gives advice on life style changes we can make to make the most of our bodies natural defenses against any future cancer growth. I would highly reccommend it. I haven't had the refferal through yet to see the gynae - it seems to be taking ages. I am also waiting for MRI of spine, X-ray of chest and Ultrasound of liver results from earier in the week. I requested these as annual screening for any secondaries due to my young age and agressiveness of my cancer. The hospital seems to take ages to get any results through. I have been feeling very low since finding out my genetics result and can't seem to pull out of it. It seems everyone else is out enjoying their lives and we are stuck in this nightmare of fear and anxiety. i hope the next few days pass quickly and the rsults are good ones. I have everything crossed for you and have put a prayer in my prayer box for you. Sarah xxx",
      "MessageIndex": 4,
      "PostDate": "13/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30430/rash-on-new-boob--onc-thinks-it-could-be-skin-mets--",
      "Title": "Rash on new boob- Onc thinks it could be skin mets :-("
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "Hi Tina, I'm really sorry to hear you are having to go through more stress with things. I hope your US goes ok and it turns out to be nothing to worry about. Your husband is reacting like my boyfriend who keeps telling me to be more positive but it is difficult when it seems like it is one thing after the other with this sh*t. I think it is their way of coping because if we are being negative then it scares them. Good luck for today - I will be thinking of you. Sarah xx",
      "MessageIndex": 1,
      "PostDate": "12/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30430/rash-on-new-boob--onc-thinks-it-could-be-skin-mets--",
      "Title": "Rash on new boob- Onc thinks it could be skin mets :-("
    },
    {
      "AuthorID": "Sarah32",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarah32",
      "Content": "I'm so sorry to hear about your diagnosis but you have come to the right place for support. I found this site brilliant over the past 8 months. I was diagnosed in October last year and was 31 and hadn't started a family yet so like you I was very distressed when told that after chemo there is a 50% chance I could be infertile. You need to speak to your oncologist straight away about going on Zolidex to try and preserve your ovaries. You can have this if you are oestrogen receptor positive so I'm not sure why he told you that you can't have it. I had Zolidex injections for the whole time I was on Chemo. It is a real shame you didn't get more advice before you started your chemo because you could have frozen some eggs or some embryos if you have a partner. I did a cycle of IVF pre-chemo but it wasn't very successful and I only got one embryo frozen (the IVF was paid for by the NHS because of my circumstances). You should contact your oncologist straight away about Zolidex. I'm sorry that the option of Ifreezing eggs/embryos wasn't offered to you by your care team before you started chemo. Take care Sarah xx",
      "MessageIndex": 3,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/29005/chemo-and-fertility",
      "Title": "Chemo and Fertility"
    }
  ]
}