{
  "AuthorID": "SaraDi",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/saradi",
  "Posts": [
    {
      "AuthorID": "SaraDi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/saradi",
      "Content": "I had 4 lots of epi then 4 (8) lots of cmf. I didn't get sick on cmf but I did have terrible problems with my digestive system which did give me slight feelings of nausia. Everyone is different and if you have suffered with sickness then talk to your chemo unit and get some drugs to help. Dont suffer in silence. CMF wasnt as bad as epi but the cummulitive affect was bad. My hair grew back with CMF too!",
      "MessageIndex": 1,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/21386/cmf",
      "Title": "cmf"
    },
    {
      "AuthorID": "SaraDi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/saradi",
      "Content": "Hi, I had a grade 3 tumour 33mm size and had a lumpectomy. The surgeon told me I would have a dent but I can't see it, in fact at my 6 month post op check up I told my surgeon that I liked my affected boob better than the other! The scars are fading now and to be honest with you, with a decent bra you cant see the difference. Dont worry too much. The only thing I found with radiotherapy is that my nipple got so so so so so sore and cracked so I bought some nursing breast pads, put a huge dollop of diprobase on it and that really really helped.",
      "MessageIndex": 4,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10995/body-image---lumpectomy",
      "Title": "Body Image - Lumpectomy"
    },
    {
      "AuthorID": "SaraDi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/saradi",
      "Content": "My lump was oestrogen receptive but my periods were normal throughout. Have just been through chemo (Epi and CMF) and they are still happening which has amazed my oncologist.",
      "MessageIndex": 2,
      "PostDate": "18/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10703/before-a-breast-lumps-was-discovered-did-your-periods-cease",
      "Title": "Before a breast lumps was discovered did your periods cease"
    },
    {
      "AuthorID": "SaraDi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/saradi",
      "Content": "Hi I felt EXACTLY the same as you and I have been on Tamoxifen for about 2 and a half months. I must say that the first month I started taking it I swelled up like a balloon and I was really scared. However, once the drug was in my system, the swelling fell away as quickly as it came. Since then, not many side effects. My fingers are still swollen after chemo and maybe the tamoxifen doesnt help but you wouldn't really notice its just I cant fit into my wedding ring. Mind you, I am wearing my Nains wedding ring and my Great Aunts engagement ring. I do get the odd hot flush but they are not as bad as people make out as long as you know what they are and prepare yourself. I carry a fan in my bag and that helps. Mind you, I still experience chemo chills so between them and hot flushes its a bit of a pain. Don't worry though, it will all work out.",
      "MessageIndex": 21,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23712/tamoxifen-it-sounds-awful-is-it-really-that-bad",
      "Title": "Tamoxifen It Sounds Awful Is it Really That Bad?"
    },
    {
      "AuthorID": "SaraDi",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/saradi",
      "Content": "Hi I had my lumpectomy and some nodes removed last Feb. I had stage 3 HER2 pos cancer which is also responsive to all hormones. The lumpectomy is a success and I can quite honestly say that apart from the scar my boob looks fine, just slightly smaller. I had 12 (8) rounds of chemo: 4 on epi-reubison, 4(8) on CMF followed by 15 sessions of radiotherapy and tamoxifen for 5 years oh and herceptin for a year. I know I am jumping the gun a bit but some words of advice about your treatment; Radiotherapy: make sure you get some diprobase in, I found my nipple became extremely sore so I bought some nursing breast pads, covered the pad in diprobase and that really helped. Take someone with you to your consultations, they can do the note taking for you. Have a list of questions and make sure that they are answered. Ask your consultant about scans etc. I had an MRI scan, lung xrays plus major organ scans but that could probably be because I was going onto chemo At each check up your consultant should check you over, including your bones and lungs. Good luck with your treatment  x",
      "MessageIndex": 9,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/24187/newbie-here",
      "Title": "Newbie here"
    }
  ]
}