{
  "AuthorID": "sarahjj",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarahjj",
  "Posts": [
    {
      "AuthorID": "sarahjj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarahjj",
      "Content": "I was referred to the breast clinic after finding a lump in the upper outer quadrant. I had the usual tests, mamo and ultrasound. The radiologist said she didn't like the look of the lump so decided on a biopsy. When I returned to see the nurse practitioner she told me they had already made me an appointment to see the consultant 2weeks later and that I would need treatment but could not determine what until the results came back. I was to bring someone with me as another pair of ears would be helpful. Is it common place to determine treatment is needed before the results unless they have a strong suspicion of cancer?",
      "MessageIndex": 25,
      "PostDate": "28/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69806/do-docs-play-down-cancer-until-they-get-biopsy-results-or-can-they-tell-just-from-the-scans",
      "Title": "Do docs play down cancer until they get biopsy results or can they..."
    },
    {
      "AuthorID": "sarahjj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarahjj",
      "Content": "Thank you for your replies. I'm sorry if I come accross as being anxious and naive. I've been down this path before but never as far as a biopsy. I just got the impression that they seem to know something, almost giving it away but of course couldn't say. I'm a very level headed person as a rule but naturally am slightly anxious. I have plenty to throw myself into in the interim. Thank again",
      "MessageIndex": 28,
      "PostDate": "28/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69806/do-docs-play-down-cancer-until-they-get-biopsy-results-or-can-they-tell-just-from-the-scans",
      "Title": "Do docs play down cancer until they get biopsy results or can they..."
    },
    {
      "AuthorID": "sarahjj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sarahjj",
      "Content": "I was wondering if anyone else experienced bouts of dizziness and fatigue even before treatment started. I only received my diagnosis 5 days ago but I have been feeling under the weather for a few weeks. It is quite likely unrelated but of course it makes you wonder if there is a connection.  I'm finding that I get four or five hours into work then feel unwell. It's not all the time but enough to be a concern. Sarah",
      "MessageIndex": 0,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109174/dizzy-and-fatigued",
      "Title": "Dizzy and fatigued"
    }
  ]
}