{
  "AuthorID": "sazmoz",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sazmoz",
  "Posts": [
    {
      "AuthorID": "sazmoz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sazmoz",
      "Content": "Dear Carolyn  Thank you so much, your reply not only is really helpful but also means so much as I have no one to talk to. I hope that you are well and that everything is going well for you. I'm also sorry I didn't introduce myself properly, just went straight in (in rabbit in the headlights mode). So again thank you for replying. I'm 45, my aunty had breat cancer and now thankfully in remission for around five years. My doctor has asked me to return next Friday, but only if I've had my period (of course this hasn't arrived as I've wound myself up too much).  I've had breast pain for a few weeks, I checked myself but couldn't feel anything and still can't. My arm aches and my shoulder is tender also, I was hoping the doctor was going to tell me I'd pulled something, so totally shocked when she said I had a lump.  Thank you again and big hugs right back at you x",
      "MessageIndex": 2,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128299/pain-in-breast-and-lump-found-by-doctor",
      "Title": "Pain in breast and lump found by doctor"
    },
    {
      "AuthorID": "sazmoz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sazmoz",
      "Content": "Hi MistyMolly Thank you so much. What a wonderful group you are. Xx",
      "MessageIndex": 4,
      "PostDate": "06/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128299/pain-in-breast-and-lump-found-by-doctor",
      "Title": "Pain in breast and lump found by doctor"
    },
    {
      "AuthorID": "sazmoz",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sazmoz",
      "Content": "Hi, I've been suffering pain in my left breast, shoulder and arm (tender with a dull heavy ache) I'm recovering from a chest infection, but went to the doctor as my breast felt weird. I couldn't feel a lump, so was hoping the doctor would say I'd just pulled a muscle, but she found a lump on the side of my breast. I have to go back after my period (hopefully next week). She's told me not to worry, so of course I'm going nuts! How long does it normally take to get a diagnosis from the time a lump is found? I'm finding all the information on symptoms really confusing. Sorry for the ramble x",
      "MessageIndex": 0,
      "PostDate": "05/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128299/pain-in-breast-and-lump-found-by-doctor",
      "Title": "Pain in breast and lump found by doctor"
    }
  ]
}