{
  "AuthorID": "scarlett77",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scarlett77",
  "Posts": [{
    "AuthorID": "scarlett77",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scarlett77",
    "Content": "I have had two portacaths as I have had two different cancer treatments about 5 years apart. I got my first one because I was having so much trouble with the picc lines. Picc lines hurt! Mine kept getting infected and getting banged around. The porta cath was a breath of fresh air for me after all the issues with picc lines. Others have described a sharp pinch when the porta cath is accessed. That is a very good description of what it feels like. I just held my breath and it was over in a second. For my second round of treatments, I had them put in a porta cath right away to avoid issues with picc lines (which are inserted to the vein from the exterior. Mine were stitched in place and taped down but they were always getting irritated by moving my arm. It is easy to brush against them - which HURTS. I am also diabetic and prone to infections so they kept having to replace the darn things. I have lots of little circular scars from having them on my arm. I was left with lymphedema after breast surgery so they could only use my right arm. Whew! This thread brings up some memories for me. It is awful that you have to pay out of pocket for your porta cath. I live in the US and am lucky enough to have very good insurance. The whole cancer \"experience\" made me very aware of the problems many folks have who have a less complete policy or who (heaven forbid) have no insurance at all. I don't know how they do it... I am wishing you the best of luck with your treatments. May they go smoothly, be successful and result in a total eradication of your cancer.",
    "MessageIndex": 10,
    "PostDate": "28/04/2009",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10914/portacath",
    "Title": "Portacath"
  }]
}