{
  "AuthorID": "ScienceTeach",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scienceteach",
  "Posts": [
    {
      "AuthorID": "ScienceTeach",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scienceteach",
      "Content": "Thank you so much for your reply, it’s helped me put things in perspective. Xx",
      "MessageIndex": 2,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179575/cyst-found-at-clinic-now-called-back-for-mass-on-mammogram",
      "Title": "Cyst found at clinic, now called back for mass on mammogram"
    },
    {
      "AuthorID": "ScienceTeach",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scienceteach",
      "Content": "I went to the GP after finding a lump on my breast, he referred me on the 2 week referral system and I was seen by a registrar the following day, a week later I had mammogram and ultrasound. The consultant who did the ultrasound said I just had a cyst, he drained it, told me I had nothing to worry about and I went on my merry way feeling amazingly relieved. The consultant has now called me two days later to say that having looked at the mammogram there is an unusual tissue mass underneath where the cyst was and that they have rearranged some other appointments to get me back in quickly for a spot compression mammogram and biopsy. I have this appointment next Tuesday. I feel like I’ve been hit in the gut, I was elated a couple of days ago to be told it was just a cyst and nothing to worry about. I know I shouldn’t be reading into him saying they are moving appointments to get me in quicker, but it’s hard not to.  Im now petrified. I can’t see anything on line about a link between cysts and tumours, is this just a coincidence. Anyone else had an experience like this? thanks x",
      "MessageIndex": 0,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179575/cyst-found-at-clinic-now-called-back-for-mass-on-mammogram",
      "Title": "Cyst found at clinic, now called back for mass on mammogram"
    }
  ]
}