{
  "AuthorID": "Scots Lol",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scots-lol",
  "Posts": [
    {
      "AuthorID": "Scots Lol",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scots-lol",
      "Content": "I'm very disappointed that Macmillan have chose to promote 'Brave the Shave' again. Especially after so many of us have stated we find it not just offensive, but that it also trivialises what for most of us is a very traumatic experience.  I think my main problem with people 'braving the shave' is when they think it means they now know what we're going through! Many do it just to 'be supportive' and aren't even fundraising So no, you have no idea what I'm going through You chose to shave, we didn't get a choice.  Yours came off in 2 mins and was pain free. Ours took 2 weeks and was painful as well as emotional.  Yours will start to grow back within days. We'll be bald for months. Your hair will return in the same condition and colour as before. We will have to put up with grey or white frazzled fluff in a completely different texture.  Within a month or two of the shave, you will be able to have a hairstyle and any treatments you choose.  It could be well over a year for us to have anything resembling normal hair, and most treatments ( i.e colour) will be banned for months.  You still have eyebrows and eyelashes, you can put makeup and mascara on and still 'look good bald'. I have to draw on eyebrows and use makeup, just to look 'normal'.  You do NOT know how I felt/feel and you being bald is not supporting me.  I am grateful for all fundraising, but surely something else can be done?",
      "MessageIndex": 303,
      "PostDate": "02/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Scots Lol",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scots-lol",
      "Content": "Feel free to use mine.",
      "MessageIndex": 330,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Scots Lol",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scots-lol",
      "Content": "Richard Taylor, I do hope you are paying attention to this thread and intend to actually listen to those of us who are strongly opposed to the 'Brave the Shave' campaign.  The vast majority of us who have had to live through chemo and the unwanted hair loss that it entail, are vehemently against it. Can you give us any reassurance that Macmillan will look at ending this stream of fundraising? (My comment on page 21 sums up many of the reasons)",
      "MessageIndex": 343,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    }
  ]
}