{
  "AuthorID": "Scousebear",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scousebear",
  "Posts": [
    {
      "AuthorID": "Scousebear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scousebear",
      "Content": "Hi Julie, please stop telling yourself that you shouldn't be feeling like this. There are no hard and fast rules and everyone is different. The emotions that you are feeling is all part of your healing process so let them wash over you, it's really okay to get upset, this is your journey Julie. We all react in different ways. I resigned from my job on the 3rd of Jan as we are relocating to Cornwall ( I had to give 3 months notice ) when I got home on that day there was a letter recalling me as my routine mammogram had detected a lump. I had a lumpectomy on 24th of Jan, lymph nodes are clear thankfully. I struggled with being told it was cancer and then 2 weeks later being told I was clear !! It's an absolute rollercoaster of a ride, but the ride is taking you to a destination, one day you will wake up and this will be in the past and you can realise how strong you are. Currently halfway through RT, still working my notice. Last RT session is 28th March, last day at work is 29th. Moving 360 miles on 5th of April. Feels overwhelming at times but I am focusing on the first morning I wake up and realise that it's all done. Go easy on yourself and allow yourself to just be. Work can wait until you are ready xxx",
      "MessageIndex": 9,
      "PostDate": "18/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152487/had-operation-awaiting-radiotherapy",
      "Title": "Had operation awaiting radiotherapy"
    },
    {
      "AuthorID": "Scousebear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scousebear",
      "Content": "Thank you Leolady I think I need to allow myself to feel whatever needs to be felt and also appreciate the fact that I have just moved 360 miles away from everything that was familiar. It's all a little scary !! I have been on the Maggie's website and found some useful info so thank you for the link. One day at a time xx",
      "MessageIndex": 2,
      "PostDate": "12/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154838/flipping-shattered",
      "Title": "Flipping shattered !!"
    },
    {
      "AuthorID": "Scousebear",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scousebear",
      "Content": "Hello diagnosed with primary breast cancer on 15th Jan. At that time I was in the last stages of relocating to Cornwall and had just handed 3 months notice in at work on 3rd of Jan. Had surgery and subsequent RT which finished the day before my last day at work on 29th of March. Worked all through treatment apart from 2 weeks after surgery. I am clear now. Moved to Cornwall on the 6th April from West York's. It's been full on plus my employer (ex now ) treated me appallingly after I resigned and my subsequent diagnosis and I have an on going grievance with them. I think my difficulty is the fact that I don't feel that it has registered that I have had cancer. There was too much other stuff going on at the time and it all seems a blur. I feel like it's lurking there in my subconscious but I have no idea how to coax if forward so I can finally think \" wow !! You got through this. Part of me thinks maybe there will not be any defining moment and that basically I just got on with it and I am lucky. But part of me too thinks that I need to address it so I can put it to rest and move on. Maybe moving boxes and inhaling bubble wrap has addled my brain !! Any suggestion to exorcise the demon in my head gratefully received xxx",
      "MessageIndex": 0,
      "PostDate": "11/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154838/flipping-shattered",
      "Title": "Flipping shattered !!"
    }
  ]
}