{
  "AuthorID": "scousenana",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scousenana",
  "Posts": [
    {
      "AuthorID": "scousenana",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scousenana",
      "Content": "I was diagnosed with breast cancer last week, i am having a lumpectomy and removal of lymph nodes on June 13. I still can't believe it, it's as though i'm watching all this happening to someone else. I keep looking at the test form from the hospital....my names there... the fact i have breast cancer is there, yet it's all so unreal. There is a history of breast cancer in my family, so i am now scared for my daughters, they have taken the news badly, as i knew they would. Tuesday, i cried most of the day, but mostly i am calm and relaxed.....am i still in denial...... i think so. I'm so scared that when it finally hits me, i won't be able to cope. On top of all this, i have to have a hysteroscopy and biopsy. I've got all my pre op tests on Friday, that frightens me, it's all going to fast, too fast for me to be able to digest it all. I have a lot od support at home, but i won't ask for any help because that's admitting there's something wrong. Is it normal to feel this way? Or is there a normal way to feel? Jean xx",
      "MessageIndex": 0,
      "PostDate": "15/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10726/just-diagnosed-but-why-am-i-so-calm",
      "Title": "Just diagnosed, but why am i so calm?"
    },
    {
      "AuthorID": "scousenana",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/scousenana",
      "Content": "Hi Everyone, Thanks for the replies. I'm so glad i joined this site, knowing others feel exactly the same as me really helps. I went for my hysteroscopy and biopsy on Thursday, but the consultant wouldn't do it. he said my weight would make even more painful than it needs to be, So he's going to do it while i'm having my breast op. Going back to the hospital Monday for ECG and Lung function test, also going to meet the anethsetist. Friday was a bad day for me, i just felt so angry and scared. Claudia my BC nurse has re-assured me that i will feel up some days and down some days, but it's all \"normal\". My daughters have taken the news badly. They had convinced themselves that the mammogram could be wrong, and when the biopsy results came through, and confirmed i had BC, it became real. I've been offered genes testing, at least then i will be able to re-assure my daughters (I hope) I'm so tired at the moment, i don't know if it's all the hospital visits and tests, or if it's the BC (probably both) I'm not sleeping very well, waking up at about 4am most days, then dozing on and off during the day..... sleeping my life away :-) I hope everyone is keeping well. Hope to chat in chat soon. Take care Love Jean xxx",
      "MessageIndex": 7,
      "PostDate": "17/05/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10726/just-diagnosed-but-why-am-i-so-calm",
      "Title": "Just diagnosed, but why am i so calm?"
    }
  ]
}