{
  "AuthorID": "Seapebbles",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/seapebbles",
  "Posts": [
    {
      "AuthorID": "Seapebbles",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/seapebbles",
      "Content": "Hello, I'm feeling very overwhelmed right now. Although it was not breast cancer and my wonderful nan was a grand age of 92 I have spend the last month ( excluding past week when she was in hospice) nursing her at home.  I had been having pain under my left arm before Christmas, I visited the doctor who told me to go back in January if it was still there. I couldn't find any lumps. Fast forward to February  still pain I have an exam the doctor doesn't find a lump either and tells me it's one of those things. I'm 35 with no family history of Brest cancer. Now on the same day I've found a lump and the pain has come back. I had to see a locum doctor as my female gp was away . She didn't really say much other than I was to be referred to the breast clinic. My appointments next Tuesday. I work in health care. I've read the statistics. My rahional brain is telling me to stay calm until told otherwise, but after seeing my nan go through what she did and having all the questions about dying my daughter has been asking me my normally never cries and composed self is a complete wreck. I know that no one can give me any answers, but I don't feel I can tell my family about this at the moment and just need to let it out somewhere.x",
      "MessageIndex": 0,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128208/breast-cancer-referral-after-my-nans-passed-away-from-cancer-the-same-day",
      "Title": "Breast Cancer referral after my nans passed away from cancer the same..."
    },
    {
      "AuthorID": "Seapebbles",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/seapebbles",
      "Content": "Thank you both for your kind words, I feel a repeating pattern emerging. I have had a few health issues over the last year, I've had an abnormal smear result and have precancerous cells, (CIN1) next smear is in august. I had a 2 week wait referral only 2 months ago because my glands in throat had been swollen since before xmas too and I had a continuous croaky voice (thankfully all ok there). Before this I'd never had any health problems.  I'm just desperate for Tuesday to be here so whatever happens, even if it is the worst I will know. It's the not knowing that's driving me crazy. Although I guess you don't know for sure at the first appointment you get some idea I think from what I've read from people's posts?x ",
      "MessageIndex": 3,
      "PostDate": "04/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128208/breast-cancer-referral-after-my-nans-passed-away-from-cancer-the-same-day",
      "Title": "Breast Cancer referral after my nans passed away from cancer the same..."
    }
  ]
}