{
  "AuthorID": "seasidecyn",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/seasidecyn",
  "Posts": [
    {
      "AuthorID": "seasidecyn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/seasidecyn",
      "Content": "Hi there Nice to hear from friendly voices already, thank you.  Well done on the 18 week chemo completion - woo hoo. What a journey right!? Sending you all the best vibes for results of MRI and I think already being proud of your body for how is coped with chemo is a reason for a little jiggle. I'd be really happy to answer any questions you may have for me, as I might be that few week 'ahead'. I had the 18 weeks of chemo and then surgery for lymph node clearance under my right arm. And now feel physically really good. It's the emotional side that has up and down days - and it's hard to say what is causing what - between all the drugs and then just good old personality! I've never been the easiest person so I dont think I can get way with blaming the Tamoxifen for it all :)  Meditation and yoga is my best medicine - and now I've added to my tool-box this community chat too, which feels great.  seasidecyn",
      "MessageIndex": 4,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171652/just-joined",
      "Title": "Just joined :)"
    },
    {
      "AuthorID": "seasidecyn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/seasidecyn",
      "Content": "Hi there  I'm new to this on-line community and not really so sure where to start but I know I feel that a community will be a healthy thing for me, both from a receiving and giving perspective.  I was diagnosed with breast cancer in Feb this year, I'm 44. I've completed 18 weeks of chemotherapy and had lymp-node clearance surgery. I'm all clear now :) and recovering really well and physically feel strong and good. The thing I am struggling with at this stage is mood and being so volatile. I am still on Herceptin injections until March 2019 and also on Tamoxifen for 5-10 years. It may well be the latter that is playing see-saw with my emotions. I am sure I'm not alone in how I feel but it does feel quiet overwhelming when I cant get a grip of my emotions. So I think chatting in this community might be a very good thing. I have good friends around me and an amazing partner but I feel that being in community where shared experiences are understood will be great.  I look forward to some chats and hope I can add to the community as well :)  seasidecyn xx",
      "MessageIndex": 0,
      "PostDate": "14/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171652/just-joined",
      "Title": "Just joined :)"
    }
  ]
}