{
  "AuthorID": "ShadesofDawn",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
  "Posts": [
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "I believe it's quite normal to get lumps and bumps along your DIEP scar line ... I too was concerned as I found one, but on my follow up appointment I mentioned it, and they said it's quite normal ... Just simply keep massaging them along the line and lumps with bio oil  it's all part of the healing process and the way 'your' body heals ... Some get them others don't ... I keep in contact with one of the ladies I was in a ward with .... And she has them.  It can be fatty tissue or over excess of your body producing to heal ... So massage them to break them down  obviously keep a check on any changes ... You could call the BCN's if you are really worried at the hospital where you had your op to put your mind at rest  X         ",
      "MessageIndex": 3,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100708/diep-reconstruction---springy-lumps-along-scar-line",
      "Title": "DIEP Reconstruction - Springy lumps along scar line"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "Hope all goes well for you lazyla x thinking of you ",
      "MessageIndex": 7,
      "PostDate": "09/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99651/is-it-back",
      "Title": "Is it back?"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "Hi Ellen i had a left mascetomy and immediate DIEP reconstruction at the end of March  I think if you've already braved chemo then this should be a piece of cake for you.  My surgery was 9 hours and unfortunately for me due to having an old scar from a gall bladder operation 20 odd years ago my scar is very high and goes through the 'new' navel and is in a ^ shape, but this won't be the case for you. My hospital stay was 6 days. Surprisingly, I don't recall any pain and they supply you with over the counter pain killers- I found the ibroufen made me feel sick so I stopped taking them.  You will probably find that you are closely monitored (every 15-30 mins) checking if blood pressure and surgery and pain which is very tiring kept being waken up... But as the days go by this becomes less. You will also have an oxygen supply and compression cuffs on your ankles that continually inflate at intervals, which again disturb your sleep.  The next day the nurses wil assist you getting out of bed and into a chair  - the most awkward thing is getting around with the tubes and drains which there are around 4, they are popped into pillow cases. So expect to see some blood and fluids and as you become more mobile as days go on there will be less. Drink as much as you can which I found hard but it really helps your progress - the nurses will encourage and monitor your drinking. The drains at site can become uncomfortable where the tubes pull.... The nurses will get you walking further each day and it's surprising at first how wobbly you are ... But your confidence grows as does your mobility. They will assist you with showering and then hand washing and then you are able to do this on your own - just take it all easy and slowly  Ha! As you get better, they will remove the tubes and drains and it feels quite exciting and an achievement when that final last one comes out Do remember to keep up with the little exercises they show you and given in the leaflet as you can easily become stiff and also reduces the pulling or cording under the arm after leaving hospital and bio oil is strongly recommended for massaging into the scars once healed enough  again read through the leaflet regarding reconstruction. I developed 'dog ears' at the end of my stomach scars so will require another little op to correct this next year and with lipofilling as the reconstruction once settled down can have indents and of course there is the nipple reconstruction to consider  But as I said if you've gone through chemo you've gone through the worse already and this you can easily take in your stride  Wishing you all the very best x      ",
      "MessageIndex": 4,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99871/diep-reconstruction---recovery",
      "Title": "Diep reconstruction - recovery"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "I feel the same too LynnMcW x the initial shock, numbness ... Going into autopilot ... Whilst you go here there, waiting outcome ... Then treatment ... The physical recovery of all the procedures .... Having gone all through that and being left with all the uncertainty ... And that it could come back many years from now  Not a happy place   ",
      "MessageIndex": 16,
      "PostDate": "05/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99391/getting-back-to-normal",
      "Title": "Getting back to \"normal\""
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "I just read this .... Anyone heard about Keytruda ... Is it available here .... Has anyone been advised to boost their immune system up  its great to hear of new and effective medicines to combat this dreadful disease Former President Jimmy Carter is responding well to cancer treatment and doctors have found no evidence of new tumours, his spokeswoman has said. Mr Carter revealed in August he was starting radiation treatment after doctors found four melanoma spots on his brain. The 91-year-old underwent targeted radiation on the tumours and four doses of Keytruda, a newly approved immune-boosting drug to help his body seek out any new cancer cells, Deanna Congileo said in a statement.",
      "MessageIndex": 0,
      "PostDate": "11/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101117/new-keytruda-cancer-seeking-immune-boosting-drug",
      "Title": "New Keytruda cancer seeking Immune boosting drug"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "HA! - don't worry ....... Im'a real SOD ha ha ha ..... Sounds hopeful for TNBC,,,,,,,,,,",
      "MessageIndex": 4,
      "PostDate": "12/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/101117/new-keytruda-cancer-seeking-immune-boosting-drug",
      "Title": "New Keytruda cancer seeking Immune boosting drug"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "Hi Clare I had a DIEP last day of March and had a previously booked holiday to Spain in middle of June which I had to cancel - you could call the BCN at where your having your surgery they can advise you best but we were told minimum time would be 3 months, and they were not really keen so soon. Depends to as to where you are traveling if it's long haul etc  i think you then have a check up around 6 weeks after release. Don't forget that it's a very delicate and major surgery you are having and your body needs time to heal well and given the altitude and cabin pressure could put stress on what you have waited so long to achieve Though I was disappointend that I couldn't go away I'm glad in the end we didn't as I wouldn't have been physically able or mentally to enjoy it .... I had to have 15 rads after and that started in the middle of June so it's just as well we cancelled, and of course not really allowed to go out in the sun without really covering up. If all goes well we are hoping to go next year and my scars hopefully will be less noticeable and the past behind can relax and enjoy. I was unfortunate due to already having a scar from a gall bladder operation 20 years prior resulted in my DIEP scar being very high up into my waist  wishing you well Clare and enjoy the new you ... Not too long to wait now. Speak to your BCN they can advise you best ... You've been waiting all this time so a little longer won't hurt and it will give you a boost and something to look forward to and show off the new you :) Dawn X ",
      "MessageIndex": 19,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100815/diep-reconstruction",
      "Title": "Diep Reconstruction"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "Hi Clare I had a DIEP last day of March and had a previously booked holiday to Spain in middle of June which I had to cancel - you could call the BCN at where your having your surgery they can advise you best but we were told minimum time would be 3 months, and they were not really keen so soon. Depends to as to where you are traveling if it's long haul etc  i think you then have a check up around 6 weeks after release. Don't forget that it's a very delicate and major surgery you are having and your body needs time to heal well and given the altitude and cabin pressure could put stress on what you have waited so long to achieve Though I was disappointend that I couldn't go away I'm glad in the end we didn't as I wouldn't have been physically able or mentally to enjoy it .... I had to have 15 rads after and that started in the middle of June so it's just as well we cancelled, and of course not really allowed to go out in the sun without really covering up. If all goes well we are hoping to go next year and my scars hopefully will be less noticeable and the past behind can relax and enjoy. I was unfortunate due to already having a scar from a gall bladder operation 20 years prior resulted in my DIEP scar being very high up into my waist  wishing you well Clare and enjoy the new you ... Not too long to wait now. Speak to your BCN they can advise you best ... You've been waiting all this time so a little longer won't hurt and it will give you a boost and something to look forward to and show off the new you :) Dawn X ",
      "MessageIndex": 4,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100815/diep-reconstruction",
      "Title": "Diep Reconstruction"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "... What does that mean ?  \"HER2 2+ Borderline FISH Not Amplified\" I read that you are either positive or negative  ... So what is the above? ",
      "MessageIndex": 0,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108475/her2-2-borderline-fish-not-amplified",
      "Title": "HER2 2+ Borderline FISH Not Amplified"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "Hi Dreamthief!  Thank you for posting ... Yes, gets all a bit too techi for me  That's good news then, as would seem to indicate its Negative  Thank you  The oncologist discharged me from he's care on Friday  and this was mentioned in the copy of the letter to my GP and I had no idea what it meant ",
      "MessageIndex": 2,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108475/her2-2-borderline-fish-not-amplified",
      "Title": "HER2 2+ Borderline FISH Not Amplified"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "Thank you all very much for taking the time to reply, your answers and statements have helped me a great deal.  I should have posted whilst I was going through the processes, though I did come in to the site and read the postings - I think I felt talking about it made it even more real, but in hindsight I think you would have really helped :) yes, I think you are right Crystaljuju, I think my question took him by surprise ! I had only asked as I believe I read on here that some hospital/areas offer free radiation tattoo removal, so with this in mind was surprised of him stating that they should remain when he had quoted such a low recurrence score Sorry Dreamthief, my bad, it was my radiologist whom I was speaking to, the one that had planned my radiation treatment.  I'm still surprised though with such a low recurrence percentage that he would still ask for them to remain as surely everything is recorded and measured - I never thought of them fading, so thank you for that and also that I could speak to my GP if need be for a referral to a dermatologist ... It's early days still I guess as only finished radiation in June  Unfortunately Crystaljuju mine look like blackheads lol rather than nice freckles I just felt rather than have to see it every single day and be reminded, with at least the chest tat removed, I could put everything to bed, done and dusted ... And move on  perhaps it's all still too soon and new and like everything, will fade in time  many thanks you have given me some positives to think on  i have further reconstruction and lipofil to be carried out but this won't be for several months now  I had a DIEP and immediate reconstruction last day of March  xx      ",
      "MessageIndex": 4,
      "PostDate": "14/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97638/radiation-tattoo-shock",
      "Title": "Radiation tattoo shock!"
    },
    {
      "AuthorID": "ShadesofDawn",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shadesofdawn",
      "Content": "Hello  I saw my oncologist today for the follow up after completing a three week course of adjuvant radiation in June of this year - having had a mastectomy and immediate reconstruction in April.  He said Everything is fine and he said that  he will see me next year.   I asked him if he knew where I could have my radiation tattoos removed to which he pulled a face and said 'umm  I'd rather you didn't as they show us exactly you have been treated should the cancer return or go into your other breast!!!! I asked how likely was it to return or start a new and he said 4% and with me being on Letrozole would be even better so if it's such a low chance of coming back why would he be so insistent that I don't have them removed I feel rather concerned and worried    ",
      "MessageIndex": 0,
      "PostDate": "13/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97638/radiation-tattoo-shock",
      "Title": "Radiation tattoo shock!"
    }
  ]
}