{
  "AuthorID": "sharoncampbell",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sharoncampbell",
  "Posts": [
    {
      "AuthorID": "sharoncampbell",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sharoncampbell",
      "Content": "hi every one its been quite a while since i needed your help. i was diagnosed in jan 2010, i had a lumpectomy followed by chemo and rads, then herceptin and now tamoxifen. lately i have been feeling really tired and have had an on going problem with my stomach and back pain. i went to see my g p who pushed an appointment forward with my consultant, she also done some bloods which have came back with low platelets? i have to go and have the bloods done again in 2 weeks, as you can imagine my mind is now racing. i do have an appointment with the breast specialist in 2 weeks as well but im not sure i can wait that long! has any one else had simmilar experiences and can shed any light on this please. sharon",
      "MessageIndex": 0,
      "PostDate": "30/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46644/problem-with-bloods",
      "Title": "problem with bloods"
    },
    {
      "AuthorID": "sharoncampbell",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sharoncampbell",
      "Content": "hi i should have had my first docetaxel on friday the 28, but due to a dose of cold last week it was put off for 11 days. so i know ave another week to think about it and worry. i have been reading all of the posts and must say im looking forward to it even less now. it does help to read other peoples experiences and take on some of there advice (I WILL MAKE SURE I HAVE PLENTY OF PAIN KILLERS IN MY CUPBOARDS). so thanks to you all for advice offered. sharon",
      "MessageIndex": 20,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25912/docetaxel---advice-on-what-to-expect",
      "Title": "Docetaxel - advice on what to expect!"
    }
  ]
}