{
  "AuthorID": "sharry",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sharry",
  "Posts": [
    {
      "AuthorID": "sharry",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sharry",
      "Content": "Hi I don't know anything about your drugs, but I can tell you that any product (including drugs) which state \"not suitable for vegetarians\" is because they contain animal products. Starflower oil would be in capsule form and the capsules made from gelatine (an animal by-product). Good luck with controlling the flushes and the rest of your treatment Sharry",
      "MessageIndex": 1,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10741/hot-flushes",
      "Title": "Hot flushes!!!!!!"
    },
    {
      "AuthorID": "sharry",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sharry",
      "Content": "good luck honey - will be thinking of you this afternoon. please let us know how you get on Sharry xx",
      "MessageIndex": 16,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10896/long-wait---is-there-anything-or-any-way-to-speed-it-up",
      "Title": "long wait - is there anything or any way to speed it up"
    },
    {
      "AuthorID": "sharry",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sharry",
      "Content": "Hiya I was so sorry to read you are finding the waiting so difficult. It's definitely high up on the stress scale! Once you know what is going on it is so much easier to deal with, you can plan your life again, but its no knowing which is so frightening. Although I did not have breast cancer, I had a cancer in the breast tissue and had a mastectomy 4 weeks ago. I was fine (mostly!!) up until I had to have the CT scan, then I got really scared. When I went for the results I fully expected him to tell me he was surprised I could still walk - that I was riddled with cancer in every organ, but fortunately it was only in the breast. I was so scared I didn't tell my hubby I was going for the results as I didn't want anyone with me. We all have good days and bad, but there will always be someone here who can hold your hand, give you a hug or point you in the right direction for advice. Please let us all know how you get on with your scan, we are all thinking of you love n hugs Sharry xx",
      "MessageIndex": 5,
      "PostDate": "15/07/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10748/had-all-surgery-now-chemo-starts-so-scared",
      "Title": "had all surgery now chemo starts so scared"
    },
    {
      "AuthorID": "sharry",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sharry",
      "Content": "I've attached a link to the cancerbackup support section on fatigue which may help. It gives hints and tips on how to cope. Rest assured you are not alone in this, I \"only\" had surgery in June, no radio or chemo, but I still need to be in bed around 11 every night, before cancer it was at least 12/12:30. By the time you add in treatments, stress, hormones and a young family no wonder you are tired. I hope the link helps love and gentle hugs Sharry xx http://www.cancerbackup.org.uk/Resourcessupport/Symptomssideeffects/Fatigue",
      "MessageIndex": 1,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/11013/paronoid-or-something-lurking",
      "Title": "Paronoid or something lurking"
    }
  ]
}