{
  "AuthorID": "SheenaBee",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sheenabee",
  "Posts": [
    {
      "AuthorID": "SheenaBee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sheenabee",
      "Content": "Hi there, My advice would be to not buy anything in advance. Lots of people told me what I should buy so off I went and got them only to find that they did'nt work for me. I have not had a reconstruction yet, ( 2 years at least before this happens) but a mastectomy with full axillary clearance.  The things I found most helpful were the secret support vest tops either the day time or the sleep wear versions, although the elastic on one of them seems a bit tight so I am going to snip it to release a bit of pressure. I am also able to simply wear vest tops without the support for days when I don't feel like it but I am not sure how supported you are supposed to keep a reconstructed breast - you may want to ask the BCnurses on that one. I found that wearing one of these meant there was less pressure on any wounds, rather than struggling with a bra and, in my case my back and underarm area were swollen from the surgery putting a full 4 inches accross my back measurement to start with, which made wearing a bra so uncomfortable.  Another tip: buy some bra extenders so you can allow for this temporary increase in your back measurement. The best bit of all about secret support, is that it is easier to get in and out of that struggling to do up a bra, and if you are really struggling, you can just sleep in it as well so only one struggle a day was good for me in the beginning.  Good luck, anyway and take care Sheena xx",
      "MessageIndex": 1,
      "PostDate": "22/03/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/36531/post-surgery-bras",
      "Title": "Post Surgery Bras!!"
    },
    {
      "AuthorID": "SheenaBee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sheenabee",
      "Content": "Hi, After my review appointment was brought forward by 3 days, the team have me undergoing tests for the rest of the week and booked an apppointment for me with the consultant oncologist for Friday. Apparently 8 out 27 nodes were cancerous so am being checked out for further spread - as others have indicated on this forum, it is almost as scary as finding out I had breast cancer in the first place. The tumour in my breast was recorded at 5cm when the decision was taken to do a full mastectomy but under the path lab report was reported as 12cm. We knew it was agressive and very fast growning but although I cannot help but praise the service I am getting from the entire team,  the speed at which they are now getting me into the system worries me.Has this happened to others? thanks in advance for any reassurances Sheena xx   p.s. still needing draining and consultant said I may need this a couple more times but we are progressing to once a week now!",
      "MessageIndex": 0,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/35767/ct-and-bone-scans",
      "Title": "CT and bone scans"
    },
    {
      "AuthorID": "SheenaBee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sheenabee",
      "Content": "Hi Tess and Debra Thank you so much for your replies. I was really very anxious indeed and am really pleased to let you know that the scans came back clear(Phew!). We met with the Consultant Oncologist yesterday who reassured me but also stressed that because my breast cancer was so aggressive, we need to respond quicky with an aggressive Chemo - so will be starting TAC in just over a weeks time, followed by radiotherapy, Herceptin and the hormone drug.  I think there is a long way to go but knowing that we have a good chance of beating this disease is comforting. I have to say, that the chemo sounds horrendous so I am hoping that I don't get too many of the possible side effects. One thing you were both right about was the fantastic support from the hospital - I am so impressed with the service I'm expecting a bill through the door any time now, as I am convinced they think I am a private patient ( lol) thanks again for your support. best",
      "MessageIndex": 3,
      "PostDate": "26/02/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/35767/ct-and-bone-scans",
      "Title": "CT and bone scans"
    },
    {
      "AuthorID": "SheenaBee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sheenabee",
      "Content": "This time last year I was feeling pretty grim - part way through my Chemo and not even started my radio , yet I cannot believe how true the saying ' what a difference a year makes'. I have been back working since the start of the year, am exited about things that I never would have been before, enjoy every moment of my life - even though it is sometimes boring. I have got back to walking and am now fitter that I was before my diagnosis, and despite the Tamoxifen, and the Herceptin, I have been following a diet and have lost over 2 stone . I feel great and my confidence is pretty good too!  I would not wish this illness on anyone but I can honestly say, that I have have now got such a positive outlook on life, which I probably would not have had if it was not for the cancer! I wish I could bottle it!",
      "MessageIndex": 6,
      "PostDate": "22/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49217/low-confidence-issues-0",
      "Title": "low confidence issues :0("
    }
  ]
}