{
  "AuthorID": "Shellyd",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
  "Posts": [
    {
      "AuthorID": "Shellyd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
      "Content": "Hi Emma, I was diagnosed with DCIS in Jan 2012, and after having two operations to remove the affected area they still didn't get it all.  I than had to have a mastectomy as there would be very little breast left, and I wanted to make sure it was gone.  With me having the mastectomy my consultant asked me how I would feel about have the left one removed as well, as he said my risk off getting cancer again was high, due to the fact of my family history and the fact I already had it in the right. For me there was no discision I had them both removed 5 week ago with implant reconstruction. I have 2 boys who I want to see grow up more than anything in life. I feel so sorry that you have to make this decision, and at such a young age (I'm 43) my heart goes out to you what ever you decide. Big hugs Shelly  ",
      "MessageIndex": 2,
      "PostDate": "05/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49576/preventive-surgery",
      "Title": "Preventive surgery"
    },
    {
      "AuthorID": "Shellyd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
      "Content": "Hi Gail, I had a dougle mastsectomy 6 week ago today, and I am still getting the odd niggley pains, in my breast bone, ribs and collar bone. Its not a small operation you've had and there will be brusing still to come out.  I have been using some Ibelive gel ( not sure I've spelt that right) and it is doing the trick. But if your worried ring your breast cancer nurse, hopefully she will be able to put your mind at rest. Hope everything goes well for you.   Kind regards Shelly",
      "MessageIndex": 1,
      "PostDate": "09/05/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49718/pain-after-mastectomy",
      "Title": "Pain after mastectomy"
    },
    {
      "AuthorID": "Shellyd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
      "Content": "Thanks mistymoley I have had permanent gel implants put in I think. It was a bit of a surprise, as at my consultation we dicided on double mastectomy and expanders, as they were a little concerned about the scar from the first 2 ops. and I was quite large. However, the morning of my op. the ps asked if I minded going smaller. to which I said no. I woke up with implants in. I haven't seen anyone to talk to, and don't see my consultant until the 17th when I get the rest of my results. I think I may contact my bcn in the next few days. I'm hoping to get back behind the wheel by the 16th when the boys go back to school will make life a little easier. But will  not rush things. kind regards Shelly",
      "MessageIndex": 10,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48778/double-mastectomy-immediate-reconstruction-with-implants-please-help",
      "Title": "Double mastectomy immediate reconstruction with implants please h..."
    },
    {
      "AuthorID": "Shellyd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
      "Content": "Hi I'm 43 and have just been on the biggest journey of my life in the shorest time ever. I was given an diagnosis of DCIS back on 3 Jan. I had a wide local excision at the end of Jan. Followed by an other wide loca excision at the end of Feb. I found myself at the end of March having a double mastectomy and immediate reconstruction with implants.  This as left my feeling very low. Can anyone tell me how long before the implants settle down.",
      "MessageIndex": 0,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48778/double-mastectomy-immediate-reconstruction-with-implants-please-help",
      "Title": "Double mastectomy immediate reconstruction with implants please h..."
    },
    {
      "AuthorID": "Shellyd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
      "Content": "Thanks Janice, I will take it easy, to be truthful  my partner and 2 boys have been brill. they have taken over all the house work, so nothing left for me to do but rest, looking forward to when things get back to normal what ever that is. do you know how long before I will be able to drive!",
      "MessageIndex": 6,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48778/double-mastectomy-immediate-reconstruction-with-implants-please-help",
      "Title": "Double mastectomy immediate reconstruction with implants please h..."
    },
    {
      "AuthorID": "Shellyd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
      "Content": "Hi Wendy, I was also ment to have expander implants put in first however, I did tell them that I wasn't bothered about going smaller. Which is why I think I woke up with implants in. I too am having some regrets about having anythings put in at all. But think it's due to the pain and the unknown. Don't know what to expect.",
      "MessageIndex": 5,
      "PostDate": "08/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48778/double-mastectomy-immediate-reconstruction-with-implants-please-help",
      "Title": "Double mastectomy immediate reconstruction with implants please h..."
    },
    {
      "AuthorID": "Shellyd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
      "Content": "hi i had a double mx and reconstruction using implants and stayed in hospital for 6 nights, was told  i could of gone home after 4 nights put didnt want to go home with my drains still in.  you are better stayiningas long as they let you because you get stronger pain relife in hospital and the nurses are always there for you. i found even getting out of bed to go to the toilet a chore for a couple of days. but in the end your stay will depend on what recon you have and how you are. take care -i will be thinging of you xx please feel free to send friend request if you want x",
      "MessageIndex": 6,
      "PostDate": "05/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50454/hospital-stay",
      "Title": "Hospital Stay"
    },
    {
      "AuthorID": "Shellyd",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shellyd",
      "Content": "Hi Jazz, sorry to hear your bad news, I started on my journey just before christmas 2011 with a regular mamagram. where they found something. I than went for a biobsy (sorry really crap at spelling). on the 3rd then on the 10th  came the day my world fell apart. I was told I had( DCIS ) cancer  is contained in the milk ducts I had a wide local excision with a x-ray guided hookwire. on the 26th then came the wait for my next ap. when I was told once under the microscope they did not have clear margins, so back I went on the 25 Feb I had another wide local excision. When the results came back again they had found more cancer, So I had to have a mastectomy. At this point with my family history I had to chose,( Mine also comes from my grandfathers side of the family, my great aunties my aunties and my mum.) I chose to have a double mastectomy, has I wouldn't beable to go through all this again.  I had my double mastectomy reconstruction with implants and nodes removed on the 29th March and spent a total of 6 days in hospital. They were going to let me home after 4 days but I didn't feel comfortable going home with 3 of my 4 drains in. was worried about my dog jumpping up and catching them. I am just waiting now for the 17th when I go back to clinic for results and to see if I need any other treament. Please add me as a friend if you like and good luck with your journey. You will find lots of friends/help & advise on this website. x Shelly",
      "MessageIndex": 1,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48897/too-many-wild-thoughts",
      "Title": "Too many wild thoughts!"
    }
  ]
}