{
  "AuthorID": "shelski",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shelski",
  "Posts": [
    {
      "AuthorID": "shelski",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shelski",
      "Content": "Hi. I'm after some advice please. I finished my 15th RT session on Monday to my right breast folloeing WLE lumpectomy. I've not had any major issues but the pinkness appeared around session 11. It became slightly spotty under my breast and i was given a dressing and told not to use the Aquamax cream on this area. It seems fine now. However, the rest of my breast is now rather spotty, pink and itchy. I guess it looks like prickly heat.  I use a tiny amount of Hydrocortisone cream 2-3 times daily followed by the Aquamax. I also take the odd Piriton to help the itchiness. My question is should i still be using the Aquamax cream to keep the area moisturised or should i not use it so that my skin and spots dry up? The spots are not weeping. Thanks in advance xx",
      "MessageIndex": 0,
      "PostDate": "08/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122950/skin-care-following-completion-of-radiotherapy",
      "Title": "Skin care following completion of radiotherapy"
    },
    {
      "AuthorID": "shelski",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shelski",
      "Content": "oliviaruby I'm off to lanzarote next week (wahooooo!) should I stop taking my tamoxifen? Or just hydrate / wear my surgery stockings? I know the guidelines are just are to stop taking for long haul, but it's only 4ish hours  I went on holiday to Cuba and continued taking Tamoxifen. I wore my sexy white travel tights and took an aspirin the day before flying. Im sure you'll be fine. Happy holidays!",
      "MessageIndex": 8,
      "PostDate": "13/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126845/flying-while-on-tamoxifen",
      "Title": "Flying while on tamoxifen"
    }
  ]
}