{
  "AuthorID": "Shezbert",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shezbert",
  "Posts": [
    {
      "AuthorID": "Shezbert",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shezbert",
      "Content": "Yes you do find out who your friends really are. My husbands family including brothers, aunt's, uncles, cousins, all knew he had a tumour and was going for a biopsy as they were all at my father-in-laws funeral when we had to leave early to take Laurence into hospital for the biopsy on the tumour at the base of his tongue. Since then the majority have never been in touch to see how things are going. Its been friends and work collegues who have been there for us and have supported us the most. I did do a web site and emailed people with the address and asked that they pass on that address to other people so they could follow Laurence's progress when he was in hospital without me having to spend 2 hours+ on the phone every evening. I still update the blog once a week and can see who has accessed the site and that is even now nearly all work collegues & friends.",
      "MessageIndex": 8,
      "PostDate": "30/01/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10848/an-appeal-to-families",
      "Title": "An appeal to families"
    },
    {
      "AuthorID": "Shezbert",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shezbert",
      "Content": "I think people do get confused with grade & staging On a histo report grade will refer to the differentiation of the cells. This means how different the cells appear from normal cells. Staging is a measure of how far the cancer has grown and spread. A common cancer staging classification is TNM T = Tumor N = Nodes M = Metastases. MRI, CT, blood test will all go towards staging a cancer Sometimes a cancer can't be properly staged until after the tumour is removed. If you have been assigned a Cancer Nurse Specialist talk to her and she will explain grading and staging to you as it is so confusing. Love Luck Laughter Shelley",
      "MessageIndex": 3,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10999/confused",
      "Title": "Confused"
    }
  ]
}