{
  "AuthorID": "Shogun50",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shogun50",
  "Posts": [
    {
      "AuthorID": "Shogun50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shogun50",
      "Content": "Hello Nette70 I maybe should not reply but felt I had to.  I was treated at Nottingham City Hospital 15 years ago when the new Breast Institute was built and have to say that I had the most caring and wonderful team looking after me.  I have since moved to Dorset and the follow up here has not been quite as good but I have no complaints.  Both have been good, but I feel Nottingham at the time was far ahead of anywhere else and hear it is fantastic today.. I wish you all the best and everyone going through treatment now.  Love and best wishes to you all.",
      "MessageIndex": 5,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148269/diagnosed-november-2016-treatments-at-nottingham-city-hospital-anyone-else",
      "Title": "Diagnosed November 2016 treatments at Nottingham City Hospital anyone..."
    },
    {
      "AuthorID": "Shogun50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shogun50",
      "Content": "I understand how you feel but remember that this is the start of the process which makes you well again, you will have some rough times and some feeling sad times, but stay positive as it will help on your journey.  I will be thinking of you as I have been through exactly the same as you.  Lots of love, big hugs and positive thoughts to you. xx",
      "MessageIndex": 32,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155534/what-is-the-prognosis-for-inflammatory-breast-cancer",
      "Title": "What is the prognosis for inflammatory breast cancer"
    },
    {
      "AuthorID": "Shogun50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/shogun50",
      "Content": "Hi Charlie 1974 I was diagnosed with inflammatory breast cancer way back in 2002 at age of 52 and was told it was very advanced. Had to have chemo first then mastectomy followed by radiotherapy.  Here I am today, almost 68 and very well. Things have advanced so much since then but Dr Google has not so don't take any notice of him!  I send you all the love and hugs I can because I know how you feel, but try not to worry and be positive as you may not even have IBC.",
      "MessageIndex": 17,
      "PostDate": "22/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155534/what-is-the-prognosis-for-inflammatory-breast-cancer",
      "Title": "What is the prognosis for inflammatory breast cancer"
    }
  ]
}