{
  "AuthorID": "Siggers",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
  "Posts": [
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Wow, I came on here this morning to ask had anyone else put weight on - and my question was answered before I even had to ask!  I don't know why but it just didn't occur to me that I'd put weight on, I always imagined I'd lose weight.  This is adding insult to injury - bald and getting fat. But.... we're all still here so I guess it's not all bad.  I keep telling myself I'm going to start light excercise but I'm so tired and weary, does anyone have any suggestions on how to at least keep this weight gain under control and get some form of doable excercise?  Thanks ladies,  gaynor xx",
      "MessageIndex": 7,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100932/angry",
      "Title": "Angry !"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": " The most popular comment seems to be 'you're so strong, you're an inspiration' me: 'no I'm really not strong' repeat 'oh yes, you've always been strong' , ME: 'NO I'M NOT, I'M REALLY SCARED AND I FEEL LIKE S**T BUT DONT WORRY KEEP KIDDING YOURSELF AND YOU WONT HAVE TO SUPPORT ME!!!!!'  Aaarrrrgggghhhhh spend a day in my shoes!  Gaynor ",
      "MessageIndex": 66,
      "PostDate": "13/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100932/angry",
      "Title": "Angry !"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Thanks Penny, I thought I'd got away with it but no such luck, one last kick in the teeth! Glad to know they do grow back ok - how long do they take? They look disgusting at the moment, which I'm not really bothered about, I'd rather be alive with horrible nails than the alternative, but it would be good to know when I can actually start to look myself again. Gaynor xx",
      "MessageIndex": 2,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103562/nails",
      "Title": "Nails!!!!!"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Hi Maryon, I started painting mine before my 4th chemo - I had 3 FEC followed by 3 T and I was told it was the T that was the Danger to nails. So far I'm hoping to only lose a couple of nails, even though they all look awful, but I like to think the nail polish has certainly helped. Good luck with our chemo and all the associated events, remember it's not forever and it does come to an end!  Gaynor xx",
      "MessageIndex": 5,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103562/nails",
      "Title": "Nails!!!!!"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Hi ladies, Can anybody help me please with advice about my nails?  I had my last T chemo on Tuesday (yay!) and am in the middle of the horrible aches and pains, but hey it's the last time so I'm ok with that.  But....... I have kept my nails painted with dark polish throughout chemo in an attempt to save them, now, at the very last post they're starting to fall off . What do I do now? Can anyone give me any advice? Should I clip them or cover them or carry on painting them? I'd be grateful for any help you could give me. Thanks xxx",
      "MessageIndex": 0,
      "PostDate": "10/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103562/nails",
      "Title": "Nails!!!!!"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Thanks Maggs, I've sent for cotton gloves for wearing round the house and out, have my trusty marigolds in the kitchen but do need some disposables for the messy jobs.  You just don't realise how often you wash your hands until you need to keep them dry!  I've never managed long nails but during chemo they've grown at such a rapid rate that when they're painted they look really good - and now I have to cut them short! You've just got to laugh haven't you?  Nail-less fingers crossed I don't lose too many but what ever will be will be. Gaynor xxx",
      "MessageIndex": 8,
      "PostDate": "11/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103562/nails",
      "Title": "Nails!!!!!"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Hi,  I finished chemo in January and my hair had tarted to sprout during my last 2 T sessions.  It's now just over 3 months later and I've got a lovely thick head of short (about 1.5cm) grey hair.  I think it's going to be a bit wavy but can't really tell yet I've been venturing out without a wig or hat for about 3 weeks and getting some lovely comments about my hair - personally I can't wait to grow it again, but I must say I just love having hair!  I've been on Letrozole for around a month and a half so I don't know if that's going to affect anything.   I was more concerned with the lack of eyelashes but I'm happy to say they're on their way back too!  Patience is the key and before you know it you'll have flowing locks again. Xxxx",
      "MessageIndex": 6,
      "PostDate": "13/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107807/question-about-hair-growth",
      "Title": "Question about hair growth"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Hi Gaynor123, I'm due to have my 2nd FEC cocktail on Tuesday, and like you, after my first I was waiting for side effects to kick in - but they never did.  I was so lucky, just a wobbly tummy and a woolly brain for a couple of days.  But I got over ambitious and felt so good on the Friday I decided to clean the house from top to bottom - ended up in A&E feeling so poorly.  The moral of that tale, for me, is that even though you feel fine your body is still fighting a battle with all the drugs and you really can't do everything you used to at the same pace.  Take it easy, don't hibernate, but respect the hard work your body is doing in the background!  Im not as worried as I thought I'd be about my 2nd but I do realise that the side effects may be cumulative and I might not get off so lightly next time. I guess what I'm trying to say is just what lots of others have said before, we're all different but if you don't have a hard time just be glad and take the opportunity to rest and look after yourself. Much love xxx  ",
      "MessageIndex": 9,
      "PostDate": "10/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99678/first-chemo-treatment-yesterday",
      "Title": "First chemo treatment yesterday"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Wow that sounds like an amazing week!  Can't wait for that day - so glad to hear from someone who's come out the other side of this, and by the sound of it successfully. Go you Liitlesusie!! xx ",
      "MessageIndex": 1,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100030/best-week-ever",
      "Title": "Best week ever!!!"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Hi Lizy, Welcome to the roller coaster! As all the ladies have already said, this experience is different for all of us but one thing that is certain, we will all get through it and remember always you're not on your own. I was diagnosed with bc in July last year (2015!) and had a lumpectomy and sentinel node biopsy.  I had lots of test and scans including the oncotype dx and was advised to have chemotherapy.  I am on the FEC-T cocktail and feel really lucky that the side effects of FEC weren't too bad at all.  I know some ladies have been really sickly but you are given anti-sickness tablets - do take them if you need to.  The most important thing to remember is that it passes - it's rubbish while you feel rough but it does pass.  Rest as much as you need to - there's no such thing as too much rest if you're tired.  It's true that the T part of the chemo is much more aggressive and the side effects can be pretty nasty.  I had a bad time on my first T cycle, as well as SE I managed to pick up an infection and ended up in A&E, but they were great and after IV antibiotics and a fist full of more to take at home I was ok.  The pains that come with this chemo can be controlled to an extent with the painkillers but hot baths and hot water bottles are indispensable too.  Again, not everyone gets all or any of the SE so it's a case of wait and see.  After my first T I had an appointment with my oncologist and he lowered my dose by 15% (they can lower by as much as 20% and it's still classed as a full dose), the SE of my second T were not quite as bad as the first and certainly over quicker so it's worth bearing in mind that alterations can be made to your dose. Sorry this is an essay, but I want to share as much helpful info as I can.  As for your nails, I put the obligatory black nail polish on before I started T and so far have not had any problems - all still intact. Peeling skin on my hands has been kept under control with E45. Lastly, hair.  As so many other ladies have already said, it starts to fall out around 2 weeks after your first chemo. I had quite long hair but had it cut short before I even started chemo, thinking it would be less of a shock when I lost it all.  Before it started to drop I had a very sore head and after a couple of days it was hurting so much I just grabbed a razor and shaved it all off! What a relief, and it didn't look as bad a I thought it would - pleasant surprise.  I have a couple of wigs but some days just wear scarves. The Annabandana website has great scarves and bandanas at really good prices and I've seen quite a few ladies on here who recommend them. So, good luck, don't worry too much (I know that's easier said than done) it's a means to an end and before you know it you'll be looking back on all this as a memory.  I never thought it would come to an end but next Tuesday I have my sixth and last chemo which seems unbelievable now. Never forget this lovely community is always here to help. Love xxxxx",
      "MessageIndex": 14,
      "PostDate": "01/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102992/hello-newbie-here",
      "Title": "Hello Newbie Here"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Merry Xmas ladies! Just thought I'd pop on and send my warmest wishes to you all - and hopefully show you that there is light at the end of this awful tunnel! This time last year I had just had my 5th of 6 chemo sessions, I was bald, feeling awful, tasting nothing and absolutely exhausted.... this year I have a great hairdo, lovely nails, feel a whole lot better and tasting everything as it should be - including wine So, I'll be raising a glass or 2 to all you brave ladies and wishing you a fab New Year and a speedy recovery to your new normal Thank you to everyone who helped and supported me and lots of love to you all ❤️ Xxxx",
      "MessageIndex": 8,
      "PostDate": "24/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120183/xmas",
      "Title": "Xmas"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Hi Jules, I was on Letrozole for 3 months and had to come off it due to aches and pains in my joints, particularly in my hands. I found it so hard to get up from bed, from a chair, anything, I was just so stiff and sore.   I've now been on Tamoxifen for about 2 weeks and things are a bit better.  The pains now seem to be nerve related rather than joints so I'm not so stiff in the mornings but I have a constant niggle, again especially in my hands, they seem to be my weakness. Personally I'm happier on tamoxifen but it's early days yet.  I've seen ladies on here who have had Letrozole and had no side effects at all, it's all very personal.  Although all these meds do basically the same thing and have very similar active ingredients, we are all very different and one person's reactions are not another's. Hope you find something that's suits you soon.  Xxxx",
      "MessageIndex": 3,
      "PostDate": "19/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109342/anastrozole-to-tamoxifen-then-letrozole",
      "Title": "Anastrozole to Tamoxifen then Letrozole"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Hi again Hawkster, Just had to say how much I agree with you what a great support this group has been.  I've sometimes asked questions that I thought were silly but have received answers and reassurances that no question should be left unasked if it's worrying you! We are thrown into this place with no previous information and we leave as mini experts gathering information along the way.   On the subject of nails, I am slowly losing my finger nails but my toes are completely unaffected One less hurdle to cross.   Like you I celebrated the end of chemo forgetting that the cocktail is still running round doing its job.  The tiredness does get me down, I just want to be the old me again, but to be honest that person doesn't exist any more, my outlook has completely changed and when I'm well I've promised myself to slow down and take time to look around.  One more thing I'm going to do, is stay in touch with ladies on this forum and help whenever I can.  I feel I've taken so much it would be so good to be able to give something back. Onwards and upwards Positivity goes a long long way (though sometimes we have to dig deep to find it!) Xx ",
      "MessageIndex": 11,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104726/chemo-done",
      "Title": "Chemo done!"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Congratulations Hawkster! We started chemo around the same time I think (Set 2015) and doesn't it feel good to put it behind you? After 6 sessions of FEC-T I'm feeling wrecked physically and mentally but positive for the future. Chemo had one last (I hope) kick in the teeth, my finger nails are now falling off but hey, I just don't care, they'll grow back!  I start 15 sessions of radiotherapy tomorrow but from what ladies on Macmillan forums have said its a breeze after chemo.  I've stocked up on E45 and I'm ready for battle again! I've been told my reconstruction operation will be in September and then I'll be done and can hopefully I can put this whole experience behind me.   As I move on I'm certainly not the person I was when this experience started, I like to think I've learned life lessons that have made me a better person.  So congratulations to you and to all the other ladies who are post chemo, we've kicked ass now let's grab life by the horns (once we have the energy) and live!  Gaynor xxxxx",
      "MessageIndex": 9,
      "PostDate": "04/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104726/chemo-done",
      "Title": "Chemo done!"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "Welcome back JJ Good to see you back and to hear that you're home - albeit with yet more to deal with. Throughout your journey you've certainly drawn the short straw.  As all the other ladies have said, hopefully now you're home in your own bed with your own good food and family around you, things will turn so much better for you.  You've always been there to support others, let us all support you now. You'd been through so much already, hope you can view this hurdle as the last and get over it in your own inimitable style!  Lots of love  Gaynor xxxx ",
      "MessageIndex": 9,
      "PostDate": "13/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106524/back-from-hospital-after-diep",
      "Title": "Back from hospital after DIEP"
    },
    {
      "AuthorID": "Siggers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/siggers",
      "Content": "JJ, I joined this forum in September and you've been so supportive of me and lots of other ladies, with advice and words of wisdom, even sharing your own bad experiences with infections etc which in turn helped me to cope with mine.  I won't use the time honoured phrase 'you're strong' because that irritates me so much - we cope and we get through whatever this nasty critter throw at us because we have to. So, just think about all that you've gone through so far and where you are now - I bet there was a time you thought you'd never reach this point.  Well here you are with just an op to get through. I know 'just' is another irritating phrase but after what you've been through but after all that try to think of this as 'just' an op, whatever you feel like when you wake will pass in not too much time and then you'll look fab and can get on with your life!  Be scared, that's natural, but look forward to your life sailing and living.  Will be thinking of you tomorrow. Sending love xx",
      "MessageIndex": 10,
      "PostDate": "20/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103987/bilateral-mastectomy-and-recon-on-thursday-sacred",
      "Title": "Bilateral mastectomy and recon on Thursday sacred!!!!"
    }
  ]
}