{
  "AuthorID": "Silverglades",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
  "Posts": [
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "I've had some sympathy to my awareness-raising of how cancer patients feel on my Facebook page. Otherwise I'll obviously have to start this much earlier next year as the shavers don't feel they can stop a campaign or change to a different method once they've signed up to shaving and the supporters just get defensive of their friend for being so brave and raising so much money.  However, if Macmillan would stop the campaign or at least stop promoting it so aggressively, I do think fewer people would think of doing it in the first place.",
      "MessageIndex": 161,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "I'm just so angry & disappointed that Macmillan have failed to act following the comments on this thread last year. At the time, the initiator of this thread, Judy, had applied to be part of the the panel of patients Macmillan evidently take advice from when creating their advertising campaigns, and there seemed to be real hope that Macmillan would pay heed to the sheer number of people who are upset by this insensitive campaign. However, if the TV ad is showing again (I haven't come across it)  then money is obviously being put before patient & survivor feelings.",
      "MessageIndex": 291,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Hi Jannie, I've just re-read your response as it happened to be on my screen and I must say, I'm impressed by the fact your husband can see why you feel the way you do about Brave the Shave. After a few drinks the other night, my husband confessed he thought I was being mean not to support my colleague (who's braving the shave today, which is why it's on my mind).  He's just taking the attitude that she means well and thinks she's showing solidarity for people who have had chemo (she had surgery but no other treatment), so that should have been enough for me to support her.  Even though she didn't contribute to and of my three more minor campaigns! As a result, I'm the one who's feeling isolated and wondering if I have been mean - and it will be all over my Facebook newsfeed today, needless to say.",
      "MessageIndex": 162,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Judy, Thanks so much for your lovely supportive reply. I've cheered myself up by donating to a team from a local company who are climbing Ben Nevis for Macmillan and yet are struggling to interest the likes of the local press, who are, naturally, much more interested in the shavers.   Please do let us know when you speak for Cancer Voices.  All best.",
      "MessageIndex": 171,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "RebeccaT Evie S RebeccaT, when was your article published in the Sunday Times? Brilliant that you wrote the article and had it printed. Xx It was last year. I wrote so much more than was ever quoted. I really stressed over and over again that I was grateful for fundraisers but disliked the phrase being used. They sort of ignored that bit! Here's what I actually wrote: \"It’s hard to write this without sounding like a bitter ungrateful old bag! I am not that at all and am often hesitant to comment negatively lest I appear so. Fund raising is a wonderful thing and lord knows, without it I wouldn’t be here today but sometimes people get it wrong. Macmillan raise vast amounts and for this I am truly grateful but the wording this time was wrong. There is nothing brave about shaving your head! I understand it’s something people frequently do in support of friends or family and that Macmillan felt it would be an opportunity missed but that word BRAVE…no, it’s not. Shave your head, shave your eyebrows, pull out your eyelashes, endure surgery, chemotherapy, radiotherapy, hormone therapy and all the never ending, permanent side effects of treatment and even that’s not brave. We have no choice. It’s that or die…not much of a choice.   This is what I wrote in the Macmillan forum:   I hate the campaign. There is nothing brave about shaving your head and I love the term \"hero martyr\". When I see people doing this I want to say \"Oh cool, well done. Now you need to have six months of chemo and surgery...not so brave now, huh?!\" I'd rather people just gave the money. When these brave souls look in the mirror do they see a shaved head, money raised and even feel a little smug? When I looked in the mirror I saw a life threatening illness. I was not aware of the Marks and Spencer Bra Strap campaign so I looked it up. Hmmm…I should think it was very upsetting to those women who no longer have anything to put in a bra. Even reconstructions (as I have) don’t sit well in a bra. On top of all this, the nature of social media can make it all so much worse. The “look at me” culture, the filtered selfies really rub it in. It’s easy to take a selfie of your pretty bra strap, with your hair looking lovely and your skin soft and dewy. It reminds us of what we’ve lost. Also, the amount of people joining in with trending hashtags, contributing nothing is galling. I do not wish to sound bitter nor ungrateful but if I sound resentful, I am. I cannot stress enough how grateful I am to people who raise money for research and care. Twenty years ago my cancer may well have killed me. Because of these generous people I saw my son get married, I had coffee in the garden at 6.00 am today, I will have another forty years of garden mornings with my wonderful husband (I fully intend to reach 100!) But please, don’t rub it in. Don’t remind me, don’t make me feel a lesser woman. During my treatment I wrote this on my blog: Not angry… I’ve realised it’s not anger I feel, nor injustice, nor even WTF? but resentment. A couple of months ago I was unaware that I had breast cancer. I was fit and healthy, stupidly happy, had reached a very good turning point in my work and was loving it. Finances had been tight but TB and I were just getting it all sorted. Life was blooming good! I think a lot of us keep quiet about feeling like this because we should just be grateful for our treatment (and I am) but I hate that my life has been changed FOREVER. I loved it just the way it was, thank you very much xx\" But also, women who don't have the right head shape to suit the shaved look don't tend to be brave enough to shave. So how is having friends cheering you on to having a great hair cut & then having everyone tell you how wonderful you look a) brave and b) in solidarity with a woman who feels shes lost all her femininity & attractiveness, seeing more Uncle Fester than Sinead O'Connor in the mirror?",
      "MessageIndex": 360,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Has anyone tried replying to the bog-standard reply to our complaints?",
      "MessageIndex": 407,
      "PostDate": "14/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Does anyone know how to add to a Wikipedia page? I've noticed that the page for Macmillan has a section titled 'controversies over fundraising methods'. At the moment it only discusses the controversy when Macmillan supposedly 'stole' the Ice Bucket Challenge from a Motor Neurone Disease charity but surely 'Brave the Shave' could/should be added as a second questionable fundraising method?",
      "MessageIndex": 408,
      "PostDate": "15/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Michael admin Hello and thanks to everyone who is commenting in this thread. Please be assured that you have a direct line to Macmillan - we're passing all your comments on to the Brave the Shave team. I'll post more tomorrow and try to explain our approach to the this year's fundraising campaign. M.",
      "MessageIndex": 299,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "One of the biggest issues for me is the promotion of the idea that if you're brave, shaving your head is doable and nothing to be devastated about. Certainly the women I've known to do Brave the Shave have all suited the shaved look, and so all the compliments they receive add to the trivialisation of the ordeal -  and yet this greatly depends on head shape. Of course, most women will have tried short hair cuts at some point in their lives and so will have a fair idea of how they'll look. Sooo brave to invite all your friends to watch you have a great hair cut! No consideration for women whose hair makes a big difference to their looks and sense of their own femininity. And that's before you consider other aspects such as the scalp pain, no hair line, no eyebrows or lashes etc.",
      "MessageIndex": 326,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "So in other words, Michael's reply from Macmillan is contradictory: on the one hand it says they don't wish to suggest the two experiences are comparable. However, they also claim to want to support people who wish to 'show solidarity'.  The whole point is that it doesn't show solidarity because it suggests that brave people can do it (and most women even suit the look), thereby trivialising the issue by presenting it as not something  to be devastated about.",
      "MessageIndex": 327,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Well I'm just left speechless.  I've written to both Macmillan & Cancer Research UK to ask them to explain themselves (no reply from either so far).  Also, as a protest to Macmillan not listening to its own customers' feelings, I was planning to complete Cancer Research's September Dryathlon this year, instead of doing my regular stint for the Macmillan Sober October, only to find Cancer Research also promote Head Shave events, albeit not quite as aggressively as Macmillan.  Typically, the local Brave the Shave events are getting all the publicity (local paper turning up at the hairdressers, etc), while at the same time, a team from a local company planning to climb Ben Nevis for Macmillan are having to struggle to promote their own cause  - so, as I said, I'm left astounded and speechless.",
      "MessageIndex": 148,
      "PostDate": "01/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Yes, I'd spoken to a couple of friends I was in hospital with as well and not everyone is against the suggestion that it's brave - it was more that it reminded them of an awful time at best and, at worst, the campaign seems to suggest that shaving your head isn't a big deal. Something that most people should be able to do, almost like throwing a bucket of iced water over your head. It didn't consider that being willing to do it for a short while was very different from having to lose all your hair and not knowing if, when or how it would grow back, and coping with that along with all the other side-effects & emotions that go with chemo and being diagnosed.",
      "MessageIndex": 153,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Sorry to bother you all again but while typing my previous post, I received this reply from Cancer Research UK.  I'd emailed them as well as Macmillan because, although they don't have an aggressive Head Shave campaign, 'Head Shave' is given as an option for fundraising on their website. I'd say their response was much more sympathetic than the one I received from Macmillan but it doesn't seem to acknowledge the fact they do give Head Shave as an option. Here's the response: I was very sorry to read about the distress caused to you and other survivors by Macmillan’s recent campaign. It is never our intention to upset or offend any of our supporters, especially those that have been affected by cancer. Please accept my sincere apologies on behalf of Cancer Research UK. I would like to reassure you that we take your feedback very seriously and as such I have investigated this further for you. After discussing this with my colleagues in the fundraising team and I can confirm that to the best of our knowledge, we do not currently have a campaign encouraging supporters to shave their heads. We do however, have lots of supporters who do a voluntary sponsored head shave for us and they often do this in solidarity with a family member or friend who is undergoing treatment. It is never meant to be offensive or dismissive and I am very sorry this was not the impression we gave you. Cancer patients, past and present, are at the heart of everything we do and we would never want anyone to feel like we are trivialising your experience. We are acutely aware of the terrible side effects of certain cancer treatments and we are working hard to develop kinder and more effective treatments. Please be assured that I have passed your concerns through to our campaigns team and they will be used for future reference. I really do hope you will consider joining our Dryathlon this year, we would be so very grateful to have you on our team. Once again, please accept my profuse apologies for the offence and anguish caused to you by this. It certainly was not intentional and I hope the information I have given you will go some way to reassure you of this. If there is anything else I can do for you, or if you have any other questions or comments, please do not hesitate to get back in touch. I will be happy to help you further.",
      "MessageIndex": 159,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Many thanks, mistymoley - your support is much appreciated.",
      "MessageIndex": 164,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Sophie236 I used to support this campaign - until I got cancer :-(  I now see exactly why it is frankly horrible (and I speak as someone who was quite glad to lose her head hair!). It's quite likely that Facebook friends of mine will be doing this, and I need a firmly-worded post to pre-empt them in the hope that I can persuade people to fundraise in another manner. Would the contributors to this thread object if I (completely anonymously, and my FB account is not set to 'public') quoted some of the heartfelt comments made here? I promise I won't quote anybody who doesn't contact me with a definite 'yes', but many of you have said it so much better than I can. Thanks in advance XXX It's a yes from me.",
      "MessageIndex": 334,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Just filled in the complaint form, ending with 'Please DO NOT simply send me your standard reply as I received that last year'. I'm not holding my breath, though.",
      "MessageIndex": 384,
      "PostDate": "09/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "A work colleague is braving the shave and I'm still undecided whether to contribute.  I am also concerned that it trivialises losing hair as a chemo side effect - it is very brave and I definitely wouldn't do it but it's hardly the same as throwing a bucket of ice over your head.  Both this colleague and myself have had surgery for breast cancer but neither of us needed chemo. So does the fact she is a survivor make a difference? Also, I've done Sober October for the past 2 years - the first time I just kept it to family and close friends but last October I publicised it widely but this colleague didn't contribute - any advice/opinions would be greatly appreciated.",
      "MessageIndex": 121,
      "PostDate": "28/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Hi All, Just thought I'd share the response I've received from Macmillan and I'm wondering if it's similar to the one others have received? As you see, it is partly sympathetic and says the feedback will be considered. No surprise that they've quoted how much the campaign has earned and I think that's where I disagree with many others - it doesn't usually matter how funds are raised as long as they're raised, with the one exception of when a campaign upsets or undermines the feelings of the potential beneficiaries of the funds.  Here's the response: Please accept our apologies if the campaign has caused any upset or offense, Brave the Shave was created in order to raise awareness and vital funds for Macmillan and we do understand the sensitive nature of the campaign.    Brave the Shave began after we found that more and more Macmillan supporters were choosing to shave their head and fundraise for Macmillan each year. Originally we launched this as ‘Shave or Style’, however from this campaign, we found that the majority of participants were opting to shave and so moved forward with that aspect specifically. We wanted to provide these supporters with a better platform in order to raise money, while sharing their fundraising activity. The majority of people who take part in Brave the Shave have a close connection to cancer, including the ladies in our TV ad.    We did consult with people affected by cancer when developing our campaigns and your comments will definitely reinforce our commitment to carry out a thorough piece of research on Brave the Shave with our Cancer Voice groups to ensure the messaging and tone of voice is appropriate and reflecting real people’s experiences and feelings.    Last year this event raised over £4m to support people affected by cancer, which means we can continue to be there for more people affected by cancer than ever before.    We do understand that this type of event is not for everyone, which is why we offer a variety of events, including Coffee Morning, Go Sober and Summer Lights as well as challenge events and regular giving.    We also, of course, are continually trying to improve and check our communication with this particular ask, across all our fundraising which is why your feedback is so important.   Thank you once again for taking the time to get in touch. Your views are highly valued and your feedback is vital, as it gives us the opportunity to improve the way we do things and to ultimately provide a better service for people affected by cancer. I do hope that this email has gone some way to addressing your concerns",
      "MessageIndex": 150,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "I just wanted to say how refreshing it was to see someone else who hasn't had Chemo actually acknowledging & respecting the opinions expressed on this page.  I've had surgery for breast cancer but didn't need Chemo (so far, anyway).  Even so, as soon as I read this thread, I felt the need to stop supporting Brave the Shave & to raise awareness of the strength of feeling that exists against the campaign. However, the shavers I've known, and their supporters, have all been so defensive - claiming everyone should appreciate both the funds raised as well as the sentiment of 'solidarity'.  Once they'd started the campaign, they wouldn't have dreamed of changing to another one so well done you for being so thoughtful & considerate.",
      "MessageIndex": 200,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "I don't think it's rude - maybe slightly defensive, when many people on this thread have said it's Macmillan we have the issue with (for coming up with the campaign & the way it's been promoted). The fact the actual shavers mean well and are raising vital funds has been acknowledged many times on this thread. However, in the end, this is a breast cancer forum and therefore, breast cancer sufferers and survivors should feel completely entitled to air their feelings and I feel it's really important that we do so (actually, Macmillan seem to agree with this). We are all unique individuals with different opinions, experiences & outlooks on life.  Personally, even though I know I'd still be loved by those close to me, and I really don't care what others think of me or my looks - least of all complete strangers - it would be the feeling of watching my own standards literally being washed down the drain and not by my choice, that would devastate me - not worrying whether I was thought attractive by Joe Public. For these reasons, having someone I've never even met declare that 'Everyone's beautiful with or without hair' wouldn't particularly comfort me in that moment because, even though I know you mean well, to me, my opinion of how I look is far more important than yours. As others are different, perhaps they would be comforted by such a phrase or would feel some kind of 'solidarity' in the fact you had a shaved head as well - many of us wouldn't and we have a right to say so. I think most women will have tried a very short-cropped hairstyle at one time or another and we therefore have a good idea as to whether the look suits us.  Some women can look amazing with no hair, especially with the right makeup - some of us don't.  Again, perhaps it's not the case with you, but every woman who I've known 'brave the shave' has suited the look - and they had a good idea this would be the case from past short haircuts. The shave is also sometimes done like a ritual, with the shaver's friends all chanting 'Off! Off! Off!' (If that's not tasteless & insensitive, I don't know what is).  Most importantly,  it makes it seem like something anyone should be able to do - no big deal - akin to throwing a bucket of water over your head.  However, losing their hair is a big deal for many women and people claiming 'it shouldn't be - we're all the same underneath' doesn't necessarily help or show real understanding. I don't think we should try to determine 'right' from 'wrong' on here. My position of support is that I would normally agree with the philosophy 'it doesn't matter how funds are raised as long as they're raised' but I think the one exception to this is when the campaign upsets, offends or trivialises the feelings of the very people who stand to benefit.",
      "MessageIndex": 209,
      "PostDate": "03/09/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Jillyp1210 My son is going sober for October....No mean feat for an 18 year old!! Jilly x That's fantastic, Jilly. I did Sober October for the past two years and was surprised & appalled at the attitude of 2 work colleagues  & one neighbour. Even  though they all knew I'd had breast cancer in 2012, they suggested that staying sober for a month shouldn't take much effort unless I drink 'all the time' ie unless I have a drink problem. In general I found people seemed to admire the 'brave shavers', in addition to the runners and 'adventurers' (like doing a sky dive or climbing Ben Nevis) to be the only efforts worth praising.  As a consequence, and in support of the others on this page who also hate Brave the Shave, this year I've just completed the Cancer Research September Dryathlon instead. I only asked family and close friends to sponsor me and contributed my own savings on not buying weekend wine, saving on taxis when I went out, etc.  In this way, I still felt I'm making an annual contribution & the others are welcome to stick to their runners and shavers.",
      "MessageIndex": 243,
      "PostDate": "04/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Luciana1 To my mind, Michael, in his reply, is simply defending the indefensible. It's a deeply offensive campaign no matter how much it raises - and there's no saying that a better, more sensitive campaign wouldn't have raised more. Michael's reference to the funds it raises reminds me of the response you get from the far-right 'gutter' press when their lies & exaggerations are pointed out. They say it sells papers. So Macmillan are making this a similar vicious circle - while so many people want to do it and while each 'shave' seems to raise £1000+, they'll continue to promote it. So how to stop people who think they're doing a wonderful job and getting a bit of glory for themselves at the same time, from doing it?",
      "MessageIndex": 335,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Excellent!",
      "MessageIndex": 342,
      "PostDate": "05/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Many thanks to Judyr58 for your advice and to everyone who sent supporting responses. I've decided to start with Judy's first tip of staying silent and not contributing. Then if the colleague throws hints my way, or brings the subject up in passing, I'll proceed with the other tips. In the meantime, I wondered if Macmillan read these posts? With such strength of feeling, it's not too late for many participants to cancel their shave day and accept contributions for doing so, in support of the real sufferers and survivors.",
      "MessageIndex": 135,
      "PostDate": "29/07/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Hi Judy, Thanks for your reply. I was wondering if anyone from this forum was either on or could join the 'Cancer Voices' team so it's great news that you might be able to get everyone's views across this way.  I also Tweeted to Macmillan that they should turn it into a 'Brave to Apologise' campaign. The Twitter team haven't responded to that one but let's hope this will be the final year of 'Brave the Shave'.",
      "MessageIndex": 158,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Horrible thought, isn’t it? That even  a charity ultimately pays heed to big business rather than considering the views of the very people they were set up to help",
      "MessageIndex": 506,
      "PostDate": "26/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Excellent post. So many people get defensive about this issue, defending the 'brave shavers'. For some reason, thy can't see that it's similar to going round in a wheelchair for a day or having their eyes taped closed and going round with sunglasses and a white stick. These activities might also give someone an insight into what it's like to be disabled or blind but no one would consider doing them because they'd be seen as insensitive. Why can't they see it's the same with Brave the Shave?",
      "MessageIndex": 261,
      "PostDate": "06/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Many thanks for the update, Judy - much appreciated.",
      "MessageIndex": 298,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Hi Michael, If you're not willing to moderate the publicity owing to the funds raised by Brave the Shave, could you at least explicitly state the fact you 'do not wish to imply that fundraising shaves and losing hair owing to cancer treatment are comparable experiences' as a condition/proviso on the TV ad as well as all other 'Brave the Shave' promotions?",
      "MessageIndex": 320,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Seems some men worry about it too: www.theguardian.com/.../ronnie-wood-chemotherapy-lung-cancer-hair-rolling-stones",
      "MessageIndex": 358,
      "PostDate": "08/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Great response, June. Totally agree",
      "MessageIndex": 499,
      "PostDate": "24/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "But then thieving also makes money so does the means always justify the end? That said, I personally have much stronger feelings about the Brave the Shave campaign than about the ads per se.  You could also argue that experiencing life in a wheelchair for a day would be a feasible way to raise money for a disabled charity or that having your eyes taped down would be good for a blind charity but I doubt anyone would dare suggest either of those. What I can’t understand is how so many people can’t see that Brave the Shave is on a par.",
      "MessageIndex": 503,
      "PostDate": "25/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    },
    {
      "AuthorID": "Silverglades",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/silverglades",
      "Content": "Evie S Silverglades - I think anyone can add to a Wikipedia page. I have just had a look - seems as if you need to set up an account. I have just been sent a survey asking how I thought Macmillan dealt with my complaint - has anyone else had the same survey? xx Many thanks for this, Evie S. Judy58 - As the initiator of this discussion, would you like to do this? I didn't receive a survey last year & I haven't received a reply this year - I assume because I asked them not to send their standard response again.",
      "MessageIndex": 411,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/111000/does-anyone-else-dislike-the-macmillan-brave-the-shave-campaign",
      "Title": "Does anyone else dislike the Macmillan Brave the Shave campaign?"
    }
  ]
}