{
  "AuthorID": "SingleMumtotwo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/singlemumtotwo",
  "Posts": [
    {
      "AuthorID": "SingleMumtotwo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/singlemumtotwo",
      "Content": "Hi J Yes a massive shock. The Breast Nurses were great as was my best mate who is coming to most appointments. Seems HER2 was doing a very good job at hiding Am seeing an Oncologist tomorrow. My sister has worked with the Doctor but she has changed jobs since. She will come with me...I find I just can't absorb any info. Unfortunately my father is poorly also so my mother can only help a little. Have a few good local friends who will help where they can especially once I start Chemotherapy and Radiotherapy.  Good luck to you Positivthoughts to you V x",
      "MessageIndex": 2,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99845/newbie-bc",
      "Title": "Newbie....BC..."
    },
    {
      "AuthorID": "SingleMumtotwo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/singlemumtotwo",
      "Content": "Hi Hopefully this will work. Kinda useless attechnology .  Well I found a small lump in my right Breast early June this year. Got referred to Local Breast Unit. Told it was a cyst. Had numerous tests. Breast swelled to twice normal size. Early August was told it had turned into an abcess which needed draining. Ended up in A&E for emergency op. Was advised to have core biopsy of Breast and lymph glands. Told on 10/9 I had BC and needed a mastectomy and lymph glands removed. I had this done on 16/9.  It was HER2...anyone else had this? I am still in shock as are my family and close friends. I am struggling to do the normal things in life. I have limited use of my right arm, numbness and swelling. My mastectomy scar has healed well but still very tender. I have a 14yr old son and a 3yr old daughter.  Can any one give me advise as to how I can improve my arm etc I am doing exercises and seeing a physio  Many thanks in advance  V x",
      "MessageIndex": 0,
      "PostDate": "13/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99845/newbie-bc",
      "Title": "Newbie....BC..."
    }
  ]
}