{
  "AuthorID": "SJ2017",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sj2017",
  "Posts": [
    {
      "AuthorID": "SJ2017",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sj2017",
      "Content": "Hi Jenny I was diagnosed with Breast Cancer with secondaries in the Liver October 2016. I received Docetaxol with Herceptin and Perjeta for 5 months and have Herceptin and Perjeta every 3 weeks as on going treatment. I wasn't able to have surgery. I initially started on Fec. I found Green Tea and apples helped me enormously. I mostly have a Bramley cooking Apple each day. I stew it and put 2 spoons of flaxseed in it. Apples are known to have a detox effect on the Liver. When I started chemotherapy my blood count was low. I started to have a couple of Brazil nuts per day. Since then my bloods have been okay. Liver function is normal. My last tumour marker was 16.1. In October 2016 it was 2721. My tumours are currently stable. There is no cure but I am eating as healthy as I can to compliment the treatment. I also have Manuka honey and smoothies.  The thing that I am struggling with is fatigue. I do feel ill a lot of the time but I am hoping I will improve. Good luck with your treatment. Please let me know how you get on. SJ",
      "MessageIndex": 1,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159554/can-we-help-improve-liver-function",
      "Title": "Can we help improve liver function?"
    },
    {
      "AuthorID": "SJ2017",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sj2017",
      "Content": "Hi Peanut11 I am also HER2+ and ER+. I was diagnosed in Oct 2016 with secondaries in the Liver. I was unable to have surgery due to having secondaries.  I started Chemotherapy (fec) whilst the tumour was tested for HER2 status. Chemotherapy was then changed to Docetaxel with Herceptin and Perjeta. Docetaxel ended in March 2017 but have continued on a 3 weekly treatment of Herceptin and Perjeta. Also was diagnosed with a blood clot. Had a rough year as my Mum passed away in June and I fractured my spine also in June and was in hospital. When I returned home had to wear a brace for 6 weeks. Then had heart problems in October/November. Now on medication for that also.  Let me know how you are getting on and where you are with treatment.  The treatment is hard especially for the first week. Slight improvements for the next couple of weeks and then treatment starts again. Not sure when/if my energy will ever return as I am so tired all the time. Also hot flushes are a nightmare. Trying magnets at the moment to see if they will help. But seem to be getting hot flushes every hour. Even worse when I have had a meal at night.  I'm also having bereavement counselling as I'm still crying over losing my Mum. I find this site so helpful and comforting. I don't post things often but enjoy reading all comments and blogs.  I wish you well and even though it's hard we all must continue fighting this horrid disease. By the way the pictures and comments on the Awake thread do make me smile. Take care you lovely brave ladies. SJ Xx",
      "MessageIndex": 2,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146297/her2-and-er-positive",
      "Title": "Her2 and ER positive"
    }
  ]
}