{
  "AuthorID": "Sk18",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sk18",
  "Posts": [
    {
      "AuthorID": "Sk18",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sk18",
      "Content": "Hi friends, I am new to this community.. Age :41, unmarried, pre- menopausal Recently diagnosed with Invasive breast cancer (lump on the right chest wall-upper inner quadrant) lymph node and axillary node positive. Prognosis : ER+, PR+, her2 -. Size of the tumor is 2.7cm..and they say its a LABC (locally advanced breast cancer) . Done with the first chemo on 24th feb with CEF (cyclophosphamide, epirubicin, fluorouracil)..and further chemos will be done on 3 weekly basis. The reassessment will be done after 3rd or 4th chemo whether to continue the chemo till 6 cycles or surgery and then chemo, radiation and hormonal therapy. Here I see vast information about the disease and it's management and the drugs u have got. I am really worried about the chemo drugs and the way it is administered. My drug is CEF and it was directly given with the injections in the hand vein after putting the cannula. And all the medicine was given with injections in just 15 minutes. It would be really really helpful for me to know. -Is the regime CEF is good as compared to AC/T in relation to reoccurring and survival. -Is the way of giving chemo in 15 minutes is safe and can be tolerated well. Please reply soon..as my next chemo is due for next week. Thanks all..",
      "MessageIndex": 0,
      "PostDate": "09/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152224/is-cef-a-better-regime-for-locally-advanced-breast-cancer-with-er-pr-her2-",
      "Title": "Is CEF a better regime for locally advanced breast cancer with er..."
    },
    {
      "AuthorID": "Sk18",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sk18",
      "Content": "Thanks @bonnyjules ..great to know that u r having a good support of Ur team which take u through this in an easy way.. And regarding the dosage..this is what was given in the first chemo (cyclophosphamide-750, epirubicin,-120, fluorouracil-750mg) and I am from India Hope this is an apt plan for my sister.. Good luck for your 6th one.. Take Care",
      "MessageIndex": 4,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152224/is-cef-a-better-regime-for-locally-advanced-breast-cancer-with-er-pr-her2-",
      "Title": "Is CEF a better regime for locally advanced breast cancer with er..."
    },
    {
      "AuthorID": "Sk18",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sk18",
      "Content": "Thank you so much @ronstar for sharing your experience.. I am from India..and here mainly most percentage of hospitals take AC/t path so thats y we were little confused.. But now with other opinions we have studied believing that this CEF regime is also followed (may be lesser).  So hoping for the best.. And yes I ll surely post it in Nurse group about way chemo is being given.. Thanks",
      "MessageIndex": 3,
      "PostDate": "12/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152224/is-cef-a-better-regime-for-locally-advanced-breast-cancer-with-er-pr-her2-",
      "Title": "Is CEF a better regime for locally advanced breast cancer with er..."
    }
  ]
}