{
  "AuthorID": "Skye01",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
  "Posts": [
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Hi Flopsyuk and thank you. Gosh all these gene's and things that we learn about, never heard of that. I'm usually quite a sicky person but more so motion sickness so haven't had too many problems with chemo. Was a bit nauseous with my first chemo but soon got that sorted with meds. I've never been under GA so I think that is my worry, how I will feel ect. The unknown again I guess. I've only ever been in surgery twice and only in the last 2 years. First was emergency c section, so no time to even think about it. Then second was to have my hickman fitted, hadn't given much thought about it and so much going on, so no time to worry. I'm sure we will be fine but will still worry I guess. I have heard that GA is much better these days. Good luck xx",
      "MessageIndex": 14,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113145/moving-from-chemo-to-surgery-august-sept-2016---join-me-here",
      "Title": "Moving from Chemo to Surgery August / Sept 2016 - join me here"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Hi all, I have one chemo to go on the 30th August, meeting with my surgeon in a few weeks. So surgery for me will probably be the end of September. Haven't really thought or worried about it too much but I am starting to now it's getting closer. With regards to worrying about sickness my friend mentioned she was concerned and hates being sick. They decided to give her some anti sickness drugs. So may be worth mentioning. Good luck xx",
      "MessageIndex": 11,
      "PostDate": "12/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113145/moving-from-chemo-to-surgery-august-sept-2016---join-me-here",
      "Title": "Moving from Chemo to Surgery August / Sept 2016 - join me here"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Hi Gem, I was diagnosed with the same as you except grade 3. It was a total shock as even my GP and consultants were convinced it was fibrous. Let yourself take in what is happening. It does get easier in time, once you have your treatement plan it gives you something to focus on and time starts passing by quite quickly. I remember everyone on here giving me the same advice four months ago. I was so grateful but never believed it could get easier, well it has. Not easy by any means but definitely easier. Ask lots of questions, on here and with professionals. You'll get lots of support on here and from your team. I am near the end of chemo now and meeting with my surgeon in 2 weeks. The last time I saw him was the day after he told me my diagnosis and he said then we will meet at the end of August. I remember thinking how far away that seemed. It hasn't been easy and there have been some awful days, emotionally and with side effects. However it is no where near as bad as I expected it to be. I hope that helps a little. There will be more of us along soon, some simply offering support others with great advice. xx",
      "MessageIndex": 2,
      "PostDate": "08/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113070/i-have-just-been-diagnosed-with-invasive-ductual-carcinoma-stage-2-grade-2",
      "Title": "I have just been diagnosed with invasive ductual carcinoma stage 2..."
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Hi all, sorry bit of a rant! So I've mentioned this before but it all just took a turn for the worse. My family haven't been very supportive since I was diagnosed. I've tried being patient and understanding, they may be struggling with my diagnosis etc. I've tried talking and explaining what I need. I've tried giving them a job to do and not expecting more. So on and so on..... Recently my Mum decided she wanted to change the date of her party, she's turning 70, my Aunt and her daughter can't make the date we chose. I explained that the new date wouldn't be any good for me. Nothing more was said. Then recently they were discussing changing it again. I'd had enough and simply said that I'd already told them I wouldn't be able to go because I'd be too poorly on that date. I said it was her party and she needed to decide. She said she wanted to change it. I was in hospital last week with neutropenia and it was a nightmare. Then the day after I came out I tried to talk to my Mum and explain that my family needed to pull together. Whilst I was in hospital I got upset thinking how much help I need etc and just wasn't getting it. Then my Uncle turned up suggesting my Mum had been doing too much and asked if social services could help with my daughter or if I'd be willing to put her in temporary foster care. I couldn't believe it!!! From past experience it suggests my Mum has been moaning. She only had her a few hours in the morning and then in the evening for two hours which would be dinner, bath, bed. Then she sleeps through the night. This happened for two days. So today I tried to get to the bottom of it all. I asked her a few questions to see if she is coping with helping me. I also explained that it is not helpful to me when she is moaning all the time, she is constantly telling me how ill she is and how tired she is. Then it takes her forever before she asks how I am. Even when I was in hospital!!! When I need her she has to arrange for someone to watch her dog but she never sorts it. She leaves it to the very last minute, moaning about it and everyone. She broke down and passed the phone to my sister who very quickly had a go at me saying how I'd upset my Mum. She told me I was in a mood, to which I replied no I have cancer. She reminded me that my Mum is 70 soon. Like I'm supposed to treat her like she's fragile. She's a very capable, well, 69 year old and certainly doesn't look it. I'm just absolutely sick of it. I've been told I need to make a list of what help I need. I said should I add please visit me next time I go into hospital. Please be a sister and invite me out for coffee. I said I just want a family. Well apparently we're all meeting at my Mum's on Thursday to talk. It's going to be a waste of time because they just don't think and it has to come from them. I'm not going to make a list and spoon feed them. If they can't just be there for me what's the point. I'm the bad guy now so they are going to be defensive in anything I say. Urrgggh I just don't even know anymore. Sorry for moaning. xx",
      "MessageIndex": 0,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Thank you everyone! It really does help knowing I'm not the only one and that it's not me being unreasonable. Also thank you for the hugs :) mistymoley I said the exact same. There are relatives that I'm not close to but I still wouldn't sit back and watch their children be put in to care. Let alone my sisters children. I've also made it very clear to my Mum that if she feels she can't manage to let me know. I can't stand excuses and that is all I hear.  Dolina I think you are right. Even if this family meeting goes ok I feel I can't trust them. I think I have to look to my friends and ask them how much they are able to do. They have been so supportive. I trust them completely. Then my family can do the donkey jobs. Unfortunately I am not near Aberdeen but thank you for the kind offer. Kacang oh my goodnes you have literally just described my mother. All she does is moan about how tired she is from walking and who is going to look after her dog. Yesterday she had walked 5 minutes to her bus stop and then back again and she was quite exhausted. Pfft! You're right though she will never change. KiwiCardi you have also just described my mother!!! When I was in hospital last week I rang her to see if my daughter was ok. She spent the first 10 minutes telling me how tired she was, said my daughter was fine then eventually asked how I was. I too just end up saying I'm fine. For a short while I did start answering that question more honestly but it doesn't change anything. She also likes the sympathy she gets from my cancer, my sister too. I will let them know how rubbish they have been. I wont expect anything to change, I will leave it to them to follow it through. I will defo talk to my friends and see how much they want to do. They are furious at my family so completely understand how hard it is. I shall give you all an update after Thursday! xx",
      "MessageIndex": 14,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "You guys are amazing! KerryCake awww bless you. It really is a \"sorter out\", I was prepared for that, my health visitor said cancer sorts the men from the boys. I just never expected my family to be quite so useless about it all. I'm sorry about your best friend. It's so upsetting. Cancer really does change us, I am not assertive at all normally but I have been recently. Funnily enough I did meet with my sister today, her idea. She wanted to make it clear she is here for me and made a few suggestions. I just hope she follows through, only time will tell. My friends have been amazing and yes help has come from the strangest of places. Yes I would be ashamed too. I keep saying that cancer is so much more than a lump. We can fight that and have it removed. It's everything else that comes with it that is so hard. I even said that having chemo is easier than dealing with the way people treat you, the unsupportive ones. Hi Julia :) Crystaljuju You are spot on, my Mum has a lot of control over everyone, she knows how to play the game. Even me to a certain extent! I was extremely insulted and hurt when she wanted to change the date. I think I will go to this meeting with a super long list. Then leave it to them to follow through. If they don't then I will keep my distance. They are defo used to me doing what they want. If all else fails printing out this thread will be at the top of my list! :) iwannaliveforever feel free to rant if you wish, on here or in a private message xx walkinginlonggrass this is exactly why I wanted to talk to them now. I just want to know where I stand, if they can't/wont help I will ask more of my friends. They just need to let me know one way or another. Yes, I was/am exactly the same didn't want to ask for help and expected them to be understanding and step in. I did start asking for help but I guess I do need to make myself clearer. Hopefully Thursday will be a help even if it's not what I want to hear, I'll know where I stand at least. Thanks everyone xx",
      "MessageIndex": 20,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "KerryCake I'm so sorry about your friend. She sounds exactly like my mum and sister. When I finally confronted them they acted exactly the same. They were the ones that were hurt they couldn't see that they had hurt me and that's why we were having the conversation in the first place. So utterly frustrating! Good for you for standing firm. It's not easy but we have to stand up for ourselves and yes we should be very proud of ourselves!!! You are right cancer changes you. That is perfect Kacang thank you! I've had a good chat with one of my friends and since then we have already come up with some good plans. Things are moving forward already. I've just got to accept my family won't change and embrace those who want to help. Thanks guys. xx",
      "MessageIndex": 37,
      "PostDate": "06/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Thanks again for all your comments everyone. I guess it's just not going to be as easy as I thought to get used to the fact they wont change. But you are all right I need to focus on me and my daughter and embrace those who want to help. So I had my 5th chemo yesterday, back on FEC. It went ok, slept well last night. Feeling a bit yack today and waiting for the awful mouth etc to start. So only one more to go, in 4/5 weeks if you include SE all this will be over well this part anyway. I'm meeting with my surgeon in two weeks and me and my friend are going to have a big chat then about what help I need and who can supply. I think that will be a big turning point. I find chemo hard emotionally so I'm sure it will get easier once chemo is done. xx",
      "MessageIndex": 48,
      "PostDate": "10/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Hi all! Thanks for the latest comments, your support means so much. So! It was a big fat fail!!! As soon as my sister picked me up all she did was moan about how ill she is and how everything was getting on top of her. She was then kind enough to clarify that she meant her being ill and issues with her landlord, my situation clearly isn't getting on top of her. My brother hadn't bothered to turn up, my sister had been ringing him no answer. My mum eventually got hold of him, my sister ate her dinner and then went to pick him up. So I'd been there an hour before everyone actually sat down. My other sister, who I met yesterday, didn't come. She went out for the day and wasn't sure she could get back in time. Her husband said he wasn't changing his plans for anyone, nice ey! My mum suggested we should start talking since that's why we were there. She knows I need help with my garden so started telling my brother that he needed to come and sort it. He huffed and puffed and made comments about not knowing how to use a mower. Then everyone talked about anything but me and my brother put the tv on. Eventually at 10pm I said I needed to go because my daughter wakes up at 6am. Nearly three hours total waste. I honestly could've ranted and raved and made demands but from the moment I stepped in the house I just knew they didn't get it. It was too much effort to even talk never mind offer to help. I'm just not willing to set myself up for a fall. I think I need to talk to my friends and see how much they can help. Then if there are a few areas that they can't cover then I'll ask my family. Thanks so much for all your advise and support it really does mean a lot. xx",
      "MessageIndex": 26,
      "PostDate": "04/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Thanks everyone. I was managing to hold it together until I read the latest comments, you are all so lovely. I think you have all pretty much said the same which is also what I am thinking. I need to focus on myself and my daughter and getting better. I have some amazing friends who I know I can rely on so I will turn to them more now. Some have only come back into my life recently and people who I barely know have also offered support, including you guys. Infact these people and yourselves have been so kind and the most supportive. My angels arrived already in the form of my two best friends who I hadn't seen for years. Unfortunately one of them doesn't live near me and she is gutted, she rings me often asking what she can do. We have chatted and realised she can be a great help when I am recovering from surgery, she is so pleased. My other friend is near and does anything she can. They are both furious with my family. Especially since I have always been there for them, practically brought up my nieces and nephew. Dreamthief your step mother in law sounds exactly like my mum. I live in the Midlands, near Derby. xx",
      "MessageIndex": 31,
      "PostDate": "05/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "So just when I feel like I'm making sense of everything it all gets crazy again. My mum and sister have been away for the weekend visiting family. My sister was very quick to suggest my mum needed a break. As though it were my fault. Best part was that it was me that suggested my mum go.  Anyway, they came home today. Rang my mum to ask if they had a nice time and to check she will be home tomorrow so I can pop round. Need to discuss the weeks plan as I have chemo tomorrow.  All she did was moan from the second I asked. Do you know how much I need a break right now and all she can do is moan.  Anyway it gets worse. She then went on about all my sister did was sleep. She went into great detail how she thinks something is seriously wrong with her. She even sounded extremely concerned. Something I have never heard regarding my situation.  She never asked how I am. If I had a nice weekend. If her granddaughter is OK...... I just wanted to cry. Then my niece has just been weird with me all day, shitty actually. She's 24 and has lived with me since she was 18. I've always thought we were close but the last 2 years seem to be telling me different. Particularly more recently with my diagnosis.  I'm sad to say that I realise more every day how like her mum she is (my sister who is apparently sicker than me....). It breaks my heart but I just can't ignore the way she behaves anymore. I make excuses for her and let people think she is helping me lots. I'm too upset/shocked to tell anyone otherwise.  It has been so bad that before I was diagnosed we decided to not live together anymore. We were both going to move. Then this happened. I gave her the choice and she said she wanted us to stay living together so she could help me.  I've got chemo tomorrow and now I can't sleep because of my family. Otherwise I'm feeling so positive about being at the end of chemo.  When I was diagnosed and my BCN talked to me I broke down.  Not because I had just been told I have cancer but because I knew I wouldn't get any support from my family. When I was in labour with my daughter they left me to give birth on my own. I'd asked them to be there. They turned up hours after she was born. Then they didn't help once she was born.  I'm also sick of people staring at me. I've read that most people with cancer find other people react well and are kind. Well all I see is people staring, local shop staff who used to chat to me can barely smile now. Even my family /friends have noticed so it's not just me being paranoid. Yes I have some lovely friends and I don't know where I'd be without them. But they have their own lives too. It's not them I have to face every day. Just had enough now.  xx",
      "MessageIndex": 38,
      "PostDate": "09/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Thanks Alice, you make some good points. I will defo give them a chance and hear them out on Thursday who knows maybe we will find a solution. Thanks Flopsyuk. I find posting on here helps because of the support so I appreciate your post and hugs :) I just feel like we've had so many of these talks already since I was diagnosed and we've got nowhere. The only reason they are responding now is because my Mum is playing the victim. xx",
      "MessageIndex": 3,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Yes Alice I wonder that myself lol!!! In the beginning I thought the same, I was well in myself so didn't seem like I needed help. This recent hospital stay has really shocked/upset me. I will have to talk to them like children, my Mum and three siblings, not one of them will get it. Luckily I do have some great friends but they can't do everything and why should they. I've always been there for my family. Oh dear helsbels lol, I feel for you too. I like your comment \"enjoyed\" ill health, that is a perfect description of my Mum. It is a great help knowing I am not alone, you often feel you are in these situations. How can there possibly be more people like my family out there.... People I barely know have been more sympathetic and helpful. I'm still so mad this morning. I should be focusing on getting better or having fun with my daughter whilst I'm having a good day before chemo next week. I feel like I want to go talk to my Mum this morning but I'm so sick of talking. Plus she'll just be defensive instead of being open to trying to understand how I feel. Bigs hugs to you all too xx",
      "MessageIndex": 6,
      "PostDate": "03/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Just to make you feel a little better you are the second person that has posted about this today, the other was a different site I go on. :)",
      "MessageIndex": 6,
      "PostDate": "17/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110487/nits",
      "Title": "Nits"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "I agree defo go for it. I have a hickman line, different but similar idea. It totally grossed me out too when I read about it but I knew I needed to have it done. I don't regret it at all. Agree with LondonLass, just a hassle having it flushed every week and waiting around for ages. I'd rather that than facing a canula every cycle. I have rubbish veins. xx",
      "MessageIndex": 4,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112831/picc-line-for-chemo",
      "Title": "Picc line for chemo"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "The Hickman is inserted into your chest not your arm. They didn't offer the Picc at my hospital. It wasn't nice having it done, not awful but uncomfortable pulling and tugging. I was worried about caring for it but I don't do much with it just clean the sticky bits off. It's just part of me now. I don't feel anything when having chemo just a bit cold when the drugs go in, warm when taking blood. Definitely ask about both of them since they offered both. xx",
      "MessageIndex": 10,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112831/picc-line-for-chemo",
      "Title": "Picc line for chemo"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "She just means that if you have a bath it's easier to control what you're doing so as not to get the picc wet. Having a shower might be more awkward. My line is different so I can't really tell you anything. You may want to ask what is involved in fitting it, how does it feel. How does it feel when having chemo. xx",
      "MessageIndex": 8,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112831/picc-line-for-chemo",
      "Title": "Picc line for chemo"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Hi I've really struggled with water, it tastes odd and I also have issues with swallowing due to oral thrush. I find orange juice, cordial and flavoured milk are better.  I can't eat bread particularly toast, also bacon, anything dry or crispy. I've also struggled with mash which I thought would be ok.  Things tomato based, bolognaise, lasagne etc are good. Thai curry as tasty but not spicy, also sticky rice is a new find. Normal rice can't stand. Like others cold custard or even cooled down. Yogurts.  I've heard that pineapple is good to kick start your taste buds. Also good for oral thrush so defo trying that this time. Don't have pineapple if you have a sore mouth though as it will sting. Found out the hard way. You can get pineapple ice lollies, real juice like someone mentioned the orange ones.  I can't stand milk chocolate at the moment so if I fancy some go for dark chocolate which is nicer.  I really struggle with eating after chemo but more so because of the oral thrush which makes swallowing awful. So any tips with that would be appreciated.  xx",
      "MessageIndex": 11,
      "PostDate": "10/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113134/everything-tastes-so-bad",
      "Title": "Everything tastes so bad!!!!!"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "I have had every appointment from diagnosis copied to me and they also copy one to my GP. It has been a great help especially when I was diagnosed as you forget things and you have them to refer back to. I didn't ask and it was my onco that told me I would receive them. Should offer it to everyone! xx",
      "MessageIndex": 3,
      "PostDate": "16/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/110512/hospital-letters",
      "Title": "Hospital letters"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "sugar65 I hadn't thought of it like that \"on your first day of getting better\". I'm a very positive person generally but have been struggling with this whole feeling perfectly well right now and the doctors are about to make me feel ill. I shall look at it from your view point from now. Thanks! :) xx",
      "MessageIndex": 21,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109160/chemo-starts-tomorrow",
      "Title": "Chemo Starts Tomorrow"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Good luck for tomorrow Lynn and everyone else of course. Don't forget your duct tape!!! :) I cried and cried when I was first diagnosed then it's just been a couple of times since when something has upset me. Then the last few days I've been all weepy again, just like you. I am sure you (we) will be great, keep that positivity and fab sense of humour going. BTW you are the same as me IDC stage 3, no nodes. Love and hugs xx",
      "MessageIndex": 20,
      "PostDate": "15/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109160/chemo-starts-tomorrow",
      "Title": "Chemo Starts Tomorrow"
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Hi everyone, Thanks for all of the good luck wishes pre surgery. All went well, recovery is going great too and I wanted to share my surgery results with you all. NO CANCER WAS FOUND!!!!! Can't quite believe it :) There have been lots of hugs and tears. Julia or anyone can you remind me of the technical term and Julia I remember you saying there was a good read about the facts around it? Radiotherapy next. Saw my onco yesterday who is very pleased with my recovery. Thanks to all for the fab advice. Big hugs to everyone xx",
      "MessageIndex": 0,
      "PostDate": "15/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116475/happy-news",
      "Title": "Happy news...."
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Oh and my BRCA test was negative :) xx",
      "MessageIndex": 1,
      "PostDate": "15/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116475/happy-news",
      "Title": "Happy news...."
    },
    {
      "AuthorID": "Skye01",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skye01",
      "Content": "Thanks everyone. Yes I remember now Julia and I thought you'd tell me a fact or two, thanks. More wonderful news to hold on to and share :) Oh gosh Dreamthief I just spotted the picture and it brought a tear to my eye again, thank you. xx",
      "MessageIndex": 6,
      "PostDate": "15/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116475/happy-news",
      "Title": "Happy news...."
    }
  ]
}