{
  "AuthorID": "Skylight",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skylight",
  "Posts": [
    {
      "AuthorID": "Skylight",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skylight",
      "Content": "Kargus I too have Accord brand.  The GP has written if possible on my prescription. (If accord isn't dispensed I refuse them , ask for my prescription back and go elsewhere!)  Boots can get it - sometimes they have to order it in so I ask for prescription early.  Hope this helps. The one thing I've learned from this site (always read) is to be assertive about what you want.  Good luck with sorting this out.",
      "MessageIndex": 2,
      "PostDate": "03/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128153/supply-of-letrozole",
      "Title": "supply of letrozole"
    },
    {
      "AuthorID": "Skylight",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skylight",
      "Content": "I read some Chinese research about soya and pomegranate seeds being helpful with femura side effects.  I have them with oats for breakfast - alpro soya yoghurt with almond or coconut are both lovely.  I also take turmeric capsules.  There is a very good turmeric fb group that has files of research as well as drug interactions.  They advocate making a paste with turmeric, oil and black pepper (with cinnamon to help your wee from smelling) and people are reporting good results. The mods respond very quickly to questions too.  Hope you find something that helps.  I'm ok now unless I do a lot of walking then I stiffen up in the evening.",
      "MessageIndex": 4,
      "PostDate": "01/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129800/anything-is-worth-a-try-joint-pain",
      "Title": "Anything is worth a try..... joint pain"
    },
    {
      "AuthorID": "Skylight",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skylight",
      "Content": "triumph The way I see it they can't tell me if cancer has gone I have stage 3 and even if I take them it might still come back anyway or it might not ‍♀️I never took the pill or HRT so after trying it and really didn't like side effects so I stopped haven't even seen a GP spoke to one who told me he couldn't prescribe vitamin D just get a supplement and that's the only contact I had so no faith in them monitoring me I guess I just have to get on with life I guess I was lucky. When I was diagnosed and having a blood test from GP I asked if they would test the vit  levels.  She did ask why and I talked about research.  I then had a phone call to say the levels were indeed low and offered the tablets.  She said if the tablets were prescribed then I couldn't have another blood test to check.  Then I found out the capsules were gelatin!  Asked the chemist what could buy over the counter but she said that you can't buy a high enough dose over the counter. (My daughter buys them over the net as she takes a very high dose each day). Luckily it is also available in tablet form at the same price and g p was quite happy to switch them over.  Hope you get sorted out Triumph.  Have you tried different brands of letrozle?",
      "MessageIndex": 11,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134788/stopping-letrozol",
      "Title": "stopping letrozol"
    },
    {
      "AuthorID": "Skylight",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/skylight",
      "Content": "So sorry to hear about your stroke.  How did you get on yesterday?  Was thinking of you.",
      "MessageIndex": 228,
      "PostDate": "03/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    }
  ]
}