{
  "AuthorID": "Smoothie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
  "Posts": [
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Susie Fec - or the steroids - do the same to me, though my second round saw me sleeping a little longer than the first round. I would wake up in the early hours then get up and lie down on the sofa with a duvet where I found I dozed better than if I stayed in bed because I would like there worrying I was going to wake my husband who needs to go to work the next day.  I hope you're finding yourself sleeping longer tonight! x",
      "MessageIndex": 3,
      "PostDate": "07/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98445/sleepless-nights",
      "Title": "Sleepless Nights"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Hawkster, I was diagnosed 20th May and had a lumpectomy on 18th June so am now 3 weeks post op. i remember those feelings so much. I echo the comments about keeping positive, but also that that doesn't mean you can't cry. Crying will let out your negative emotions and can really help with cleansing, It took me a while to realise that! I researched my type and possible treatment options too, so that when the doctors mentioned it I knew what they were talking about and felt much more empowered. For example, I didn't think I'd need chemo so didn't research then was told it was on the table and had a week to wait to talk to oncologist so I got on here and read everything I could. I was armed with a list of questions that I wouldn't have known to ask otherwise, my husband on the other hand didn't have a clue about it. lots of love for you for the coming week, there is a wealth of support on here. I haven't been to breast cancer.org purely because once I joined here I found reading all these threads took enough time but now I have a bit more time I think I'll pop over there too.....  Nicky x",
      "MessageIndex": 5,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96394/newly-diagnosed-and-terrified",
      "Title": "newly diagnosed and terrified."
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Lizzy same here, WLE on 18th June, just about to have 5th chemo, I get shooting pains in op area after each chemo, oncologist confirmed exactly what JJ said. All the new tissue is trying to grow while chemo is attacking it.  I worried that as my WLE site has now filled with 'scar tissue' that is hard might be harbouring some stray cells, and worried that on future mammograms that they might not be able to tell the difference, but he assured me on ultrasound that they look completely different. Bit of a tangent there but that was an issue I worried about alongside the pain. x",
      "MessageIndex": 6,
      "PostDate": "17/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99977/breast-pains-during-chemo",
      "Title": "Breast pains during chemo"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi JJ - my chemo nurse warned me about the itchy skin, I take antihistamine anyway to try and combat the dressing reactions on my PICC and I asked if they would help and was told it would, and it may also help with the fingers and toes tingling - I can't work that bit out but as I'm taking anyway I'm hoping it's true! I'll be keeping a close eye on your SE's as I'm having my first T on Tuesday next week. Just out of interest, did you get any useful drugs in your pharmacy bag to counteract any of the common side effects? Angieknit -  hope your bloods were ok second time round? x",
      "MessageIndex": 17,
      "PostDate": "23/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98911/taxotere-side-effects-info-please",
      "Title": "Taxotere side effects info please"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "I was considering the cold cap, especially after seeing the positive response from Hevbojangles, but after discussing with nurse the additional time needed after (I was already going to be there two additional hours having picc line done) and discussion with the support group I go to, 3 ladies there had tried it and all lost all their hair I decided I had come to terms with losing my hair anyway so didnt do the cold cap. i was glad that first day that as soon as that last beeper went off that I could then get up and leave, as there was a lady across the room from me still there all wrapped in blankets and she'd finished just as I went in. it is all about personal choice, I decided that as there was no guarantee to keep my hair, I would rather be home, and if I was going through chemo I wanted it to be able to get to every cell in my body.   There was a different lady there with it on when I went this week so think there is always someone using it, and the nurses in my hospital have no problem at all with those ladies being there and do what they can to provide additional warmth. good luck with your intro next week, stand your ground, I'm sure they will be supportive.",
      "MessageIndex": 6,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97932/fec-t-and-cold-cap",
      "Title": "fec-t and cold cap"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Rachel I quite like this idea! I would like to write something about my journey but I'm not a blogger either. I am 42 and was diagnosed on 20th May, had a WLE on 18th June and have my Chemo intro appointment with my nurse today when I will be getting my start date for chemo.  I will also be having radiotherapy after chemo (x15 - 18 not sure how many yet) I assume you mean in the original penpal way in snail mail? I love getting letters (which of course so rarely happens) and I think this would be lovely to receive during our chemo journey :) Count me in! Nicky",
      "MessageIndex": 3,
      "PostDate": "21/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96797/writing-project-instead-of-a-blog-july-dec-posting-here-in-the-chemo-thread",
      "Title": "Writing project instead of a blog? July-Dec? Posting here & in the..."
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Rachel, sent you a PM :) nicky",
      "MessageIndex": 6,
      "PostDate": "26/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96797/writing-project-instead-of-a-blog-july-dec-posting-here-in-the-chemo-thread",
      "Title": "Writing project instead of a blog? July-Dec? Posting here & in the..."
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Thanks from another Newbie here, reading about getting through it really helps me come to terms with what is happening, and more importantly that although the next few months will be tough I know I'll get out the other side :)",
      "MessageIndex": 23,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95836/said-my-goodbyes",
      "Title": "Said my goodbyes"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Oh Eleanor I take my hat off to you. I only had two kids, and neither with the challenges that you have, and when mine were primary school age I found them so exhausting when I wasn't going through cancer So I can only imagine how tired you must be, and understand feeling down. my kids are now 14 and 16 and now can't wait for them to go back to school so I can have some quiet time during the day. i felt very much like you in that all my friends, everyone I know, have all been going away and having lovely relaxing times, and posting all their lovely holiday photos on Facebook, and I've struggled with envy a lot.  I know this is only temporary, but that doesn't help on down days.  So I decided to book a cottage in Cornwall for the week after Christmas where the four of us can hole up and recuperate. No housework, nice food, hopefully I'll be back on the wine by then (chemo has totally put me off my wine, so even the one glass I wanted to have as a treat ended up down the sink), along with some blustery beach walks and cream teas are now foremost in my mind when I start feeling down.  Love the fact you have a beach hut, that must be fantastic! I am now landlocked in Berkshire but grew up in the northeast so as a kid spent most weekends at the beach, love love love it!  PJ I was always a bit worried about telling my family when I felt fed up because i thought people expected me to be strong, and honestly I felt guilty when I did, but I had a word with myself and started allowing myself days when I could feel fed up, and have a bit of a cry because just by admitting how I was feeling it let the feelings out did help. for me it's always been the waiting that has caused me to feel so down.   X",
      "MessageIndex": 15,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98115/feeling-fed-up-and-down",
      "Title": "feeling fed up and down"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi - I haven't experienced this but wanted to say I am sorry you are dealing with so much. do you have a support system?",
      "MessageIndex": 1,
      "PostDate": "29/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100598/all-about-face",
      "Title": "All about face!"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi AmberB, brillaint news for clear margins and only one node affected.  I'm in a very similar position as you, lumpectomy 16 days ago, axillary nodes taken after sentinel nodes were positive. had a rubbish post op appointment on Tuesday and was told margins clear (phew) and 2 sentinel nodes were pos but all others negative. They didn't confirm how many in total, and didn't confirm if original grade was correct (grade 1) just because it went so bad I actually left the appointment and am Now seeing onc on Tuesday this week to discuss stats as the junior doc mentioned they would recommend chemo.  I really don't want chemo, for a few reasons, so am waiting with baited breath for Tuesday and the statistics. Then it will will be time to decide. For me the waiting and the unknown are what are doing my head in! hope you manage to relax and make the most of your healing time before appointment with onc.  Nicky x  ",
      "MessageIndex": 11,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96086/dreading-results",
      "Title": "Dreading results"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "I have breast cancer, diagnosed in May and currently having chemo. i have found a lot of support on this site over the last few months, in what way have you been disappointed? This is quite an active online community and I have no doubt someone will have experienced something similar to you, there is lots of different experiences. ",
      "MessageIndex": 3,
      "PostDate": "29/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100598/all-about-face",
      "Title": "All about face!"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Fantastic! Great to hear good news! x",
      "MessageIndex": 3,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96029/result-of-first-mammogram-today",
      "Title": "Result of first mammogram today ..."
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Bungle i had same op in June and first seroma was 5 days post op and so painful I cried with relief when I had it drained 2 days later. I couldn't put my arm down at all and my arm was beginning to ache so much and I was exhausted with it all. The nurse did say that they prefer not to do them but as it was large she was happy to, and she said exactly the same when I went back 3 days later.  I think they like to discourage people from going unless they really do need it drained. I did suffer with infection from either of mine. Probably going to a none seroma clinic/cancer clinic you didn't quite get the compassion and understanding that you would from a nurse who is used to seeing these things on a daily basis, awful situation for you to be in. I know I would have probably lost it at that stage just due to the pain and stress involved, so you did well on that front. my seromas started refilling within hours of being drained so I did think it would go on forever! I asked the nurse the second time if there was anything I could do to help myself, e.g. Ice it, warm it, she said no but if I wanted to try something then cooling would be the preferred option. So as soon as I got home I wrapped my wine cooler from the freezer in a tea towel and put it under my arm and it was bliss! I thought well if nothing else it was taking away a lot of the discomfort which painkillers didn't touch. After two days of intermittent cooling the seroma had completely disappeared. I don't know if this is coincidence or if cooling it helped, but I would highly recommend it for the relief if nothing else.  Good luck, I hope like me you find it slows down soon and you can once again put your arm down comfortably and look less like a tea pot (that's how I felt :) ) nicky x",
      "MessageIndex": 6,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98148/seromas-and-the-risk-of-infection",
      "Title": "Seromas and the risk of infection"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Ha ha googling and the 'wle' comment definitely makes you think they weren't the experts!  The nurse at my seroma clinic did say if I needed help outside the clinic hours I could contact my gp but they probably refuse due to their inexperience and fear of infection and other things that can go wrong, sounds pretty much the attitude that you received. glad you got sorted, I found the seroma the most painful part about the whole thing! ",
      "MessageIndex": 8,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98148/seromas-and-the-risk-of-infection",
      "Title": "Seromas and the risk of infection"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi All - I haven't posted for a few days as my stupid ipad keeps kicking me out and I am less than my usual patient self right now... I am on day 11 of first FEC, and on Tuesday I awoke to the old me with boundless energy and completely settled tummy. I could have cried for that normality! I have since then filled my days with fun and feel much better about the next round knowing there will be normality in between. Thanks for everyone that replied to me on the July thread re sickness! Chrissie I can't believe how quick your last T is coming round, I started reading the chemo threads just before your first one, this gives me hope that mine will be over before I know it too (I can hope...) I haven't got a wig yet as the lady at the hospital as been away, and I am due to see her on day 16 which was leaving me a little anxious. I have some scarves so now I don't need to worry about not having anything, but I am worrying about trying wigs on when my hair decides to start leaping from my head!  I was hoping to keep it for colour matching (have had it cut very short for me, it was down to my bra strap, now it's only a couple of inches long) but now I'm not sure how important that is as I've dyed it and highlighted it for so many years I may just get my husband to use the zero grade clippers on it and go with a wig style and colour I've always fancied :) Thanks for the tip re massaging head Amanda, that actually sounds quite relaxing! I can feel my scalp is a little dry now so the thought appeals to me! And I love the warrioress image, I am going to try and keep that in mind. Hope everyone else is doing ok Nicky x",
      "MessageIndex": 29,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi all, re Picc line, I had one fitted morning of first FEC and I didn't feel a thing, even the local going in, I have dodgy veins so this is a relief to me that this is in and no fishing around for veins for chemo and bloods. sickness... Susie I get sick at the drop of a hat too so I have an emend an hour before chemo, then some during chemo and then domperidone for a couple of hours later. I have emend before breakfast for next two days with one other drug only once the domperidone regularly until day 6 then more for back up. I only needed to take one on day 7 then from day 8 I have been absolutely fine in the sickness dept, completely settled tummy.  I assume you take a domperidone before a meal? I found that I would take a tablet an hour before food and still not really fancy anything, but would have a couple of mouthfuls then start feeling a little better. I also ate little and often which helped keep it a bay a little, if I went too long it tended to get more of a hold. I am having second FEC on Tuesday and am a little nervous about the sickness again, but onco gave me a few tips on how to be more pro active now I know how I was ( take first anti sickness after chemo earlier than I did last time, take an laxative sachet night before chemo and night of chemo so it doesn't get to the point of constipation as that didn't help with the sickness) so I'm optimistic for it to be lesser than last time.  If you think you need more generally Susie, I would ask your nurse/onco for more, possibly the emend before hand which a few of us have on here. re antihistamines, I had already agreed with my onco to take these for hay fever and while doing research on the injections my husband found a chat forum and some people had been recommended to take piriton and specifically chlorphenamine maleate so I checked mine and they weren't that so bought some piriton tablets and have been taking those nightly, I didn't seem to suffer any aches from my injections so am going to continue this throughout, and if they also help with T aches I will most definitely!  I have eave been surprised at how well I have felt from day 8 onwards ( and day 4-7 were only like mild hangover so very bearable) which I have been so grateful for! The only thing is I feel normal so try to do normal things and find I don't quite have the energy so if I have a busy day one day I try and have a more relaxed day the next. on a mission this weekend to get house cleaned for Tuesday, I will have to pace myself :)",
      "MessageIndex": 94,
      "PostDate": "15/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi all, I am FEC 1 day 13 and had the filgrastin For 7 injections from day 3. The nurse recommended I take them at night and somfar I had one night, on the last one, where I had pelvic pain. It could be because I didn't sleep well that night that I noticed the pain where I hadn't on previous nights. But I suffer with a hey pelvis when hormonal anyway and I thought this pain was less than that so for me the injections have been a breeze, with no sign of temp either. von - you sound like you've had such a nightmare, hope you are well on your way to your glass of wine! spin girl, I am so impressed you managed to get your chemo swapped, you must be relieved you don't have to worry about travel on top of everything else. Jedi - hope your face has calmed down quickly, I had heard we could react badly but I hadn't imagined that! birty - hope your aches have started reducing... I will be having T but not experienced it yet, so not sure if I'm a bit premature in that, do they just last a couple days or once started do they tend to lurk? Hope you found some better painkillers. hope everyone has enjoyed this sweltering day.... I made the mistake of going clothes shopping, I'm not actually a good shopper at the best of times so today I was completely worn out. It's odd because I feel so 'normal' since day 8, so I try to do normal things then discover I can last about half an hour before it becomes time for a rest.  went shopping yesterday with a lady I met at chemo, her first one too, and we went make up shopping together for eyebrow stuff after watching a tutorial on you tube. I'm not really in to makeup either so this could get entertaining! Has anyone else bothered drawing on brows or do you just leave them? good luck to the new ladies having chemo this week, I worried about it and was pleasantly surprised about how unscarey it turned out to be, and after round one I have been surprised how better I have felt compared to what I imagined I would be feeling. x",
      "MessageIndex": 52,
      "PostDate": "09/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Great news Jojo! It really makes all the chemo worthwhile when you can see the effects it is having on reducing the cancer and making less invasive surgery possible! Lou Lou, I made lots of prep pre chemo building it up in my head to be something scary, when in reality it isn't, it's just the scary word chemo itself conjures up awful images. i hope you manage to feel more relaxed, though I know the week leading up to my first one I lay awake for hours, except the two night prior where I slept all night like a baby much to my relief! i am Fec 2 day 12 and am going to go for my first walk today. Although I felt fantastic day 1-3 this time round I have felt 'dodgy/odd/queasy/achey/not myself' for long this round. I was out walking by day 8 last time and am definitely more fatigued this time. I have dug out my yoga for breast cancer DVD that I started doing post op in the hope that I can get into some routine to get myself up and about and moving more as I hate all this inactivity.  I have also lost a bit of confidence in going out on my own, I have a wig that looks really good but I just feel that I have an arrow above my head pointing it out to everyone. I haven't been out in just a scarf except to my second chemo. None of neighbours know what I'm going through and don't fancy and awkward moment of getting out of my car and being faced with them staring..... How do other people deal with this sort of thing? I live in a terraced house so neighbours are very close in proximity and nowhere to hide.  Some of my cuticles have now started drying out so I bought some argon oil to rub in before I redo the nail varnish every other day... Hope this helps! hope everyone one is ok, I am now enjoying feeling normal until it all starts again a week on Tuesday. but then I will be half way!! Woo hoo! nicky x",
      "MessageIndex": 167,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "hi ivelindev, I had my second FEC on Tuesday and I was obviously more apprehensive than I thought as I had a few sleepless nights leading up to it. It was of course as simple as the first one and I was home and popping the additional anti sickness tablet my onc recommended before I knew it, and had a relatively normal first couple of days.  i think I may have taken my eye off the ball on Thursday as I felt so good I was late taking both lots of steroids, and a friend came round for 3 hours where I didn't keep downing my water, and yesterday I was hit with nausea quite badly. Bit of a shock after having 2 good days but do think it was because I got a bit blasé.  This morning I have woken a little more settled, but it will also be another easy day making sure I'm drinking my liquids. susiemb - I can't believe how quickly after number one you went back to work, how are you feeling now? after my first FEC I didn't stop feeling nauseous until day 7 which is when I took my last anti sickness tablet, so you did really well, I hope you've managed to keep feeling as good? Do you have injections to do, to increase white blood cells? Not everyone is given these. Now day 5 and my mouth has started to fur up again, we get a really good mouthwash to bring home which kicks most things on the head, however the smell of it now makes my tummy churn, and i had that the night before the nausea kicked in and could still taste it in the morning so a bit worried about using it again and feeling worse.  Have had 2 injections so far (I have to do 7), and both of those have been a little more painful than the first round of FEC. Waking in the night with a hey hips which didn't happen until number 6 and 7 last time.  Time for breakfast now... Shame there's no bacon in the house, that is all I fancy right now. fruit n fibre just isn't the same! hope everyone is having a good day, sun is out here again which is nice:) x",
      "MessageIndex": 133,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Good luck to newbies from me too, this time two and a half weeks ago I was in your shoes and was very nervous.  It isn't as bad as I imagined and I have had a good couple of weeks.  this time tomorrow you'll be one down :)",
      "MessageIndex": 75,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi all, Had my second FEC yesterday and the sickness was much better this time, head less swimmy and generally feeling almost normal! I'm so pleased! 2 down, 4 to go :) and only one more sicky FEC ( although I realise T comes with it's own challenges!). I'm still having a couple of tv and pj days so I don't overdo it (and just because too :) ) jedi, I can completely understand the feeling of getting down more, being in pain a lot can do that. Great that only have one more T to get through.  I'm not looking forward to the feeling of walking on glass! Good luck Fifi and anyone else having chemo,this week, i agree with susie and Fifi,,without this forum this would all be a lot more scary!  Xx",
      "MessageIndex": 124,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Have just worked out how to add this thread to favourites as took me a while to find it way down in the list, I keep going into post chemo club and luckily realise before I post :) having second FEC tomorrow, and I'm a little bit apprehensive. I want it done so I can get on with the getting better bit and so I can stop lying awake at night playing it out in my head. I'm also obviously feeling a bit teary today as I've been welling up at some of the threads this morning.  Could be down to my hormones though.... I only went and got my period on Saturday. I am so disappointed as I suffer with heavy periods (had to have coil removed pre chemo) and have suffered with pains all weekend. I even used the phrase 'its not fair ' for the first time since diagnosis. I am so mad that I have to still deal with this on top of chemo, and I hoped that as all the literature says that they would stop, the one big positive of chemo and I don't get to have that!  I am hoping this is the last one.....  Anyone else continue to have periods through chemo? Actually I might just add that question to the post chemo thread! hope everyone is ok x",
      "MessageIndex": 105,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Happy birthday! Enjoy London x",
      "MessageIndex": 23,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99321/happy-birthday",
      "Title": "HAPPY BIRTHDAY !!!!!"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Happy birthday! Enjoy London x",
      "MessageIndex": 8,
      "PostDate": "30/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99321/happy-birthday",
      "Title": "HAPPY BIRTHDAY !!!!!"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Fantastic! X",
      "MessageIndex": 8,
      "PostDate": "24/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96919/its-official",
      "Title": "its official"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "My husband doesn't do water either so we' ll never do any of the cruises or anything I've often fancied. He will do USA though which is good because we went to Vegas for his 50th in January and had just the most amazing time! Weather was perfect for me (redhead who can't do too much heat) and I loved it so much more than I imagined.  Love the idea of drugging him like BA :) unfortunately I don't have any suggestions as I am like you and cottonwool brained, and not really gone many places in Europe, every time I look online to plan anywhere I am overwhelmed and go to a cottage in Cornwall instead! so I am looking forward to seeing where you decide to go :)",
      "MessageIndex": 14,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98140/my-wedding-ring",
      "Title": "My wedding ring"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Wow those Kelpies look impressive! :) I'll keep that in mind next time I bottle it! thats brilliant that you got to go on an activity holiday with a bunch of like minded ladies, bet that was a good week!",
      "MessageIndex": 26,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98140/my-wedding-ring",
      "Title": "My wedding ring"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Thank you ladies. Kathleen Thank you for the comment re over treatment, this is what I was worried about, and if I was told it definitely would be beneficial I would have it in a heartbeat, but to have something so harsh when no real need I struggle to accept. I'm back on painkillers throughout the day which I had stopped for about a week, big shock for the pain to come back. no Kathy, it wasn't my bcn that was there, the one that was there did try very hard to counteract the doctor's cluelessness though. She had to take over in the end. Thinking of ringing my nurse for a chat as you suggested. That test you had sounds like it would be worth looking into, except the extra time it would take. I'm supposed to be starting a degree course in September which I desperately want to be able to do.  I am giving in to the tears more, everyone always says to stay positive, not realising that makes it harder for me to then admit when I need a cry. xxx  ",
      "MessageIndex": 4,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96018/post-op-appointment-yesterday",
      "Title": "Post op appointment yesterday"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Tuscany is somewhere I have always wanted to go!! Italy looks so beautiful. last year when I was trying to be brave and look to go, I found an activities holiday that sounded fantastic, including cycling, hiking and canoeing etc,  but given my husbands fear of water I didn't think he'd go for it, but once I'm over treatment I think I'll look at that again. the biggest thing that always puts me off is, how on earth do you speak to people? Ordering food in a restaurant, going to a local bar etc.... Going to France is stressful enough and I can get by there with the basics but even then if they reply with anything more than a yes/no or answer I was expecting I'm stumped!  i need to push myself to step out of my comfort zone I think! I would so love to go to every one of those places :)",
      "MessageIndex": 23,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98140/my-wedding-ring",
      "Title": "My wedding ring"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Ange Thank you for all of your comments, you make complete sense! I spoke to my BCN and made a complaint about my appointment on Tuesday. I talked it over with her and got her opinion on it all, and she did admit and said the words 'belt and braces'. She is the same age as me (42) so it's nice to get her opinion. I feel a little happier now to wait until Tuesday and get all the stats. If I go for chemo that will continue til mid November, and she said a month off then onto RT. Then wouldn't take tamoxifen until after all the other treatment has finished. I need to bear this in mind for my impending degree course. What is your next 'thing' you need to do? Have you met with anyone yet to start? Thanks again for your support. xxx",
      "MessageIndex": 12,
      "PostDate": "03/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96018/post-op-appointment-yesterday",
      "Title": "Post op appointment yesterday"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Had my post op appointment and was so pleased to hear they had clean margins so no further surgery required. The whole appointment was a bit of a farce from start to finish (my first negative experience) with a junior doc who was like a limp lettuce. She told me that two sentinel nodes had been tested with both being affected, so they 'took them all out, and they were all clear'. I asked how many they took but she didn't know, so I said 'phew, no chemo then!' At which point she got all flustered and said yes they wanted me to have chemo. I said I had been told that if only the first couple were affected that wouldn't mean definitely chemo and then the conversation turned to wanting to know who had told me rather than helping me understand why. I left feeling like the whole thing was pointless (it started badly by her leaving us in this room that looked like a janitors cupboard for 20 mins while she looked for a nurse, and didn't really get any better) and I was really angry on the way home. I am seeing the oncologist next Tuesday who will hopefully explain the reasoning to me.  I know that I am being selfish in not wanting chemo, and I am trying really hard to prepare myself for this, but if the lump was all out (grade 1 and quite small) and no more nodes were affected, and after RT I'm going to be on tamoxifen for 10 years, why is chemo necessary? I feel like this should have been explained to me yesterday but the junior doc just didn't have a clue really. They did say as I'm quite young and could therefore withstand more treatment they think I should have it. Is that really a reason to have it? What happened to explanations and information?  i should be rejoicing, so why do I just want to cry? Being in pain doesn't help..... Did anyone else get more pain 12+ days post op? Almost like they pumped me full of long lasting pain killer that has now gone, with a bang! trying to keep positive...... nx  ",
      "MessageIndex": 0,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96018/post-op-appointment-yesterday",
      "Title": "Post op appointment yesterday"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "It's good to hear that I'm not alone in this thinking, so thanks for your comments. I have been very much encouraged by your comments re the oncologist being your hero :) My husband was a bit miffed at us leaving the appointment yesterday and having to wait another week for answers, and I thought I would be too but I feel like now I'm just waiting to speak to the expert. The consultant did what he does best and now I'm moving on to the next expert. I'll be open minded about the software thing that they use which shows the benefit v cost comparison of having the treatments or not, and I've written a note about the oncotype DX test to make sure I bring that up.  Thanks again, I was in a right mood this morning but feeling much stronger about it all now. x",
      "MessageIndex": 7,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96018/post-op-appointment-yesterday",
      "Title": "Post op appointment yesterday"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Ange that all makes complete sense, shame the two professionals in the room weren't as articulate as you :) I know what you mean, I wouldn't forgive myself if I ended up with secondary cancer because of not doing chemo, but would still like the info before making decision. Ha, even a nice grown up conversation about it would be nice!  Left message for bcn, she should ring me back tomorrow. going to try driving tomorrow, are you back driving yet?  Xxx",
      "MessageIndex": 9,
      "PostDate": "01/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96018/post-op-appointment-yesterday",
      "Title": "Post op appointment yesterday"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Thanks for your encouragement on my course Jj, it has been consuming me. i went back to college on Thursday and so glad to do something normal, but was v emotional and knackering. It's a counselling course, so lots of self awareness/development, and emotional roller coaster! Am in all day tomorrow too, it's our second last day and celebration day :) also have my interview tomorrow for degree (same college) and spent 3 hours prepping for the presentation I have to give. I have just woken from a 2.5 hour nap and am exhausted. Haven't finished presentation and am panicking that I'm probably taking on too much....if I can't even get this done. They know my situation so will be kind I know, but I wanted to go in and wow them, not show that I'm already showing signs of not being able to cope. (End of level 3 course, 3 x assignments to do in last month plus a personal presentation to prep for Thursday). i can't even focus on what to wear tomorrow. My decision making skills have abandoned me, how am I supposed to make a decision about chemo like this!! ;) x  ",
      "MessageIndex": 14,
      "PostDate": "04/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96018/post-op-appointment-yesterday",
      "Title": "Post op appointment yesterday"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi Sim i had WLE on 18th June, start chemo next Tuesday then will have rads. My bcn has always told me that tamoxifen will start once all treatment has finished (I am 42). Makes sense what dream thief says about maybe the cells being dulled by the inhibitor.  Glad to hear your chemo wasn't too bad :)  Welcome to the group. Nicky x",
      "MessageIndex": 10,
      "PostDate": "24/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96884/new-member-to-the-group",
      "Title": "New member to the group"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "I'm also being hit with the lack of energy, some days I feel like I could do a bit more but run out of steam before I finish, and other days feel as if I can't even start! today I felt like I had a bit more energy so went for a very gentle stroll round the local country park, we walked slowly, picking blackberries as we meandered, took some photo's, waited for daughter while she scrambled over tree stumps. We were out for 55 minutes, and my walking app told me we only did 1.01 miles, but being out in the fresh air was lovely. I yawned my head off in the car on the way home and had a nap when I got home!  it is frustrating, but each day is one day nearer the end and a big celebration! X",
      "MessageIndex": 2,
      "PostDate": "29/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98167/energy-levels",
      "Title": "energy levels ?"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Fab news! I've had surgery and lymph nodes, just waiting for chemo then rads. So good to hear from people getting thought it. mrsD I had isotope the day before my op, it only took 2-3 minutes and was absolutely fine. A little stinging when the liquid went in, but less than the anesthetic so nothing too bad. I was quite scared about it too, but I was out of the room 5 mins after goin in and on my way home again. No after effects at all. Good luck! nx",
      "MessageIndex": 10,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96344/on-the-last-leg-of-this-horrid-journey",
      "Title": "On the last leg of this horrid journey"
    },
    {
      "AuthorID": "Smoothie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/smoothie",
      "Content": "Hi, my 'hole' left from my lumpectomy has now filled with something hard. I imagine it's whatever comes in to fill the hole.  Showed the chemo nurse at chemo intro last week as its also causing Orange peel skin above and she 'thinks' it's normal part of the healing.  I'd heard about it filling with blood that might need to be drained, but I can't see thatmine could be drained as it doesn't feel liquid. ",
      "MessageIndex": 6,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97010/a-question-for-my-friends",
      "Title": "A question for my friends"
    }
  ]
}