{
  "AuthorID": "SnaxMuppet",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/snaxmuppet",
  "Posts": [
    {
      "AuthorID": "SnaxMuppet",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/snaxmuppet",
      "Content": "My wife swears by ice lollies. She cleans her teeth regularly too with a soft brush and uses the prescribes mouth wash but the lollies seem to help hugely. Just be careful not to cut your mouth on any sharp bits of ice (that would defeat the object !!!)",
      "MessageIndex": 4,
      "PostDate": "20/05/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/27999/mouth-ulcers---any-advice",
      "Title": "Mouth ulcers - any advice?"
    },
    {
      "AuthorID": "SnaxMuppet",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/snaxmuppet",
      "Content": "Hi Kate91, My wife had a big seroma and still has 6 weeks post-op. She was told it wil go away on its own eventually but if it was bothering her then she should return and get it drained. Draining the first couple of times was very successful, not at all painful and a big relief for her. However, on the third drain the nurse doing the draining pushed the needle of the syringe through her chest wall giving her a pneumothorax and partially collapsing her lung. This resulted in 4 very painful days in hospital while the air was drained out of her chest cavity. She has decided to put up with the remaining seroma now as she can't face the risk of another pneumothorax. I am certainly not wanting to put anyone off having the seroma drained but it is worth bearing in mind that although a very simple procedure it is not without its risks. If she does need it drained again she will get a doctor to do it not a nurse.",
      "MessageIndex": 5,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/27579/post-op-fluid-advice-please",
      "Title": "Post op fluid advice please"
    },
    {
      "AuthorID": "SnaxMuppet",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/snaxmuppet",
      "Content": "Hi Fran, Sorry we are having to meet under these circumstances but welcome to the forum. My wife is in the middle of her chemo at the moment and she went through the same concerns regarding getting a portacath. In her case she has bad veins so she needed something and after some research we decided that a portaath was the best of the central line options (the others being PICC or Hickman). She asked her oncologist for a portacath but here in Plymouth they don't use them except in exceptional circumstances a there aren't many people trained to use them. The onco did agree to fit a portacath but explained that it might mean delays with her chemo sessions as she would need to get her treatment when the trained staff was working. In the end Sal, my wife, decided that although a Hickman line was not her perferred option it would probably be the better option given the limited support for portacaths. She was devastated that she couldn't have a portacath. They have a significantly reduced incidence of infection as they are wholy under the skin, they are great if you have kids or want to take part in sport or swim during treatment (not that many people want to do that during treatment) and they only require flushing every 4 weeks when not accessed instead of every 4-7 days with a Hickman line so they are considerably lower maintenence. However, they do involve a small degree of discomfort when accessing the line. As it turned out the Hickman line has proved to be fine and a Hickman line is a reasonable alternative to the portacath. I think that if she had a choice and there was adequate support at her local hospital for a portacath then she would have had it. As for hair... she cut hers short as soon as it started to come out which was after the 2nd cycle. This stopped her having large amounts of hair on the pillow at night which can be rather upsetting to some people. She now has a lovely wig and wears scarves too. What ever you decide, good luck and please keep us informed on what you decided and how it went.",
      "MessageIndex": 2,
      "PostDate": "20/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/28961/should-i-have-a-portocath",
      "Title": "Should I have a portocath?"
    }
  ]
}