{
  "AuthorID": "Soo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soo",
  "Posts": [
    {
      "AuthorID": "Soo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soo",
      "Content": "Hi , Have just finished FEC x 3 and started 1st Taxotere on 22nd July, 2 more to follow. My oncologist said that I may suffer with aching hips for a couple of days. Well I already suffer fibromyalgia so am used to suffering from aches and pains. What I  wasn't prepared for were my 'legs' aching to the point I just want to cut them off!!!! IAny ideas on how to cope. Sitting here with my legs raised high watching an old episode of Jack Frost. and obviously typing up my question. Soo",
      "MessageIndex": 0,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62816/taxotere-aches",
      "Title": "Taxotere aches"
    },
    {
      "AuthorID": "Soo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soo",
      "Content": "Thanks for your reply Kate, unfortunately Im already on 8 high strength cocodamol a day and progressed to 12 last night . I also take  other strong meds for my fibromyalgia. I probably,, didn't say that I also have chronic cervical spondylosis and to say that is a pain in the neck is an understatement.I  think this is one Im really gonna have to grin n bare for a few days. Spent the afternoon with my 3 beautiful grandchildren, its the only thing that puts a smile on my face. Off for a heart scan tomorrow and an ecg . Start Herpcetin on 12/08,by leg injection. My choice, as my port has not worked very well,  my veins are none existent and  my arms are cording to so  I have to  massage and excercise my arm everyday . Surgery starts mid October but have already decided not to have any  reconstruction. Chicken fillets for me.  I don't have a good track record for  recovering well from surgery, infections, double infections, blood clots and wounds that just won't heal. Enuf said feel so much better for getting that off my chest. Thankgod for my wonderful supportive husband and family and all of you who post on this site. I know Im not alone . Mega e-hug Soo",
      "MessageIndex": 2,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62816/taxotere-aches",
      "Title": "Taxotere aches"
    },
    {
      "AuthorID": "Soo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soo",
      "Content": "Thanks Kate already on amitriptlyne , My own GP is great have tried  all the alternatives , u name it Ive tried it previously and the tablets that have worked,   gave me horrible side effects. But thanku so much for caring. It really is appreciated. Just been round my large garden for stroll, exhausted now but feel much better now i've pushed myself. Sooo : -))",
      "MessageIndex": 4,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/62816/taxotere-aches",
      "Title": "Taxotere aches"
    }
  ]
}