{
  "AuthorID": "Sophiex2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sophiex2",
  "Posts": [{
    "AuthorID": "Sophiex2",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sophiex2",
    "Content": "My husband add to go through a high grade chemo (just finished) and I will print all the posts and make him read it. After 12 weeks mostly in hopital he felt exactly that : he can cope with the pain of the intrathecals, the headache, the tiredness, the mouth sore but bad organisation he simply cannot. All the treatments were provided to a very high level of standard but sometimes \"small\" annoyances becomes quite difficult to bear. The good : The nurse whom, when asked about the dosage a particular chemo, immediatly came back with the file and recalculate it with my husband (we found out that we have been given the wrong information sheet, the one for patient over 65 years old, that is why it did not match). All that peacefully and with a smile. The nurse whom manage to gave 5 different chemo/saline bags across the afternoon without letting the dreadfull \"ding ding dong\" going on for more than 5 mn. Not only he succeeded to do it for us but for all the patients of the Ward that afternoon.Indeed, realising something was strange (the lack of the ding dong background) I became very attentive and listen very carefully. he looked harrassed and stressed and made no chit chat, but, boy, he was good ! the Bad : (or should I say the \"not very bright\"). The young doctor that was chatting with us about the removal of the hickman line from my husband due to infection. She was there whilst another doctor had been doing the procedure. This was a difficult procedure, went to long and the aneasthetic wore off and it become extremely painful. When we casualy mentioned to her the removal of the line as one of the most unpleasant experience so far she blurted out \"Oh yes, I remember,... poor Tom !!\" My husband is not called Tom. Tom was the name of the doctor who carried out the procedure. We have forgiven her, she was young and of course she did not identify to the patient. When you are that age, even a doctor, you do not really believe that you will ever be a patient. However, and perhaps rather unfairly, we have now baptise the other doctor \"poor Tom\"...... The nurses whom constantly forget that my husband takes his temperature himself (he has sensitive hears). This usually results into mini wrestling episodes between my husband and the nurse that are rather funny to watch. The ugly : the nurse that let the chemo dispensing machine rang for 40mn, comes (under my pressant request), put the ringing on hold for 5mn and disappeared for another 35mn and than come back and yes...did it again! We were just waiting for my husband to get unhooked from the chemo dispensing machine - there was no more treatment that day - and were hoping to have a quick drive to the sea as we expected this would be the last time my husband could actually walk around for a while. At the third time my husband had an argument of 15mn whith the nurse whom was explaining that she was too busy to unhook him. Pointing out that the \"unhooking\" would have taken only 10mn we finally won the day and he got unhooked ! OK that was a one off, but really unpleasant. The very ugly : Yes, I mean hospital food. We are not talking about the quality of the food (which is bad but we can understand budget constraints). Just the fact that not one day went by without at least one of the order being wrong and the soup or desert having spilled out on the tray because the lids where not put down properly by the kitchen staff. When you are sick with chemo, that certainly remove any desire to eat whatsoever. Just a great occasion to let a little bit of the steam goes.",
    "MessageIndex": 12,
    "PostDate": "07/09/2008",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10750/health-professionals---the-good-the-bad-and-the",
    "Title": "Health Professionals - \"The Good, The Bad, and The...!!!!\""
  }]
}