{
  "AuthorID": "soveryscared",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soveryscared",
  "Posts": [
    {
      "AuthorID": "soveryscared",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soveryscared",
      "Content": "Hi Everyone, I am 36 and I have a small pink barely raised patch on my breast it is a tad smaller than a pencil eraser. It is kind of raised but barely and at first I thought maybe a bite, pimple, or ingrown hair. I used a topical steroid I have at home for a week and it is still here. It has been here a total of 17 days now. It has not gotten any worse and does not itch at all. I went to the University of Michigan breast clinic 3 days ago and the Nurse Practitioner took a look and also did a full breast exam while I was there. She said the skin of my breasts are perfectly normal and there is no thickening and no abnormality of any kind. No follow up needed. She wrote in my notes that it appears to be a skin macule and it could be a cyst, ingrown hair any type of benign skin issue and told me not to worry about it. I of course am still worried. Would my breast be changing by now or getting worse. Should I trust the NP at the breast clinic? There is no redness elsewhere on my breast, pain, itchyness, heat, swelling, thickening but I have read a story where a womans IBC was just a simple bug bite looking thing and it was terminal. I am so worried and scared. Did anyones appear as a tiny pink spot? After 2 weeks would I be noticing changes? Should I believe the Nurse Practitioner?? It is making me not sleep thinking this is spreading. I am just a wreck. Do you think a NP at the University breast clinic would know what to look for? She told me I should have peace o mind now that it is not IBC. Please help me",
      "MessageIndex": 0,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147964/please-help-i-am-so-scared",
      "Title": "Please help I am so scared"
    },
    {
      "AuthorID": "soveryscared",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soveryscared",
      "Content": "I just wanted to thank everybody that responded to me. It really means so much. The spot is still here but it does seem lighter. It is a very very light shade of pink. I check my breast several times a day and there is never any change to it. No thickness, swelling, pain, itchiness, heat, etc.. I think for now I will trust in the NP as she does work for the best breast care clinic and has been there for years. I will keep an eye on it and if something changes request an appt. asap. Does this sound like a good plan to you ladies? Again from the bottom of my heart thank you all so very much for taking the time to respond to me.",
      "MessageIndex": 6,
      "PostDate": "24/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147964/please-help-i-am-so-scared",
      "Title": "Please help I am so scared"
    },
    {
      "AuthorID": "soveryscared",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soveryscared",
      "Content": "Hi Ladies, I was seen by my Derm today and she said this is post erythema and not any form of cancer. I am going to let this fear go since a NP at the number 1 breast clinic here in MI and my derm have said it is not cancer. Thank You all for responding warrior women =)",
      "MessageIndex": 12,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147964/please-help-i-am-so-scared",
      "Title": "Please help I am so scared"
    },
    {
      "AuthorID": "soveryscared",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soveryscared",
      "Content": "Anybody? I can't sleep I cry and shake. I'm back on my anxiety meds but I'm so scared.",
      "MessageIndex": 17,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147964/please-help-i-am-so-scared",
      "Title": "Please help I am so scared"
    },
    {
      "AuthorID": "soveryscared",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soveryscared",
      "Content": "Still can't let this go! Does this look like inflammatory breast cancer to you? Does it look sinister? Please be honest.",
      "MessageIndex": 16,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147964/please-help-i-am-so-scared",
      "Title": "Please help I am so scared"
    },
    {
      "AuthorID": "soveryscared",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/soveryscared",
      "Content": "I have used a topical steroid that I had at home and it really has lightened up. The cancer I am worried about is IBC. This isnt a lump at all its more like a tiny little patch of pink skin that was a bit raised but is know almost all the way flat.You hear these stories of women with a bug bite looking spot who end up with IBC that is terminal. When I read that I just freaked out. Google did me no good. But NP gave me an exam and noted everything was normal no lumps or bumps inside my breast and that the little spot is nothing to worry about. I just have to learn to trust the pros!",
      "MessageIndex": 11,
      "PostDate": "24/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147964/please-help-i-am-so-scared",
      "Title": "Please help I am so scared"
    }
  ]
}