{
  "AuthorID": "Sparkle81",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkle81",
  "Posts": [
    {
      "AuthorID": "Sparkle81",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkle81",
      "Content": "My surgery was exactly 4 weeks from the final chemo session. As Semh said, they like to give your body a chance to recover but without waiting too long!",
      "MessageIndex": 2,
      "PostDate": "17/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176689/timing-of-surgery-after-tchp",
      "Title": "Timing of surgery after TCHP"
    },
    {
      "AuthorID": "Sparkle81",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkle81",
      "Content": "Hi Mum of patient. I found the hair loss one of the hardest things to get my head around. It was as if I knew that I was sick, as did my closest friends and family but loosing my hair made it obvious to the rest of the world. It makes you feel really vulnerable and I found the 'pity looks' from complete strangers very hard to stomach.  I got a wig which I loved in the beginning. For me, it stopped the strangers from knowing what had happened to me and made me feel less vulnerable. I would definitely recommend your daughter seeing a specialist about wigs as they can advise you on how to put them on properly as well as storing and washing them. However, please let your daughter know that the hair thing does become easier. Towards the end of my chemo I stopped wearing my wigs as much and just wore head scarves with my friends and family. I kept my wig for 'going out and about' but felt far more comfortable around those I loved to just wear the head scarves. It did take a while to get to that stage though. I can't begin to imagine how difficult it must be to have young children whilst going through chemo. Energy levels can be very low and lots of rest is needed.  I have 15 sessions of radiotherapy over 3 weeks and then continue with Herceptin until September and then hopefully that is me finished!!! xx",
      "MessageIndex": 10,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176689/timing-of-surgery-after-tchp",
      "Title": "Timing of surgery after TCHP"
    },
    {
      "AuthorID": "Sparkle81",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkle81",
      "Content": "Hi Mum of patient. Yes, that's my year of birth. I was 36 when diagnosed and remember feeling that I was way too young to have BC, but actually, like you said, there seems to be a lot of young people going through it. I'm just about to start my radiotherapy. Apparently this is to just clean up to try and prevent reoccurrence now. It was meant to be starting at the beginning of February but sadly, so many people need it that there was no room for me until now. It doesn't help that I live on the Isle of Wight where we have chemo facilities but none for radiotherapy so everyone who lives here is referred to either Portsmouth or Southampton. My reviews are still mainly with the oncologist and his team. The only time I spent with the surgeon was when I was about to have the mastectomy and then one follow up appointment with him. I hope that your daughter had good news from the ultra sound xx",
      "MessageIndex": 8,
      "PostDate": "23/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/176689/timing-of-surgery-after-tchp",
      "Title": "Timing of surgery after TCHP"
    },
    {
      "AuthorID": "Sparkle81",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkle81",
      "Content": "Hi Sarahlou123 I didn't have a PET scan but after 2 MRI's, ultrasounds and CT scan I have cancer in the lymph nodes under the arm and behind the chest wall too. My cancer was Her2+ so I had 7 rounds of chemo first (3 FEC & 4 Docetaxel, Herceptin & the one beginning with P that I can never remember!) I'm about to have surgery (a mastectomy rather than lumpectomy) and then my oncologist has said that radiotherapy will just finish off whatever is left of the cancer after all of that. It's a hard fight, as is everyone's, but I believe it's very doable! It's just scary when you first hear that the cancer isn't just confined to the breast. X",
      "MessageIndex": 1,
      "PostDate": "02/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/172522/lymph-nodes-and-breast-cancer",
      "Title": "Lymph nodes and breast cancer"
    },
    {
      "AuthorID": "Sparkle81",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkle81",
      "Content": "Hi KerryCake I have also just been tested. I'm Her2+ but because of my age (36 at diagnosis) they just want to be sure that it's not a genetic mutation. It was a simple blood test but I have been told that the results could take up to 2-3 months to come through. If I'm found to have the mutation then I will be offered a double mastectomy as well as a hysterectomy. I was a little upset at first, particularly about having my ovaries removed but then I just reminded myself that it isn't definite until the results are in and even then, the desire to not go through chemo again beats everything else! Good luck with your test x",
      "MessageIndex": 3,
      "PostDate": "17/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/171826/breast-ovarian-cancer-link-and-genetic-testing",
      "Title": "Breast ovarian cancer link and genetic testing"
    }
  ]
}