{
  "AuthorID": "Sparkler64",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkler64",
  "Posts": [
    {
      "AuthorID": "Sparkler64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkler64",
      "Content": "Hi Lynne I was told last week of Sept that I had BC - no symptoms or signs was caught via a routine mamogramme and was called back - so have been on the rollover coaster since. I had my surgery last Wed and got the up beat news that it has not gone past my lymph nodes, so onto tablets and rads. I found the waiting in between tests and results the hardest part as like you my mind went into overdrive but your BCN is there for you and no question is ever a silly question. My advice is take your time, don’t expect too much of yourself and don’t let other people’s expectations/experiences sway you (not the folk on here but the self professed experts - people who know people if you get my drift) - You deal with this the way you want to do. Sending you all the love in the world and look after yourself, you deserve it  xxx",
      "MessageIndex": 8,
      "PostDate": "20/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140417/diagnised-today-feel-a-bit-lost",
      "Title": "Diagnised today.......feel a bit lost!"
    },
    {
      "AuthorID": "Sparkler64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkler64",
      "Content": "Hi Mira Thank you for you response if it doesn’t start to fade over weekend will make an appointment.  I have also had the flu from hell the last week so have not been keeping to regular creaming routine as have been having major night sweats but will get started again as just starting to feel human again. Look after yourself and lots of love for a bright and happy 2018 Angela x",
      "MessageIndex": 2,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146331/bruises-started-to-appear-under-arms",
      "Title": "Bruises started to appear under arms"
    },
    {
      "AuthorID": "Sparkler64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sparkler64",
      "Content": "HNY everyone I’m sure this is a ‘normal’ after effect but am just a bit worried. I finished my rads 18/12 and had no problems or side effects during the treatment. Everything been fine up until about 2 days ago started to get burning pains in my treated breast plus now all under my armpit has become bruised and armpit seems hollow. Is this normal - thanks x",
      "MessageIndex": 0,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146331/bruises-started-to-appear-under-arms",
      "Title": "Bruises started to appear under arms"
    }
  ]
}