{
  "AuthorID": "Speesh",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/speesh",
  "Posts": [
    {
      "AuthorID": "Speesh",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/speesh",
      "Content": "I had a mastectomy and lymph nodes taken out so I'm an AA cup on one side and a D on the other. I actually went to La Senza and asked them (as I wasn't given a prosthesis despite asking several times) and they sorted me out with kind of sports bras sort of things but with lace trims, so a bit prettier than just the plain ones, and later the lady there gave me a proper fitting and got me a style of bra that was easy to even out. They're very good there and everyone I've spoken to at their shops has understood the requirements for mastectomy patients. She also had a stash of extra inserts for the bras and gave me a bag load (as I need to put three little pad things in the side where I had the op in order to even out). So they certainly had some good stuff in there too.",
      "MessageIndex": 21,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75715/prosthesis-after-lumpectomy",
      "Title": "Prosthesis after lumpectomy"
    },
    {
      "AuthorID": "Speesh",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/speesh",
      "Content": "I had a mastectomy and lymph nodes taken out so I'm an AA cup on one side and a D on the other. I actually went to La Senza and asked them (as I wasn't given a prosthesis despite asking several times) and they sorted me out with kind of sports bras sort of things but with lace trims, so a bit prettier than just the plain ones, and later the lady there gave me a proper fitting and got me a style of bra that was easy to even out. They're very good there and everyone I've spoken to at their shops has understood the requirements for mastectomy patients. She also had a stash of extra inserts for the bras and gave me a bag load (as I need to put three little pad things in the side where I had the op in order to even out). So they certainly had some good stuff in there too.",
      "MessageIndex": 6,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75715/prosthesis-after-lumpectomy",
      "Title": "Prosthesis after lumpectomy"
    },
    {
      "AuthorID": "Speesh",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/speesh",
      "Content": "Hi all, Sorry if this is a stupid question or has been asked before, but it's something that's been bothering me for a while and I wasn't sure where else to get advice.  I don't have any family support (my family aren't interested) or friends either for that matter.  Sorry if this is a bit long winded but my illness was a bit weird. I'm 34 and BRCA 1 positive. My mum, gran and pretty much every female member of my family died of cancer and so they thought there was a pretty good chance it was genetic. Last year I developed a weird lesion on my left breast which I was told at first was a deep tissue infection, but which turned out to be a tumour that was messing up the tissue round about it and causing it to die. So as well as the cancer I ended up with this 15cm diameter 'thing' that looked like a badly made pizza on the surface of the breast, which made surgery impossible. I tried several different types of chemo but because that then reduced my immune system, the infection around the tumour knocked me for six and I'd end up in hospital. Eventually they gave up with chemo and tried radiotherapy, but after five treatments I keeled over again and was back in hospital. My oncologist told me that the tumour was so nasty that she had no real hope of any kind of treatment working.  However, the next day they did a CT scan and discovered that although the surface wound wasn't healing or reducing, underneath, the tumour had gone down to half its size, from 9cm to 4.5. So surgery was back as an option. My original surgeon was on holiday so they brought in another general surgeon from another hospital, and since her plastic surgeon she usually worked with was booked solid, they brought in another plastic surgeon from another hospital. I ended up with a team composed of professionals from four different hospitals in the city, which I actually found quite humbling. But anyway, they hadn't expected much but thought they would salvage as much as they could and just try to get rid of the tumour. As it turned out though, the tumour had caused so much infection that it had made a little pocket around itself of pus and stuff and so hadn't been able to spread anywhere. So far (touching wood) they've found no trace of anything anywhere else and although they removed about eight or nine lymph nodes at the same time as the tumour, they were all clear. I was out of hospital after seven days and have been back at work now for about six months. My oncologist's said she no longer needs to see me and it's just up to the surgical team to take care of me.  I feel rotten about the fact that this bothers me, but what I'm getting scared of is that people have been very evasive with me when I've asked about reconstruction. I'm supposed to be getting the right breast removed, according to my oncologist, and she said they'd probably do reconstruction at the same time, even everything up and make sure there's symmetry, but she only told me that after I'd really pressed her for an answer, and even then she said the reconstruction part wasn't a priority and it was almost as if she was hinting that it wouldn't happen at all. My plastic surgeon hasn't mentioned anything about it but that might be my fault, as I got a bit scared about asking partially because he did really amazing work with the left breast in salvaging what he could and I don't want him to think I'm ungrateful, and also because I'm kind of scared he will say definitely no, it won't happen.  I don't know if it makes me vain, too, to worry about the cosmetic side of things when really I should be so thankful that I'm still alive (and I am, don't get me wrong), but I just keep thinking that I'm only 34, never even been on a date before in my life but I hadn't really given up hope, but colleagues and some other people have commented on how freaky it would be to meet a girl with only the one breast and stuff like this and I've just found myself getting really depressed about it. Which was weird because I didn't get this depressed or upset or whatever when I was going through treatment alone or being told there was no hope of recovery. I suppose what I'm asking is, is it normal for there to be a long time between the removal of the tumour and the reconstruction? I'm probably being silly, I know.",
      "MessageIndex": 0,
      "PostDate": "23/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75672/reconstruction-after-a-conservation-surgery",
      "Title": "Reconstruction after a conservation surgery"
    },
    {
      "AuthorID": "Speesh",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/speesh",
      "Content": "Thanks. It helps to know there could be a reason for it. I don't really have a nurse contact for anything. The only number I have is for the breast reconstruction nurse at the hospital where I had the surgery, but that was the nurse I didn't get on with (her comments were actually so hurtful I put in an official complaint). I've an appointment in September with the surgeon and hopefully I'll work up the courage to ask him then.",
      "MessageIndex": 3,
      "PostDate": "23/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75672/reconstruction-after-a-conservation-surgery",
      "Title": "Reconstruction after a conservation surgery"
    },
    {
      "AuthorID": "Speesh",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/speesh",
      "Content": "Yeah, I had thought about heading to the Cancer Centre where I got my radiotherapy (and most of my non surgical hospital treatment) as Macmillan has a permanent office thing there, and I thought maybe they'd know where to go or who to speak to.  I hope I didn't come across as too whiny in the original post. I was up in the middle of the night and getting worked up about this. I really appreciate the help and I'm glad I found this board.",
      "MessageIndex": 5,
      "PostDate": "24/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75672/reconstruction-after-a-conservation-surgery",
      "Title": "Reconstruction after a conservation surgery"
    }
  ]
}