{
  "AuthorID": "Spiritual Warrior",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spiritual-warrior",
  "Posts": [
    {
      "AuthorID": "Spiritual Warrior",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spiritual-warrior",
      "Content": "Hi Moleend Sorry to hear that the cancer has come back. I can think of 2 things that might help. First, there's a site that oncologists check (at least mine and some others I know did) called adjuvant online. There you put all the details about your case (age, tumor size, etc) and it gives you an estimate of recurrance. You may have well done this already! I've also heard there's a test called \"oncotype dx\" which seems to be stardard in the US however it's still waiting for approval in the UK. I know that some doctors send a slice of the tumour to the US for analysis. I believe this is a more accurate test than the previuos one as it's testing your tumour. The test has levels of low, medium or high risk of reocurrence. Perhaps you would like to discuss this with your doctor. One last thing I can add is when the time comes to make a decision, make sure it's what also 'feels' right for you. All the best!  ",
      "MessageIndex": 1,
      "PostDate": "26/11/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/23014/to-chemo-or-not-to-chemo---that-is-the-question",
      "Title": "To Chemo or not to chemo - that is the question?"
    },
    {
      "AuthorID": "Spiritual Warrior",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spiritual-warrior",
      "Content": "Hi Den I also have been diagnosed with BC this year, Feb. I'm 32. I know how strange it feels as it's something that you wouldn't expect to happen to you at this age,or at least that's how I felt. It's very normal that everything suddenly becomes too much. Exaclty the same happened to me. I had to find something to keep me going and help me to be less and less worry so I searched. Firslty, it's very important that you have something that helps your mind to keep strong. Some people find physical exercise, dancing,etc is good for this. I do yoga and meditation and I've always enjoyed reading 'spiritual' books, and I can say that has helped me LOADS to keep my mind strong. I also came across an AMAZING book in the internet which I would recommend to anyone with Breast or Prostate Cancer. It's called \"your life in your hands\" by Jane Plant. She talks about how you can help reducing your chances by following a healthy diet, and having a healthy lifestyle and how dairy products seem to increase the risk of Breast Cancer between other cancers. All her work is based on research and she is a cancer survivor herself. It helped me to know htat I am doing something to help with this situation as I found it very hard being passive and just hoping this illness does not come back. It's very normal that any pain you have you think it's spread. The best thing you can do to keep you mind at rest is if it's still worrying you, go to the doctor again.  I've woken up in the morning recently with some pain in my lungs, but I think it may be the position I slept, but I'm keeping an eye as if it persists I'll have to go to the doctor too... Wish you all the best Flavia",
      "MessageIndex": 2,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/21007/young-and-worried",
      "Title": "Young and worried"
    },
    {
      "AuthorID": "Spiritual Warrior",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spiritual-warrior",
      "Content": "Hi Tessa2! I'm sorry to hear about the blister. I had skin peeling off in the same are you are describing. First of all I'll say speak to the radiologists as they can give you the best tips! I didn't wear a bra as it created some discomfort, it wasn't too bad but I didn't want to get the area more sensitive than what it was. I would wear a tight ish vest and that seemed to work really well for me. The radiologists also gave me some dressings (which is what you probably are allergic to!) but I remember that they had something like vaseline and that stopped the skin getting stuck to the clothes. Please ask first, and if they are ok, I would use vaseline and cover with a piece of cloth and/or vest.  HTH Hope you get better soon! Flavia",
      "MessageIndex": 1,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25485/blistered-boob-from-radio",
      "Title": "Blistered boob from radio"
    },
    {
      "AuthorID": "Spiritual Warrior",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spiritual-warrior",
      "Content": "Hi Tally Sorry to hear about your news and hope the results are all good! I had the result of a needle biopsy which showed a small lump (8mm) grade 1 and the following day had to spend all day at the hospital getting tests done: bone scan, CT, MRI. I think that this applies to everyone, but why don't you discuss it with your doctor. And if you are not happy you can always have a second opinion. All the best",
      "MessageIndex": 2,
      "PostDate": "01/01/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/24187/newbie-here",
      "Title": "Newbie here"
    },
    {
      "AuthorID": "Spiritual Warrior",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spiritual-warrior",
      "Content": "Hi Noj I thoguht I was going to have 6 weeks of radiotherapy but when I met the radiologyst he said they would be 4 instead. I asked why and he said it seems to have same (and here I can't remember if he said same or better results! sorry!). So that's what I got. I'm dark hair and my skin tannes brown when I sunbathe and after session 11 my skin started going pink and then it went a mixture between red and brown. I peeled a little bit but the skin under was fine, it wasn't red, it was normal colour. Good luck! Flavia",
      "MessageIndex": 7,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/20859/radiotherapy-advice-please",
      "Title": "Radiotherapy.... advice please"
    }
  ]
}