{
  "AuthorID": "spit",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spit",
  "Posts": [
    {
      "AuthorID": "spit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spit",
      "Content": "Hi Linds, I cannot help really because I would also like to know if they play things down! I got my diagnosis last week on the 8th. So quite new to this. I am hearing very positive feedback from the MacMillan nurses at the unit. Yet nothing is definite until the lump is out and tested. Rare type. It is the time waiting that is the worst for me. It was 4 weeks before they told me. Now I have to wait another 2-3 weeks after the 21st to know for sure. Fingers crossed your results are negative, but I know the anxiety will remain until you also 'know for sure'. Take care x",
      "MessageIndex": 1,
      "PostDate": "17/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70294/scan-and-biopsy-today",
      "Title": "scan and biopsy today"
    },
    {
      "AuthorID": "spit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/spit",
      "Content": "Thank you so much for sharing. I am not at the stage of needing a mastectomy right now and may not need to have one. Although it will be my choice if I feel there is too much messing around for me. At my age it is not a problem for cosmetic reasons or any other reasons, if I did. My heart goes out to those much younger and those of a similar age to me who are concerned. I have never seen photos of a post-mastectomy before. You have done much to dispel any worries I had at 'looking'. Mind, I can deal with things on others that I find very sqeamish about on myself. I dare not even look at my core-biopsy scar...lol. I doubt I will look at my lumpectomy scar, either, I tend to go very dizzy and feel like passing out!. Yet, I have 'nursed' others wounds/op sites, with no problems! Take care and I will look in on your blog. xxx ",
      "MessageIndex": 18,
      "PostDate": "18/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    }
  ]
}