{
  "AuthorID": "Sraine",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sraine",
  "Posts": [
    {
      "AuthorID": "Sraine",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sraine",
      "Content": "Hi there I am on Tamoxifen and suffering quite a lot from hot flushes. My oncologist suggested taking evening primrose oil, which I am taking, but it doe s not seem to make much difference. I have heard that red clover isoflavones ( promensil tablets) help but wondered if these would interfere with the impact of the Tamoxifen . Has anybody had any experience with this red clover for relieving menopausal symptoms while on Tamoxifen. Sraine",
      "MessageIndex": 0,
      "PostDate": "02/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64249/red-clover-isoflavones-for-menopausal-symptoms",
      "Title": "Red clover isoflavones for menopausal symptoms"
    },
    {
      "AuthorID": "Sraine",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sraine",
      "Content": "Thank you for the advice to go to the Macmillan help line..I actually emailed them and got a full reply. Red clover is indeed a no-no when taking Tamoxifen..amazing that the person who suggested I take it was my gynaecologist who knew I was on Tamoxifen. Never harms to check these things out fully before leaping in. I am hoping that the hot flushes die down after a while...but I was on HRT for a long time, came off it in March after diagnosis with lobular BC and that in itself was an adjustment, now the Tamoxifen, so probably take a while to settle. In the meantime I shall not be turning on the heating any time soon this winter.",
      "MessageIndex": 4,
      "PostDate": "04/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64249/red-clover-isoflavones-for-menopausal-symptoms",
      "Title": "Red clover isoflavones for menopausal symptoms"
    }
  ]
}