{
  "AuthorID": "StarYour username",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/staryour-username",
  "Posts": [
    {
      "AuthorID": "StarYour username",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/staryour-username",
      "Content": "Hi I have my third FEC chemo for ductile carcinoma (large tumour, 4cm plus three abnormal lymph glands (biospy on one was positive) this week and have been reading about fasting (500 calories per day) for 48 h before chemo and for the 24 h after to reduce side effects.  Has anyone got any info, advice/tips?  I've generally coped with the side effects but am very tired and nauseas for about a week after.  It's apparently is good for the tumour too! My main concern is that if I have reduced calorie intake I'd be tired anyway never mind the trials of chemo.  Basically I'm keen to do anything that will help with a cure. After this i'm anticipating a masectomy and radiotherapy but aiming for  a good outcome as my oncologist has said, providing i react well to the chemo, it should be curable. I'm lucky, lots of support and positivity surrounds me!  thanks! Star",
      "MessageIndex": 0,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71237/advice-re-fasting-for-chemotherapy",
      "Title": "Advice re-fasting for chemotherapy."
    },
    {
      "AuthorID": "StarYour username",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/staryour-username",
      "Content": "Dear All Thank you for these posts, sorry its taken me a while to respond but other things are going on that have had to take priority.  My chemo has been delayed due to low neutrophils so have more time to suss things out. Thanks to Cathy for the huge amount of information and the booklet, I'll need to digest it. . This looks like something worth considering. Like others I think 500 calories post chemo would be doable. but I wonder about the 48 h before. I did  try a low cal recipe for a breakfast omelette on Monday. It looked great on the picture but when it came down to making it, it only had 3 and a half  cherry tomatoes. some onion, basil and parmesan (tiny amount) , two small eggs (mixed with water|) which made me smile and say, not enough!!! I added about another 5 toms and some mushrooms and with some toast thought that's more like it. Suppose I will need to work on self-discipline. THank you all so much, feeling that this is really worth considering (greed aside), Best wishes to you all,this was my first post and I'm delighted with the response/support, Star Publish",
      "MessageIndex": 10,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/71237/advice-re-fasting-for-chemotherapy",
      "Title": "Advice re-fasting for chemotherapy."
    }
  ]
}