{
  "AuthorID": "Stoatie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
  "Posts": [
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "I am noticing a lot about diet changes - can anyone advise me please ",
      "MessageIndex": 0,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90327/i-am-reading-lots-of-info-re-diet-and-did-not-realise-a-change-was-needed-can-anyone-advise-me-please",
      "Title": "I am reading lots of info re diet and did not realise a change was..."
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Hi carol  that would be great - I start chemo next Friday 27th so would need to be my third hopefully good week or before then - are u having any treatment at present that we need to fit around ?",
      "MessageIndex": 4,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90233/anyone-live-in-or-near-notts-and-fancy-meeting-for-support",
      "Title": "Anyone live in or near Notts and fancy meeting for support"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Would love to meet up with anyone nearby for support and a face to face natter ",
      "MessageIndex": 0,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90233/anyone-live-in-or-near-notts-and-fancy-meeting-for-support",
      "Title": "Anyone live in or near Notts and fancy meeting for support"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Hi carol I live in Calverton NG14 and drive so can travel up to an hour x",
      "MessageIndex": 2,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90233/anyone-live-in-or-near-notts-and-fancy-meeting-for-support",
      "Title": "Anyone live in or near Notts and fancy meeting for support"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "I personally have a virtually sexless marriage ( I am 49) due to my own incredible ly low sex drive. I put it down to 30 years of antidepressants. I have tried to rectify this but realised I was making myself miserable with the pressure. My husband is fine with this but would equally like more. I worry he will find someone else but that's a chance I have to take. I believe you can have a good marriage without sex but equally I would love to want it more. I am not a touchy feely person and tend to build a brick wall round me. That said my husband is fab and I hope our relationship continues for many years. ",
      "MessageIndex": 8,
      "PostDate": "12/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/89802/i-need-to-ask-a-very-personal-question",
      "Title": "I need to ask a very personal question?"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Hi everyone I am 4 months post mastectomy with LD flap reconstruction. I have had 4 of my 6 cycles of chemo and got off really lightly til this time. To my surprise it appears that me suffering isnt agreeable in the household, my 5 year old Grand daughter tells me I am no fun since I got ill and her behaviour appears to be deteriorating since I started chemo, She lives with us, Who am I supposed to please and is there any point carrying on with my final 2 sessiona as I am undoubtedly going to be sofa bound and things will deteriorate further. I feel very resentful I am not allowed to get over my treatment due to having to care for her - for Gods sake I didnt choose to be ill! I dread her coming in from school cos being bothered is such an effort - I even said I may go and stay somewhere else for my next treatment just to get away. Why is it so hard :-(",
      "MessageIndex": 0,
      "PostDate": "09/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93971/completely-fed-up",
      "Title": "Completely fed up"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Hi i have had some devastating news at clinic today that my cancer is in two of the three lymph nodes that were removed during my surgery - I am 49 and have lots of people around me but have never felt so alone. I am now told I need chemo and just think that's it ! I am happy to support anyone who needs it as only we know the internal pain of this diagnosis x",
      "MessageIndex": 3,
      "PostDate": "20/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88591/new---my-experience-so-far-will-it-help-you-stage-2-lymph-her2-positive",
      "Title": "New - My experience so far. Will it help you? Stage 2 + lymph; HER2..."
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Thank you Pepys - hug received. I have a husband and adult children plus a 5 year old Granddaughter. I told my husband last week I hated everything about my life and didnt wan to be with him - he was shocked - its the pain that has made me so miserable and continues to do so - getting off the sofa, walking up the stairs just hurts so much. I have been lucky enough (if it is lucky) to get a blue badge which has made going out easier. We have discussed whether we need to move to a bungalow. All people ever say is how well I look but its the psychological after effects as well as the physical ones. Why do I think its my last christmas ? I dont know I just have an overwhelming fear I am going to die :-(",
      "MessageIndex": 2,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100972/feeling-morbid",
      "Title": "Feeling Morbid"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Having been diagnosed with breast cancer last October and subsequently having mastectomy and node clearance, LD reconstruction, chemotherapy and radiotherapy - mting Tamoxifen.y treatment finished in September. So it seems that all is meant to be back to normal?  yes? NO! I started this process as a fairly fit 49 yer old and am left 2 stone heavier, I walk with a limp due to damage from chemotherapy, I have joint pain continually and haven't had a full nights sleep since starting Tamoxifen. People say \" at least the cancer has gone\" - but has it - there is no evidence of disease but every ache and pain could be an indicator of spread. Last night I took a very enthusiastic glug of Oramorph and slept - wow, but awoke with what appears to be the start of a chest infection or could be disease spread. Once you stop treatment everyone's lives continue as normal but mine isn't. I know I am going to die next year and I know this christmas will be my last. How do I know this ? I am a nurse who deals with cancer day in day out and I know how it works. I know someone is going to tell me one day soon that my time is limited and I know I cannot cope with that. I have noticed things like saying the wrong word - is it in my brain? I have a plan for when that day comes and will not sit and wait until I am gaga. You are probably reading this and thinking I am already mad and I may well be but I cannot cope with these overwhelming feelings. I dont know what to do.........",
      "MessageIndex": 0,
      "PostDate": "08/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100972/feeling-morbid",
      "Title": "Feeling Morbid"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Thank you all for taking the time to post - I know my family will listen to me but you are all the real deal - you have lived it and breathed it so know what this is like. I was looking at all my family as if they had the problem but I realise it is me and I was trying to deflect that onto them. I almost feel angry that they have all had the nerve to move on when I feel stuck here - its such a selfish disease. I am snappy and irritable and not keen on doing anything . I do have a history of depression since the age of 16 and have always been on a low dose of tablet which I increase if I am struggling - maybe its time to do that now. I have a weekend away booked with my husband (and our new little pooch) next weekend to a small cottage in a small village in Lincolnshire which will be lovely, Fri-Mon and no phone signal or wifi (at least that's what I am telling the kids!). I will try to get everything in perspective which I think is the first step. I have an appt with my GP in a couple of weeks so if I feel no better I will ask for counselling. I have my first year mammogram on 1st Dec so maybe thats playing on my mind too. My employers were very unsupportive and I ended up finding a new post which I started in September - a fab team and really supportive - I push myself through each day but am faced with dying patients each day, not sure I should have returned to that line of work but it is my speciality and I spent the year I was diagnosed obtaining a first class honours degree which would be silly not to use. So many things swirling round but thanks to each and every one of you for listening",
      "MessageIndex": 11,
      "PostDate": "09/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100972/feeling-morbid",
      "Title": "Feeling Morbid"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Thanks for all your support it really is invaluable. I feel fine which worries me as I am waiting for an onslaught of side effects! I felt a bit muzzy headed yesterday but back to normal today (whatever normal is).",
      "MessageIndex": 14,
      "PostDate": "28/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90562/starting-fec-t-today",
      "Title": "Starting FEC T today"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Morning all  I start chemo today and am almost looking forward to it ! I know that sounds mad but if I don't start then I can't finish ! I am expecting it to be horrendous but will deal with whatever it does to me and however it makes me feel cos I need to get clear of this disease and get my life back ! ",
      "MessageIndex": 0,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90562/starting-fec-t-today",
      "Title": "Starting FEC T today"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Hi Having had 3 x FEC with very little side effects the Tax has been a different matter. The first dose left me with a rancid bleeding mouth and swollen feet. The second was a reduced dose which improved my symptoms mouth wise but left my feet and ankles really swollen - walking is so hard. I have been breathless since my third FEC, have put on 7kg since Feb and now have ? a clot and am on daily injections awaiting a CT scan. I am also awaiting an Echo as there is concerns I may have heart damage from FEC. So at clinic yesterday was told my last Tax was to be posponed as my feet and ankles are too swollen and they want to give them chance to go down but if not down by next week they may not give last dose as side effects are mounting and outweighing the benefit of treatment. I have further surgery booked for 8th July so any delay will mean that cannot go ahead and everything gets pushed back. So I dont feel inclined to have last dose but now my family are not happy - its not them who can hardly walk and feels 80 not 50 and its not them stuck at home day after day. I want to be back in control. I just wondered if anyone else hadnt finished the course? Thanks Fiona",
      "MessageIndex": 0,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95229/may-not-manage-last-t-chemo",
      "Title": "May not manage last \"T\" chemo"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Hi Helen  thanks for taking the time to reply. The drain tou back stopped working hence it was removed which is where the problems seemed to start. I am back at seroma clinic today as it is bulging right along my back scar line and it is so painful once it gets too tight. I would like another drain putting in but will see what they say. I see my consultant tomorrow for my histology which is my main focus this week as then I know how much of a fight I have on my hands ! :-)",
      "MessageIndex": 2,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88469/pain-following-ld-reconstruction",
      "Title": "Pain following LD reconstruction"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Hi I had right mastectomy and ld reconstruction for two tumours in right breast on 31 Dec. I am 49 and these were discovered on routine screening. I was brilliant on virtually no analgesia until Friday and am now in agony and getting about is a struggle. I am on max dose of paracetamol and brufen and have also started oramorph yesterday, I have a large back seroma being drained three times weekly and this was last done yesterday - consultant said fluid looks clear with no sign of infection. I wondered why I had been ok and now feel so incapacitated - does anyone have a similar experience or advice ",
      "MessageIndex": 0,
      "PostDate": "18/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88469/pain-following-ld-reconstruction",
      "Title": "Pain following LD reconstruction"
    },
    {
      "AuthorID": "Stoatie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stoatie",
      "Content": "Hi I am not sure what I would do if I was in your position, I had my reconstruction at the same time as my mastectomy as I couldnt bear the thought of not having a breast. I suppose one thing would be to weigh up the pros and cons, I nearly had a DIEP but realised it was the tummy tuck that was the attraction! I ended up having LD flap and 4 weeks on its pretty dam good! Fiona x",
      "MessageIndex": 2,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88970/to-have-reconstruction---or-not",
      "Title": "To have reconstruction - or not!"
    }
  ]
}