{
  "AuthorID": "storming",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/storming",
  "Posts": [
    {
      "AuthorID": "storming",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/storming",
      "Content": "Hi All, Mine is a minor issue but one I would appreciate your support and guidance with. Three years ago I had high grade DCIS, 3 surgeries and radiotherapy. The results are not great and, since I seem to be fully recovered in the main, I've been reviewing my options for sorting out the defect that is frankly troubling me. I know it is looming in my head rather than in the mirror but its there nevertheless, and it is very distracting feeling as I do about the results. I know I'm lucky and should just just get on with my life but there is this constant reminder and now a opportunity has appeared. There is a trial of Lypo and fat transfer for DCIS patients going on in my area and I'm thinking of joining it. I'm told I've lost 150ml volume due to surgical removal and the impact of radiotherapy and this is my best option for improvement. Nothing is guaranteed of course. Has anyone had this done, did it help, how was it for you? I would be greatly interested in your experiences and observations. Are any of you on this trial and did it help your appearance and self esteem?",
      "MessageIndex": 0,
      "PostDate": "13/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61470/has-any-one-had-experience-of-fat-transfer-to-fill-out-the-defect",
      "Title": "Has any one had experience of fat transfer to 'fill out' the defect"
    },
    {
      "AuthorID": "storming",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/storming",
      "Content": "Hi Debra, Its been a few weeks now since your proceedure - how are you doing? Do you know yet if it was worth your while? I've been back to see the plastics team and they seem keen to take me on - they think it will make a difference. Mind you there are a few warnings as well as there is still breast tissue in place. Overall I think I will go for it, there seems to be a bit of good experience in my hospital now since we first discussed this a year ago. Waiting now........",
      "MessageIndex": 3,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61470/has-any-one-had-experience-of-fat-transfer-to-fill-out-the-defect",
      "Title": "Has any one had experience of fat transfer to 'fill out' the defect"
    }
  ]
}