{
  "AuthorID": "Stormydaze",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stormydaze",
  "Posts": [
    {
      "AuthorID": "Stormydaze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stormydaze",
      "Content": "Hi ,  This is the first time I have answered any comments in the whole year I have been on this site but I am feeling exactly the same as you are !! I had a mastectomy right lymphnodes removed , chemo, radio, and the crap tamoxifen!   It’s now that all treatment finished and given the “all clear” that I feel most lost!   Do you find that losing your hair is a cancer thing but the trying to get back to normality is so hard when you look and feel so different ;   I have only just had a meeting yesterday at my place of work and I can’t believe how anxious I am about returning ( I work within the mental health system) and have for the last 15years but I suddenly feel nervous and so aware of my physical changes !   What sort of reconstruction have you had? I had a expander put in but only managed 5 attempts to fill it very little amounts but developed capsuler contractor and the pain was ridiculous so I have a bit of a boob but it’s like a cricket ball but at least I have something!   How do you feel about your mastectomy? And cancer ? I am also a upbeat positive person that have never feared cancer before having it and whilst having it but admit that it is always in my mind now! How are you feeling now?    I hope we can boost each other up from now on .   I just really know how your feeling and want you to know your not alone!   By the way my name is Ellyse , 39yrs old diagnosed 2016 bc - spent 2017 doing as I was told and surviveing! 2018 - told all clear and carry on as NORMAL .    It’s crazy how cancer consumes your daily life for so long then ......  nothing !  I’m not even being seen until 15th December 2018 !!!  And as for my cricket ball boob I’ve now been placed on a waiting list for diep Reconstruction that seems like my only option to keep a boob but yet another big operation (. I have had many surgeries before cancer ) becoming quite a body of scars I’m actually running out of body to operate on )   Bloody hell I really have babbled on I do apologise !  Thanks for posting !!!    Feel free to contact me !!  ",
      "MessageIndex": 13,
      "PostDate": "07/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149189/once-treatment-has-finished-getting-back-to-normal",
      "Title": "Once treatment has finished..getting back “to normal “"
    },
    {
      "AuthorID": "Stormydaze",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/stormydaze",
      "Content": "I seem to have posted a reply to MOB29 to everyone !  ",
      "MessageIndex": 14,
      "PostDate": "07/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149189/once-treatment-has-finished-getting-back-to-normal",
      "Title": "Once treatment has finished..getting back “to normal “"
    }
  ]
}