{
  "AuthorID": "Strawbaby",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/strawbaby",
  "Posts": [
    {
      "AuthorID": "Strawbaby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/strawbaby",
      "Content": "wombat.23 Hi,  Just had my last T on Tuesday - just waiting for the tax truck to hit...lol! No please tell your mum not to worry- It hasn't been as bad as I was expecting having read all the horror stories. Not as easy as FEC was, but FEC was very kind to me.  My advice would be to pre dose on painkillers eg ibuprofen and codeine (check to make sure these are ok for her) after day 2. The aches for me left me feeling tender all over so a few days spent on settee. After T 4, I felt very sorry for myself and did lie down a lot. After T 5, I made an effort to be more active - a little walk everyday, and it did help. The feeling in my mouth was horrid - ice lollies and yogurts helped me. Both of these started about day 2/3 and lasted till day 8/9.   Just tell your mum to take it easy. If she does have any unpleasant side effects make sure she rings up and gets something to help for them. But it will be ok, and just keep thinking the end will be in sight. Take care, Gay xxx Thank you so much for the info! I really appreciate it. It's lovely to hear some positive things through all the scary comments about the dreaded \"tax truck!\" haha. We're seeing the oncologist on the 11th May, so I'll make sure I ask about pain killers. :-) And I'll stock up on the yogurts and ice lollies!  It's been the same for my Mum - FEC hasn't been too bad at all. Hardly any sickness or anything we havn't been able to deal with. Half way though now, so no more FEC, just T!  Hope you are feeling okay and recovering well.  Laura. x x x x x x x x x x ",
      "MessageIndex": 5,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127291/mum-starts-docetaxel-soon-for-stage-3-breast-cancer-any-advice-ladies",
      "Title": "Mum starts Docetaxel soon for stage 3 breast cancer. Any advice ladies..."
    },
    {
      "AuthorID": "Strawbaby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/strawbaby",
      "Content": "Kacang Hi Laura. It's good to know that your Mum is getting through chemo ok, although of course I'm sure she has good and bad days. I'm afraid low blood counts are par for the course with FEC-T chemo. Chemo kills all types of fast growing cells, not just cancer cells - that's why we lose our hair, our taste goes weird and so on. Blood cells are also fast growing so get knocked out by the chemo, making the risk of infection greater. Some people are given injections of Neupogen (filgastrim) or Neulasta (pegfilgastrim) to stimulate the production of white blood cells. Has your Mum had either of these?  It's hard to say how your mum will react to the taxotere. Some people say it's easier than FEC, but others find it quite hard - I've seen people refer to it as being hit by the tax truck. If she finds it really difficult, then it is possible to switch to the weekly paclitaxel, which has less difficult side effects. I had that and to be honest found it a breeze by comparison to my earlier chemo.  Wishing you and your mum all the very best Hi thank you so much for the reply. I'll definitely ask about the weekly sessions and see if that's an option. It'd be worth going every week if the side effects got too severe. Yes she has had these injections, she had \"Nivestim\" to start off with, after the first and second cycles, and today after the third cycle we were given a box of \"Zarzio\" - the first lot didn't seem to make a huge difference so hopefully these ones may work a little better. :-) Wishing you all the best too. Laura. X x x x x x x",
      "MessageIndex": 8,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127291/mum-starts-docetaxel-soon-for-stage-3-breast-cancer-any-advice-ladies",
      "Title": "Mum starts Docetaxel soon for stage 3 breast cancer. Any advice ladies..."
    },
    {
      "AuthorID": "Strawbaby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/strawbaby",
      "Content": "MaggsT Hi Laura Hope your mum is doing OK.  I have tried both FEC (6 cycles, 13 years ago) and Docetaxel (6 cycles, 2 years ago) and can assure you that in my experience Docetaxel was the better of the two.  I suffered with nausea, sickness and generally feeling wiped out on FEC but had no nausea or sickness whatsoever on tax.  The main side-effects of Tax I did experience were bone & joint pains, tiredness, sore fingernails & toenails (I lost some of both, but not all) and the yukky mouth thing.  But these were nothing compared to what I remember from FEC.  My main advice on either regime would be go to bed when she gets home from her treatment and stay there until at least the end of the following day, as I found that rest really helped with the side-effects of both. All the very best and well done for looking after her so well Maggs xx Hi Maggs, Thank you so much the reply. This is my Mums second time too - she had breast cancer in 2006 - avoided chemo that time though because it was stage 1 so it's been a bit of a different situation this time! I'll definitely tell her to rest and look after her mouth. She has some special prescribed mouth wash and gel so hopefully that'll help a little bit. :-) She had her last FEC yesterday, so three T's now! Hope you're well and sending lot's of positive thoughts your way. Laura. X x x x x x x x x x x x x",
      "MessageIndex": 11,
      "PostDate": "21/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127291/mum-starts-docetaxel-soon-for-stage-3-breast-cancer-any-advice-ladies",
      "Title": "Mum starts Docetaxel soon for stage 3 breast cancer. Any advice ladies..."
    },
    {
      "AuthorID": "Strawbaby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/strawbaby",
      "Content": "BettyBlue71 Hi laura, I think you should ask for weekly Paclitaxel instead of the docetaxol. I found the Paclitaxel much easier than the Fec. Although it can affect your fingertips and toes. And it's a bit of a pain going in weekly. It's certainly worth asking about... Thank you :-) I've seen a couple of other ladies saying about swopping to weekly Paclitaxel so I'll definitely ask the oncologist about it and check to see if that's an option if it gets too much for her. Thanks for the reply. x x x x ",
      "MessageIndex": 7,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127291/mum-starts-docetaxel-soon-for-stage-3-breast-cancer-any-advice-ladies",
      "Title": "Mum starts Docetaxel soon for stage 3 breast cancer. Any advice ladies..."
    },
    {
      "AuthorID": "Strawbaby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/strawbaby",
      "Content": "loobylou2 Hi Laura  I finished 3 rounds of docetaxol 5 weeks ago.  I found a number of side effects but nothing I couldn't deal with.  I completely lost my sense of taste for a week or so after treatment and lost weight during that time, it's surprising how difficult it is to eat when you can't taste, and I was a lot more tired.  I also found this was cumulative so by the end it took three weeks before I could spend more than a couple of hours out of bed at a time.  Five weeks on I still have to watch what I do but do generally stay up most of the day now.  The other effect has been on my nails and the numbness in my toes which I am told should go. I was told by a friend that Docataxol is 'nasty' so it was nowhere near as bad as I was expecting.  My advice to your Mum is just go with what you feel, if you want to go to bed do, if you want to sit and do nothing then do nothing.  Oh and one more thing I really felt the cold but also get hot flushes so I have bought a couple of zip up fleeces which are easy to put on and off. Hope it all goes well but remember everyone is different xx Thank you so much. :-) You're right, think we'll just do that we did with the FEC and muddle through it as everyone does with chemo! I'll definitely make sure she rests more on this one too.  Glad you've finished now and hope you're feeling well. Laura. X x x x x x x x x",
      "MessageIndex": 6,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127291/mum-starts-docetaxel-soon-for-stage-3-breast-cancer-any-advice-ladies",
      "Title": "Mum starts Docetaxel soon for stage 3 breast cancer. Any advice ladies..."
    },
    {
      "AuthorID": "Strawbaby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/strawbaby",
      "Content": "Hi everyone, My mum was diagnosed with stage 3C breast cancer in February, she's currently having FEC-T chemotherapy, before radiotherapy and hormone therapy. (Cancer is currently inoperable because it's by the collarbone, but hoping that may change after treatment.) I've suspended my studies at University so I can look after her. Her third FEC treatment is today, so far so good. Mostly just suffering a bit of tiredness, sore mouth and heartburn. However, I'm a little anxious about her starting Docetaxel in three weeks time. I've read some absolute horror stories! I love my Mum so much and I just don't want to see her suffer, and I want to do everything I can to make her life easier while she goes through this. Have any of you ladies got any advice that we should know about before she starts? Also, got a call from the Chemo unit yesterday saying that one of her blood results was a little low. Oncologist was still happy to go ahead though because my Mum is feeling well. (If anything she does TOO much, had to stop her from manically cleaning the house this weekend!) Is this normal to have low blood counts after 2nd/3rd treatment? Reading all your posts has made this much easier for me. Mum doesn't want to go on the internet and read things because her laptop is rubbish and she can't be bothered. If it wasn't for you guys I wouldn't have had a clue what was going on half the time. Thank you so much for your advice and making this whole traumatic experience a little easier. Laura. X x x x",
      "MessageIndex": 0,
      "PostDate": "20/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127291/mum-starts-docetaxel-soon-for-stage-3-breast-cancer-any-advice-ladies",
      "Title": "Mum starts Docetaxel soon for stage 3 breast cancer. Any advice ladies..."
    },
    {
      "AuthorID": "Strawbaby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/strawbaby",
      "Content": "Hey lovely, just wanted to let you know my Mum was the same as you. No cancer in either breasts, but breast cancer cells in lymph nodes under the arm, chest and neck. She had Chemo first. They scanned her after chemo to see if surgery was a possibility, but nothing was showing up on the scans at all. So she just had Radiotherapy for about 5 weeks. She's really well now, swimming, going out on her bike etc and has recently gone back to work. :-) x x x x",
      "MessageIndex": 19,
      "PostDate": "24/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140718/worry-over-positive-lymph-nodes",
      "Title": "Worry over positive lymph nodes"
    }
  ]
}