{
  "AuthorID": "studentmidwife",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/studentmidwife",
  "Posts": [
    {
      "AuthorID": "studentmidwife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/studentmidwife",
      "Content": "Hello, I am in need of a place to talk.  I was diagnosed with ductal breast cancer on Thursday (yesterday). I have 2 tumours one grade 2 and one grade 3, joined by what has been described by calcifications. I am having another biopsy via mammogram next week to determine whether or not the calcifications are cancerous, and from the results of that, will be advised on what treatment will be best. At the moment, via the USS my lymph nodes appear unaffected, however, this will also be investigated to see if it has spread there too. I am terrified. I am 38, at the end of my 2nd year of midwifery training, and have 3 children, with no risk factors. My partner is being brilliant, my mum & sister have come to stay for a few days, and my older children are also being so supportive. I just cannot escape this feeling of dread and fear, as I do not know how bad things are going to be, and right now feel I am not going to survive, as the doctor did not sound hopeful. However, the nurse after was supportive and told me breast cancer is no longer a death sentence. Anyone else who has gone though, or going through something similar?",
      "MessageIndex": 0,
      "PostDate": "21/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61709/diagnosed-on-thursday",
      "Title": "Diagnosed on Thursday"
    },
    {
      "AuthorID": "studentmidwife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/studentmidwife",
      "Content": "Hello Sue, I think your suggestion of starting a blog will be good for me. I have started taking photos to record my journey, so a blog would be good to go along with them. I have been honest with my 2 older boys who are 13 and 15, but my daughter is only 4, so will eventually talk to her once my treatment starts so she is prepared for it, and the changes in my physical appearance etc. I am glad you mentioned the breast reduction, as I wondered if this would be an option, as I think I will be having a mastectomy for my right breast, and my breasts are very large too. I just want them to go, which may sound awful but I need them gone. You are all so kind x",
      "MessageIndex": 7,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61709/diagnosed-on-thursday",
      "Title": "Diagnosed on Thursday"
    },
    {
      "AuthorID": "studentmidwife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/studentmidwife",
      "Content": "Thank you Ethel, I am struggling today, but my partner, sister, mum and children are being so supportive. I'm just so scared.",
      "MessageIndex": 6,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61709/diagnosed-on-thursday",
      "Title": "Diagnosed on Thursday"
    },
    {
      "AuthorID": "studentmidwife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/studentmidwife",
      "Content": "Hello Lizane, I am in a better place at the moment, and also trying to stay positive. As yet it has not been confirmed what stage my BC is at, this is the worst part, the uncertainty of it all. The BCN have been brilliant though, and keep reassuring me that there is no evidence it has gone to my lymph nodes just yet. I am holding onto this for now.  I too cannot believe how many younger women are affected by BC, something needs to change in the screening system.  Did you get your results yet? I hope they are benign. I wish you good luck too. xxx",
      "MessageIndex": 10,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61709/diagnosed-on-thursday",
      "Title": "Diagnosed on Thursday"
    },
    {
      "AuthorID": "studentmidwife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/studentmidwife",
      "Content": "Thank you Kate. I am so worried because it is not grade 1 and may have gone to my lymph nodes. It is all so confusing, my lump (the biggest one) is painful, which is not usual for BC, I don't understand why it would be painful. Reading your reply, does help though. So thank you VERY much! I will keep posting and will find a group close by to talk to people.",
      "MessageIndex": 2,
      "PostDate": "21/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61709/diagnosed-on-thursday",
      "Title": "Diagnosed on Thursday"
    },
    {
      "AuthorID": "studentmidwife",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/studentmidwife",
      "Content": "Hello Dorothee, The doctor did not mention stages, and it was only the nurse after in another room that pointed out Grade 3 and Grade 2 hand written on a piece of paper inside a file she gave me. There is a question mark next the the grade 2. The bigger lump is approx 1 inch and the smaller under 1cm.  I am assuming that they will determine the spread when they get the results from the biopsy from the calcifications joining the two lumps, and from the lymph nodes.   The wait is horrendous. Thank you all for replying, it is helping me process things.   Charlotte x",
      "MessageIndex": 8,
      "PostDate": "22/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61709/diagnosed-on-thursday",
      "Title": "Diagnosed on Thursday"
    }
  ]
}