{
  "AuthorID": "Suebells",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suebells",
  "Posts": [
    {
      "AuthorID": "Suebells",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suebells",
      "Content": "Thank you. Good to know there are people out there to listen and say helpful things. My CT scan went from my neck down to groin area. x",
      "MessageIndex": 5,
      "PostDate": "18/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170067/breast-lump---frightened-and-miserable",
      "Title": "Breast lump - frightened and miserable."
    },
    {
      "AuthorID": "Suebells",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suebells",
      "Content": "Thank you. It definitely feels surreal - especially the week's holiday we've just had - just behaving like normal people. xx",
      "MessageIndex": 16,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170067/breast-lump---frightened-and-miserable",
      "Title": "Breast lump - frightened and miserable."
    },
    {
      "AuthorID": "Suebells",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suebells",
      "Content": "First I had an ultra sound scan which showed that they have \"abnormal architecture\". They were too small for a needle biopsy so I was sent for a CT scan and booked in to have one removed for histology. The CT scan showed a more significant node (which I couldn't feel) in my armpit so I was sent to a breast surgeon. He sent me for mammogram then PET scan and finally breast MRI scan. These showed no breast tumour but signs of where it may have started before moving all over - so I was told I had numerous bone sites and some on my liver. I was not told specifically which bones apart from that it's definitely in my spine. My original raised nodes are on the side where the arm pit node is and the suspected origin in the breast. Histology confirmed secondary breast cancer. ",
      "MessageIndex": 10,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170067/breast-lump---frightened-and-miserable",
      "Title": "Breast lump - frightened and miserable."
    },
    {
      "AuthorID": "Suebells",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suebells",
      "Content": "I was given 3 to 6 months without chemo and 12 to 18 with - it didn't seem worth going through all that horrible treatment for so little extra time. It was going to be relentless palliative chemo. I'm feeling well, still able to go for walks which I love. I know that one day I'll start going down hill but why bring it on feeling ill instantly with chemo? I am getting lots of support from friends and family thank you - and my Macmillan nurse, GP and local hospice where I go for a day once a week and have lovely relaxing therapies. I've not given up hope totally and marked the 3 month date in my diary - I'm aiming to extend it through a drastic change in diet (I know a lot of people thing this is all rubbish) but quite often if you believe in things they do do some good. Thanks xx",
      "MessageIndex": 11,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170067/breast-lump---frightened-and-miserable",
      "Title": "Breast lump - frightened and miserable."
    },
    {
      "AuthorID": "Suebells",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suebells",
      "Content": "I've recently been sent to ENT for investigation of lymph nodes in my neck for an ultra sound scan, when I was told it could be lymphoma but not to worry because the node are tiny and the treatment is successful and not so bad. To make sure there were no more, I had a CT scan. Today, as week after the CT scan, I received a letter asking me to go to the Breast Surgery Clinic on October 30th. This was a bit out of the blue and a total shock. I managed to get hold of my ENT consultant who said that the scan showed a breast lump and a more significant node in my arm pit. So, I am assuming it has already spread and the prognosis is not good. What makes it worse is that it is ages until the appointment and in the meantime I have nobody with any medical knowledge or personal experience to talk to and tell me what may happen next and what treatment to expect. ",
      "MessageIndex": 0,
      "PostDate": "18/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170067/breast-lump---frightened-and-miserable",
      "Title": "Breast lump - frightened and miserable."
    },
    {
      "AuthorID": "Suebells",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suebells",
      "Content": "Not good. After virtually every scan possible I was diagnosed with occult breast cancer with multiple metastasis to bones and liver. i have come to terms with it now and refused chemotherapy. I still feel well and am carrying on life as normal although the oncologist says I have between 3 and 6 months to live. ",
      "MessageIndex": 7,
      "PostDate": "06/12/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170067/breast-lump---frightened-and-miserable",
      "Title": "Breast lump - frightened and miserable."
    }
  ]
}