{
  "AuthorID": "suemag",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suemag",
  "Posts": [
    {
      "AuthorID": "suemag",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suemag",
      "Content": "Hi Celia, Like so many of us on here, I've had trouble sleeping throughout the whole process too(pre op, post op, chemo, 2nd op, pre results etc etc).......  I bought a couple of Relaxation cds from Amazon early on and have found they usually work (even if I have to play them twice or even 3 times).  One is a Paul McKenna one, which is probably the best. He chats for about 15 minutes.....and it's supposed to get into your sub conscious etc. The other is Dr Hilary Jones - which is shorter and worked fine at first but now I've become immune to it I think ! I have a cd player by the side of the bed and use the cd to drift off most nights and then if/when  I wake up. World Service does work sometimes, I agree. I've also read that looking at the bedside clock doesn't help at all.....and I think I agree. I now put a mug in front of it so now don't know how long I've been awake. Best wishes, Sue      ",
      "MessageIndex": 21,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/31278/node-sampling-and-mastectomy",
      "Title": "Node sampling and mastectomy"
    },
    {
      "AuthorID": "suemag",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suemag",
      "Content": "Hello, Just wondering if anyone else has the same  extreme thirst experiences as me following chemotherapy ? I've had 3 FEc chemos when all was reasonably okay, thirst wise. Now have had 2 Taxotere, the last one being on 22nd April.  Over the last few days (a week after the chemo) I've been extremely thirsty day and night.  On Thursday night  I was waking every half hour needing to drink/go to toilet, then not able to get back to sleep. I phoned the hospital first on Thursday (they said thirst was normal, carry on with fluid intake). I phoned again on Friday morning and they told me to go in to get it checked out. (I think they suspected diabetes).. They carried out lots of tests  but results all came back normal, so they could not explain it. I'm now monitoring fluid in/out and have got to go back on Tuesday for a couple of remaining results. I do feel it's being investigated, but would be interestedif anyone else has experienced the same ?? Sue          ",
      "MessageIndex": 0,
      "PostDate": "01/05/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/27498/thirst",
      "Title": "Thirst"
    },
    {
      "AuthorID": "suemag",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suemag",
      "Content": "Hello Elicia, I was in hospital for lymph node removal a few weeks ago. I had the op on a Friday (as did several others in at same time)  and was in until the following Wednesday. I could have gone home with the drain, but the hospital was happy for me to stay in. One person went home on the Monday (with the drain) and same op. I'm sure it does vary from one hospital to another - my consultant said he wanted all  drains for lymph node removal to stay in 4-5 days !  In fact quite a lot of fluid was draining each day, so it did make sense. At the pre op meeting I asked what % of nodes were going to be removed, arm movement/activities afterwards, drug prescription/start time.  Two breast care nurses visited while I was on the ward and were able to answer anything I hadn't thought of. They also helped with info on execises. Hope this helps.                    ",
      "MessageIndex": 3,
      "PostDate": "06/08/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/30254/surgery-and-taste-buds",
      "Title": "Surgery and taste buds"
    }
  ]
}