{
  "AuthorID": "Sukiwarrior",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sukiwarrior",
  "Posts": [
    {
      "AuthorID": "Sukiwarrior",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sukiwarrior",
      "Content": "Hi Rebecca, I am having my lumpectomy tomorrow at the Sutton Marsden,I am very lucky to only have a grade 1, 17mm lump so hopefully It will not have gone to my lymph nodes which I will find out tomorrow but will then have to wait the 2 weeks to find out if they got it all. Since all this nightmare began I have totally changed my way of life as to nutrition as I do believe it pays a huge part in why we get cancer in the first place I am really into alternative medicine, and if i was in a different financial situation i would probably go down the treatment path of the ( Gerson programme) I invested in a Champion juicer and have been juicing 6 lbs of veg and fruit daily, lots of carrots which is a cure for cancer in it self and eating lots of raw salads etc and drinking litres of distilled water daily, I have also being doing 2 coffee enemas a day ( part of the Gerson method ) it just makes so much sense to me to reclaim our health through raw food nutrition and detoxification instead of the poison which is the only thing on offer. Nothing will change whilst The World Medical Association is being run by The Big Pharma. If you have cancer, guess which system is the most important to you at this time, more than it’s ever been before in your whole life, your immune system. Now guess which system suffers the most from chemotherapy and radiation and hormone drugs so the one time in your life you most need it, your immune system will be weakened by those therapies. I went through a huge life changing traumatic event last year( very long story) which literally turned my life upside down and left me a broken woman ( in more ways than 1) I cried for months, this I know had a huge impact on my body so I am not surprised I have the cancer as our bodies can only take so much. I was on the road to recovery from that when I found out about the cancer. I know I can not make any decisions about any future treatments until 2 weeks time when I have all the results. Your email about still being tired for 6 months from the Rad shocked me a bit. Is it that some get much larger doses for different types of BC or will it be the same for us all. The plan they have for me that was discussed at my first meeting when I was told the news was 3 weeks of radiation treatment and the lovely drug Letrozole. After researching lots on that I have decided I am definitely not taking it the thought of putting that poison into my body for 5 years seems crazy to me that I should need it with as someone said to me the lottery winner of BC. , and my jury is still out on the radiation treatment especially after your post. I am however feeling really positive and intend to come out the other end of this chapter in my life stronger and happier than before. I have been reading all the posts on this site for the past few weeks and it does bring great comfort to know I am not alone. Lots of love, Bee.",
      "MessageIndex": 5,
      "PostDate": "21/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63756/radiotherapy",
      "Title": "Radiotherapy."
    },
    {
      "AuthorID": "Sukiwarrior",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sukiwarrior",
      "Content": "Hi All I have just joined the big C club. I have been diagnosed with stage 1 hormone receptive breast cancer and will be having a lumpectomy week after next at the Marsden Sutton. They then plan to put me on Letrozole and radiotherapy. After read the reviews from real women of the awful side effects of Letrozole I would rather die. Where can I find on this site feedback from users. Love Bee",
      "MessageIndex": 0,
      "PostDate": "09/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63368/letrozole",
      "Title": "Letrozole"
    }
  ]
}