{
  "AuthorID": "Sunflower61",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunflower61",
  "Posts": [
    {
      "AuthorID": "Sunflower61",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunflower61",
      "Content": "Hi I'm new to the site I'm just home recovering from 11 hours of major surgery haveing had a Mastectomy, Axillery clearance and a DIEP which is reconstructive surgery using my abdomen, I'm still really sore and unsure what to expect next but would like some contact with other people who have been through the same. I live in the northwest of England (Bolton).",
      "MessageIndex": 0,
      "PostDate": "15/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10996/hello-everyone",
      "Title": "Hello everyone"
    },
    {
      "AuthorID": "Sunflower61",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunflower61",
      "Content": "Hi Helen My thoughts are with you, do you know what surgery you are having? mine was grade 2 also, it's such a strange illness isn't it, I was perfectly well when I went to the doctors now everytime I go to the hospital I seem to come out worse than when I went in, thats what I find strange. I hope your surgery goes well whatever happens, thanks for your message. x",
      "MessageIndex": 6,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10996/hello-everyone",
      "Title": "Hello everyone"
    },
    {
      "AuthorID": "Sunflower61",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunflower61",
      "Content": "Thanks for your message it's nice to hear from people in the same boat so to speak, I've just had one side done am hoping I don't need more but you never know with this illness. It must have been hard to cope with having both sides done one is quite enough to cope with. How long did you have to wait for our results after your op I seem to have been waiting ages even though it's only 18 days they did say I should have them back in ten. To be quite honest since my op I've not really heard from anyone and am starting to feel like they have forgotten about me don't want to keeping ringing to remind them but the results are very important and I can't go any further without them. I know I'll need chemo but not sure when and what I'll be having, seem to have loads of unanswered questions. It's good to hear how positive you are being and I'm glad things seem to have gone well for you. Regards Tina",
      "MessageIndex": 11,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10996/hello-everyone",
      "Title": "Hello everyone"
    },
    {
      "AuthorID": "Sunflower61",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunflower61",
      "Content": "Hi Christine, thanks for your message I'm still waiting for results from the mastectomy which was two weeks ago and counting, my surgeon did say that I would need chemo again as a safegaurd but until I hear it's all a waiting game. Seem to have spent the last 3 or 4 months sat waiting for appointments letters or operations. It's good to hear that after six years your nearing the end of your treatment I really hope you do get the all clear. Thanks again. Sunflower xx",
      "MessageIndex": 5,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10996/hello-everyone",
      "Title": "Hello everyone"
    },
    {
      "AuthorID": "Sunflower61",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunflower61",
      "Content": "Thank you for your message, I am feeling quite a bit better am starting to get some feeling back under my arm but the reconstruction site and my abdomen are still quite numb, I believe chemo affects everybody differently depending on your age and what combination you are given but I know it's not always really bad, how long ago did this happen to you and did you lose your hair? this worries me quite alot I'm not sure how I would deal with it. I am looking forward to taking mister for a walk and am trying to stay positive. You take care too. xx",
      "MessageIndex": 7,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10996/hello-everyone",
      "Title": "Hello everyone"
    },
    {
      "AuthorID": "Sunflower61",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunflower61",
      "Content": "Haven't been on for ages, have been having chemo and have my last CM F on the 24th of March and really looking forward to the end of it all, now I have had 2 core biopsy's to see if the cancer has come back or if it's just left over lymph nodes that are growing again, don't know what to think, what's the use of 6mths of chemo if the cancer can just come back, has anyone else had this?",
      "MessageIndex": 0,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/25890/relapse-or-not",
      "Title": "Relapse or not?"
    }
  ]
}