{
  "AuthorID": "sunriser52",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
  "Posts": [
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Please can anyone enlighten me. I requested a copy of my post op’ pathology report & received my histology report which wasn’t quite what I was expectIng. Are they one and the same? Thanks for ‘listening’ xx",
      "MessageIndex": 0,
      "PostDate": "19/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142868/histology-or-pathology",
      "Title": "Histology or Pathology ?"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Thank you so much for your replies & to Dreamthief for the explanation. I find it very heartening that in this frightening & complicated world of cancer there is always someone out there who is ready & willing to offer help & reassurance.  Xxxx",
      "MessageIndex": 5,
      "PostDate": "20/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142868/histology-or-pathology",
      "Title": "Histology or Pathology ?"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "MollyMoo5 I Have started chemo just last week, I decided to shave my head instead of letting chemo take it - but now my head is so tender I can't bare even a head scarf on it - Will this subside when I eventually loose all my hair? Hello MollyMoo5 I've just returned from my hairdresser after having 'the full monty' and feel quite liberated and feel I definitely made the right decision. I was diagnosed in Dec and about to have my 2nd chemo tomorrow so wanted to get the hair thing out of the way. My head was sore and tingly before but feels much better now. I've bought some lovely headgear for chilling at home & a new wig (Hilda) who will be my constant companion when I venture out. Good luck with everything - I have found the lovely ladies on this forum such an inspiration  - thank you so much to everyone out there.",
      "MessageIndex": 10,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122444/tender-head",
      "Title": "Tender Head!"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Hi Girls, Having been through the TCHP regime I can certainly empathise with how you're feeling both physically & mentally. I also experienced some ( not all tho ) side effects the worst one being diarrhoea ( I use to get ' constipation envy!' lol ). Towards the end of my treatment I was given codeine to  take alongside the loperamide which helped a bit. Re - the sickness Jo Jo,I  was prescribed Emend which helped enormously.  It's v expensive so not given out willy nilly, but worth 'forcibly requesting ' if you meet resistance. There are only 3 tablets, one to be taken each day starting the day b4 chemo.  Its a tough time, but hopefully as others have confirmed, one with excellent results & remember while you're going through it (& beyond) we're all here for you. There are many lovely people who regularly offer support, good advice & not least quirky pics all of which make us smile just when we need it.  Jenny xx",
      "MessageIndex": 10,
      "PostDate": "05/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139161/p-tch-chemo-before-surgery",
      "Title": "P-TCH chemo before surgery"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Hi Francis, I had such a stressful time trying to get R1 & 2 cream on prescription. My original request was met by total bewilderment as no-one at the surgery had heard of it & had to investigate. 2 weeks later I rang again & eventually a Dr rang me to say I should ask at the hospital (already done that & everyone there denied all knowledge!). She then said she'd consult with the other Drs & after my persistence they decided to consult the PCT who eventually said 'yes' it was available on prescription in theory but not in my area. Dr then said she could write me a private prescription & the cost would be £18.20 & £24.15. I agreed to this but when I went to collect it from the surgery dispensary they wanted to charge me an extra 50% handling charge & 20% VAT.  Eventually after more of my complaining they agreed as a \"gesture of goodwill\" to drop the VAT. which according to another chemist I spoke to said it should be VAT exempt anyway.  So it ended up costing me around £63 & a a lot of time & stress. Was it worth it?? - the R2 packets are tiny fiddly things & I had to eke it out using it am & pm to last the 15 treatments plus 14 days \" cooking time \" post rads. (not big boobs either!). My skin held on til the rads finished but then slowly became redder before eventually breaking out & peeling under arm and under boob. This was a fortnight after treatment finished. I suppose I'll  never know if this could have been a lot worse without the R1 & 2 or if indeed it might have been better or just the same.  If I had my time to come over again, given the stress & expense incurred I think I would have just used Aveeno cream or something similar. That's just me though, I know others have said it's worked for them & Ive also read it depends on your skin type as to whether a reaction occurs, Incidently I did ring the RT helpline when my skin was peeling, thinking they'd ask me to go in & give me something to help it heal, but the nurse just said buy some Drapaline nappy cream & slap it on. Must admit I was very sceptical but I did, & to my surprise it soon started to heal & is now fine. Good luck & lots of hugs  xxx",
      "MessageIndex": 6,
      "PostDate": "18/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140344/r1-r2-for-radiotherapy",
      "Title": "R1 R2 for radiotherapy"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Thank you ladies for your wise words. I had my  appt this week & after a long discussion about the pros & cons of further checks & my oncologist initially remaining steadfast in his refusal, he suddenly did an about turn & said I could have a further bone & CT scan (not MRI) as long as I appreciated that it could cause me further unnecessary anxiety & lead to yet further unnecessary scans. ( This ties in with what you said Ann). On the other hand if nothing showed up it could offer me at least some peace of mind & he could quite appreciate my wish to go ahead especially ( & this seems to be the crux of the matter) that my chemo seemed to have had very little effect.  So here I am now, still wondering if I’ve done the right thing? The scans are in the pipeline & appt booked for 19th Dec to get the results. I spent all last Christmas worrying about my forthcoming treatment but this time I’ve only got myself to blame & I’m also putting hubby through all it too.  Should I retreat & cancel the scans or having got this far should I carry on regardless or should I contemplate even further. Think I’ll put a crystal ball at the top of my Santa letter, that may help.  Best wishes Jenny xxx",
      "MessageIndex": 9,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142110/mri-scan-after-main-treatment",
      "Title": "MRI scan after main treatment"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Thank you Helen for your response. You’re quite right in that we can’t enjoy today for worrying about tomorrow. I think if i’d had an initial MRI scan &/or a better result from the chemo & the “ partial response” could be properly explained I’d feel a bit better. I suppose for me it’s still early days post treatment & and hopefully time will bring me (us) some peace of mind. Good luck with your scan tomorrow - I will be thinking about you Jenny xx",
      "MessageIndex": 2,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142110/mri-scan-after-main-treatment",
      "Title": "MRI scan after main treatment"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "I would really appreciate advice on whether or not you think I should be offered an MRI scan. A year ago I was diagnosed with aggressive grade 3 Her2+, oestrogen 8/8 IBC.  Since then I have undergone 5 rounds ( too ill for the 6) of TCHP chemo, followed by a mx & 15 RT sessions. My post mx pathology results showed only partial response to the chemo as still elements of live tumour & in fact the tumour size had increased from 5 to 6 cms so I am still a bit perplexed as to where the partial response came in.( ONC said it was spread over a large area with various bits of calcification so it was difficult to say)  but there was no evidence of cancer in the 6 nodes removed & the margins were clear. When first diagnosed I asked him if I should have any scans as that seemed to be quite routine from what others had written of their experience. He said no to this, his reason being that  the chemo would treat the whole body, so if there was anything there it would be targeted anyway.  I did subsequently have a CT & bone scan ordered by the surgeon because I had a lot of bone pain but thankfully this was OK.  In view of the fact that the chemo didn’t do a thorough job, I‘m worried that stray cells may have escaped to other areas , or they were there already, & are now growing undetected especially as the surgeon told me that although no node involvement was detected on ultrasound or surgery, the likelihood was that they were affected because of the size & location of the tumour. I would like to have the reassurance of knowing it hasn’t spread or at least knowing, that if it has, it can be treated sooner rather than later in preference to having to wait for further symptoms & be continually worrying about every bit of a cough, backache, bone pain etc etc.  I feel strongly that an MRI scan can sort this out one way or the other, but my ONC says it’s not appropriate or routine - I’m still continuing with herceptin & exemestane tabs & bisphosphonates. Sorry to waffle on but I just need to know if you think its an unreasonable request or I’m worrying to much about what may or may not happen. I see the ONC again next week & as you always seem to offer such wise words & reassurance I would greatly value your opinions..  Many thanks & lots of hugs,  ",
      "MessageIndex": 0,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142110/mri-scan-after-main-treatment",
      "Title": "MRI scan after main treatment"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "I had a sore, scabby nose from the beginning & still suffering long after chemo finished in April although still on Herceptin ( 6 more to go) which my onc says can give you a ‘crusty nose’. I’ve tried putting on  Aveeno cream, Savlon, Vaseline & E45 all of which bring short term relief but my poor old nose feels quite raw most of the time & always running :( sorry not much help but nice to know we’re not alone.  Xx",
      "MessageIndex": 7,
      "PostDate": "16/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142578/nose-sores",
      "Title": "Nose sores!!"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Thank you Carolyn, Karen & Helen for your replies. You seem to be of same opinion & my hubby also says I should stop analysing everything & try to move on. Hope the house has warmed up by now Carolyn and you’re all cosy & relaxed.  Xxx",
      "MessageIndex": 5,
      "PostDate": "09/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/142110/mri-scan-after-main-treatment",
      "Title": "MRI scan after main treatment"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Hi JoDec, Yes I also had THCP & also wondered why when everyone else seemed to be on FEC-T although I've come across a couple of others. I did ask my BCN & she said my oncologist is well up on latest research & findings etc so it seems to be his preference. I also read  somewhere it was the gold star treatment & also that it seems to be widely used in America. I did have lots of side effects but then the onc did say he \"hammered me with it\".  Good luck with your treatment, it's hard going at times but soon passes & well worth it.  Xx",
      "MessageIndex": 71,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Hi Jo, Lost my other post so forgive me if you get this twice! pixieandthedragon gave a good explanation of the initials in that T part refers to docetaxel. I think   pertuzemab is a relatively new addition in that it's recently been given the green light to be given alongside herceptin for the her2 + people. My onc included it originally in one of his trials so has been a 'fan' since day one. ",
      "MessageIndex": 74,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Hi star67, Thats really interesting to hear of the wig bank - I've sent them an email as it appears I have a local branch right on my doorstep. Thanks for posting!  Best wishes xx",
      "MessageIndex": 108,
      "PostDate": "22/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Well done Jo - you're a little trooper :) Hope you get to go home soon.  X",
      "MessageIndex": 117,
      "PostDate": "23/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Hi Jo, You're definitely not an idiot - I'm still getting my head round this new \"language\" & I started in January. You're bound to feel crappy at times while going through the treatment, everyone does, so be kind to yourself & don't expect too much physically or mentally from your body. It has to put its energies into coping with all that's going on so its not surprising  it's knocking you for 6 (or 7 or 8! ). It will improve... I had my treatment all on the same day which was a bit gruelling but at least got it over with. I suppose different hospitals have different ways & means.  I've found a few other TCHP references from one or two other contributors - I'll send you a friend request if I can fathom out what to do - technology isn't my strong point !  Jenny. X",
      "MessageIndex": 76,
      "PostDate": "17/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Hi Glosgirl, I found 'Breast Surgeon with Breast Cancer' very informative. Written by liz Oriordan, a Consultant breast surgeon who blogs about her own experiences of bc from both sides of the coin. She goes through chemo, mastectomy & radiotherapy & offers lots of helpful, interesting information.  Good luck with your treatment - I've done the chemo bit & mastectomy &  'just' now on the last lap with radiotherapy, herceptin, anti hormone & biphosphates.",
      "MessageIndex": 1,
      "PostDate": "15/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133673/podcasts",
      "Title": "Podcasts ?"
    },
    {
      "AuthorID": "sunriser52",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunriser52",
      "Content": "Hi Boobylou, I had my 1st Zolendronic Acid infusion 4 weeks ago & so far haven't noticed any side effects. ( Touch wood !).  Good luck with yours. My oncologist was very convincing that I needed its protection from the possible bone weakening anastrozole & confirmed it was a good thing to have in my armoury against any possible cancer recurrence.",
      "MessageIndex": 4,
      "PostDate": "26/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134442/bones",
      "Title": "Bones"
    }
  ]
}