{
  "AuthorID": "sunshine71",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunshine71",
  "Posts": [
    {
      "AuthorID": "sunshine71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunshine71",
      "Content": "well now I know Im not the only one to have a similar reaction to steroids.  It was awful. I had hot flushes that lasted for hours and was burning up from my chest up to my face.  Just kept spritzing myself to keep comfortable.  I was very spaced out for a few days though and at times wasnt sure what was real and what was in my head....very scary.  I found sleep very hard but I was advised to take the steroids early in the day with none after 6pm or sleep would be impossible.  I felt very aggitated on them and not able to cope with my emotions etc. very clearly.  I was so so forgetful and my head was so muggy I couldnt remember simple things.  But good news, once I was finished I was back to my old self very quick and know it was the medications that left me feeling so sleepy.",
      "MessageIndex": 6,
      "PostDate": "27/09/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53198/reaction-to-steroids",
      "Title": "Reaction to steroids?"
    },
    {
      "AuthorID": "sunshine71",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sunshine71",
      "Content": "great to hear you got sorted and feel better.  I told them about my 'side effects' and they thought they were severe enough to just give me one dose pre-chemo of steroids and none after at all.  felt so much better, much more like myself and the nausea was no worse/no better really.  But I could cope with it bettter not on steroids. ",
      "MessageIndex": 8,
      "PostDate": "20/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/53198/reaction-to-steroids",
      "Title": "Reaction to steroids?"
    }
  ]
}