{
  "AuthorID": "SuperReedy",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/superreedy",
  "Posts": [
    {
      "AuthorID": "SuperReedy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/superreedy",
      "Content": "Firstly don't apologise for sharing how you're feeling.  Maybe your family are trying not to treat you differently now you have cancer but are struggling to strike the balance between keeping things \"normal\" and being supportive.  I totally understand how you feel as anytime I share my worries I'm told not to be silly, no one can seem to just listen.  Maybe they want a list to help them divide who will help with what. Although you shouldn't have to, do remind them that you are more than just a person with cancer and want to do those things like going for coffee, shopping and ask to be invited next time. Also explain that you only want help when things are rough not full-time which is why your child will not be going into care.  Here for a chat if you need one.  Best wishes  Alice xx",
      "MessageIndex": 1,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "SuperReedy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/superreedy",
      "Content": "I always wonder if we would speak to family members if we didnt need to haha!  Because I still feel well in myself everyone around me is also quite unsupportive, I'm hoping it will change when I start treatment.  Fingers crossed this chat will make the changes you need to be happening.  Make sure you tell them how all their rubbish and not being there for you is making you feel. If you need to explain it like they're children to make them understand then so be it.  Alice xx",
      "MessageIndex": 4,
      "PostDate": "02/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/112836/support-issues-again-still",
      "Title": "Support issues (again/still!!!)"
    },
    {
      "AuthorID": "SuperReedy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/superreedy",
      "Content": "Hi  Although I can't advise on the pros and cons I can say that the recovery seems quite reasonable.  Im not sure if that's the right word sorry.  When I was in hospital I met 5 ladies who had reconstructions and on the whole they seemed to cope well post op I was surprised to see how well they all did especially compared to me, a 24 year old having leg surgery!  Do what's best for you.  Best wishes  Alice ",
      "MessageIndex": 7,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113836/reconstruction-or-not",
      "Title": "Reconstruction or not"
    }
  ]
}