{
  "AuthorID": "SusieMF",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
  "Posts": [
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "My situation was slightly different in that had total support during treatment and on phased return.  Things changed few months later when i kept getting infections and had a lot of time off.  I was concerned about the amount of time but was reassured they realised that my immune system was low etc until the next infection and I got a disciplinary.  I got fantastic support from my local Maggies centre and they gave me the macmillan book, work and cancer and as aroma mum says we are covered by the disability/equality act.  This book was a great help for me at my appeal.  Hope this helps and take care Sue xx Enter your message...",
      "MessageIndex": 4,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74315/returning-to-work-and-it-isn-t-the-same",
      "Title": "returning to work and it isn't the same"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Hi Frances, I got a lump in my throat reading your message and just wanted to say you are not on this journey alone and we are all here for you. I had my op 5 years ago this coming tuesday the 10th and remember feeling exactly like you.  You have had a big shock and it's going to take quite a while to take it all in.  I had a lumpectomy followed by 8 chemos and 25 radio therapies.  The one thing on the journey Im wishing I had done was kept a journal.  At the time i think it would have been to hard to read but in the years after especially when I went back to work I think it would have been something so positive to read, I was my mums carer as well as going through that journey with little family support as everyone thinks you are doing well and coping, they don't see the emotions you hide from them and let go when you are alone.   I still believe I had more good days than bad and met some amazing people on the journey.   Do you have a maggies centre near you?  And you will get a lot of love and support on here from everyone. Take care and anytime you want to chat or let off steam just say. Susan x",
      "MessageIndex": 2,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/77894/feel-alone",
      "Title": "feel alone"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Hi, Sorry to hear about your mums diagnosis, but like the others have said you just have to be there for her but don't mollycoddle.  Just be you.  My son was with me when I got my diagnosis, 4 years ago ( I finished treatment 3 yrs ago) and he has never mentioned his feelings, when I asked he just said 'lets just get you better mum'  I ended up worrying about him bottling it up and not talking to anyone about it which didn't help me but I'm guessing your mum will be worrying about how you are dealing with this also. With regard to your friends, this is when you will find out who the real ones are.  I met some amazing people on the journey and have made some great new friends who understand.  Couple of my biggest supports were my breast care nurse and  the local Maggies Centre.  I am sure you will be able to speak to your mums nurse and if you are near a Maggies you can drop in at any time to chat or get some info books. Please don't feel alone or bottle things up, there's a lot of support and chat on here when you need it. Take care, Susan",
      "MessageIndex": 4,
      "PostDate": "16/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67198/just-been-told-by-mum-she-has-breast-cancer",
      "Title": "Just been told by mum she has breast cancer"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Hi Caz,. You have explained it so well, the cope and fight.  I also felt I was going through it alone although I met some great girls going through treatment and we still catch up as often as we can, but with old friends and family I felt like I was being the  strong one and supporting them, if that makes sense.  Often I got comments like, oh you're coping so well.  If only they saw behind the closed door, maybe my fault for not letting it show more, but whilst dealing with chemo and rt I had my mum in and out of hospital 9 times and her wanting me to take her to dignatas in Switzerland!!!!   She also booked her own funeral to 'save me'  Still cannot believe that while I was going through all that mum behaved like that although looking back I'm sure she was just scared for me, but a funny way to show it. x",
      "MessageIndex": 14,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63421/all-done-so-what-am-i",
      "Title": "All Done ... So what am I ??"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Hi Caz, Have just joined and saw your post.  I was diagnosed in 2009 and finished treatment 2010.  What you wrote is how I'm feeling and like you feel so alone.  I made some great friends through all this but still feel I can't always share what I'm going through.  Friends and family seem to think now treatments over and back to work that everything is fine. Sus x",
      "MessageIndex": 10,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/63421/all-done-so-what-am-i",
      "Title": "All Done ... So what am I ??"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Hi, I had oral thrush a couple of times when on chemo and Doctor gave me Nystatin suspension which worked.  Hope this helps and take care. Sue x",
      "MessageIndex": 2,
      "PostDate": "24/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84848/any-extra-tips-re-oral-thrush-please",
      "Title": "Any extra tips re oral thrush, please."
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Hi Dianne,   I am 4 years down the road and don't think that fear ever totally goes away.  I think it will always be there at the back of your mind.  As dreamthief says we are much more in tune with our bodies now.  Glad  you've been to your Dr and I hope they have been supportive.  When we are on the journey there is so much support and suddenly treatment finishes and you suddenly feel all alone.  Do you have a Maggies Centre near you, I have met some amazing people and made some great friends, I also go the breast friends support group we have there. Take care and we are all here for you x",
      "MessageIndex": 3,
      "PostDate": "29/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69029/living-in-fear-while-in-remission",
      "Title": "living in fear while in remission"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Hi George and Jackie, Just a quick message to say I've read a lot of your posts and love the advice, common sense and the support you give others. Take care, S x",
      "MessageIndex": 4,
      "PostDate": "29/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69029/living-in-fear-while-in-remission",
      "Title": "living in fear while in remission"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Sorry to hear that, I had mine just after 2nd chemo and so nearly cancelled as felt so ill, but thank goodness I went, gave me such a boost.  Hoping they have kept your name for a cancellation as I was told this often happens because lot depends on day how ladies are feeling.  Fingers crossed you get one before long, it's such a boost to your morale. Take care, S",
      "MessageIndex": 1,
      "PostDate": "30/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69102/looking-good-feel-better-lgfb",
      "Title": "Looking Good Feel Better LGFB"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "Hi, Your body has been through so much in the past few months and while there is every chance the headaches are caused by stress I would get it checked out.  It takes quite a long time to get over all this and I found post treatment harder to deal with , mainly because everyone thought well you've finished treatment and you're back to 'normal' but the treatment is still working inside you.  And at least the Dr can reassure you which goes a long way. Take care and look after yourself, Sue",
      "MessageIndex": 2,
      "PostDate": "23/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67500/headaches-is-this-normal",
      "Title": "Headaches is this normal"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "  Hi Kipper, Just read this and want to let you know we are all here for you.  Like you everyone thinks I'm the strong one and when I was going through treatment (op 4 yrs ago, treatment finished 3 yrs ago) friends rallied at the beginning but then slowly started seeing less and less of them.  They kept telling me how strong I was dealing with it all etc but at end of day we don't have a choice, we just have to get on with it.  And I also wonder if they felt it was a bit too close to home, if I got it who's to say at some stage they  wouldn't and they were in denial.  Here at any time for you and if you would like to chat more, feel free.  Susan Ps im not 53 till end of year so lot younger than you ;-)",
      "MessageIndex": 2,
      "PostDate": "04/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64335/my-experience-so-far",
      "Title": "My experience so far"
    },
    {
      "AuthorID": "SusieMF",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/susiemf",
      "Content": "  Hi Kipper, Just read this and want to let you know we are all here for you.  Like you everyone thinks I'm the strong one and when I was going through treatment (op 4 yrs ago, treatment finished 3 yrs ago) friends rallied at the beginning but then slowly started seeing less and less of them.  They kept telling me how strong I was dealing with it all etc but at end of day we don't have a choice, we just have to get on with it.  And I also wonder if they felt it was a bit too close to home, if I got it who's to say at some stage they  wouldn't and they were in denial.  Here at any time for you and if you would like to chat more, feel free.  Susan Ps im not 53 till end of year so lot younger than you ;-)",
      "MessageIndex": 17,
      "PostDate": "04/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64335/my-experience-so-far",
      "Title": "My experience so far"
    }
  ]
}