{
  "AuthorID": "Suze44",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suze44",
  "Posts": [
    {
      "AuthorID": "Suze44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suze44",
      "Content": "Yes Joan - it's a bit too quick as I've not had chance to get my head around it! Mine was a grade 2 but because of the size of my tumour (5.5cm) I have been 'advised' to have chemo. Really not looking forward to it at all:(",
      "MessageIndex": 2,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83095/hi-and-help-please",
      "Title": "Hi ... and help please!!"
    },
    {
      "AuthorID": "Suze44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suze44",
      "Content": "Thanks for your replies Murphy63 and Dreamthief! I've already had a WLE to remove the lump and had it confirmed that my nodes were clear. I'm really struggling with the fact that the chemo will only improve my survival rate in ten years by 6.9% and I really want it to be higher to make it 'worthwhile' - if you know what I mean?! I'm booked in to start on Friday but am going to have to rearrange this as I'd completely forgotten about going away on Saturday overnight!! As a mum i'm really struggling with not being able to help my kids when they're ill and with the colder weather coming, they will be ill!! There's just so much information to get my head around and I don't feel I've know the full picture yet but i'm already booked in for chemo - is this normal?! Just rambling now so I'll stop - any advice welcome and thanks for the support x",
      "MessageIndex": 5,
      "PostDate": "21/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83095/hi-and-help-please",
      "Title": "Hi ... and help please!!"
    },
    {
      "AuthorID": "Suze44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suze44",
      "Content": "Thank you for all the support, good advice and information ladies - I certainly feel much better today after reading your comments and also having a good, long chat with a wonderful Macmillan bc nurse who walked me through my treatment step by step and made some useful recommendations to help me take control again! I'm cancelling my chemo booked for the 26th and waiting until I've met with the radiotherapist.  As far as I can tell I'm just having FEC so no docetaxel or taxotere - but I'm going to double check! I've got my hairdresser coming tomorrow to cut my hair in readiness for chemo and to advise on wigs and had a lovely offer of support from my very best friend that she will shave her head also!! I've looked into donating my hair to the Princess Trust to help little girls with cancer. All in all, I'm ready for whatever this journey throws at me! The only down side today has been that I've had to withdraw from starting my new job which was supposed to start on the 1st September, which was moved until the 29th September, and now looks me not being able to start until February as its in a school with lots of unhealthy, germ ridden teenagers! But as they need someone straight away I can't really keep asking them to keep it open for me - can I? I'm now looking forward to spending the weekend in Newcastle with my daughter looking at Uni and doing a spot of retail therapy with an overnight stay thrown in! Thanks to you all for taking the time to reply and I'm sure I'll be on here again seeking more advice and information! xx",
      "MessageIndex": 11,
      "PostDate": "22/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83095/hi-and-help-please",
      "Title": "Hi ... and help please!!"
    },
    {
      "AuthorID": "Suze44",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suze44",
      "Content": "Hi I am new to this site and had surgery to remove invasive lobular cancer on 3rd September - 2 days before my 50th Birthday :( I have now been referred to specialists for FEC chemo and radiotherapy and just wondered if anyone can share their experiences of chemo to help me make the decision.  Its been suggested that I have 6 x 3-weekly cycles of it starting next Friday - it's all a bit quick!! Thanks",
      "MessageIndex": 0,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83095/hi-and-help-please",
      "Title": "Hi ... and help please!!"
    }
  ]
}