{
  "AuthorID": "Suziedoll",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suziedoll",
  "Posts": [
    {
      "AuthorID": "Suziedoll",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suziedoll",
      "Content": "Hi The staff doing your radiotherapy will be able to advise you on this as they are the experts. I have just finished radiotherapy and have an appointment in January with the oncologist so I will be asking the how they know it's all away. Susan x",
      "MessageIndex": 1,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145640/radiation-overlaod",
      "Title": "Radiation Overlaod"
    },
    {
      "AuthorID": "Suziedoll",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suziedoll",
      "Content": "Hi  That happened to me and I changed the appointment to a day I didn't have radiotherapy. You can call them up and ask. I was getting a bone density scan. Take care try not to fret too much about it coming back. Look on it as a second chance at life and just live life to the full now  Suz x",
      "MessageIndex": 2,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145640/radiation-overlaod",
      "Title": "Radiation Overlaod"
    },
    {
      "AuthorID": "Suziedoll",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suziedoll",
      "Content": "Hi poops2009 To be honest it really was ok. It's the going to hospital every day that can be tedious but I was lucky enough to be close to the hospital for mine. It is over much quicker than you think it will be.  The staff and comradship of others at the hospital going through it helped me greatly. I drove myself there every day and on a couple of occasions I was a bit emotional the staff were fab. We also had access to an occasional massage and facial. Tell mum not to worry as long as she drinks 2 litres of water daily to hydrate and uses e45 cream on her breast 3 times a day she should be fine.  It's the emotions that sometimes take over but with support of family and friends you find the strength to get through it. Take care Susan x",
      "MessageIndex": 5,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145640/radiation-overlaod",
      "Title": "Radiation Overlaod"
    },
    {
      "AuthorID": "Suziedoll",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/suziedoll",
      "Content": "Hi Fran  I have been on letrezole for nearly four months now.  I decided to take calcium supplement with vitamin d. That has stopped the aches and pains but sweats still bad. Will be seeing the oncologist next Wednesday for follow-up appointment after radiotherapy treatment so will ask what I can do to stop the sweats.  I suppose it's better than cancer coming  back. Will let you know what she says. Suz x",
      "MessageIndex": 15,
      "PostDate": "15/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/146733/sweats-awful",
      "Title": "Sweats awful"
    }
  ]
}