{
  "AuthorID": "Sylvie64",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
  "Posts": [
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "Brilliant tips kiwi_h, thanks for starting this thread! I'm definitely going to take fluffy socks and hot water bottle next time and will buy a heat pad. I was freezing on my first session and shivered the whole way through! Also will try the codeine/paracetamol combination as paracetamol alone did nothing for me. wombat.23 you made me laugh, I had exactly that look last time, icicles dripping off my ratty hair :) x",
      "MessageIndex": 6,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137531/new-cold-cap-procedure-suggestions-to-help",
      "Title": "New Cold Cap procedure (suggestions to help)"
    },
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "kiwi_h any tips on cold cap gratefully received please! Just back from spending most of today in an isolation room in A&E at local hospital. Having had the runs (sorry if TMI) for 4 days plus a temp of 37.9 they asked me to come in. Gave me some penicillin and fluids through an IV as a precaution but luckily my blood tests showed no infection so they've let me come home, hurrah! So happy to be back home again and able to sleep in my own bed tonight! ",
      "MessageIndex": 30,
      "PostDate": "07/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "Hi ladies, I had my first of 6 x FEC-T last Friday. Main side effects are nausea, diarrhoea and tiredness. I've switched from domperidone to cyclizine now which seems to have sorted out the nausea; either that or it's just worn off by itself! Having to take Imodium for the other problem though Like you Ann, I found the cold cap the worst part of the chemo experience. I shivered my way through it with gritted teeth but I had a throbbing headache (despite taking paracetamol beforehand) which lasted for almost 3 days! I'm not sure if this was down to the cold cap or side effects of chemo, or just tension/anxiety. I'm going to see how much hair falls out around day 14 then decide whether I can bear to persevere with it. Maybe stronger painkillers next time would help? Good luck to everyone, hope the side effects are manageable and glad to have ticked the first session off xx",
      "MessageIndex": 16,
      "PostDate": "06/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "Hi star 67 welcome to the group :) Sounds like you're doing brilliantly for day 2, much better than I was! I like the sound of your ginger concoction. Hope you manage to keep the nausea at bay and that you get plenty of rest. Hides, I don't know of a good shampoo for hair growth - maybe that caffeine one with the dodgey looking packaging?! There was someone on another thread who'd had great results using a supplement, think it was Biotin.  xxxx",
      "MessageIndex": 40,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "Hi Lucasjack good luck and I'll be thinking of you tomorrow!! I'm only only a week and a half ahead of you. Just remember any side effects will go so if you do feel rough I can promise you it gets better! For me it was on about day 4 that I turned a corner :) There's another thread with some great tips for cold capping too :) xx",
      "MessageIndex": 45,
      "PostDate": "13/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "Oh no JoDec poor you!! I hope you recover quickly. At least you're in hospital now, not much consolation I realise. Sending hugs xx",
      "MessageIndex": 101,
      "PostDate": "21/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "Hi star 67, been feeling rubbish all week, no energy and very tearful. I had my pre chemo assessment and blood tests this morning and they rang this evening to say neutrophils are low so I have to go back first thing tomorrow for more blood tests. Really hoping they're ok tomorrow otherwise they won't let me have 2nd chemo on Friday and I just want to keep on schedule and get it all over with! Other option is they might reduce the FEC dosage from 100 to 75 then spread it out over 8 sessions instead of 6, this has just happened to a friend of mine. My hair is falling out alot despite cold capping, the consultant said today that this is quite normal and that FEC100 is brutal! xx",
      "MessageIndex": 90,
      "PostDate": "20/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "JoDec omg that sounds awful! Hope you're ok now?? What a way to spend your weekend I'm feeling much better this morning after a good night's sleep.  Thanks kiwi_h, will pop over and have a look at your cold cap thread now xx",
      "MessageIndex": 33,
      "PostDate": "08/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    },
    {
      "AuthorID": "Sylvie64",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/sylvie64",
      "Content": "Hi girls, it's all gone very quiet on this thread, I'm hoping that means that everyone's doing well! I'm day 12 post my first FEC now and apart from being tired to my amazement I'm actually feeling quite well! I can hardly believe it as I spent most of the first week hiding under my duvet :) Just waiting to see if the cold cap has worked. No hair loss yet but am I right in thinking it normally happens around days 14-16? For anyone starting chemo this week, good luck! :)",
      "MessageIndex": 36,
      "PostDate": "12/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137017/september-breast-cancer-chemo-club",
      "Title": "* * * SEPTEMBER BREAST CANCER CHEMO CLUB * * *"
    }
  ]
}