{
  "AuthorID": "Tallantire",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
  "Posts": [
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Aspen  I feel for you having your first chemo before Xmas. Mine was in November and I thought that was bad enough. I managed to buy most of my presents before the chemo started not knowing how it would affect me or how I would feel was a big worry.. in the end I did go.shopping afterwsrds as I found I was ok to do this in the first 3 days. I was aware of potential infection however so avoided busy times and anywhere too crowded. For me the chemo struck me on the 4th day and it has the second time round too which was just over a week ago. I have an 11 year old but my partner works from home and is good at helping with homework and cooking tea. Just do what you can and make things as easy as possible for when you are not feeling that good. Everybody will.understand you have a lot going on and xmas pressies this year may have to take a back seat. Your health is more important and you are not superwoman! Accept any offers of help and take each day as it comes. Listen to what your bidy tells you and try.not to put pressure on yourself. Happy for you to add me as a friend if you want a companion through the journey. Take care x",
      "MessageIndex": 5,
      "PostDate": "16/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144863/just-diagnosed-chemo-about-to-start",
      "Title": "Just diagnosed, chemo about to start"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Sam My liver showed up as abnormal on routine tests as has done previously so I was sent for a scan. Fatty liver disease diagnosed as I suspected try not to.worry altbough much easier said than done! x",
      "MessageIndex": 46,
      "PostDate": "01/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143717/december-breast-cancer-chemo-club",
      "Title": "* * * December Breast Cancer Chemo Club * * *"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Optimistic My ER is 8 X",
      "MessageIndex": 8,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138221/er-6",
      "Title": "Er 6"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Optimistic My ER is 8 X",
      "MessageIndex": 23,
      "PostDate": "19/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138221/er-6",
      "Title": "Er 6"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Mazza I really feel for you, families eh, they dont always come up trumps unfortunately. Try to have distance between you and your dil as her comments sound very toxic, negative and completely unsupportive. You can do without this right now, she sounds as if she i poisening your sons mind and trying to turn him against you. Its all about insecurity but you dont need to fix them or spend energy when you are going through so.much yourself. Concentrate on yourself as you are the only person right now you can rely on and trust. (.of course we are all here for you in this way too )  Do lots of nice things for yourself as you would a friend in this situation. Love and care for yourself. You deserve lots of treats and compassion at this time. I am sorry you have to go to your appointment alone. That isnt nice or ideal. Where are you being treated? Sending a big hug, healing and light. X",
      "MessageIndex": 15,
      "PostDate": "17/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/147273/bit-scared-and-a-lot-angry",
      "Title": "Bit Scared and a Lot Angry"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "I like my holidays and was keen to keep up our regime of breaks away. I was a bit hesitant of going abroad but we managed a lovely break.away before I started my chemo. I was stressed beforehand because of the long journey, driving and not feeling the usual anticipation of a holiday but once we had packed and got there I thoroughly enjoyed it and felt much better than I did at home worrying about my diagnosis and treatment.  I would go with a smile on your face and just switch off and relax, you can forget all about whats going to happen in the next few months and concentrate on your well being putting you in a much better place for surgery and recovery. Life is for living so make the most of every day and do what makes you feel good. Please bring some sunshine back! x ",
      "MessageIndex": 5,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150099/booked-a-holiday-why-am-i-tearful",
      "Title": "Booked a holiday why am I tearful ?"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Alison I am having a portacath fitted on Monday as my veins are very deep and its always a problem to cannulate me. The hickman line was also suggested but I wanted something less intrusive and on show and the port was recommended to me by somebody who's advice I trusted. How did your first chemo go in the end? Xxx",
      "MessageIndex": 8,
      "PostDate": "24/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143208/picc-line-or-not",
      "Title": "PICC line or not?"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi I had a port a cath fitted 2 weeks ago. I.was offered a hickman but choose the port over it so I could go.swimming and improve my fitness. Also I had done my research and comparisons and I didnt fancy the lines of the hickman being outside my body and the worries of infection.  I found it uncomfortable at first and didnt like the feeling of something being planted under my skin it all felt a bit alien like!  I was bruised from the procedure and the anaesthetic in the neck wss probably.the most painful bit being such a sensitive area. Its all settled down now however there were a few problems when having my chemo last week. Apparantly the port has been fitted quite deep.so is not easy to.access with a normal sized needle, a larger one is required. Two attempts were made before the sister was called. The nursing sister seemed quite put out that I had chosen the port over a hickman.and asked me why I had it saying its normally for people having longer treatment. She then said well it will be in forever now and will need flushing frequently.(just as the hickman does) she said its a very invasive procedure you know and I felt like saying yes I know I am the one that has just had it! I told her some close friends had advised it over the hickman and been very happy with it.  I also.said I would be having it out as soon as my chemo is over. She walked off shaking her head and muttering something about friends giving advice. I was a bit taken aback about how she spoke to me but at the end of the day its my body not hers and I do have choice. If you do go for a port I hope you dont get a similar reaction as it made me feel uncomfortable about my choice and this affected me feeling relaxed through the chemo when I was already feeling anxious enough about the first time it was being used. To be honest she was a bit of a battleaxe and said something totally inappropriate to me later about another issue. Maybe she was just having an off day and taking it out on me or maybe she has just been.doing the job for so long she has lost touch with her professionalism and bedside manner. I would be interested to know what you decide in the end and the reaction you get afterwards. Take care Xxx",
      "MessageIndex": 4,
      "PostDate": "09/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144255/picc-lines",
      "Title": "Picc Lines"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Wow what a great thread and so many amazing makes! Classing myself as a creative person I love looking at all your crafts they have really put a smile on my face this morning! Leolady I love your paper piece quilt and 2 fingers up to the stuck up woman who said it was cheating!  Your quilt is really nice and you are very talented to.make this. I make rag quilts and when I mention it to traditional quilters they look at me as if to say thats not quilting but it is and it appeals to me more. I am proud of my crafts they are individual and represent me. Having chronic fatigue it takes me longer than most to complete them but I love to make things and have sold at fairs and markets in the past. Will post some pics when I can work up the energy to get out of bed! Well done ladies! Xxx eolady Your quilt is lovey and ",
      "MessageIndex": 154,
      "PostDate": "17/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Iceberg I had an oncotype result of 32 putting me in the high bracket, ER+ of 8, 18mm invasive grade 3 tumour, clear margins and no involvement in lymph nodes. I resisted chemo at first despite it being recommended but then agreed due to persuasion by family and comments by friends. I am now 4 cycles off finishing and have been in contact with cats, dogs and school children throughout. Have never picked up an infection but have been very fluey throughout but that possibily due to another health issue I have. Yes you have to check temp regularly but you would also know if you were ill enough to warrant a trip to hospital with suspected sepsis.  If you felt well enough for walking dogs it would be good exercise and be nice for you to get out in the fresh air. You need to keep some normality and still do some of the things you enjoy through chemo if you can otherwise it will drive you mad. Yes its only 6 months out of your life plus more if you have had an op, but it can feel a long time if you lifestyle is changed completely and you dont work or do the things that give you pleasure. x",
      "MessageIndex": 14,
      "PostDate": "25/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150997/onco-test-results",
      "Title": "Onco Test Results"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi I had very thick long hair before being diagnosed. I had 5\" cut off just before starting chemo 4 weeks ago. I have been using the cold cap and was told there was a 50% chance of me losing/keeping my hair. It started coming out in small strands just over 2 weeks ago and is continuing to do so even more after straightening it one day which I know wasnt advised but it was for a special occasion. I have accepted that I will probably lose it all but I am not ready to shave my head as I just want to keep looking 'normal' for as long as possible. Its very important to make sure you get the correct fitting of the cold cap and I am wondering if mine was not tight enough on the first round. From what I have heard its also luck of the draw some people keep their hair with the cold cap, others dont. I was also advised not to wash it much or brush it. My hair used to be my crowning glory and I was devastated when I found out I had to have chemo. At the end of the day though its just hair and it will grow back. I would much rather my hair be lost and return than the cancer. X",
      "MessageIndex": 2,
      "PostDate": "11/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144498/loosing-your-hair",
      "Title": "Loosing your hair..."
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Well done Wendy for organising this. Touched by your compassion. A big hug from me.  Xxx",
      "MessageIndex": 6,
      "PostDate": "24/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/138509/worlds-biggest-coffee-morning",
      "Title": "Worlds Biggest Coffee Morning"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Blaster Sorry you have a sore throat, I have lots of them and this current one has been going on for a few weeks now. It goes for 1 day then returns. I also found it did after my first chemo but I did get.a lot of sore throats before chemo too. I was given a mouth wash by one of the chemo nurses and when it wss at its worse it was discovered I had thrush in my mouth sonI was prescribed Nystan which helped a lot. I was taken into A&E after my first chemo as it was thought I.might have an infection. Turned out it was viral n the end but spending the night in A&E wasnt pleasant but they have to follow protocol for testing for neutropathic sepsis. Drink lots, i had a stash of Yoo.Moo yogurt lollies they are lovely. I also sucked mints and chocolate limes to take the horrid taste away! Take care x",
      "MessageIndex": 6,
      "PostDate": "24/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145299/advice-help-needed",
      "Title": "Advice /help needed"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "I suffered a very dry mouth throughout chemo (still ongoing) and got mouth thrush. As well as swigging ginger beer like it was going out of fashion I would wake in the night and suck on boiled sweets and werners originals. I also.drank a lot of warm milk.and honey as have an extremely painful throat constantly and I  bought Sainsburys out of Yoo Moo yogurt lollies as they were so lovely and refreshing. I cant imagine why this would continue after chemo has finished.but as I say I dont know as I have 5 more cycles to go yet :-( x",
      "MessageIndex": 5,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150076/dry-mouth",
      "Title": "Dry mouth"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Lennie I would be grateful.for the R1 gel sachets if you still have them please as I am due to.start radiotherapy in October. I cant work out how to message you though without adding you as a friend first. Thank you x",
      "MessageIndex": 4,
      "PostDate": "28/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136764/my-radiotherapy-experience",
      "Title": "My radiotherapy experience"
    },
    {
      "AuthorID": "Tallantire",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tallantire",
      "Content": "Hi Harridamen My sister was 29 when diagnosed and is still here today aged 56. I have grade 3 IDBC and have a 12 year old plus 3 older children. It is so scary when you first find out and your hesd is all over the place but things do calm down and you kind of accept the journey you are on as you have no other options and being stressed is not good for cancer. What support have you got? Its so important and its proven that people with good support do better than people without. Try to take one day at a time and talk, talk, talk as its not got to.bottle it all up. This site should help, its very good and there are some lovely ladies on here. Sending a big hug Xxx",
      "MessageIndex": 8,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150508/newly-diagnosed-grade-3-two-lymph-nodes-29years-old-please-help-me",
      "Title": "Newly diagnosed grade 3 two lymph nodes 29years old please help m..."
    }
  ]
}