{
  "AuthorID": "taralou",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
  "Posts": [
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Dolina, again not the same as you however biopsy showed my lymph nodes clear, had lumpectomy and they found some were cancer. Had lymph node clearance and again results showed more again. Thus put me into chemo which I was not due to have originally. Think they do chemo to be sure if any minute bits might have got away!!! None of this is easy but great community on here for any problems, moans, groans etc.  Goid luck and take care xxx",
      "MessageIndex": 2,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149161/can-anyone-help-me-please-with-lymph-node-question-please",
      "Title": "Can anyone help me please with lymph node question please."
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi I am due for a Zoledronic Acid Infusion tomorrow and wondered if anyone else has had this done? The Onclogist said hardly any side effects and should be fine however, a friend has said her mum-in-law had it and was quite poorly for a few days. So, any advise or info would be very gratefully received!! Many thanks xx",
      "MessageIndex": 0,
      "PostDate": "07/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169393/anyone-had-a-zoledronic-acid-infusion",
      "Title": "Anyone had a Zoledronic Acid Infusion???"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Dreamthief; AnnieH1; collies; Boobylou; ArgyMargy; oks; Hi All Just an update on my zoledronic acid infusion which I received on Monday. All went well as most people have said about 15 mins with a flush either side of it. More than anything I noticed the difference with no Picc line as had to have the dreaded cannula!!! On Tuesday I noticed the ‘flu like symptoms’ arrive. A couple of painkillers and all was OK. Had it again on Wednesday but soon went. The couple of things I have noticed was firstly, I was not firing on all cylinders if you know what I mean. Just concentration levels seemed to have dropped considerably. Have got to Saturday (today) and everything is ok. Secondly, and would like advice on (hence I have tagged you Dreamthief!!! Before the ZA treatment and since chemo and RT I have had pain in my arm going all the way down to my fingers. This was waking me up at night as the pain was so severe. My fingers were/are numb and tingly. I mentioned to the Oncologist and he just passed it off as common side effect. However, since the infusion of ZA on Monday my fingers have got worse. The pain and numbness is apparent every morning and eases slightly as the day goes on. I would be grateful for any advice if anyone else has experienced this? I will be speaking to my BCN on Monday as am starting to get a little concerned. The Macmillan website states: Increased pain Sometimes pain in the affected bone can become worse for a short time when you start taking zoledronic acid. If this happens, your doctor can prescribe painkillers for you until it wears off. Flu-like symptoms These include a high temperature, chills, and pain in your muscles or joints. Let your doctor know if these effects are troublesome. It may be helpful to take mild painkillers. Numbness or tingling around the mouth or in the fingers and toes. Funny thing is I got through chemo with nothing untoward,  just the ususal side effects and feel I managed the majority of it pretty well (no hospital visits etc!!). So this is quite puzzling!!  ",
      "MessageIndex": 7,
      "PostDate": "13/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169393/anyone-had-a-zoledronic-acid-infusion",
      "Title": "Anyone had a Zoledronic Acid Infusion???"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Thanks ArgyMargy and oks. Thought my Oncologist was probably right but wanted to check. Also because I'm back at work now didn't want to have to phone in sick after only being back a couple of months!!. I'm sure it will be fine, thanks for your good wishes. Take care xxx",
      "MessageIndex": 3,
      "PostDate": "07/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169393/anyone-had-a-zoledronic-acid-infusion",
      "Title": "Anyone had a Zoledronic Acid Infusion???"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi thanks for your reply. I am due to have these every 6 months so would imaginecis the same!! soon find out later today!!!!",
      "MessageIndex": 6,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169393/anyone-had-a-zoledronic-acid-infusion",
      "Title": "Anyone had a Zoledronic Acid Infusion???"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Ahhh Leolady56  Our thoughts will be with you tomorrow, you will be fine and just remember all the advice and kind words you have shared wih us all these last few months to get us all through it. Don't think you are going to feel like galloping much though   ha ha Take care and BE POSITIVE  xxx Hugs and kisses",
      "MessageIndex": 10,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122864/chemo-farts",
      "Title": "Chemo farts"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Yes Leolady56  wishing you all the best for tomorrow  take care and stay positive ",
      "MessageIndex": 20,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/122864/chemo-farts",
      "Title": "Chemo farts"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi PennyL   Well done on being so honest with your emotions, it has certainly made me think!!! I have had the surgery, over halfway through the chemo (just waiting to ring that bell) and then 3 weeks of rads. Like jacks77 can't wait for it to be over but, I suppose, we don't really know what this means until it IS over!! We are so comsumed with the inital diagnosis, appointments, scans, chemo etc etc we just want to see the end of it and think YIPPEE all done............but is it??? This is when the emotions go into overdrive I suppose. We all think how well we are doing but there is so much support around you which in a way protects you and I suppose you feel a bit on your own when it is all over. I tink your post is sooo important to all of us and make us sit back and think where we will be a  years time Well done Alison xxx",
      "MessageIndex": 135,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154014/april-2018-radiotherapy-club",
      "Title": "☢☢☢ April 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi fern2018 Don't know anything about fasting and would be interested to hear from anyone on here if they have fasted. I had 7 rounds of chemo and didn't feel sick at all as the sickness  tablets they give you are very good. I would also be concerned about what you read on the net as it is not always accurate. Also your Oncologist/Oncoolgy nurses might not approve as you need to eat the right foods for your energy levels, blood count, immune system etc. Please note this is only MY opinion and I'm not an expert and can only speak from experience. Good luck to you if it works for you and your OK then go with it!! xx",
      "MessageIndex": 1,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169437/is-anyone-trying-fasting-restricting-calories-before-chemo-to-reduce-side-effects",
      "Title": "Is anyone trying FASTING (restricting Calories) before chemo to reduce..."
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi PennyL I think your post raises more thoughts regarding what your BC said. I do think that is quite true. Watch this space when I finish this ‘journey’ I too have been told how strong I am well you know what? You don’t see the bad days only DH sees those not even the kids!! Right or wrong I don’t know but works for me. Good luck with your treatment and thanks for your post xxx",
      "MessageIndex": 179,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154014/april-2018-radiotherapy-club",
      "Title": "☢☢☢ April 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Queenfisher, Sorry, I have popped on here as will be starting rad's soon and also because of the post by Alison. I would like to say how true your post is as well. I have had much the same situation as in thinking of everybody else (family, colleagues etc) and we don't give ourselves a chance until something happens, as in your case, a fall, nothing major but it goes to show our emotions are bubbling away waiting to erupt. Thank you for posting, I keep thinking I can't wait to get to the end of this however, we truly don't know how we will feel until we are there. Take care and good luck xx",
      "MessageIndex": 153,
      "PostDate": "23/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154014/april-2018-radiotherapy-club",
      "Title": "☢☢☢ April 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi NikkiT1204 I had lumpectomy after diagnosis and they removed 3 lymph nodes at the same time. Up until then I was told lumpectomy and radiotherapy and that would be it. Oh no..... the 3 lymph nodes 2 were infected so I had a complete lymph node removal followed by chemo, RT and now on Letrozole. I am sure they know what they are dealing with when they are offering chemo instead of another op, the chemo should get rid of any strays. I would also advise you try and take someone with you to your appointments so that what you miss they will remember. Hope all goes well for you on Wednesday and be sure to llt us know. Take care xxx",
      "MessageIndex": 11,
      "PostDate": "27/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170579/found-in-lymph-nodes-following-wle",
      "Title": "Found in lymph nodes following Wle"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Just thought I would show you a couple of things that have kept me amused the past few weeks:                     Knitted Knocker, have done about half a dozen of these so far in pretty neutral colours. Will take them to Oncology dept in a couple of weeks. A citrus coloured monkey for my granddaughter                                                              AND..... a small selection of wash/dishcloths I have been knitting for the girls at work .. By the way the last one is the Breast Cancer Ribbon of Hope. Hope you are all having a good day no matter what your doing.",
      "MessageIndex": 0,
      "PostDate": "01/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154039/my-latest-knitting",
      "Title": "My latest knitting"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Staffylove,  I'm very very lucky as my DH does them for me. Like you, I am not squemish but would never have been able to do them myself. I'm sure the nurses are quite used to it.",
      "MessageIndex": 1,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154548/immune-boosting-injections",
      "Title": "Immune boosting injections"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "                                        Think we should all adopt one of these as our own special mantra!!!",
      "MessageIndex": 0,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154547/some-positive-quotes-to-help-us-along",
      "Title": "Some positive quotes to help us along"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Didn't think about a vote Bigguy, I'm sure we can if that is what people want to do. I just thought some were quite apt and adopt one that you like personally!!",
      "MessageIndex": 2,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154547/some-positive-quotes-to-help-us-along",
      "Title": "Some positive quotes to help us along"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi JammyR  Can't really answer your question but I'm sure someone will be along soon with more info. I will say I didn't use the cold cap and my hair loss started about day 15 but I have not had an itchy scalp just quite red and tender. There have been quite positive results on here with the cold cap so wouldn't give up hope just yet!! If type cold cap in the search box you will find lots of responses on there. Hope all goes well for you xx",
      "MessageIndex": 1,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150207/itchy-scalp",
      "Title": "Itchy Scalp."
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi DL, Many thanks for your response. I am doing the exercises and trying to walk as much as possible. Nice to know that this seems to be quite normal. If no better by tuesday will call my breast nurse just to make sure. Good luck Taralou",
      "MessageIndex": 46,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi all, very new on here and am really comforted by all the posts on a variety of different things (obviously all cancer!!). Like Jacmatholmad I had clearance on 20th Dec and waiting until the 8th to get results. My oncologist has already told me I will be starting chemo in the new year. I am assuming that whether the lymph nodes come back clear or not it is a precaution. I would like to ask anyone who has had a clearance. It has been a 10 days since op and all was well up until a couple of days ago and I now have swelling under the arm, under the scar. Is this normal? Is it just swelling from op or something else as in lympedema? Many thanks for taking the time to read this and good luck to EVERYONE in 2018, we will all get well!!",
      "MessageIndex": 41,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Jac Thanks for your response. I have heard about seroma and believe the oncologist mentioned it some time before the op however, will call my breast nurse on Tuesday just to be sure. Many thanks and good luck Taralou",
      "MessageIndex": 47,
      "PostDate": "30/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/145280/axillary-node-clearence",
      "Title": "Axillary Node Clearence"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Moomc Had to laugh reading through your list of do's and don'ts. I have not been told ANY of that at all, so strange. I would also mention that I go to my appointments from work so I am deodrant and moisturised up and there have been no complaints!!! Very weird this information given (or not as the case maybe) as it maybe different trusts we are all attending but they are still using the same machine for our treatment!!! My theory is that some hospitals have maybe had complaints when someon has had a bad reaction to RT so they tell you everything to cover themselves. Just my thoughts. Yes, I am having 15 as well, so 2 down 13 to go!!! Can't wait for this to be finally over, I have REALLY had enough now and have days when I feel totally sorry for myself and wallow in it and have a good cry. I am still so very tired and this heat is just killing me. I have always loved the sun and always out in it. Now, I'm not in the least bit interested as is far too hot. I just sweat all the time (not very ladylike I know!!). I know we shouldn't go in it anyway but I'm not even tempted which is so unusual for me. Ah well that's my moan over with. Good luck with the rest of your treatments, they are easier and quicker after the first.",
      "MessageIndex": 55,
      "PostDate": "08/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi everyone I'm in as well!!! Should have started today however, machine broken so cancelled first one until tomorrow,  fingers crossed all fixed as want to get this over and done with and is now taking me into a fourth week with today's cancellation!!! I haven't used anything in preparation, they told me at my planning appointment they would give me creams so will wait and see. I have also been told by a friend who went through this 2 years ago that Aloe Vera Gel is very good. Just going to go with the flow and see what happens. I don't usually burn very easily so here's hoping!!!1 My onco did say about not going in the sun and if on holiday to wear a big brimmed hat and a scarf round my neck as will be zapping there as well. God only knows what I will look like on holiday ha ha. Didn't know about swimming though. Thanks Leolady56, moomy, toxophilite and anyone else I have missed for the essential advice on here. Will be back to let you know how I get on.",
      "MessageIndex": 22,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "So strange toxophilite different things told to people!!! A lot, I think, is down to commmon sense and knowing your own body. Not much irritates me so I'm lucky,  but will keep any eye on the breast and if it is irritated I will change whatever I'm using.",
      "MessageIndex": 57,
      "PostDate": "08/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Leolady56 Trying to visulise you as Maid Marian, I'm sure you were perfect!!! Glad you mentioned the sore nipple as I went for number 4 today and metioned this to the RT ladies and said yes, perfectly normal, now, of course, after the 4th it's hurting all the more!!! Moomc ; XjulieX; Israel Now on 4 out of 15 and as mentioned have a sore nipple. Appointments are easier now as you know the routine and what is expected of you. I have only been given appointments for RT and nothing else. No skin or physio or consultant??? I'm in the South East. Good luck to everyone on this last part of the journey...",
      "MessageIndex": 65,
      "PostDate": "10/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Had my first zap today at long last as should have started Monday but machines broken!! Lot of faffing about taking measurements again and x-rays. First one they were unhappy with and asked if I had noticed any changes to my breast in the last couple of weeks?? I said no I hadn’t but worried me slightly but then the next one was fine and then got zapped!! Not sure about appointment times yet as will get them tomorrow for next week. Hoping they are afternoon as that is what I have asked for to fit in around work. Happy zapping days everyone!!!",
      "MessageIndex": 36,
      "PostDate": "05/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Moomc , I think I am 2 days in front of you as I have my 3rd zap tomorrow. Like you when I had the first treatment didn’t even know it had been done and the same with the second!! I also had the same problem at the planning appt as was so, so long my arms went from pins and needles, numbness and then hurting as no feeling left in them!! That was awful. Must say apart from that everything has been fine so far. XjulieX I was a little bit worried about the breathing especially for 20 seconds (odd smoker as well) but I surprised myself and just about managed it. You will be fine, I think I had to hold about 2/3 times during actual treatment. I would also like to mention that I had seen on here about swimming so asked the radiologist and she said yes it was fine to go just that it could cause irritation and to keep an eye on it if I did swim. As for cream they, very reluctantly, gave me a tube of something (sorry, can’t remember the name) but was quite happy me using my usual unless I get any irritation. As others have mentioned different protocols for different trusts. Mine are very laid back!!! Not sure if that is good or bad but they make me feel welcome and relaxed.",
      "MessageIndex": 53,
      "PostDate": "08/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "My diagnosis is lobular cancer and I am certainly not giving up. Mum needs your support right now. As I’ve found out from the wonderful community on here it will be emotional with ups and downs but between you you will make it through. My only advice is if your feeling low talk on here EVERYONE will listen and respond. Your not on your own and best of luck to mum Xxxx",
      "MessageIndex": 3,
      "PostDate": "30/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148603/lobular-breast-cancer---concerned-daughter",
      "Title": "Lobular Breast Cancer - Concerned Daughter"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi toxophilite, very interesting article. I have just read it and must say I'm not too surprised as thought the immune system would take a while to recover when you think of what is being pumped into us for a fairly long time!! I also went further down the page and clicked on another article about hints and tips for side effects. Again, I think most of what was written we are aware of, but still good to read.",
      "MessageIndex": 1,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154555/immune-system-and-chemo---interesting-article",
      "Title": "Immune system and chemo - interesting article"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "I was approached by my radiography hospital a few weeks ago as to whether I would be willing to take part in a trial for a new drug called Abemaciclib. My first reaction is 'YES' of course, anything that can help I'm willing to give it a go. The drug is being trialled for patients with early stage HR+ and HER2- breast cancer. The idea is you take it alongside either Letrozole, Tamoxifen etc. The reason for this is to see whether taking this decreases the proportion of relapses after surgery compared with adjuvant endocrine therapy alone. I thought this sounded great and said I would participate. Anyway, after much tooing and froing (I was on holiday as well) they are still asking me to take part but I think I have had a change of heart and feel really bad and guilty  about it. The reason being are the side effects are almost as bad as chemo and I just don't think I can go through all that again. I am just getting back to feeling 'normal' and am back at work and thinking I can't start going sick after all the time I've had off with surgery and chemo etc. Would love to know if anyone is on this or just your thoughts????",
      "MessageIndex": 0,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169431/has-anybody-been-asked-to-do-a-trial-for-the-drug-abemaciclib-aka-ly2835219",
      "Title": "Has anybody been asked to do a trial for the drug Abemaciclib (AKA..."
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi fern2018. Many thanks for your reply. Yes, I know it is a voluntary trial and and can say no it's just the guilt feeling which I know is silly. You are right, I am just getting back to 'normal' and the side effect with this trial were quite horrendous and, as you stated, all the extra hospital visits, scans, blood tests etc etc whould really wear me down. Thanks for the support!!!!",
      "MessageIndex": 3,
      "PostDate": "08/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169431/has-anybody-been-asked-to-do-a-trial-for-the-drug-abemaciclib-aka-ly2835219",
      "Title": "Has anybody been asked to do a trial for the drug Abemaciclib (AKA..."
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "How I wish I had somewhere as beautiful as that to walk to!!!",
      "MessageIndex": 141,
      "PostDate": "05/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Ahhh mrsox145 for trainers?? I think that is chemo brain and bird brain and tiredness ha ha xxx",
      "MessageIndex": 260,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "mrsox you will put me to shame going back to work!!! I can’t face that yet!!! I find loads to do and wondering how I had time to go to work before BC!!!! good luck with your manager and only do what suits you, don’t get talked into too much!!! xxxx",
      "MessageIndex": 262,
      "PostDate": "12/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Canon I have just started knitting knockers so I must be a sweet lady!!!! xx",
      "MessageIndex": 321,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi @violetsniff love the pictures very pretty looking old town by the look of it!! Wouldn’t know where it is and would only guess as Windsor because of the royal wedding??",
      "MessageIndex": 920,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Ahhhh WhatHappened   Such a sad, sad story, reading it has brought tears to my eyes. Just remember,  you did all you could,  at least when the fox passed away it was comnfortable and not left out in the cold to be eaten by other animals. Horrid I know but that's what would have happened. So, at least you gave it a better send off and you should be PROUD of that. Not many of us going through this ordeal  would venture out into the woods so, WELL DONE YOU - you deserve a medal. Please don't beat yourself up over this. Just changing the subject I was on Letrozole before chemo and was told not to take it while having the treatment. Didn't have any side effects before however, are any of you taking this while on chemo?? Just wondering.. WhatHappened  a great big hug for what you have done today....",
      "MessageIndex": 325,
      "PostDate": "16/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "mrsox  brilliant, love them!!",
      "MessageIndex": 383,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "mrsox   You are an inspiration to all of us with your daily updates!! Can I just ask you to PLEASE STOP posting things like sausage and egg butty, I really want one now and have no sausages!!!! Its not fair.",
      "MessageIndex": 300,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Leolady56 Sorry to hear about the cancellation of your holiday Lindsay. Is it the breast cancer keeping the price up or something else? I only ask because when we went to Tenerife (not South Africa I know!!) I went on the comparison websites and they were hardly any more than what we would normally pay. This surprised me but when answering the health questions they did ask if treatment was finished. This must make a difference as they way I see it is, you go on holiday find a lump and wait until you get home to do anything about it. I mean it doesn't make you ill or anything. Not sure if I'm making sense here or just waffling, sorry!!! Maybe I should stop!!!! xxx",
      "MessageIndex": 2480,
      "PostDate": "17/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Absolutely beautiful Leolady56",
      "MessageIndex": 897,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Ahhh Flossie25 I have also been attmpting the wii fit!!!",
      "MessageIndex": 2869,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Ahhh ~mrsox   I hope Roland is OK. Hopefully the fish and chips will cheer hiim up!!  Animals -- I have a cat,  very old now and she has moments when she doesn't eat and just sleeps all day and I think right she's on the way down then, a couple of days later, perks up and drives me mad eating all day and wanting to keep going in the garden. I have to let her in and out of the back door,  even though she has a cat flap,  but now she's old she won't use it.  'Too posh to push' we have renamed her!! Best of luck with the hair loss as well, Been there done that!!  ha ha Take care and love to Roland  xx",
      "MessageIndex": 367,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148487/walking-back-to-happiness",
      "Title": "Walking back to Happiness"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Shellian   Have just read your post and feel very sorry for you as you should not be going through financial hardship in this day and age and trying to battle cancer as well. Without knowing your circumstances fully you said you have previously worked? If so you can claim ESA for up to one year based on your NI contributions whether you have a partner working or not. If he is not working you need to tell them regardless of the self employed status and he can also go on the claim with you (as a carer??). I work at the jobcentre but NOT the benefits centre so I know a little. I hope his may help. If you would like to ask any questions then please do however, I recommend you call the ESA claim line asap and make your claim. This will not help your recovery until you get help.",
      "MessageIndex": 20,
      "PostDate": "22/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153174/i-just-cant-take-anymore",
      "Title": "I just cant take anymore"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "toxophilite    Hear hear wise words",
      "MessageIndex": 7,
      "PostDate": "09/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149509/anyone-feel-like-this",
      "Title": "Anyone Feel Like This"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Veronica14, I have been thinking about applying for this as well. The only thing I can say is to reiterate what others have said and to also add my own advice (for what it might be worth!!) I know that claimants on ESA this is what they can expect and the main thing from their assessments is: They are asked to travel a fair way - this tells the doctors how bad is this person if they can travel here was it by bus/train/car etc. They are nearly always upstairs - they watch claimants if they use the stairs or lift. They are normally kept waiting a long time - again they are watched to see how they handle the waiting ie sitting/standing etc When they eventually get in to see the doctor they say a lot of what they tell them is ignored so be aware you make your point quite forcefully if you need to. I think from the above you can see what they are looking ie if you cannot walk how did you manage to walk upstairs? And yes, this is true. Unfortunately, the 'fiddlers' of the system don’t usually have a brain and have stated they can’t walk more than 10 yards however they have been seen walking upstairs!!! And all other similar. I did say this was ESA but I’m led to believe it would be similar for PIP. As you are genuine you don’t have much to worry about just remember they are there to declare you fit, the onus is on you to prove otherwise. As with everything you will need to exaggerate your symptoms, sorry but it’s true. Definitely take someone with you Wishing you the best of luck and please let us know how you get on.",
      "MessageIndex": 6,
      "PostDate": "17/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155266/does-anyone-know-anything-about-pip",
      "Title": "Does anyone know anything about PIP?"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Gablegirl  I really commend your response to the PIP outbreak!!!  I think it will be very helpful and positive to people who are thinking about going down this road. I responded previously about my experience with ESA and have spoken to many assessors about the rules and regs. I know it sounds harsh what they do but in my experience 50% of people claiming ESA ( I can't speak for PIP claimants) are not entitled to it and are quite proud to be climaing this benefit and know all the tricks to use at assessments. Then again, there are the 50% of people who are entitled to benefits and have to fight hard to get them sometimes as with  Dayityrose. So I do try to understand both sides of the coin so to speak. Well done for opening our eyes to being an assessor in a thankless job!!",
      "MessageIndex": 27,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155266/does-anyone-know-anything-about-pip",
      "Title": "Does anyone know anything about PIP?"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Just popped in to say hello and welcome to all of you starting your chemo journey. As Leolady56y says no problem is too big or small and we are ALL here to support you through this. Weeblemum is right,  ring the chemo unit with anything that concerns you, always better to be safe rather than sorry. Most of us have all been where you’re right now and between us we will all have had similar SE so can sympathise and offer advice. Best of luck and remember to keep posting for support (or anything else). Leolady56 I’m sure your bum is not that big that you can’t fit another couple in !!!! Wishing you all the best of luck xxx",
      "MessageIndex": 149,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hear hear Aspen  I feel exactly the same would have gone mad without the support everyone offers here. Luthien  please please do not google wait for your appointment with the professionals.  I can say this wholeheartedly as google is my best friend, my ‘go to’ for everything and anything however, when I got my diagnosis I didn’t for some reason google anything and just waited to see consultant, BCN, oncologist etc.  I know in my case, and have heard other people say the same thing, that it is all a bit surreal at the beginning and I know I had no pain, illness etc and just carried on as usual and had to keep reminding myself ‘err I have breast cancer, have I?’ Keep posting on here with anything or everything that’s what we are all here for good luck with your results  xxx",
      "MessageIndex": 5,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150192/just-back-from-follow-up-appointment-after-mammogram---bad-news",
      "Title": "Just back from follow-up appointment after mammogram - bad news!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Snowys Mum I know this is an old post but I am looking into taking CBD+oil for my back pain and was wondering if it would have an adverse effect on the letrozole I'm taking. If I am correct you are on Letrozole and taking the oil as well and you are OK? Any advise will be greatly received!!! I have finished all chemo and radiotherapy treatment and since it has start ed to leave my body all my old aches and pains are coming back with a vengeance!!!  Which I think is down to the Letrozole mainly however, I do suffer with Spinal Stenosis and think the chemo kept it quiet for a while!!! By the way I am due to see the Oncologist at the end of August but don't want to wait that long to ask so maybe my BCN could advise? Many thanks and take care",
      "MessageIndex": 9,
      "PostDate": "11/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127077/don-t-think-i-can-cope-on-letrozole",
      "Title": "Don't think I can cope on Letrozole"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "So, chemo all finished and ready to start radiotherapy today. Had an appointment for12.45. Sitting at daughters with a cup of coffee and they call to say machine is broken so will need you to come in at 3pm. Great....the hospital is miles away and will now catch all the 'going home'/rush hour traffic on the way home. Thought about coming home for a while, which I did only to receive another call to say machine still not working so cancelled until tomorrow at 3pm!!!! Now an extra day tagged on the end before I even start. Have to call tomorrow morning to make sure it is working!! Can anyone advise me how to join the July radiotherapy club please?? I have joined the general radiotherapy one but cannot find a link to join the July one.",
      "MessageIndex": 0,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160785/new-to-radiotherapy---cancelled-1st-appointment",
      "Title": "New to radiotherapy - Cancelled 1st appointment!!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi lesleyhelen, many thanks for your response and yes, makes sense that if there is a gap between treatments it will help the healing process. I haven't got a problem with the cancellations as I do understand machines break down. However, TODAY is another story. I got a call this morning from the radiology department to say that the machine should be fixed in time for my appointment but 'carry on with your day' and I will call you later. No phone call so I called at 1pm and asked about my appointment, yes, machine all fixed come in at 2.50? No, my appointment is for 2.15, No come in for 2.50. OK I will. It is a 45-minute drive to the hospital so I am three quarter of the way there and I get a call to say, sorry we need to cancel your appointment!! I said that I had been told to come in and am nearly at the hospital, ok she said come in and we will see you. EXACTLY 5 mins later another call (same girl) said we must cancel as your team who are going to do your treatment are not in today??? I asked why I was not told this before and explained that I was just about at the hospital by now. Ok she said again come in and we will see you. Got there and waited a couple of minutes and a guy called me. Went in and took me to a 'quiet room' and he explained that as the machines had only just been fixed they had a backlog of people waiting since this morning (??) and would not be able to do my treatment today. He did apologise and went through all the excuses blah blah blah. Am now booked for tomorrow AGAIN!!! It’s such a shame as up to now I could not fault the NHS for the care and treatment I have received but this leaves a bad taste as the second call the girl was obviously lying about the team not being there. I hate liars and it was a bad excuse because if that was the case I would have been told this morning. So will wait and see what tomorrow brings!!!!",
      "MessageIndex": 5,
      "PostDate": "04/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160785/new-to-radiotherapy---cancelled-1st-appointment",
      "Title": "New to radiotherapy - Cancelled 1st appointment!!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Thanks toxophilite Have just posted on there.",
      "MessageIndex": 2,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160785/new-to-radiotherapy---cancelled-1st-appointment",
      "Title": "New to radiotherapy - Cancelled 1st appointment!!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi jenny grannylara Love your baby items, such a gorgeous pink!! Never tried cross stitch, my mum used to do it a lot and have often thought I should try to learn. Mybe this is the right time!!! Lovely cross stitch though with the ribbon of hope Take care Oh, Picc line went well, better than expected! xx",
      "MessageIndex": 3,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Well, I think they are brilliant mrsox  Even more so as you taught yourself. Sorry about getting you muddled with the pics, I really though you had posted something. Can't make the excuse of chemo brain as we all have that! Im now off to try and attempt some 'Knitted Knockers' Have a good day everyone and here's a hug....",
      "MessageIndex": 23,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Tigermum  That is absolutely beautiful, if ever it needs a home i will send my address!! That will look stunnikng on the wall xx",
      "MessageIndex": 61,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "I'll forgive you Tigermum as it is on your wall. Lovely to wake up to Good luck with your knitted knocker!! xx",
      "MessageIndex": 64,
      "PostDate": "21/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Just thinking ladies, as we are all going through much the same journey that we should have a thread on here for crafts. I am sure there are lots of you knitting, crocheting, sewing etc to keep the dreaded side effects at bay and help us cope day to day. I personally knit and have posted on here some of my knitting. Would be nice to see/hear what other people do. We could share pictures, hints and tips as well So I will start with a couple of things I have done in the last few days. This is my slouch hat that I finished on Friday night. Will be wearing it for the first time today!! This was on the needles saturday night ...... And finished saturday night.    A little headband/earwarmer for my granddaughter. I am now off to have my PICC line inserted ready for 2nd round of chemo tomorrow (!!!!!!):) Hope to see lots of pics when I come back!! Have a good day everyone  xx",
      "MessageIndex": 0,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Snowys Mum  love the jumper, cables are brilliant, looks nice and cosy. Can’t get into knitting ‘big’things just stick to kids and toys and the odd dishcloth!!",
      "MessageIndex": 20,
      "PostDate": "14/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "well Canon  there’s a challenge find a knitted nose warmer!!! Google ‘pixie dust nosewarmer and you will find a free knitting pattern  good luck and make sure we see you wearing it in a pic!!!",
      "MessageIndex": 25,
      "PostDate": "15/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi  Canon Just love your backscratcher the art work is gorgeous!! So you can’t knit?? You have other beautiful skills. here is my first knitted knocker!!!  Have a good Sunday of crafting everyone",
      "MessageIndex": 33,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi kumihimo No problem with the questions. I'm thinking of taking them to my chemo when I go, I think it would be nice to leave them there for people to take who need them (thats if they will let me but I think they will). The idea is to do pairs and then let people decide if they want one or 2!! I knitted on straight needles but on the Knitted Knocker official site (yes american) they do ALL, straight, DPNS, magic loop, crochet etc. I downloaded the pattern and after a few rows was so, so easy. I have also used the recommendations on the pattern such as over stuffing the knocker and leaving a kind of drawstring so the person can re-arrange or remove stuffing untill comfortable. I am going to match this one and then have a go at DPNS on another pair and see if there is any difference!! Here's the link for the pattern I used: https://www.knittedknockers.org/make-a-knocker/ Ask me anything I really don't mind!!!! Take care",
      "MessageIndex": 35,
      "PostDate": "18/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi  Jenny grannylara Not seen you on here much you OK?",
      "MessageIndex": 142,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Ahhhh Leolady56 that post has made me smile :)",
      "MessageIndex": 15,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "WOW ... I am so happy with the response to this thread. See, we are all talented people with or without BC!!!  Please keep posting pics as I think it cheers everyone up and could lead to some people taking up a hobby they thought they couldn't do anymore. If anyone has hints or tips to share I am sure we could all still learn more (I certainly could). Snowys Mum  mrsox  Weeblemum  grannylara The pictures of your knitting are amazing!!! I am definately getting into knitted knockers. If anyone has a pattern they would like to share please post.  I have been lucky and not needed one but there are plenty who do. Have a good and peaceful night everyone. 2nd round of chemo for me tomorrow, fingers crossed!! xxxx",
      "MessageIndex": 14,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Violetsniff  this is a crafts thread and you definitely come into the crafts !! They are wonderful look forward to seeing the finished article!!",
      "MessageIndex": 52,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Welcome to the thread star 67  It is wonderful seeing everyone's creations on here and Hear Hear Leolady56 a finger flicked  to BC (love it)!! Snowys Mum  Gorgeous teddies, grannylara  love your xmas toys they are beautiful. Kacang  so good to hear the knitted knockers are used and useful I have just finished my third and going to keep on going. I did hear (from where I don't know!!) someone said they had a knitted knocker and it looked like a false boob and din't like it?? I can't really understand that as they are stuffed so you can make comfortable adjustments to them. They are lighter than the hospital ones and you don't see it unless your showing it off to everyone!! Have a good evening everyone and keep crafting. xx",
      "MessageIndex": 50,
      "PostDate": "20/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi everyone, not been on for a while but since I started this thread back in February (seems MUCH longer) I cannot believe how well it is used. The pictures of everyone's arts and crafts are all AMAZING and everyone DESERVES A PAT ON THE BACK. We are a very creative group so keep posting!!! I have been busy knitting dishcloths, haven't taken any photos yet but will do and then post them, I have done these for friends at work who have been so supportive so wanted to show my appreciation. Really easy and quick to do and able to pick up and put down whenever. I have done a few 'Breast Cancer Ribbon of Hope' in pink of course just to keep raising awareness. I have also knitted quite a few 'Knitted Knockers' in different sizes (again no pics but will download asap) and my chemo unit have welcomed them. I did these as i feel very lucky that I not had to have a masectomy and feel for the people who have to go through this. The chemo etc is bad enough without that as well. So... here is a couple of pics of the patterns I am about to start for my little grandaughter. Hope you like them and will post pics of the finished items.                        Love Edwina xx You’re allowed to scream  - You’re allowed to cry  - But do not give up",
      "MessageIndex": 139,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Kacang  Yes, have thought about that but have finished the main part now so will have a go at the swiss darning!!",
      "MessageIndex": 155,
      "PostDate": "17/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Jenny, been much the same as you so very tired. I can’t believe how lethargic I am and takes so much energy to do the littlest thing. your cross stitch are beautiful. I have never tried cross stitch before but think it’s something I will have a go at. take care xx",
      "MessageIndex": 145,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "They are fabulous cannon (can’t seem to tag on phone)!! But I’m with Kacang, can knit and sew but MUST have a pattern!!!",
      "MessageIndex": 244,
      "PostDate": "05/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Sorry, posted the above on correct site NOW but you might see it twice!!!! Chemo brain!!! xx",
      "MessageIndex": 140,
      "PostDate": "15/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "So annoyed with this pattern. I have started it last night, have both the colours recommended and then find it is not intarsia knitting but bloody swiss darning for the spots on the elephant!!! Not my strong point and prefer to knit in as many different colours as required. The Monkey is intarsia so will be OK with that one. Really p***es me off as they dont tell you until the end of the pattern Rant over!!!!",
      "MessageIndex": 152,
      "PostDate": "16/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "This is my baby preemie hat knitted in the round!! I have always knitted on straights and never been a fan of circular (only use for straight knitting) or DPN's as always poking myself with them and inevitably drop stitches!! SO.....I decided to invest in Addi CrasyTrio's. It took a few rows to get used to them but I love them!!! Anyone who loves circular/DPN's would recommend. This is why this tiny hat is such a success for me.",
      "MessageIndex": 286,
      "PostDate": "08/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Not sure if I have already posted these pics so apologies if you have already seen them!!! My 'Knitted Knockers' went to the Oncology Unit today and they were very pleased with them and said they will certainly be given out to anyone who wants one. Just feel better trying to give something back.   ",
      "MessageIndex": 287,
      "PostDate": "09/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "These pictures are of my first attempt at circular knitting. I have just taught myself circular knitting!!! Ha ha. I have been a knitter for many years and can do all the usual i.e. cables, fair isle, intarsia etc but have always knitted on straight needles. Why do I need circular’s I asked myself?? A lot of ladies think they are much better than straights. So, I asked hubbie for a set of circulars for Xmas, which I duly got and started straight knitting with them and had no long needles poking into me, got on great with them. So yesterday, I had a beautiful afternoon in the garden and actually knitted my first item in the round!!! So proud of myself, yes, there are a couple of mistakes however, the second one is even better. I now must say I much prefer circulars for ALL of my knitting now. The next thing is to teach myself continental knitting. This will be hard as have been a ‘thrower’ for too many years but I will overcome it and then see what I prefer.",
      "MessageIndex": 288,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Morgana17, I can only agree with Jacmatholmad and GRANNY59. Depends on your results as to what stage they will take you to next. I am the same as Jacmatholmad, I too had lumpectomy followed by further surgery of lymph nodes which meant I am gong down the chemo route followed by radiotherapy. So, as GRANNY59 says a lot depends on what they have actually found and your results Originally I was having lumpectomy followed by radiotherapy which was a great relief however, after the lumpectomy they found lymph nodes infected so it all changed for me. Your team will meet up and discuss the best treatment for you based on their findings. Nothing to worry about and as previously said write everything down and take someone with you as it is usually a lot to take in at first. My DH always comes with me as I tend to forget what SE  I've had or questions needing asking and he always remembers!! Chemo brain I'm afraid. Rest assured, we have all been where you are now and lots are now coming out the other side and others are nearly there. We are all surviving this and you will too. Wishing you all the best and keep us updated.",
      "MessageIndex": 4,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154516/clinical-oncology",
      "Title": "Clinical Oncology"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Leolady56; Moomc ; XjulieX; HClare; YoungandFit; Aliblue; Cuppatime Hi all I have tagged a few of you but  this question is for EVERYONE undergoing RT at the moment. My saga today....hope I don't bore you all!!!! Zap no. 8 today, halfway through. Appointment for 13.45. Got there at half one (usually early) got called in an HOUR later. Now this is unusual where I attend as always seen within half hour at the most. So, obviously something has happened so not unduly worried. Got changed and waited about another 15 mins. Eventually went in for RT treatment. Laid down, arms up etc etc. and they start shifting me about to ‘line me up’. Started breathing in and out when asked. Off they went to get the images. They were gone a good 20 minutes and left me with arms up and just completely numb and dead by now. They came back and said ‘we are having trouble lining you up so sit up and wiggle your arms and hands. As we cannot get the images you can either go home and come back tomorrow or go and have a rest, we will see another patient and then try again when you have rested’???? I said I would wait and try again. Half hour later I got called back in, went through all the same procedure and again left for ages. They called another radiographer to have a look as well. By now I was losing the will to live (never mind my arms!!). They then decided that we should leave it for today and try again tomorrow. When I asked if it was me or them they said me as I must have moved (didn’t seem too sure if I had or not) and they saw I was wiggling my fingers. I said I always wiggle my fingers as they go numb and everything was OK last week (and I wiggled my fingers) and I hadn’t moved. One of the radiologist said to take a couple of paracetamol about 20 minutes before my appointment tomorrow as this would help the pain in my arms and also relax me???? So, paracetamol is now a relaxant???? I am not sure if it is me or something else was going on. Has anyone else had this happen to them? I eventually left the hospital at 5pm and caught all the rush hour traffic and got home at 6.15pm. Annoyed is not the word I would use. Please someone tell me this is normal practice. Thank you for reading all through this without falling asleep!!! Aliblue Interestingly I had a midway review today to see how I was getting on (this was before the debacle that took place) and will have another near the end. All in all, I am fine at the moment. A little bit pink and some shooting pains which they said was quite normal.",
      "MessageIndex": 0,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164291/not-lined-up-no-rt-today---anyone-else-have-this",
      "Title": "Not 'lined up' No RT today - anyone else have this?"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Cuppatime Thanks for your reply however, NOTHING is minor with what we are going through!!! It's just consideration at the end of the day. As you say no apology for keeping you waiting, it's all stressful enough and doesn't take much to say sorry!!!! Take care and good luck with the rest of your RT.",
      "MessageIndex": 7,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164291/not-lined-up-no-rt-today---anyone-else-have-this",
      "Title": "Not 'lined up' No RT today - anyone else have this?"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Leolady56  Aliblue  Israel  XjulieX Many many thanks for your replies. Yes, it was one hell of a day!!! I don't feel tense though probably am slightly. My breathing is Ok so I've been told previoously. I just get the feeling there was something else today. Don't know what, as was an hour late going in and that has never happened before. Will practice tonight and in the morning and see what tomorrow brings!!! Again many thanks.",
      "MessageIndex": 5,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164291/not-lined-up-no-rt-today---anyone-else-have-this",
      "Title": "Not 'lined up' No RT today - anyone else have this?"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Well ladies thought I would give you an update on my ‘traumatic day’ on Monday. Went as usual on Tuesday, still waited an hour and found people were going in before me with later appointments!! (as you can see I have the bit between my teeth now!!). Finally got called and asked, very politely, were they running late and did I have the right time for my appointment? Yes, they said to both but got an apology this time. Anyway, two wonderful ladies I hadn’t seen before. One said she heard I had a spot of bother yesterday, yes, I said. So, she said not too worry will get your sorted today. On the bed, lined up, images taken, RT given, all done. NO PROBLEMS at all. Amazing!! So, have gone today (no appointment yesterday, day off, probably sick of me). Same lady and man I had seen first week. On the bed, lined up off they went. Images taken however, had a bit of a problem with my breathing in but that got sorted. BUT… images had to be taken again. They came out and said I was slipping down the bed, very minutely but obviously puts the lining up out. Second time and all done and was still only about half hour. I have called my BC nurse and have told her what happened on Monday and she was so surprised that they did not give treatment that day, and yes, she said it is their job to ensure you are lined properly and not send you home like that. She is going to report it to the head honcho of Oncology and the head of RT and said she will let me know what they say. I will definitely be hated now, oh dear!!!! So, I now know I slip down the bed slightly, well, I can’t be the only one who never, ever moves a millimetre am I??? ha ha I don’t think so. Anyway, feel better now I know what it is, even though I asked on Monday and got very vague answers with nothing positive. Having said I’m feeling better is not true. I feel totally fed up today. Think it is all now getting too much. I am back at work, albeit on reduced hours, the travelling every day and I’m only number 9 today which, if machines and staff were not broken I would be 13!!! Two days to the finish line, instead another 6 still to go. Well, I hope everyone is having a better time than me. It does sound that way from your responses. Long may it last and the best of luck to all.",
      "MessageIndex": 12,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164291/not-lined-up-no-rt-today---anyone-else-have-this",
      "Title": "Not 'lined up' No RT today - anyone else have this?"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi lesleyhelen  You have at least made me feel better that it's not just me!!! I don't mind the break in days too much, as you say it does give the boob a chance. So far I'm only a bit pink and slightly sore nipple but nothing I can't handle. It's just that it has taken me into a 4th week instead of 2 or even maybe 3, so just a bit fed up tonight but it will pass. Leolady56 Yes, I will listen to my body, I also have a hubby who tells me that as well!! Thanks ladies for your kind words and advice, much appreciated. Take care xxx",
      "MessageIndex": 16,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/164291/not-lined-up-no-rt-today---anyone-else-have-this",
      "Title": "Not 'lined up' No RT today - anyone else have this?"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Deb, This community is SOOO supportive. On day 4 and not feeling too bad, a bit shaky and tired. Sleep is what I cannnot seem to get to grips with, I know I'm anxious (which is unusual for me!!) so I sleep and wake, sleep and wake wondering if anything has happened hair fall out etc . Silly I know but I think most of us understand this emotion. All in all though not as bad (at the moment) as expected. Wishing you the very best of luck with the cold cap, I know it has great reviews. Put me off about the headaches!! Had my haircut now so hopefully won't be too traumatic . I have also ordered hair weaves to wear under hats as not sure about the wig yet. Best of luck to everyone on here and many thanks for all your wonderful comments. Think I might start a blog just to record my thoughts, my ramblings might help somebody!!! :ove Edwina xx",
      "MessageIndex": 20,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi all Joining this club as is very relevant to me!! Had my first chemo session yesterday. Must say was not as bad as I thought it would be. I had taken to the opportunity to read as much as I can about it all. The nurses were absolutely wonderful, very relaxed and explained everything they were doing and what possible side effects now and later. I cannot praise them enough!! I am having EC-T and have been told about hair loss as a definite. Have found a link on here to Heathers Hair which I am going to try as not sure if I want a full wig. BUT..... who knows how your'e going to feel until it happens. Slept fairly well last night after my session however this morning felt awful, couldn't stomach coffee and felt really tired. Took all the pills they gave and feeling about 3/4 normal this afternoon. Think I'm lucky at the moment as I'm sure there is worst to come!! Will keep you informed as I go and feel able to.   Good luck to everyone on here!! My breast cancer info Diagnosed last August through mammogram (no lump that I could feel). Biopsies on lump and lymph nodes Lymph nodes were clear however, 2nd lump found Lumpectomy in October Results 8/14 lymph nodes diagnoesed Lymph node removal in Dec So that meant chemo and radiation for me as previously was only going to be radiation!!",
      "MessageIndex": 0,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Cathy many thanks for your wisdom!!! Yes steroids are now finished, taken last lot earlier so am hoping after tonight should, hopefully, sleep better. But, who knows?? Will have to wait and see. I must say that if this is the worst it gets I can live with it, think thats wishful thinking though . take care edwina xx Here's a pic of my knitting....  ",
      "MessageIndex": 7,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Theresa So there is hope!!!! I am feeling fine as they have given me steroids to take for three days and said they will give you a slight 'high' which is why i'm thinking next week will be worse as I won't be taking them. You have really given me hope i can put up with anything for a couple of days. I'm staying positive about this and so must you, even though you sound as if you are!! Many thanks Edwina xx",
      "MessageIndex": 17,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Cathy many thanks for your wisdom!!! Yes steroids are now finished, taken last lot earlier so am hoping after tonight should, hopefully, sleep better. But, who knows?? Will have to wait and see. I must say that if this is the worst it gets I can live with it, think thats wishful thinking though . take care edwina xx Here's a pic of my knitting....  ",
      "MessageIndex": 22,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Cathy Yes, I tend to knit baby clothes, toys etc, same as you I get bored with anything too big. I'm actually into dishcloths at the moment. I used to wonder what all the fuss was about with them, a knitted dishcloth?? didn't make sense, however, I had some dishcloth yarn found a pattern and away I went. Knitted loads now and have also done pink 'ribbon of hope' ones. I love them and everyone I have given them to as well. Will try and post pics on my blog of some. How did you get the picture on here? My shop on ebay is called Harmony Yarns or find me under edwina54 Best wishes Edwina xx",
      "MessageIndex": 26,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Deb, This community is SOOO supportive. On day 4 and not feeling too bad, a bit shaky and tired. Sleep is what I cannnot seem to get to grips with, I know I'm anxious (which is unusual for me!!) so I sleep and wake, sleep and wake wondering if anything has happened hair fall out etc . Silly I know but I think most of us understand this emotion. All in all though not as bad (at the moment) as expected. Wishing you the very best of luck with the cold cap, I know it has great reviews. Put me off about the headaches!! Had my haircut now so hopefully won't be too traumatic . I have also ordered hair weaves to wear under hats as not sure about the wig yet. Best of luck to everyone on here and many thanks for all your wonderful comments. Think I might start a blog just to record my thoughts, my ramblings might help somebody!!! :ove Edwina xx",
      "MessageIndex": 5,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Theresa So there is hope!!!! I am feeling fine as they have given me steroids to take for three days and said they will give you a slight 'high' which is why i'm thinking next week will be worse as I won't be taking them. You have really given me hope i can put up with anything for a couple of days. I'm staying positive about this and so must you, even though you sound as if you are!! Many thanks Edwina xx",
      "MessageIndex": 2,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "I am trying to insert pictures but doesn't seem to be working!!!! Actually I'm blaming the website but could well be me!!! I will keep trying, have a couple on my blog xx",
      "MessageIndex": 9,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Cathy Yes, I tend to knit baby clothes, toys etc, same as you I get bored with anything too big. I'm actually into dishcloths at the moment. I used to wonder what all the fuss was about with them, a knitted dishcloth?? didn't make sense, however, I had some dishcloth yarn found a pattern and away I went. Knitted loads now and have also done pink 'ribbon of hope' ones. I love them and everyone I have given them to as well. Will try and post pics on my blog of some. How did you get the picture on here? My shop on ebay is called Harmony Yarns or find me under edwina54 Best wishes Edwina xx",
      "MessageIndex": 11,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi all Joining this club as is very relevant to me!! Had my first chemo session yesterday. Must say was not as bad as I thought it would be. I had taken to the opportunity to read as much as I can about it all. The nurses were absolutely wonderful, very relaxed and explained everything they were doing and what possible side effects now and later. I cannot praise them enough!! I am having EC-T and have been told about hair loss as a definite. Have found a link on here to Heathers Hair which I am going to try as not sure if I want a full wig. BUT..... who knows how your'e going to feel until it happens. Slept fairly well last night after my session however this morning felt awful, couldn't stomach coffee and felt really tired. Took all the pills they gave and feeling about 3/4 normal this afternoon. Think I'm lucky at the moment as I'm sure there is worst to come!! Will keep you informed as I go and feel able to.   Good luck to everyone on here!! My breast cancer info Diagnosed last August through mammogram (no lump that I could feel). Biopsies on lump and lymph nodes Lymph nodes were clear however, 2nd lump found Lumpectomy in October Results 8/14 lymph nodes diagnoesed Lymph node removal in Dec So that meant chemo and radiation for me as previously was only going to be radiation!!",
      "MessageIndex": 15,
      "PostDate": "25/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "I am trying to insert pictures but doesn't seem to be working!!!! Actually I'm blaming the website but could well be me!!! I will keep trying, have a couple on my blog xx",
      "MessageIndex": 24,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/148159/1st-chemo-session-yesterday",
      "Title": "1st chemo session yesterday!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Sunflower2515  I had lumpectomy and agree with what other people have said. You are only just a week over op and all these things take time to heal. As has already been said it is the nerves they cut into as well.  Also some people heal quicker than others. Mine cleared quite quickly but I did have an irritation on my arm that felt like my arm had rubbed badly on something and was very irritating however, after speaking to the BC nurse and, of course, with is wonderful community it all proved to be quite normal. Post any worries whatsoever there will alwaysbe someone  having or already had the same as you. Take care and good luck",
      "MessageIndex": 4,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/155337/hello-and-skin-sensitivity-post-lumpectomy",
      "Title": "Hello and skin sensitivity post lumpectomy"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Thanks JammyR,  Glad your not suffering too much.  It is horrible though. Funny,  I was taking co-codamol and ibuprofen but only made dent in the pain. Doctor gave me codiene and said Ican take it with ibuprofen as well. He said should not take the co-codamol as too much paracetamol!!  When I follow posts on here there sems to be mixed consensus on what we are told by our Onco's. To be honest not sure if it has made any difference anyway, as today took steroids this morning and been pretty good all day but felt that wearing off at about 6ish so have taken painkillers a little while ago but fingers and toes still tender whereas they were fine all day with steroids!!! Yes, my brows and eyelashes have nearly all gone now as well. Well, it must be good if your first cycle is not too bad as according to others on here most have said the first is the worst and calms down on following cycles. So fingers crossed it will be good to both of us. Take care xxx This has definately got a lot to answer for!!",
      "MessageIndex": 6,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156137/skin-falling-off-my-fingers-chemo-face",
      "Title": "Skin falling off my fingers?? Chemo face!!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi ladies  - Many thanks for your responses. Leolady56   Yes, I have Vaseline and also Dermal cream which is a barrier cream so keeping them moisturised, they are actually not as sore as they look it, the skin is just dead and falls off, obviously have to be careful not to pick it though as I have a tendency for that!!! cassis   Many thanks for your reply, it is so very similar to how I have felt this week only instead of falling off a cliff they liken to being hit by a ten-ton truck!!! Both are very apt!!  It is only now I am getting some relief with the steroids and codeine that has been prescribed. toxophilite  Yes, the red face is very becoming!!!  And red eyes to go with it.  Lucky not had any skin peel on face (but who knows) and yes, painkillers will be taken VERY early next time. I really did not think it could be as bad as what people described and it is one of these things you have to experience first hand to empathise and sympathise with others. Have a great wekend ladies,  I am going to keep taking the medicine!!!!",
      "MessageIndex": 4,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156137/skin-falling-off-my-fingers-chemo-face",
      "Title": "Skin falling off my fingers?? Chemo face!!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "So, day 11 after first T and only just beginning to feel better. Went to hospital for line flush on Thursday, DH had to take time off work to take me as have been in so much pain ALL week and couldn’t drive. Waited to see doctor and he prescribed painkillers (codeine) and steroids to start relieving the pain plus mouthwash. Now just wish I had gone earlier as took them as soon as I got home and started relieving pain straight away. However, yesterday my hands and feet have started to get sore and I have chemo face!!! Very red eyes and cheeks and very sore eyelids and under eyes. Skin is falling off my fingers, anyone had this??       Now have to wait and see Oncologist to see what they have to say. THIS HAS BEEN THE WORST WEEK OF MY LIFE!!!!",
      "MessageIndex": 0,
      "PostDate": "28/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156137/skin-falling-off-my-fingers-chemo-face",
      "Title": "Skin falling off my fingers?? Chemo face!!!"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi everyone I am now over 3 weeks post chemo and have a watery eye!! Doesn't stop watering all day. Went to pharmicist and, as only just finished chemo, would not recommend anything and advised doctors. Seems such a minor thing to go to the doctors with however, made appointment and saw a doctor I had not seen before. So told him what I was there for and felt a bit guilty wasting his time, and said I had been to see chemist but they advised to see doctor. So, he said, do you suffer with hay fever? No I said. (felt like saying I would know what it was if I did!!). Emm he said, well nothing I can do????? Oh really i'm thinking. Well, I will give you some drops and see if it clears up otherwise you might have blocked tear ducts and will have to see an eye specialist!!. Great I'm thinking. Gone to pick up prescription and he has given me eye drops for hay fever!!!! Could have got the same thing over the counter. I know in my heart of hearts it is due to the chemo but just wanted to be sure, not a lot to ask. Anyone else suffering/suffered with this? Doesn't hurt at all and is not infected as clear tears all the time and is only in one eye.",
      "MessageIndex": 0,
      "PostDate": "22/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160048/3-5-weeks-post-chemo---watery-eye",
      "Title": "3.5 weeks post chemo - watery eye"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Bigguy thanks for the advice, might have to do that as my eyes are so so sore at the moment.  I return to work on the 18th June with a phased return to work but don’t start RT until 2 nd July. They have said it is too long to wait and will possibly bring the date forward but not heard anything yet. StIll suffering SE from last chemo and think I have stayed on steroids for too long as had extras left over!! Ahh well no more chemo which is goid Going to start practicing my make up now!!",
      "MessageIndex": 2,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159020/eyebrows-and-eyelashes---what-do-you-do-when-they-are-gone",
      "Title": "Eyebrows and eyelashes - What do you do when they are gone??"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi all Many thanks for all your responses it has proved very useful! I didn’t think I could get them tattooed and wasn’t really sure I wanted something as permanent as that anyway, but definitely won’t think about it now!! My eyebrows have always been a bit sparse the older I’ve got so think will practice with eyebrow wand from Benefit that I have got. Bigguy and MaggsT   I am going to enquire at my local Boots as it is a fairly big one and get some help! Teeshun    Thanks for the advice, funnily enough I was using fake tan during the winter to give me that healthy glow, have now got a little bit of sun which has helped. Going into work tomorrow to ‘plan’ my phased return. Should be interesting mops   Many thanks. What a good idea, will definitely looking into that idea about glasses. SueG   Yes, my eyes are very sore at the moment and I usually wear a fringe (with my wig) so will bear that in mind! Nutmeg56   Ha ha I am a young 64. I have a minute silver hedgehog on my head which is STILL slowly disappearing!! Make up is all new to me as well as have not bothered with hardly any for years but definitely need something now with chemo/steroid face and eyes it is pretty horrific!! A big thank you to you all for the invaluable advice it is much appreciated. Good luck with all your appointments and treatments. I have nothing until July now, seems really weird not traipsing to the hospital every week for one thing or another!!!!",
      "MessageIndex": 9,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159020/eyebrows-and-eyelashes---what-do-you-do-when-they-are-gone",
      "Title": "Eyebrows and eyelashes - What do you do when they are gone??"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Sammystaff I'm the same as Aspen. Can only tag on PC not on Iphone. Hope this helps.",
      "MessageIndex": 116,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi all. Unfortunately I have noticed my eyelashes have gone!!! My eyebrows went some time ago. My problem is I am going back to work week after next and want to try and look half decent.  Any ideas on what I should/can do? Tattoo?? etc, Not sure I want something permanent. Thanks Edwina",
      "MessageIndex": 0,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159020/eyebrows-and-eyelashes---what-do-you-do-when-they-are-gone",
      "Title": "Eyebrows and eyelashes - What do you do when they are gone??"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "maggiemee; Ginacarla Hi ladies. I too am on Letrozole and have all the side affects you are both talking about. I am also reluctant to change as they all seem to have the same side effects so it might just be that one brand suits you better than another. I am also on Letrozole for 10 years and my thinking is: 1. It is keeping the cancer gremlin’s away and …… 2. Hopefully my body will eventually get used to it!!! (fingers crossed) I will say I am back at work and the more active I am the better I feel. I admit I don’t exercise much and some people have said they feel a lot better with regular walking or some other form of exercise. (I’m just too lazy!!). I have also started taking cod liver oil with calcium as there was an old post on here that someone said they were pain free while taking this supplement. Too early for me as only started this week however, if it works I will definitely let everyone know as so many of us are suffering through Letrozole. If you search 'Letrozole' on here there are pages about it. xx",
      "MessageIndex": 5,
      "PostDate": "27/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170595/has-anyone-stopped-taking-letrozole-and-switched-to-other-aromatase-such-as-arimidex-and-aromasin",
      "Title": "Has anyone stopped taking letrozole and switched to other aromatase..."
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "hi LiziX  this must be horrendous for you. I am lucky (so far!!) and not been admitted during this chemo sh*t but I hear see other people on the forum who are and most seem to get a private room. It really is not fair on you to be with these ‘germy’ people!! maybe get your OH to make some noise  sending you best wishes that you’re out of there very soon xx",
      "MessageIndex": 342,
      "PostDate": "24/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi Dot Mavi. It's bloody disgusting the charges for travel insurance when having to deal with this crap anyway. There is always someone on 'the make' when people are ill. Hope you manage a wonderful holiday in spite of this.",
      "MessageIndex": 117,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "hi Maisie17  I definitely would not shave, get your hair clipped, I had a number 4!! You are more prone to nicks and cuts which could then get infected. Also you will have horrible hard stubble which is uncomfortable. Obviously only my advice but my little hedgehog I have left is lovely and soft. Also think about investing in a silk pillowcase. good luck",
      "MessageIndex": 277,
      "PostDate": "19/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Bigguy    really meant to respond to your post before. Just want to say it must have felt wonderful with baldy head out in the sun when you walked to the post box. Sadly I’m not that brave and went to the post  office with my hat on Never know might do it soon!!Trouble is NO-ONE has seen my baldy head apart from DH, not even my DD’s as I don’t want them to have this vision of mum's illness!!! One says she is OK with seeing it the other is like NO, NO don’t want to see you like that!!!! Your one brave woman xxxxx",
      "MessageIndex": 299,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "taralou",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/taralou",
      "Content": "Hi grannylara I have just read that article by Dr Peter Harvey that you recommended. How interesting and refreshing to find that there are people out there that understand what you could possibly go through when treatment finishes. I have just finished all mine, my last RT was on Thursday. Much as I am relieved and happy I didn't sleep well last night and consequently feel quite emotional today. Reading this article also brought a tear as some of it was definately me!!!! Many thanks for sharing this and would urge anyone finishing or finished treatment to read this, no matter how well you think you are it is definately worth a look.",
      "MessageIndex": 5,
      "PostDate": "28/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165045/well-that-s-that",
      "Title": "Well that’s that"
    }
  ]
}