{
  "AuthorID": "TeriShelly",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terishelly",
  "Posts": [
    {
      "AuthorID": "TeriShelly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terishelly",
      "Content": "Last November I had lumpectomy (grade 3 Her2 tumour - left breast), followed by chemo/herceptin and radiotherapy. I have been having some collarbone pain so yesterday had a bone scan. After the scan was finished the technician came out to me and asked me if I had implants. I said no. She then asked me what I'd had done. I said I'd had lumpectomy. She looked puzzled then asked me if I wore cups. I said no (I just wear a bra vest). Again she looked puzzled and went into the other room, chatted to another technician, then came out and said to me \"Thats fine\". She told me I'd have the results in about a week but to ring up if I don't hear anything in 2 weeks. Does anyone know what would have prompted those questions? I assumed the bone scan just shows the skeleton and any hot spots so what could she have been in my chest area that made her think I had implants or wore a bra with cups. My mind is spinning. I know I should have just asked her but I'm useless at speaking up.",
      "MessageIndex": 0,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168390/odd-questions-at-bone-scan",
      "Title": "Odd questions at bone scan"
    },
    {
      "AuthorID": "TeriShelly",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terishelly",
      "Content": "Thanks everyone for your replies. You're right - I should just ring up and ask. I'm more comfortable ringing my BCN.  I'm annoyed at myself for not asking the technician at the time. I did wonder about dense breast tissue - I've got scar tissue and edema on the left breast so I wondered if it was that. But she spoke in the plural. Maybe it's my bra. Anyway I should ring them. Thank you all for your replies :)",
      "MessageIndex": 4,
      "PostDate": "21/09/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/168390/odd-questions-at-bone-scan",
      "Title": "Odd questions at bone scan"
    }
  ]
}