{
  "AuthorID": "terri f",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
  "Posts": [
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Hi,  I live between the 2 countries, I spend most of my time here just outside London, and then I spend some time in Spain just outside Málaga. I've had all my treatment now so I'm coming out on Monday and hoping to stay until July as the doctors don't want to see me again until October. I can't wait to get there and relax for a few weeks. Terri x",
      "MessageIndex": 2,
      "PostDate": "26/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129474/hola-i-live-in-spain-and-have-previously-been-in-touch-with-other-expats-who-are-either-undergoing-treatment-for-bc-if-anyone-wants-to-contact-me-for-help-with-how-bc-is-treated-or-just-to-chat-please-get-in-touch-xx",
      "Title": "Hola i live in Spain and have previously been in touch with other..."
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Thank you, I have had such a headache I am wondering if the cold cap has made that worse? Giving the next round some doubt... Terri x",
      "MessageIndex": 6,
      "PostDate": "12/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117981/a-quiet-hello-from-me",
      "Title": "A quiet hello from me!"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Hi Ladies It's 6.15 and I've been awake since 2am......    Just can't sleep. First chemo EC chemo was Wednesday, felt fine until the evening and then just went to bed as I felt a bit rough. Woke up Thursday and felt ok, yesterday I woke up feeling like a complete fraud as I was right as rain..... Only symptoms were a little tired and constipated and a yucky taste in my mouth that is getting worse. Felt a bit low last night so went to bed at 10 but struggled to get off to sleep and then woke at 2am and haven't been able to get back to sleep....... Just had a massive craving for toast and jam so have indulged myself and am now going to go back and try to sleep. That will mess up the timings for my anti sickness and steroids!   My head and other bits are itching like mad but surely  3 days is too soon for hair loss and I cold capped! How is everyone else coping? Terri x",
      "MessageIndex": 0,
      "PostDate": "12/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117981/a-quiet-hello-from-me",
      "Title": "A quiet hello from me!"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Thanks Julia I managed to get back to sleep at 6am until 9 and am just going to take it easy today.   Hubby and boys all off to play sport but weather us foul so I'm staying put. Hugs to everyone going through this. Xx",
      "MessageIndex": 2,
      "PostDate": "12/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117981/a-quiet-hello-from-me",
      "Title": "A quiet hello from me!"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Thanks Pía Good luck for your taxol. Terri x",
      "MessageIndex": 5,
      "PostDate": "12/11/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117981/a-quiet-hello-from-me",
      "Title": "A quiet hello from me!"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "I bought a picc line cover from living better with website, I think you can get them on eBay too.  Not too tight and very comfortable. I wrapped gauze round the plastic stopper and had no problems x",
      "MessageIndex": 4,
      "PostDate": "29/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/129647/picc-line---advice-please",
      "Title": "PICC line - advice please"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Dear Hattie, You have done exactly the right thing, this is the place for support and advice... As if the last year of uni isn't stressful enough now you have this worry. I am horribly needle phobic and went into the ultrasound the same as you, expecting to be told that it was nothing sinister. When they said that they didn't like what they could see and that I needed a needle biopsy I went into sheer panic, hyperventilating and kicking out.    My husband and several nurses had to hold me still (ish) and even getting the local anaesthetic in was my idea of hell BUT IT REALLY WASN'T THAT BAD AT ALL.  That's the message I would take from this. There is a loud click like a staple gun going off as they actually take the sample but it's momentary and there really wasn't any pain from the procedure.   Hopefully you will have a Dr who is as fantastic as mine was, she was calm and authoritative without losing her compassionate side, she made me feel confident enough to face it without any kind of sedative (that could be an option).  Embla cream on the area may also be a possibility if you feel you will need it, it just numbs the area a bit before they start. Hopefully the results will bring good news but in the mean time there are loads of us here at various stages of diagnosis, treatment and recovery who can offer a shoulder to cry on on an ear if you want to vent and rant! Good luck with it and let us know the results. Terri x",
      "MessageIndex": 8,
      "PostDate": "06/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128290/22yo-terrified-of-core-biopsy---and-well-everything",
      "Title": "22yo terrified of core biopsy - and, well, everything"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Sure, 6 cycles.  3 of EC and 3 of docetaxol.  They had it all set out on a bar chart showing the percentage with no further treatment, with chemo, radio and hormone. It seemed to me that if you have er+ and pr+ then the tamoxifen will have the most influence followed by radio being second in influencing recurrence or not but chemo gave another 4/5 percent which may seem like small numbers but if I have them all then I think 90 percent chsnce of still being here in 10 is a good place to start. Hindsight is a wonderful thing so I wouldn't beat yourself up over the past. You need all your strength to battle this crap again. I feel very strongly that knowledge brings a little control into the situation so just keep asking your medical team, macmillan nurses and on here. Here's wishing you the very best and sending you a hugs (gentle one) T x",
      "MessageIndex": 19,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117250/which-bra-after-surgery",
      "Title": "Which bra after surgery?"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Hi i found that my local Debenhams was the only place that had any knowledge or training.   They have a range called spirit that are very comfy. Amazingly the lady that saw me was a 30 year survivor!!  I was also wearing a completely wrong size so very glad I went.   Ring first if you go tho as not all Debenhams have a post surgery dept our local small one did but not the bigger town store!! Good luck Terri X",
      "MessageIndex": 15,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117250/which-bra-after-surgery",
      "Title": "Which bra after surgery?"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Absolutely, a good balance for all the terribly sad stories that appear.  I went for my onco appointment today as start chemo in 2 weeks and was pleased to see the statistics that he had which showed a pretty much 90% survival rate after 10 years if I have the chemo, radio and tamoxifen. Obviously at 47 I hope for much longer than 10 years but it's my target for now!!! Take care of yourself Terri xx",
      "MessageIndex": 17,
      "PostDate": "31/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/117250/which-bra-after-surgery",
      "Title": "Which bra after surgery?"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Hi, whilst I had a picc line they always used my leg. Remember it's your body and you always have the right to question what someone is doing. Terri",
      "MessageIndex": 3,
      "PostDate": "30/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134637/blood-pressure-cuff-and-picc-line",
      "Title": "Blood pressure cuff and PICC line"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Hi everyone, I've been following all the threads closely but to be honest have been so poorly I haven't had the wherewithall to make a post of my own. I've been in and out of hospital after both docetaxol treatments and still with only 2 days to go don't feel properly recovered.   Seen the onco this morning and bloods are ok so we're going ahead despite the difficulties, I'm relieved about that as I just want it over and done with now. I've got some mega anti sickness, cocodamol and ritinadine so hopefully I can stave off the worst of it.  Last time I couldn't eat for 10 days straight, could only have lemonade and water mixed together so became horribly week and tired, bloods always up and down and both times have had shivers and raised temp although no infection was found. I may try the Clarityn as well, it may help with the bone pains and if nothing else if might soothe my very sore eyes that water constantly. My PICC line has been a god send but as my skin is now starting to break down under the dressing, I will be pleased to have that out too in 10 days time. Just 20 radiotherapies, a hysterectomy (for CIN3), tamoxifen and zoledronic acid for 5 years to go!! Very best of luck to everyone else that is still in the thick of it or just at the beginning of treatment.  The forum is great and helps to make you feel less alone..... No-one understands like someone else that's going through it. Terri x",
      "MessageIndex": 0,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123675/nearing-the-end-but-dreading-last-one",
      "Title": "Nearing the end but dreading last one!!!"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Thanks londonlass  They have decided to leave mine for 10 days in case I am back in hospital. I have been in every treatment so far and am so needle phobic they don't trust me to go in until it's way too late without the picc. I hope that I may have some gems of wisdom that may help others facing this. T x",
      "MessageIndex": 2,
      "PostDate": "20/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123675/nearing-the-end-but-dreading-last-one",
      "Title": "Nearing the end but dreading last one!!!"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Hi, I had a similar diagnosis but different chemo drugs. I did find each cycle took longer to get over but I just wanted to share with you that I am now 4 months post radio and chemo and feeling great. Be kind to yourself, sleep when you can and try to get out in the fresh air everyday. It's pretty crappy at the time and I often felt overwhelmed but it does go and you will feel better in time. Just wanted to give you that encouragement  Xxxxxx",
      "MessageIndex": 8,
      "PostDate": "04/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135074/effects-of-chemo-ec90",
      "Title": "Effects of chemo EC90"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Oh dear Londonlass, that all sounds familiar.  I am struggling to fall asleep and stay asleep so am perpetually tired......   I took a zopiclone last night and snuggled up in anticipation of a good nights sleep however I managed a grand total of 2 hours giving up at 4am. I started to read up about tamoxifen and apparently insomnia is a side effect so tonight I am not going to take it and take it tomoro am instead, no idea if it will help but I fear for the family's health if I can't tell the difference between sugar and salt!!!! Sweet chilli con carne wasn't a hot lol ",
      "MessageIndex": 6,
      "PostDate": "02/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126110/i-think-i-need-more-sleep",
      "Title": "I THINK I NEED MORE SLEEP......."
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Not sure if it helps but I drink part water, part lemonade and once I Day a put a quarter teaspoon of salt.   Just as effective as diorralyte and much cheaper.   Keeps me hydrated. Xx",
      "MessageIndex": 9,
      "PostDate": "24/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123889/can-i-drink-lucozade-on-chemo",
      "Title": "Can i drink lucozade on chemo"
    },
    {
      "AuthorID": "terri f",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/terri-f",
      "Content": "Hi Jojo, I'm 7 weeks post my last one and just have 2 more RT to go. I feel so much better this week but it has taken until now to be anywhere near normal! I still wake up with achey legs and I get tired quite quickly so I'd say don't panic you've a fair way to go. Be kind to yourself and only do what you can if that's possible, I tried to get out in the fresh air every day for a short walk. Hope you feel better soon. Terri x",
      "MessageIndex": 8,
      "PostDate": "13/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/126837/fec-t-recovery",
      "Title": "FEC-T recovery"
    }
  ]
}