{
  "AuthorID": "Tetleysscooby",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tetleysscooby-",
  "Posts": [{
    "AuthorID": "Tetleysscooby",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tetleysscooby-",
    "Content": "I went 2 weeks ago after nagging from my friend and partner because there was a breast shape change when I bent over!.  How did I notice this I hear you ask? I'm a DD Or E cup. I've never felt anything and for what reason I can't remember, but I ended up in the kitchen and bent over to put a head towel on.  It was probably a hot day in June and we were chatting, when I noticed an indentation in my right breast.  Luckily I am comfortable with my partner so I mentioned it.  I brushed it off as hormonal, my periods are a joke and always have been (rarely have them).  I have had an implant put in 2 years ago and now  I get spotting every few weeks or nothing for months. I waited another few weeks  and asked my partner to check, there wasn't any change.  I told my best friend so following a couple of weeks avoidance I made an appointment.  The doctor gave me a thorough examination and felt nothing, she wasn't overly concerned but referred me.  Within a week I was sent a consultation appointment which actually said non - cancerous appointment.  I didn't think there was anything to worry about and I was happy to leave work early for a change. I had some plans in my head for my free hour.  I thought a quick check / mammogram and a pat on the back to go home. How the world changed in 2 hours in my head! I arrived early, they called me in on time rare. The consultant was lovely and asked about the reasons for being there. I told him what I said earlier but that my grandma died at 59 in 1981 following a double mastectomy. He said grandma's don't count for this genetic issue and what about my mum.  She died at 54 so possibly that she could have had it but we will never know. He conducted an examination and said he will send me for a mammogram.  I went for that and to be honest was better than I thought. I was sent from another waiting room and then I was called for an Ultrasound which spooked me a little.  I asked why I had to go for this and she said they do it for some women.  I decided that probably the larger lady to give me comfort.  Next thing I know the woman is saying I have 3 lumps in my right breast which to be honest did not sink in.  I managed to ask how the left was for which they said it was ok.  The next thing is that they are conducting a biopsy on all 3 lumps now. I was in so much shock, but what I will say is that they they were wonderful people.  I wasn't prepared and I had no one with me.  I was shocked scared and in pain.  I am now 54 hours into the realisation and I go for my appointment next Thursdays.  I am a mental mess and I'm sore.  My partner is wonderful but more mentally distressed than me. Trying to be positive, but my god this has to be the worst piece of information I have ever had to get my head around.  Going to work has helped bizarrely enough otherwise I would have not been in a good place moping around.",
    "MessageIndex": 0,
    "PostDate": "01/09/2016",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114227/i-m-43-saw-a-dimpling-on-the-breast-and-went-for-a-routine-referral",
    "Title": "I'm 43 saw a dimpling on the breast and went for a routine referr..."
  }]
}