{
  "AuthorID": "Theresa28",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresa28",
  "Posts": [
    {
      "AuthorID": "Theresa28",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresa28",
      "Content": "I had similar problems with Anastrazole and stopped taking them on holiday as they caused so much joint pain. I then saw my consultant on my return and am now on Tamoxifen which so far are giving me no side effects. My consultant said that there are a very small group of women who seem to have difficulties in tolerating aromatase inhibitors - guess I'm one, you may be too.",
      "MessageIndex": 3,
      "PostDate": "09/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116126/can-i-change-back-from-anastrazole-to-letrozole",
      "Title": "Can I change back from Anastrazole to Letrozole ?"
    },
    {
      "AuthorID": "Theresa28",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresa28",
      "Content": "Thank you Snowys Mum - will look into what you have suggested. I'm sure I'm not out of options, but know I can't continue as I have been",
      "MessageIndex": 8,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114012/stopping-letrazole",
      "Title": "Stopping Letrazole"
    },
    {
      "AuthorID": "Theresa28",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresa28",
      "Content": "Again, I'm happy to consider it, but i will also be asking if I can take a lower dose. If I have to take this for 5 plus years, then I need to be comfortable with it. Fortunately I had low grade early DCIS, so I know I'm lucky in comparison to others.",
      "MessageIndex": 9,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114012/stopping-letrazole",
      "Title": "Stopping Letrazole"
    },
    {
      "AuthorID": "Theresa28",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresa28",
      "Content": "Thank you Dreamthief - will definitely be giving the Exestamane my best shot as this is the option they are going to offer me. I will be keeping everything crossed that this will work for me. As for vaginal dryness, I have tried KY Jelly and Sylk, but not YES, so will give it a try. Many thanks.",
      "MessageIndex": 2,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114012/stopping-letrazole",
      "Title": "Stopping Letrazole"
    },
    {
      "AuthorID": "Theresa28",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresa28",
      "Content": "I have also been taking Vitamin D and K2 but unfortunately they have not helped much. But, I'm sure there is something out there that will work for me!",
      "MessageIndex": 10,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114012/stopping-letrazole",
      "Title": "Stopping Letrazole"
    },
    {
      "AuthorID": "Theresa28",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresa28",
      "Content": "After 3 months of very bad joint pains and increasing pain in already damaged joints, I have stopped taking Letrazole. I had already tried Anastrazole (which affected me badly as well), so was switched to Letrazole. I have been taking it with painkillers (not good long term) and high doses of Vitamin D, but still everything hurt. I was even waking up at 3 a.m. with pain in my hip joints. The last straw was going on holiday and not being able to walk around Stavanger without holding on to my husband, because my legs ached so much. I have now spoken to my BCN and she has contacted my oncologist and surgeon. The oncologist says I can switch to Exestamane but hasn't offered an appointment (!), whereas my surgeon is going to see me in 3 weeks to discus further options. I am not taking anything in the interim and feel almost like myself again. Strangely enough, when I rang the hospital requesting a call back from my BCN, the receptionist commented about Anastrazole and Letrazole and my BCN said that I may be one if the small group of women that can't tolerate these drugs. So where does that leave me? My husband is worried that I am now at risk, but understands that quality of life is important too. On another note, my love life is practically at zero because sex is now so painful. I have a busy, demanding job and need not to be tired and achy all the time. Any advice out there from similar sufferers? Thank you - this forum is so helpful.",
      "MessageIndex": 0,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/114012/stopping-letrazole",
      "Title": "Stopping Letrazole"
    },
    {
      "AuthorID": "Theresa28",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresa28",
      "Content": "Dear Devon Dweller, My sincere condolences on your loss. I am new to this process and my battles lie ahead, but whatever the outcome, having my husband's support and love, will help me in my fight. Your wife was also lucky to have you with her through her own fight.",
      "MessageIndex": 19,
      "PostDate": "16/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83756/getting-really-scary-now",
      "Title": "Getting really scary now."
    }
  ]
}