{
  "AuthorID": "theresad",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
  "Posts": [
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "Hi, I finished my last of my 6 cycles of FEC about 6 weeks ago. I clipped my hair during the 2nd cycle and clipped it once more over the next few months. I found it easier to have nothing there than bits here and there as I was always worrying whether any bits were sticking out from under my scarf. by around the 4th cycle I didn;t need to clip it because it just wasn't growing at all. Now, 6 weeks after finishing, I have about 3/4 of a centimetre of growth which I still cover at the moment as I look as though I'm on my way to a footie match to cause some trouble :))  I will have it clipped again on advice as, apparently, it will get rid of the fluffy baby hair ends. But I'm enjoying not having a shiny head so I'm keeping it for now!! Hope this helps. My advise......clip it!  At least then you're in control :) Theresa d xx",
      "MessageIndex": 3,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41108/hair-growing-back-but-also-have-bit-of-old-hair",
      "Title": "hair growing back but also have bit of old hair...."
    },
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "Hi Captain! OMG we sound like the same person!!! I finished FEC chemo in June and the stiffness started about 3 weeks later. If it helps you,  I wasn't taking anything else when it started as I was due to start Tamoxifen when I returned from holiday about a week after the aching started. I said no to radiotherapy, am not taking Herceptin, Docetaxol or anything else!! My arms and shoulders are the worst too. I get the feeling like just before pins and needles starts but I know I haven't laid on my arms in my sleep or anything like that. I can fall asleep on my shoulder but if anything wakes me I'm done for and have to change position. Usually everything including finger joints just hurt! Luckily I have some tramadol from a old back injury and if I have a bad night I take one. The trouble is by morning I could sleep til lunchtime! Apart from the relief of not feeling sick I too feel worse since finishing chemo, but like I said to Little Meg, we don't like to moan do we ;) The bizarre thing is my keyworker if from Macmillian and she's at a loss as to what it could be. She said that it can happen with some chemos but not usually FEC. The way she said it made me feel like I should have said \"Oh sorry, maybe I'm imagining it then...sorry to waste your time!!\" Tonic water doesn't work - believe me I live on G & Ts!! Theresa x",
      "MessageIndex": 39,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "Hi Meg, I came on here today hoping for a clue as to what may have been causing the joint stiffness that I've experienced the last couple of weeks and found your post straight away! I finished my 6 cycles of FEC 4 weeks ago. About 2 weeks ago my shoulders mainly but also my back, ankles, elbows and hips feel as though I've just done 10 rounds with Mike Tyson AND ran a marathon!!!  I tried to get hold of my key worker in chemo dept at hospital today to ask if it could possibly be the chemo that's causing it (I too had no problem with this throughout the chemo) but she wasn't there. So I thought I'd try on here.  I've actually been on holiday so I know it's not working too hard that's done it. It started on holiday and I feel worse returning from the break than when I went! I worked as much as I could through the chemo but this week work has been a real effort as I seem to seize up over night and walk like an old lady first thing (I'm 42).  If it's any help I'll let you know what my keyworker tells me (when I get hold of her). Trouble is I hate to moan about this. After everything else I've been through a little joint pain should be nothing.....but it HURTS!! Hope it helps a bit to know you're not alone. Take care theresad :)",
      "MessageIndex": 1,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "On a completely different subject...... Since my chemo finished in June my hair's grown about half a centimetre. When will I be able to ditch the scarves?? Anyone?.... Tx",
      "MessageIndex": 6,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "Hi Meg, The bone thing was in the blood tests I had. One had to be a certain level before they'd do the chemo the next day. So I'd get a phone call on the day and be told they wouldn't do it unless the level the test for 'neuts' was higher. when I asked what that meant the first time it happened she said that my bone marrow hadn't recovered enough. It happened the last 2 cycles but was always ok after one more day. At the moment I'm just taking some higher dose Ibruprofen that I had last year for my back. That seems to work over the day but I don't like taking lots of pills so I generally try to get by. My shoulders are the worse then hips and back. I also get the feeling that you get when you have slept on your arm, just before the pins and needles. It's like it even when I've just laid on my back with my arms at my side. I clean people's houses. I was sooo looking forward to getting back to a work routine without the sickness and tiredness but now I'm just as tired because I can't sleep on my shoulders. I'm STILL waiting for my keyworker from Chemo dept to call me!! Good job it's not a matter of life or death, haha. Not sure the tonic will help much as I drink it quite a bit without much change. It's also much nicer with gin and a slice of lime :) I had a fairly new type of reconstruction called Strattice mesh. It uses pig skin to fill the gap left when the implant is put in under the muscle. It meant that I had the right size implant put in from the start and I don't need further surgery or anything taken from back etc. It's only suitable for small cup sizes (A and B I think). Hope your weekend is going ok.",
      "MessageIndex": 18,
      "PostDate": "17/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "Thanks Bas for the tip...I'll ask my keyworker (WHEN SHE GETS BACK TO ME). I drink plenty of tonic water...maybe I should hold off on the gin :) Meg, sorry it's so bad for you. I've had it easy compared to you. I found my lump in Christmas week and had to wait over new year for results of tests. It turns out I had it in 2 areas of my left breast but it hadn't got past the lymph nodes so I've been lucky. I had my mastectomy at the end of January and had reconstruction at the same time. I started the chemo at the end of Feb and was so pleased to get through it all in June. So this aching is getting me down a bit. I swore I wouldn't moan again once I got through the chemo so sometimes I worry my partner must think...What's the matter with her now!! I just hope this is a temporary thing and maybe the bones just need to recover. The last 2 chemo cycles I had were delayed by a couple of days each time cause my bone marrow hadn't recovered enough so maybe the old bones have taken it hard. Did you have that problem? Today I've taken some strong painkillers I've had for my back for a while and everything eased up as the day went on, except my shoulders which actually hurt ALL the time. Trouble is I'm self employed.....no work....no money!! Hope you've had a good day. Theresaxx ",
      "MessageIndex": 5,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "Hi Meg, I'm still waiting to hear from my keyworker! Someone else called me and said she was on holiday and would call yesterday. Still nothing. I do have access to a BCN as well but thought she wouldn't be able to help as I assumed it was connected to the chemo and the keyworker is specifically for chemo. Early menopause is a thought. I was warned that the chemo would probably shut my ovaries down leading to early menopause and I certainly have been having hot flushes. I will ask about that too. I will definitely try the evening primrose. It can't hurt can it! Drinking tonic isn't a problem for me as a G&T is my choice of drink. But I don't think it works as I have quite a lot of it to no avail. The type of surgery I had certainly worked well. I am expecting to have the other one lifted to match!! Sorry you've got so much more to face. :( The other problem I've got is I'm sooo tired!! I said to my husband yesterday that I'm sure I wasn't this tired during chemo and he laughed and said I'm now a lot better than I was. don't we forget quickly! Theresad xx",
      "MessageIndex": 23,
      "PostDate": "20/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "Hi Meg, Thought I'd let you know what my keyworker said, when she finally got back to me!!! Basically.....she hasn't a clue what it is!! She started to blame the Tamoxifen until I explained that it started before I started taking Tamoxifen! She said that it ccan happen with other chem treatments but hasn't experienced it with FEC. She said she had one lady who came back from a trip abroad feeling 'polaxed' and it was found that she had a virus. She said I could have picked up something viral, but there's no treatment for them (like a cold). If it is I just have to ride it out. All she suggested was to keep taking the ibruprofen for a couple of weeks and try and 'nip it in the bud'.  I didn't mention it before, but I've also started taking magnesium. It's good for bones (you'd have to look up details lol). The funny thing is sometimes thoughout the day I think everything's eased up and then I get undressed and realise I can't reach behind me to undo my bra or I get in bed and find I can't lay on my shoulders!! If I sit down for 10 mins at any time I walk like an old lady when I get up! How are you feeling? Any change? Theresa d xx  ",
      "MessageIndex": 30,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    },
    {
      "AuthorID": "theresad",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/theresad",
      "Content": "Hi. Sorry to hear SO many of us are suffering yet the hospitals don't seem to recognise it as a chemo side effect!! In reply to recent posts, I only had FEC and the aching started BEFORE I started on my hormone treatment. So I was taking nothing when all this started as my chemo had finished about 3 weeks prior. Theresa x  ",
      "MessageIndex": 46,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40242/severe-joint-pain-following-chemo-please-help",
      "Title": "Severe joint pain following chemo. Please help."
    }
  ]
}