{
  "AuthorID": "Tibu315",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
  "Posts": [
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hi Frillyflower (love the name) I was diagnosed last month after finding a hard area in my right breast.  I'm doing 2 cycles of chemo (AC & Taxel) before a mastectomy and radiation later this year.   I think it wasn't a shock when they said it was cancer but (because it was also in my lymph) it was more scary than I'd admit waiting to hear if it had spread - it hasn't.  The first few weeks are the hardest until  you have your treatment plan it becomes a bit more manageable (especially if you're a planner like me).     Def avoid googling, you'll terrify yourself and there's a lot of outdated Info gloating about.  And don't be afraid to share your feelings - they are all valid and perfectly natural given the circumstances.  I've also been particularly touched by how much support and love I've been given by those around me. It's not always easy for me to ask for help but incredibly comforting to know it's there without question.   Sending you warm fuzzies for your journey ahead PS I've also gone private route",
      "MessageIndex": 43,
      "PostDate": "29/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158007/just-diagnosed-with-breast-cancer",
      "Title": "Just diagnosed with breast cancer"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hi all Had my mastectomy and diep flap reconstruction last Sunday and came home yesterday.  Bruising/tenderness as expected but manageable.  The one thing I'm struggling with is my abdominal wall is so tight I don't feel I can get a full breath in.  This isnt helped by having to sleep in an almost upright seated position with cushions under my knees (Very uncomfortable but least painful). Have other ladies who had this procedure experienced the same?  If so, any advice eg what has helped? roughly how long does this last?  etc... Thanks",
      "MessageIndex": 0,
      "PostDate": "06/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169337/diep-reconstruction---breathing-discomfort",
      "Title": "Diep reconstruction - breathing discomfort"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Thanks ladies and of course you are right.  Little by little I'm getting stronger each day (although still walkingwalking at snail pace).  Purchase of the V pillow has made sleeping much more comfortable so this was especially useful advice. Follow up appt yesterday shows I'm healing well although need to hold fire on tummy exercises for a little longer so getting there. Xx",
      "MessageIndex": 4,
      "PostDate": "12/10/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/169337/diep-reconstruction---breathing-discomfort",
      "Title": "Diep reconstruction - breathing discomfort"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hi Becs  I used the cold cap for my 1st round of AC chemo.  I've had a mixed result.  Normally I have fine hair but lots of it.  The cold cap didn't totally stop me losing hair but I've managed to keep a lot.   For the actual treatment, be prepared, the first 10-15 minutes are awful, it's painful and a shock but it wears off quickly although still uncomfortable but tolerable.  There's lots of advice on how to handle that initial shock.  I found taking a paracetamol beforehand and have a cup of tea at the ready helped. Not using it for my next round of Taxol because I've opted for the longer biweekly sessions x4 rather than 12 weeklies and, to be honest, I'd had enough.  it was worth it for an extra 2mths of hair but not enough to warrant a 4 week extended treatment Hope that helps  Toni x",
      "MessageIndex": 126,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hey Maggie B Echoing what everyone else has said.   These first days are the hardest while you process the initial shock and find out the details before you can make your treatment plan.  For me,  i hooked onto the fact that research has cone so far that this is one of the most treatable forms with a high success rate (and I repeat it to myself on a regular basis) These next few months you'll find that you are stronger than you know and how precious your friendships are.  Don't be afraid to lean on those who love you it helps them too and know you are not alone. I love Barcelona and, if I have my way, I hope to be moving out there at some point next year when this is done with.  in fact I'll be out the in Sept visiting friends if you need a friendly ear. Big gentle hugs Toni A",
      "MessageIndex": 290,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": " Hey gang and hello to all the new ladies (sorry to see so many new names but you're in good company). Are we all cooking in this heat?  it's a week since I started my Taxol round (fortnightly x 4) and so far SEs are quite light except for hot flushes which is just what is needed in this weather :?   Also a bit twingey on my joints/bones but more uncomfortable than outright painful.  Still have hair on my head AND eyebrows/eyelashes which I'm still surprised about. Oh but chemo brain is very much in situ.  I'm expecting to find my cat in the fridge at some point... Wishing everyone a normal week Much love ladies x",
      "MessageIndex": 211,
      "PostDate": "23/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hi Ladies I'm back after my break and had my first Paclitaxel yesterday. it's been a good couple of weeks.  Had another ultrasound at my midway appt with my breast surgeon.  Really good news is I've responded well to the AC.  My tumours have shrunk significantly to point they are looking fragmented rather than one mass as I started.  My lymph nodes have also gone down, they are now barely visible and I'm still only halfway thru my treatment.  I also had a break up in the Austrian mountains so all that healthy clean (And cooler) air means I'm ready for the next stage.  And I had to shave my legs yesterday for 1st time in 2mths.. Yesterday was much gentler albeit longer than the AC chemo not least because I've given up the ice cap.  Obviously it's too early to know what SEs will come other than expected hair loss but so far so good and I'm feeling very positive. I fully empathise with you ladies who are getting the nausea, fuzzy head, poor sleep, energy crashes etc but hopefully these will pass soon and you'll get the good results to make it all worthwhile. As always big gentle hugs and wishing you as normal a week as possible. Toni xx",
      "MessageIndex": 110,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Here's my kitty Nurse Jasmine who has been sticking to me like glue when I've been stuck at home",
      "MessageIndex": 266,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Aw  Shiny, that sucks, no wonder you're feeling low.  LeoLady is our resident guru so her advice is always sound, definitely make the call because you should be able to get more support.  Will cross my fingers you get some brighter news soon. x Hey TheScriptFan, sorry to hear you've been suffering.  One extra nugget to the advice already given re eating little and often is not to let yourself get hungry because, ironically,  that can bring on the nausea/heartburn.  I keep a supply of bananas handy for just this.  Hope it's easing up now but if not, get onto your Cancer nurse.  I read somewhere that the best patient is the worse patient i.e. moans about everything since there's a good chance something can be done to help so don't suffer in silence xx Like everyone else I'm struggling in this heat but have made it into the office so taking FULL advantage of the aircon.  Heading up to Durham this weekend to visit friends before Taxol #2 on Monday.  Still minimal SEs so fingers crossed this continues.    Is it time to start a rain dance?  I swear I'll be doing a full on Saturday Night Fever the next time I spot a cloud.. Have a good weekend my lovelies xx",
      "MessageIndex": 257,
      "PostDate": "26/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hey Earwig_o Same here with the tiny veins.  I have a port and it's been an absolute godsend so hang in there, it will make all the difference.   I had 2nd Taxol yesterday means I'm now 3/4 of the way thru.  Yay!  SEs much milder than AC so biggest annoyance is the hot flushes throughout the day but chemo nurse has recommended Sage leaf supplements so will give that a go. 6 down, 2 more to go.. Have a good week ladies xx",
      "MessageIndex": 296,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160713/july-breast-cancer-chemo-club",
      "Title": "**** July Breast Cancer Chemo Club ****"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "So about to go into AC #3.  Have used cold cap twice but had a lot of hair loss this last week or so.  I'm going to have another go tomorrow but if it's still the same then will ditch it and accept the baldiness.  I'll probably use mostly scarves and turbans but would like to look into a wig (for 'best').  Can any London ladies recommend anywhere?  I'm happy to spend a moderate amount but nothing crazy for the sake of a few months.   Any advice, tips, shared experience is much appreciated Thank you Toni xx",
      "MessageIndex": 0,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158859/wig-shopping-advice",
      "Title": "Wig shopping advice"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hi all My first post ahead of my first AC chemo tomorrow.  This will be 1 of 4 (biweekly) before 12 weeks of Taxol chemo with surgery sometime in Sept/Oct. I think I'm as prepared as I can be so feeling relatively calm and ready to go but also inspired by the spirit I see here.  ",
      "MessageIndex": 95,
      "PostDate": "11/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Thanks ladies -  loved the boobies cakes :D Same from me Debbie xx Still doing ok here.  no nausea just a bit acidy in the evenings.   Bad constipation and I'm also past due my period so feeling bloated ready to pop.  Cracked open the laxatives yesterday and necking water as much as I can so hopefully will do the trick.  Last day on anti sickness meds today and if all goes well I may attempt the office tomorrow. Toni x",
      "MessageIndex": 120,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "I've got 12 weeks of Paclitaxel too once I finish this first lot.  Think im getting off lightly so far so taking advantage.   Having a go of getting to the office today.  (nb not because I have to, but getting stir crazy at home).  Being single (with strong support of close friends) has it's advantages in that I can't bear to be fussed over.  That said, even the cat is bored of my company so it's time for some human interaction. UPDATE journey was ok.  Used my blue badge on tube for first time and was given a seat no questions asked.  Made me a bit teary. (I'm prone to little bubbles of emotion at the mo).  London commuters aren't always grumpies. x",
      "MessageIndex": 138,
      "PostDate": "15/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Yay!  This stoopid chest cold is on the mend.  Not going to rush it but hoping I'll feel well enough for work on Monday before round 2 of \"Keep yer hair on!\" therapy next week. I think I've actually benefited from my increased napping ability aka \"Hmm I feel a bit tired, I'll just close my .....zzzzzz\"  Its certainly nice to feel human again.  Happy Saturday folks xx",
      "MessageIndex": 177,
      "PostDate": "19/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hey Loubag.    Yes I got that a bit plus my eyesight/focus has been a bit off to.  Nothing much but enough to notice. Feeling very grumpy today.  Have managed to get a chest infection so spent morning at clinic getting checked.   It's just a virus but has totally slammed me.   Reminds me how pathetic I get when I'm ill (in real life instead if Cancerworld).  Thankfully that rarely happens just lousy timing this week. 《grumble, grumble》",
      "MessageIndex": 156,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "So 1st one done.  Worse part was the first 10 mins of the ice cap.  id been warned but it was truly hideous - made me cry and want to puke but wore off quickly and rest was fine.  In fact my friend and I were cackling so loud at one point I think we woke some nappers..  Last night I fancied pizza but ate one slice too many so had a churny tum all night but no vom (lesson #1 learned).  Was a bit woozy this morning but otherwise ok.  Took all meds no probs including jabbing myself for first time.  Needed a nap but that's my usual Saturday response when the weather is grim  (just call me Dormouse) so far so ok.   Early days I know but it's still a step forward.  much love my fellow lady warriors PS my surgery is post chemo later this year so I'm thinking of having a bye bye boobie party.  Would that be too grim? ",
      "MessageIndex": 103,
      "PostDate": "12/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Welcome 8uttercup.  You'll find a lovely group of ladies here to hang out with.   ",
      "MessageIndex": 146,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Diamondmum I get it.  it's hard to know what you should or shouldn't worry about.  Before this I've always been a grin and bear it girl.  Now I'm monitoring everything.  Determined not to go loopy over least little thing but it's not easy when you've had all yr warnings about vigilance.   Fingers crossed you'll stay comfortable x",
      "MessageIndex": 127,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Violet25 definitely don't feel bad.  I barely managed a day and now I'm all bunged up and grizzly.   Learning very quickly to take each day as you can.  xx",
      "MessageIndex": 162,
      "PostDate": "16/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Congratulations summerholiday that's great news.  Hope you have a lovely bank holiday weekend to celebrate xxx",
      "MessageIndex": 198,
      "PostDate": "24/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Violet25 yes I'm looking forward to saving some money/time with waxing&shaving Yesterday's session has sledgehammered me more than 1st time but also slept badly so a bit wiped out.  More nausea this time but eating something takes edge off.  Good news this week is that I'm now doing 4 biweekly Taxel instead of 12 weekly after this cycle of AC so already 25% done and all over by August.  Happy days.",
      "MessageIndex": 205,
      "PostDate": "26/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Having a rough week.  Scalp still sore and starting to shed.  Stupid cough from my week 1 cold won't shift and I'm feeling exhausted so haven't made it to work this week.   I'm supposed to be going out tomorrow for my birthday tomorrow but at moment can't even get off the sofa.   Feeling proper grumbly. :(",
      "MessageIndex": 207,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "I think I was quite lucky with my first treatment but unlucky catching a chest cold.  What I haven't liked is trying to find the balance between taking the appropriate level of care of myself without turning into a neurotic mess.  Constantly asking myself how I'm feeling and making myself stay at home longer than I normally would in these circumstances is compromising and I don't like it.  But it's too early in the process to get my knickers in a twist so I suppose you just have to suck it up and get on. I'm hoping I've kicked this virus enough for round 2 on Friday (it's at the uglier than it sounds phase). Oh and I was due to have my period the weekend of the first treatment but there's been no sign except a fairly epic breakout.   Sorry if I sound a bit grim, a university friend's husband passed away yesterday after a 2 year battle.  I'm not close to them but it's hit hard especially when a mutual friend has referred to my own 'battle'.  It's not the same but it's still rattled me a bit.",
      "MessageIndex": 192,
      "PostDate": "23/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hi Coll.  Im on a diff treatment so can only advise on cold cap after my 2nd session today. TBH  It isn't pleasant but the worst of it only last 10 mins before becoming tolerablr.  So I'd recommend having a go and trying to stick it out.  Today I followed other's advice of paracetamol beforehand and a warm drink ready to hand which definitely took the edge off. Good luck xx",
      "MessageIndex": 201,
      "PostDate": "25/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "So back home after spending my birthday and yesterday in hospital after my white cells took a nose dive and chest cold decided to have a party. I hate making a fuss but it's a good example of why it's so important to keep tabs on yr temperature and ALWAYS call in if you're feeling under the weather after a chemo session",
      "MessageIndex": 213,
      "PostDate": "02/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Tibu315",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tibu315",
      "Content": "Hi Violet25 Thank you. There'll be other birthdays I guess and I was feeling so grotty I wasn't in the mood anyway. Trigger for me to raise alarm was my temperature hitting 37.8-38 degrees.  After calling clinic they admitted me straight away and did a full suite of blood tests plus nose/throat swabs and chest x-ray.  I was then put onto IV antibiotics and monitored. Antibiotics were quick to kick in so temperature came down and tests came back clear other than an 'infection but because WBC was down and still falling they kept me for another day on IV antibiotics.  Have been sent home with another 5 day supply and some booster jabs for the white cells. I should add I'm receiving private care thanks to insurance through work but I'm guessing the procotols for tackling the infection will be similar Bottom line is that they take it very seriously so I was told it was absolutely the right thing to call in when I did (and arguably I should have called sooner)",
      "MessageIndex": 215,
      "PostDate": "03/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    }
  ]
}