{
  "AuthorID": "Tiggy80",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tiggy80",
  "Posts": [
    {
      "AuthorID": "Tiggy80",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tiggy80",
      "Content": "Hi there, I finished my chemo in May last year (3xFEC and 3xTAX), and used the cold cap with pretty good results. I was fully prepared to lose my hair (well, as prepared as you can be) but I never even wore my wigs! Shame really, they were really lush ;) I agree with everything TMJ said! The only things I would add would be: get yourself a silk pillowcase as it's much more gentle on your hair (and helps with temperature control) use an organic natural shampoo (this worked a dream: http://www.boots.com/en/Naked-Care-Mildness-Unadorned-Sensitive-Shampoo-250ml_853919/) but don't massage your scalp too much - the less you mess the more you keep don't, whatever you do play with/brush/pull at your hair, use a wide toothed comb. I ended up wearing a soft cotton bonnet under my scarves purely to stop me fretting over whether my hair was falling out or not! Don't worry about losing bits here and there, I lost about 50% volume but with some genius combing over and clipping apparently no-one could tell... I would use the cold cap again if I ever need to, partly because it gave me some thread of control back but also because now I have this gorgeous crop which I don't think I'll grow, I love it. If you take some painkillers before you leave for the hospital it makes a huge difference. Also if you can try some yogic breathing, close your eyes and try to relax as the cap goes on then you will be more relaxed about the whole thing.  The pain wasn't really that bad for me after I relaxed into it. Good luck with your treatment. Once you start it'll go pretty quick. Rest and recover, Tiggy",
      "MessageIndex": 8,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49418/cold-cap-does-it-work",
      "Title": "Cold Cap. Does it work?"
    },
    {
      "AuthorID": "Tiggy80",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tiggy80",
      "Content": "Hi Flower, I just wanted to reply to you to try and reassure you. I was diagnosed with primary breast cancer on December 1st 2010 aged 30. I found the lump myself having felt under the weather for ages. Being fit and healthy and newly married, I never imagined that I'd get this indiscriminate disease. Getting the diagnosis stopped my care-free, hopeful life in its tracks. Everything changed in that instant. Planning our family, travel plans and even getting a mortgage became a minefield. What had done wrong?! I'd always been fit, healthy and exercised regularly. Surely they had got it wrong, even the consultants were shocked. Things moved so quickly after diagnosis. MRI scan, CT scan and a bone scan all within a week, my head was spinning. It turned out that I had a 31mm grade 3 tumour in one breast and a 11mm grade 2 in the other, both primary and completely independent. Neither had reached my lymph nodes but they were aggressive buggers so both had to whipped out on Christmas Eve. I was cancer free for my first wedded Christmas, all be it dosed up on Tramadol! When you first get the news your world crumbles. But you pick yourself up and plough through the treatment, taking it one step at a time. Believe me, you will know yourself and your body so much better by the end of it. I once felt that my body had betrayed me, but know I see it as having fought this off and protected me from its spread. I'm so proud of it for coping with everything the cancer threw its way, and the treatment was healing not \"poisoning\" as one of my friends put it. Please please don't hate your body, support it through the treatment and you'll be far better for it. Nurture yourself, be kind to yourself and you'll get there. If you have any questions about the treatments or concerns about how you feel please feel free to ask. I'm very open and honest and really don't mind.  You are never alone in this, we're here to help and support you every step of the way. Tiggy x",
      "MessageIndex": 30,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46338/age-37-shock-at-breast-clinic-yesterday-totally-dazed-and-reeling-need-help",
      "Title": "Age 37 shock at breast clinic yesterday. totally dazed and reeling..."
    },
    {
      "AuthorID": "Tiggy80",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tiggy80",
      "Content": "HI Flower, It is normal to feel in a spin. I honestly don't know how I got through the last year, and have trouble believing it actually happened. Truth is that your mind and body will get you through, because you have to. I never thought I was a strong optimistic person, but you'll find the inner strength I promise. I hated the \"pity\" look that some people used to give me. Well I didn't need pity so I surrounded myself with positive, proactive people and got rid of the others. Some people get scared when they find out, as it shows that this can happen to anyone. And, yes, they are glad that it's not them, but that doesn't mean they are glad it is you. They just wish this never happened to anyone. I also get upset and angry with other people who just seem so care free. It's not fair is it? They don't seem to appreciate what they have, that naivety has been stolen from you and you never get it back. But you get a new appreciation for life and love, a stronger bond to your loved ones and a fierce true passion for life. It will be a new life, one that you guard far more than your previous one and one that you will find the strength to fight for.  Allow yourself to be angry, to cry and then take a deep breath. Fill yourself up with love and courage, and steel yourself for the next few months. You will get through. You will find it within yourself (as no-one else can do this for you) to get yourself through.  But ultimately, be gentle and kind to yourself. Tiggy x",
      "MessageIndex": 32,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46338/age-37-shock-at-breast-clinic-yesterday-totally-dazed-and-reeling-need-help",
      "Title": "Age 37 shock at breast clinic yesterday. totally dazed and reeling..."
    },
    {
      "AuthorID": "Tiggy80",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tiggy80",
      "Content": "Hi Mandy, I was diagnosed yesterday with BC, grade 3 lump of 2.5cm in size. It was a shock for everyone, including my GP and the consultant as I'm only 30. It hits you like a train, but secretly I knew the lump wasn't normal so I'm the least shocked out of everyone. My parents don't know yet, but my sister and new husband have been wonderful. It's interesting that someone else is feeling pains and discomfort - you're not alone i've just come back from my GP having been so worried during the night with aching and a pain which seems to come from within the lump. I think it's only normal to be hyper-aware of any aches now, and if you're really worried get them checked out. There are no stupid questions afterall.... My mind-set is split today. Staying strong and trying to carry on as normal when you're not so certain of the near future is really tough. But, you know, the lump is there, it shouldn't be and i want it gone. Now. The flip side is the fear, the unfairness and worry about telling family and friends. I know it will break my parents' hearts when their daughter tells them, espeicially as I got married 9 weeks ago and we were just starting to think about babies. I worry how they'll take the news. My sister is 7 months pregnant, and although she's my rock, I worry that she'll be affected and that people will feel they can't be happy for her whilst I'm going through this hell. My new husband looked shell-shocked, and I hate to be cause of his worry. And will my friends stick around?! Being worried or anxious is not going to change the wait or the outcome. I know this, but I hate not knowing.  Logically I know that I have to wait until a treatment plan has been divised (probably a lumpectomy followed by chemo), and all the doctors have to meet up etc, but hurry it along please! I've never been good at playing the waiting game, and accepting that this is out of my hands is probably the toughtest things about all this. I don't want pity, but understanding. I don't want to loose my hair, but I'm already looking into using my own hair to make into a wig. I don't want my fertility to be affected, but will be meeting a fertility specialst next week to discuss egg harvesting.I don't want this to happen to me, but it has. And it's crap. We have to use the anxiety and nervous energy producively. We're not on our own, we're here with everyone else and there seems to be a great support network. Stay strong and post here if you're having a wobble, I'll definately be a regular visitor. Sending hugs, Kate  ",
      "MessageIndex": 20,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33201/the-wait-from-diagnosis-to-surgery",
      "Title": "The wait from diagnosis to surgery"
    }
  ]
}