{
  "AuthorID": "Tilly57",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tilly57",
  "Posts": [
    {
      "AuthorID": "Tilly57",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tilly57",
      "Content": "Thank you for all your replies. The Oncologist put me in for this test, still not sure why though? The SNB was clear intraoperatively,  and my Surgeon said that it was so unusual to have a False/Negative she could not understand it happening as the incidence of this she said was 1%. When the specimen went to Histology that is when they found Tumour in the SNB. I am a Retired Cancer Research nurse, but my Brain went to mush re anything medical when my husband was diagnosed with Motor Neurone disease ( a slow form of it PLS) 3 years ago.  My background in research has been no help whatsoever, as I just cannot think straight. But I have looked at the Phase 3 they are doing(  POSNOC) and would be interested to see what happened results wise in Phase 1 and esp 2?  Does anyone know? Thankyou all so much for your replies, I appreciate it and to know there are others going through this nightmare too. Tilly.",
      "MessageIndex": 4,
      "PostDate": "20/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113598/metasin-testing",
      "Title": "Metasin Testing"
    },
    {
      "AuthorID": "Tilly57",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tilly57",
      "Content": "Metasin Testing intra operatively. Hi, has anyone else had this test? I was told that my Sentinel node biopsy was negative a week ago, only to learn today that the test was False/Negative and I need Axillary clearance. Very fed up. Tilly",
      "MessageIndex": 0,
      "PostDate": "19/08/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/113598/metasin-testing",
      "Title": "Metasin Testing"
    },
    {
      "AuthorID": "Tilly57",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tilly57",
      "Content": "Hi, I had a Grade 2 15mm lump removed in August and axillary clearance for one  node. I have asked for the Oncotype DX test as it is licensed for people with 1-3 nodes.  I really didn't want Chemotherapy unless absolutely necessary and may still need it. This test seems to be the favoured test in UK, it involves sending some of the Tumour tissue from the original lump to USA for genetic testing to see if it is high risk or low risk of recurrence.  If low risk then the possibility of no chemotherapy. I am waiting on this result in 3 weeks time. Nb It may be licensed for other things as well I am no expert but just sharing what I know  so far. Worth asking about.",
      "MessageIndex": 50,
      "PostDate": "11/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/115380/natural-v-chemo",
      "Title": "Natural v Chemo"
    }
  ]
}