{
  "AuthorID": "TMJ",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tmj",
  "Posts": [
    {
      "AuthorID": "TMJ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tmj",
      "Content": "The short answer is no. I used the cold cap and it worked and I never used my wig. Your hair still falls out so you need to be gentle and not pull on the roots. Some people say to use a wide tooth comb but I still used my brush and my hairdryer. Chemo really weakens your hair so treat it with care.",
      "MessageIndex": 2,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51111/if-the-cap-fits",
      "Title": "If the cap fits..."
    },
    {
      "AuthorID": "TMJ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tmj",
      "Content": "I am 32 too, I got diagnosed in July and had no choice but to have a mastectomy with full lymph node removal. I did have the choice of reconstruction at the same time but because it would mean a delay I decided not too as I just wanted it out of me as quickly as possible. Plus I am having radiotherapy and was told this could damage the new boob and as mine are so big really didn't think I could cope with it going wrong. Can't say a I'm over the moon about it but everytime I look at my smilly face scar abeit a little lopsided, I just think thank god it's not there anymore. If I had of just had a lumptectomy I know I would be more worried about it coming back. I still worry about the other one everyday.",
      "MessageIndex": 2,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45231/advice-on-surgery",
      "Title": "advice on surgery"
    },
    {
      "AuthorID": "TMJ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tmj",
      "Content": "Just wondering if anyone taking tamoxifen has had a really long period. I am currently on day 18 of my period. I came off the pill a year ago and have had a period every 28 days since. Eventhrough chemo but as soon as I started the tamoxifen the last two periods were two weeks apart and this last one was 35 days. It's a lot heavier than normal and it's driving me crazy. I have been to my GP who said well you've had cancer so you had better talk to your oncologist. Luckily I have a really understanding onc who told me it was in the realms of normal. What I want to know is when does it come out of the realms of normal? When will my period stop? I do have another GP appointment tomorrow not with the same woman though. Hopefully this next one will care more about me and not just look at the cancer",
      "MessageIndex": 0,
      "PostDate": "25/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/51051/ridiculously-long-period",
      "Title": "Ridiculously long period"
    },
    {
      "AuthorID": "TMJ",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tmj",
      "Content": "I just wanted to say that the cold cap worked for me. I always hear on this site that it doesn't work and just wanted to let you know that it can. I did however have a very thick head of hair and my actual hair was thick. My Tips are 1. Make sure you have the right size cap. It must touch the top of your head. After my first session of FEC my hair started to fall out in clumps and I was very worried that it wasn't working. At round three  I found out that I had the wrong size cap on by this time I was very thin on top but had a great comb over :-) 2. Don't wash your hair in the morning of treatment. You will need to wet it and put conditioner on it just before putting on the cap. I used the same amount I would have if I was washing my hair. 3. make sure its a non smelling conditioner, after my first round I can no longer smell Dove conditioner :-( even now 8 weeks past my last chemo I can't stand the smell. 4. Some one told me on here to take a painkiller 30 mins before the cap was put on. It helped wonders with the headaches. I forgot the first time around and my headache was really really bad. 5. Really really tighten the strapes on the hat the closer to your head the better 6.  Wrap up warm its freezing under that cap. Putting something warm around your neck will help.. 7. Grin and bare the first ten mins it true that your head just goes numb. 8. Wait ten mins after the cap is turned off before taking the cap off. it will pull at your hair if you don't. 8. Take a really warm hat for when the cap comes off. I kept my on for probably about 4 hours after as it helped with the headache.  9. Don't wash your hair for at least two days after. I used a hydrating shampoo after to try and keep it healthy looking. 10. don't panic if your hair is falling out. Mine fell out all the way through, but by round 4 it started growning back :-) 11. Been really gentle with your hair. It really thins your hair and weakens the roots. The less you touch it the more that stays in. This also goes for the shorter it is the less weight you have pulling on the root. I hated all 19 hours that I had the cap on and wanted to give up on it at every round. Now I am now glad that I had my husband holding my hand tight and telling me I could do it. I just recently had my haircut one because i looked like I had a mullet and two all the new growth was sticking out everywhere making me look like I walked through a bush backwards every morning, so I had it all cut to one length its very short but I know it will all grow at the same time now.   Good luck and hope all goes well.",
      "MessageIndex": 7,
      "PostDate": "29/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/49418/cold-cap-does-it-work",
      "Title": "Cold Cap. Does it work?"
    }
  ]
}