{
  "AuthorID": "Tnny",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tnny",
  "Posts": [
    {
      "AuthorID": "Tnny",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tnny",
      "Content": "Thank you for your reply Lesley. I will try and keep you updated. Margaret's hair is starting to fall out and this is just another reminder that she is fighting a battle although at times it is unseen. Tony",
      "MessageIndex": 2,
      "PostDate": "01/09/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10774/newly-diagnosed",
      "Title": "newly diagnosed"
    },
    {
      "AuthorID": "Tnny",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tnny",
      "Content": "Hello everyone Well like so many people I have read about on this site my life and that of my partners has been turned upside down and up and around and every which way with the diagnosis of breast cancer. It seemed relatively straight forward with a little lump which we were sure would be nothing and now some four months on my partner ( Margaret) has been through a WLI. Mastectomy and lymph node removal. She has been told that of the 31 nodes removed 25 showed abnormalities and that after a CT scan and bone scan that secondaries had been discovered in her bones, lung, back and rib. We do not as yet know the full details as to be honest Margaret is just too terrified to ask what is going to happen to her. At the moment she has had her first lot of chemo which was a nightmare as she was sick for a week and is now terrified of her next lot which is due to start on the 9th. Margaret is the most loving and kind person I have ever known and has five beautiful kids and a lovely grand daughter only a year old. I feel like I have stepped into a waking nightmare and can see no way out. I keep reading statistics about survival of stage 4 cancer and I need to find some hope somewhere I feel like I am going crazy with the pressure of it all.",
      "MessageIndex": 0,
      "PostDate": "30/08/2008",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10774/newly-diagnosed",
      "Title": "newly diagnosed"
    }
  ]
}