{
  "AuthorID": "Tracy12050",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracy12050",
  "Posts": [
    {
      "AuthorID": "Tracy12050",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracy12050",
      "Content": "Thank you for your lovely reply Daisydoo - it brought tear to my eye because that’s all I want to do too this holiday.  I’ve got a 7 year old little boy and this whole journey has affected him as much as me although he’s been mighty strong for most of it.  I just want to make loads of memories and have fun with him and make up for the times i couldn’t take him out or play with him whilst having the chemo.   I’m so sorry to hear about your secondary diagnosis - I hope it’s treatable.  Sending you much love and wishing you a wonderful summer with your loved ones xxx ",
      "MessageIndex": 2,
      "PostDate": "28/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165039/holiday-whilst-off-sick",
      "Title": "Holiday whilst off sick"
    },
    {
      "AuthorID": "Tracy12050",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracy12050",
      "Content": "Hi everyone its been a while since I posted.  I’ve gone through 8 chemo sessions and had bi lateral WLE surgery on the 28th June. I’ve had the all clear which is fantastic news, however I do still have to have radiotherapy which is due to start around the end of August. I managed to work, albeit from home and at a reduced capacity, throughout my chemo, however following my surgery I decided to take some time off sick to fully recover.  My doctor has signed me off until my radiotherapy has finished and longer if needs be.  As we have a few weeks until my radio starts we’ve decided to book a holiday for some well deserved family time, however, I’m a little worried as to whether or not work will get funny with me doing this and how I stand legally.  Has anybody any experience or are there any HR professionals on here that may offer some advice? Hope everyone is doing well and coping with the weather!  Thank you xxx ",
      "MessageIndex": 0,
      "PostDate": "27/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165039/holiday-whilst-off-sick",
      "Title": "Holiday whilst off sick"
    },
    {
      "AuthorID": "Tracy12050",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracy12050",
      "Content": "Thank you Clare - really appreciate you taking the time to respond to me.  Work have been fantastic which is why I  wanted to check what my rights were as I would hate them to think I was taking advantage.  I can look forward to the break now and enjoy time with my family without the dreaded C word hanging over us all!   Enjoy your weekend xxx ",
      "MessageIndex": 5,
      "PostDate": "28/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165039/holiday-whilst-off-sick",
      "Title": "Holiday whilst off sick"
    },
    {
      "AuthorID": "Tracy12050",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracy12050",
      "Content": "Morning ladies  So I just had my last docetaxel last week at a reduced rate due to neuropathy in my finger tips.  Whilst the docetaxel hasn’t floored me it hasn’t been a walk in the park and like many of you I’ve had various side effects.  I’m due to change on the FEC for my next four cycles and wondered if the side effects are supposed to be worse or better?!?!?! I know we’re all different and chemo effects us differently but I’m starting to get a bit panicky about the change in side eeffects as I hate being sick and I’ve managed to avoid that on docetaxel!  Hugs to you all",
      "MessageIndex": 113,
      "PostDate": "10/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/151415/march-2018-breast-cancer-chemo-club",
      "Title": "***March 2018 Breast Cancer Chemo Club***"
    },
    {
      "AuthorID": "Tracy12050",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracy12050",
      "Content": "Thank you Deb09 and Aspen - you’ve both put my mind st ease a little.   Deb - the side effects from the docetaxel weren’t pleasant but were doable.  They didn’t kick in until day 2 for me which was the Saturday.  I had achy limbs (controlled with pain killers and at it’s worse with cocodymol), oral thrush (again controlled with prescribed medication), metallic taste, extreme fatigue and muscle fatigue and then on my second session I got the neuropathy as well as pains in the soles of my feet.  My third session was delayed by a week due to the neuropathy as my oncologist was concerned at the length of time I had it and the severity.  (2 weeks and I couldn’t even help my little boy do the buttons up on his school shirts).  By the time my 3rd session was due the numbness had gone but I was given a reduced dosage as my oncologist didn’t want to chance his arm and create a life long condition for me.  I was supposed to have four rounds of docetaxel but the fourth has been cancelled.  I’ve had it very slightly again this time but no where near as bad as round 2.  They can apparently prescribe a prescription vitamin which helps if you do get it so it may be worth asking about it.  I also had a little bit of nausea but nothing major as like you say I took the anti sickness drugs religiously even when I didn’t feel sick and I carried on for 6 days following the chemo but weaning myslef off them from day 4. I used to drink at least 2 litres of fluid the day before, the day of and the day after chemo because come the Saturday I really struggled to get the fluids in because of the oral thrush and disgusting furry taste in my mouth.  Come day 7 I was feeling ok but clearly then into the low immunity week so needing to take care.  I’ve had one stay in hostpial for 4 days with neutropenia but that’s thanks to a 6 year old bringing home all the playground germs!!!  Good luck - hope it goes well!  Let me know how you get on and thank you for the response x ",
      "MessageIndex": 119,
      "PostDate": "10/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/151415/march-2018-breast-cancer-chemo-club",
      "Title": "***March 2018 Breast Cancer Chemo Club***"
    }
  ]
}