{
  "AuthorID": "Traction",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/traction-",
  "Posts": [
    {
      "AuthorID": "Traction",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/traction-",
      "Content": "Hi LP61  I had a mastectomy last Thursday,  so I can relate to how you may be feeling right now. I had sentinel node biopsy before surgery as they did some bubble mapping. However, they did do another lymph node biopsy and biopsy on a mass they found which is a possible infection.  It's a cliche, but try not to worry although that's so hard to do. Make sure you eat well over the next couple of days as Thursday could be a long day for you. I had to be at the hospital for 7am and I went to theatre at 15:30 and I'd had nothing to drink all that time. If they advise you to drink 250 ml water at 6am make sure you do that as it will help you keep hydrated.  Have someone with you on the day of the surgery so that they can help keep you calm and occupied whilst you are waiting.  Over the next couple of days try and keep busy seeing friends and family, getting those jobs done that you have been promising yourself will do but haven't got round to; but leave yourself an hour or so to think about the surgery too if you need to. It's ok to be scared, I was. I also took a photo of my breasts so that I have it to look back on if I ever want to. I knew that after surgery I would never look the same again as I was. Try and find happy things to do too over the next couple of days, things that will make you smile during your recovery.  After surgery take all the help you can get from your family and friends as they will help you through this.  Once you wake up from your surgery your tumour will be gone as your surgeon will want to do the best he/she can for you.  I am sending you positive vibes, a hug and lots of love. Please let us know how you go on and I'm here for you if you need to chat or ask any questions Take care, Trish xx",
      "MessageIndex": 2,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165669/apprehensive",
      "Title": "Apprehensive ....."
    },
    {
      "AuthorID": "Traction",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/traction-",
      "Content": "Hi Kathleen Sorry you have had to join this site, but welcome to a group of very supportive people.  I've only been recently diagnosed (13th July) so I can't offer much information. However, I did go through the 10 day wait which is very very hard. From going to see my GP it was 6 weeks for me to be fully diagnosed, but my consultant gave me \"the chat\" when they did the biopsies. In my case he thought once was cancer and one was a cyst, turns out both lumps are cancer. It is a good idea to have a note book and paper - I found a note book better as my mind has been all over the place, I've lost keys, bank cards, glasses etc so I would lose individual pieces of paper lol. Someone advised me to set aside 2 x half hour sessions a day to think about the lumps and diagnosis etc and then try and put it out of your mind and keep busy. It is easier said than done, so try if you can to still see friends, neighbours etc and have a laugh if you can. It will be tough with looking after your mum too.   I wish you the best of luck with your diagnosis, I'm sending you a big virtual hug Take care, Trish xx",
      "MessageIndex": 5,
      "PostDate": "30/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/165165/hello",
      "Title": "Hello!!!"
    },
    {
      "AuthorID": "Traction",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/traction-",
      "Content": "Hi lindsaybubbles  I'm so sorry to hear your news, I've had a mastectomy but only the 1 surgery. I found a lump and was referred to the breast clinic. I was examined by the consultant then had mammogram, ultrasound and biopsy and went back in to see consultant. Cut a long story short, they found a second area which was giving them great concern, consultant prepared me for cancer on that area but felt certain the lump I found was. a cyst. 10 days later, on  Fri 13th July  I went for results expecting to be told a lumpectomy only to find both areas cancer and I needed a mastectomy. Mammogram and ultrasound still showed it as a cyst, only the biopsy showed cancer  No 2 ways about it, as it was in 2 areas then it had to come off, i wasn't given a choice, no amount of denial or trying to persuade the consultant otherwise would change the outcome. I was totally devastated.  My surgery took place on 2nd August a reconstruction using an implant was planned but due to having an undiagnosed infection that couldn't be done so I woke up flat on one side.  In  2 1/2 weeks I went from diagnosis to surgery.  I'm 52, so if you want to message me I will try and help you the best I can, it's been a hell of a shock so I know where you are coming from. Be kind to yourself, cry if you need to, speak to your breast care nurse if you have questions or need a chat to check things out,, my nurse is really nice and I can talk very frank to her, I even swore in front of her on my diagnosis day.   I'm sending you a bug virtual hug, I know that isn't of much comfort to you at this moment. sending lots of love your way Trish xx",
      "MessageIndex": 4,
      "PostDate": "14/08/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/166162/looking-for-mastectomy-buddy",
      "Title": "Looking for mastectomy buddy"
    }
  ]
}