{
  "AuthorID": "TracyTD",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracytd",
  "Posts": [
    {
      "AuthorID": "TracyTD",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracytd",
      "Content": "Hi ladies and gents, Ok ive not been on this site for quite a while due to illness and life in general. In nov 2012 I was diagnosed with tnbc stage 1 , grade 3, 19/12/12 I had sentinal node removal axilla removal and lumpectomy. As the tumor was quite large and aggressive I had quite a large piece of my breast tissue removed as ithe tumor was  situated on my chest wall, I underwent 6mths of chemo to include three of taxotere, then 29 sessions of rads to include 5 booster treatments. I am now 5 yrs into my remission 22/8 this year, although it hasnt been easy ,found a shadow on my liver which came back clear also had to have 8 biopsies taken from my bowel as suspected cancer there ,came back clear. Im also still getting a lot of tenderness on chest wall and around anchor scar wound ???. Although im truly grateful to be here and for the treatment given ,at the same time im very very low, The surgery has had a bad impact on my self esteem and confidence, I wont let my partner see me in the nude unless its dark ,im conscious of clothes I wear ,as even though I wear a prosthetic breast I hate it ,I know its there and I do look uneven and dont have much of a cleavage, my chest below collar bone looks flat ,im very very depressed and seeing a phsycologist atm. I had very voluptuous breasts before surgery now my good breast is huge 36dd ,whereas my treated breast is very much smaller ,,I actually asked my partner to look and tell me if there was a huge difference to which he replied yes ,the only time ive let him look. So I enquired about having enhancements one to my treated breadt and a small op to bring my bigger breast inline and as firm as my other one ,I was told I couldnt because of radiotherapy also there was a risk with scar tissue, However I do know ladies that have had this done and also had rads and have scar tissue, yes I accept its a risk but doesnt mean to say it will happen ,theres a risk with all surgery, if I couldnt get it on nhs ,I would try to save and pay towards or in full, This has totally destroyed my  confidence and my relationship to the point we split  last year as im just so unhappy with how I look, I used to be so over confident always bubbly and laughing . Can someone advise or help im desperate. Tracy.",
      "MessageIndex": 0,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159742/breast-ebhancement-after-lumpectomy-for-tnbc",
      "Title": "Breast ebhancement after lumpectomy for tnbc"
    },
    {
      "AuthorID": "TracyTD",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracytd",
      "Content": "Hi Jo ,ive mentioned this surgery a few times and with no luck ,I also mentioned it at my last visit to breast unit where I saw Mr Turtons understudy in Leeds , She basically said that all women have one breast slightly larger than the other, to which I replied im not all women and not all women have had tnbc ,also my breast is three times larger than the affected one ,im just a statistic ,I told her that the surgeon offered me a reduction and I told her what I told him ,im not willing to have my larger breast made smaller the scarring is bad as ive seen it close hand with a relative she had a refuction. Im nost asking for dolly bloody partin ,just want back what I had , My bcn was bloody useless all she could talk about was how god himself suffered etc etc , Hence to say I came away devastated. Tracy x",
      "MessageIndex": 4,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159742/breast-ebhancement-after-lumpectomy-for-tnbc",
      "Title": "Breast ebhancement after lumpectomy for tnbc"
    },
    {
      "AuthorID": "TracyTD",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tracytd",
      "Content": "Hi mistey moley ,my partner says he loves me as I am ,I asked him to be truthful ,this has affected me in a much bigger way than I thought it originally would tbh. My patrner and I have since reunited and although he tells me it makes no difference to him ,I myself cant accept looking as I do ,I totally hate my body. Im a person that has always looked after my figure gym gymnastics trampolining keep fit classes. Yes I was offered the option of surgeon cutting open a perfectly healthy breast to make it smaller ,I refused ,I dont see the logic if its not broken why try fix that one ,plus the scarring is a lot worse ive seen it done that would only add to my anxiety. I had no counselling after treatment as I thought I could cope ,I didnt realise what a huge impact this wiuld have on my everyday life, Tbh my breadt cancer nurse was useless all she could talk about was god !!!  Thank you for your reply. Tracy.",
      "MessageIndex": 3,
      "PostDate": "18/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159742/breast-ebhancement-after-lumpectomy-for-tnbc",
      "Title": "Breast ebhancement after lumpectomy for tnbc"
    }
  ]
}