{
  "AuthorID": "Trainj",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trainj",
  "Posts": [
    {
      "AuthorID": "Trainj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trainj",
      "Content": "I have had two new hips, one with and one without cement, and plenty of chemo.  As far as I can tell, absolutely no effect on the cemented one, or the non-cemented one - which was only done in January this year - I've been on Carboplatin half the year.  Had Carbo and Taxol a couple of years ago, which didn;'t affect the cemented one - I shouldn't worry about that - however - Maybe you might have a different chemo which MIGHT affect it, so look it all up on the Internet, side effects, etc.  Sure if it's there, you'll find it.... Best of luck.  You've got to have the surgery, and you already are NOT having chemo - so why should the knee surgeon think you suddenly might?????   Breast care nurse is right - the nurses are usually more sensible than the docs, I find.... Have fun, enjoy Xmas and don't worry.   (by the way, my chemo was NOT for BCa.  My Bca was the same as yours. )  J",
      "MessageIndex": 6,
      "PostDate": "20/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102651/chemo-effect-on-knee-replacement",
      "Title": "Chemo effect on knee replacement"
    },
    {
      "AuthorID": "Trainj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trainj",
      "Content": "Nicola Jane sell nice ones, not fabulous ones, but mostly good.  Did you know that if you have private insurance, it may pay for post-mastectomy bras, and/or prostheses.   Joan",
      "MessageIndex": 7,
      "PostDate": "05/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100464/pretty-post-mastectomy-bras",
      "Title": "Pretty post mastectomy bras????"
    },
    {
      "AuthorID": "Trainj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trainj",
      "Content": "Most of the silicon prostheses come with their own little cover.  Mine did, and so did the temporary ones.  ",
      "MessageIndex": 11,
      "PostDate": "07/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/100464/pretty-post-mastectomy-bras",
      "Title": "Pretty post mastectomy bras????"
    },
    {
      "AuthorID": "Trainj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trainj",
      "Content": "I am sure you won't lose the use of your arm, giglingertie  - I had lots of cording, and frequently get lumpiness in armpit, etc. but my arm is fine.  massage gently on surface of skin outwards, away from the armpit.  Also under the armpit and down, towards other lymph nodes, and even across the breast area to the centre of chest, where there are more lymph nodes.  Helps with drainage and decreases lumpiness.  Let me know how you get on.  Joan. ",
      "MessageIndex": 25,
      "PostDate": "14/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Trainj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trainj",
      "Content": "I had clearance  (17 taken) wnen only 3 were 'involved', WITH The mastectomy for DCIS.  Had the needle-through-the-nipple job, too. I get lymphoedema mainly at top of arm and into armpit - still can't raise my arm above my head without it hurting.  None of this is a perfect solution.    AND I had uterine Carcinosarcoma a few months later and a lengthy story goes with that, too......Not for this forum.  Joan",
      "MessageIndex": 10,
      "PostDate": "31/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Trainj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trainj",
      "Content": "Fortunately, I was warned to stretch the arm after lymph nodes were removed;  had lots of 'cording' and it still hurts now - probably I didn't stretch enough.  But I was measured by the lady who does Manual Lymphatic Drainage, so that it doesn't build up where it can't drain, and I have a pull-on elasticated sleeve which I use for travelling, but not much else.  As long as you rub upwards, up the arm, and away from the armpit, towards other lymph nodes which ARE there - look for a map of them on the Internet - you may find you can manage without the sleeve.   It's fluid and it can be pushed around - very near the surface of the skin, so so need to press hard.  Let me know how you get on.  or get an MLD person who does it clinically, not a beautician, to have a go initially and show you how to do it.  ",
      "MessageIndex": 12,
      "PostDate": "01/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104534/lymph-node-surgery",
      "Title": "Lymph node surgery"
    },
    {
      "AuthorID": "Trainj",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trainj",
      "Content": "You've just reminded me - I had that trouble a year or two ago - I've had breast CA and Endometrial MMMT (also known as Carcinosarcoma) - which is meant to be even worse, but I have been lucky and it's not - except for the mets to the lung, which are boring.  ..... - but the facial fuzz must have gone because I'd forgotten about it.  I think it was after chemo, (carboplatin and Taxol) or when I was on Tamoxifen or Arimidex.    Honestly, I think it just went away, but a friend I met at the Cancer centre Pilates class had the same thing, she said.  I must ask her how she's doing....  I also get lots of hot flushes, and cramps, and a bit of neuropathy, and 2 weeks ago developed a severe allergic response for Carboplatin - so am going in to be desensitized in hospital in a couple of weeks, so I can continue on it - for the MMMT lung mets.  My Breast Ca has it seems not returned to haunt me, so far..... ",
      "MessageIndex": 19,
      "PostDate": "11/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96243/i-m-growing-a-hairy-furry-face",
      "Title": "I'm growing a hairy,furry face!!!"
    }
  ]
}