{
  "AuthorID": "Tricia10",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
  "Posts": [
    {
      "AuthorID": "Tricia10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
      "Content": "Does anyone have any positive experiences of a particular diet for helping the body combat cancer? My father (20 year ago) read a book about a grape diet and he religiously stuck to that but it didn't help him overcome his bowel cancer. Recently I have been told that a particular diet could cure my M.E. I realize this is very different, but whilst reading books on this diet cancer is mentioned and various authors do say that while not claiming to cure it, it will really boost the immune system which means the chances of overcoming most illneses are far greater. Tricia.",
      "MessageIndex": 0,
      "PostDate": "20/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10958/diet",
      "Title": "Diet"
    },
    {
      "AuthorID": "Tricia10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
      "Content": "Poet40, I'm so sorry for causing any upset here. I agree with you that you were in no way trying to promote anything and I really did appreciate your reply. I am going to try the diet which has been recommended to me, it is not a fad diet and is well-balanced. My doctor approves it and it is used in clinics around the world, including where cancer patients are being treated. It's not alternative in any way, just a very healthy diet which helps patients' own bodies cope with treatment, at the same time enabling their immune systems to work efficiently. But I have to say, because of Gary's response, I will be reluctant to mention it, even if the results mean I am in perfect health after a few months. Good luck to you and thank you.",
      "MessageIndex": 4,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10958/diet",
      "Title": "Diet"
    },
    {
      "AuthorID": "Tricia10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
      "Content": "Renee, I had heard that breast cancer is painless and I had tried to reassure my mum who had a lump and pain in her right breast, back in March. Fortunately, I did encourage her to see her GP straight away and she soon received an appointment at the hospital. She has now had a mastectomy. I wonder how many people ignore breast pain because of such a misleading statement. Coincidentally I have had pain in my right breast since my mum's began. Because I have felt no lumps at all I have been ignoring it. Perhaps I shouldn't? Tricia x",
      "MessageIndex": 5,
      "PostDate": "06/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10797/breast-cancer-tnt-in-lymph-node-but-not-spread-anywhere-else",
      "Title": "Breast Cancer TNT, in Lymph Node but not spread anywhere else"
    },
    {
      "AuthorID": "Tricia10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
      "Content": "Dear Ktb, sorry for not replying sooner. I wanted to thank you and Noj for your messages. I would be very grateful if you would let me know how you get on with your radiotherapy. I'll send you a PM and I'll be thinking of you on Monday. Tricia x",
      "MessageIndex": 6,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10944/advice-for-my-mum-please",
      "Title": "advice for my mum, please"
    },
    {
      "AuthorID": "Tricia10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
      "Content": "Ktb, I have been thinking of you and just came to see how you were getting on. I'll send you a PM at the end of the week. Tricia x",
      "MessageIndex": 7,
      "PostDate": "16/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10944/advice-for-my-mum-please",
      "Title": "advice for my mum, please"
    },
    {
      "AuthorID": "Tricia10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
      "Content": "Sue, Kate and Noj, thank you so much for your detailed replies. I am so impressed with this site. Noj, I'm pretty sure that my mum has a CC nurse, but she hates to 'bother' them. I will encourage her to ask questions though. I wish she'd let me go to her appointments with her. Despite being 85 she's so independent! One quick question, is it usual before radiotherapy to be warned of possible lung damage (mum might have misheard this anyway)? I don't know if my mum's age makes a difference. Good luck to you all and thanks again. Tricia x",
      "MessageIndex": 4,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10944/advice-for-my-mum-please",
      "Title": "advice for my mum, please"
    },
    {
      "AuthorID": "Tricia10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
      "Content": "Liz, thank you for your message. I will go to your blogs and pass on your message to my mum. I'm pleased to hear how well your treatment went. Yes, I can believe that about what people said. My own brother told my mum not to even consider surgery at her age, he added that she'd die in hospital because the medical staff wouldn't take much care of someone her age. Tricia x",
      "MessageIndex": 9,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10944/advice-for-my-mum-please",
      "Title": "advice for my mum, please"
    },
    {
      "AuthorID": "Tricia10",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tricia10",
      "Content": "I don't have a great deal of information, but please can anyone offer advice? My 85-year-old mum has been very independent and so I know few details of her cancer, and she has not asked too many questions herself. She felt a lump (painful) in March, had biopsy and was told the lump would be removed followed by radiotherapy. The surgeon then said there was a second lump and she'd prefer a mastectomy and then probably my mum would not need radiotherapy. Mastectomy went well, but fluid has had to be drained from site of wound for four weeks, is this unusual? Mum's producing oestrogen and has been prescribed Arimidex. She's reluctant to take this (her friends with breast cancer didn't need to) but I presume it is very important? Nine lymph nodes were removed and two had cancer cells so she will now need radiotherapy. She was initially told that it would be five days a week for five weeks, but then the surgeon said she could get it over with more quickly with higher doses once a week. Mum wasn't happy about this and the surgeon then suggested three times a week (for three weeks, I think). Mum's doctor (at the hospital) has reassured her that she can have a reduced dose as first recommended - daily over the five weeks - if she so wishes (don't know if surgeon will agree!). My mum has been told she may experience slight burns, would this not be worse if the radiotherapy is increased? Also, is there any difference as far as treating the cancer is concerned? My mum has just had a scan, is this usual before radiotherapy commences? She's really depressed and worried that a scan is only done if the doctors believe the cancer has spread. How tired is the radiotherapy likely to make my mum? She is very fit for her age. Thank you in advance to all who read this and ANY replies would be appreciated. I've been reading the messages here and I find you all an inspiration. I belong to a self-help group of a very different kind and this forum is quite a contrast!",
      "MessageIndex": 0,
      "PostDate": "06/06/2009",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/10944/advice-for-my-mum-please",
      "Title": "advice for my mum, please"
    }
  ]
}