{
  "AuthorID": "TriciaAp",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triciaap",
  "Posts": [{
    "AuthorID": "TriciaAp",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triciaap",
    "Content": "Hello Petrosa, First of all, I am  sorry that you find yourself in this situation. You will receive more replies from others who know more about your particular circumstances and who can give you a more detailed and relevant reply but I wanted to get an early response to you in the hope of easing your  distress and giving you at least some reassurance. We have all been where you are now, the worst times as we go down this road are the times when we're waiting for something to happen, like an appointment date or the results of a scan. You don't say whether you have a scan date but if you ae still waiting for that, keep making phone calls pushing for a date (shy bairns get nowt). You are your number 1 priority so make sure you get a date as early as possible  do all in your own power to get an appointment sorted. The NHS treatment is brilliant, but if you have any access to a private health policy like BUPA - you may be able to get an earlier scan date by going privately. When I started out on my journey I received a letter with a scan date 3 weeks away, I called BUPA to see if it was possible to try and have the scan done privately and by going to a different hospital and going private I managed to have my scan and initial consultation the following week. So if you or hubby have a private health policy through your employer that may be something to look at. If not, keep calling until you get a date arranged. Cancer treatments are improving all the time and there most certainly is light at the end of the tunnel. The statistics we read are all historic and are all averages so don't get too hung up on them. We are all individuals and we all respond differently - whilst chemo is not a particularly pleasant experience, it can beat cancer so make it your friend. Whilst most of us suffer some side effects, they're usually nowhere near as bad as the possible side effects that are explained to us before we embark on this journey We cannot help but worry but we need to find a way to keep things in perspective and be positive and stay strong, not just for yourself but for your husband and daughter too. Have a good cry or a huge rant when you need to and then get your positive head on and take back control. The site is full of brilliant written information but also post whenever something is bothering you because there are hundreds of great people on this site who know more than we do and are willing and able to reassure and help us all in any way they can. Be positive and stay strong. Tricia x",
    "MessageIndex": 1,
    "PostDate": "27/01/2016",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104340/stressed-out",
    "Title": "Stressed out!"
  }]
}