{
  "AuthorID": "trish 6",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trish-6",
  "Posts": [{
    "AuthorID": "trish 6",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trish-6",
    "Content": "amy66 Hi everyone I go into hospital next Thursday night ready for my mastectomy/ANC on Friday. I hope this doesn't sound like a daft question, but what is the best stuff to take to put on when I leave bearing in mind the drain etc? Also am I OK wearing jeans or better with something that doesn't take much fastening or effort to put back on? I have no idea of what to expect in terms of movement in my arm, it's my right side and I'm right handed.   Sorry if these sound like silly questions but I'd be very grateful for any advice/practical tips. Thank you xxx  hello there  I had my masectomy my right side aswell on the 12th of December 2024.. before hand I Googled an awful lot about before and after my op... I would advise to iether make a heart shaped cushion  filled with capox and fill it to the brim.. you will need to have this cushion under arm pit right arm after your op... I made my own and took them with me...the other thing I did was to adapt my PJS tops.. by undoing the seam on right side of top ..then make  the two open sides new seams then sow on poppers from the top of the arm of your PJS to the bottom.. space them out.. then when you have to be checked you only have to unpop the right side of PJS top and your dignity is kept for your left breads as it's not in display.. also your tubs can be placed between each popper and stick out of your PJS top and tubes can sit in the little bag they give you and bag handle over your shoulder..  This made me feel that I had my dignity at all times when any nurses/Doctors are wanting to examine you... hope this helps you..  By the way you may have a rib ache this is the rib that sits just under your breast... if you do don't let your breadt care nurse fob you off saying it will be better I'm a few weeks.. NO it doesn't believe me... its been 2 yrs for me and it's still sore...can I ask if you have had Radiation yet or have you had talks about it... I need to give you a few tips.. 1.. if your told you will be marked up for where the radiation needs to sapp you... the marks they do are Tattoos. . 3 or more big dots on your chest and they look like big black heads after your session or finished. .. now you can refuse this as I did.. I don't want to be reminded the rest of my life of the stupid dots.. and they are permint. .. and horrid and it bloody well hurts when gbdy do it. This is your right.. and no they can't refuse to give you radiation because you refuse to be Tattooed. . Your the patient it's your body not theirs..  your in charge.  After your op and all's well with healing etc. . Please please use E45 cream twice a day up to your radiation and for a couple of months after as your skin needs protection before and after..  I don't know how you are copping with all if this... but I didn't cop, I rebelled against every one and every body... and would tell all Doctors and oncologist to F....k off and leave me aloan.. chemo put me in hospital more than I was at home... I've been very very ill through all my treatment/s and would never ever go through this again.. I'm in remission woop bloody dos.. NOT interested. . All I want back is my reconstructions which I hope I will have a date in September this year ... I'm having the free tram flap.. which my breast will be constructed from my tummy skin.. Iv done so much reserch on this procedure that I could do the op my self...but not on me..lol  Good luck with all that you choose. .  Regards Trish.. from England. Xxxx",
    "MessageIndex": 10,
    "PostDate": "03/06/2016",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109923/practical-post-mastectomy-stuff",
    "Title": "Practical post mastectomy stuff"
  }]
}