{
  "AuthorID": "triumph",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
  "Posts": [
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "I had double mastectomy in February and no reconstruction I'm very happy with my decision I'm 57 for me was easy choice going from GG cup to nothing have found great clothes no more surgery also lymph nodes positive so I'm just out enjoying life have you seen flat friends some great advice on there no more bras for me",
      "MessageIndex": 24,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131714/just-had-another-mastectomy-without-reconstruction-anyone-else-decided-on-this-option-how-you-feeling",
      "Title": "Just had another mastectomy without reconstruction. Anyone else decided..."
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "I was so lucky my surgeon did both mine on a balance issue so didn't have to see anyone I was very clear from the start that I didn't want reconstruction and I don't wear anything apart from clothes haha only been 5 months but I'm so happy everything has healed although it's uneven I'm ok with that as it was big operation in the end and 6.8 lb flesh removed just very grateful that she was able to do it at one operation now I'm getting out living my life",
      "MessageIndex": 26,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131714/just-had-another-mastectomy-without-reconstruction-anyone-else-decided-on-this-option-how-you-feeling",
      "Title": "Just had another mastectomy without reconstruction. Anyone else decided..."
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "I had double mastectomy in February and no reconstruction I'm very happy with my decision I'm 57 for me was easy choice going from GG cup to nothing have found great clothes no more surgery also lymph nodes positive so I'm just out enjoying life have you seen flat friends some great advice on there no more bras for me",
      "MessageIndex": 9,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131714/just-had-another-mastectomy-without-reconstruction-anyone-else-decided-on-this-option-how-you-feeling",
      "Title": "Just had another mastectomy without reconstruction. Anyone else decided..."
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "I was so lucky my surgeon did both mine on a balance issue so didn't have to see anyone I was very clear from the start that I didn't want reconstruction and I don't wear anything apart from clothes haha only been 5 months but I'm so happy everything has healed although it's uneven I'm ok with that as it was big operation in the end and 6.8 lb flesh removed just very grateful that she was able to do it at one operation now I'm getting out living my life",
      "MessageIndex": 11,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131714/just-had-another-mastectomy-without-reconstruction-anyone-else-decided-on-this-option-how-you-feeling",
      "Title": "Just had another mastectomy without reconstruction. Anyone else decided..."
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "Maybe see what percentage they give you chemotherapy for me only added 4% benefits so I declined it even though I have 4 positive lymph nodes I had double mastectomy I'm 57 and my children are all grown I had radiotherapy and with surgery and radiotherapy my own percentage of being here in 10 years is 75% I stopped letrozole as didn't like side effects am waiting to discuss this with GP everybody is different and reacts differently to treatment I think in the end we have to decide what is right for us individually best of luck to you and your family ",
      "MessageIndex": 11,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136247/delaying-chemo",
      "Title": "Delaying chemo"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "It's really hard to not think of anything else I'm stage 3 and if it comes back they can't cure me I do wake in night and can't clear my mind so usually read until I'm tired I'm very lucky that I'm 57 and my children have grown up and have 7 grandchildren I have to try to not think about it and hopefully will be here for some time nobody knows what future holds even people without cancer wishing you and your family all the best x",
      "MessageIndex": 35,
      "PostDate": "07/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135289/new-diagnosis---feel-like-i-m-living-a-nightmare",
      "Title": "New diagnosis - feel like I'm living a nightmare"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "hi I'm new to this first month I was prescribed femera by oncologist then dr gave me accord femera had less side effect so asked to have femera again but only given accord gp say are only allowed to prescribe one month at a time but nobody has checked me or spoken to me to see how I'm doing have since found out its because of cost by looking on here . what I don't understand is why are we given it first month when we cant have it from GP and why is it on all the leaflets we are given?",
      "MessageIndex": 14,
      "PostDate": "12/05/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/128153/supply-of-letrozole",
      "Title": "supply of letrozole"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "It does get very confusing I chose bilateral mastectomy as I chose no reconstruction and had large breasts so for me I’m very happy with that I had radiotherapy and 4 positive lymph nodes the medical team can advise you and we can make final decision I chose not to have chemotherapy as for me was only small benefits my surgery was February and now I’m living life to the full I’m lucky my children are grown up and I have seven grandchildren I’m 57 I also tried hormone therapy but didn’t like side effects everyone of us are different and we all have different opinions and choices for me my choices are right for me hopefully when you have surgery you will know more wishing you all the best and stay positive x",
      "MessageIndex": 8,
      "PostDate": "08/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/139537/surgery-in-10-days-then-no-idea",
      "Title": "Surgery in 10 days, then .... no idea"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "Amanda had almost identical outfit on today maybe we gave her the inspiration haha maybe we can start a new trend x",
      "MessageIndex": 4,
      "PostDate": "26/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140879/thinking-positive-going-on-this-morning-show",
      "Title": "Thinking positive Going on this morning show"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "Hi just thought I would say that life goes on I had double mastectomy without reconstruction and live flat big change from 34GG my surgery was February yesterday I appeared on This Morning show on ITV in the fashion section there were four ladies all having had breast cancer had a great day and I tried clothes I had never considered lots of firsts heels, colour red, jump suit , big earrings so just wanted to say to anyone feeling down life goes on I never imagined I would be on live TV I’m just an ordinary woman with a great family and I try to live life to the full however long that may be x",
      "MessageIndex": 0,
      "PostDate": "25/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140879/thinking-positive-going-on-this-morning-show",
      "Title": "Thinking positive Going on this morning show"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "I'm the same as you I can't change it or predict the future I declined chemotherapy and have stopped taking letrozole after 2.5 months as couldn't cope with aches and pains and hot flushes I'm 57 off to Germany next week to pick up my new car with my husband and driving back through Austria staying at amazing places one overlooking a fantastic lake I have felt well all through everything and want to live as much as I can while still well had double mastectomy no reconstruction and radiotherapy no one can tell me if cancer has gone or not have stage 3 as 4 lymph nodes positive if it comes back I will deal with it then for now I'm enjoying life",
      "MessageIndex": 9,
      "PostDate": "14/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131730/abnormal-lack-of-feelings",
      "Title": "Abnormal lack of feelings?"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "Hi I was 36GG decided to have double mastectomy as I didn't want reconstruction or to wear prosthetics I'm very happy with my decisions great place to look is flat friends who give great advice I have been adamant that I don't want reconstruction even though I'm asked every time I have appointment with any dr maybe I'm strange obviously not many go for it my surgeon decided she could do it on balance issue and am so glad she did as all done in one go nobody notices unless I tell them I wear tops with pockets and as long as it's not a skin tight t shirt I'm ok everybody is different that's just what I wanted and my family have supported me all the way x",
      "MessageIndex": 11,
      "PostDate": "18/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133874/advice-please-reconstruction-or-not",
      "Title": "Advice Please....Reconstruction or Not??"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "I had six years of mammograms and given all clear in 2015 and told to go to screening van ever three years I think because my name came up for first I got letter to go November 2016 thank goodness after biopsy was told two small areas but also lymph nodes in February had bilateral mastectomy as I have chosen not to have reconstruction and had large breasts luckily my surgeon agreed four lymph nodes affected decided against chemotherapy as only 4% benefits in my case had radiotherapy and currently not taking hormone therapy because of side effects I'm 57 have a great family and I am enjoying my life to the full I am very happy with my decisions everybody will have different stories and advice you have to wait for the information and between you family and surgeon decide what is best for you we all have different stories wishing you well stay positive we can't change what's happened just live life to the full x",
      "MessageIndex": 13,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135952/mammogram-recall",
      "Title": "Mammogram recall"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "Oncologist gave me femera first month then GP gave me accord it was like chalk and cheese great with femera no side effects really bad joint pains and loads of hot flushes with accord rang surgery and asked for femera and was given accord so I stopped taking it saw oncologist on Monday she gave me month of femera and I'm now signed off from her so have to sort it out with GP I have stage 3 as cancer in 4 lymph nodes had double mastectomy no reconstruction and declined chemotherapy as only would have been 4% difference in benefit so it's my last chance of it not coming back but if GP says I can't have it I will stop taking it as side effects were so bad I guess I will have to see when I go to get next months ‍♀️",
      "MessageIndex": 14,
      "PostDate": "11/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133318/letrozole---side-effects-and-supplements",
      "Title": "Letrozole - side effects and supplements"
    },
    {
      "AuthorID": "Triumph Fit Advisor",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph-fit-advisor",
      "Content": "Hi Emma, I'm a Fit Advisor for Triumph, hopefully I can help. Being as prepared as possible is a great attitude and no questions are daft! Firstly, you don't always need a specialised mastectomy bra; there are plenty of soft, non-wired or sports bras that can work for you. For the weeks following your surgery you should wear whatever is comfortable - a front-fastening non-wired or sports bra in your normal size is fine, so long as the underband is not too tight and there is no digging in to the tissue whatsoever. Once you have started recovery and the tissue is healing (usually six weeks post-surgery) I'd recommend you go for a bra fitting before being fit for the prosthesis, in order for the hospital staff to correctly assess your prosthesis size. You will still need to be in a non-wired bra in a comfortable fabric until the scarring has healed and the swelling has gone down, which can take anywhere from six to eighteen months, depending on your own healing process. The new bra should also be fit to the natural breast and the prosthesis fit to this size. The things to look for are: A non-wired style in a comfortable fabric. Deep wings to avoid any pressure on the scars and to secure the prosthesis. A full cup with a deep centre front (no plunge styles!). A stretch frame for comfort and flexibility. Avoid underwires, especially after your reconstruction as the reconstructed breast could take on the shape of the underwire, and avoid seam-free cups as they can leave a puckering around the nipple area. Best of luck for your surgery and for a smooth recovery. Best wishes, Rachel (Triumph Fit Advisor)",
      "MessageIndex": 13,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72264/mastectomy-bra---daft-question",
      "Title": "Mastectomy bra - daft question"
    },
    {
      "AuthorID": "Triumph Fit Advisor",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph-fit-advisor",
      "Content": "Hi George, Jackie, We do have a number of bras suitable for post-operative wear, that are comfortable with or without a prosthetic. We do always recommend having a fitting in person with a trained Mastectomy fitter, as every woman fits differently and has different requirements. If you're a smaller cup size, A-D, then the non-wired bra of our best-selling range, Amourette 300, is a good choice. It's an all-over stretch lace with very comfortable, adjustable straps. Amourette 300N http://bit.ly/1k94ZKw Or for larger cups, the non-wired Doreen is great Doreen N http://bit.ly/1k953tK You can also try out a sports bra which many women find more comfortable; I would recommend our Workout range. Triaction Workout N http://bit.ly/1k95bJO Feel free to get in touch if you have any more questions or you'd like any fitting info and I can get back to you in a couple of days. Best wishes, Rachel",
      "MessageIndex": 15,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/72264/mastectomy-bra---daft-question",
      "Title": "Mastectomy bra - daft question"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "The way I see it they can't tell me if cancer has gone I have stage 3 and even if I take them it might still come back anyway or it might not ‍♀️I never took the pill or HRT so after trying it and really didn't like side effects so I stopped haven't even seen a GP spoke to one who told me he couldn't prescribe vitamin D just get a supplement and that's the only contact I had so no faith in them monitoring me I guess I just have to get on with life",
      "MessageIndex": 10,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134788/stopping-letrozol",
      "Title": "stopping letrozol"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "I totally agree despite being told if cancer comes back they won't be able to cure it have 75% chance of being here in 10 years with surgery and radiotherapy so that's what I chose tried letrozole for two months and then stopped quality for me I'm only 57 but I want to enjoy whatever and whenever I can have great family that is my choice only you can decide what is right for you x",
      "MessageIndex": 7,
      "PostDate": "31/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/134788/stopping-letrozol",
      "Title": "stopping letrozol"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "I had 4 lymph nodes and stage 3 ask what % chemotherapy will give you for me was only 4% extra benefits so I decided not to have it as it's very harsh treatment but everybody is different and once you have information it's easier but still difficult I had double mastectomy and no reconstruction which I'm very happy with although I'm always asked by drs when are you having reconstruction stay strong and make your choices ",
      "MessageIndex": 8,
      "PostDate": "08/07/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/133210/metastatic-lymph-node",
      "Title": "Metastatic lymph node?"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "Hi I'm 57 and have stage 3 because it's in 4 out of 12 lymph nodes I'm lucky two of my daughters live just near me and other one 2 hours away they have been great my husband and son as well I'm not sure my girls agreed with my choices not to have reconstruction I had double mastectomy in February and declined chemotherapy I have 75% chance of being here in 10 years with surgery and radiotherapy and that's what I had however they have been very supportive of my choices I have also stopped hormone therapy at moment as I didn't like side effects I have felt really well throughout and hopefully will stay well nobody can predict the future so enjoy life while you can is my moto carpe deime not sure that's spelt right but you know what I mean best wishes ",
      "MessageIndex": 11,
      "PostDate": "15/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131766/confusion-about-stages-and-grades",
      "Title": "Confusion about stages and grades"
    },
    {
      "AuthorID": "triumph",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/triumph",
      "Content": "Same thing happened to me first month femera then giving accord wow difference was crazy joints ache hot flushes all day and night I actually stopped taking it when my next oncology appointment came she said try femera again as she can only prescribe one month I would have to see GP if I take it 7.5 % less likely to come back so I took femera for 12 days and although not as bad was worse than when I first took it so came to decision to stop taking it took at least two months to feel normal again I’m 57 even if I take it cancer can still come back for me quality of life is most important and by the way when I went to see GP she was very relieved that I didn’t want the femera as my oncologist wrote to them to ask for me to have it she didn’t try to talk me into taking it hopefully I have made right decision only time will tell and I have had a great year despite double mastectomy and being stage 3 hope this is of some use for you ",
      "MessageIndex": 6,
      "PostDate": "07/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/141817/letrozole-issues-again-need-advice",
      "Title": "Letrozole issues AGAIN! Need advice"
    }
  ]
}