{
  "AuthorID": "Trojan50",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trojan50",
  "Posts": [
    {
      "AuthorID": "Trojan50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trojan50",
      "Content": "You are a brave lady ! Thank you .... yes positive thinking is the only way. I initially felt that by getting the all clear   And then having to subject myself to chemo and mx was crazy, but now starting to process it all, and reliize that this will enable me to get on and be clear and move on with the rest of my life. Xxx",
      "MessageIndex": 9,
      "PostDate": "08/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116083/brca-1-the-journey-chemotherapy-and-more",
      "Title": "Brca 1 ... the journey .... chemotherapy and more !"
    },
    {
      "AuthorID": "Trojan50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trojan50",
      "Content": "Morning Julia and lynn Thank you for your reply , I have never been one to join in discussion, but I am glad I have, your comments have been really helpful . I am her2 negative  It was oestrogen positive . And proposed meds are letrozole . You are right I have been very lucky to of been caught early and I can't fault the NHS for there care.  Wishing you both well  Amanda xx",
      "MessageIndex": 3,
      "PostDate": "08/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116083/brca-1-the-journey-chemotherapy-and-more",
      "Title": "Brca 1 ... the journey .... chemotherapy and more !"
    },
    {
      "AuthorID": "Trojan50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trojan50",
      "Content": "Hi  I was diagnosed with the brca 1 gene. I decided to get tested as was on a screening programme for ovarian cancer as had strong family history with this. I decided to have my ovaries removed. Then was picked up by breast clinic to be monitered. They pushed for me to have a double mastectomy but at the age I was I decided not to do it. I attended yearly mammograms and last year went on a new screening programme using MRI screening. This years appointment was just after my 50th birthday .  I was recalled and was told that they thought I had dcis. I had a biopsy which confirmed this . Then after many appointments more MRI's I eventually had wide local excision. The result of that was that there was an area of ductal lobular.  I was then sent back for a Lymph node biopsy which at last some good news was negative ! So I get told, brilliant you are clear BUT as I am a brca carrier you now need  Chemotherapy/ radiotherapy and tablets or chemotherapy and a double mastectomy and tablets !!! My dielma is still ongoing as now have to decide  the next part of this journey ! But I know my life will never be quite the same again x",
      "MessageIndex": 0,
      "PostDate": "07/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116083/brca-1-the-journey-chemotherapy-and-more",
      "Title": "Brca 1 ... the journey .... chemotherapy and more !"
    },
    {
      "AuthorID": "Trojan50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trojan50",
      "Content": "Hi jo, Thank you for your message. Although different your story has hit a nerve as so similar. It is nice to talk to other people going through similar situations. I would love to stay in contact and follow your journey. I don't think I have an option but to have chemo and yes I am thinking the same thing double mastectomy. My husband is being very supportive but feels alternative medicine is the answer.. although I can see it can help I don't feel that this will give me long term chance of being clear, and that's what this is all about .  How did you feel in having chemo for the first time, I must admit the thought terefies me !! I will have to decide next week and think Chemo will start early November . I wish you well Jo with everything xxx",
      "MessageIndex": 5,
      "PostDate": "08/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116083/brca-1-the-journey-chemotherapy-and-more",
      "Title": "Brca 1 ... the journey .... chemotherapy and more !"
    },
    {
      "AuthorID": "Trojan50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trojan50",
      "Content": "Thanks R, That's really helpful, I won't be working either, same reason as yourself. They are talking about a round of 4 over 12 weeks so I'm comparison my course is short !  How did you cope with hair loss ?? I have found everyone comments so helpful and inspiring thank you xxx",
      "MessageIndex": 8,
      "PostDate": "08/10/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/116083/brca-1-the-journey-chemotherapy-and-more",
      "Title": "Brca 1 ... the journey .... chemotherapy and more !"
    },
    {
      "AuthorID": "Trojan50",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/trojan50",
      "Content": "Hi This is all very interesting as I have just finished chemotherapy and just about to begin the road of letrozole. The side effects do not sound good. Thankfully after reading your comments I feel more informed. Still only half way through my journey which started in May16. Talking on her has been great ! Keep up the good work ladies x",
      "MessageIndex": 6,
      "PostDate": "28/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121818/what-brand-of-letrozole",
      "Title": "What brand of letrozole"
    }
  ]
}