{
  "AuthorID": "Tyne-e",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tyne_2d00_e",
  "Posts": [
    {
      "AuthorID": "Tyne-e",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tyne_2d00_e",
      "Content": "Hi ladies, Not sure if this helps but I have read this post with interest as I'm going to be having herceptin also by iv and asked the nurses today what the criteria is for the injection version, she said that it's dependant on weight you have to be 80 kg or under so I have 6 weeks to lose 2 kg I think it's doable, not sure if this is the same for all areas I'm in London. Hope this helps Martyne xx",
      "MessageIndex": 13,
      "PostDate": "15/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/75049/herceptin-by-injection",
      "Title": "Herceptin by injection"
    },
    {
      "AuthorID": "Tyne-e",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tyne_2d00_e",
      "Content": "Hi nic, Glad you're getting it checked out..... I'm 32 so yes bc is possible for younger women to have, but also remember that most breast lumps are not cancer. The most important thing you can do is get it checked good luck Monday fingers crossed its nothing. I also wasn't told anything on the day had to wait 10 days for results (it's the worst part all the waiting) try not to worry to much xx Martyne xx",
      "MessageIndex": 6,
      "PostDate": "18/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73757/is-this-normal-not-possible-surely",
      "Title": "is this normal? not possible surely?"
    },
    {
      "AuthorID": "Tyne-e",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tyne_2d00_e",
      "Content": "Hi Sara, i had triple positive BC I have finished active treatment and am on tamoxifen. Before starting tamoxifen my oncologist said that due to my age 33 my periods would most likely come back and he didn't seem concerned with this. My understanding is that tamoxifen works by stopping oestrogen from bindimg to cancer cell therefore starving them and not allowing them to grow, it does not stop you from producing oestrogen. I know that some oncologist like to use zolodex if periods do come back and others don't. I would speak to your oncologist and get his opinion but I'm glad my periods came back as I want more children in the future. Take Care Martyne xx ",
      "MessageIndex": 8,
      "PostDate": "13/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96506/ovary-removal-er-bc",
      "Title": "OVARY REMOVAL ER+ BC"
    },
    {
      "AuthorID": "Tyne-e",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tyne_2d00_e",
      "Content": "Yep chemo every 3 weeks, just completed the 3rd round of FEC on Tuesday I have been extremely lucky so far and have sailed through with absolutely no side effects except hair lose... They change drugs next time to the T part (not looking forward to potential new side effects occurring and the unknown) but I'm halfway through the chemo ride and just have to keep remembering that it's making me better :-) I have to have a year of herceptin which starts with next chemo, surgery after chemo (lumpectomy hopefully) then radiotherphy and tamoxifen for at least 5 years so a long ride for me but at least I know I'm doing everything I can to beat this... The waiting for results is the hardest part you will feel better once your treatment starts xx",
      "MessageIndex": 7,
      "PostDate": "08/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76379/30-and-just-diagnosed-with-breast-cancer",
      "Title": "30 AND JUST DIAGNOSED WITH BREAST CANCER"
    },
    {
      "AuthorID": "Tyne-e",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tyne_2d00_e",
      "Content": "Hi Lucy, I'm 33 was diagnoised just before my 33rd birthday in March have a 2 year old... My tumour is quite large although they can only guesstimate it's between 27mm and 60mm so I'm having chemo before surgery also have spread to lymph nodes at least one... Anyway I had a ct scan befor chemo started which was all clear I think it a pretty normal procedure so try not to worry. My tumour is triple positive do you know what yours is will you be having chemo?? I've been so lucky and haven't had any side effects so far!! And am halfway through have also just been told my lump has shrunk by a third so at least I know the treatment is working. Good luck try not to worry but I know it's hard Martyne xx",
      "MessageIndex": 1,
      "PostDate": "08/05/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/76379/30-and-just-diagnosed-with-breast-cancer",
      "Title": "30 AND JUST DIAGNOSED WITH BREAST CANCER"
    },
    {
      "AuthorID": "Tyne-e",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/tyne_2d00_e",
      "Content": "I had a diep and have also had a c section, all they did was a scan with dye to check how well the veins carried dye to see if they would be suitable. Haven't had any issues however I will say the recovery time is around 6-8weeks but my results are fantasic and def think I made the right choice, also bmi was around 28 at the time of surgery and c section had only been done 3 years prior. ",
      "MessageIndex": 4,
      "PostDate": "16/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125059/diep-after-c-sections",
      "Title": "DIEP after C-Sections"
    }
  ]
}