{
  "AuthorID": "Under Par",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/under-par",
  "Posts": [
    {
      "AuthorID": "Under Par",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/under-par",
      "Content": "LondonLass my heart and a huge hug goes out to you. As others have said, this is just not good enough. You shouldn't be left feeling like this.  I don't know if I'm allowed to make a plug for a different charity, but if you are in London then look up the number for The Haven immediately. They have people who can help you, advise you and literally see you through this for free. Stay strong, I know it's easy to say, hard to do on your own, but you have come this far. My old Dad used to say\"it's the squeaky wheel that gets the oil\" so I wish you the strength to start sqeaking- very loudly.  We are all with you on this one. X",
      "MessageIndex": 51,
      "PostDate": "10/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119339/how-to-make-gp-understand-that-i-m-struggling",
      "Title": "How to make GP understand that I'm struggling?"
    },
    {
      "AuthorID": "Under Par",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/under-par",
      "Content": "Hi, I am 6 months post surgery now and still have a seroma too. They stopped draining it after a couple of months so my sounds slightly slightly different. It remained and went really hard after my radiotherapy and went like a tennis ball. I had some physio and it has shrunk slightly, plus I started some quite strong stretches and exercises to try and make it feel more comfortable. I was getting really frustrated with it.  I has reduced a bit more now, so it's like a ping pong ball, but still hard. My consultant is going to try and drain it for the final time this Thursday and then inject some steroid. So I'll let you know how it goes, but he has warned me that the only next step is surgery if this doesn't work. Hang on in there. XX",
      "MessageIndex": 6,
      "PostDate": "29/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136824/i-still-have-a-large-seroma-5-months-after-my-surgery",
      "Title": "I still have a large seroma 5 months after my surgery"
    },
    {
      "AuthorID": "Under Par",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/under-par",
      "Content": "Hi lovlies, I have been so busy getting through my chemo one day at a time, but it's time to think about the next hurdle now. Do any of you know how long it will be after the end of my chemo before I have surgery? Presumably my bloods have to recover sufficiently to cope with the risk of infection and actually clot and heal! Trying not to get myself in state about it, so have no idea what all the different options for surgery might be. That's if I even have any. At the moment I can't bear the thought of multiple ops for reconstruction, but perhaps I'll change my mind. Should I look into it on the basis that fore armed is fore warned- video nasties or not- or just wait and see what the surgeon says? What do you think? Here's to a stunning New Year for us all. Xx",
      "MessageIndex": 0,
      "PostDate": "03/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/120672/how-long-after-chemo-will-i-have-surgery",
      "Title": "How long after chemo will I have surgery?"
    },
    {
      "AuthorID": "Under Par",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/under-par",
      "Content": "Dear Jojo4, I echo the water drinking suggestions, try and aim for 2 litres a day. Both pre and post chemo. You can get a free app on your phone so you can monitor how much you drink. I was too woozy the next day to remember how much I'd drunk. Like wise I kept a little note book with the list of drugs I had to take at home, and when, then ticked them off. I found the steroids made me really constipated ( sorry too much info!) so step up the fibre intake, and even a herbal gentle laxative helps to clear your body of the chemicals. They are doing their stuff, so try and relax and go with flow. it doesn't last very long. I'm sure the nurses will have a chat with you about what to expect and look out for. I found I got very teary and emotional when the steroids wore off, but then I started to feel so much better. Listening to my body was really hard the first couple of times, and I'm still learning, but don't fight it. Good luck, you can beat this thing.",
      "MessageIndex": 13,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119570/appointment-cancelled",
      "Title": "Appointment cancelled"
    },
    {
      "AuthorID": "Under Par",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/under-par",
      "Content": "Dear Jojo4, I echo the water drinking suggestions, try and aim for 2 litres a day. Both pre and post chemo. You can get a free app on your phone so you can monitor how much you drink. I was too woozy the next day to remember how much I'd drunk. Like wise I kept a little note book with the list of drugs I had to take at home, and when, then ticked them off. I found the steroids made me really constipated ( sorry too much info!) so step up the fibre intake, and even a herbal gentle laxative helps to clear your body of the chemicals. They are doing their stuff, so try and relax and go with flow. it doesn't last very long. I'm sure the nurses will have a chat with you about what to expect and look out for. I found I got very teary and emotional when the steroids wore off, but then I started to feel so much better. Listening to my body was really hard the first couple of times, and I'm still learning, but don't fight it. Good luck, you can beat this thing.",
      "MessageIndex": 28,
      "PostDate": "13/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/119570/appointment-cancelled",
      "Title": "Appointment cancelled"
    },
    {
      "AuthorID": "Under Par",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/under-par",
      "Content": "Hello JMC04, I'm just three cycles in now in the same position as you. I have a grade 3 tumour and at least 1 node affected. The chemo hasn't been any worse than I expected, and the 2 week recovery period before we go again have been surprisingly good. I am focusing on one day at a time, and cheering the fact that I am over half way. Small steps at a time in a forward motion.  I have been completely overwhelmed at times by my despair at the situation, but a chat with a counsellor really helped give me some coping mechanisms. I am a self confessed control freak and the total reliance on others making the decisions has really taken me out of my comfort zone!! I wanted to have my surgery first, to get rid of this b----- thing from my body. It's really difficult knowing its still in me, albeit hopefully shrinking. I have an ultrasound next week to check on my progress, so everything is crossed. However, I every day I have to take several deep breaths and make a conscious decision to trust those in charge of my care. Good luck to all my fellow goddesses in this tough club.",
      "MessageIndex": 7,
      "PostDate": "02/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118988/joining-december-chemo-club",
      "Title": "Joining December chemo club."
    },
    {
      "AuthorID": "Under Par",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/under-par",
      "Content": "Thank you for the good luck wishes for my next ultrasound. I just keep telling myself that if this treatment plan isn't working, then we move on to plan B. As long as there is a plan I can focus on the target. The journey might not be the easiest, but I'll get there with the love and support of my friends and family. They assure me that they will carry me if necessary. There has been such kindness and encouragement from people I previously hardly knew, for example those at the yoga class I have been dragging myself to. The beanie hat and lack of eyelashes are a bit of a giveaway now, as I can't do a down dog in my wig! I'm feeling apprehensive about the next Chemo as I change to Doxetaxel which I hear may be worse then the FEC. I read that 1 in 4 have an allergic reaction to it (I know, I know I shouldn't have looked) and all the anxieties keeps forcing their way into my head at 3 in the morning when my resistance is low Stay strong lovelies. X",
      "MessageIndex": 21,
      "PostDate": "06/12/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/118988/joining-december-chemo-club",
      "Title": "Joining December chemo club."
    }
  ]
}