{
  "AuthorID": "Undergroundbarbie",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/undergroundbarbie",
  "Posts": [
    {
      "AuthorID": "Undergroundbarbie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/undergroundbarbie",
      "Content": "Hi there, I was wondering how long it takes for the pain and discomfort go away. I had a WLE end of November 2017 and all went well. I didn’t have any radiotherapy as I was told it was very small and they’d got it all. To be honest I recovered very well from the surgery and had minimal pain for a few days after. My follow up showed the scar was healing well. But for the past month I’ve had intermittent pain which feels like a hot poker mainly, sometimes I get a shooting pain that goes across the breast and under the arm or a feeling as if I have a bruise, although there is nothing visible.I’m sure this is all normal but I need some reassurance as I’m getting really nervous that something isn’t quite right. Hoping someone has some insight.",
      "MessageIndex": 0,
      "PostDate": "17/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150420/pain-after-wide-local-excision",
      "Title": "Pain after wide local excision"
    },
    {
      "AuthorID": "Undergroundbarbie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/undergroundbarbie",
      "Content": "Hi all, had wire guided, wide local excision yesterday and have to say that I'm feeling quite ok surprisingly. The nursing staff were great but I left the hospital feeling a bit let down, no one came to speak to me about how the surgery had gone, how much had been taken or anything really. The ward sister gave me instructions on what and what not to do and said I would receive a follow up appointment in the post, I'm assuming this is to check the wound and to tell me if they got clear margins and although I wasn't being rushed in anyway the whole experience felt like a production line. It seems completely different to what is printed in the hospitals literature. I didn't even see the surgeon beforehand. Am I expecting to much? I may as well have had a tooth out. I also contacted my BCN after my biopsy three weeks ago and still have had nothing back from her, again I feel let down.",
      "MessageIndex": 0,
      "PostDate": "29/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143652/post-op-disappointment",
      "Title": "Post op disappointment"
    },
    {
      "AuthorID": "Undergroundbarbie",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/undergroundbarbie",
      "Content": "Hi Princesca8, thanks for your response, my hubby has told me that someone did come to see me pre op and she asked if I knew what was going to happen, she also drew on my breast, I must have blotted this out as I don't remember. My BCN called yesterday to explain that the surgeon was operating up until 7pm and offered her apologies for not visiting me after my op, she put a lot of my worries to rest and has given me my follow up appointment, 7th December which is also my birthday, I'm hoping it will be a good one and that I'll be going out celebrating. I have only one other issue at the moment, I'm having very painful heartburn/indigestion and I think this maybe the co codamol, my BCN has said I shouldn't just stop it but reduce the dose which I am doing, is this normal.",
      "MessageIndex": 3,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/143652/post-op-disappointment",
      "Title": "Post op disappointment"
    }
  ]
}