{
  "AuthorID": "Vic chef",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vic-chef",
  "Posts": [
    {
      "AuthorID": "Vic chef",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vic-chef",
      "Content": "Hi all,having finished an awful 6 months of chemo, an operation and now on5th of 20 radiotherapy I was looking forward to returning to work,I had offered to work 3 days including weekends because I don't have to visit the hospital then.I informed work that I was feeling OK to do this and was keen to get back in.My employers decided this week that I would only be working 3 hours a day for 3 days,which I took exception to and tried to negotiate with them but my boss tells me it's his decision.Can they do This?  Now I have said I'don't rather lea3it till after my treatmental finished completely and return to work full time,they are still saying I will start back on 3 hours a day.I have been pushed out by the new guy who has taken over my role,even though they sayou my role is still the same things have gone in a different direction since I have been off.My question is does any body know if it's the employers who dictate the terms of a phased return even though I have requested more hours.Hope every one doesn't find this problem too petty considering the fight we have all put up.xx",
      "MessageIndex": 0,
      "PostDate": "09/01/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/121037/is-this-ok-only-given-9-hours-at-work",
      "Title": "Is this ok? Only given 9 hours at work!"
    },
    {
      "AuthorID": "Vic chef",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vic-chef",
      "Content": "Hi Jane ,I feel for you not being able to eat what you want, I am a chef currently struggling with chemo that made me sick at just the mere thought of food for the first 10 days of treatment.I couldn't even watch TV because of seeing food,tried to watch Peaky Blinders and that made me feel sick because everyone is smoking in it all the time!Wierd how it affects your appetite isn't it?You need to get to the shops before your next treatment and buy all the things you want to eat,your cousins sound like my dad,he thinks a crisp bread an apple and cheese is lunch! Stock up on tasty simple food when you can,I'm getting ready for my 2nd chemo next Tuesday, ready for it this time,stay strong..Luv vicky. ",
      "MessageIndex": 9,
      "PostDate": "29/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109700/preparation-for-chemo",
      "Title": "Preparation for chemo"
    },
    {
      "AuthorID": "Vic chef",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vic-chef",
      "Content": "Hi,I had my first treatment of fec 2 weeks ago and I really wasn't prepared for it,I was feeling sick constantly for 10 days, and had terrible stomach cramps and diarrhea for last 3.I didn't eat a lot but craved really simple food such as toast,fish fingers,chicken noodle soup and heinz beans and sausage,smoothies are good too.You won't know what works for you until you go through the first treatment I think,make a diary of what you liked to eat and what made you nausea then you can plan for next time. My second treatment is on Tuesday, I will prepare myself this time and have told my doctors my side effects so they can alter my medication to help me.Make sure you write down your worst side effects to tell your doctor because when you feel well you tend to forget how you felt (and its such a relief! ) Lastly just remember you do pick up again and it's the chemo doing its job that's making you ill, so it's working.Good luck,hope this helps and doesn't sound too scary.sending love and hope.vicky.x ",
      "MessageIndex": 3,
      "PostDate": "29/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109700/preparation-for-chemo",
      "Title": "Preparation for chemo"
    }
  ]
}