{
  "AuthorID": "VJ.",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vj_2e00_",
  "Posts": [
    {
      "AuthorID": "VJ.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vj_2e00_",
      "Content": "Hey Flower that is great news that other breast was clear. Good luck for the Mx. Hopefully will be straightforward for you. Are you having recon at the same time (if you don't mind me asking) all these things are flying around my head at the moment while I am waiting. VJ x",
      "MessageIndex": 2,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47229/waiting",
      "Title": "Waiting....."
    },
    {
      "AuthorID": "VJ.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vj_2e00_",
      "Content": "Hi Wendy Bit spooky but we seem to be on the same timetable - initially anyway. I also got the highly probably on 1st Feb and the confirmed on 8th Feb and then the MRI on 15th Feb. I am seeing the surgeon on 29th Feb to get the results and discuss..... I'm not quite sure what - everything I guess. Mine is lobular cancer which is a sneaky cancer in that it can exist as a non-cancerous lump forever and not turn cancerous, or can suddenly turn. My mamogram showed two lumps - I can still only feel the big one (like you feels 2 inches) the big one is cancer, the small one is not. The MRI is to see if there are any more of these sneaky lumps around - and in the other breast, as apparently the MRI is much better at showing these up then the mamogram or ultrasound. That's the non scientific impression that I have got anyway. I guess everyone is different and there is a specific treatment for each of us - but it is a bit scary when you have to put all your trust in the doctors as we don't know any better. It is eye opening reading the variations in everyone's treatment though. I've just ordered a load of leaflets of both the macmillan site and breast cancer care site to make sure that I go into my next appointment well prepared with a list of questions. As I understand it the Docs have to discuss every option with you - wether it is best for you or not - and even if it isn't available at your hosptial as you could opt for treatment elsewhere if they don't have the right specialist on hand. Lets catch up next weekend after we've had our appointments after which we'll probably be more confused than ever with spinning heads. VJ x",
      "MessageIndex": 9,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47229/waiting",
      "Title": "Waiting....."
    },
    {
      "AuthorID": "VJ.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vj_2e00_",
      "Content": "Had my MRI scan on Wed to see if this nasty invasive lobular is lurking around in both breasts. Can't see the consultatnt for the results until Fri next week - 9 days......is this a record?? Until the Fri appointment I as yet have no idea of what my treatment might be other than will need a Mx. God, this waiting. I'd be much calmer if I just knew what was going to happen.                                ",
      "MessageIndex": 0,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47229/waiting",
      "Title": "Waiting....."
    },
    {
      "AuthorID": "VJ.",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vj_2e00_",
      "Content": "Suddenly after 6 weeks of bouncing around, getting tests and waiting for results and more appointments, after being referred to a different hospital (edinburgh) the surgeon there is changing tack and has said I don't have to have a Mx, which I have been told all along, and he is doing a WLE on Friday. Thought my lump was too big for this - 5cm, but he going to give it a go!  For the first time since this started I have been given hope.  I know there is a chance that they won't get the clear margins and I might have to have a Mx anyway, but I really feel its worth a shot.   I'm not half as nervous about the surgery on Friday - the thought of the Mx terrified me, but now just taking it one step at a time. So ladies hang in there, and make sure you ask what all the options are, wether they are available at your local hospital or not.  And throw the rule book out the window, we are all individual and there is no one standard treatment that suits all.",
      "MessageIndex": 0,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48437/change-of-plan-wle-not-mx---hope",
      "Title": "Change of plan WLE not Mx - Hope!"
    }
  ]
}