{
  "AuthorID": "vonnie1",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
  "Posts": [
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Thanks everyone, I shall phone passport office today and see if they have any advice. If not, then I will look at my latest ID pictures (probably about 5 yeras okd now) and use one of those.   I dont have a wig and actually look quite shifty whenever I try one on- I also have a large head (finding a hat in my price range has always been a problem - thank goodness for the introduction of fascinators!!) -so the cheaper wig options look really naff and I am advised that I will have to have any model I do like specially ordered in my size, then it will need to be re-shaped to take as much fullness out as possible.  Bet you all have a wonderful mental image now :-)  will let you know how I get on. ",
      "MessageIndex": 6,
      "PostDate": "12/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99751/here-s-a-weird-question",
      "Title": "here's a weird question"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Now, can anyone tell me what I do regarding a renewal of my passport?   I need to renew it by the middle of January, and I am currently as bald as the proverbial. What do I do, do I have a passport that, for the next 10 years, will show me as I am at this point in my life, when, hopefully, I will have a full head of hair by next summer. Has anyone come across this problem? - ok, in the scheme of things like surgery, chemo, radiotherapy, hormone tablets, side-effects etc, this isn't earth shattering, but it will be a  reminder for years to come of a stage in my life that I would like to move on from.  When my hair does grow, it will be salt and pepper and, if anything like pre chemo, it  will be really thick - I can only see questions and raised eye brows at passport control booths.",
      "MessageIndex": 0,
      "PostDate": "11/10/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99751/here-s-a-weird-question",
      "Title": "here's a weird question"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "I love swimming, but have been told its a definite no no whilst on chemo and, if you are having radiotherapy the same goes for that. Swiming means your skin is more vulnerable to any bacteria on the ground or, in the water. Sorry, its a real bummer, I am telling myself its just another 5 months. Are going abroad.? Have a lovely time whatever and wherever you go .",
      "MessageIndex": 1,
      "PostDate": "11/07/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/96430/swimmimg-whilst-having-chemo",
      "Title": "swimmimg whilst having chemo"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Should be a song there!! Still taking the femara brand but wondering if I should start to look at alternative AI as the stiffness in my hands/fingers etc isn't a  lot better. The pain I was experiencing on CIPLA brand is largely a thing of the past but the stiffness hasn't improved greatly. By stiffness I mean that I can't make my fingers into a fist - they will only just curl round but not clench tightly, so making things like tying laces, gripping and opening bottles very hard.  If I drive for more than a few miles (10ish) my fingers are so cramped from being on the wheel that they are painful for ages afterwards. As I am a nurse, not yet back at work, I am wondering how I will be able to sustain a day's work with medications (fine motor control) computers (wrists and hands) and patient care (shoulders and grip - not tight lol) Do other have these issues? I feel as if I am moaning but on a scale of 1-10 where 10 is the bestest I can be  I would say that right now I am not much more than a 5 and this is after only  4 months of letrozole.",
      "MessageIndex": 0,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104626/hands-wrists-and-shoulders",
      "Title": "hands, wrists and shoulders"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Eeek!  I  had axillary clearance last week, how is it possible that they dont manage to get any nodes?  I see the team for results nxt week, will be anxious to hear their findings now ",
      "MessageIndex": 1,
      "PostDate": "14/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94172/radiation-to-axillary",
      "Title": "radiation to axillary"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi,, In the effort to avoid  constantly having to take painkillers for the next 8 years, I look to see what alternatives there might be to help the joint pain from AI's.  I have seen some good reviews about Montmorency Cherry   (Troo Health)  and wonder if anyone has any experience (good or bad) from these tablets?      I am now on Examestane, and have been for nearly 9 months, so far it is the best of the three AI's for me - but I still have very stiff joints.",
      "MessageIndex": 0,
      "PostDate": "20/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153064/montmorency-cherry-anyone",
      "Title": "Montmorency Cherry anyone?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "What strength do you take,  and how many per day?  I used propolis cream on my scars and they healed really quickly. Having seen the healing qualities of honey on nasty wounds and sores I can well understand that propolis must have some efficacy with regards to inflammation and cell protection. ",
      "MessageIndex": 1,
      "PostDate": "17/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102537/for-people-who-are-interested-in-supplements-i-ve-found-a-really-cool-one",
      "Title": "For people who are interested in supplements, I've found a really..."
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi,  I am glad I came across this discussion, I too have been offered EC and then T  and thought I was being done out of the F   - stupid isn't it? to want to add yet another cocktail of highly toxic chemicals to that we are already going to get  but... like you, I thought I needed all the constituents to make it effective.   the more I read and learn, the more convoluted this chemo lark becomes - almost a tailored service for each individual.  We can only be grateful for the countless women who have gone ahead of us and from whom so much has been learnt. I will be asking more about EC-T when I go for my first treatment on 12th June.  are the side effects less than with FEC-T I wonder? What a strange world we all inhabit -  Von ",
      "MessageIndex": 7,
      "PostDate": "23/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92471/ec-vs-fec",
      "Title": "EC vs FEC"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Helen,  I thought I had asked this question at the weekend,  but can't find it now;  can you tell me when I should take the K2? Should it be at the same time as the calichew D3 or earlier/later.  Also, would you add in magnesium at the same time or allow the body to get used to the K2 first. Ta  Von ",
      "MessageIndex": 8,
      "PostDate": "24/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109440/vitamin-supplements-diet-advice",
      "Title": "Vitamin supplements & diet advice ?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Sorry Helen,  I wasn't sure how to look for the answer,  where would it be/ thanks for repeating the advice anyway!   ",
      "MessageIndex": 10,
      "PostDate": "24/05/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109440/vitamin-supplements-diet-advice",
      "Title": "Vitamin supplements & diet advice ?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi, you have done so well to persevere this long with the rotten side effects - I am a wimp and won't put up with feeling rotten and like a woman 20 years older ( I am just 62 and was, until this time last year, quite a fit active woman  working full time, running a home, helping my 85 year old mother and being a grandmother to 5 great kids);  I posted some of this info on another thread but I am not clever enough to work out how to put a link to a thread in a post!!! Have you ever tried acupuncture for the sweats etc?  my local hospice offers 6 sessions which I am going to have a go at starting next week; I currently don't really get much by way of hot sweats, just a few times a day I go a bit warmer for a while  but I am thinking it may be because I am taking gabapentin for a back problem brought on by the operations I had last year to remove the cancer.  Gabapentin was originally targeted to epilepsy treatment, but was quickly noted to improve nerve pain as well, so was licensed for that too, and lo and behold, some people noted that their hot flushes diminished so now it is mooted to be used for that too. just a couple of ideas.   Also, have you kept note of the different brands you have had of the different tablets?  have you had worse problems with some brands than with others? there are lots of different threads around this subject and it is one dear to my heart due to a previous experience with a family member being seriously compromised due to a change of brand of tablets without their knowledge My oncologist has said if the Femara brand of letrozole I am now allowed to take doesn't reduce my pain, trigger finger symptoms, and stiffness then she would suggest Anastrazole  but my argument is that I would just be starting all over again with a trial and error approach which could take years - not time I have to devote to such pursuits when I need to get back into work and back on with my life.",
      "MessageIndex": 5,
      "PostDate": "07/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103263/where-can-i-go-from-here",
      "Title": "Where can I go from here ?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Ange, I am about 6 weeks ahead of you and my hair is now starting to resemble a nutty professor! I am going to get my husband to take me to his barbers - I think that at this length and state of tuftiness a male barber may be able to make more sense of it.   I don't want a number 2 blade or anything, I just want it cutting back to the shape of my head and taking the loftiness off the top. I think I would like to aim for a Julie Walters or Judy Dench sort of length, I don't want it to be long again and I certainly won't be bothering with colouring- steely grey with some interesting dark flecks will do me from now on. Good Luck",
      "MessageIndex": 2,
      "PostDate": "04/03/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/106164/hair-regrowth-ahhhh-what-to-do-with-it",
      "Title": "hair regrowth ahhhh what to do with it ?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Caz,   I finished Radiotherapy in November and am seeing my Occ Health and Manager in 2 weeks' time to discuss return to work - I am a nurse so the physical aspect of the job does play a part in the time difference I suppose. However, please don't forget that Cancer is classed as a Disability and under the Employment Rights acts you have every right to expect your employer to make \"reasonable adjustments\"  If your manager is still spouting the rhetoric she spouted earlier, try to hold off agreeing to anything and asking about seeing the Occupational Health people ( if it is a bank - they will have access to such services in each region).  You can also phone your breast care/macmillan nurse and ask if they would be happy to support you with a letter to state that you should return to work only under phased return/altered hours/workplace adaptations/amended duties agreements. Don't be bullied please!  you have been through enough and managers have to realise that the world is different and you have seriously strong rights these days. Good luck!! XX",
      "MessageIndex": 2,
      "PostDate": "21/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104065/confused-need-some-advice-please",
      "Title": "Confused need some advice please"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "I had WLE sentinel node and one positive node April/May last year, chemo and rads; started on Letrozole (cipla brand) at the  beginning October and by December was really badly affected by joint pain all over, but especially my hands and wrists. GP agreed to let me try the Femara brand and after 1 month of that the pains are less,  the joints are a bit better, but I am not sure if I will be allowed to take the expensive version for much more than another month. My point being, did you have different brands of Anastrazole and was it ever suggested that you try the original brand Arimidex?  I have been told I might have to swap to Anastrazole but, if I do I will definitely be watching the brand names and if the side effects are like those of Letrozole,  then I will be asking for Arimidex.  I am 62 and dont want to increase my chances of recurrence but, at the same time,  don't want to spend the next 10 years feeling like a woman 20 years older",
      "MessageIndex": 2,
      "PostDate": "03/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103263/where-can-i-go-from-here",
      "Title": "Where can I go from here ?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi These medicines ( anastrozole, letrozole, examestane, tamoxifen) have all got well known side effects.  Joint pain, mobility problems and hot flushes are amongst the most reported, but, it seems that some people are more affected than others.   Have you had the problems you describe since you started or have they only recently got worse?  Look at the brand of tablets you are taking, has that changed or is it constantly changing each time you pick up a new prescription? if so, it is worth trying to work out which, if any, brand causes the least problems and asking your GP to prescribe that brand on each of your prescriptions. My Breast Care Nurse insists that there is no need to put up with real pain and a loss of quality of life - I am of the belief that it is worth trying all options ( brand specification, change of medication, and supplements once discussed with the oncology team) and then being allowed to make up my mind regarding the benefit in risk reduction against quality of life.  Right now, 10 weeks since starting the tablets, I cannot contemplate another 3 months let alone the 4 years you have achieved - don't suffer, ask questions and expect answers, it is your right. Good luck x",
      "MessageIndex": 1,
      "PostDate": "05/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102106/4-years-post-diagnosis-but-still-aches-and-pains",
      "Title": "4 years post diagnosis but still aches and pains"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Sue,  I am about to start chemo, so love to torture myself by reading others' experiences - I am keen to try to not lose my nails but, it seems a forlorn hope. I think the eye drops bonbon mentioned may be Chloramphenicol?   the link to the Boots site is:-  drugs.webmd.boots.com/.../drug-89-chloramphenicol.aspx?. I am a nurse and remember a patient using this for a skin infection and it being quite effective - I am sure your medical team will know of it.  Good Luck !! Von",
      "MessageIndex": 6,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95118/nails-lifting-off-after-one-dose-of-taxotere",
      "Title": "Nails lifting off after one dose of taxotere"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Dreamthief I think you should rename yourself \"Oracle\"!   you are a fantastic source of good information - keep it coming. And, while you are at it, could you tell me why my BC nurse has said I should stop taking supps like cod liver oil, garlic and multi vits as well as not use seeds such as Chia and milled Flaxseed in my smoothie/bullet drinks? I had a torrid time at the hospital yesterday, just went to let BC see the axilla scar and the redness around it ( I started antibiotics a week ago -)  and Whomph!!  had to see the doctor who told me it is cellulitis   and was a bit off hand that my notes say I can't take Penicillin ( like that is my fault?).. I had to go to Ultrasound to see if any seroma fluid could be detected but it is all in minute pockets so only got a teaspoonful to send for culture and sensitivity.  I now have to wait to see if anything comes of that and also continue taking the Abx Clarithromycin for another 10 days. I was quite despondent when I left the unit over 2 hours later, I know it will be touch and go to start Chemo on time on 12th - I so want to be part of the June Chemo group.   It just seems as if one door closes and another slams in your face at the moment.",
      "MessageIndex": 21,
      "PostDate": "02/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Lee and Dreamthief I am going to ask again about the flaxseed and chia seeds - I really can't see how they will affect the chemo  but have stopped them for now until I can get another opinion. Dreamthief, I haven't got thanks for the heads up on cellulitis - I feel as though I should have known it was that at the beginning, but when it is your own armpit and you can only  see by looking in a mirror it is hard to be sure.   I am doing the arm exercises and the feather massage and so far there is no lymphoedema !! I have printed off the information and will take it when I go on Friday - one thing I will ask for is a prescription  for antibiotics to keep at home in case there are any signs of it starting up again. Had and Echo heart scan today, felt a total wimp as the noise of the scan really bothered me - I am  starting to hate ultrasounds and scans with a passion - then I ask myself that if it was me the nurse talking to a patient I would be reassuring  so why can't I do it for myself. Lee, I use nutribullet every day and have about 3/4 of the amount - I am using frozen fruit and veg ( bought fresh and then freeze at home) and add a small quantity of fresh stuff, coconut water and a few nuts.  All a bit hit and miss, but I haven't made one I can't drink yet.  (I hate following books and recipes - prefer to conjure up my own mixtures using the book as a guide),   It surely must help with the fight ahead? Von",
      "MessageIndex": 39,
      "PostDate": "03/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "two days post TC #1  feeling like I have a hangover, without having had any alcohol ( weird)  not really with it, sleepy but not able to sleep.   Injections of Filgrastim started yesterday - district nurses couldn't get to me at the time I needed to have it so we agreed I could self inject ( have been doing that to patients for years!!)   so far no real pains  - just a few sharp twinges here and there.  I am on a shed load of meds as I have a bad back ( MRI confirmed no metastatic spread)  so they are perhaps helping keep other pains at bay. Its strange not knowing what is happening inside yourself, wondering and waiting for things to occur or not. I am trying to keep hydrated, the only way I can keep an accurate check is to have a 2 litre bottle with a funnel on the worktop and fill the bottle with the equivalent amount of water as the liquid I have just consumed - I am not a big drink drinker so I forget otherwise.  The water is used to water my hanging baskets the next morning!! I think Leen, that you and I are on our own on TC   not found anyone else currently on same regime.   Be nice to keep in touch,  you are ahead of me, it is so useful. By the way,  does anyone have any info on drinks to avoid or cut down on?   I have read somewhere that I shouldn't drink green tea or fruit teas   is this correct?   I can't stand the taste of ordinary tea any more and have been having  lemon grass and green tea, or camomile, or ginger and lemon grass etc  about 4 cups a day. any ideas please!!",
      "MessageIndex": 208,
      "PostDate": "14/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "tried immediately, but no nurse available to speak until Monday! if it is a problem over the weekend I will either try to get to  Boots pharmacy or phone the hotline number I have for Christie Hospital. Thanks for the suggestion - I had forgotten that resource was available.",
      "MessageIndex": 377,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Don't forget you can always phone your Breast Care Nurse/Macmillan nurse, they may well be able to hurry things up a bit quicker than waiting for the GP to write and the Onco to get in touch.   Good luck xx",
      "MessageIndex": 4,
      "PostDate": "14/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/103748/i-m-back-n-worried",
      "Title": "I'm back n worried"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Big gulp!!   just started the steroids today, in preparation for Chemo to start tomorrow. It feels like standing on the edge of the cliff, just a slender branch is stopping me from falling over  - the cliff may be only a couple of feet high or it might be the grand canyon!! I just don't know what to hope for or what to think. I have been told that because of my Echo, I will be having TC chemo for 4-6 cycles  has anyone on here had that particular combination?  what do you think to it?  have you been ok driving whilst taking it.  As a nurse, I always thought it dangerous to just stop taking Dex but I have only been given  8mg twice a day for 3 days  then nada -  my questions for the chemo team tomorrow are mounting by the hour ( they'll love me) So, hopefully ( weird saying that) I will be a fully fledged member of the June club by tomorrow night - at least I will have a toe hold on the road to recovery. No doubt I will be plaguing everyone on here for the next few months,  your support and advice has already helped me so much, thank you Von x",
      "MessageIndex": 147,
      "PostDate": "11/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "RASH Hi. Does anyone know what is the best way to treat the rash currently creeping around my back/upper body?  its not spread to arms or face or chest yet. I am 2 weeks post first docetaxol ( my regime is TC) - I know it says that a rash is possible and that it can become extremely itchy - that hasn't happened yet. Typically, with any issues I have, they occur on Fridays late pm when there is no chance to speak to BC nurse, Onc or even GP. As it is not yet itchy and may not become so, I don't propose to do much, but wondered whether people who had had itchy rashes were advised or prescribed chlorphenamine (Piriton) or Cetrizine Hydrochloride.  I know that either can be used for histamine-type reactions and allergies - any advice useful for the weekend until I can speak to someone.",
      "MessageIndex": 375,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "thanks Helen,  just been reading some old links to Docetaxol and rashes,  lots of information there, just need to use some of the old grey matter to find it!! I have never had such an array of numbers to call - never used 111 in my life - thanks for the reminder. so far, no itch, but it seems fairly common  so just crossing fingers that is not on the cards this weekend.",
      "MessageIndex": 380,
      "PostDate": "26/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94838/june-chemo-club",
      "Title": "June Chemo Club"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "hansard.digiminster.com/.../TransitionalStatePensionArrangementsForWomen hi, to anyone like me born on the wrong side of the pension divide, the above link makes interesting reading - it is a bit long-winded and doesn't really resolve the issue; but at least it has been aired by debate and the details are now truly in the public domain. This has real implications for those of us born in the 50's struggling to get back to normal and who are not really able to do the job they did before  but will have to work until whatever their extended retirement date is  or try to get by on ESA or other means tested benefit.  Most of us don't even have the advantage of cheap or free transport as our local councils have kindly gone along with the revised pension age as the qualifying age for free travel But, and I am not being political here, the government and successive governments would do well to think of the enormous number of women voters who are really truly discriminated against by this dreadfully badly thought out piece of legislation - especially when it comes to the next General Election.  My local MP's majority was savaged last time, it wouldn't take too many angry ladies to change to political colour around here. Women have always been slow to annoy, but once annoyed, they often prove what a powerful force they can be. Just saying !! .",
      "MessageIndex": 0,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104710/waspi-petition-and-parliamentary-debate",
      "Title": "WASPi petition and parliamentary debate"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "www.parliament.uk/.../31 The link above takes you to the debate in Parliament about the transitional State Pensions Arrangement for women     yet again a lot of reading, some good points and some really bad misrepresentation of the facts. Ultimately, women born in the 50's have been  told to put up and shut up.   If you are interested  the vote is at the end of the debate, you can see at a glance which way your MP voted; my narrowly elected conservative MP voted against, I will remember this when he  comes knocking for my support over Europe and the next General Election. The word t.sser comes to mind!",
      "MessageIndex": 3,
      "PostDate": "24/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104710/waspi-petition-and-parliamentary-debate",
      "Title": "WASPi petition and parliamentary debate"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Has anyone used any of the hair shampoo preparations for thinning hair?   Is Biotin ok with AI's.? ",
      "MessageIndex": 8,
      "PostDate": "27/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135984/hair-and-nails-and-galloping-osteoarthritis",
      "Title": "Hair and Nails and galloping Osteoarthritis"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Thanks Misty, I was trying the boots high strength liquid variety then wondered if I was taking too many supplements as I am taking k2, garlic, d3 , cq10, and  magnesium alongside the femara.  Any thoughts on the hair and nail front?",
      "MessageIndex": 2,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135984/hair-and-nails-and-galloping-osteoarthritis",
      "Title": "Hair and Nails and galloping Osteoarthritis"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi,  I have been taking the Femara brand for 6 days now, no noticeable difference with side-effects yet; just wondering what the consensus is regarding the time of day for taking the Letrozole and the Calcichew?  I am currently taking both at night (around 8pm)  not sure whether to try swapping to morning. Any ideas?",
      "MessageIndex": 0,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102527/night-or-morning",
      "Title": "night or morning"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "I am back on Letrozole as Examestane didn't seem to be much better as far as pain, stiffness etc goes; my hair and nails were in a bad way before the switch back  but now my hair is definitely thinning  - it could be a summer moult I suppose. My nails won't grow,, they are splitting when only just showing at the tip - I have tried almond oil at night and will keep on with it  but..... I am wondering what people think to a hair and nail type supplement?    I have seen one that Healthspan sell, I can't see anything about it being linked to oestrogen so, would it be ok to try it do you think? Also, on a different tack,  my knees are really painful, and an x-ray a couple of weeks ago has shown osteoarthritis - the only comment from the results clerk was, No, you don't need to see the doctor again, it is just something you have to deal with!!!  pffft   I am going to see the GP and I will be asking what else I can do - does anyone rate glucosamine and chondroitin supplements - how much do you take and where is best to get it from? My blood tests are reported to be normal - as misty says,  what is normal to one may be abnormal to another so I will ask for a copy of the results to compare to those I had 12 months ago and those I had at the end of treatment. It just goes on and on and on  doesn't it -  4 years ago now I was planning my 60th birthday and looking forward to an active and healthy decade - how times change - I feel 74 and actually am less mobile than a lot of the older people I nurse . Hey ho",
      "MessageIndex": 0,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135984/hair-and-nails-and-galloping-osteoarthritis",
      "Title": "Hair and Nails and galloping Osteoarthritis"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi I know the answers are out there, but, can people tell me how soon after the end of the last chemo is it safe to: Go to the dentist for treatment?   I have now got a missing cap and a fractured filling - neither are causing pain at the moment  but will need to get seen to as soon as it is safe to do so. Start to take pro biotic foods and supplements such as cod liver oil, garlic and multi vits  - I must be so lacking in Vit D due to the lousy summer and the fact that even when in the sun I have been plastered in factor 50 and covered up. Eat runny eggs, seafood, and bbq food etc. You can tell that the end is in sight,    only 1 or maybe 2 more cycles to go (6-7 weeks max!!!)  and I am feeling so much better at this stage of the cycle than I have done for the others - still on metronizadol, hence the focus on pro biotics,  I know I can't have them yet but, the ABx are playing havoc with my digestive and mucosa (down below bits especially) and I really don' want to have to take fluconazole again - so just trying to keep to canestan cream and nystatin for my mouth when needed",
      "MessageIndex": 0,
      "PostDate": "30/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/98194/how-soon",
      "Title": "How Soon?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi,  I take letrozole and have had some mild flushes  but I think this is partly down to the fact that I take Gabapentin for nerve pain. However, I am having acupuncture for joint pain and the flushes and it does seem to be even better than before. Acupuncture often produces significant reduction in hot flushes and the SE's associated with AI's    Worth asking your GP/Mac Nurse/Local Hospice   or even a practising Acupuncturist in private practice    it can also help improve sleep and rest.",
      "MessageIndex": 15,
      "PostDate": "29/01/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104426/too-many-hot-flushes",
      "Title": "Too Many Hot Flushes"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Tracey - all these things are sent to try us!   I too have experienced similar discomfort,  My GP has prescribed Replens which is a non Oestrogen vaginal suppository  used once every three days; that takes care of the inside, and Sylk takes care of the rest so to speak.  Don't suffer, ask your GP. Good luck with your return to work, I had just over 10 months off and felt very scared, I had a good phased return plan but found that at the end of that I was expected to work 12 hour shifts again. I wasn't about to put myself on the slippery slope so I changed job. Von",
      "MessageIndex": 3,
      "PostDate": "24/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/125600/creams-for-vaginal-dryness-after-er-bc",
      "Title": "Creams for vaginal dryness after ER+ BC"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi, I have been on Letrozole since the end of September, I would suggest that the best thing is to wait to see what, if any, effects you have and then make a decision based on your own experiences. In my experience, I didn't notice any effects for about the first 3/4 weeks, then a gradual increase in stiffness and joint pain ( bearable for the most part). I was aware of the implications of the different brands of Letrozole and had got my GP to prescribe one brand (CIPLA) for the first 12 weeks so that I would have a baseline from which to judge the severity of side-effects which can, as is well documented, differ widely from patient to patient and from brand to brand. Doctors and others, need to have cold hard facts before they will act, so a reasoned and thought out argument is often the best way to get brands changed . I have had some acupuncture for the pain in my hands and, it may be coincidental, they do feel a lot better. The stiffness is ongoing and something I am trying to come to terms with.  So far, at least, hot flushes aren't bothering me, I think Tamoxifen is the real baddy when it comes to them. The Acupuncture therapist at my local hospice has been giving therapy for hot flushes for about 4 years and feels that most women do benefit, some more than others. Hope this helps!!",
      "MessageIndex": 1,
      "PostDate": "05/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104822/zoladex-and-letrozole---acupuncture-therapy",
      "Title": "Zoladex and Letrozole - acupuncture therapy?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "first mammogram today and all clear given!!  consultant on hand to see the plates immediately and pronounced NED   only peeps who have gone through this will truly know what this means today! So, can I now call myself a NEDDY?    BTW celebrated with fish and chip lunch, and champagne and olive tea  AND flights booked for 3 weeks at our apartment in Spain    now just need to find an insurance company that doesn't want the skin off my back. PHEW !!!",
      "MessageIndex": 0,
      "PostDate": "02/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104684/i-think-i-am-a-neddy",
      "Title": "I think I am a NEDdy"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "hmmmm, that's got me thinking George, I have never quite understood why different AI's are chosen for different women - is there any easy to understand  eejits guide somewhere? It can't just be down to sticking a pin in a list can it?? Most ladies I know who are over the menopause are put on Letrozole  but some are on Anastrazole or even (a very few) on Aromasin.  Do they plump for Letrozole first, then move to Anastrazole then Aromasin if the side-effects aren't tolerated? You should re-name yourself Yoda (not joking) Von x",
      "MessageIndex": 2,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104906/tablets",
      "Title": "Tablets"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Muy bien sueña ladrón y muchos gracias. that's it, back to english as like it is spoke. Feel quite emotional today and keep stopping to day dream and think over the past 12 months - not in a PTSD way  but, I suppose, trying to put it all into context. thanks for your stalward support and advice along the way George, at times it seems as if you are carrying the worries of so many - how are you coping yourself? San miguel and vino tinto will be the order of most days (in moderation of course!) while we are away, as will heaps of sardines, rabbit (I love rabbit), alioli,  and all the fruit and veg a compulsive smoothie maker can shake a stick at.  I am actually salivating as I write  xx von xx",
      "MessageIndex": 8,
      "PostDate": "03/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104684/i-think-i-am-a-neddy",
      "Title": "I think I am a NEDdy"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "something else I was wondering about (brain is starting to click into gear at the thought of having to get back to work!)   Even though I am now lucky enough to be taking Femara, I have noticed that my new pack is manufactured in Italy; is it the case with femara as with some other tablets, that different EU countries also have different manufacturing criteria for the same brand?    I won't know until I have been on the new batch for a week or two if there is any difference but I do know it has happened with other types of tablets, namely antipsychotics (I am a mental health nurse) and anti convulsives (family member who has epilepsy). I will be monitoring this carefully, as I do know that the brands shipped in from the EU are cheaper than the same ones made and sold here - if cheaper equates to lesser then I will be on the case.",
      "MessageIndex": 3,
      "PostDate": "07/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104906/tablets",
      "Title": "Tablets"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Have you tried any of the thickener preparations that people who have swallowing difficulties have?  Resource is one  and thick and easy, with resource you add one or two scoops ler 100ml   it turns the fluid into a syrupy or custard like state, but doesn't alter whatever the fluid is flaviured with.  Might be worth a try and then asking for it on prescription as you would be getting through a fair bit with 3 litres a day ",
      "MessageIndex": 10,
      "PostDate": "31/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/136944/aversion-to-liquid-help",
      "Title": "Aversion to liquid! Help!"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "I'm back too!!   8 days in hospital this time - 18 in total for 3 cycles  not bad going eh? The chemo wasn't bad, and very few side effects  but the temperatures were another thing:  finally had to have CT scan to see where infection was lying as no-one had a clue what else to do. I had Merepenen and it did very little, so they realised that wherever the infection was, it wasn't responding to that. Finally found the little blighter, sitting quietly in a lumen of a diverticular in the lower bowel - so the antibiotics were changed to IV Gentamicin and IV Metronizadol for 4 days - lord knows what that lot has done to my friendly flora.  And finally the infection level markers started to fall.  Home on oral metronizadol for 4 more days and then I can have a glass of wine before my enforced abstinence starts again. Docetaxol is the beggar that caused all this by giving me 6 days of virtual bowel irrigation in the first cycle; but I am  not totally convinced that the next 3 cycles won't involve hospital stays as well  - bags remain packed at all times. Now to get strong enough to have cycle 4 a week today - I am coming to terms with the fact I may have to stand down for a week, but I would so rather get on with things. This is much harder than I envisaged, but I'm doing it and it is passing, almost 9 out of 18 weeks done now!! Has anyone else wondered if the Filgrastim injections for growth factor have anything to do with temperatures etc?    I only had 4 days this time, my neutrophils stayed well above the danger zone and all other blood readings were ok; I am seriously considering discussing whether to chance it and not have the injections this next cycle.",
      "MessageIndex": 31,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Chrissie Amazingly, to say I have been moved around 6 wards, at no time have I had a room with a tv.  Maybe a blessing in disguise,  I could have bcome hooked on jeremy kyle!!   On another subject, that is how my mind functions at the moment, have you, or anyone here had problems with their eyes during chemo (I'm TC)?   I have noticed that what was just an isolated tick in one eye a couple of weeks ago, now seems to be fairly frequent, if not constant, at times.  It is typical, of the ticks that you feel everyone can see but when you ask, or look in a  mirror,  there is nothing visible. I will be phoning my BCN tomorrow just to head her up on the fact that I have some altered sensation in my feet and toes  so this will be added to this list. I am so sick of this now, everyone says I must be extremely sensitive to the chemo , it seems to have given me diverticular disease, plus all the other stuff and now neuropathy   and all this on a 20% reduction!! Sorry to sound poor me, ive been awake since 3am so feel pretty down right now, perhaps best to get up and on with the day: sleep will come later no doubt",
      "MessageIndex": 139,
      "PostDate": "23/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Bottle Green Cordials are good too,  they have flavours such as Ginger and Elderflower, strawberry, Pomegranate. Elderflower, and their Lime is really delicious  ice cold.  You don't need much to flavour a 500ml bottle and 5 of those a day is your fluid intake sorted even when you can't taste much.",
      "MessageIndex": 70,
      "PostDate": "12/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "thank you dreamthief, you settled my nerves, awake and thinking in the middle of the night all sorts of horrid possibilities ran through my mind, sight loss being the least!! I have never been a catastrophiser  but this is really getting to me,  so many physical asides that keep raising their heads and all need to have further investigations  BUT not yet.  So, once chemo is over and it is considered safe to start on Rads, I then have to negotiate outpatient appointments for other disciplines .   From  active and healthy age 60 less than 2 years ago to decreptitude today, is a real bum bighter  -  I must develop a new mantra,  I saw this a while ago, for the life of me I can't think where,  thought it was good  but find it hard to live to at the moment. \"Don't miss today's sunshine worrying about tomorrow's rain - chances are the clouds won't come your way,!!! ",
      "MessageIndex": 143,
      "PostDate": "23/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "thanks everyone, I am feeling so much stronger after just 4 days at home, amazing how the body just wants to get better. Good food,( still haven't got much taste, but I know its good) and good rest are doing their work.   This week is my exact half way mark - if I go to 6 cycles, it is passing, and I am confident it will pass,  I just hate all the extra little health niggles that have raised their heads along the way. A lovely, family weekend helped to put the health etc on the back burner, my mum's 85th celebrated with almost her whole immediate family ( children 3, granchildren 4/6, and great-granchildren 5) was a wonderful antidote to hospital and illness. Onwards and upwards!!",
      "MessageIndex": 54,
      "PostDate": "10/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi everyone. Back home again now after 5 days in hospital  - I seem to be admitted earlier and earlier with each cycle ( this was number 4 TC)  not neutropenia  but just raised temperatures and infection (CRP) levels.  This admission brings my hospital stays to 23 days in the last 13 weeks - all nursed in side rooms.  I find the whole situation very very frustrating and so boring, but realise that no-one will take any risks with chemo patients. I am beginning to notice some mild neuropathy-type symptoms in my toes and soles of my feet - another thing to add to the flaming list!! It is a method of weight loss I don't really recommend - down by 4 kilos in 5 days!!  but a combination of almost no taste, and altered sensation when food touches my tongue  together with hospital food, has had that effect.  It will go back on, and the taste will start to return in the next few days. A weekend of real rest  and then, hopefully, start to re-connect  with the outside world.  Onwards and Upwards !",
      "MessageIndex": 137,
      "PostDate": "22/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "I've spoken to my BCN today   I see the oncologist and her on 4th Sept which is chemo 5 day,  there will be a discussion whether to carry on or stop.  I personally, despite everything, want to carry on; I have to have a 20% reduced dose since the first chemo made me so ill; so, by my reckoning, I need to have at least 5 cycles to average the amount of dose that a lot of people who are stopped at 4 have.  The oncologist tells me, and I have researched, that really, no one still knows whether 4  5 or 6 cycles are needed,  they plump for 6 as it seems the best bet and people can mostly tolerate the side effects up to that number. Roll on the genetic profiling results from the Adenbrookes trial  - a tailored chemo for each individual will be a wonderful thing ( not for us, but at least those who follow in the years ahead) Enjoy your colouring  - I have so much paperwork, phone call and stuff to get out of the way, I daren't sit down to colouring!!",
      "MessageIndex": 152,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": " thanks for that positive re ticks Chrissie - you do begin to think you are going mad with all these stupid side effects.  And me a nurse, who told my children that an early night and some chicken soup would cure most things!! As for TV, well, I can't tell you how many books I have read, and, even tried to learn how to do Suduko, but that's a mind stretch too far at this time.  I find that I am not terribly interested in tv now at home - concentration span of a gnat unless I am reading or colouring ( a hobby only taken up at the start of chemo, but one that does need concentration to the exclusion of all other distractions unless you want your finished work to look like Banksy on a trip). Suddenly, half way through last evening I sat up on the sofa and told my husband that I felt alright - meaning that I was acknowledging a marked difference from a few hours before,  maybe this has been the shortest down period from TC and the only way is up  - if so, that gives me almost 2 weeks of recovery and rebuilding before number 5.",
      "MessageIndex": 148,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/97141/august-chemo-club",
      "Title": "*** August Chemo Club ***"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Snowys Mum,  The Cipla brand I am currently taking is so tiny I couldn't even cut it into half without it shattering   which brand do you take that you can cut it into 3? hope you go on ok with the trial build up. I have spoken to my BC nurse, she has suggested the usual, Paracetamol taken regularly and either topical or systemic ibuprofen or oral - she also says that if I am compromised to the point that I describe with my hands ( can't grip easily) and have all over joint pains, then maybe I should think about changing to Tamoxifen. She also agree that it might be worthwhile asking my GP for 2 months' supply of the Femara brand of letrozole to see if there is any improvement in the side effects - I can see that request going down well with cash-strapped GP!!. The Tamoxifen would have to be prescribed by the Oncologist so would need a letter to the GP before I could change over and I would still be at the risks of the same side-effects. its the old frying pan and fire conundrum isn't it? So, I'm taking the paracetamol regularly, now and will try the Ibuleve gel and will speak to the surgery on monday to see what the chances are of trying the Femara brand.  ",
      "MessageIndex": 2,
      "PostDate": "05/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102083/understanding-the-percentages",
      "Title": "understanding the percentages"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi, Well, I was in luck!! my own GP happened to be the duty GP when I called the surgery so, rather than having to have a long conversation to bring someone up to speed, I had a relatively short chat at the end of which she agreed to let me try Femara for a month.  If the side effects are lessening then she will be happy to prescribe for a further month or two and then there will have to be a chat about long-term implications. I am happy with that, but not so happy with the pharmacy who yesterday when I tried to collect the Femara, had only packaged up the Cipla brand and were trying to get me to take that home (fat chance!!) they said that the GP had not specified Femara at the top of the prescription ( she had put in block capitals at then end of her prescription FEMARA BRAND PLEASE)  I patiently pointed it out and was told that it was very expensive - I am a nurse so was able to tell them exactly how much it was according to the BNF and that I was aware of its expense but that a conversation had taken place between my Macmillan nurse and me and me and my GP and the prescription was the outcome of that. They maintained that the prescription should read the words FEMARA at the start of the written request and asked the surgery to send an amended script which I could collect today. Today, I have been handed a pack of Letrozole (sandoz brand) labelled over the  top with a  printed label saying Femara (letrozole)  so I had a mini melt-down and asked loudly how someone was able to clearly mis-label a medication.  I know Sandoz is also under the Novartis label but I want to try Femara first, and will happily try Sandoz if Femara isn't successful.  I find it rather worrying that a pharmacy is apparently trying to fob me off with lesser brands whilst holding a prescription for an expensive one - or am I just being a silly old paranoid patient? So, dear hearts, I should be in possession of 28 Femara tablets by this time tomorrow  - I have my sore fingers and toes crossed that they do start to reverse some of the pain that has plagued me for over a month now - nothing in the timespan some of you have had to endure, but more than I want to experience.",
      "MessageIndex": 9,
      "PostDate": "09/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102083/understanding-the-percentages",
      "Title": "understanding the percentages"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Thanks George,  I had forgotten about Sandoz, will try for femara first and settle for sandoz as a compromise.  Lying awake with pain in my wrists and hands worse than when I had carpal tunnel  years ago is no joke.",
      "MessageIndex": 7,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102083/understanding-the-percentages",
      "Title": "understanding the percentages"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Helen, The last copy of BNF that I have at home is 2013 and the Femara price is £84 per 30 tablets!! -   I have looked at the I3C, DIM and Myomin info (it is a flaming minefield isn't it?) I do eat a lot of cruciferous veg as we have an allotment so have Kale and broccoli coming out of our ears - I love parsley and watercress and cauliflower too so reckon I do eat on average a full portion at least 5 times a week.   I really want to try to limit all the tablets (supplements and prescribed) that I take.  I am swapping to the Femara brand tonight (the pharmacy finally came good) and will refrain from adding anything to the mix to help avoid confusing results re side-effects. If, after Christmas, there is no difference and I am still needing to take paracetamol etc to ward off the worst of the pain then I will start to look at the K2 Magnesium and then the Turmeric.   BTW the femara tablet is as small as the Cipla one I have been taking, no way could that be divided into 3 equal parts  what size is the sun pharma one?",
      "MessageIndex": 11,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102083/understanding-the-percentages",
      "Title": "understanding the percentages"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi, Since I finished treatment (surgery>chemo>rads) on 3rd November, I stupidly thought I could start to move on, get better and stronger and take up some of the reins again; instead, I, like many other women posting about endocrine therapy, feel ancient. I was given Letrozole, which I started 10 weeks ago - I managed to get a prescription for the same brand for 3 months supply, just to see what the side effects, if any, would be like and not to get confused by differing effects from different brands. I had a couple of weeks of little effects but, since then, have had increasing joint pains and mobility problems. I am only able to sleep for about 2/3 hours without completely waking due to the pain in my shoulders, arms and hands. My right hand ( the side I had lymph nodes removed) has now started to develop what I think is trigger finger and I am scared that it may need intervention which would run the risk of lymphoedema developing. I asked before I started the AI what my percentage gain would be over the 5 and 10 year time span that it is proposed I take the medication.  I had a letter from my Onc yesterday telling me that they have used the PREDICT tool as the Adjuvant Online tool is not currently in use; they quote a 4% absolute risk reduction after 5 years therapy at 10 years after diagnosis and suggests that as I had lymph nodes removed ( sentinel and 10 nodes - 1 was positive) then it is definitely worthwhile my continuing for the full 10 years!!. So my learned friends,  am I right in understanding that the figures say that if 100 people had had the treatment I have received so far and went on to take an AI then an extra 4 would still be alive or have no recurrence at 5 years?    I feel a bit of a klutz, I have never really got to grips with these sorts of figures - I will ask someone to sit and explain to me in words of no more than one syllable!! but know that on this wonderful forum, there is bound to be someone who can translate for me. I am asking my BC nurse to see if there is any consensus on what I should do now re tablets - ask for another brand for another month or two, ask for the gold standard Femara (fat chance!) or ask about another type of AI. I am doing all I can to get back to normality, I have hydrotherapy, complementary therapy and have now had an assessment for the local Gym and swimming pool.  I am a nurse and need to get back to work but the way I am at the moment, I would be a liability as I can hardly grip anything, my shoulder is frozen and I have to turn my body rather than my head to look round - my patients (elderly dementia) are in better physical health than me- they'd be putting my shoes on and tying the laces at the moment!!!",
      "MessageIndex": 0,
      "PostDate": "04/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102083/understanding-the-percentages",
      "Title": "understanding the percentages"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Helen I have been told not to take any supplements other than cod liver oil capsules  until I have had my post radiotherapy check up ( 22nd Dec).  It is so confusing, take K2, not take K2, add Chelated Magnesium  or not.  I have tried to read up on whether they affect the possibility of recurrence but get bogged down in the arguments for and against. The Sun Pharma is yet another of the cheap brands that are on the market since Femara came off licence - the unit cost is so much cheaper than Femara that it is almost impossible to get Femara prescribed.  The ingredients for the Letrozole part of the tablet are strictly controlled  by whoever makes the tablet, but the excipients (the fillers and packers which help to make the tablet of a size that can be easily handled and administered) can be of a much lesser quality than that used in Femara ( hence the lower costs)  it is thought that it is these ingredients which can, when absorbed and built up in the body, heighten the already known side effects.  This is the reason I will be asking my GP if I can be allowed to try the Femara brand before thinking about changing completely to Tamoxifen. I don't think we should be expected to \"persevere\" if it is possible to try alternative brands and have constancy in prescriptions rather than being at the mercy of whatever the pharmacy manages to get hold of each month.  If a certain brand seems to suit someone, they should be allowed to receive that especially now we are being told that it is beneficial to take the medication for the full 10 years  Many medications don't have noticeable differences between cheaper brands  but, it seems the Aromatase Inhibitors do.",
      "MessageIndex": 5,
      "PostDate": "05/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102083/understanding-the-percentages",
      "Title": "understanding the percentages"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Thank you too Julia and Peardrops, I have been in a rotten place for the last few days, my first mammogram is due tomorrow and as the day draws nearer the bad thoughts loom ever larger.  Your thoughts have helped me this afternoon, I will try to be positive for the next few hours and believe that the news tomorrow morning will ok",
      "MessageIndex": 4,
      "PostDate": "01/02/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/104616/worried",
      "Title": "Worried!"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "thank you, I really should know all this,  it just seems my mind is elsewhere, and in shut-down mode ",
      "MessageIndex": 3,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95430/green-tea-and-antioxidants-help-please",
      "Title": "Green tea and antioxidants help please"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "http://www.cancerresearchuk.org/about-cancer/cancers-in-general/treatment/complementary-alternative/therapies/green-tea I am really confused - it has only taken 3 days post TC chemo to bring me to this! I am struggling to find drinks I like at the moment, I had thought that Green tea  with or without things like ginger, lemongrass and camomile, would be ok, but this article seems to suggest that I should be a bit more wary Please can people give me hints re drinks and food they have found useful - I have lost all interest in food today too.   Once I get my appetite back I will eat well, but it is just having some ideas in front of me at the moment that may help Von",
      "MessageIndex": 0,
      "PostDate": "15/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95430/green-tea-and-antioxidants-help-please",
      "Title": "Green tea and antioxidants help please"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Hi Beevergirl Have you had any changes in the brand of tablets you are picking up? there are several ingredients in the fillers of this medication that could promote the symptoms you describe, interesting stuff about Hypermellose and Sunshine yellow to name but 2!!.",
      "MessageIndex": 14,
      "PostDate": "10/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102136/anastrozole-arimidex-se-raised-blood-cholesterol",
      "Title": "Anastrozole/ Arimidex: SE: Raised Blood Cholesterol ?"
    },
    {
      "AuthorID": "vonnie1",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/vonnie1",
      "Content": "Just thought that while I was on the forum pages I would like to wish everyone here, as Happy a Christmas as possible.  I know that it isn't  a happy time for a lot of people and for those of us on this journey we never asked to travel, it is harder for some than others. I do know, however, that this year would have been a damned sight harder had I not found this forum and been able to soak up the wisdom and support that has been freely offered. Please feel free to use this new discussion to post Christmas wishes, Hopefully it will  help centralise them and also help people who may have fallen out of the loop to keep in touch. I do hope that 2016 sees a brighter and better year - ",
      "MessageIndex": 0,
      "PostDate": "16/12/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/102528/christmas-wishes",
      "Title": "Christmas Wishes"
    }
  ]
}