{
  "AuthorID": "wadhurst54",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wadhurst54",
  "Posts": [
    {
      "AuthorID": "wadhurst54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wadhurst54",
      "Content": "I totally understand your fears I have four children and my youngest is 7, my biggest far is getting it back again worse or something but, trying to put fears to the back if my mind as all they do is eat away at you, I have bad moments but am trying to keep a grip on those. Let us know how your appointment goes. X Rebecca",
      "MessageIndex": 5,
      "PostDate": "08/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85486/grade-3-6cm-tumour-shrinking-on-chemo---invasive-ductal-carcinoma",
      "Title": "Grade 3 6cm tumour shrinking on chemo - Invasive ductal carcinoma"
    },
    {
      "AuthorID": "wadhurst54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wadhurst54",
      "Content": "Hello, I am in a similar situation to you, I started with a 6 cm lump and I have it in at least one lymph won't know how many until later on I have had 5 out of 6 fec-t chemos, mine has shrunk a bit bit oncologist said it didn't matter how much it had shrunk just that it had shrunk rather than grown which shows chemo is working. I have to have a mastectomy and they will remove lymphs then too and see how many had cancer, the consultant is really positive, try not too worry, the chemo will be shrinking it all and they would tell you if prognosis was bad, as your tumour is shrinking that is good news. They are rebuilding me at same time as mastectomy, I think that might be hard but will be so relieved to have finished chemo that surgery may not be too bad. i'm trying to break ttreatment into chunks in my head then it doesn't seem as bad. Xx",
      "MessageIndex": 1,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85486/grade-3-6cm-tumour-shrinking-on-chemo---invasive-ductal-carcinoma",
      "Title": "Grade 3 6cm tumour shrinking on chemo - Invasive ductal carcinoma"
    },
    {
      "AuthorID": "wadhurst54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wadhurst54",
      "Content": "Hello I am 40, married with 4 children and was diagnosed with breast cancer in July, I have had three tax and start fec on Wednesday, I have got to have a mastectomy after this followed by radiotherapy. I have been coping and I am working two out of every three weeks as feel quite normal. But suddenly this week I am panicking and have been really tearful. In my lymph node biopsy hey found cancer but as yet I don't know how many nodes affected, they will remove them at mastectomy but I am now worried that it isn't possible to sort it out. The doctors have been lovely but will never say to you that it will all be ok, just explain the treatment, do many people get over it when it has spread to lymphs. I wondered if anyone else was in the same boat.",
      "MessageIndex": 0,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83743/breast-cancer-has-spread-to-nodes-panicking",
      "Title": "Breast Cancer has spread to nodes, panicking"
    },
    {
      "AuthorID": "wadhurst54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wadhurst54",
      "Content": "Thank you both, it is reassuring to read your responses. I think I have had a delayed reaction, apart from my initial diagnosis I have been doing well, having the children to sort out has really helped but this week I have suddenly got in a state, it is as if every time you open the paper there is a horror story and I have convinced myself it won't be ok. I am getting MRI results Monday to check shrinkage so I'm hoping if the results are positive I will feel better. Sorry sound like a real whinger. In a positive way my wig has given me a new lease of life, feels very glamourous and have been so supported by friends and family. It 's just such a roller coaster as you say. Thanks Rebecca",
      "MessageIndex": 4,
      "PostDate": "03/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/83743/breast-cancer-has-spread-to-nodes-panicking",
      "Title": "Breast Cancer has spread to nodes, panicking"
    },
    {
      "AuthorID": "wadhurst54",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wadhurst54",
      "Content": "Hi I had the diep on the 18th December, I sm so pleased that I did, I already feel quite well and the results are really good. I have previously had c sections and it didn't seem as painful as that. They gave a morphine pump which I barely used do they removed it. The drains are a bit uncomfortable  but manageable. I am so excited by my new boob and flat tummy.  Do whatever is best for you but I don't think it is as bad as people think and the end results are worth it, for me it has definitely been the right decision. If you want to ask anything just shout.    Rebecca Xx",
      "MessageIndex": 3,
      "PostDate": "27/01/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/88970/to-have-reconstruction---or-not",
      "Title": "To have reconstruction - or not!"
    }
  ]
}