{
  "AuthorID": "wardy2",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
  "Posts": [
    {
      "AuthorID": "wardy2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
      "Content": "I had an LD recon and I was in bed for a couple of days before I was able to get up, and even then it was with a lot of help. I was in hospital for about a week altogether, and healed up pretty well. I am wondering whether you can have an LD recon on both sides? I like that recon so when I have my next one (fingers crossed there) I would like that one done again. I didnt have implants though, its all me :-) if you find ops scary then get something prescribed to calm you down in the days leading up to it, make things a little easier. Its quite common I htink, Gemma  x x ",
      "MessageIndex": 6,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32933/risk-reducing-mastectomy-for-brca-carriers",
      "Title": "Risk-reducing mastectomy for BRCA carriers?"
    },
    {
      "AuthorID": "wardy2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
      "Content": "Hey, this is an interesting topic for me as I was diagnosed only a few months ago aged 25. I had a mastectomy and recon (unfortunately I was not too thin and had a back flap lol) but I am desperate to have my other breast removed as I just hate it! I am in the very early stages of getting tested but tbh I dont know if I really want to know?? I just want it gone regardless, but I am worried that they wont remove my other breast unless I am BRCA positive. I just want it gone! I am very pleased with my recon so i just want the other one gone the same way. its not that big an op really, im hoping to live for quite a long time and it makes a lot of sense to me to get it removed.",
      "MessageIndex": 2,
      "PostDate": "08/11/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/32933/risk-reducing-mastectomy-for-brca-carriers",
      "Title": "Risk-reducing mastectomy for BRCA carriers?"
    },
    {
      "AuthorID": "wardy2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
      "Content": "During my chemo I took arnica tablets, you know like the cream you put on bruises, but in tablet form. My pharmacist is also a homeopath luckily so gave me some for my surgeries and said take them for chemo too, and I was abslutely fine the whole way through! How about some sweets to suck when you get that horrible metallic taste in your mouth, or gum. I made a box like this for my friend who was recently in hospital and she was really grateful :-) cool idea x",
      "MessageIndex": 4,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/40792/chemo-rescue-kit---suggestions-please",
      "Title": "chemo 'rescue kit' - suggestions please."
    },
    {
      "AuthorID": "wardy2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
      "Content": "Hey guys - I do want a line of some kind, I hate that cold creepy feeling you get when they inject you. Minging :-( totally could not get it done under a local tho - generals all the way for me m'fraid. Im a big wimp! But good news on the hair front - I had it shaved off yesterday and got a mohawk lol, it looks pretty rubbish because my hair is so fine/thin now but its pretty funny. If its got to go, it has been totally on my terms! hilarious, keep smiling xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
      "MessageIndex": 10,
      "PostDate": "27/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/28961/should-i-have-a-portocath",
      "Title": "Should I have a portocath?"
    },
    {
      "AuthorID": "wardy2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
      "Content": "Hey, I'm pretty new on here too, but I have found it a great source of information because, like you, don't really know anyone else who is going thru this, especially at my age (25). My hair is starting to come out too, which sux, o I am leaving it in a ponytail and trying not to brush, touch, wash it.... lol, not having much success there but I am going out tonight so I am determined to keep it until then!  I was also wondering about lines because my veins are ok, but not fantastic and I absolutely hate the feeling when the drugs go in, especially Epirubicin because it feels cold creepin up your arm. It kinda heightens the 'Battery Acid' sensation as the nurse called it, and its horrid. But how are they put in? Im not too keen on the idea of another general anaes, but i spose thats one cannula and no more.  There is a macmillan booth thingy in my local hospital, (and is manned by angels!) who are always very good and knowledgeable, and I have found their information booklets very helpful. Im pretty sure you can access them online. Also, the Breast Care Nurses at my hospital put me in touch with another patient who got diagnosed the same age as me, but is now 5yrs clear, she is a mine of information and super dooper supportive. You could ask if theres anyone like that you could speak to? Hugs, Gemma xxx",
      "MessageIndex": 5,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/28961/should-i-have-a-portocath",
      "Title": "Should I have a portocath?"
    },
    {
      "AuthorID": "wardy2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
      "Content": "Hiya, I had a LD flap recon last april, and my back is still *really* tight. Doesn't affect me on a day to day basis, but now my chemo is over I want to go back to the sports I enjoyed before and it is going to be a problem. I am considering having my other side done in the same manner but Im owrried its going to affect my mobility severely, what do you think about having that done on both sides. Physio is helping, but i was really hoping it would have settled more by now?! thanks x",
      "MessageIndex": 2,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/33985/from-back-flap-to-back-pain",
      "Title": "From Back Flap to Back Pain!"
    },
    {
      "AuthorID": "wardy2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
      "Content": "Hi, I got diagnosed 3 months ago with primary breast cancer, and have had mastectomy etc. But now Im going thru Chemo and my Oncologist is being a bit evasive about the effects on my fertility. Im 25, and Ive always had dreams of a big family. I need 5yrs of Tamoxifen, but after that I just have to hope I can still have kids?? Does anyone know the options for preserving fertility and how/when they need to be done? Zoladex isn't suitable for me coz of the hormone issues :-( Thanks x",
      "MessageIndex": 0,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/29005/chemo-and-fertility",
      "Title": "Chemo and Fertility"
    },
    {
      "AuthorID": "wardy2",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wardy2",
      "Content": "Hey all - My oncologist couldnt offer me IVF because I didnt have a partner, so couldnt feeze emrbyos and things. She said egg freezing is so unlikely to produce an actual pregnancy that there was no point. I did go back and see her about Zoladex (she never even mentioned it before and I found out about it from a support group) and she explained that it reduces the effectiveness of the chemo so she really wouldnt recommend it.  Does anyone know anything about freezing parts of your ovaries? I dont know whether that can be done once chemo has started, im so angry because the oncologist said she would refer me to a gynae doctor before my chemo and she just didnt do it. I had to chase her about it and by my treatment was due to start and couldnt wait any more. nightmare!",
      "MessageIndex": 4,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/29005/chemo-and-fertility",
      "Title": "Chemo and Fertility"
    }
  ]
}