{
  "AuthorID": "warymaclary",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/warymaclary",
  "Posts": [
    {
      "AuthorID": "warymaclary",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/warymaclary",
      "Content": "I must admit I finally got the floppy hair I'd always wanted with my wigs. I'd also been meaning to see what I looked like without colouring my hair dark for a while now. I certainly don't miss those long hours at the hairdressers in front of the mirror... When I got my wigs I did try on grey and they didn't suit me either but I guess the shades of grey are pretty limited. If I need to have more chemo I'm not sure what colour I'd get now - but they'd definitely be floppy! Its a beautiful day here in Scotland, hope it is with you too. :)",
      "MessageIndex": 12,
      "PostDate": "07/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124240/hair-loss-advice-needed-post-chemo",
      "Title": "Hair loss ...Advice needed post Chemo."
    },
    {
      "AuthorID": "warymaclary",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/warymaclary",
      "Content": "Hi Lujay13, I accidentally wandered into this group on my way to the endometrial cancer one.  I can't help with the Tamoxifen question but thought you might be interested in my how I got on with my hair after chemo.  I have always had thin hair and it did start to grow back after chemo, though it was almost white. My oncologist nurse suggested Daniel Field who has a range of non chemical hair colours. You can buy them online, though I'd suggest if you can, you make an appointment to see him - but he is in Harley St, London. My consultation and hair colouring cost around £130 I think.  I went in wanting to dye my hair pale lilac as I'd seen a woman on the bus who had obviously had chemo and she'd dyed her hair orange. Although you could see the roots coming through but it still looked fab.  Daniel talked me out of lilac and I ended up getting my hair dyed brown. It was then I realised what I think I had instinctively known - dark hair instantly showed up my scalp far more than my white colour had. He suggested I use the brown fibres he sells to make the hair look thicker but I was about to go abroad and he agreed the fibres wouldn't withstand sweat! I trotted off home and went on holiday with my wig still in place. A month later when I had to return to London for treatment I made an appointment with him again and he stripped all the brown out and put in the lilac I had originally asked for.  I was a bit miffed with myself for not standing my ground in the first place, Daniel is a delightful man but quite fast talking and I didn't go in prepared for that. He has had cancer himself and runs this salon two or three days a week.  He also sells a solution that he says will speed your regrowth. I use it, I really can't say if it works but I'm still on Letrozole and when I last saw Daniel he said that without it my hair would be far thinner.  Friends have actually said how fast my hair has grown and how thick it is BUT it is pale blue now and does look thicker being lighter. To me it is the same as before chemo except a different colour. However I will continue to use the solution just in case. Even if you can't get to his salon it is worth contacting Daniel to discuss what you could do. His number is online, I think he has a salon in New Barnet (no pun intended!)  I hope this rather rambling tale is of some help.  Best wishes and good luck xx",
      "MessageIndex": 10,
      "PostDate": "06/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124240/hair-loss-advice-needed-post-chemo",
      "Title": "Hair loss ...Advice needed post Chemo."
    },
    {
      "AuthorID": "warymaclary",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/warymaclary",
      "Content": "Haha - feel slightly embarassed that it clouded overshortly after writing that! ! ",
      "MessageIndex": 14,
      "PostDate": "10/03/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/124240/hair-loss-advice-needed-post-chemo",
      "Title": "Hair loss ...Advice needed post Chemo."
    }
  ]
}