{
  "AuthorID": "Waverider",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/waverider",
  "Posts": [
    {
      "AuthorID": "Waverider",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/waverider",
      "Content": "You know...sometimes people really don't understand how deeply they can hurt you with words. I would let her know how you feel about what ahe said and give her the opportunity to be suitably mortified. If she's not sorry its time to move forward without her...but at least you won't question yourself. If she's not a close friend then I wouldn't even bother.. Hugx",
      "MessageIndex": 17,
      "PostDate": "27/04/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/127746/really-bloody-angry",
      "Title": "Really bloody angry !!!"
    },
    {
      "AuthorID": "Waverider",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/waverider",
      "Content": "I had the same experience after chemo. They wrongly assumed it was a side effect but I kept worrying. Went to a different doc and was seny for an Echo. Turned out it was my heart. Good news is that meds are helping and it may even  heal over time.  I would go with your gut every time. Better to be sure than stressing. This illness is stressful enough x",
      "MessageIndex": 5,
      "PostDate": "26/02/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/123982/breathlessness",
      "Title": "Breathlessness"
    },
    {
      "AuthorID": "Waverider",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/waverider",
      "Content": "I kind of know what you are going through although my Circumstance was slightly different. My mother was diagnosed with breast cancer when I was having radiotherapy. You are doing a fantastic job and being emotional is perfectly normal. In fact you might be more concerned if you were not emotional. You will get through this, I promise. The first session is the most scary but once you have made it through that and know what to expect it becomes easier to bear. I found this site invaluable during chemo. It kept me well informed and grounded as I had so many questions I thought I would go mad.  A hug to you as your next journey begins. See you on the other side! X",
      "MessageIndex": 6,
      "PostDate": "14/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/152482/chemo-looming-i-am-now-feeling-quite-emotional",
      "Title": "Chemo looming.... I am now feeling quite emotional"
    },
    {
      "AuthorID": "Waverider",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/waverider",
      "Content": "I kept my shoes on after being told it was up to me, and was told the machine needed to be kspt in a cold room. No question is silly so ask away without questioning whether you should! After a few sessions I had seen so many different staff that I no longer cared who saw my girl and a half. But I must admit that getting over the hard nipples in the cold bit took a few days more lol!",
      "MessageIndex": 11,
      "PostDate": "25/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140763/silly-radiotherapy-question--",
      "Title": "Silly radiotherapy question -"
    },
    {
      "AuthorID": "Waverider",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/waverider",
      "Content": "Hey Mom74 I'm the same age as you, stage 3a and had TAC. I lost my hair in week 3 over the course of a week. I was quite pleased about the free Brazilian and not too upset about my head as I had shaved in advance. It's growing back curly and far lighter in texture. Stay strong, snap those fingers, and know you are beautiful regardless. Hug  X",
      "MessageIndex": 6,
      "PostDate": "18/06/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/131903/tac-and-hair-loss",
      "Title": "TAC and hair loss"
    }
  ]
}