{
  "AuthorID": "wearymum",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
  "Posts": [
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hi ladies I have been invited to take part in an early screening (blood test) to determine whether I'm suitable to be part of a clinical study of a new medicine for metastatic breast cancer. It's for ladies who test positive with the Brca 1/2 mutations. Hence the pre -screening blood tests. The study is - OlympiAD - Olaparib monotherapy versus Physicians Choice Chemotherapy. It's a very small study. Approximately 12 people from the UK will take part. 310 worldwide. I'm currently just coming to the end of my first cycle of weekly taxol and avastin. I was originally diagnosed in July 2013. Told I was now TNBC with lung mets last month. I have two daughters, so I think we have already decided to go ahead with the initial screening to determine if I carry the Brca genes - so that they are then in a position to make an informed choice - if they have to. If I am positive - I then need to make a decision on whether to join this trial or not. Just wondering if anyone has any input to help me? Thank you xxx (I have posted this in the Triple Negative Group too)",
      "MessageIndex": 0,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93450/new-clinical-trial",
      "Title": "New Clinical Trial"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Thanks for your reply.  Like you say - it's a double edged sword! I have already discussed the possible outcomes with my girls. They are very pragmatic and accepting of it all. The eldest, now 17, was diagnosed with Lymphoma herself when she was 12. The large amounts of treatment she had, at puberty, have already increased her chances of breast and ovarian cancer. Also, whilst her cancer remains dormant at the moment, it could 'bubble up' at anytime! So, we live under a cancer cloud anyway really! But as you say there is a 50% chance that they wouldn't affected. We have decided that I will have the pre- screening blood tests to establish the Brca situation. Then take it from there, because, as you say, I have to be positive to even be eligible for the trial and I have a lot of other questions for the trial team as well! It's a small trial. Only 12 people in the UK would be accepted, 310 world wide. My local hospital is one of only a few taking part. I guess, what will be will be on this never ending cancer rollercoaster! xx",
      "MessageIndex": 3,
      "PostDate": "29/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/93450/new-clinical-trial",
      "Title": "New Clinical Trial"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Well, hello and welcome to the group none of us wants to be in!  It appears we unfortunately have way more in common than most on here though! I found a lump in my breast in July, had a lumpectomy and full node clearance in August and was diagnosed with stage 3 breast cancer and it had spread to my lymph nodes. I am having chemo number 5 this Friday. One more after that (hopefully) and then radiotherapy. You are in one of the worst stages at the moment. The unknown! Once you have your results and a treatment plan, you can start fighting and dealing with it. Now, here's the really weird bit - my daughter, she was 14 at the time, was diagnosed in March 2012 with Hodgkins Lymphoma. She has finished her chemo but still has 3 monthly MRI's and check ups. How is your son doing now? So you see, you're not alone my lovely. There are many many people on here who will be able to help you every step of the way, you just have to ask. For us in particular though, we are already weary from fighting for and supporting our children through this god awful journey. Please feel free to friend request me and ask me anything, even if it's just to vent and rage about how unfair all this is!! Sending you a massive hug xxx",
      "MessageIndex": 4,
      "PostDate": "24/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68826/shock",
      "Title": "Shock"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "angie - thank you for taking the time to respond and I'm sorry you too have had this experience. Can I ask if you have had your mx yet and if so, how are you doing now? As you say, it is alarming how quickly it has come back - or was it there all along? I'm just so shocked and angry that surgery, chemo and rads didn't 'get rid' of it.  I did see a Macmillan counsellor for a while after my initial treatment - but for me it wasn't very useful. I do attend macmillan run yoga and rehab classes and I bolt to the centre for a coffee and some peace quite frequently.  Thanks again angie xx",
      "MessageIndex": 3,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90110/recurrence",
      "Title": "Recurrence"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hi mistymoley Thank you so much for responding. Yes, they won't do rads again in that area and it's less than a year since I was given it.  I am dreading having to go through chemo again - having nursed my daughter through it, and then me, the thought of all that again, fills me with dread. I wish they had done a mastectomy at diagnosis in July 2013. The cancer had already spread to my lymph nodes and at the time I felt they weren't being 'thorough' enough. But it is what it is I guess. How are you doing now, I hope you are doing well and coming out the other side?!",
      "MessageIndex": 4,
      "PostDate": "19/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90110/recurrence",
      "Title": "Recurrence"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Whilst I lurk around in the background on here a fair bit, I didn't really envisage that I would be asking you all for help and advice so soon after my treatment ended. I was diagnosed with stage 3 breast cancer in July 2013. I had a lumpectomy and a node clearance. Chemo and radiotherapy followed, which I completed almost a year ago. I had a clear mammogram in September 2014.  A few weeks ago I found some more lumps in my 'bad' breast. Referred back to my breast care unit. Yesterday I had an ultra sound and two core biopsies. The oncologist said he was 90% sure that it was recurrence. I go back in a few weeks time for a treatment plan to be put in place. No rads, possibly chemo and a mastectomy. I'm obviously devastated. Shocked that the surgery, chemo and radiotherapy didn't work and appalled at how quickly the cancer is growing if it didn't show on a mammo five months ago. I just wondered if there was anyone else here who may have gone through, or is going through a similar scenario? Feeling very lost. I'm a single mum to two teenagers. The eldest was herself diagnosed with Hodgkins in 2012. This dreadful disease seems to be determined to haunt us.  Thank you.",
      "MessageIndex": 0,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90110/recurrence",
      "Title": "Recurrence"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hey Binny No it's not you!! Yes I did the survey too. Just tried to link back into the main question, via my emails, set by the girl, Jess, and it appears the post has been moderator/administrator removed. Bev xxx",
      "MessageIndex": 1,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65749/what-happened",
      "Title": "What happened."
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Haha - love the brilliance of you peeps on here.  Another mystery solved!   :)",
      "MessageIndex": 5,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65749/what-happened",
      "Title": "What happened."
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hello Barbs Firstly I'm sorry to here you have to go through this once again. Last week I posted something very similar on here! I was diagnosed stage 3 invasive in July 2013. Had a lumpectomy, full node clearance, chemo and rads. Finished my treatment just about a year ago. Last month I found some lumps, the most distinctive one being on my side/arm pit, but I could also feel one along my scar. Went to GP, he referred me straight back to breast unit and last Tuesday, after biopsies and ultra sound, I was told it was back!  I have to go back on the 12 March for a treatment plan. The probable option being a mastectomy - but I haven't as yet been given any details of 'types'. I was aware that I wouldn't be able to have to radiotherapy, because of already having had it. Like you, I have tried to do everything I can to be 'healthy'! I put on almost 3 stone because of the steroids, chemo and enforced inactivity. Since finishing treatment, I have attended weekly rehab fitness classes, taken up yoga, walk for twenty minutes a day, go for regular lymphodema drainage, changed my diet and I don't drink and have never smoked! I am so angry and frustrated that I did everything that was asked of me, everything that was supposed to get rid of it! My hair is only just growing back!! I'm a single mum to two teenage girls and every scenario possible is going through my head during this 'limbo' time of waiting to see what's next! So, whilst I don't have any insights to offer you right now, I'm more than willing to 'hold your hand' whilst we go through all again!! Bev  ",
      "MessageIndex": 2,
      "PostDate": "25/02/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90438/help-with-recurrence",
      "Title": "Help with recurrence"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hello again all! So, I just started to feel the tiniest bit 'normal' after my first cycle of TAC last Wednesday. Then I started taking Ciprofloxacin 500mg tabs - one twice a day. Oh my goodness these are making me feel awful! Really really bad stomach upset, constant feeling of sickness, headaches and dizzinesss. I can't sleep and have constant lower back pain. Is there an alternative I could ask for? Anyone else had this experience? Thanking you in advance lovely people xxx",
      "MessageIndex": 0,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65633/ciprofloxacin---yuk",
      "Title": "CIPROFLOXACIN - Yuk!!"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hi Thanks for your reply. Yes they are for antibiotic use. I often react like this to normal antibiotics - it's just a lot worse on these things! Have just spoken to my onc and he said to stop taking them completely and not try anything else. He advised that I should check my temp regularly as I was now 'wide open' to infection and that if my temp spiked at 38 I'd have to go in and be admitted. Will deal with that as and when! Thank you again. Best wishes B",
      "MessageIndex": 2,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65633/ciprofloxacin---yuk",
      "Title": "CIPROFLOXACIN - Yuk!!"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hi Thank you for your reply. Yes the link you posted is the one the hospital printed off and gave to me yesterday. TAC - Taxotere, Adriamycin(doxorubicin)  and Cyclophosphamide Does seem to be a bit more unusual - but the lovely Maccy peeps are already stepping forward! Thanks again. Best wishes Bev",
      "MessageIndex": 5,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64798/top-tips-for-tac-treatment",
      "Title": "Top tips for TAC treatment?"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hi all I start 18 weeks of TAC chemo at the beginning of October. Have any of you been through it, got any practical tips or advice for getting through it? Any advice gratefully received! xxx",
      "MessageIndex": 0,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64798/top-tips-for-tac-treatment",
      "Title": "Top tips for TAC treatment?"
    },
    {
      "AuthorID": "wearymum",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wearymum",
      "Content": "Hi Sue Thank you so much for your reply. Yes, TAC does seem to be a less frequently used regime. I too have been told that it's tough going! Thank you for your tips - they will allow me to be a bit more 'armed'! Hope your next cycle goes ok next week - let me know? Take care and virtual hugs to you too Bev",
      "MessageIndex": 3,
      "PostDate": "17/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64798/top-tips-for-tac-treatment",
      "Title": "Top tips for TAC treatment?"
    }
  ]
}