{
  "AuthorID": "weemaw",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
  "Posts": [
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I've been taking Tamoxifen since 2014, recently advised it'll be for 10 years rather than 5. I've had bleeding every 6 months or so since August 2016 and previous gynae checks showed thickening in the lining of the womb consistent with tamoxifen. In the last few months I have had three episodes of severe lower abdominal pain which comes on suddenly and is cripplingly painful for 20-30 minutes and I have cold sweat and feeling like I could pass out. It would appear that this could be a ruptured ovarian cyst- one of my gynae checks showed a 4cm cyst.  Just wondering if anyone else has experienced this with Tamoxifen.",
      "MessageIndex": 0,
      "PostDate": "28/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/153791/tamoxifen-and-ovarian-cysts",
      "Title": "Tamoxifen and ovarian cysts"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I had a lumpectomy on 5th June,  initially like you I was told it was likely to be op followed by radiotherapy and tamoxifen. When my results came back I was told it was grade 3, which is normal for someone my age (I'm 45) but because it was HER2 positive and gene reactive (?) I would need chemo in order for them to administer Herceptin. That was actually a bigger kick in the teeth than being told I had cancer, mainly because in my head the options were either that it hadn't gone to lymphs so only radiotherapy or it had gone to lymphs and I'd need chemo, instead I was told nothing in lymphs but getting chemo anyway! So the chemo treatment I am on is FEC-T, which is normally 3 cycles of FEC followed by 3 cycles of Docetaxel (Taxotere) with Herceptin, followed by a further 17 Herceptin. I opted to take part in a trial (SOLD)  which has two arms, the long arm continuing with 17 further Herceptin as per current treatment and the short arm being given only 3 with chemo. Herceptin has some side effects on the heart and smaller trials have shown that giving just the three treatments has been as effective as being given the further 17. I was selected for the long arm, but the trial gives the Tax before the FEC. The treatments are given in 3weekly cycles,  for the Taxotere plus Herceptin the first session was all day because they have to monitor for allergic reaction to Herceptin, the 2 subsequent sessions I was in for 9:30/10am and would be finished for 12:30/1pm, this was because they have to monitor Herceptin for an hour before they administer Tax, ladies in for Tax only were finished a lot quicker. FEC is much quicker though, I'm in about 9:30-10am and finished by 11am.  I've got my last chemo this week and will be back again every 3 weeks for my Herceptin on it's own for the other 17 sessions. I've also to get radiotherapy, but I've no idea how many sessions, I know that rads are given Monday to Friday for however many weeks you need to get, I'm hoping this will all be over by Christmas though. I hope this gives you a rough idea, but it's all going to depend on what you doctor says you need. The chemo is not great, but if it gives a better shot at a cancer free outcome then it's got to be worthwhile and its expensive so they won't offer it unless it's the best thing for you. good luck, make sure let us know how you get on x",
      "MessageIndex": 5,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85008/treatment",
      "Title": "treatment"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I suppose if you assume you will get the chemo then it can only be bonus if that's not the case, no help trying to plan your life out for the next few months though!! It's a bit ridiculous having to wait to see the oncologist, they probably already have the treatment plan done, my breast consultant told me the plan at my last meeting with him, I was completely shocked when he said chemo because it was the last thing I expected, it never really came into the equation, like you I expected radio and  tamoxifen. But at least he was upfront with me and I didn't need to wait on tenderhooks to see another dr. Now I'm at the end it's really weird, seems to have absolutely flown in, but I was talking to my husband about side effects I had in cycle 2 or 3 and we both agreed it seems like a lifetime ago!! keep your chin up, at least the surgery is over, one step closer to beating the wretched C  xx",
      "MessageIndex": 12,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85008/treatment",
      "Title": "treatment"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "The treatment has been hard going, no point in lying, but every single person is different, it depends on so many things. The hardest thing for me was the stomach discomfort during Tax, but I think if Id been given omezaprole I wouldn't have had that issue. The weakness and tiredness is horrendous, I felt like I was hardly of the couch for 4 months, but now I'm on FEC I'm feeling a lot better.  I think the important thing is to make sure you are telling your cancer team if you are struggling with any symptoms, dont accept feeling rotten because you think that's how it's meant to be, a lot of symptoms can be controlled. Now I'm heading for my 6th and final session I've actually started to forget how bad I felt, someone mentioned the loss of taste the other day and I'd genuinely not thought about it for ages! All the aches and pains will eventually be a distant memory, and this week I've noticed my hair is coming back, can't see it, but I can feel the fuzzy coating on my scalp :)  x",
      "MessageIndex": 10,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85008/treatment",
      "Title": "treatment"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Morning!!  I'm just wondering when is all clear given? I had WLE last June and told lymphs and margins were clear, completed FEC-t with herceptin and due to finish herceptin in August,  also getting tamoxifen.  No one has ever explicitly said all clear, but the surgeon did say this treatment is precautionary, so does that mean I was all clear after surgery?",
      "MessageIndex": 0,
      "PostDate": "18/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94326/when-is-all-clear",
      "Title": "when is all clear?"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Well done Karan, great inspiration to us all! Have a fab party and best of luck for your reconstruction xx",
      "MessageIndex": 6,
      "PostDate": "30/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85111/raising-a-glass-to-everyone-going-through-treatment",
      "Title": "Raising a glass to everyone going through treatment"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I've never even thought of things like this!! I'd guess it does start from the all clear mammogram but don't know, insurance companies can no doubt change dates to suit themselves..... Hope someone can shed some light on this for you. (congratulations on your 2 year all clear anyway!!!)",
      "MessageIndex": 1,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85257/5-years-all-clear",
      "Title": "5 years all clear"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "http://www.slimmingworld.com/health/swor/how-does-it-work.aspx Think it might be nationally available Karan, looks like it's at the discretion of the GP, this is where these forums are superb for sharing information :)",
      "MessageIndex": 1,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85254/did-you-know-help-with-weight-gain",
      "Title": "Did you know? Help with weight gain!"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I'm now 18 months post chemo. I have nothing negative to say- yeah there were a few days each cycle where I'd sleep for 18 hours and just wake up for pain killers for my sore bones- but your talking literally 2-3 days and it was like a mild flu. I was lucky to have the luxury of staying off work and having a husband who took over the cooking and cleaning (after 25 years it was his turn right enough). I managed out with my friends for coffee most weeks and while my taste buds were done, I found things I still liked. It's very odd to look back now and think \"actually I was unwell\" because suddenly you face a new \"normal\" and it's only once you get bits back that you realise you lost them. The chemo brain- no concentration, couldn't finish a sentence without being distracted- but people don't notice. I'm also one of the weird people who didn't really mind being bald- embrace it- it's a short time and doesn't change who you are inside.  And now, all that's left are annoying nails- I'm fully back to normal, body, brain and hair and it all seems like a dream.  Keep your diary- you will forget how you felt very quickly.  Oh, and don't pay too much heed to journalistic stuff like this- if you need to prepare, stick to realistic stuff on here- there will ALWAYS be someone at the same stage or at the next stage that you can compare notes with- day by day, that's what will get you through. xx",
      "MessageIndex": 16,
      "PostDate": "06/06/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/109960/decca-aitkenhead-in-the-guardian",
      "Title": "Decca Aitkenhead in the Guardian"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Thanks for replies. Spoke to oncology nurses, said the docetaxel will have damaged the nail bed, so just need to wait it out ",
      "MessageIndex": 6,
      "PostDate": "24/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94327/nails",
      "Title": "nails...."
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Another query, I am now 6 months post chemo and today I'm on 12/17 herceptin, thought my nails were coming back, but one hand has separated from nail beds again. Any ideas how long it'll be until they are normal? Thanks x",
      "MessageIndex": 0,
      "PostDate": "18/05/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/94327/nails",
      "Title": "nails...."
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Right back at you Yvonne xx ((0)) xx",
      "MessageIndex": 1,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85368/hello-all-my-lovely-friends",
      "Title": "Hello all my lovely friends"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Hi Shirls Sorry I don't know the answer to this. I was taking milkweed during my docetaxel and the Dr told me he hadn't heard of it so I was to stop. There have been trials, which is where I read about it, but he had no idea. Probably the best person to speak to would be a pharmacist because combination of medication is their speciality. Either phone a local one, or contact 111 any time , they should be able to advise.",
      "MessageIndex": 2,
      "PostDate": "30/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86471/herbal-remedies",
      "Title": "herbal remedies"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I had a similar experience,  I expected either that margins n lymphs would be clear and I'd get rads only or they wouldn't be and I'd get chemo, but no, that wasn't the case :( I think that was one of the few times I cried, chemotherapy really frightened me, I hate hate hate being sick, but to be honest it wasn't as bad as I'd expected. I'm still on herceptin,  but now back at work with a full head of hair - prevention in this case was much the same as cure.... ",
      "MessageIndex": 10,
      "PostDate": "12/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92558/triple-positive---is-chemo-necessary",
      "Title": "Triple positive - is chemo necessary?"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Antihistamine should help, I've had itchy hands and feet for years, but getting a different itch with FEC, antihistamine tablets work a treat though :) xx",
      "MessageIndex": 1,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85313/itchy-hands-and-feet",
      "Title": "Itchy hands and feet"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "So, it's been 3 weeks and 2 days since my last chemo. My hair started coming in the week before it finished and I now I have a visible hairline :) but today had a significant development, blew my nose and actually had mucous instead of congealed blood- it's the strangest things that make you realise you are getting back to normality.  Apologies for grossness but this made me happy, for anybody going through the nasties, it'll all be over soon xxx",
      "MessageIndex": 0,
      "PostDate": "30/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86503/strange-things-make-me-happy",
      "Title": "Strange things make me happy"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Hi Lola There is a difference between grade and stage of cancer, the radiographer estimated my lump as 18mm, but it was contained, when it was removed it was 25mm and I was classified as grade 3. I don't think the nurse would tell you stage or grade, that will be down to the consultant to explain. The unfortunate thing is that you need to wait for the results in order to get an answer, it's the hardest week out. I was told basically what I was dealing with and like you told family, I told everyone else once my biopsy was confirmed. Even once the plan was in place, I got my surgery and had to wait a few weeks until the results were back from the lumpectomy, when the plan changed and I had to get chemotherapy. Things will be a bit clearer by Thursday and at least you will feel things are moving on, what I would say is if you think of any questions over the next 2 days, write them down, the dr will give you loads of information, but the chances are you won't take it all in, so have someone with you, it might even be worth recording the meeting on your phone if the dr agrees. Try to stay positive, remember we are all here, all at different stages in treatment and all with different diagnoses, but you will always find someone in the same boat, or someone that's definitely been in that boat at some point. Take care x",
      "MessageIndex": 2,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85308/newbie---confused-and-scared",
      "Title": "Newbie - confused and scared"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "good for you!!! Hope the rest of ur treatment goes well xx",
      "MessageIndex": 1,
      "PostDate": "11/04/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/92589/final-chemo-done-woohoo",
      "Title": "Final chemo done.... woohoo!!"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I have developed a pain/ discomfort under my left arm in last couple of days. I had lumpectomy and sentinel lymph removed June 2014 completed radiotherapy in January this year, no issues with underarm until now. Difficult to describe, burning pain inside armpit, feels a bit hard at the area that is sore, but I think it is bone/tendon, doesn't feel like a lump or swelling and no oedema. Anybody else had anything like this at all? Will phone breast nurse on Monday if still there.",
      "MessageIndex": 0,
      "PostDate": "25/09/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99122/new-pain-under-arm",
      "Title": "New pain under arm"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Thanks ladies",
      "MessageIndex": 3,
      "PostDate": "01/11/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/99122/new-pain-under-arm",
      "Title": "New pain under arm"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I got my biopsy results a week later, because that is the day the dr does his clinic, I think it takes a full week for them to come back though. I don't think that two or three days would be much of a difference to the medical staff, although it is a lifetime to you so I doubt they would have called you in early, but that's just my guess. Everything does move quickly, but I'd say more in terms of weeks than days. hope no news is good news for you though take care x",
      "MessageIndex": 1,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85327/average-time-for-results",
      "Title": "Average time for results?"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "This is probably the worst time in this journey, because you have no control. Whatever the outcome tomorrow the control returns to you x",
      "MessageIndex": 4,
      "PostDate": "05/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85327/average-time-for-results",
      "Title": "Average time for results?"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I actually passed out during my first mammogram 5 years ago, when I just had a cyst. Told the radiotherapist when I went for my diagnosis one last year and they were a lot more gentle.",
      "MessageIndex": 6,
      "PostDate": "08/06/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/95074/year-on-mammogram-coming-up",
      "Title": "Year on mammogram coming up"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I've developed a new symptom in the last week or so. I had my last FEC two weeks ago, and last docetaxel + herceptin 11 weeks ago. I'm due to restart herceptin this Thursday and scheduled for ECG on Monday.  I've noticed that after exertion eg going upstairs or this morning coming in from the car, I get a throbbing discomfort in my upper spine, between my shoulders, I am very aware of the throb being my heartbeat, it only lasts seconds and not every time I climb stairs or do anything. I am very overweight and unfit, which has worsened throughout my treatment. Just wondered if anybody has any experience of this and whether I should seek medical advice before my ECG on Monday, you know if I attend a&e that they are likely to admit to be on the safe side.",
      "MessageIndex": 0,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86149/central-upper-back-pain",
      "Title": "central upper back pain"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Thanks for that :) That's what I was thinking, just looking for someone to agree I think.",
      "MessageIndex": 2,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86149/central-upper-back-pain",
      "Title": "central upper back pain"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "It's only natural to feel like that. My worst points were the first day I found out and had to tell my kids, a couple of days after my surgery (which I blamed on the anaesthetic) and a few days during my first load of chemo, when I felt really unwell. I felt so sorry for myself, but once you get your head around it you can accept it better. you will look back in 6 months and wonder where the time has gone, it just flies by. I hope being part of this group will help you, I feel much better just talking about things on here. Don't get too hung up on feeling you need to be permanently positive, but by the same token look at all the survivors comments on here, it's rarely gloomy, things will get better, and you always have someone to talk to here xx",
      "MessageIndex": 8,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85336/another-newbi",
      "Title": "Another newbi"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Hi Rosiero youve come to the right place. Plenty people here going through or been through similar emotional turmoil, you will get through it and we are all here to give you support.",
      "MessageIndex": 1,
      "PostDate": "04/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85336/another-newbi",
      "Title": "Another newbi"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Hi Rebecca I was diagnosed in may, had lumpectomy on June 5th. It was straightforward and really had no problems at all, other than a reaction to my dressings.  I was lucky that my lymphs were clear as was the margin of tissue around the lump that was removed. Unfortunately the pathology results showed lump was her2+ and hormone reactive so I've now had chemo and half way through radiotherapy. Although it was hard going, it wasn't as bad as I expected.  Just take each day as it comes, use this forum if you are unsure or worrying, don't be afraid to contact your breast nurses. I didn't think I was anxious, but had a nightmare the night before surgery, so I guess I was. Ive approached this positively all the way through,  and everything went so fast at the start, the only time I was really weepy was a couple of days after surgery, but I think that was a reaction to the anaesthetic. Hope all goes well Elaine x",
      "MessageIndex": 4,
      "PostDate": "21/12/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/87315/the-unknown",
      "Title": "The unknown"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "I was told I could use roll on unperfumed/ simple deodorant, would probably avoid any talc because like the spray deo it could cause issues with your scars and gather in the edge of the dressings making the smell worse. the smells from my dressings and underarm made me feel sick, especially with the plastic dressing, everything seemed to gather round the edges I just used soap and water and after a few days the roll on deo to try and reduce the sweating. It's hard to keep the dressings dry and clean, but its not too long until you are back to normal. Xx",
      "MessageIndex": 1,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85616/talcum-powder",
      "Title": "Talcum Powder"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "That was just the blisters from my dressing!!  have you spoken to anyone about removing the dressings?  That's why I was in such a mess, the surgeon did not want dressing changed over steri strips until my post op check up.",
      "MessageIndex": 4,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85616/talcum-powder",
      "Title": "Talcum Powder"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Oh and watch out for sweats around the edges of dressings, I was in a terrible mess with blisters.",
      "MessageIndex": 2,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85616/talcum-powder",
      "Title": "Talcum Powder"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Such a good feeling, no matter where it sprouts first. Eyelashes will make such a difference though!! I had sparse hair also, but started feeling a roughness the other day, couldn't work out if it was just the hair I had because it was longer, but no it's definitely new hair, three days on and it is almost visible, really really light blonde by the looks of it! That would save me dying it if it comes in that colour :) still no return yet of toe, chin or other more obvious areas though, which I am very ok with ;)",
      "MessageIndex": 12,
      "PostDate": "06/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/85409/an-exciting-day",
      "Title": "An exciting day!"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Thank you. I'm not a big fan of healthcare by Google,  I work for nhs24 and know the problems it can cause. The head pain died down on Monday night, but still getting odd bursts.  I'm working tomorrow,  but might try to see gp on Friday.  I feel like I'm wasting the time of my bcn and cancer nurse, they never have a reply, so feels a bit pointless asking them questions.  My gp doesn't seem to.have much idea about things either so I'm feeling a bit out on a limb and like I'm a hypochondriac :( if you could let me know what your Dr says Shazza, that might be helpful,  although I know we could each have something totally different ",
      "MessageIndex": 3,
      "PostDate": "04/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90720/headaches-high-bp-and-herceptin",
      "Title": "headaches, high BP and herceptin"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Hi Anybody with experience of the above? I had my 8th herceptin last Monday,  today I have had such a headache,  painkillers aren't helping,  I've tried drinking water but that's not helped. Just checked my blood pressure and it's through the roof, with diastolic between 89-103 at different readings and systolic 165-178. Looked up Google and looks like high BP doesn't cause headaches but herceptin does. I've had increasing headaches lately and been reporting them to nurses but nobody seems that concerned. This headache is worse than the usual, which have either been sinus type pain, or bursts of pain on top right of my head along with temples.  ",
      "MessageIndex": 0,
      "PostDate": "02/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90720/headaches-high-bp-and-herceptin",
      "Title": "headaches, high BP and herceptin"
    },
    {
      "AuthorID": "weemaw",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/weemaw",
      "Content": "Thanks Shaz Hope it goes well for you xxx ",
      "MessageIndex": 5,
      "PostDate": "07/03/2015",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/90720/headaches-high-bp-and-herceptin",
      "Title": "headaches, high BP and herceptin"
    }
  ]
}