{
  "AuthorID": "whiskers",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
  "Posts": [
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi all, have got that age old question again :( I finished chemo (Fec-T) Nov 13 and rads Jan 14. I'm 38 and never had serious health issues til the BC. I feel like my health and energy is deteriorating as time goes on but know my health is ok itself as had every test imaginable in the last 3 months due to suffering a mini stroke from the tamoxifen. I am under a lot of stress financially and emotionaly and am a single working parents so not sure if it could be down to that. I'm due to have a hysterectomy soon but worried I'll be more off my feet if I go ahead. I'm constantly tierd, faint, dizzy and am having increasing trouble with my eyesight. My legs don't seem to work properly and I always feel uneasy walking, it's like I forget how to work my legs sometimes :/ I deal with so many health professionals and have no idea who to call, I don't have a designated BC nurse, my doctors have a months waiting and evertime I see my onc I wait for 2/3 hours past my appointment waiting. I don't sleep at night and actually dread going to bed. Sorry for the winge just wonder sometimes why I went through all this treatment when I feel I have been left with no quality of life :(",
      "MessageIndex": 0,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84244/nearly-10-months-out-if-chemo-and-still-feeling-poo",
      "Title": "nearly 10 months out if chemo and still feeling poo :("
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Oh also had MX and LNC May 2013",
      "MessageIndex": 1,
      "PostDate": "12/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84244/nearly-10-months-out-if-chemo-and-still-feeling-poo",
      "Title": "nearly 10 months out if chemo and still feeling poo :("
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi all, Thankyou for all your kind words and advice. I truly am my own worst enemy. I am fiercely independent and do have trouble asking for help. I have literally no family but am lucky enough to have a massive group of amazing friends, my biggest issue is though I don't and won't talk to them about it as that is my one bit of normality where I can be the old me. I feel like a bit of a fake though as they are all so so proud of me and I know all of them would drop everything if I needed any of them. I think I need to get off my fat ass and call Macmillan if I'm honest. My problem with getting out more is I don't feel safe due to the dizziness and faitness so I'm kind of stuck in a catch 22. I recognize what my problems are and know what I have to do to resolve them it's just seems I am lacking the physical and mental capacity to do it. I do hand on my heart think this stage is 100 times worse than the treatment stage and am amazed at how little is focused on this part of our journey :(",
      "MessageIndex": 8,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84244/nearly-10-months-out-if-chemo-and-still-feeling-poo",
      "Title": "nearly 10 months out if chemo and still feeling poo :("
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi Katherines, sorry to hear your having a wobble and just want you to know it's completely normal. I finished my chemo November 2013 and halfway through had a major wobble and was adamant I didn't want to go through anymore. I basically sat myself down and gave myself a rollicking looking at the outcome of both situations. For me the thought of not finishing and living with the fear of not knowing if it would come back because I have up was enough to spur me on. Now I am so glad I completed it and know I have done everything I could to get my life back. You can do this your not alone. Your nearly there and soon this will all be a distant memory :)",
      "MessageIndex": 1,
      "PostDate": "01/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi Katherines, so glad your feeling so more up beat. I tried to count the dark days as a right off and just slept as much as I could and expected nothing from myself and before I knew it each day was another day closer to my good days. I found it helpful to write lists and plan things for my good days which gave me something to look forward too, that and spending way too much money internet shopping for clothes and nice things lol. Your nearly there and are so not alone. Whenever I felt down I popped on here for a read and just knowing that helped me through my darkest days, :) x",
      "MessageIndex": 18,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82167/chemotherapy---i-m-struggling",
      "Title": "chemotherapy - I'm struggling"
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi Trudi, yes my nerves are shot in my hands and feet also. I constantly have pins and needles. I feel like my muscles have suffered too as they are so weak. Don't know if your the same as me but I get fed up and jealous of people on the TV running about and just generally being out and about. I never go out on my own and worry that maybe some of the dizziness and faintness could be being made worse by it maybe slightly developing into agoraphobia. I think it could be possible as the stress of being out and feeling unsteady could now be turning into that. It's a vicious circle we are in :(",
      "MessageIndex": 10,
      "PostDate": "17/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84244/nearly-10-months-out-if-chemo-and-still-feeling-poo",
      "Title": "nearly 10 months out if chemo and still feeling poo :("
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Good luck for today, just think this time tomorrow the little bugger will be gone and in the bin :-) nearly a year from my mastectomy and the relief I felt knowing it was no longer lurking in my body was great. Good luck and any advice I can give just ask, Emma :-)",
      "MessageIndex": 1,
      "PostDate": "07/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/74848/op-day-at-last",
      "Title": "Op day at last..."
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Sorry cosplay not display wigs. Damn auto correct :/",
      "MessageIndex": 33,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi all. Thought I'd pop in to give you my experience with the cold cap. I had extremely thick long fire engine red hair which was also my trademark and I was mortified at the thought of losing it so I thought I would give it a go. I lasted 5 out of 6 treatments (finished Nov 13) til I finally gave up after resembling a monk with a cracking bald patch slap bang in the middle. I put it down to the fact I have a fat head and it kept rising off the top of my head :/ weird thing is the relief knowing I didn't have to wear it again was huge as it actually made me feel physically sick when I had it on. I don't regret trying it though as I was told even if you do loose it it protects the damage caused to your new hair. Now 9 months later I have 4inches of the thickest hair you will ever see and laugh at myself in the mirror every morning as I resemble sideshow Bob off the Simpson's. I ended up buying around 50 display wigs in every colour you could think and thought if I'm gonna wear a wig to hell with it I'm gonna do it with style as I've always had an alternative look. I think I may actually miss my wigs as its great fun confusing people with the different looks :)",
      "MessageIndex": 32,
      "PostDate": "11/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81550/hair-loss--",
      "Title": "Hair loss :-("
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi sianikb, so sorry your having a rough time atm, your def not alone with these feelings. I finished my active treatment January this year and feel more miserable now then when I was having treatment. I suffered from terrible fatigue, aches and pains, dizziness, palpitations and constant fear of impending doom :( I know most of this is down to depression or as I've read up post traumatic stress which is if you think about it spot on after what we have been through. I had a mini stroke due to meds and now have to have a hysterectomy as I can no longer take tamoxifen so yet more stress and I'm 37 :/ I have decided though to consentrate on my mental state atm as that is the main thing effecting my quality of life so am going to seek professional help, change my diet and really try and build up my exercise routine which is zero atm :/ I've been single for 6 years and have very little family but luckily many friends but none of them know or consider me to be unwell still which is so far from the truth. I don't want to tell you what I think in regards to your partner as I'm a bit of a beep when it comes to men now and fiercely independent but what I would say is it's your life and you have faught so Damn hard for it so you and only you can take it back. I have gotten rid of anybody who brings me down and will not let this be my life, it's too precious so I will fight tooth and nails to get it back at any cost. I wish you well, we are all here :)",
      "MessageIndex": 1,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82457/stupid-disease",
      "Title": "Stupid disease"
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi hairworries, I had 100 FEC and used the paxman but gave up on the 5th after loosing the top part of my hair dye to the cap raising off my head and strangely enough by that point I was relieved to take control. Our hair is very important to us and forms our identity so I completely get where your fear comes from but in the grand scheme of things the fear of the cancer coming back for me was much more of a fear and I felt my hair would return alot quicker than spending the rest of my life with the uncertainty. I was very known for my hair very long thick and fire engine red. I also have the same problem my hair is so thick and frizzy so I had to spend hours straightening it every time so short hair was a big no no for me. I finished my chemo November 2013 and now have 5inches of bright red hair again and have just learned to accessorize with Alice bands and clips and use argon oil to calm it. I used fast shampoo and while I still where wigs I'm getting there. I will be getting Clip in hair extensions as they are so much kinder for your hair and easier to fit. Good luck with whatever you choose but know it is doable and I personally have no regrets for my decision and know I have done everything possible to kick this in the ass :)",
      "MessageIndex": 16,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84241/cmf-or-fec-with-a-cold-cap",
      "Title": "CMF OR FEC WITH A COLD CAP?"
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hiya Traceybee, I suffer with this still now 10 months after FecT. It's called Peripheral Neuropathy. I get it in my hands and feet mainly in the mornings and find just wiggling my hands and feet gets the feeling back. It is something I have been told is long term but it has greatly improved over time and can be relieved just with movement. I find it tends to play up the more inactive I am. Yet again another lovely side affect that me personally were never warned about :/",
      "MessageIndex": 4,
      "PostDate": "20/10/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/84643/pins-and-needles-in-fingers",
      "Title": "Pins and needles in fingers"
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "I have followed this thread since the start and honestly do not know how to reply. I find it terribly sad as I think your decisions are based on your fears and I apologise if I speak out of turn as I do not wish to insult you. If I thought begging you to reconsider having this monster taken out of your body would work I would. I fully wish you all the luck in the world but I can't help but worry when your posts will stop. Maybe go back to the start of your thread and read how it has progressed and grown in this time already. Again I wish you well and hope you prove us all wrong x",
      "MessageIndex": 56,
      "PostDate": "21/04/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Thanks for your kind words Benja. Just feels like we are going round in circles sometimes. I'm known as a really strong person and if my friends knew how I felt I think they would be mortified and possibly not be able to handle it. I have 2 jobs and continued to work through it as financially I had no choice. I just wish I could skip the next 12 months and have my reconstruction, hysterectomy and Barnet well on its way. I feel so nieve now as last year the thought of next year will be better got me through. I know I have no choice and have to get on with it but sometimes I just get so tierd :( does help to blurt it out though so Thankyou, I'm very bad at bottling things up :/ x",
      "MessageIndex": 2,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81516/never-ending",
      "Title": "never ending :("
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi all, don't post on here very often although I do read through the threads regularly. Just needed to have a moan as it always is no one else gets it me being 8 months since the end of treatment (mx, 6 fec-t,15 rads). After taking tamoxifen for 6 months I have been taken off it due to it causing me to have a mini stroke (no past heart probs) Que loads more tests, scans hospital appointments :( now been told I have to have a hysterectomy which will put my reconstruction back even further. I was promised I would not be left looking like this and now have this to contend with along with being lopsided for another 12 months (mx may 2013) I'm so fed up and feeling ugly with my crap hair, butchered body and now they want to remove the last bit of femininity left of me. I'm just so angry because I have no idea who to talk to as I see so many professionals and I hide it from my friends as they wouldn't understand. To top it off I'm having bad pains in my ribs but I'm that fed up I'm just thinking sod it. I'm 36 single and can't even look in the mirror :( Phew first time I've ever blurted that out :/",
      "MessageIndex": 0,
      "PostDate": "20/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81516/never-ending",
      "Title": "never ending :("
    },
    {
      "AuthorID": "whiskers",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/whiskers",
      "Content": "Hi Lucy, I'm new to posting on this site but have been stalking it for the last year late at night for support and answers. Have you been over to the breast cancer site also. Both these sites have been amazing in helping me understand and get through the last 12 months. My reason for deciding on posting on this site now is from reading your thread. I too was dx this time last year at the age of 36 with grade 3 invasive breast cancer which turned out to be grade 2 after it was removed. My lump was large at 7cm and 2 out 34 lyphm nodes effected. I just want to let you know whilst it's not easy it is completely doable and you will amaze yourself at how strong you can be. I had a mx, 6 fec-t, 15 rads and am now on tamoxifen and have come out the other end fighting with a new lease of life. You can do this and with the help of everyone on this site and the breast cancer site you never have to go through it on your own. If I can offer you any help or advice please just drop me a line. I wish you all the luck in your journey and remember you CAN do this Emma :-)",
      "MessageIndex": 4,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/73457/i-m-panicked-and-feeling-desperate",
      "Title": "I'm panicked and feeling desperate."
    }
  ]
}