{
  "AuthorID": "Wigglewoo",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wigglewoo",
  "Posts": [
    {
      "AuthorID": "Wigglewoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wigglewoo",
      "Content": "Sorry to hear this Pointer, I have been thinking of you today. At least now you know what your dealing with and can make a plan and out of the horrible limbo stage. Sending lots of hugs x",
      "MessageIndex": 4,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/159893/diagnosed-today",
      "Title": "Diagnosed Today"
    },
    {
      "AuthorID": "Wigglewoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wigglewoo",
      "Content": "Have spoken to the breast care nurse who is booking me an appointment to get checked out. Will be the standard 2-3 week wait but I do see my oncologist on the 29th so will see which happens first. I forgot how much the waiting time was the worst! X",
      "MessageIndex": 3,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179572/worried-about-lump",
      "Title": "Worried about lump"
    },
    {
      "AuthorID": "Wigglewoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wigglewoo",
      "Content": "It’s been a while since I’ve been on here but had some great advice before.  Last June I was diagnosed with breast cancer, I’ve had 6 rounds of chemo, mastectomy and last week finished 15 rounds of radiotherapy. I’m still having Herceptin jabs every 3 weeks. This evening I was lathering on the cream to treat the sore skin from radiotherapy and I’ve noticed a hard, round lump. It feels exactly like the lump I found last May and I’m freaking out! Will call my breast nurse first thing but now I can’t sleep and I’m a right mess!  Can it be cancer after all the treatment I’ve had? Is it something not so sinister? I’ll take any reassurance right now! X",
      "MessageIndex": 0,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179572/worried-about-lump",
      "Title": "Worried about lump"
    },
    {
      "AuthorID": "Wigglewoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wigglewoo",
      "Content": "Thank you puzzler, I managed to get a few hours. I’m hoping the breast care nurse at the hospital will see me and by pass the GP as I’m still under their care as still having treatment. I’m really hoping it’s the radiotherapy but any lump now is going to freak me out, I guess I’ll be living with the the rest of my life. I have my daughters birthday tomorrow to distract me over the weekend x",
      "MessageIndex": 2,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179572/worried-about-lump",
      "Title": "Worried about lump"
    },
    {
      "AuthorID": "Wigglewoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wigglewoo",
      "Content": "Thanks for you reply youngatheart and I’m shocked to hear you haven’t had a follow up appointment! They told me I’ll have one with radiologist in 6-8 weeks. My oncologist appointment has been booked for months and is a follow up after chemotherapy. I would definitely insist on a check up, like you say to know what to look out for! Any lump I find now is going to fill me with panic so just getting some confirmation that this is normal is what I need. I’d be very surprised if it were cancer, my last radiotherapy session was a week ago, surely nothing would have survived?  I wish you all the best, please keep me posted xx",
      "MessageIndex": 5,
      "PostDate": "12/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179572/worried-about-lump",
      "Title": "Worried about lump"
    },
    {
      "AuthorID": "Wigglewoo",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wigglewoo",
      "Content": "So I rang last Friday and told they would book me in, I’ve had no appointment come through so rang my breast care nurse. She called back to say no appointment had been made and that clinic is full! She said she sweet talked them and has got me an appointment for 7th May which is forever away! I see my oncologist before then so will ask them then to take a look. ",
      "MessageIndex": 7,
      "PostDate": "18/04/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/179572/worried-about-lump",
      "Title": "Worried about lump"
    }
  ]
}