{
  "AuthorID": "wildwitchy",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
  "Posts": [
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "Hi Pat, I think the waiting game is the worst time of it. You can now focus on your treatment & recovery. Keep the fighting spirit. It thrives on unhappiness. There are brilliant treatments now for it & I feel very positive about things myself. Good luck on your journey with this. Big hugs, Sharon. xxx",
      "MessageIndex": 11,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/45917/waiting-game",
      "Title": "Waiting game"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "Hi Nenz, I went to wills wigs & chose a long style as I had long hair but now ive got it cropped ready for the fall out!! I might buy a short one instead. Wish i'd of waited as it suits me short!! I do think I will wear hats & scarves too as I found the long wig quite hot. Apparently the nurse at the Q.E said wills wigs have a bigger selection than HOF. I haven't been to HOF myself. Good luck, Sharon. xxx",
      "MessageIndex": 1,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46265/advice-on-wigs",
      "Title": "Advice on wigs"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "I'm so fed up. I've had all my treatment (6 months E-CMF chemo, lumpectomy, 17 doses radio - finished 10th Oct . Started tamoxifen after my surgery, tryed Anastrazole but didn't suit.) I'm supposed to be on the road to recovery and I feel just absolutely terrible. I'm in bed untill 5pm, then can't sleep. I've hardly any appetite at all. Can't be bothered with anything. Thank god for my husband at the moment doing the household chores! No energy for anything. I think I feel worse now than I did at the start. Anyoneone else been like this?",
      "MessageIndex": 0,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54515/had-all-treatment-feel-terrible",
      "Title": "Had all treatment & feel terrible!"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "She could be pushing you away in case she thinks you'll run away. A self defense measure.  I gave my husband a terrible time of it when I had a insitu malignant melanoma some years ago which compared to now having BC was a walk in the park! We wasn't married then. Having a diagnosis of cancer is a really confusing scary emotional time. Perhaps she doesn't like to be fussed over too much & has found the whole thing just too much. Some patients don't actually like too much fuss & withdraw to think  (thats with a nurses head on). Sometimes people around you end up being looked after more than the patient, perhaps she's trying to protect you. I have found myself jollying my Dad up!! (Which is pretty well bizzare). Even though me and hubby have been together years I had to ask him....................... Well, you know i'll end up with half a boob at least or a masectomy. It will look crap. He said, You will be alive. I said, Shall I put my wig on when we have sex because I will be bald. He said, no dont bother, it should come off if the sex is good enough! I was worrying about my looks, really worrying. It had been on my mind & I hadnt told him. He couldn't of cared less. My one eyebrow came off tonight, I said, What do you think, he said, You never had hardly any eyebrows anyway..... She could be worrying about these things too & many others that seem massive to her. Give her time & don't be a man. Good luck & blessings. x",
      "MessageIndex": 7,
      "PostDate": "19/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46264/confused-over-relationship",
      "Title": "confused over relationship"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "Thank you all for replying. It's all very kind of you. I had to go to work today for a return to work review and I ended up upsetting the senior manager! I really am not ready for work yet! I think they have realised that now after my little tirade! I phoned the breast care nurse, first time i've done it since I started my treatment & she was very good. I told her how ghastly I was feeling, so she's going to have a word with my oncologist and get me back into clinic for bloods etc as ths morning I nearly passed out/sick. I think what you said, babslomax, my problem is I feel guilty for feeling weak, as i'm used to doing everything. I feel totally incapable and useless. I knew what to expect after chemo, surgery.  The radiologists wasn't that great. They kind of left me a bit in the dark with that one. So now, i'm now sure how i'm expected to feel.",
      "MessageIndex": 4,
      "PostDate": "25/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54515/had-all-treatment-feel-terrible",
      "Title": "Had all treatment & feel terrible!"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "In my experience, I've found if i'm walking about im ok. My husband has been not too bad but perhaps could be a bit better. Thats just how he is, bloody selfish half the time or doesn't even think!!! A man/Woman thing. Today, I've felt very faigued & had a blinding headache (had a  pyjama day) but he still didnt feed the animals, hasnt washed up or even offered to make me a bloody cup of tea all day!!!!!!!!!!!!!! Do I need to tell him?? I'm not a needy person either, exceptionally independant usually!!! Many women are always used to doing everything & being on top of everything. I'm afraid some men arn't usually. We can multiskill & when we don't they're world falls apart. I'm not being sexist, its just how it is. My dad is useless in the emotional dept, especially after my mom died. My mom was the one who kept on top of the house etc. He does it, but only just. He goes to work so can't do both!! My husband doesn't bloody work and still doesn't do it, so please take heart ladies. Hugs are very important & you've got to tell him so. A cuddle is all you want. This line can become a little blurred for chaps. You've got to make you're voice heard and tell them how you feel. They're certainly not mind readers, I've learn't that for sure.",
      "MessageIndex": 4,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46337/husband-response---not-that-interested",
      "Title": "Husband response - not that interested?!"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "Men don't read signals!!! Ive just been changing my bed linen and even the dog, bless her whos old and aged shepherd, had to bark at him to tell him open the door i want a wee!!! He took no notice, so I said, CAN YOU TAKE THE DOG INTO THE GARDEN WHILE I DOOOOOOOOOOOOO MY BED!!!!!!!! I think i'm going to scream now..............  ",
      "MessageIndex": 7,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46337/husband-response---not-that-interested",
      "Title": "Husband response - not that interested?!"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "I was diagnosed with invasive ductal breat cancer on 19th Dec, stage 3. 39mm. I'm having my chemo 1st (started yesterday) Epi-CMF to shrink it then wide local exision?, then radio then hormone tabs. I was talking to one of the chemo nurses about it and she said most people have surgery first but wouldn't tell me why, saying , oh you've got to speak to your oncologist & i've started to mither a bit. I haven't really been worrying to be honest, taking a very positive attitude & she's made me worry now!",
      "MessageIndex": 0,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46140/chemo-first-then-surgery",
      "Title": "Chemo first then surgery?"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "I wish you all the very best with your scan & your operation when you have it. What chemo are you on?",
      "MessageIndex": 2,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46140/chemo-first-then-surgery",
      "Title": "Chemo first then surgery?"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "Hi nicola & Looby7.  I dont know if mine has got bigger? They just said it would swell and go harder after having a titanium clip put in. This is so they can find it, as theyre hoping 4 it 2 dissapear or shrink alot with drastic chemo! I hope so!  I've had no other scans since the first lot so dont know if it has got bigger or not.  Ive felt not too bad considering, except 4 sunday & 2day. Thought i may have infection but it was a false alarm thank goodness! Felt tired 2day (still got housework, washing done etc) ,ate toast, cornflakes, mooses. The epirubcin is supposed 2 make u feel very sick but ive had very good meds plus ive used accupressure arm  travel bands which i think have helped alot. Took them off 2 wash and felt more sick. Had a bit of stomach ache.  I felt very apprensive about the chemo but its been better than i thought. If u think u will b sick, u will b. A oncologist was talking 2 me about it and i think shes right. Positive thinking. I wish u all the best and lots of healing blessings. Love Sharon. Xxx",
      "MessageIndex": 5,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46140/chemo-first-then-surgery",
      "Title": "Chemo first then surgery?"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "I'm afraid mine has took the hump good and proper. I was getting more & more fed up up him not helping, He could sense the impending doom. So he said, What have I done???????? I shouted, BLOODY NOTHING!!!!!!!!!!!!!!!!!!! The washing up was done & clothes off line were bought in when I got back in from retail therapy! All is quiet on western front.........",
      "MessageIndex": 14,
      "PostDate": "22/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46337/husband-response---not-that-interested",
      "Title": "Husband response - not that interested?!"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "Hi Looby7, Yes well I was mithering because women seem to having their lumps removed first but the onc was saying it will be  better with chemo first, less invasive like you. I'm 41 (similar age).  When the nurse wouldnt discuss it, I became scared again. Not that i'm a frigtened type of person! I think i'm just getting confused by it all!! Yes, like you they want to see the chemo doing its job and if it isnt they'll change tack! They're planning on my op sometime in the summer. Doing a sentinal node biopsy as the ultrasound showed nothing. If theres nothing in the first few nodes I think im in the clear (too much info to take in!!!!) . Not my dept!!! Yes, keep in touch, Wishing you all the very best on this rock n roller ride!! Sharon. xxxxxxxxxx  ",
      "MessageIndex": 6,
      "PostDate": "16/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46140/chemo-first-then-surgery",
      "Title": "Chemo first then surgery?"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "A really big big Reiki  hug sue. This is a bloody horrible scary thing, that can go from one extreme to another. I can go from feeling the bravest person in the world & then I get worried but only for a short time. Please don't dwell on the bad stuff, it will do you no good. I don't smoke but I can imagine it must be hard giving up. Especially at a time like this!! Are you trying patches etc to help you & contacting your G.P? I would of thought it's not really right, just to go cold turkey? When you feel exhausted it makes you feel worse too. Call the breast care nurses, they are good. It takes a while to recover from surgery. The aneasthetic takes ages to get out your system. Give yourself time to recover & relax. It's a tough journey this is. Sending love & hugs, Sharon.",
      "MessageIndex": 1,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46310/just-need-a-hug",
      "Title": "Just need a hug"
    },
    {
      "AuthorID": "wildwitchy",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wildwitchy",
      "Content": "Champex. A friend of mine stopped smoking with them.",
      "MessageIndex": 7,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/46310/just-need-a-hug",
      "Title": "Just need a hug"
    }
  ]
}