{
  "AuthorID": "Willow74",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
  "Posts": [
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Thanks for the replies. Keeker you always give such good advice so thank you! Leo123, our stories sound very similar so that's helpful - good luck with the remaining radio sessions and well done on getting to where you are. Ladyb111rd - thanks for your comments as well. Just not having a good time at the moment as I don't feel that I'm under anyone's 'care' and I don't understand what's happening. Just had the craziest conversation with the breast care helpline as my surgeon advised that in his opinion I wouldn't need chemo and I don't understand why this isn't being given as an option. I must be crazy - I should just count my lucky stars as I know a lot of people would give anything to be told this but I can't stop worrying that something microscopic has spread. Helpline was great and I hadn't realised that I was meant to have had opportunity to sit down with oncologist to discuss results. Just had ten minute chat with surgeon. I'm going to follow up with insurance company to see what my options might be to talk through my results with an oncologist as I'll go crazy if I have to sit patiently and wait for a letter to drop on the mat in four weeks time!",
      "MessageIndex": 4,
      "PostDate": "30/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82013/transfer-from-private-care-to-nhs",
      "Title": "Transfer from private care to NHS"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Hi. I'd love to hear of anyone's experience of transferring from private care to NHS. I had two wle and an snb privately as there were NHS delays in my local area due to a lack of consultants. I've racked up £1000 travel costs and 4000 miles in the last ten weeks! I'm now waiting for the consultant at the private hospital to post my results to the local team. He didn't think I'd need chemo - straight to radio followed by tamoxifen but to be decided by local team. I spoke to my gp who recommended that I call if I'd heard nothing further by the end of September. I'm feeling very anxious. I now have a four week wait with no breast cancer nurse or support network and feel completely on my own. I don't feel confident with the information I've been given regarding the referral from the hospital to NHS care. Has anyone been in a similar position? X",
      "MessageIndex": 0,
      "PostDate": "30/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82013/transfer-from-private-care-to-nhs",
      "Title": "Transfer from private care to NHS"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Hi all. Just joined the forum and having read some recent posts I can see it's going to be a great help going forward in terms of advice but also in terms of knowing that there are people out there who understand. I've recently been diagnosed with invasive ducal carcinoma. I'm 39 years old and had been making grand plans for my 40th in October and now trying to accept that I'll be going through treatment in whatever shape it takes. I feel oddly detached from the whole thing, like it's happening to someone else and seem to be spending a lot of time reassuring friends and family that it's nothing to worry about and it will all be ok. I'm sure I should be more upset but I just feel a bit numb. It feels like everything is on hold or someone pushed the pause button on my life. Off work following wle and snb last week and feeling guilty and a bit fraudulent as not in a great amount of pain but I just don't feel I can deal with work. 2nd surgery next week and at least I know what to expect this time. I'm lucky in a lot of respects. Results so far have been good - no node involvement, strongly ER+. I don't have children and I feel desperately for the mums and dads that need to deal with this. What I'm finding most challenging is the waiting in between results and diagnosis. It keeps making me think of that game 'grandmothers footsteps' where you creep up on someone and pause every time they turn round. I hadn't realised how many variables there were in a treatment path and I have no idea for timescales, impact on work and home life and long term health implications. I know everyone's journey will be different but I'm just happy to have found this group as I think it will help me find the answers when I learn what the questions are. X",
      "MessageIndex": 0,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81212/feel-like-someone-pressed-the-pause-button",
      "Title": "Feel like someone pressed the pause button!"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "I had a bad night last night so logged onto the site and then saw all your kind replies. Thank you so much. Just what I needed. From waking up in the middle of the night feeling alone to the reassurance that there are people out there like me, who are getting through it or have got through it and care enough to send words of support to someone who's 'new to the club'. Thank you. Cheered me right up. :-)",
      "MessageIndex": 7,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81212/feel-like-someone-pressed-the-pause-button",
      "Title": "Feel like someone pressed the pause button!"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "That made me laugh littlesusie. Odd things seem to happen on this journey and I have a sneaking suspicion this is to try to distract us from worrying about the 'big stuff'. Sometimes it works :-)",
      "MessageIndex": 8,
      "PostDate": "19/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82979/pre-op-advice",
      "Title": "Pre-op advice"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Hi Lucy. You've probably read it in your pre-surgery info sheet if you've got one but cotton pants for the surgery. I was advised by one of the Macmillan nurses as she said they sometimes forget to mention this in advance. I got the biggest pair of pants I could find as I had some random idea it would preserve my dignity. It probably just horrified the surgeon and as I can't remember a thing from being given the anaesthetic to waking up I'm not sure what difference it would have made :-) Good luck and hope all goes well on Tuesday. Xxx",
      "MessageIndex": 6,
      "PostDate": "19/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82979/pre-op-advice",
      "Title": "Pre-op advice"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Hi all. Had second WLE yesterday and woken up feeling a little low after another not great experience with NHS. So far... 1. Initial urgent referral for bloody discharge from right breast. Advised four week wait instead of two week standard. When asked why, advised it was possibly something to do with my age (I'm 39!). When pushed, they spoke to unit who advised they were a consultant down. Lucky enough to get private referral through work after cracking up week 3. Wait is now apparently nine weeks. 2. Waiting in NHS nuclear unit prior to private op. Arrived hour early for radioactive injection as had to travel significant distance via train. Checked in with reception, took seat directly in front of staff and settled in with magazine. Half an hour after due appointment time and still only person in waiting room, feeling very anxious. Went up to reception staff to see if appointment time was wrong. Advised they couldn't find me on system and had no record, despite having checked me in. Told to take a seat and I just sat and cried as late afternoon and WLE/SNB scheduled first thing next day. No one checked if I was ok and nurse finally came up without apology to say tannoy wasn't working and they'd been calling my husband and consultant to find out where I was. Managed to get injection before they closed up for the day. 3. Had second WLE yesterday privately due to local lack of consultants. 200 mile drive home (chauffeured by husband) and 30 miles from home suddenly realised blood was soaking through my clothes. Called hospital who advised me to go to a&e which was 10 mins away. Seen by initial screening nurse who abruptly told me if wasn't a problem for a&e and I should have seen gp or original hospital as a wound issue. Explained it was 200 miles away and was given booklet on a&e services and asked to read a leaflet explaining what NHS a&e did and didn't cover. Made to feel like complete time waster. Fortunately original hospital had rung through reception at a&e who had spoken to a doctor and this apparently changed the circumstances so was seen. All fine but scary and upsetting. I'm back on NHS for rads and hormone therapy but I'm just so worried as I seem to be jinxed. Could do with a few positive stories to cheer me up and reassure me - although might just make me feel more jinxed :-) Don't know if it makes a difference but I live in Scotland. My mum worked for the NHS for 30 years and I know it's a hard job and they put up with a lot and also do a lot of fabulous work under difficult circumstances. I'm just so frustrated that I keep seem to be running into the few that don't seem to either care or understand how hard this is and that we dont want to be a burden but don't understand the processes, systems and reasons that the system runs by. It's new and unchosen territory and I'd just love a little kindness and empathy.",
      "MessageIndex": 0,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81581/not-so-great-experiences-with-nhs---good-news-stories-please",
      "Title": "Not so great experiences with NHS - good news stories please!"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Thanks to everyone who dropped a note to reply. It's actually lovely to hear that it's not everyone's experience and quite reassuring as it does seem that what's been happening isn't the 'norm'. Just a perfect storm of miscommunication that's made it feel that way. It's only since I've started working through this thing that I've become aware of regional and geographical differences in treatments. Had no idea that NICE guidelines didn't apply in Scotland and we didn't have the equivalent of PALS. And glasgow is definitely the place to be seen if you're a member of our special club as the treatment I've had privately was through there due to delays in my local area and has just been excellent. It's only been them contact around this treatment that's been difficult to deal with. Glad to hear some good news and can only be onwards and upwards for here (she hopes) :-)",
      "MessageIndex": 6,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/81581/not-so-great-experiences-with-nhs---good-news-stories-please",
      "Title": "Not so great experiences with NHS - good news stories please!"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Trying not to worry too much but this morning I noticed a spot of blood on my bedcover at chest height. I'd first gone to my doctor back in June having noticed the same and was diagnosed with high grade dcis and grade 2 idc. Two WLE in August, nodes clear and HER2- so wasn't offered chemo, started tamoxifen in October and last session of radiotherapy is on Monday. I'll call my bcn on Tuesday as she works part time but is it really possible that this could be a recurrence so soon. Has anyone had anything similar?",
      "MessageIndex": 0,
      "PostDate": "30/11/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/86507/recurrence-before-end-of-treatment",
      "Title": "Recurrence before end of treatment?"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Hi. It's just over two weeks after my second local excision and I've noticed in the last few days some fresh blood on the steri strips. Not a lot and not soaking through. I removed the strips as the surgeon had advised I could do so this week and the wound looks a little wet - no sign of infection in terms of redness, soreness, other discharge etc. I've re-dressed with a waterproof dressing to keep it clean but wondered if this was common? Has anyone had this before and if so, was it any cause for concern? X",
      "MessageIndex": 0,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82279/tiny-bleed-from-wound-2-weeks-after-surgery",
      "Title": "Tiny bleed from wound 2 weeks after surgery"
    },
    {
      "AuthorID": "Willow74",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/willow74",
      "Content": "Thanks all for the replies. If it wasn't for the fact I have bc I'd say I was turning into a hypochondriac ;-) The bleeding settled and I managed to get hold of my bc nurse who said to keep an eye on it but not overly alarmed. No sign of infection so looks like it's just taking a little longer to heal. Take care. X",
      "MessageIndex": 4,
      "PostDate": "07/09/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/82279/tiny-bleed-from-wound-2-weeks-after-surgery",
      "Title": "Tiny bleed from wound 2 weeks after surgery"
    }
  ]
}