{
  "AuthorID": "Wondawoman",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wondawoman",
  "Posts": [
    {
      "AuthorID": "Wondawoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wondawoman",
      "Content": "Thanx Georgia I hope you get the right cream for you face. Also can't wait for the light nights my good friend from work is going to join me walking to get a little bit fitter for the race for life in may.  Hope your feeling well I'm about 75% well. How are you doing on your tamoxifen I will get mine next week when I see my oncolagist. Take care xxxx",
      "MessageIndex": 4,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/26547/need-help-with-weight-gain-and-rash",
      "Title": "Need help with weight gain and rash"
    },
    {
      "AuthorID": "Wondawoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wondawoman",
      "Content": "Hi everyone. I finished my 6 sessions of FEC chemo on 8th Feb 2010 (a date I will  never forget.) I now have a meeting with my oncologist on 31st March. While I was having the chemo my cheeks came out in a spotty rash and have tried cream from the doc, Aqueous but just doesn't seem to be disappearing.  Does any one have any tips on what to use please?  I have also put on 2 stone  rejoined WW through the free scheme with my doc, but just cant get my head right round it.  Again does any one have any tips on anything to help me with the weight loss. Other than that I feel 70% right still have my crappy sh**** days. Thanks LOL Lesley",
      "MessageIndex": 0,
      "PostDate": "23/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/26547/need-help-with-weight-gain-and-rash",
      "Title": "Need help with weight gain and rash"
    },
    {
      "AuthorID": "Wondawoman",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wondawoman",
      "Content": "Thanx Tess will go to docs about the cream, its really hard to look in the mirror and think god I look like aunt sally when you had such good skin.  Thank god for the light nites starting next week. I'm going to start walking with my good friend from work as I need to get a lot fitter for the walk for life in May. Can't wait to get of my butt cos its quite flabby now as I've sat on it since Sept last year. LOL Lesley xxx",
      "MessageIndex": 3,
      "PostDate": "24/03/2010",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/26547/need-help-with-weight-gain-and-rash",
      "Title": "Need help with weight gain and rash"
    }
  ]
}