{
  "AuthorID": "woodstock123",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
  "Posts": [
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Mollydog, thanks for your message.  i can completely understand that you wouldn't have been able to rest not knowing, and also best that there was no further lymph involvement of course.   I wish you all the best with your recovery.   Dawn x",
      "MessageIndex": 5,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65424/sentinel-node-biopsy---please-help",
      "Title": "SENTINEL NODE BIOPSY - PLEASE HELP"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Angela  thank you so much for your kind message.   i do feel a lot better now and have spoken to breast care nurse this morning, think the anaesthetic was making me decidedly grumpy yesterday.... all the very best to you dawn xxx",
      "MessageIndex": 7,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65424/sentinel-node-biopsy---please-help",
      "Title": "SENTINEL NODE BIOPSY - PLEASE HELP"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi George and Jackie, thanks for all of that, i feel much better today and have spoken to nurse this morning.   do you by any chance know if it is ok that my breast is still numb above where they took the lump, they did the op on tuesday and it is thursday now.  i know they give a local as well as a general but it seems a long time to still be numb. thanks Dawn x",
      "MessageIndex": 6,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65424/sentinel-node-biopsy---please-help",
      "Title": "SENTINEL NODE BIOPSY - PLEASE HELP"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi there I had a WLE yesterday and lymph node biopsy. i had the blue dye.   when i asked the surgeon after the operation about how many lymph nodes he had taken,he said just one, the one that turned blue.  Does this mean that this is the only node that my lymph drains into.  am just worried because if he took that one then i might get lymphodema or does it just mean that the others just never turned.  also why didn't he take a couple, because if this one is positive i will have to go back for more. I am grade 1, 8mm so very small lump and they did think it unlikely before up that it would be in lymph nodes.    sorry to sound pathetic!! dawn xx",
      "MessageIndex": 0,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65424/sentinel-node-biopsy---please-help",
      "Title": "SENTINEL NODE BIOPSY - PLEASE HELP"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "hi there mistymoley it was the anaesthetic making me pathetic!!  i feel better today.... i think it is you that did the tattoo programme which i am about to watch. well done for that. kind regards dawn xxx",
      "MessageIndex": 8,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65424/sentinel-node-biopsy---please-help",
      "Title": "SENTINEL NODE BIOPSY - PLEASE HELP"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "My surgeon told me yesterday that if i have a bilateral mx i need to have two operations as doing both at the same time is a long operation and they prefer to do two shorter ones, giving the body time to recover before doing the second breast.   he said it cuts risk of longer anaesthetic and clots etc.   i am sure i had a long op with my hysterectomy last year.   i haven't seen anyone on here mention having it done as two ops rather than just the one.   xx",
      "MessageIndex": 0,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66002/bilateral-mx---they-want-to-do-two-operations-instead-of-one",
      "Title": "BILATERAL MX - THEY WANT TO DO TWO OPERATIONS INSTEAD OF ONE"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "HI Emma Yes it is the seroma, it will flatten out or i will get it drained if it doesn't.   All the best with your surgery and thank you for your lovely words.   i lurk around here all the time so if i can help in any way let me know Dawn xx",
      "MessageIndex": 2,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Emma Sorry I didn't come back to you on the pain issue, i went to my dad's for the weekend.  There was no pain really at all.  my whole chest area felt very numb as i guess they give you a whole host of painkillers during the operation.    I was up and about and left hospital the day after op (and the op had been late in the day).  the drains are a bit of a nuisance but again nothing to worry about.   i only took paracetomol and really hardly at all.   maybe for the first day or so.   i did have a weird phantom nipple feeling which was odd but that has gone.   I have most of the feeling back now in my chest, it seems to get better by the day, i had a tight chord feeling from my bottom rib to my armpit but that has gone too (have done lots of stretching and moving around).  I went through a few days of having a horrible burning sensation on my chest but now i am thinking maybe i used the Bio Oil too soon as it does contain some perfume.  Really, don't worry about pain - i think on the whole the mastectomy is not usually painful and if you do have any pain, they are quick to sort it out. Dawn xx http://newdawncancercare.blogspot.co.uk/",
      "MessageIndex": 12,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Thanks Kat for reading my blog, i hope it helped in some way.    Also, I am thinking of you for Friday and hope that all goes well.   Whatever the result, we are all here for you. Best Dawn xx",
      "MessageIndex": 17,
      "PostDate": "15/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi there I had my bilateral mastectomy a month ago.  I have been writing a blog to help with my emotional side and also to chart my progress and hopefully help others who are doing the same thing, I also like to read other people's blogs so if any of you have them I would love to hear your journey.    I had my bilateral mastectomy on the 3 December 2013.   I attach here my blog if anyone would like to see photos.  It may help.  I am pretty much on the mend, a small seroma left and a bit of tightness but not too bad.   All the best to all of you Dawn xx http://newdawncancercare.blogspot.co.uk/",
      "MessageIndex": 0,
      "PostDate": "10/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Berry Sorry I didn't respond to your post sooner - I went away to my dad's place and had to collect some of mum's things, even though it has been nearly a year now since she died.   I did take a lot of stuff before but I had to collect the final things as he has now moved to a warden assisted place.   God it's so hard isn't it to lose your mum.    Good that you have Peggy, it makes all the difference to have someone to sail these rough seas with and try and find a laugh and something positive in it.  we use the expression \"cancer is a gift\" a lot - kind of as a joke but in a way it has given me things I didn't have - like knowing that I can cope when I thought I couldn't or wouldn't be able to.  Mum's cancer was so horrific (stomach/secondary liver - very advanced when diagnosed).  I always thought I would fall apart if my mum or dad died but you don't but it is a hard road to travel and it grows you up really fast. Walking by the sea sounds fabulous - much as i love living in Oxfordshire I miss the sea a lot.   I grew up in South Africa, always by the coast.  Have been here half my life now though and loving it.    Lived in Brighton for a bit and loved the sea. Am going to Bahamas hopefully in the next couple of weeks (my brother lives there) and am planning on doing some yoga whilst there - there is a yoga centre on the beach there.   Did you have reconstruction?    Wishing you all the best with the chemo. Dawn xxx http://newdawncancercare.blogspot.co.uk/",
      "MessageIndex": 14,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "I can understand your frustration Russ, the fact that men DO suffer from breast cancer should be flagged up as much as possible.   d",
      "MessageIndex": 1,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/66572/breast-cancer-campaign---got-everso-slightly-annoyed-with-this-article",
      "Title": "\"Breast Cancer Campaign\" - got everso slightly annoyed with this article..."
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Canton04,  Glad to hear things are going well.   i thought my seromas were quite round, they looked like mini breasts which was quite nice but now one has gone and i am a little concave but hey, nothing to really complain about.   My arm stayed tight till quite recently but now it really has eased off, i can sleep on both sides and on my belly which I definitely couldn't do until about a week ago.   There were two sites on the bottom of my ribs that hurt a bit (don't know why) which are now fine as well. i think they steri strips are supposed to stay in place until they fall off but i took mine off because i am convinced i am allergic to them.   but they were pretty much ready to come off anyway. really good that your hubby has agreed to go with you to the appointment, it's always better if Terri is with me although she can't always be as has to work.   Enjoy London!!!    I love London but couldn't live there anymore - too much of a country mouse these days!. We live in a little village outside oxford.  Am very glad I don't live in France anymore - my french would never have coped!!!  I remember when we lived there and I fell off a ladder whilst holding a crowbar which i then hit myself in the head with.   I tried to explain it to the A&E people but i only used the word for hammer, they were a bit confused, think they thought Terri had hit me over the head with the hammer.  Dawn xxx http://newdawncancercare.blogspot.co.uk/",
      "MessageIndex": 13,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69927/one-month-later---mastectomy-photos-if-anyone-would-like-to-see",
      "Title": "One Month Later - Mastectomy photos if anyone would like to see"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi there I don't smoke but i used to years ago so can totally relate to the ritual thing.  but i have found with giving up caffeine that it's the same.  i used to love the whole ritual of sitting down to my double espresso in my favourite little cup and choosing my particular blend of coffee, probably enjoyed all that more than the coffee which in truth made me feel a little sick.   so now i do the same thing but with tea, i found a nice teacup and a teapot and search the internet for interesting green teas (just discovered macha which is extremely potent I believe - waiting for it to arrive).  I wonder whether there is a ritual you can replace the rolling of cigarettes with?    dawn x",
      "MessageIndex": 5,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65089/stopping-smoking",
      "Title": "stopping smoking!"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "the doctor at our local surgery thought it was nothing just \"lumpy breasts\" but said she would send me for mammogram just to be sure.   I went for mammogram and ultrasound, saw the surgeon again that day after he looked at the results which showed something and he said he was sure it was \"benign, benign, benign\"(whilst banging his fist on the desk) but sent me for core biopsy just to be sure.  I went away to France for a couple of weeks holiday.  On return I got a phone call to go back to  hospital.   \"not such good news, it's cancer\" says he.   he seemed genuinely surprised.  So it was a shock and I would have preferred him to not be so enthusiastic about his diagnosis in the beginning.  I didn't use him as my surgeon after that.  i guess my experience is not the norm thank God and am pleased to hear that everyone else had a better experience.  i ended up having a lumpectomy without clear margins followed by a bilateral mastectomy.   my new surgeon did say after the lumpectomy where they found more cancer that mammograms don't work very well on me nor ultrasounds as they found more cancer as well with the mastectomies.  if i had just had the lumpectomy and it had been successful i would have had to have MRIs in future.",
      "MessageIndex": 14,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69806/do-docs-play-down-cancer-until-they-get-biopsy-results-or-can-they-tell-just-from-the-scans",
      "Title": "Do docs play down cancer until they get biopsy results or can they..."
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "i also thought it was only secondary cancer if it spread beyond the lymph glands to lungs/bones/brain etc. my mum had secondary stomach cancer in her liver.",
      "MessageIndex": 11,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67089/120mm-tumour",
      "Title": "120mm tumour"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "i also thought it was only secondary cancer if it spread beyond the lymph glands to lungs/bones/brain etc. my mum had secondary stomach cancer in her liver.",
      "MessageIndex": 26,
      "PostDate": "14/11/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/67089/120mm-tumour",
      "Title": "120mm tumour"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Jeanfriend I tried to look at your blog but cannot, can you put the full URL here if possible. i also did a blog to help me remember what was happening and hopefully help others in some way if they need to see photos etc.    take a look if you like. Kim,  I had my bilateral mastectomy the same day you got diagnosed, and then christmas was upon us and new year and now everyone is back and work and i am feeling \"what the hell just happened\".     I hope you feel better soon.  Dawn http://newdawncancercare.blogspot.co.uk/",
      "MessageIndex": 13,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69538/feeling-bewildered",
      "Title": "Feeling bewildered"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Really good news, you must be so relieved, seize the day!!!. Dawn xx",
      "MessageIndex": 2,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69530/fantastic-news-and-thank-you",
      "Title": "Fantastic News and thank you"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "I also know that feeling of wanting to spend more time with my boobs!   the days before my double mastectomy they started to look better than they had in ages (like just before you get a haircut and it starts to look pretty good).   I felt sad in the shower. i am fine now about them both going but I do miss my nipples more than the breasts themselves.  funny that, i didn't expect that at all.    Such a bloody learning curve this whole journey.... before my op the surgeon asked me if i was happy for the remaining tissue (after pathology) to be used for research, that somehow made me feel better about it all.   Dawn xx http://newdawncancercare.blogspot.co.uk/",
      "MessageIndex": 3,
      "PostDate": "16/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68498/upcoming-mastectomy-op-on-18th",
      "Title": "Upcoming mastectomy op on 18th"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "I get this as well after my bilateral mastectomy, it's not unpleasant, just weird for me.   i think it is because all the nerves have been cut and we are just more sensitive to everything.  i feel very tender on my chest area at the moment (2 weeks post op).   when i walk around i feel like i have sunburn on my chest where my clothes move up against my chest.  i may try and find something silky  Dawn x",
      "MessageIndex": 8,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68683/weird-sensations-after-mastectomy",
      "Title": "Weird sensations after mastectomy!"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Cathy, thanks for the info.  i have found the trial and will have a good look at it.  I have cut out most carbs anyway apart from veges.  don't have anything processed, usually a big green juice/flax oil etc morning and then salad and fish or something similar lunch and dinner.    it would feel good to be part of some research.  what is your take on coffee>?  I gave it up when i got diagnosed but just read that it is supposed to double the effect of tamoxifen which i think is what they will put me on.   All the best for the last chemo session, must be a relief to get that over with.    Dawn x",
      "MessageIndex": 15,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64971/fasting-and-chemo",
      "Title": "Fasting and chemo"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Cathy that is all very interesting, i was doing the Paleo Diet before being diagnosed.   I wonder if this would help keeping carbs down for radiotherapy and surgery as well. doy you know where i can find out about these trials and join?   I am due to have surgery 1 Oct and start rads 6 weeks later. Thanks  Dawnxx",
      "MessageIndex": 13,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64971/fasting-and-chemo",
      "Title": "Fasting and chemo"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Kat, Thinking of you, whatever the result there are people on this site here for you, we have all been in your position so know exactly how you feel.    I know you said there was a backlog so you are more worried now but it's probably better to  know sooner whatever the results may be.  the waiting is the hard part and the treatment (if necessary) these days is absolutely brilliant.    Take someone with you if you can, good to have another pair of ears and a hand to hold. Dawn x",
      "MessageIndex": 3,
      "PostDate": "13/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70071/hospital-called-doctor-wants-to-see-me-scared",
      "Title": "hospital called doctor wants to see me. scared"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Way to go!   good to hear. x",
      "MessageIndex": 2,
      "PostDate": "25/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/65160/one-year-on--after-bc",
      "Title": "One year on- after BC"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "hi Cathy great that you are home,  the drains are  bit annoying, i kept forgetting the to take the drains in the bags when i got up and was sorely reminded.   once they are out it is much better.   a tip for you, when they take them out give a big cough.  it seems to help, my breast nurse told me that when you cough you can't tense like when  you are holding your breath and she always advises people to do that and out they come.   i did it with both mine and it was easy,    get some rest now! and take care Dawn xx",
      "MessageIndex": 2,
      "PostDate": "21/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68725/home-today",
      "Title": "Home today !"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "hi Caroline sorry I am catching up on things a bit late.   I just wanted to say that your hair looks fantastic!    Dawn xx",
      "MessageIndex": 10,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/70564/wig-photo-attempt",
      "Title": "Wig Photo (attempt)"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Dorothee, thank you for your response.  It is a lot to think about and I do think that mum's death is effecting me hugely still.    I had a hysterectomy last November which I recovered well from and I suppose I always think i can heal well from surgery but not so sure about how i will cope with radio and drugs, also worried about my lungs - if there is any effect on them from radio as i am asthmatic.   and also the tiredness worries me when i need to find new job etc.   it is a lot to think about and thank you for all your comments, it is so helpful.   Wishing you all the best Dawnx",
      "MessageIndex": 4,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64684/lumptectomy-vs-bilateral-mastectomy-help-me-please",
      "Title": "Lumptectomy vs Bilateral Mastectomy HELP ME PLEASE!"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Elaine, thank you for coming back to me, it really helps to get other people's opinions.  I have another appointment on Monday to talk to surgeon about the two possibilities, my feeling is that they are going to try and persuade me to do the lumpectomy.     Dawnx",
      "MessageIndex": 3,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64684/lumptectomy-vs-bilateral-mastectomy-help-me-please",
      "Title": "Lumptectomy vs Bilateral Mastectomy HELP ME PLEASE!"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "I wonder if anyone can help me on here. I was diagnosed a week ago with Grade 1, they are recommending lumpectomy with radio.   I am thinking i might want a bilateral mastectomy, they think it is excessive as the tumour is very small.  My reason for thinking i want a MX  rather than lumpectomy is i want to avoid radio if possible and hormone treatment,  i have just been made redundant so the sooner i can get back to being able to get a job the better. also I think i have more concerns about possible side effects of radio and pills.   Also would worry that it would come back even though i know in my head the statistics are more or less the same for both ops.   the nurse has already told me they may not be keen to do bilateal MX as they don't like to remove healthy breasts. also my precious mum died recently from stomach cancer and i just want to get it over and done with really quickly and not have to think about future hospital visits. i would want a bilateral - has anyone gone for this option when they didn't need to?   thank you thank you, really appreciate any views.   Dawnxxxx",
      "MessageIndex": 0,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/64684/lumptectomy-vs-bilateral-mastectomy-help-me-please",
      "Title": "Lumptectomy vs Bilateral Mastectomy HELP ME PLEASE!"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi Kate I have accepted your friend request.  I had my double last week on Tuesday with  no reconstruction either. I didn't want reconstruction. This is the blog I wrote which shows pictures so maybe good for you to take a look.    http://newdawncancercare.blogspot.co.uk/ Ask me anything you like, I will help as much as I can.    I feel totally normal now - didn't have much pain, a few painkillers here and there.   i haven't started driving yet as i think for insurance purposes you have to wait a couple of weeks.  Chat soon Dawn xx",
      "MessageIndex": 5,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68308/mastectomy-on-20th-december",
      "Title": "mastectomy on 20th December"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hi C Everyone is different and I can only speak for myself.  I think today the way I feel, I could definitely do a train journey and I am one week post bilateral as you know.   But I wouldn't do it.  Infections can start at any time and seromas can worsen (I have two seromas which at the moment are quite small).   After my Lumpectomy in October I got an infection and I quickly went to the night surgery and got antibiotics and was glad I was at home.   Is it something super special?   Is it for Christmas?  You need to weigh it all up, if anything went wrong, could you get back quickly?    Definitely no luggage as the other poster said.   I want to go away in January, have decided probably a train journey to Paris but I will see how I feel closer to the time.  If I am not confident I would rather hire a cottage in UK.    Am I right in thinking you are in France?  Have you asked the breast care nurse? Dawn x",
      "MessageIndex": 9,
      "PostDate": "12/12/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/68308/mastectomy-on-20th-december",
      "Title": "mastectomy on 20th December"
    },
    {
      "AuthorID": "woodstock123",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodstock123",
      "Content": "Hello all I want to go to the Bahamas to do a yoga retreat and was wondering if anyone had had any difficulty with travel insurance or who did they use.   I had a bilateral mastectomy in December and am on no medication. I didn't need chemo or rads so just the surgery. Do I have to say I had cancer?  When I looked up quotes they ask for medical conditions that you are taking medication for. I would appreciate any advice anyone has. Many thanks Dawn http://newdawncancercare.blogspot.co.uk",
      "MessageIndex": 0,
      "PostDate": "08/01/2014",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/69753/travel-insurance---any-advice",
      "Title": "Travel Insurance - any advice"
    }
  ]
}