{
  "AuthorID": "woodsetts",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodsetts",
  "Posts": [
    {
      "AuthorID": "woodsetts",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodsetts",
      "Content": "Yes I had lymph nodes removed aswell as lumpectomy but fortunately they were clear. I had a scan at planning meeting a week before treatment began, they mark you up and do 3 tiny tatoos ready for treatment, that was probably worse part as had to lay with arms up for about 30 minutes and arm was still sore from lymph node removal but it really isn't anything to worry about. Each seesion takes around 10 minutes, 2 blasts of around 30 seconds from 2 angles. Totally painless and the radiographers told me that they are so accurate these days that they can blast just the area that they need to, think the heart/lung worry is something from the past. I got quite tired by 3rd week but nothing too bad. Just got tamoxifen for next 5 years now, been very lucky. Hope everything goes ok for your mum xx",
      "MessageIndex": 6,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54628/lumpectomy-and-radiation-or-mastectomy",
      "Title": "Lumpectomy and radiation or mastectomy?"
    },
    {
      "AuthorID": "woodsetts",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/woodsetts",
      "Content": "You need to discuss your fears with your breast nurse, they will give you all the facts and then really just trust their judgement. I had just finished 3 weeks of RT on my left breast after a lumpectomy and found it much better then I had expected. I used diprobase cream twice daily from a week before I started and am still using it now. My skin went a little pink but otherwise was fine. The radiographers were brilliant and put me at ease, we even had an evening looking around the department before treatment began where family members were encouraged to come. My young son was worried before this but he found it helpful and I am sure you would benefit from this if possible.Good luck xx",
      "MessageIndex": 2,
      "PostDate": "28/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54628/lumpectomy-and-radiation-or-mastectomy",
      "Title": "Lumpectomy and radiation or mastectomy?"
    }
  ]
}