{
  "AuthorID": "Wooki",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wooki",
  "Posts": [{
    "AuthorID": "Wooki",
    "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wooki",
    "Content": "Hi I used the cold cap for 4 rounds of TC very successfully and only lost about 15-20% of my hair. My cousin -who was also going the chemo at same time - also used it successfully - she had 6 rounds of carboplat and docetaxel - she lost more hair than me but it thinned all over her head and but again wasn’t that noticeable unless you know her well! Loads of tips to ensure that you give yourself the best chance of it working - have a look at the web site - cancerhaircare.com -  which has a good guide plus check list to help you decide if it is for you. Key - make sure you have a good fit, make sure head is wet enough, use ph balanced or organism shapoos and conditioners, avoid stress on hair, minimise washing to once or twice a week,  was 24 hours before and don’t was again until 24 hours after leaving in conditioner for this time, no heat or chemical treatments, consider starting with a shorter style to help minimise stress, make sure it is on your head for the correct time.... not used often in the unit I went to and the nurses seemed ensure about operation! To avoid pain and discomfort take paracetamol before and ensure you are distracted for first 15 mins. Drink a hot drink. Lots of guides and case studies on the Paxman site and if you google you’ll also find various blogs. It does add quite a lot of time to chemo session - must be on your head for 30 mins before infusion starts, although this can include the saline flush, on your head for infusion and up to 90 mins after infusion finished - depending on which chemo drugs you are on. I found it a bit stressful when I had a period when it was strat8ng to shed quite a lot and This can be a bit stressful - but glad I stuck with it as it passed for me and the hair loss reduced. I’m 4.5 weeks out of chemo and just had a week when I have lost slightly more than normal shedding - but seems to have slowed down again and delighted that I still have a full head of hair! Good luck whatever you decide to do!",
    "MessageIndex": 5,
    "PostDate": "14/02/2018",
    "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/150017/chemotherapy-and-cold-caps",
    "Title": "Chemotherapy and cold caps"
  }]
}