{
  "AuthorID": "Worried Hubby",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/worried-hubby",
  "Posts": [
    {
      "AuthorID": "Worried Hubby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/worried-hubby",
      "Content": "Dear everyone, Thanks so much for your kind messages. They really have already made us feel better, though I can certainly empathise with crying husbands. The waiting game is incredibly difficult and I'm trying to engender a state of denial until next Tuesday. It's reassuring that multiple lumps don't necessarily mean it's spread. My main concern is her age and the fact that I don't think we've caught this as early as we might have done; she's always been lumpy, got tested a couple of years ago and was told it was just blocked ducts, and so didn't think anything of it. She only went to the doc because I got the heebie jeebies recently. Anyway, what's done is done and we move on from here. Thanks again, and I've no doubt I'll be full of more questions soon, and maybe pleas for husbands' e-mail addresses! Tootle pip, Kai",
      "MessageIndex": 5,
      "PostDate": "13/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42395/wife-diagnosed-today-have-questions",
      "Title": "Wife diagnosed today, have questions"
    },
    {
      "AuthorID": "Worried Hubby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/worried-hubby",
      "Content": "Thanks to Sarah and Jules for their kind replies. We were thrown into a tailspin a couple of days after diagnosis when my wife also found a lump in her throat. I think it's really unlikely to be a problem, and is probably caused by stress, but it still ramped up the worry. Waiting is so, so hard. We're both moving between outright denial, an assumption that of course everything is alright, she's young, we have a 10 month old baby and if there's any justice in the world it'll all be lovely, and catastrophisation.  My wife is tending more to the catastrophisation, and I can't imagine what's she's going through. She's trying to hold it together, but I can tell. We've been together for 15 years and I only have to look into her eyes. It's all a bit complicated by the fact that I have M.E. and am incapable of looking after our boy by myself for any length of time. Complicated both in terms of what happens during treatment (though with friends and family we'll cope), and in terms of what would happen if the worst came to the worst. I'm rambling towards misery now, so I'll shut up. But please keep fingers, toes and all the rest crossed for us. Kai",
      "MessageIndex": 8,
      "PostDate": "18/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42395/wife-diagnosed-today-have-questions",
      "Title": "Wife diagnosed today, have questions"
    },
    {
      "AuthorID": "Worried Hubby",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/worried-hubby",
      "Content": "Hi everyone, My 34 year old wife was diagnosed with breast cancer today. We have no idea how advanced it is and are waiting for biopsy test results that we should get next week. She has 4 or 5 lumps which total 4cm. I have a couple of questions related to the ... technical aspects, I suppose, and then one related to the emotional aspect. 1) Is it usual that cancer is diagnosed before biopsy test results have been received? Does this in any way indicate that the cancer is advanced, or is it for some other reason the diagnosis was possible? 2) Does the presence of 4 or 5 lumps indicate that the cancer has started spreading, or are multiple lumps not unusual? 3) From women who have suffered themselves, what support can I best give her? This may seem a broad and possibly stupid question, but is there anything in particular that I can do/say, both pre and post biopsy results? Thanks very much in advance Kai  ",
      "MessageIndex": 0,
      "PostDate": "12/09/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/42395/wife-diagnosed-today-have-questions",
      "Title": "Wife diagnosed today, have questions"
    }
  ]
}