{
  "AuthorID": "wrightnow",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wrightnow",
  "Posts": [
    {
      "AuthorID": "wrightnow",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wrightnow",
      "Content": "Hi Mandy I know you wrote this a month ago, but to be honest having just started treatment 6 weeks ago i didn't feel particularly qualified to give my opinion. I've been on Tamoxifen for 6 weeks to shrink the tumour prior to surgery and am about to start Herceptin. So far I think I've been lucky with the effects of it, apart from mild sweats and flushes particularly at night that and not having had a decent nights sleep since treatment began. The worst I've had has been persistent but mild cramp in both hands and feet. It's annoying rather than debilitating. My point is I mentioned it to Dr Crippen (Not his real name obviously!) and he said to try tonic water, which can help with flushes and cramps. I don't know why that should be so, but that's what he says. I haven't tried it myself and I don't know if the tonic would be better with Gin. Anyway good luck with it. Keep smiling Kathyxx",
      "MessageIndex": 19,
      "PostDate": "30/07/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/39075/zoladex-tamoxifen",
      "Title": "Zoladex & Tamoxifen"
    },
    {
      "AuthorID": "wrightnow",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wrightnow",
      "Content": "Hello again A couple of weeks ago I wrote about the problems I was experiencing with my medical team, for which I had some interesting replies. Things were rapidly going very pear shaped and there was absolutely no communication coming from them and I was just getting more and more frustrated. Well rather than rant and rave, which was making me seem mentally unbalanced (OK so I probably am a bit!) I wrote a lengthy but polite letter to Dr Crippen (my oncologist). In the letter I outlined, how I felt, how I felt that they were treating me and the effect that was having. If I say so myself it was a very good letter, with no swearing or accusing, but with reasoned and rational demands to be included and treated like an adult.  The result of the letter was a lengthy phone call from Dr Crippen, during which he actually talked to me like I was a grownup with better than average comprehension and communication skills. The acid test was always going to be a face to face meeting, well that was yesterday and it went really well. He treated me like a grown up explained what was going on and the options he had in mind. He is pleased that the Tamoxifen seems to be working and is now keen to introduce Herceptin into the mix. So to those of you who expressed the opinion I should just take what ever they were throwing at me, because \"doctors know best\" I would say this, If that works for you good luck with it. It was never something that would sit well with me. Writing a letter focused my thoughts and if I say so myself I've always been eloquent with an ink pen in my hand! It is also far easier to write it than say it. I now feel that I can work with them. Now I just need to persuade the breast cancer nurse that holding my hand is an absolute no-no, to say nothing of being completely creepy. Bless her she is very tactile and I'm not, hand holding and hugging is so not allowed. Still small steps she'll learn! Good luck to all, whatever stage you're at, do what works for you and if you are inclined stick to your guns. Kathyxx",
      "MessageIndex": 0,
      "PostDate": "05/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41174/getting-them-to-listen",
      "Title": "Getting them to listen"
    },
    {
      "AuthorID": "wrightnow",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wrightnow",
      "Content": "Hi Lifelover Read your latest, my response to that is don't give up fighting, keep pestering you are entitled to be told what's going on. I can't see a problem with looking things up on the internet, it is often the only way to find anything out. I will agree that one needs to remember that everyones experience will be different. But the info is there for a reason and personally I like to know what is going on and exactly what effect these drugs are actually going to have. being told drugs might make me a bit sick or a bit fact or a bit bald, I don't find terrible helpful and besides I'm far more concerned with the more serious side effects such as osteoporosis, liver damage, nerve damage, heart disease and cancers of just about everywhere else, which many of these drugs can cause. I think this post has touched a bit of a nerve and I don't think I'm alone in feeling ignored. Another thing I find is their total lack of urgency, from diagnosis to starting treatment has taken 3 weeks, I don't know whether they think there is no point rushing or if they really are totally blase, everything is \"Come back next week for that\" and \" I'll see you in 6 weeks\". I've been very fortunate in my life and this is the first time I've had any serious involvement with the medical profession and I have to say I'm not even slightly impressed, Oh I'm sure that they are all highly skilled and incredibly capable, but they really give the impression that they don't give a S***T. Me I'd like to get treated and get done, but now they've got me I'm beginning to think that this nightmare will never end, because medicos have a basic inability to pull their finger out and get on with it. I'm sure I'm not alone in feeling that, but perhaps other people have got more patience than me! Personally I'll just keep on arguing and fighting, it gives me focus and keeps them on their toes.   Kathyxx",
      "MessageIndex": 4,
      "PostDate": "07/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41174/getting-them-to-listen",
      "Title": "Getting them to listen"
    },
    {
      "AuthorID": "wrightnow",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wrightnow",
      "Content": "Hi Oldhat, God what a truly awful time you are having. Idon't think I'm that tough I just won't be pushed round. Doctors and medicos are no different to the rest of us, they still have to sit down to do a poo! I've just come back from the latest consultation, my oncologist wanted another biopsy, which of course he can't do himself so I then have to queue up in another clinic for the butchery department. After the usual lengthy wait I was ushered into a treatment room and in trooped, the Butcher, the BC nurse and a student. No-one bothered to introduce the student as they just assumed it was ok for her to be there. They were quickly disabused of that notion and she left the room with surprising alacrity!  I then pointed out to the Butcher that I was actually in the room and the choice to have a student or anyone else in the room was MY CHOICE and not his. I've then had a long conversation with the BC Nurse, do they actually know anything or is it more about generous helping of Therethere cream. She assures me that the medical team actually like patients to ask lots of questions and to be activively  involved in their treatment. While I wouldn't dream of telling anyone else what to do, and being a bolshy, stroppy moo doesn't sit well with everyone. We are entitled to know what's going on and if you don't demand, they actually won't tell you anything. Good luck with it all! Being demanding and stroppy is actually quite cathartic and they are used to it (according to the BC nurse) Kathyx      ",
      "MessageIndex": 9,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41174/getting-them-to-listen",
      "Title": "Getting them to listen"
    },
    {
      "AuthorID": "wrightnow",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wrightnow",
      "Content": "Hi read that one and it made me so angry, I'm sure that they must be aware how upsetting and confusing all of this is. Isn't doesn't take much for them to allay fears, and it does actually help if they actually give us a little of their time. My oncologist says any problems, give him a call, however I imagine if I try that I'll get Pitbull, the secretary. If I were you Blue70 I'd be making a nuisance of myself, I'd be on the phone demanding to see him and if all else failed I'd resort to another letter (evidence for the GMC) don't you know. You go girl and keep fighting and arguing and demanding! Kathyxx",
      "MessageIndex": 7,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/41174/getting-them-to-listen",
      "Title": "Getting them to listen"
    }
  ]
}