{
  "AuthorID": "Wynneth",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
  "Posts": [
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": " Hi everyone I had a mastectomy four weeks ago, have developed a Seroma which is very swollen and tender from back, underarm and above wound around front to breastbone.  It's been drained twice, first time the nurse struggled a little to get the fluid out to start with, then it just kept flowing and flowing, so much so that she attached a drain bag.  She drained around 750mls of horrid looking dark brown fluid.  Surgeon said to drain again in ten days when I saw him after my mastectomy.  He also gave me the bad news that two out of three lymph nodes removed were positive and I'm to have axillarly clearance on 31 October.   Second time it was drained last Thursday) the nurse had a lot of problems getting much fluid out despite being very swollen, she called a colleague to help and between them them pummeled and massaged me and removed around 250mls, plus a layer of 'yukky' grey stuff floating on the top. Before the first nurse started the draining, when I showed her that the skin over the area of my wound was very red, tender to touch and felt really hot.  She called a doctor in to see it, she drew a pen line around the edge of the red area and told me to seek urgent medical care if the red spread past the line.  She prescribed antibiotics and said they'd send a sample of the fluid to the lab and when results came back they'd know if it was the right antibiotic or if I needed another type.   Since Thursday the Seroma has swelled again, its all hard and tender to touch in some parts.  All the red area is still the same, no improvement despite taking the antibiotics fir four days.  Plus I feel pretty rough in myself, totally exhausted and still in so much pain I'm still taking paracetamol and codeine every four hours to try and control the pain. I called the BC nurses this morning, my lab results weren't yet back, she told me to just keep taking all the meds and come to thus Thursday's drop in clinic and they'll check it. Has anyone else experienced this ?  I've quite worried about the redness, the swelling of the Seroma is very uncomfortable.  Just wondered if others had experienced anything like this and whether I should try to get further help or not. Hugs to all Wynneth X",
      "MessageIndex": 0,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/140252/post-mastectomy-seroma-and-very-red-and-hot-skin-above-wound",
      "Title": "Post mastectomy Seroma and very red and hot skin above wound"
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi all.  Just had an appoint with yet another consolutant (third) - apparently they are short of staff !   I was diagnosed with invasive lobular carcinoma in June after biopsies (1st consultant).  MRI following the diagnosis showed it had spread more than ultrasound showed and was told (2nd consultant) that the lumpectomy planned couldn't go ahead as I now needed a mastectomy and there was something in my other breast.  I had a holiday booked starting a few days after seeing him, and he advised me to go ahead and have a nice family time to rest and prepare for surgery.    Today's appointment (3rd consultant and different breast care nurse) after he had read my notes, offered me the choice of having chemo first, which may shrink the main tumour, although the MRI showed another nodule nearby so even if it shrank, I'd still need a mastectomy. Question to everyone, what would you do ?  I've opted for surgery first then chemo.  Anyone think I've made the wrong decision.  I'd love some help and advice on this  Hugs Wynneth ",
      "MessageIndex": 0,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Thanks for your reply Gay, I really appreciate it.  I feel the same, since I was to,d it was cancer I couldn't wait to have this evil thing cut out of my body.  Still feel the same although willing to listen to advice.  The consultant told me it makes no difference to out come if chemo first or surgery first in my case as , even if chemo shrunk the main tumour, there was still the separate nodule so whole breast would need to go.   Lobular is certainly very sneaky, horrid thing, don't want it inside me for a day longer than I have to.  I feel really well at the moment and strong and ready for surgery, I feel the chemo cou,d make me weaker and less ready to recover from the surgery.  I decided on surgery first and so far haven't changed my mind, although he told me I could. Thanks again for your help. Hugs Wynneth",
      "MessageIndex": 3,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi Batfinkcaz  Thanks so much for your response, it's interesting to hear of your experience.  I don't think I want reconstruction and can understand that chemo first would make sense in your case.   Me too, just want it gone asap.  I was considering the options but when he said that even if the chemo shrunk (or 'melted') the tumour, the separate nodule would mean a mastectomy anyway.  So I'm thinking have surgery first as I'm feeling well at moment, then chemo after. Hope your reconstruction recovery goes really well. Hugs Wynneth X",
      "MessageIndex": 4,
      "PostDate": "16/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi Karen I've been researching reconstructions and have decided I don't want to go through that either.  I've done a lot of online research of procedures, looked at lots of post op photographs of reconstructions and those who have chosen to go flat and just heal from the surgery.  Very brave ladies who have shared their pictures and experiences have given me the opportunity to know more about how I may look afterwards.  I was very shocked when looking at the first few pix, but I have continued to look to desensitise and help me come to terms with how my post op body will look.  I know everyone is different and their outcome will be different, but at least I feel more prepared. I understand how difficult you must find it occasionally when reality hits you all over again, I've had to come to terms with a very disfiguring scar after having my gallbladder removed a few years ago, but know a mastectomy is a whole different 'ball game'.   I gave the surgeon my decision yesterday and so far don't feel I want to change my mind, It still feels the right choice for me to have surgery first.  All the responses on here have helped me and I'm so very grateful to everyone for their advice. Hugs Wynneth X",
      "MessageIndex": 12,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi Kacang Thank you so. Much for your response.  It certainly feels like a scary rollercoaster ride that I never even wanted to be on ! The consultants i saw previously never once mentioned the option of chemo first, both talked of surgery followed by chemo and/radiotherapy, so i was confused and unsure when he spoke of the option to have chemo first when I saw him yesterday.   I know every doctor has their own methods and preferences but during the conversation with him I felt he started off very much in favour of chemo first but then suggested in my case surgery first might be better !  Plus, from the outset he said the final outcome would be no different whichever way the treatment started.   When we are vulnerable and in need of help, we turn to the 'experts' to give us the best advice in light of their experience and not to be expected to make the decision on which treatment plan is best to have ourselves.   I don't have a date for surgery yet as the papilloma in my other breast has to be removed by a process similar to the needle biopsies guided by ultrasound which I've already had on both breasts, but using a larger needle and vacuum suction.  The lab results of the biopsies done on my other breast were clear of cancer, but they need to remove and test the papilloma so will do the removal procedure and tissue tests before the mastectomy is scheduled.  So I'm guessing I'll have at least five to six more weeks to wait for the surgery, sigh. Hugs Wynneth X",
      "MessageIndex": 13,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi lamg Thanks so much for responding to my question.  I really appreciate it. So fantastic to hear you are cancer free my dear, I do understand that this was the absolutely right decision for you to have the chemo first.  They don't consider my cancer is fast growing and the second consultant I saw told me it had likely been growing for about 18 months up to three years !   As I'd had a clear mammogram in January this year, my initial fear when noticing the lump was that it had grown very fast if I was clear in January then had a sizeable lump by end of April !   However this is not the case, invasive lobular cancer is very sneaky and 'hides' and doesn't show on mammograms, although it was clear on the ultrasound, but it's full size and extent of spread was only seen on the MRI.  It has been sneakily growing and spreading for some time until I noticed a soft swelling on the top of my breast and a very slight change to my nipple.  Ultrasound hasn't shown anything in lymph nodes, but of course they will remove at least sentinel nodes, if not more, during the mastectomy and test them for cancer cells. All this is what has formed my decision to go for surgery first and then blast everything with chemo just in case stray cells have spread, although it's my understanding that if there is no cancer in the lymph nodes, it's unlikely to have spread.   This forum is wonderful, I've only just joined but have already been helped tremendously by everyone, I really appreciate it. Hugs Wynneth X",
      "MessageIndex": 14,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi again Kacang You made me smile with your lop-sided Lizzie quip,  I'm still on the side of neatest they can mastectomy and no reconstruction, but is so helpful to hear of others' choices and experiences.  Could I ask if your boobies are/were large ?  Very personal I know, but I'm not small breasted (42D) and wonder if going flat is going to worry me later, even though I'm not keen to consider either implant or other reconstruction so far.  At the moment I believe I will be ok with flat post surgery and hope my scar is neat and heals well. I'm with you on not caring what anyone else thinks, they don't have to look if it offends or upsets them do they ? It's only important that I'm happy, healthy and feel confident post op.   I want to be healed and happy before I undergo chemo. Thanks for your help. Hugs Wynneth X",
      "MessageIndex": 24,
      "PostDate": "18/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi Joyce So sorry to hear your BC was so aggressive, I completely agree, in your circumstances immediate chemo is the the best option.  My surgeon said it would make no difference to the final outcome whichever way round the treatment happens.  Also if I chose chemo first it wouldn't  start for some weeks. My lymphnodes appeared clear on ultrasound, but of course they will biopsy sentinel nodes and possibly others during the surgery and I will know for sure if it has spread to them after the lab tests. I wish you all the best for your chemo my dear and subsequent treatment plan, hope It all works out well for you, thinking of you. Hugs Wynneth X",
      "MessageIndex": 30,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi Jackie.  After my wobble/distress yesterday at seeing someone new and not expecting it, I've calmed back down and have checked the credentials of the new doc on the hospital website, he seems to have good experience working in private hospitals in Saudi Arabia and has been at Derriford Hispital for ten years, although he is listed as a Locum Consultant ! Thank you for sharing your own story, I'm sorry things didn't work out so well for you and that you've still to go through further surgery, hoping it hasn't spread and your lymph node surgery goes well huni.   Your last paragraph says just what I'm thinking, I don't want this evil thing inside me for a moment longer than is necessary, I just can't take the worry of leaving it and trying chemo first which may or may not shrink it, knowing that the outcome will be a mastectomy regardless, but at a much later date.  Plus my body will be damaged by chemo before I undergo surgery rather than having it whilst I'm strong and healthy. Thanks for your advice. Hugs Wynneth X",
      "MessageIndex": 10,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi jan Thanks so much for sharing your experience and decision, I feel exactly as you did, cut it out then mop up any stray cells with chemo afterwards.  Having watched my poor brother suffer through really aggressive chemo and the toll it has taken on him both physically and emotionally, I know that if it did the same to me, I'd really not be in a good place to undergo surgery.  My feeling is get the surgery done asap whilst I'm feeling fit (I also have Rheumatoid Arthritis and Fibromyalgia) with the meds I'm currently on, recover from the surgery and then get through the chemo afterwards.   I will need a mastectomy whichever way round I do it, so what's the point in trying to see if the chemo shrinks it first is how I feel. Hope you start feeling better soon hunni. Hugs Wynneth X",
      "MessageIndex": 15,
      "PostDate": "17/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi cords, it really is an evil sneaky beast !  They haven't given me any idea of level or stage, not sure I understand the numbers at the moment.  I was diagnosed in June and here I am in mid august and still not sure of lots of things.  Seen three consultants, each one has told me different.   Spent the weekend with my mind going round in circles, have decided to put in a call to the breastcare nursing team and have someone (ideally the nurse I've seen three times and felt a connection with) call me back asap.  I want more information and some support, I don't feel I have any right now, I'm confused, unhappy and scared. Thanks for the hug, I really need it xxxxx",
      "MessageIndex": 33,
      "PostDate": "20/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi cords That's fantastic news that you don't need chemo now and also that it was early stage and they got it all.  Also that your wound is healing well. I've got my head sorted and am prepared for mastectomy with no reconstruction.  I've had a number of major surgeries and already have lots of scars, so scars don't worry me !  I know it will seem strange to be lop-sided afterwards, but I want to avoid having to have further surgeries if possible.   This decision thrown at me has unsettled me, but I am sure I still want to go for surgery first and haven't changed my mind.  Hugs Wynneth Xx",
      "MessageIndex": 31,
      "PostDate": "19/08/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/135976/offered-choice-of-chemo-before-mastectomy-or-after---what-would-you-do",
      "Title": "Offered choice of chemo before mastectomy or after - what would you..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Great words and so inspirational, thanks for sharing. Wynneth x",
      "MessageIndex": 34,
      "PostDate": "28/01/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137305/uplifting-things",
      "Title": "Uplifting things"
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "What a great idea. I don't have anything to share like this, but this just happened to me and made me smile. Had appointment with my GP yesterday, first time I've seen him since he referred me to breast unit after I showed him the swelling in my breast.  After we'd talked over all the s***t that's going on for me - mastectomy next Tuesday - as I got up to leave, he got out of his chair and Came towards me and I thought  he was going to shake my hand, changed his mind on the way to me then gave me a hug instead.  Made me feel human again somehow, does that make sense ?    I know he's on my team A hug is always good, anytime, anywho, anywhere x Feel free to delete it if you don't think it's appropriate on this thread x",
      "MessageIndex": 3,
      "PostDate": "05/09/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/137305/uplifting-things",
      "Title": "Uplifting things"
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "This is so kind of you Frances, I’ll have a go at working out one to fit my shi tzu Tilly.  Hugs  Wynneth x",
      "MessageIndex": 170,
      "PostDate": "21/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi any lovely people out there who can advise me ?  After first of 6 FEC-T treatments today I’m feeling quite nauseous despite the anti sickness meds with the chemo and tablet form at home.  I’ve had axillary clearance on other side and at risk of developing lymphedema, is it safe to use sea bands on that arm ?  I’ve been warned not to have BP taken on that side and the band is fairly tight to pull the plastic ball against the pressure point. Thanks to anyone reading this and I’d appreciate advice or suggestions. HUGS Wynneth x",
      "MessageIndex": 0,
      "PostDate": "12/12/2017",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144663/first-of-fec-t-chemo-sesssions-today-feeling-very-nauseous-despite-anti-sickness-meds-is-it-safe-to-use-seabands-on-arm-where-had-axillary-clearance-and-at-risk-of-lymphedema",
      "Title": "First of FEC-T chemo sesssions today, feeling very nauseous despite..."
    },
    {
      "AuthorID": "Wynneth",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/wynneth",
      "Content": "Hi Frances I love the dog coats you’ve knitted, and what a great cause.  Do you have patterns you work from ?  I’d love to knit some of these but need a pattern as I’m not goreat at making up patterns myself ! Hugs Wynneth X",
      "MessageIndex": 158,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/149940/crafts-and-bc",
      "Title": "Crafts and BC"
    }
  ]
}