{
  "AuthorID": "x-tay-x",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/x_2d00_tay_2d00_x",
  "Posts": [
    {
      "AuthorID": "x-tay-x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/x_2d00_tay_2d00_x",
      "Content": "Well it’s been a few really tough months since my last update. My MRI showed a mass 6x6mm. Following this we tried a further mammogram and further ultrasound which were inconclusive so my breast surgeon advised she wasn’t happy and decided to do and MRI Biopsy. I won’t lie. It was horrid. The bruising was awful and pain during and after was hardly bearable.  i was advised the MDT meeting was on Thursday lunch and I’d have a call with the results a few days later   Oh Thursday at 4pm I had a call asking me to attend an appointment with my surgeon the next day.  We had masses of snow over night so I called to check the appointment was still ok and confirmed yes.  The surgeon called at lunch and asked me to attend ASAP rather than wait. This set a few alarm bells as if everything was OK she wouldn’t have dragged me out in the snow when she was on the phone.  Her words were “you don’t have breast cancer” hurrah!!!! But her face wasn’t happy. She continued to tell me I have Agressive  Fibromatosis - a Desmoid Tumor - that’s extremely rare and even rarer in the breast. 900 people a year in the Us apparently are diagnosed and 0.2 % of those are BReast. She advised its classed as a sarcoma. Which I thought was cancer. But there somlittle information I’m struggling to find more in the breast.   Ive been scheduled for removal of a large area of breast on March 8th.  My biggest fobia in the whole world is general anesthetic   Thanks if you got this far. Off to research on here for Fibromatosis ",
      "MessageIndex": 3,
      "PostDate": "02/02/2019",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170958/mrl-scan",
      "Title": "MRl scan."
    },
    {
      "AuthorID": "x-tay-x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/x_2d00_tay_2d00_x",
      "Content": "Has anyone had a diagnosis of Breast cancer via and MRI?  Im 33 and in February was kinda dismissed by my breast clinic saying and indent on my breast was Mondors disease.  4 months later I was getting worse so monitored it. 2nd October had an appointment as I wasn’t happy and the breast surgeon was actually quite convinced something was wrong. She told me she was going to add my case to a board meeting as she said I shouldn’t have been dismissed without an ultrasound in February.  Long story short she told me she was really concerned, that she was going to speak to the chief radiologist and book a mammogram even though I’m technically too young.  Assuming I would have an appointment in the post but she said no, it would be immediate and i would have an ultrasound with the senior radiologist too that day.  After a thorough inspection with MRI the radiologist and the surgeon present the radiologist said “I have to admit I’m surprised to say I can’t see anything” the surgeon was just as confused and said the Mano was clear too. Neither were encouraged by not finding anything, they agreed they would see me in January to check the progress. On leaving unsaid thanks and glad nothing was found and the surgeon held my hand and said. “We are not out if the woods yet; please call me with any changes” So about two weeks ago I noticed it was deeper and appears to have a second tether point. But was due on so waited taking pics every few days and the change is noticeably almost daily. I called her Wednesday and she had me in today to se her and agreed it was quite different but has said she’s not happy to perform another ultrasound and has decided I need an MRI instead to give a more detailed picture “as thethers like this almost certainly mean cancer” she mentioned something called a lobular Carcinoma in situ which to be honest I’m too scared to google!  So if you’ve made it this far thank you!!  And My main question is has anyone been diagnosed with BC via an MRI after the Mammogram and ultrasound didn’t find anything? ",
      "MessageIndex": 0,
      "PostDate": "02/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170958/mrl-scan",
      "Title": "MRl scan."
    },
    {
      "AuthorID": "x-tay-x",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/x_2d00_tay_2d00_x",
      "Content": "Thank you xx  i have to admit im feeling positive even if something is found it seems to early to detect on ultrasound and mammogram so that’s encouraging for me.  My husband seems to think it’s a bad thing that she had mentioned a cancer type ‍♀️",
      "MessageIndex": 2,
      "PostDate": "02/11/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/170958/mrl-scan",
      "Title": "MRl scan."
    }
  ]
}