{
  "AuthorID": "Year 4 teacher",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/year-4-teacher",
  "Posts": [
    {
      "AuthorID": "Year 4 teacher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/year-4-teacher",
      "Content": "Thank you to all who have replied and good luck to you all.  I know the sentinel lymph node biopsy is supposed to catch the cancer at its first port of call, so if cancer cells only found in 1 or 2, then radiotherapy is thought to do the job; this is however quite frightening. I'm wishing another 10 could be taken when I go for second op on Friday! Chemo comes first too doesn't it, so it's a while before I'll have radiotherapy to the other nodes....",
      "MessageIndex": 4,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "Year 4 teacher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/year-4-teacher",
      "Content": "I'm new at this so here goes with posting in the right place....Had right central incision on 24th March. Now been told I have to go back for more surgery next week as margins not clear; my consultant also told me it's unusual to find tumour in the nipple. 1 out of 2 nodes taken tested positive but he is not removing more, as current thinking is chemo and radiotherapy will deal with cancer. Grade 2, 25mm tumour removed. Anybody else in same situation? Feel scared as know there is a chance another node may be affected....",
      "MessageIndex": 0,
      "PostDate": "09/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "Year 4 teacher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/year-4-teacher",
      "Content": "Hi Ellen, When had my first appointment I asked consultant if it could be Pagets but was told that was a pre- cancerous condition and I had a tumour behind nipple. Now I'm reading up again (dangerous!) and it begins with excema like rash, which I've had problems with for years. I'm going to ask him to look at nipple on other breast on Friday when I go back for 2nd op, which is clear on mammogram but can be itchy...thank you. What stage are you at now? X",
      "MessageIndex": 8,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "Year 4 teacher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/year-4-teacher",
      "Content": "Thanks for replying Dreamthief, I am ER positive oestrogen HER negative apparently....... I was told on results day last week that I will need chemo; I understood this was a precaution as cancer in nodes. I will ask if the affected node had a few cells or a cluster, good advice.  The chemo info really useful too. Hope you are well now...you've helped reassure me over all this, so thanks again x",
      "MessageIndex": 10,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "Year 4 teacher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/year-4-teacher",
      "Content": "Thank you Fiona, what stage are you at now? I know I'm driving my poor husband mad with this worry so must discuss again on Friday. They do seem to think we should take it all in our stride, but that is impossible x",
      "MessageIndex": 9,
      "PostDate": "10/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/107668/results-of-surgery",
      "Title": "Results of surgery"
    },
    {
      "AuthorID": "Year 4 teacher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/year-4-teacher",
      "Content": "Thank you G n' J for your sensible reflection on my situation...yes, need to be fully healed. When I went to hospital this afternoon new dressing tried and luckily my results were in. A consultant saw me and gave me good news that margins now clear! Have oncologist appointment next Wednesday...moving forward. Will try and use this free time till chemo starts to do useful and fun things. Thanks so much for your reply! L x",
      "MessageIndex": 2,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108442/7-weeks-now-and-still-no-treatment-plan",
      "Title": "7 weeks now and still no treatment plan"
    },
    {
      "AuthorID": "Year 4 teacher",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/year-4-teacher",
      "Content": "Hi. 7 weeks since diagnosis .... Had lumpectomy 24th March ( tumour in nipple) but then, as margins showed cells, went back on 15th April for clearance. As 1 of 2 sentinel nodes had cells, am awaiting chemo too. My wound was causing problems so went back 4 days later; was told all was ok, and to keep steristrips in place, it was just weeping a bit. By last weekend was worried, as still weeping and sore, so went back yesterday. So wet that skin surrounding wound raw and have a rash ( although incision healed). I was allergic to the glue on steristrips and the dressings I'd bought from Boots when hospital dressings ran out!! And on top of that the doctors' strike means I won't get my results of 2nd op till 2nd May, evening appointment!! Am returning to the ( very quiet) breast clinic today to have wound checked again.... Sorry to moan but feeling very fed up! ",
      "MessageIndex": 0,
      "PostDate": "27/04/2016",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/108442/7-weeks-now-and-still-no-treatment-plan",
      "Title": "7 weeks now and still no treatment plan"
    }
  ]
}