{
  "AuthorID": "YoungandFit",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
  "Posts": [
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Definitely worth checking.  I was told no swimming because of the risk of skin infection.  When I finished I had no problems with my skin but told to wait 2 weeks as radiotherapy continues to work and as long as no deterioration I could swim.   Each area will have their own protocols so best to check first. Hope it all goes well. I still have to wait another week before I use jacuzzi, steam, sauna and have hot showers again.  Basically told none of that for a month.  ",
      "MessageIndex": 46,
      "PostDate": "08/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Hi  Clare,  I saw the machine as I did the Maggie Centre's preparing for Radiotherapy session.  I was surprised how big it was, so was glad I saw that first.  Funny thing was when I had my first zap I thought it looked really small!  Bonkers eh? To you all swimmers and aquafit lovers - just hold on and enjoy it when you're allowed back.  I finished 4 weeks today and because I was really lucky with minimal change to my skin, I was allowed back after 2 weeks, though I left it a bit longer than that because I had a friend staying with me who was having radiotherapy at Guys for a skin condition so I was travelling with her to the hospital each day.   I hadn't done any pool work since December due to having chemo from Jan, but it didn't take long to get back up to my normal speeds and lengths, just over a week, so well pleased with that.  Having my port out on Saturday so I guess no swimming or stretchy type moves until the scar heals.   Good luck on your zaps - will be over soon!",
      "MessageIndex": 72,
      "PostDate": "11/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Weren't you given the booklet?  I was told by the oncologist no swimming.  I had a session with a senior radiologist prior to my first zap where I was told all the dos and don'ts and after my last zap a session with a specialist nurse who was surprised by how little  my skin was affected (just slightly redder around the nipple) but said all the stuff about when I could swim and start to use things hotter.  As I said they all have their own protocols.  ",
      "MessageIndex": 49,
      "PostDate": "08/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Yme I was so looking forward to getting back to swimming, then it suddenly occurred to me that everyone will see my bald head from the chemo when I was coming out of the shower etc.  Scars on my boob didn't bother me at all for some reason.  I was quite nervous but no one batted an eyelid and now I am back to wandering around the changing room naked in all senses of the word!  ",
      "MessageIndex": 92,
      "PostDate": "17/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "I was told to avoid baby ointments like the plague.  I used the Blue Aveeno (not the baby one) and you can get from Amazon for around £3 - much cheaper than the supermarkets.  I also used Holland and Barrets Aloe Vera at night.  I moisturized immediately after my radiotherapy and about 4 or 5 times a day.  I gave up tea and coffee and drank around 3 litres of water a day as they said important to keep the skin hydrated.  I never had any tiredness, no sore skin or itchiness and was back in the swimming pool 2 weeks after my treatment finished.  I was told to wait to 2 weeks as you continue to cook.  I know I was very lucky and others have done all this and still burnt.  Good luck all.  ",
      "MessageIndex": 15,
      "PostDate": "02/07/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/160714/july-2018-radiotherapy-club",
      "Title": "July 2018 Radiotherapy Club"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Hi Tulip16  No you are not making a fuss - make sure you tell them you are still suffering.  They don't want you to suffer, and will help.  Have a good moan about it - it's a tough old journey we're on, so you moan. Hope it clears up for you soon.",
      "MessageIndex": 72,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Hi isreal I only cut out the tea and coffee because I knew I would slip into bad habits and drink loads of it and not much water si if you are more disciplined you could treat yourself occasionally.  ",
      "MessageIndex": 33,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Hi  yellowdaffodil I've recently finished 15 sessions of Radiotherapy, after 6 rounds of FEC-T chemo.  I am going back to the gym now I have finished, but I never went while I was having radiotherapy.  I did not have any tiredness or soreness at all, but I found the trip to hospital every day took so much of my time, particularly if they were running late.  So I didn't attempt the gym during that but exercised at home.   It is impossible to say whether you will feel sore and/or tired.  Like chemo, if affects different people differently.  One thing I will say, is that I was told to drink lots of water to keep my skin hydrated, so I gave up tea and coffee and drank 2-3 litres of water a day.  I suspect that helped me with potential skin problems and tiredness.  Just see how you feel and take it easy.  Good luck.  ",
      "MessageIndex": 48,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Well I managed a whole 1 hour Pilates class today.  I did say to the instructor that I may just lie there at times or perhaps leave early, but I managed to do the whole class.  Had a rest, then did half hour on the bike.  Had another rest then went on the treadmill for a sedate walk.  However, the TV streaming wasn't working so I ended up watching the music videos channel.  I discovered that it is not possible to walk sedately to ACDC's Thunderstruck, so I upped the speed and was away.  Managed 30 minutes on that, then some weights.  Really felt good.  Back home now and making onion jam.    So all in all pleased with my first outing to the gym.  ",
      "MessageIndex": 53,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Great news Nutmeg  I'm off for Number 11 today, and finish on Weds.  No noticeable skin changes yet for me, nor any tiredness.  Will have to see if I am one of the lucky ones and get off lightly or whether it starts to get bad now.  I was pretty lucky with the chemo side effects being minimal.  Can I pull it off for both?   Originally I was due to have radiotherapy starting before Christmas but it was cancelled the day before it was due to start as my Endopredict gave me a 25% chance of cancer recurring so went into chemo in Jan.  My daughter had bought me a yearly cheese subscription for Christmas and timed the first delivery for when my radiotherapy finished, as she thought that would be nice treat. I rang them and explained my situation and they said fine they would just put everything on hold until I was ready.  I didn't want the cheese because of all that I read about losing your taste, or everything tasting of metal.  In the end I never got that, but still preferred to enjoy my cheese when it was all over.  So I have now arranged my cheese delivery for next Friday.  End of radiotherapy on Weds and cheese on Fri - perfect!",
      "MessageIndex": 18,
      "PostDate": "07/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Hi Aliblue  I don't know anyone who has had a gel slab, but it makes sense to me.  I have a friend with a skin condition and she needed whole body radiotherapy with is external only (i.e. should not penetrate below the skin) and when she was having some top ups they made some special moulds for parts of her body.  So it kind of makes sense to me that they use something to prevent it going too deep in that area, whilst deeper in surrounding tissue. I had no 13 zap today.  Only 2 more to go and so far only slight dryness and tiny flakey bits.  No soreness.  I can see around the nipple area is slightly redder than the other boob but not by much.  I am hoping the final 2 do not cause any problems.  I have my review tomorrow and I am going to ask when I can get back into the pool (haven't swam since December) and when I can have a hot shower - hate those warm showers!",
      "MessageIndex": 22,
      "PostDate": "11/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Israel  I was told to drink plenty of water to keep my skin hydrated.  I gave up tea and coffee and I drink between 2 and 3 litres of water a day.  I finish tomorrow and so far I have only had a little dry and flakeyness.  I can see the around the nipple area is slightly redder than the other boob.  I've had no tiredness and they reckon that is because I've kept myself well hydrated.  So try that too!   Good luck ",
      "MessageIndex": 29,
      "PostDate": "12/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Nutmeg - you are younger than me!  It was my consultant who referred to me as young and fit when she decided I should have FEC-T chemo rather then what my daughter refers to as Chemo-lite.  She felt I could cope with it.  It made me laugh being referred to in that way.  I am certainly old and unfit, but hope to get back to being old and slightly fit again.  I will certainly take it easy - little and often is my plan.  I need to get my legs strong for my knee replacements which I hope they will now put me on the waiting list for when I see the surgeon mid July,  ",
      "MessageIndex": 45,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Yay!  Had my last radiotherapy zap, followed by a review with the radiotherapy nurse, who looked at my skin.  She was amazed how little the radiotherapy had affected it - just a little redness around the nipple and skin a little drier.  She said it will continue to work for 2 weeks, but providing I don't have any problems I can get back in the pool in 2 weeks time.  I month before I can hit the jacuzzi, steam and sauna rooms, and 1 month before I can gradually increase the shower from warm to hot!  Yippee.  Am intending to go to the gym on Saturday for pilates and using the machines - got to build my strength up for swimming and aquafit!  So happy!!  You might have guessed that.",
      "MessageIndex": 40,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "I will probably pay for it tomorrow!",
      "MessageIndex": 58,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Hi Fundamentals  Sorry to hear you are getting skin problems now.  I finished a week ago today, and touch wood, skin still OK - just slightly redder round the nipple area, but no itchiness, etc.  While having radiotherapy I was moisituring at least 4 times a day, and still am (as they said I would continue to \"cook\" for a further 2 weeks).  Also are you drinking plenty of water?  During my treatment I gave up tea and coffee to force myself to drink more water, and usually managed 3 litres a day.  I am still doing that, although I am now treating myself to the occasionally tea or coffee if I go out with friends.  I was told for sun protection to use factor 50.   Hope it clears up soon",
      "MessageIndex": 64,
      "PostDate": "20/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Gosh xxLuvvy - you should not feel a fraud.  It's a terrible shock.  I am glad you don't need the chemo.  That was the original diagnosis for me, but I identified via Endopredict as a high risk of cancer returning.  It's OK to cry about it - let the emotion out.  We all support each other and you will get through it.",
      "MessageIndex": 39,
      "PostDate": "13/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "HI Cuppatime  Get the Blue Aveeno, not the green one, and not the baby one.  Amazon sell it really cheaply as an add on.  I also used Aloe Vera Gel (must be at least 99% - Holland and Barrets is 99.9) at night.  Lots of people kept in the fridge and used it cool to relieve their painful skin.  I never had that, so didn't bother.  The other thing was I took my Aveeno to my sessions and moisturised immediately after my treatment.  I did check first if that was OK, as I know you mustn't moisturise before.  Good luck - it goes really quickly - much quicker than chemo!    ",
      "MessageIndex": 55,
      "PostDate": "16/06/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/158397/june-2018-radiotherapy-club",
      "Title": "☢☢☢ June 2018 Radiotherapy Club ☢☢☢"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Hi Violet I used the cold cap for the first session.  I asked the Chemo Sister at my intro session if it was true that after chemo your hair grew back stronger and thicker because if so I wanted to lose it all, but she said it was different for everyone.  I've since been on the head wrappers course and learned exactly how the hair grows back and why it sometimes grows back thicker (all to do with the stage the hair follicle is in repairing itself) and why is it often temporary.  My daughter persuaded me to at least try it.  It was fine, but by week 3 I started to moult.  I have a good friend who had recently completed her chemo for ovarian cancer and she said did I mean it was coming out in handfuls which is what happened to her (she never tried the cold cap) and I said no it was just like a cat or a rabbit having a moult.  So I don't know if the cold cap slowed it down.  However, it was wiry and every time I washed it it knotted like crazy - conditioner was useless.  My scalp hurt from trying to get the knots out.  My husband offered to shave me with his beard trimmer and I said I couldn't bear it  as my scalp was so painful.  Even though he assured me with the beard trimmers it wouldn't even touch my scalp, the thought was painful (actual shaving is not advised in case the skin gets nicked)  so I asked  him to just hack it off with the scissors.  It was more comfortable then.  I never lost it all, most of it, but not all.  I got my wig from the company my hospital trust deal with and I absolutely love it.  In the hot weather the wig can be uncomfortable, but I have the wrap I got from Head Wrappers (they teach you how to tie it into pretty shapes) and a turban type thing, and a sun hat - all things I bought after trying stuff on at their course.  The other brilliant thing was fringes, which I was also introduced to on the head wrappers course - they come on a bit of velcro and you tuck them under your head gear and they stick.  As my daughter said \"I wrapped head says chemo, a wrapped head with some hair showing is a fashion statement\" With my nails, I must say they are longest they have ever been!  But they do have some discolouration.  That happened with the T, nothing seemed to affect my nails with the FEC.    As my last chemo was 2 weeks ago the chemo is still working away, so it will be a few weeks before I see how my hair and nail change over time.  Hope that was useful.",
      "MessageIndex": 77,
      "PostDate": "08/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Violet25 Hope everything went well today",
      "MessageIndex": 88,
      "PostDate": "10/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Yes, the dreaded chemo cough.  I got it on each cycle of T.  For me it tended to come on after about 10 days and last almost to until my next cycle was due.  Had my last cycle almost 3 weeks ago and this time it started later, and not so bad, but it's still here.  ",
      "MessageIndex": 130,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "Hi Violet - I've just completed 6 rounds of FEC-T (3 FEC and 3 T) and I would not say it was the pits.  Everyone is individual and how they react is how they react.  I know it is not supposed to be a doddle and the reason I was put on it was, as my consultant said \"it's the Gold Standard, I want you to have it - you are young and fit (ha ha - I'm 65 and probably reasonably fit for my age).  I expected a hard time but I had minimal side effects.  For my first round, the registrar said I would have 2 shit days then be alright and he was pretty much spot on.  It got a bit harder each time - more achy for a while, chemo cough, that sort of thing, but generally OK after a week.  T was harder in some ways - much more tired and that lasted longer but easier in others (no nausea).  All you can do is go with the flow.  The day I turned up for my first chemo, a woman sitting next to me had just finished her course of FEC-T and she just said - Oh it's fine - you'll be fine.  Just make sure you report any issues and get them sorted and you will fine too.",
      "MessageIndex": 61,
      "PostDate": "05/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "YoungandFit",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/youngandfit",
      "Content": "I had FEC but I agree T is harsher, and my last round gave me a level of exhaustion I have never experienced - often napping twice a day for 3 hours, and still sleeping soundly at night.  I only started to get some energy back after over 2 weeks.  Nothing awful, but it was almost like - it's your last one so we're going to make sure you really feel it!",
      "MessageIndex": 132,
      "PostDate": "14/05/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/156264/may-2018-breast-cancer-chemo-club",
      "Title": "*** May 2018 Breast Cancer Chemo Club ***"
    }
  ]
}