{
  "AuthorID": "YvonneOR",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
  "Posts": [
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I was diagnosed in Dec 2011, had a lumpectomy, Also had lymph node clearance, where only one was infected out of 20 removed.  I had 6 Tax Chemo, and 18 rads.  Am now on Aromasin for five years.  My breast has been full of fluid since I finished the rads.  Have been back to hosp numerous times, also had mammograms done, but everything clear.  Surgeon and Onc have said it's a bad reaction to the rads, and it will eventually disappear, but at the moment the breast is very sore, especially at night when turning over in the bed. I am now taking pain killers to ease the pain.  Sorry can't help you anymore. Take care, Yvonne",
      "MessageIndex": 1,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56531/fluid-lymphodema-in-my-breast",
      "Title": "Fluid / Lymphodema in my breast"
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi Mary, My two grandchildren are three & half, and two & half, are fasinated with me having no hair at moment.  They love to help me put on my wig, and as I have just finished my chemo, I have now got a tiny growth coming through. I found it hard to cope with losing the hair in the beginning, but I got used to it, and now even go out with no wig or hair covering when the weather is warm. Hope you get on ok. Yvonne",
      "MessageIndex": 1,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/50640/telling-young-children-about-hair-loss",
      "Title": "Telling Young Children About Hair Loss"
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I had six sessions of Tax and cyclophosphamide.  Finished them at the end of May.  I was given loads of anti sickness medication which worked.  Another side effect of it I had, was very sore bones, for which I was give ibrofen and other pain killers, also had very sore mouth, and lost all sense of taste for a while. I had my treatment in Ireland. This was followed by 18 rads.  I did get bad burns from this treatment, on my breast, underneath, and also in my neck.  The hosp did give me cream to put on after each treatment, and up to three times a day.  One of the burns blistered, so that had to be dressed by the local doc everyday, as they were worried in case infection set in, but eventually this all healed.  Still have swollen breast from the rads though.  My surgeon saw me last Thurs, and said this was normal, and could take a couple of months to clear up. Yvonne",
      "MessageIndex": 2,
      "PostDate": "20/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52575/finally-have-my-treatment-plan-four-sessions-of-taxotere-with-endoxan-anybody-heard-about-this-before",
      "Title": "Finally have my treatment plan..... Four sessions of Taxotere with..."
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, The cream was Aqueous, the hospital supplied me with loads of it!!!  I would shower before treatment, and as soon as I finished, while I was changing, I would put loads of it on me, and then a few more times during the day.  Hospital also told me to bathe my breast with camoline tea.  Used to make up a pint jug of it every day, and bathe my breast with it and also the surrounding area. Did ease the burns a little. Though treatment is finished now, I still feel very tired everyday, and need to have a daily rest in the pm.  I am now taking Arimidex, which does give me hot flushes and my joints do tend to seize up, when I am sitting for any length of time. Yvonne",
      "MessageIndex": 4,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52575/finally-have-my-treatment-plan-four-sessions-of-taxotere-with-endoxan-anybody-heard-about-this-before",
      "Title": "Finally have my treatment plan..... Four sessions of Taxotere with..."
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I had six sessions of Taxotere and Cyclophosphamide this year.  Side effects I got were bone aches and pains, very bad taste in mouth.  I took loads of anti sickness meds and was never sick.  Took pain killers for the bones.  Could not get rid of the bad taste in my mouth, and everything I ate tasted awful.  Did have meds for my mouth, and although it cured the mouth ulcers, didn't do anything for the bad taste.  A few days after my last chemo, this all disappeared and I could taste all my food again!!!! Hope you get on ok with the Tax. Yvonne",
      "MessageIndex": 3,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52672/anyone-experience-of-tc-chemo-taxotere-and-cyclophosphamide",
      "Title": "Anyone experience of TC chemo (Taxotere and Cyclophosphamide)????..."
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, My hair was also my pride and joy!  I even refused chemo at first, because I did not want to lose my hair.  Anyway, my hair started to fall out with the first 14 days after my first chemo.  I had it cut very short then, but just couldn't cope with the hair falling out everywhere, on my pillow, clothes etc.  So I went to my wig place, and they shaved it off for me completely.  Bit of a shock at first, but managed to get my head around it, and coped.  Finished my treatments at end of June, and today I went to the hairdressers for the first time.  Had it coloured again, and trimmed!!    Thinking of you as you start your treatments, but there is light at the end of the tunnel. Yvonne",
      "MessageIndex": 3,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54013/hair--",
      "Title": "hair :-("
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi,  I had six sessions of Taxotere, started in Feb and finished at end of May.  I was given loads of anti sickness meds, and was never sick during the treatment.  Did get dreadful bone pain, but was then given Ibrofen, so took that as soon as possible after treatment, and that helped with the pain. Do I found the Taxotere very doable!   Yvonne",
      "MessageIndex": 24,
      "PostDate": "21/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52198/docetaxal-for-me-better-than-fec",
      "Title": "Docetaxal for me better than FEC"
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I finished chemo 22nd May, then I had 18 rads in June.  My hair was mid length, very straight and coloured blonde, now I have a head of curls, also about 1 1/2 inches long!!! My hair dresser has coloured it as light as possible she can go, without using chemicals on it, as it was coming back with lots of grey in it, but she won't colour it blonde yet.   I don't post often, but I read all the posts everyday. Take care, Yvonne",
      "MessageIndex": 1,
      "PostDate": "03/01/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/56525/curly-hair",
      "Title": "curly hair"
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I received my first session of chemo on 6th February, and my hair started falling out 2 weeks later.  Last Friday I had it cut very short, but it's still coming our by the handful, so on Tuesday I am going for my hairpiece fitting, and it's all coming off.  Am finding hair everywhere I go!!! Also my eyebrows have started thinning. I have always had straight hair, and a few days after the chemo it started going curly, and everyone was asking if I had it permed!!! Hoping it will come back curly!  Have bought some lovely hats, turbans and bandanas. As Tibbty says, I do find it hard to lose my eyebrows, have come to terms with the hair coming out. Yvonne  x x x x x   Yvonne",
      "MessageIndex": 13,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/47146/hair-loss",
      "Title": "hair loss"
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I live in Southern Ireland, and have private health insurance cover.  The cost to my insurers for my surgery, 6 Tax, 28 rads was €35,000!  If I hadn't had insurance cover, I would have had the same treatment, but I would have had to join a queue. Yvonne",
      "MessageIndex": 22,
      "PostDate": "23/10/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54240/to-have-the-op-or-try-alternative",
      "Title": "To have the op or try alternative"
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I had one fitted in February, due to the fact that I have no veins!!!!  I had mine put in under a local, and felt no pain or discomfort when it was inserted.  Finished my chemo at end of May, and I still have it in.  I go into the hospital every six weeks to have it flushed out.  Going for appoint with my onc at end of Aug, so hoping then that he will tell me it can come out.  I don't have any trouble with it, its hardly visiable, it's only when I wear my seat belt in the car, that the belt catches the line where it enters my neck, and that can be be sore at end of car journey. Yvonne",
      "MessageIndex": 2,
      "PostDate": "11/08/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/52322/portacath-experience-semi-permanent-line-that-is-under-the-skin-going-well",
      "Title": "Portacath experience: semi permanent line that is under the skin!..."
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I have been on Arimidex since 1st July, and have had dreadful pains in my joints, especially shoulder joints, and hands.  First thing in the morning I can hardly use my fingers.  Went to see my oncologist yesterday, and he has now taken me off the Arimidex and is starting me on Aromasin.  He thinks I will have less trouble with my joints on this tablet.  Has anyone else taken Aromasin, and what side effects did this give. Yvonne",
      "MessageIndex": 0,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/54773/arimidex-v-aromasin",
      "Title": "Arimidex V Aromasin"
    },
    {
      "AuthorID": "YvonneOR",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/yvonneor",
      "Content": "Hi, I started my chemo beginning of Feb, just had my 4th one last Tuesday.  Two more to go. First refused chemo as I could not get my head around losing my hair.  Well, eventually decided that my health came first, and my hair started coming out with two & half weeks of first chemo!  I had a wig fitted before the hair came out, so it matched my hair, and now I get compliments on my hair style from people who do not know that it's a wig!  Also have lots of hats and scarves to match my outfits.  At home family and friends are used to seeing me with no hair now, even the grandchildren when visiting don't take any notice anymore. I go to work everyday for four to five hours, I know I am lucky as we have our own workplace, and I can pick and choose my hours, but I feel that I need to work to keep myself sane, and not sit at home and start thinking about everything that could happen.  I am on Taxadore and a couple of days after treatment bone ache sets in, and then I have to rest for a couple of days, but most days I seem to get by ok.  My way of dealing with my breast cancer is to try to keep everything normal, and to keep going and doing all the things I would normally do.  I did tell the docs that the treatment had to fit into my life, and not the other way round, and for me that is working up to now. Hope you get on ok Yvonne",
      "MessageIndex": 6,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/48963/feeling-gutted",
      "Title": "Feeling Gutted"
    }
  ]
}