{
  "AuthorID": "Zebrano",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zebrano",
  "Posts": [
    {
      "AuthorID": "Zebrano",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zebrano",
      "Content": "Thanks for the tip Karen. Looking forward to meeting you on 31st. x",
      "MessageIndex": 43,
      "PostDate": "19/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144244/meet-up-farnham-guildford-area",
      "Title": "Meet up Farnham / Guildford area"
    },
    {
      "AuthorID": "Zebrano",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zebrano",
      "Content": "I am going on to 3 weekly Docetaxel chemo cycles from this week (assuming neutrophils are up to it). 31st March would be a Saturday furthest from the chemo, and hence would increase my chances of being able to make it. But please plan around everyone else as I am just starting the Docetaxel, after 3 cycles of EC so I don't know how bad the side effects are likely to be from that. With the EC, I would not be up to going out the first weekend after the infusion but the Docetaxel is new territory. Looking forward to hopefully meeting you all. x",
      "MessageIndex": 40,
      "PostDate": "19/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144244/meet-up-farnham-guildford-area",
      "Title": "Meet up Farnham / Guildford area"
    },
    {
      "AuthorID": "Zebrano",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zebrano",
      "Content": "I would love to come along depending on where you meet and where I am in the chemo cycle. x",
      "MessageIndex": 36,
      "PostDate": "17/02/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/144244/meet-up-farnham-guildford-area",
      "Title": "Meet up Farnham / Guildford area"
    },
    {
      "AuthorID": "Zebrano",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zebrano",
      "Content": "Hi everyone I've just had my oncologist's appointment and have been told they are dropping the Docetaxel. I had 3 EC and 2 Docetaxel with Herceptin and Pertuzumab and was due 2 more Docetaxel with Herceptin and Pertuzumab. They said that the side effects from the Docetaxel meant the risks outweighed the benefits. These side effects included a 6 night stay in hospital with raised temp and heart rate, lowered blood pressure, infection, low potassium and dehydration. Also hand and facial rash with soreness and skin peeling to name but a few. On the one hand I am mightily relieved not to have to have endure any more of 'the devil's poison' but on the other hand I am concerned re the efficacy of my treatment. I will still be having the Herceptin and Pertuzumab, which they say are the most important in HER2+ cases, but I am still concerned that without the Docetaxel the fight against the cancer will not be strong enough.  I thought they might further reduce the dose, which was already reduced by 20% last time, but to cut it altogether seems a big step: from 100% the first time to 80% the second time to 0 the third time seems extreme. Has anyone else experienced anything similar? Should I rely on their extensive knowledge and trust them on this decision? Or are they too quick to quit? Any thoughts? x",
      "MessageIndex": 36,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Zebrano",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zebrano",
      "Content": "Thanks for your reply Annie Ealing. Interesting that your hospital is dropping Docetaxel. I will ask them about Paclitaxel.",
      "MessageIndex": 51,
      "PostDate": "04/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Zebrano",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zebrano",
      "Content": "Re eyebrows/eyelashes: My eyebrows and eyelashes are still hanging in there, though have gradually thinned a fair bit during the course of the chemo (I've now had 6 out of 7).  The Look Good Feel Better course was very good for showing how to do eyebrows - in fact I thought this was the best bit. They did advise no false eyelashes and no eyeliner or other make-up in the water line. I haven't used the tips much yet as I've only had one day when I was feeling well enough to put on make-up.  I agree that in some ways losing brows and lashes is worse than losing head hair - you can disguise the latter with all manner of colourful headgear but not so easy with brows and lashes and yes it does make quite a difference to how you look doesn't it? xxx",
      "MessageIndex": 118,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    },
    {
      "AuthorID": "Zebrano",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zebrano",
      "Content": "Hi Karebear I have one more infusion of Pertuzumab and Herceptin (next Friday) - just these 2 now as they've stopped the Docetaxel due to severity of SEs. Then I am going on to Herceptin injections every 3 weeks. I'm not sure what to expect from that so will be interested to hear your experiences. They will then stop the Herceptin for a period while I have my operation (5 June), then re-start afterwards. x",
      "MessageIndex": 298,
      "PostDate": "20/04/2018",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/154013/april-2018-breast-cancer-chemo-club",
      "Title": "*** April 2018 Breast Cancer Chemo Club ***"
    }
  ]
}