{
  "AuthorID": "zsuzsabee",
  "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zsuzsabee",
  "Posts": [
    {
      "AuthorID": "zsuzsabee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zsuzsabee",
      "Content": "Hi, I was wondering if any one can help. My daughter was diagnosed with DCIS and Pagets disease of the nipple in April and on the 3rd June had a bi lateral mastectomy with immediate reconstruction.  On the 13th June  her consultant told her she was cancer free and to go and get healed and live a happy life.  The following thurs 2oth June  we were told that some more tests had been done on the tissue samples which had shown an invasive cancer  HER2 Receptor or something I may not have got that right , anyway she would have to have chemo and take Herceptin for a year. The shock was massive as I'm sure you can understand, but also anger that they could have got something as life changing as this so massively wrong. I think her consultant should have waited for the results of all the tests before telling her she was cancer free.   Anyway, she is now so afraid of what the chemo is going to do to her, how ill will she feel, how soon will she lose her hair all the things she was told she wouldn't have to face has now become a reality and I don't know how to help her because I don't know the answers. Any advice would be welcome, so I can ease her mind.  Many thanks ",
      "MessageIndex": 0,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61894/mums-worries",
      "Title": "Mums worries"
    },
    {
      "AuthorID": "zsuzsabee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zsuzsabee",
      "Content": "Thanks Tiggy, we're already on the wig route, and you've put my mind a rest. I just hope and pray that you continue well with your recovery. I'll show Zsuzsa your reply and hopefully when she sees someone else's experience it may not be so daunting for her....or me.  Thanks again xxxxx",
      "MessageIndex": 2,
      "PostDate": "27/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61894/mums-worries",
      "Title": "Mums worries"
    },
    {
      "AuthorID": "zsuzsabee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zsuzsabee",
      "Content": "Hi Dorothee, thanks for your reply and your explanation, which has made things a lot clearer to me. Please don't mis-understand me , I think the surgeon did a wonderful job, my gripe was because he didn't stress  that there were still results outstanding, and Zsuzsa heard those magic words \"cancer free\" ! After telling all her friends and family the good news, a week later she had to tell her dad, brother, daughter and son....(who in between the diagnoses had had a premature baby) that the news she'd given them was wrong. It would have made her acceptance of her diagnosis so much easier on her if he'd been a little less enthusiastic and a little more cautious. It has made her psychological well being so much worse....understandably in my opinion. It was explained to us that this was a \"precaution or prevention\" if you will, but still a shock. She WILL come through this and we're all there with her very step of the way, your letter has eased my mind  ..thank you again Dorothee and I hope your recovery continues to go well   Ruth x",
      "MessageIndex": 6,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61894/mums-worries",
      "Title": "Mums worries"
    },
    {
      "AuthorID": "zsuzsabee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zsuzsabee",
      "Content": "Hiya Tiggy, thanks again for your kind and perceptive words. I feel much better knowing there are others out there who are able to sympathise and put at ease the worries of someone they don't know, and take the time and trouble to help others when so much is going on in their own lives. We have been able to laugh a little to ease the pain, and our family was always a \"laughy\" family.  Zsuzsa is at the doctors today have her dressings done, she has an infection on the site where the nipple was removed, she has a great g.p. which helps, and The Royal Marsden has done a first class job.  We go on the 4th July to see surgeon and 5th to see oncologist so will keep you updated and you may be sure I will be asking for tips. Zsuzsa won't post on here she's afraid of reading other peoples' experiences till she starts her own chemo in case it may make her fears worse. But, sometimes your fears are much worse than the reality...let's hope so.  I will be thinking of you and your family  Ruth x",
      "MessageIndex": 9,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61894/mums-worries",
      "Title": "Mums worries"
    },
    {
      "AuthorID": "zsuzsabee",
      "AuthorURL": "https://community.macmillan.org.ukhttps://community.macmillan.org.uk/members/zsuzsabee",
      "Content": "Thank you this is to thank Dorothee V, Tiggy, Annie keep smiling and Benja, for all the help and advice I've had over the last day, you'll never know how grateful I am. Keep up the good work ladies you have all been an inspiration to me  Many thanks  and my prayers go with you all Ruth x",
      "MessageIndex": 0,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.macmillan.org.uk/cancer_types/breast-cancer/f/breast-cancer-forum/61916/thank-you",
      "Title": "Thank you"
    }
  ]
}