{
  "AuthorID": "ARangel14",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3316125&p=205044",
  "Posts": [
    {
      "AuthorID": "ARangel14",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3316125&p=205044",
      "Content": " Birads score is what they give as to what they \"think\" is showing up on the imaging.\n 0: Incomplete\n1: Negative\n2: Benign finding(s)\n3: Probably benign\n4: Suspicious abnormality\n4A: low suspicion for malignancy\n4B: intermediate suspicion of malignancy\n4C: moderate concern, but not classic for malignancy\n5: Highly suggestive of malignancy\n6: Known biopsy – proven malignancy\nDid they do an ultra sound also or just the mammo? If they didn't do an US they will probably do that next. Do not panic! Imaging can only suggest what it is. Nothing is definite unless they biopsy. I go back Tues. after a 3 month wait for a repeat test. I am Birads 0 right now. I have had two biopsies so far on the same breast. First one showed a thickening-Benign, Second one showed atypical cells on needle biopsy, after surgical biopsy it showed a necrosis -benign. If this is your first time it is a little frightening. Deep down I am a little bit concerned. Just remember it's nothing until surgical path says it's something.\n ",
      "MessageIndex": 2,
      "PostDate": "01/02/2015",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3316125",
      "Title": "Biopsy needed"
    },
    {
      "AuthorID": "ARangel14",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3250557&p=205044",
      "Content": " Ashley, \nSo we meet again. I am also on the PC forum a lot and just read a reply to my post on there tonight from you. Have you had any previous biopsies before on that breast? Needle or surgical? I've had two biopsies on left breast the most recent last year after a needle biopsy came back w/ atypical cells. Yes it can be something else. Mine turned out to be a necrosis. This year on mammo I got a call back area of suspicion, 3D mammo and US performed, I go back in 3 months to see if it has changed. The pea size lump is right above where my biopsy was from last year. Have you tried evening primrose and vitamin E. My breast oncologist who performed my surgery last year immediately put me on that and it dramatically helped mine that was sore from all the poking and prodding. After my biopsy I went off of them but w/ the recent problems have just started back. Like you I think I have mine irritated from constantly poking and prodding at it. So to go back to the question, yes it can be something other than breast cancer. We seriously need to connect because we have so much in common it's scary with our husbands and having small children. Anyway, any more questions or need to talk holler at me. Miki\nMy name is Miki my husband Bob- age 53 @ DX\nInitial PSA 8/14 was 4.1\nBiopsy 9-11-14\nInitial Results: 9/25/2014 -- 6 of 12 cores positive 3+3=6 (5%) 3+3=6 (5%) 3+3=6(3%) 3+3=6 (10%) 3+3=6 (40%) 3+4=7 (40%) \nPNI Left middle and Left lateral apex\nDaVinci scheduled for Dec.3, 2014 ",
      "MessageIndex": 3,
      "PostDate": "29/11/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3250557",
      "Title": "34 years old and just found a hard lump in right axilla."
    },
    {
      "AuthorID": "ARangel14",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3250557&p=205044",
      "Content": " Ashley,\nJust checking in w/ you. The veins on the side where I have my lump are prominent also (not on nipple area but close to underarm area) but it comes and goes (last time I had breast issues they were doing this). Calm down! It's nothing until they say it's something. I'm so sorry you are having to wait to get your mammo done. Were they also going to do an ultrasound? (I know big help that would do since they won't even get you in for your mammo). Just know I'm thinking of you. Try some of the evening primrose for the pain and aching. Give it several weeks to work. ~Miki~\nMy name is Miki my husband Bob- age 53 @ DX\nInitial PSA 8/14 was 4.1\nBiopsy 9-11-14\nInitial Results: 9/25/2014 -- 6 of 12 cores positive 3+3=6 (5%) 3+3=6 (5%) 3+3=6(3%) 3+3=6 (10%) 3+3=6 (40%) 3+4=7 (40%) \nPNI Left middle and Left lateral apex\nDaVinci RP performed 12-03-2014 Dr. Mooney, Little Rock, AR\nSurgical path downgraded to Gleason 6\nStage T2c one positive margin 30% tumor of prostate ",
      "MessageIndex": 2,
      "PostDate": "31/12/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3250557",
      "Title": "34 years old and just found a hard lump in right axilla."
    }
  ]
}