{
  "AuthorID": "auntkay",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=836168&p=7147",
  "Posts": [
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=836168&p=7147",
      "Content": "  I went yesterday and picked up my reports and film from my obgyn and the radiologist.The radiologist reports the following. Suspected benign findings within both breast of microcalcifications in the left breast and suspected one or two right benign intramammary lymph nodesand dilated ducts behind the nipple, recommend the patient have a six-month bilateral mammogram. I have made an appt. with a breast specialist just wondering should i keep the appt. this report doesnt sound to bad the bi-rads category 3 probably benign so what would you do. thanks, Kay ",
      "MessageIndex": 0,
      "PostDate": "14/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=836168",
      "Title": "If this was your report what would you think?"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=836168&p=7147",
      "Content": " Thanks Bev, and i will let you know how things go when i go back in oct. You ladies have been great and thanks for the advise and support. Hope you all are having a wonderful 4th hugs.. Kay! ",
      "MessageIndex": 10,
      "PostDate": "04/07/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=836168",
      "Title": "If this was your report what would you think?"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=836168&p=7147",
      "Content": " Well here it is October already and i have my follow up visit on the 23. I really hate all the suspence and how nervous i get. I'll just be glad to get it over with. I hope you all are doing well i'll post and let you all know how my 6 month mammo goes. Thanks for everything\n Hugs to all Kay ",
      "MessageIndex": 11,
      "PostDate": "03/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=836168",
      "Title": "If this was your report what would you think?"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=841019&p=7147",
      "Content": " gosh Sniper i wish i could offer up some advice, but i haven't gone thru to much myself. I have had to come and ask a few questions of my own to these wonderful women here. Everyone here has been very helpful and i'll keep you and your wife in my prayers. Take care, Kay ",
      "MessageIndex": 1,
      "PostDate": "20/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=841019",
      "Title": "need advice Please"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=836168&p=7147",
      "Content": " It's the 23rd and i had my appt. today he said the right breast looks better than it did back in july. I'm having to wait on results from the radiologist on the left breast he did point out some calcifications in the left breast and said he'd see what the report says and we'd go from there. So now it just a waiting period again bummer i hate waiting if the report is good he wants to see me again in 6 months. Does that sound like standard procedure to you ? \n Thanks for letting me come here and vent Kay ",
      "MessageIndex": 13,
      "PostDate": "23/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=836168",
      "Title": "If this was your report what would you think?"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=798248&p=7147",
      "Content": " Hi everyone, my name is Karen and i've been a member of hw since 04. I usually post on the crohns forum but have a few questions regarding some breast issues i'm having. I really hate to admit that i waited 10 years between mammo's and gyn visits due to the lack of insurance. I just recently got insurance that covers gyn visits so i made an appt. and my doctor had me to do a mammo while i was there. I got a call from my doctors office said they saw an area that need to be looked at better so she had me see a radiologist. I get to the radologist appt. and the girl does another mammo shows the doc he see's something so he has her do it again . I winded up having 3 mammo's and 2 ultrasounds. The radiologist said that i have a nodule under the right nipple and he'd send the report to my dr. office. My doctors office called and said the report showed that i also have enlarged ducts along with the nodule. Well yesterday i recieve a letter from the radioligst saying they want to see me again in 5 months to make sure the area is stable. My question is have any of you had this happen and if so what was the outcome. I'm trying really hard to not get worried but i just feel like i'm in limbo if you know what i mean. Thanks for letting me come here and vent a little. I have to say i have been lurking around and reading the post here you all seem to be such a wonderful group of ladies. thanks so much Karen. ",
      "MessageIndex": 0,
      "PostDate": "29/04/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=798248",
      "Title": "Just a few questions"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=798248&p=7147",
      "Content": " Thank you all for the advise i was going to wait the 5 months out but my mom went to the doctor and she now has an area they want to look at again. I really got to thinking about\n everything and still felt uneasy. I decided to call my ob doc back and told her i wanted a second opinion. I now have an appt june 25th with a breast specialist better to go on and ease my mind. Thanks again will post with my results soon as i know them. Kay ",
      "MessageIndex": 6,
      "PostDate": "07/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=798248",
      "Title": "Just a few questions"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=836168&p=7147",
      "Content": " Thanks for the well wishes Gail, and i have to say thank god winters here are very mild to me it's the best time of the year for delivering the mail. Gma i like your saying and i'm doing all i can do to keep a positive attitude. Having one illness is enough for me so i'm predicting a good outcome.\nHugs Kay ",
      "MessageIndex": 6,
      "PostDate": "04/10/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=836168",
      "Title": "If this was your report what would you think?"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=836168&p=7147",
      "Content": " Thanks Bev and Gail guess i was trying to chicken out .I have an aunt who has had breast cancer and she told my mom that a breast biospy really hurts. So i was a little scared and letting my mind run wild. Gail i see you used to be a postal carrier thats what i do for a living.I live in the south and it's very rough on me this time of year with the heat we have here. I'll post again when i get the results . Take care ,Kay ",
      "MessageIndex": 8,
      "PostDate": "15/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=836168",
      "Title": "If this was your report what would you think?"
    },
    {
      "AuthorID": "auntkay",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=836168&p=7147",
      "Content": " I went to the specialist yesterday, he looked over all my films and did a breast exame. He said he agrees with the radiolgist report 100% and that i should come back in oct. for more test. So i'm pretty comfortable that every thing is benign thanks for all the advice, take care ladies, Kay ",
      "MessageIndex": 9,
      "PostDate": "27/06/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=836168",
      "Title": "If this was your report what would you think?"
    }
  ]
}