{
  "AuthorID": "ayisha89",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2995431&p=192570",
  "Posts": [
    {
      "AuthorID": "ayisha89",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2995431&p=192570",
      "Content": " Hello everyone i am new here and let me tell you a little about\n myself ... im a 24 yr old female from the northeast and im a college student married for one year. \nmy story.....\nFirst off i have always had problems with my periods and also very bad anxiety with depression through out my teen years. \nabout\n two years ago i had my gallbladder removed and i feel that's when all my problems started. i started getting very bad lower back pain with abdominal pain feeling like period cramping and this last for days. also sometimes it would have sharp pains all through out my back and abdominal like sudden pain. another thing is that after every time i eat something i go to the bathroom and it just comes out like water ( sorry gross i know). This also doesnt help since i have anxiety issues. Due to my lack of periods doctors did hormone tests and ultrasounds and find nothing wrong with my ovaries since i was freaking out that i could have OC because normally IBS and OC have the same signs. but since im young and have no family history of any reproductive cancers and the two ultrasounds being normal that i do not have OC that it can only be IBS but im have having a hard time believing that my anxiety can be causing all this pain and bathroom visits and of course lack of periods! please tell me if any of you have been through this! ",
      "MessageIndex": 0,
      "PostDate": "17/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2995431",
      "Title": "Overian Cancer scare or is it IBS im so lost !!! please help"
    },
    {
      "AuthorID": "ayisha89",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2995431&p=192570",
      "Content": " Thank you Merrida and Phoebe70 :/ \nI went to my gyn today and they said based on two ultrasounds showing nothing and not having any other factors plus my issues with anxiety etc that it is a different cause and said i do not need to do any further testing for OC..... when he first said it i felt oh no im not convinced yet you are just ignoring my signs.... but than im trying to tell myself that i need to stop googling and trust that they know what their doing. (easier said than done i bet you) (sigh) \nalso since i am over weight and having period issue they think i have pcos without having cysts on my ovaries? but started me on Birth control ..... also i did some research and a friend told me that drinking cinnamon tea couple times a day can help ibs and pcos so lets see if this helps along with my therapy if everything will get better and that nothing really bad is going on .... ",
      "MessageIndex": 6,
      "PostDate": "18/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2995431",
      "Title": "Overian Cancer scare or is it IBS im so lost !!! please help"
    },
    {
      "AuthorID": "ayisha89",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2995431&p=192570",
      "Content": " well like i said i always had the irregular periods so i always felt there was something wrong ....\nbut i think me getting married and wanting children in the future has made me wonder why i don't get my periods so i started searching my symptoms away \nthe doctors said i had ibs and so i searched and i have everything plus so i looked into it and i found forms about\n women thinking they have ibs but really they have ovarian cancer and how not to let your doctor tell your fine you know your body blah blah bc they say its a silent killer and all of this stuff so i started freaking out that for all these years i have been having cancer its slowly killing me etc..... \nas you can see i do have anxiety which i am trying to get treatment for ...... uuugh im so tired of worrying when i dont need too ",
      "MessageIndex": 7,
      "PostDate": "19/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2995431",
      "Title": "Overian Cancer scare or is it IBS im so lost !!! please help"
    },
    {
      "AuthorID": "ayisha89",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2995431&p=192570",
      "Content": " yeah i have been over there and this whole website has been helping me from freaking out all the time..... \ni have had blood work two ultrasounds and i was checked for all STD's and i just had a pap which im waiting for my results.... i think what worries me is that the doctors and hospital im going to dont make me feel like i can trust them ill be telling them things and i feel their not listening to me every time i go there they send to someone else to see someone different and its like burning a whole in my pocket if you know what i mean i feel so tired to going and not getting answers but more and more questions my husband keeps telling me im fine and that the hospital just wants the money ..... i just wish like people around me could understand my pain .... :-( ",
      "MessageIndex": 8,
      "PostDate": "19/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2995431",
      "Title": "Overian Cancer scare or is it IBS im so lost !!! please help"
    }
  ]
}