{
  "AuthorID": "Blondy28",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=470265&p=28906",
  "Posts": [
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=470265&p=28906",
      "Content": " \n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "17/04/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=470265",
      "Title": "Tomorrow"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=479465&p=28906",
      "Content": " Well, I'm not quite off the ledge, but I've taken a step back from the ledge, and now I have some questions.\n \n \n ",
      "MessageIndex": 3,
      "PostDate": "30/04/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=479465",
      "Title": "HER2 Positive"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=466138&p=28906",
      "Content": " Well, my surgery is scheduled for April 18, but at this point, I don't know if it's for a mastectomy of the right breast, or a bi-lateral.  I had an MRI last Thursday just to confirm the mammogram findings that the left breast was clear and lo and behold, there was a \"spot\".  I have an MRI-guided biopsy scheduled for early Thursday morning to find out what's going on in the left breast.  Just when I accept what's going on, it changes.  Whoever called this a \"rollercoaster\" was right.\n ",
      "MessageIndex": 0,
      "PostDate": "11/04/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=466138",
      "Title": "Surgery scheduled...but what for?"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=461149&p=28906",
      "Content": " I can finally breathe again.  I met with the surgeon yesterday, and his best guess is that I'm stage IIA.  My tumor is very small....approx. 1.27cm.  He said that while tumor size is not the final indicator, you are more likely to see node involvement with a larger tumor.  He said about\n 10% of the time you will see a small tumor wreaking havoc, but he doesn't think that's the case.  Because I'm thin, he was able to feel the nodes under my arm, and he said they feel perfectly fine.  He reminded that we won't know for sure until I have the surgery, but just his intuition has calmed me tremendously.  Please, if someone here had a tumor my size, and their cancer spread...don't tell me that story.  I know there are people who have fallen into that 10%, but I want to keep my spirits up.\nI have an appointment with the plastic surgeon tonight at 6:45, and my MRI is scheduled for 7:45 tomorrow morning.  Surgery should be sometime next week.\nI love the people I'm working with so far.  They couldn't be more responsive, and man oh man, are they good about\n staying \nopen late to see me quickly!\nThat's it for now...\nPam ",
      "MessageIndex": 0,
      "PostDate": "05/04/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=461149",
      "Title": "Great appointment"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=474780&p=28906",
      "Content": " Had my mastectomy last Tuesday.  I suppose it went well, but I wasn't happy to wake up to the news that the first node that was tested was cancerous, so they removed a \"string\" to test them.  I didn't have a great first night in the hospital, but slept well the 2nd night and came home on Thursday.  I even caught a couple innings of my boys' baseball game that night (I've never missed one of my kids' activities).  On Friday, the surgeon called to give me the results of the pathology report...the first node that tested cancerous was the only one...the other 5 they removed were fine.  The tumor was just over 1 CM, and the in situ was 7 cm.  So I'm stage IIA.  I'll find out ER/PR and her2 next week.\nI had a great day yesterday, but didn't sleep well last night, so today I'm not doing that great.  My stomach is pretty much fried from the meds, so I have to decide which is worse, the stomach irritation or the pain from the surgery.  At this point, it's a toss-up.\nI'm going to go get some rest...I'll post soon.\nPam\ndx DCIS, IDC 3/28/05\nRight mastectomy/expanders 4/18/05\nStage IIA - 1 node positive\n ",
      "MessageIndex": 0,
      "PostDate": "06/11/2017",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=474780",
      "Title": "I'm home"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=456238&p=28906",
      "Content": " I had my doctor's office fax over my pathology report, and it said I had \"invasive and in-situ ductal carcinoma, moderately to poorly differentiated.  In-situ is solid type with lobular extension.\"\n \n ",
      "MessageIndex": 0,
      "PostDate": "29/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=456238",
      "Title": "Moderately to poorly differentiated"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=479465&p=28906",
      "Content": " I swear, the original cancer diagnosis was easier to take than this.  I read about\n you guys living with ports and weekly treatments like you're going to the grocery store.  I'm not that strong...I can't take this.\n \n \n ",
      "MessageIndex": 0,
      "PostDate": "28/04/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=479465",
      "Title": "HER2 Positive"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=456876&p=28906",
      "Content": " Thanks everyone, for your words of encouragement.  I love reading about\n everyone's families and getting to know your backgrounds.\n \n \n \n ",
      "MessageIndex": 4,
      "PostDate": "31/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=456876",
      "Title": "I'm off the ledge..."
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=483840&p=28906",
      "Content": " I met with my onco on Tuesday, and here's the plan:\n \n \n \n \n \n \n \n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "04/05/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=483840",
      "Title": "Chemo/Herceptin"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=456876&p=28906",
      "Content": " ....thanks, everyone, for talking me off the ledge yesterday.  With each new bit of information I receive...especially when it's bad, I go through a whole processing period.  I just found out I have to go off the pill, which really stinks.  I get debilitating hormonal migraines, and my OB/GYN had just prescribed Seasonale so at least I would only get them 4 times a year instead of 13 times a year, and I didn't even get a chance to start the darned pack!\n \n ",
      "MessageIndex": 0,
      "PostDate": "30/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=456876",
      "Title": "I'm off the ledge..."
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=455201&p=28906",
      "Content": " A few hours ago, I got \"the call\", and I have breast cancer.  I wasn't in the frame of mind to ask a lot of questions.  What I do know is that the pathology report showed both in situ and invasive.  I have an appointment next Tuesday at 5:30 (my surgeon's on vacation this week) to go over everything.  They've also said I can come in anytime this week if I need to talk.\n \n ",
      "MessageIndex": 0,
      "PostDate": "28/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=455201",
      "Title": "It's cancer"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=466138&p=28906",
      "Content": " I probably should have clarified...I know what I'm scheduled for, but depending on what happens tomorrow, that could change. I would just like to wipe away all these \"what ifs\" and get on with it already!\nPam ",
      "MessageIndex": 4,
      "PostDate": "12/04/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=466138",
      "Title": "Surgery scheduled...but what for?"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=454426&p=28906",
      "Content": " Well, I just talked to the nurse practitioner, and she said I won't get results today either.  She was more specific about\n the delay.  She said the pathologist is doing some extra \"stains\" on the sample.  She couldn't tell me what the purpose of that was, but she said she'll call tomorrow and speak directly to the pathologist to see why he's running these extra tests, and she said I may not even know anything tomorrow.  She said I shouldn't read anything into the delay, because they have had samples that require extra stains that have come back benign.  Not sure I'm buying into that.  I'm no pathologist, but I'd think any extra \"processing\" of the sample is to gain more/more specific information.  Are there as many variations of a benign diagnosis as a malignant one that might require extra testing?\n ",
      "MessageIndex": 0,
      "PostDate": "27/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=454426",
      "Title": "More waiting...."
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=452469&p=28906",
      "Content": " My saga begins only 8 short days ago, although it seems like forever.  I woke up in the morning, and found a lump while I was taking a shower.  I had had my annual appt. with my OB/GYN only one week before, and she had given me a prescript\nion for a baseline mammo, so instead of calling her, I called the breast center directly to make an appointment.  They had me have her fax over a new order for a diagnostic mammo, which she did, and by 9:30 that morning, only 2-1/2 hours after finding the lump, I was having my mammogram.  They call you in about\n 20 minutes after the mammo to report the results.  I was a birad-4, with an indeterminate lump and 3 clusters if microcalcifiations.  They referred me to a surgeon, who called me at home at 8:00 that evening, and told me I really should be seen quickly.  He was booked solid for the entire upcoming week, and going on vacation the week after that.  He kept his office \nopen late for me Monday night (March 20), and, at that appointment, he was able to biopsy my lump and the calcifications right near it.  He was unable to locate the other two areas of calcifications on ultrasound.  After the exam and biopsy, he said there were an equal number of \"indicators\" pointing in each direction...e.g., the lump looked smooth in one view on the ultrasound, but in another view, the edges were jagged.  He said he really didn't have a strong pull one way or the other which way this one might go.\n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "24/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=452469",
      "Title": "How long for results?"
    },
    {
      "AuthorID": "Blondy28",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=461053&p=28906",
      "Content": " Chantry, I'm right behind ya, babe. So far single mast, pending results of MRI. I'll be losin' at least one next week. Let's exchange good vibes, OK?!\nPam ",
      "MessageIndex": 7,
      "PostDate": "05/04/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=461053",
      "Title": "Tomorrow's the day..."
    }
  ]
}