{
  "AuthorID": "cadilac-slc",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1108811&p=60522",
  "Posts": [
    {
      "AuthorID": "cadilac-slc",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1108811&p=60522",
      "Content": " \nhi sorry to ´listen to your fears. but if you asked me, although am not a doctor but i wil tell you is cancer cause this exactly the same way it happened to my mum untill we confirmed that it was acancer. we were so worried to loose my mum untill someone gave us information to somewhere in nigeria. there is a traditional clinic called ROOT CLEANSING clinic. we quickly secured nigerian visa and rushed my mum down there and after she spent 3 weeks there getting daily medication finally the cancer disappered without any operation. althougit costed money and time but what is money and time to compare life. try there and i garanttee with 99% it will be well. my mum is welthiernow than before. so good luck ",
      "MessageIndex": 5,
      "PostDate": "18/05/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1108811",
      "Title": "Question...please help"
    },
    {
      "AuthorID": "cadilac-slc",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=60522",
      "Content": " well is been quite long now that we went through these processes. to be updated on the whole information i need to contact my mum once more. but anyway i think what yoou mama need is to be healthy again. the procedure might be uninteresting to her i guess. just try there and see with your eye. life has no duplicate and i know how worried we were during this hard time of ours. cancer is a deadly sickness as we all know and is not advisable to delay. ",
      "MessageIndex": 15,
      "PostDate": "03/06/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1096635",
      "Title": "My Mom is diagnosed with Stage IV Breast Cancer"
    },
    {
      "AuthorID": "cadilac-slc",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1100626&p=60522",
      "Content": " hi sorry to hear what your dad is going through. just exactly what my mum went through untill somone gave us an info somewhere in africa where cancer is treated withouth any operation or surgery. they cure with roots. as we heard about\n that, we quickly rush to nigerian embercy in berlin and secure a visa and flown my mum down there. she spent nearly 1 month and got the treatment untill everything got disappered. so try there and i promise you that the cancer will be vanished. up till today my mum is helthier than before and we all are so happy about\n the result.i wish all the best\ncychi ",
      "MessageIndex": 4,
      "PostDate": "18/05/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1100626",
      "Title": "question about nipple drainage????"
    },
    {
      "AuthorID": "cadilac-slc",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=60522",
      "Content": " \nhi sorry to hear what your dad is going through. just exactry what my mum went through untill untill somone gave us an info somewhere in africa where cancer is treated withouth any operation or surgery. they cure with roots. as we heard about\n that, we quickly rush to nigerian embercy in berlin and secure a visa and flown my mum down there. she spent nearly 1 month and got the treatment untill everything got disappered. so try there and i promise you that the cancer will be vanished. up till today my mum is helthier than before and we all are so happy about\n the result.i wish all the best\ncychi ",
      "MessageIndex": 14,
      "PostDate": "18/05/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1096635",
      "Title": "My Mom is diagnosed with Stage IV Breast Cancer"
    }
  ]
}