{
  "AuthorID": "CDVILL",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3509438&p=228978",
  "Posts": [{
    "AuthorID": "CDVILL",
    "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3509438&p=228978",
    "Content": " All right so I realize that I'm totally screwed since I didn't have a clip placed during my stereotactic biopsy. I just really didn't expect it come back as cancerous. Surprise! I had a LARGE hematoma form during the 12 hours after biopsy....3.5 inches by 1.5 inches by 1.5 inches. Boy did that thing hurt as it was forming. \nI'm now a few days out from the biopsy and the stunning news and trying to figure out just exactly what to expect. The hematoma is \"amazing\" as the nurse said when she saw it, with the blackest black skin that I have EVER seen on anyone's skin. ...and the blackness covers almost my entire breast!\nI've heard that not much can be done until the hematoma shrinks...which doesn't appear to be happening very fast. It will be a week tomorrow and that bugger is STILL almost as large as it was after the biopsy.\nNow I'm a scientist by training and I tend to approach all problems from an engineering/scientist perspective. I'm trying to figure out just what exactly to expect from all this.\nSince my DCIS was determined to be high grade, comedo form and it is triple negative there is a great deal of concern. Sounds to me like something to be removed Immediately! But there is that darn hematoma and I didn't have a clip placed when the biopsy was done. \nI've transferred my care from our local hospital (who did the biopsy) to the Mayo Clinic in Rochester but my appointment isn't until October 26th. \nI'm not looking for encouragement or pat on the back in this post. I'm really looking for reality. What can I REALLY expect? Those triple negatives tend to be tricky buggers to eliminate! \nAnyone have any ideas? I'm not asking for medical advice....but really just what have others experienced in this situation? And what is commonly done...time tables, results etc.\nThank you, CDVILL ",
    "MessageIndex": 0,
    "PostDate": "04/10/2015",
    "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3509438",
    "Title": "Triple negative DCIS high grade AND hematoma from biopsy, no clip placed"
  }]
}