{
  "AuthorID": "CK from Florida",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2082597&p=128553",
  "Posts": [
    {
      "AuthorID": "CK from Florida",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2082597&p=128553",
      "Content": " Alcie,\nI hope something good comes your way. Thanks for sharing. Cindy ",
      "MessageIndex": 10,
      "PostDate": "08/08/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2082597",
      "Title": "femara side effects - loss of sex drive, vaginal dryiness and sensitivity et al"
    },
    {
      "AuthorID": "CK from Florida",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2082597&p=128553",
      "Content": " I have the same pain and dryness from Femara (and now Letrozle, the generic brand). I have been to three diff doctors, and they all say it's in my head. They deny that this could be from this drug. They are wrong. 2 weeks after taking Tamoxifin (which I was first on) , I had the most painful experience I had ever known. It felt like I was on fire. Lubricant only makes it burn more. Any lubricant burns even before attempting sex, just applying it starts a fire. I cannot use any soap in the shower, or it burns like fire. My female oncologist could only suggest Replens, a vaginal moisturizer. She said you had to use it regularly, not just before sex. She said it might take a week or two before it had a noticable affect. My female gyn didn't believe me, and a male gyn just gave me papers about\n Susan Sommers hocus pocus healing.  I have not had sex in two years because of the pain. All women out there....you are not crazing! It's a side affect whether anyone believes it or not! ",
      "MessageIndex": 8,
      "PostDate": "07/08/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2082597",
      "Title": "femara side effects - loss of sex drive, vaginal dryiness and sensitivity et al"
    },
    {
      "AuthorID": "CK from Florida",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2082597&p=128553",
      "Content": " Speaking of trigger finger....one of my toes went number right after beginning this drug. Then,  I kept stubbing it, and now, it's frozen and doesn't wiggle with the rest of my toes. But the pain is awful if I bump it.  Now the toe next to it is showing the signs of doing the same thing. I also discussed this with my oncologist who said it had nothing to do with chemo, but now I'l thinking it's the Femera. Anyone else have problems with their toes? ",
      "MessageIndex": 9,
      "PostDate": "07/08/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2082597",
      "Title": "femara side effects - loss of sex drive, vaginal dryiness and sensitivity et al"
    }
  ]
}