{
  "AuthorID": "cujlm",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=61677",
  "Posts": [
    {
      "AuthorID": "cujlm",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=61677",
      "Content": " \n \n ",
      "MessageIndex": 4,
      "PostDate": "14/04/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1096635",
      "Title": "My Mom is diagnosed with Stage IV Breast Cancer"
    },
    {
      "AuthorID": "cujlm",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=61677",
      "Content": " Dear all,\nThe report came out yesterday. It is a poorly differentiated invasive ductal carcinoma. Signs of early metastasis are found in the lung. It said it is almost consistent with the signs of a recurrence. We are still waiting for the hormone report to see which drugs should be used.\nI have reservation with Chemo is because I wish no further pain will be inflicted on my mom, and also it guarantees no improvement even after series of excruciating treatments. Anyway, I will accept my doctor's recommendations and start with whatever he suggests at whatever the cost. I am just concerned whether we should use Chinese medicine as complementary treatment for rejuvenation during chemo. Worried about\n possible complications with Western and Chinese combination. I feel inclined to Chinese Medicine after reading all those report on the web and the experiences of my friends, though they may not be verifiable.\nPlease kindly give me any advice on these. Also what should I ask the doctor whenever I consult him? I am afraid of asking the wrong questions and waste our time. I just feel disoriented.\nA million Thanks ",
      "MessageIndex": 3,
      "PostDate": "14/04/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1096635",
      "Title": "My Mom is diagnosed with Stage IV Breast Cancer"
    },
    {
      "AuthorID": "cujlm",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=61677",
      "Content": " A Chinese Medicine Practitioner suggested photodynamic therapy from my mom and said it is definitely a cure. It cost about\n HK$ 90000-120000 per session and usually involve 3 sessions. Can anyone comment on this and give me some suggestions?\n \n ",
      "MessageIndex": 5,
      "PostDate": "15/04/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1096635",
      "Title": "My Mom is diagnosed with Stage IV Breast Cancer"
    },
    {
      "AuthorID": "cujlm",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=61677",
      "Content": " Thanks all your advice.\nMy mon was first diagnosed with breast cancer back in 1991/92. She had her right breast removed surgically and underwent sessions of chemotherapy later. A year and a half ago, she found her right arm go limp and suspected a recurrence. So she consulted a few doctors who said it was probably related to the bones and nerves and operated on her joint areas. they also said there were a black spot on my mom's lung but they said it was okay. \nbut her arm got worse after surgery, and right now she can hardly grasp or hold a thing. It goes limp and numb. And she found some lumps in her right breast a month ago. We saw another doctor, and after all these X-ray, MIR, biopsy and PET Scan, he suspected it was either a stage IV recurrence or even a new type of cancer. We will be getting the core needle biopsy report this morning. Also he said only hormonal therapy or chemo is suitable, for the cancer is inoperable, already spread to lung, ribs and lymph. Early signs of metastasis in the lung.\nI am not sure if chemo is okay with mom (whether it is too expensive with no clear improvement guaranteed I am not sure) and I am thinking about\n chinese medicine. Too many questions and too many options. I am just despearate.\nPlease kindly give me any advice. Thank you all. ",
      "MessageIndex": 9,
      "PostDate": "13/04/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1096635",
      "Title": "My Mom is diagnosed with Stage IV Breast Cancer"
    },
    {
      "AuthorID": "cujlm",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=61677",
      "Content": " Dear all,\nthanks for all your advice.\nMy mom will start FAC chemo on the coming Mon. Doc siad her hormone report is pretty encouraging and it may go well with just chemo. If chemo fails, he thinks Femara (Not sure about\n the spelling) can work well. I am still looking for Chinese medicine practitioner to seek further opinion on her treatment. Hope all go well. and please keep me updated. Thanks. ",
      "MessageIndex": 6,
      "PostDate": "19/04/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1096635",
      "Title": "My Mom is diagnosed with Stage IV Breast Cancer"
    },
    {
      "AuthorID": "cujlm",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1096635&p=61677",
      "Content": " Good to find this forum.\nI am from Hong Kong.\nMy mom is diagnosed with recurring Stage IV Breast Cancer in her first Biopsy. She has just completed her second biopsy because her doctor is not sure whether it is really a recurrence or new cancer. The report will be ready tomorrow.\nCan you all give my some advice on this? I am now desperate about\n what treatments should be adopted. On one hand, chemotherapy is too expensive and aggressive, and on the other hand, I am not sure if we can just depend upon Chinese Medicine. I am thinking a combination of both but learning about\n the meagre 10% 5-year survival rate, it brings out my tears... ",
      "MessageIndex": 0,
      "PostDate": "13/04/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1096635",
      "Title": "My Mom is diagnosed with Stage IV Breast Cancer"
    },
    {
      "AuthorID": "cujlm",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1108325&p=61677",
      "Content": " Hi, This is john from HK. Thanks all your advice and encouragement.\nAs mentioned earlier, her pathologist's report showed that she was ER+, PR-and HER2+(weakly). The doctor suggested that we should go ahead with CAF chemo, and tried out Femara later.\nMy mom had its first chemo last week, and she has been extremely weak during these days.\nAns I am now reading a book called\"Advanced Breast Cancer--A guide to living with metastatic disease\" by Musa Mayer. Hope I might get new insights from reading it.\nPls keep me informed about\n updated treatment. And I wish you all triumph during this journey. ",
      "MessageIndex": 0,
      "PostDate": "25/04/2008",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1108325",
      "Title": "Updates on my mom"
    }
  ]
}