{
  "AuthorID": "Datawraith",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2720187&p=128140",
  "Posts": [
    {
      "AuthorID": "Datawraith",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2720187&p=128140",
      "Content": " Hello everyone,\nI usually frequent the Crohn's disease forums but I am here in the hopes to be able to help my mom out.\nShe had been diagnosed with breast cancer last August, 7cm lump, stage 3, lymph nodes affected and 2 lung nodules.\nShe's finished up her chemo, has had a mastectomy and now currently under going radiation treatments. Everyday, 6 weeks and has 2 weeks left.\nHer disability has run out because NJ has a max limit of 6 months on disability when filed through the state.\nMy mom is currently on hold, 27 minutes for the dept. of labor after we placed a call to a number provided for information in a letter received that notified her of the disability claim/payments coming to an end.\nThe person who answered the phone was based out of Seattle, don't ask, I don't know how that happens. She didn't believe my mom was who she said she was, said, \"you sound too young.\" This is after providing requested credentials. \nI have a friend that was diagnosed with lung cancer over a year ago and she did inform me that NJ's disability is 6 months, max. I spoke to her last week and she said my mom could claim unemployment, which my friend did and my mom does have a balance to be able to collect unemployment.\nHas anyone been in a similar situation that may be able to provide some insight? It would be greatly appreciated.\nP.S. My mom does collect SS currently, she started at the age of 62 I believe, she's now 66.\nSorry for the brevity of my post but I'm typing this up as we're being bounced around from person to person, number to number and wait times of 30 minutes.\nShe does have a job as well that she planned on returning to in September. ",
      "MessageIndex": 0,
      "PostDate": "03/05/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2720187",
      "Title": "State (NJ) Disability- breast cancer/stage 3"
    },
    {
      "AuthorID": "Datawraith",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2720187&p=128140",
      "Content": " Hi Judy2, thank you for the response.\nMy mom was still working when diagnosed, still has a job to return to and plans on doing so in September. The reason she received disability was due to her not being able to work. \nOnce she was unable to work, I contacted her employer to see if they offered a private, company provided plan for disability. Something I would have been somewhat familiar with as I had an issue with ERISA, when you received disability through an employer's disability plan.\nMy mom's current employer has their disability through the state of NJ. \nEverything required to receive disability through the state had been provided, she has already received disability through the state of NJ. There were no short cuts made, no shenanigans if that thought is now passing through someone's head.\nMy mom started to receive SS at the age of 62 and continued working as well. ",
      "MessageIndex": 1,
      "PostDate": "03/05/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2720187",
      "Title": "State (NJ) Disability- breast cancer/stage 3"
    }
  ]
}