{
  "AuthorID": "Di100",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3126269&p=201784",
  "Posts": [
    {
      "AuthorID": "Di100",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3126269&p=201784",
      "Content": " I asked if I should have core biopsy as I thought the reason for surgeon was insufficient material collected on fna.My doctor said cells collected were from only one part of cyst and surgeon now needs to do incisional biopsy to remove all the cluster,At this stage there is no overtly malignant cells from fna.This is where I am so confused.I thought I had only had one tiny complex cyst.everything I have read tells me cysts are not generally cancerous,so I don't understand why I have to see surgeon and was concerned that cancer could develop within the waiting time to see surgeon.It is more the stress factor on having to wait the eleven months for anything to be done. ",
      "MessageIndex": 1,
      "PostDate": "09/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3126269",
      "Title": "Breast screening"
    },
    {
      "AuthorID": "Di100",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3126269&p=201784",
      "Content": " Thank you very much for replying so quickly.I feel much better :) Doctor thought I would be seen at hospital within the month so was very surprised on how long I have to wait as she had classed it as urgent.After a month of waiting I was starting to get very teary at the drop of a hat so tried this forum to try and get some feedback...this is all new to me. Will wait til I get called and in the meantime my doctor has ordered mammogram,ultrasound and fna if necessary on the right breast so I will have all the records for when I do see surgeon.Thank you very much for your help. ",
      "MessageIndex": 2,
      "PostDate": "09/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3126269",
      "Title": "Breast screening"
    },
    {
      "AuthorID": "Di100",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=3126269&p=201784",
      "Content": " Hi.I have recently had mammogram,which led to ultra sound which showed cysts in left breast.six months later second ultrasound showed complex cyst.Had a fna done which showed debris,anucleated sqames and poorly preserved epithelial cells.Was referred to surgeon.Just heard I will be on waiting list for eleven months.Should I be concerned about\n this.I just want a yes or no answer on whether it is,or could become cancer.Very stressfull ",
      "MessageIndex": 0,
      "PostDate": "08/07/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=3126269",
      "Title": "Breast screening"
    }
  ]
}