{
  "AuthorID": "FRANKEE",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=444452&p=28486",
  "Posts": [
    {
      "AuthorID": "FRANKEE",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=444452&p=28486",
      "Content": " Candy:\nIf you have any questions regarding Denise Rowles, please Email me at joannewood2006@aol.com. I realise this is upsetting to genuine forum members but Denise is well and truly alive, has never had breast cancer or indeed had a stroke. She lives in Cwmbran, S. Wales with her 3 children. I have read through past posts including her 'death' and 'Obituary' with utter shock and disbelief. This matter is close to my heart as my brother is in the process of a divorce from her and is most distressed as this website was only accessed 'by accident' and had no idea of these hideous fabrications.\nFRANKEE ",
      "MessageIndex": 9,
      "PostDate": "15/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=444452",
      "Title": "Administration"
    },
    {
      "AuthorID": "FRANKEE",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=444452&p=28486",
      "Content": " Could we possibly be talking about\n 2 different people? I will try to verify the 'Denise' who's death and obituary was posted on 7/22/2005. The post noted Denises death from a stroke and printed her address in case anyone wished to send cards this was 16 Tern Court, Cwmbran, she still lives there. Her mothers name is Pam and she has a sister named Beth. She has 3 children Dion, Tegan and FFion who were all named on her 'Obituary' Her birthday is 01 Nov and her age was noted. All of the above details were posted on the site which lead me to beleive that this really is the person I know. Further verification takes the form of her obituary which reads:\n Rowles\n Denise Alison \nPeacefully after a brave fight against cancer on 20th July 2005 at Abergavenny Hospital. Denise aged 33 years of Cwmbran. Dearly loved eldest daughter of Pam. Much loved mammy of Dion, Tegan and Ffion. Loved sister of Beth, Wayne and Owain. Memorial service Monday 25th 2005 at 12.30 at Park Street New Life Church, Blaenavon followed by a cremation at 2pm.\nThe above was posted on 7/11/2005. I realise that this is deeply distressing and would like to apologise if the 'Denise' noted above has been mistaken for another Denise. I hope the above will verify this. ",
      "MessageIndex": 11,
      "PostDate": "15/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=444452",
      "Title": "Administration"
    },
    {
      "AuthorID": "FRANKEE",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=444452&p=28486",
      "Content": " \n \n \n \n ",
      "MessageIndex": 15,
      "PostDate": "16/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=444452",
      "Title": "Administration"
    },
    {
      "AuthorID": "FRANKEE",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=444675&p=28486",
      "Content": " Thankyou to everyone who replied to this post.  I would like you to understand why this distressing topic was posted on the forum.  Sometimes desperate times require desperate measures and I debated for quite a while whether to 'dig up the past' and inform members that Denise is still alive, this is because she has caused so much distress to a lot of people and still is at large now.  I ask for your understanding on this matter as I know full well that this forum and the members of it are genuine people and suffers that I can only regard with the highest respect for what you are and have been through.\n \n \n \n ",
      "MessageIndex": 1,
      "PostDate": "16/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=444675",
      "Title": "News from Wales - Denise Rowles (prettylady/denisesmam)"
    },
    {
      "AuthorID": "FRANKEE",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=444675&p=28486",
      "Content": " Forum members\n ",
      "MessageIndex": 0,
      "PostDate": "15/03/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=444675",
      "Title": "News from Wales - Denise Rowles (prettylady/denisesmam)"
    }
  ]
}