{
  "AuthorID": "immizliz",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=899852&p=42298",
  "Posts": [
    {
      "AuthorID": "immizliz",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=899852&p=42298",
      "Content": " Thanks ladies! I guess I'll take my mom's word that everything is alright and what you two have said about\n the reasons she could be becoming emotional make sense,I do know what it is like just waiting to see if something comes back and should have thought about\n that possibly being why she has been down.I do think(or maybe I am just hoping) if something else had turned up she would have said something to me about\n it. Thanks so much and take care ",
      "MessageIndex": 3,
      "PostDate": "28/08/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=899852",
      "Title": "Should I worry?"
    },
    {
      "AuthorID": "immizliz",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=899852&p=42298",
      "Content": " Hello all,my mom (56 yrs) went for a routine mammo in May and found out she had breast cancer,had 2 surgeries to remove what they could see and has been going to radiation .She only has 1 week left and now they had her treatment increased,a close friend of hers told me that my mom got very emotional the other day when telling her about\n this,my mom insists that she has not been told anything is wrong but I am wondering if she is holding back from telling us something.We are not extremley close but she did originaly have me go with her to all her doc appointments when the first mammo came back as not normal so I would think that she would let me know if things were not working out well.What do you all think about\n this increase in the radiation with only 1 week left to go,is that normal? ",
      "MessageIndex": 0,
      "PostDate": "25/08/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=899852",
      "Title": "Should I worry?"
    }
  ]
}