{
  "AuthorID": "Isitibc",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2671634&p=166230",
  "Posts": [{
    "AuthorID": "Isitibc",
    "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2671634&p=166230",
    "Content": " I'm 53post menopausal, and I started having breast pain and swelling early January. It had been a 1 1/2 years since last annual and call GYN for appt to get mammo (need referral). I had to wait two weeks for appt. (1/25) and it got worse. My breast were swollen like I was pregnant and the itching was terrible.\nMy breast were still extremely painful and after I made appt and before I saw him, I googled swollen painful itching breast and IBC was there. I expressed concern. After exam he said there was thickening around nipple and wanted to refer breast surgeon and in mean time get mammo. \nI almost passed out from pain during mammo it hurt so much. They called and said there was ductal issues?..and I should get ultrasound. I did and she focused on extremely small area and said there was cyst and did I want to aspirate. I asked if it was biopsied ans she said no and so I said no. The pain had subsided by this time and I was less concerned.\nSo I see the breast surgeon on 2/14 and there are three students doing exam. Ok...so finally doc comes and says opposite breast is discolored with some thickening, but to take vitamin e, wear sports bra and come back in 3 months.\nI still have swollen breast, not as bad, I have stabbing pain in nipple, I wake at night from pain, area above collarbone is swollen and now neck is swelling and headaches coming on in base of skull. I also a very small amount of purple discharge in my bras.\nI called breast doc and nurse said they were not checking for IBC and I should call primary with gland swelling and headaches.\nI keep telling myself that if it is IBC it will get worse. So...I'm I'm waiting, but wondering...\nIt seems seems everything is small, but also that it adds up...\nPlease let me know your thoughts. Thankful! ",
    "MessageIndex": 0,
    "PostDate": "13/03/2013",
    "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2671634",
    "Title": "IBC concern"
  }]
}