{
  "AuthorID": "Jenisis",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=883191&p=49807",
  "Posts": [
    {
      "AuthorID": "Jenisis",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=883191&p=49807",
      "Content": " Hello Ladies. I'm here from the Lyme disease section of this site, and decided to look around and see what people are experienceing with their personal battles. This is the first forum I've come to just to give well wishes and to tell you all to please, oh please stay as possitive as you can. To all of the sufferes, to ones that we've lost, and to the ones that are unsure, and have just been diagnosed. My heart goes out to you,I will share your pain, but I'll also share my energy and light with you, and pray that peace and healing stays with you every stap of the way. My Aunt died 2 years ago from this awful, ridiculous, filthy disease. She was working on trying to get pregnant at 38, but instead a lump was found and she had one of her breast taken away from her...2 weeks later, another lump was found and all of her female reproductive system  was taken from her. Needless to say, her dream of being a mother went away at that point. She did great for 1 year until the day came that she found another lump on her shoulder. I was told she smirked, looked at her husband and said \"My battle is over, the disease won, checkmate.\" 1 week later, she left this Earth. Too many times we hear horrific stories of courageous, strong willed women losing ther battle with this evil thing called breast cancer. I wish Cancer in general could be eradicated, \"But why control it, when it controls the population?\" Says the government. \n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "04/08/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=883191",
      "Title": "Hello Ladies, just visiting"
    },
    {
      "AuthorID": "Jenisis",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=883191&p=49807",
      "Content": " Thank you so much :)\n ",
      "MessageIndex": 1,
      "PostDate": "10/08/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=883191",
      "Title": "Hello Ladies, just visiting"
    }
  ]
}