{
  "AuthorID": "Jenna44",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1161666&p=60547",
  "Posts": [{
    "AuthorID": "Jenna44",
    "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1161666&p=60547",
    "Content": " HI, \nNew to this board, I have chatted on the Hep C board as my sister has it and I am her Health Care proxy. \nI am pretty nervous, and thought maybe I would find some answers here. \nI had a yearly mammogram on Wed Morning and headed off to work, got out at 6 and had a message on my cell phone from my Dr office, of course it was now after hours, \"The Hospital called and they want a second Mammogram as they found a uhm, something on your upper quadrant, \" and the phone went dead. No second message, Ye Gads! What a message, that girls in the office needs training!\nSecond mammograms are not new to me as I have dense breast and was referred to a Breast Care Center 4years ago as they found calcifications in my left breast and with them being so dense they wanted a specialist too take a look. That went fine and they recommended that I have yearly mammograms even though I was just 40 at that time. I have taken that advise and this is the first time that I have had to have a second look since as they have my previous records and they go against them. So I did not stress too much Wed night, and thought it was probably more of the same/ Thursday morning I go to the Dr office for the rest of the message, and it is nodule in my left upper quadrant and they want addition views. Monday I have the second Mammogram. They have never called anything a Nodule before and the nurse seemed like this was more serious.. and I am starting to get nervous that maybe those calcifications were the beginning of something much more :( \nAlso I have been complaining of a sharp pain in my left breast that I have been writing off as gas or something. \nI feel nothing and I am gonna wear a whole in my breast looking for something...LOL. Am I crazy to be worrying here? ",
    "MessageIndex": 0,
    "PostDate": "21/06/2008",
    "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1161666",
    "Title": "Mammogram Wed"
  }]
}