{
  "AuthorID": "karilyn",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360815&p=23111",
  "Posts": [
    {
      "AuthorID": "karilyn",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360815&p=23111",
      "Content": " Hey Folks - Midday I started getting that helpless grief feeling so I got into my car and drove. I wound up at a friend's home ... flukey but both she and her husband were also off work today ... we laughed and joked and I had an early supper with them - he cooked while my friend and I watched Oprah. Afterwards I went for a 10 dollar shampoo and style. I just had my bath and I am going to get under a comforter and watch some Mon night TV with my cats ... Thanks Thanks Thanks for being here. It is Mon night now - closer to Wed ... Take Care ",
      "MessageIndex": 7,
      "PostDate": "14/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=360815",
      "Title": "2 cm palpable hard, irregular lump - waiting 2nd mammogram"
    },
    {
      "AuthorID": "karilyn",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360815&p=23111",
      "Content": " Thanks Folks - It is so good to read your replies ... yeah here in Halifax NS I guess you have the 1st mammogram and then if there is something suspicious you are sent for a 2nd \"diagnostic\" mammogram at the major hospital ... And just to clarify my GP is on top of this (she is new to me - I had only seen her once before she called me in last week ... and she called me in asap after the Breast Screening Clinic contacted her with the results from last Wed's mammogram). \n \n ",
      "MessageIndex": 14,
      "PostDate": "11/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=360815",
      "Title": "2 cm palpable hard, irregular lump - waiting 2nd mammogram"
    },
    {
      "AuthorID": "karilyn",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360815&p=23111",
      "Content": " Hi Folks - Yeah Tavis you have such a good point that Wed will not mean answers for me ... it'll mean more waiting and I have cautioned myself to figure out how to pace myself ... ... I am not coming up with any answers re: pacing yet and that has unsettled me too . I guess I am just hoping that after the Wed afternoon of tests (that's tomorrow) I'll somehow catch my 2nd wind in order to wait for the results. This morning at 7:30am I wound up taking off work until Friday - I struggled and agonized making this decision ... feeling like I am \"faking\" sick or \"wimping out\" . Then I realized/admitted to myself that the plain old fact of the matter is this -  I have been absolutely swept off my feet with fear from this experience. I am blown away and driving myself wild trying to get on my game face for work is not working for me. In fact it is somehow making it all feel even worse ... I have sick time, my work will wait and bottom line I am emotionally zapped - period. I hope that on Fri after having the Wed tests and the 4 days off I will get up and go in to work. Then I'll be off on the weekend and I'll take care of \"moi\" boost boost boost and on Mon I will get up and go in to work ... and so on ...Thanks You guys Thanks And Take Care ",
      "MessageIndex": 21,
      "PostDate": "15/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=360815",
      "Title": "2 cm palpable hard, irregular lump - waiting 2nd mammogram"
    },
    {
      "AuthorID": "karilyn",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360815&p=23111",
      "Content": " Ok Folks - I am baffled now ... and wow can stress ever wear you down ... On Tues night after waiting all week for Wed to arrive I recheked my notice of my appointment for the floor at the hospital ... So at 10:30pm on Tuesday night I realized that my appointment was on Tues Nov 15th and not Wed Nov 15th cause Wed is the 16th vs 15th of Nov - I had my days mixed up ... (YES I missed my appointment!!!!!!)\n ",
      "MessageIndex": 23,
      "PostDate": "17/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=360815",
      "Title": "2 cm palpable hard, irregular lump - waiting 2nd mammogram"
    },
    {
      "AuthorID": "karilyn",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360815&p=23111",
      "Content": " Called in sick (or I'll take a vac day). Oooh, I shampooed, bathed and had the clothing ready last night ... then just like that and even before the alarm I called in. Jeeze - I did not plan it - it was like a reflex. Post call I can say I feel sick to my stomack, like cement I am so stiff in the shoulders but whew it is emotion and fear vs anything else behind that call in ... I don't hvae more tests till Wed and there will be more waiting time after it ...I can not call in everyday ... Oh jeeze ... Later All Take Care ",
      "MessageIndex": 6,
      "PostDate": "14/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=360815",
      "Title": "2 cm palpable hard, irregular lump - waiting 2nd mammogram"
    },
    {
      "AuthorID": "karilyn",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360815&p=23111",
      "Content": " \n ",
      "MessageIndex": 12,
      "PostDate": "11/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=360815",
      "Title": "2 cm palpable hard, irregular lump - waiting 2nd mammogram"
    },
    {
      "AuthorID": "karilyn",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=360815&p=23111",
      "Content": " Hey Folks - Thanks for all the words and support ... I have seen 2 movies at the theatre already this weekend ... and last night I spent hours at a friend's house - with 3 wild hyper and noisey kids of my friend's.  All attempts to keep my mind free from repeatedly worrying ... until I make it to Wed and the 2nd mammogram ... breath in breath out one after another, eh. Felt like skipping the bath tonight too but I did not cause I knew it was just a fear-paralysis thing that I have to resist.\n \n ",
      "MessageIndex": 17,
      "PostDate": "12/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=360815",
      "Title": "2 cm palpable hard, irregular lump - waiting 2nd mammogram"
    }
  ]
}