{
  "AuthorID": "kyka1234",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=239705&p=15679",
  "Posts": [
    {
      "AuthorID": "kyka1234",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=239705&p=15679",
      "Content": " Thanks so much Mary - Debbie is 54 and in Seattle right now undergoing her chemo - we live in Alaska. She is flexible regarding help in other areas of the US and has just asked for assistance from me. Yes - it's actually in her upper arm/shoulder area. I appreciate you getting back to me and hope to get some information - this is a great way to find support!\nSandy ",
      "MessageIndex": 1,
      "PostDate": "25/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=239705",
      "Title": "Brachial Plexus Metastasized Tumor"
    },
    {
      "AuthorID": "kyka1234",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=239705&p=15679",
      "Content": " Hi Laure' - thanks so much for the info this morning! I will print it off as I am traveling to Seattle today to spend some time with them. It's great to get names for info so this has been a great help! It's a place to start as I do feel helpless sometimes darn it. I appreciate your sharing and wish you and your hubby good health! Take care and God Bless!\nSandy ",
      "MessageIndex": 5,
      "PostDate": "26/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=239705",
      "Title": "Brachial Plexus Metastasized Tumor"
    },
    {
      "AuthorID": "kyka1234",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=239705&p=15679",
      "Content": " My sister is being treated (third time) for breast cancer Stage IV now and having a rough go at this time. The doctors say it's a metastasized tumor in the brachial plexus with peripheral (sp) nerve damage. Looking for information on a Neurosurgeon that might specialize in this area. Any information or any type of help is appreciated. Thank you. ",
      "MessageIndex": 0,
      "PostDate": "25/04/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=239705",
      "Title": "Brachial Plexus Metastasized Tumor"
    }
  ]
}