{
  "AuthorID": "lemonpie",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2915379&p=185736",
  "Posts": [
    {
      "AuthorID": "lemonpie",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2915379&p=185736",
      "Content": " I'm twenty three, and admittedly a hypochrondiac. I'm always fearing I'm dying somehow. I found a lump. I'd worried that maybe I had them before, but this time when I felt it, I knew this was one. I went to the doctor the next day. He found it too and said \"Oh... That's quite large.\" I suddenly felt empty. He scheduled me to have a mammogram in two weeks. ... All very well and good but. I can't take the waiting. It's the day after and I just... Everyone tells me it'll be fine the chances are in my favour, they've PROMISED me it'll be okay, but how can anyone promise that? Young or not, there's always the chance it could be... I've been trying to distract myself, but whenever I'm forgetting about\n it or feeling fine something horrible happens, like I feel like I'm going to pass out, or my whole body gets number and number. I don't want to eat, I don't want to do anything. I just want to sleep until I know. I'm just scared. ",
      "MessageIndex": 0,
      "PostDate": "22/11/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2915379",
      "Title": "Waiting for mammogram"
    },
    {
      "AuthorID": "lemonpie",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2915379&p=185736",
      "Content": " Thanks guys... Trying not to panic but then I keep having other symptoms that make me think it's cancer and it's already spread and is getting other places of my body. Especially since he said it was big. Like the IBS like symptoms I've had for ages. Having tarry stools now... Really not what I need at a time like this. \nSorry if it sounds like I'm whining or anything. Makes me feel better to hear from you guys who've been in the same situation. ",
      "MessageIndex": 3,
      "PostDate": "23/11/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2915379",
      "Title": "Waiting for mammogram"
    }
  ]
}