{
  "AuthorID": "Livin' in Louisville",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1461099&p=82525",
  "Posts": [
    {
      "AuthorID": "Livin' in Louisville",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1461099&p=82525",
      "Content": " \n \n \n \n \n \n \n \n \n \n \n \n \n ",
      "MessageIndex": 5,
      "PostDate": "14/05/2009",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1461099",
      "Title": "Tamoxifen Side Effects"
    },
    {
      "AuthorID": "Livin' in Louisville",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1461099&p=82525",
      "Content": " Congrats on finishing your treatments! My 3 year anniversary of my last treatment will be on July 18 th!   I had a lump in my left breast and had a partial mastectomy, chemo and radiation. I too am on Tamoxifen. Have been for almost 3 years. My body has always reacted very sensitively to medication so when I started taking Tamoxifen it was a real shock to the system. Hot flashes, night sweats, body aches, leg pains, and the lovely weight gain! (Which will not go away no matter how much you try to diet and exercise!) Luckily no hair loss. That was awful enough from chemo. That grew back great. Faster and stronger than ever. Eyelashes and brows came back within a few weeks after finishing chemo.   I had to wean my body on to the Tamoxifen. I was supposed to take 20mg a day. Tried that and just got too sick. Then I had the doctor prescribe it in 10mg pills instead of the 20mg. I then cut the 10mg pill in half with a pill cutter. After that I started introducing it slowly into my body. The first week I took half of one of the 10mg pills or 5 mg. The second week I took a whole 10mg pill. The third week I took a whole 10mg pill and a half of one for a total of 15mg. And then the final week I took 2, 10mg pills and my body tolerated it after that. I still get the pills in the 10mg strength and take 2 a day. My oncologist said this was a great way to build up to it and he would recommend it to his other patients. No one suggested this to me, I just had to come up with a way to get used to it slowly and it worked. They wanted to put me on a host of other meds to counteract the side effects of Tamoxifen, but who needs to take antidepressants, and things like that. I am naturally a very happy person. Hate having to take any meds at all, so I surely was not going to add more to my body and deal with all their side effects too! Perhaps if you are having a bad time getting your body to tolerate Tamoxifen, that may be a way for you to introduce it slowly into your system. Your body does get used to it pretty quickly and the symptoms do lighten up. Hope this helps!   The weight gain is my main concern. I gained 20+ pounds so fast and I just can not get rid of it. I have the dreaded “Tamo Tummy” and looks like I am pregnant. I have always been very fit and trim (about 125 pounds) and having all this excess body fat around my mid section now is driving me crazy! I have rolls of fat on my sides and puckers on my arms and legs and hold water like crazy. I hate how chemo and Tamoxifen have changed my body so dramatically. Chemo threw me into instant menopause and the hot flashes started almost immediately. The Tamoxifen really added fuel to the fire, literally! Funny how they say that being overweight or having excess body fat can be a contributor to getting breast cancer, and then they give you a drug that makes you gain weight! Where’s the logic in that. I will be more than glad to not take it anymore and hopefully be able to get my figure back. The only way to even lose a little weight is to totally not eat any white foods and barely any carbs, my body will just not metabolism them anymore since my treatments. Hope others out there are having a better time with this than I am, but you know what I always tell people, “At least I am still alive to B**CH about it! If you have any suggestions for getting rid of body fat induced by medication, let me know!   Good luck to all of you out there who have just finished treatments, are just starting treatments or maintaining your good health. My thoughts and prayers are with all of you. It’s a tough battle, but with the support of others and a strong belief in yourself, you will be amazed what you can accomplish! ",
      "MessageIndex": 4,
      "PostDate": "13/05/2009",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1461099",
      "Title": "Tamoxifen Side Effects"
    }
  ]
}