{
  "AuthorID": "mr",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=4031930&p=108178",
  "Posts": [
    {
      "AuthorID": "mr bill",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=4031930&p=108178",
      "Content": " Straydog, Thank you for the information. I visit the PCa forum frequently and have found it to be very informative. \nMr. Bill ",
      "MessageIndex": 1,
      "PostDate": "04/07/2018",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=4031930",
      "Title": "active breast cancer forum"
    },
    {
      "AuthorID": "mr bill",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=4031930&p=108178",
      "Content": " Is there an active breast cancer forum other than healing well. I love the format, but it does not seem to active. I suffer prostate cancer and enjoy the healing well forum and the numerous active posts. However, the healing well breast cancer site is not nearly as active. Our daughter has been diagnosed with breast cancer (today) and I am trying to find an active forum for her.\nThank you,\nMr Bill ",
      "MessageIndex": 0,
      "PostDate": "03/07/2018",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=4031930",
      "Title": "active breast cancer forum"
    },
    {
      "AuthorID": "Mr. Norrell",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2487959&p=152237",
      "Content": " I am a 42-year-old man. I thought a mammogram was something that simply did not apply to me. I had one this morning.\nI found a small lump near my right nipple about\n three weeks ago. I was startled when my doctor recommended a mammogram. I had the classic, \"But I'm a guy!\" reaction. Once I did some research I realized that male breast cancer rates, while low, were higher than I had realized. The mammo tech told me this morning that she performs the procedure on a lot more men that you would commonly expect.\nSo I did the mammogram. It was much...clampier than I expected. And women go through this regularly? Wow.\nNow I wait. While I was in the mammography suite, the tech told me (unofficially, of course) that it didn't look like much. I was called in for two more images, as my nipple had apparently gotten in the way before. Once she released me from the waiting room, I asked her if things still looked good. She smiled, said, \"I don't diagnose\", and walked away.\nWas that because they found something worse on the secondary images, or simply that she did not feel free to speak unofficially in the hallway? I guess I'll find out in a week or two.\nI'm trying to keep my worrying to a realistic level, but I come from a long line of worrywarts. I comfort myself with the fact that I was not embarrassed or reluctant to inform my doctor when I noticed a change in my body. My definition of masculinity has never included taking foolish risks with my health. I'm going to stay positive and wait to see my doc. ",
      "MessageIndex": 0,
      "PostDate": "14/08/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2487959",
      "Title": "My first mammogram"
    },
    {
      "AuthorID": "Mr. Norrell",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2487959&p=152237",
      "Content": " Well, it seems I'm a lucky man in more ways than one. My doctor had the mammogram results by suppertime today, and there's nothing to worry about\n (it's just gynecomastia). I was relieved over that, and also amazed by the speed of the news. It turns out that my province (I'm Canadian) launched an electronic medical records system a while back. All my doc had to do was log in on his end and the results were waiting. I'm also grateful that I don't have to pay for any of this!\nNow I just need to get through another medical exam on Monday (with a neuro-opthalmologist, for an unrelated eye condition), and I can stop worrying. ",
      "MessageIndex": 1,
      "PostDate": "14/08/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2487959",
      "Title": "My first mammogram"
    },
    {
      "AuthorID": "mr",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1416054&p=79085",
      "Content": " hi I'm 34 yers. old women I had mamogram and ultrasound done 2 months ago the result I have several cysts in my both breast. I have fibrocystic breast.I did research about\n cysts,\n \n ",
      "MessageIndex": 0,
      "PostDate": "16/03/2009",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1416054",
      "Title": "Fibrocystic breast"
    },
    {
      "AuthorID": "mr",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1416032&p=79085",
      "Content": " Hi two years ago I had a lump in my right breast, My Dr. did an ultrasound & recomended me to have a biopsy done, while I was having a biopsy the fluid popped, My doctor told me that it was just a cyst & I don't  need to be worried about\n. \n3 weeks ago I noticed that I have a new lump in the same breast My Dr. did an ultrasound and she told me it's a cyst, she did a needle Aspiration  to remove the fluid. \nLast week I noticed again I have a new lump in the same breast, this time I have few, one lump is big and the remained are small. I had a mamogram and ultrasound done. The radiologist in the ultrasound saw a little bit blood in the fluid she told me that it could be from the last needle  Aspiration I had 3 weeks ago. \nlast week I went to see my doctor she had the result of the mamogram and the ultrasound she told me that the mamogram looks clean I just have few cysts in my breast and she told me that I don't need to remove them. \nI told my Dr. that I want to remove them, this time  she is going to do a surgery to remove the cyst  instead of having done a needle  Aspiration. \nMy question are : \n1)does cyst develop into cancer? \n2)could cyst be cancerous ? \n3)having surgery to remove a cyst doest it make any complications(get infection, make the lumps worst, more and get a cancer? \n4)Can't I keep having a needle aspiration every time when I get a new lump instead of having a surgery? \n5)because my lump contains bloody fluid could it be cancer \n6)could the blood in the fluid be result of my previous needle aspiration \n7)am I in higher risk of getting cancer because of my cystic breast? \n8)Is the mamogram result 100% accurate to know if the lump is cancer or benign? \n9)How long does a cyst take to develop? ",
      "MessageIndex": 0,
      "PostDate": "16/03/2009",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1416032",
      "Title": "breast cyst"
    }
  ]
}