{
  "AuthorID": "MrsChorlton",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1982994&p=115923",
  "Posts": [
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1982994&p=115923",
      "Content": " Any news Simplistic007? ",
      "MessageIndex": 17,
      "PostDate": "01/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1982994",
      "Title": "Breast Cancer Stage I"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1982994&p=115923",
      "Content": " I hope all went well today for you ;) ",
      "MessageIndex": 18,
      "PostDate": "02/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1982994",
      "Title": "Breast Cancer Stage I"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Which was a walk in the park, just a little throbbing and so I'm in bed taking it easy. Here is a little history...\nI found the lump about\n 6 months ago doing my self breast exam. Back in July my hormones were causing all kinds of problems, a list of crazy symptoms, and my moods were all over the place as I'm going through menopause and I'm 51 years old.. I finally found that taking a Wild Yam Root pill daily helped boost my progesterone levels and I no longer had the long list of terrible side effects from too much estrogen.\nHowever the lump is still here, about\n the size of a penny and after 2 mammograms and a ultrasound showing/confirming the mass was not just a cyst, this morning I had the core biopsy done.\nI should get the results tomorrow, and I'm optimistic that it will be benign, however the dr did tell me it could go either way.\nI'm trying to prepare myself for a possible cancer diagnosis, and so I came here looking for similar situations.\nI have no history of Breast cancer in my family, and I dont have any of the risk factors either.\nI'm mega healthy, I jog 5 miles a day 5 times a week. I eat clean healthy foods, and just had my yearly blood work done which all came back PERFECT. I'm the picture of health, well other than this suspicious mass located on my left breast in the duct area!\nI'd love to hear some encouraging words, or similar stories.\nThanks in advance ;-) ",
      "MessageIndex": 12,
      "PostDate": "01/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Thanks you Bev & Janice,\nI've only just now got a chance to come back and post! I followed your advice Janice and got copies of all my films already, and I need to get a complete copy of my biopsy report to see the hormone receptors I suspect caused all this.\nI met with a surgeon this morning who was awesome, and I already had an appointment booked with a surgeon for this wednesday so I'll get 2 opinions from 2 highly recommended surgeons.\nI'm so optimistic. We caught it very small, and there is every reason to think a lumpectomy with radiation should take care of it. I'm hopeful that hormone blockers is what is needed, I should be able to skip the chemo.\nMy husband and I had a great weekend (after the initial shock) and I even ran a 10k on the treadmill on Saturday!\nJanice I hope your surgery went perfectly today. Happy healing ;)\nI'll keep everyone posted. ",
      "MessageIndex": 17,
      "PostDate": "07/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " I just picked up my complete copy of the biopsy and yes I'm ER+ at 50.6% Intensity 1, and PR+ at 91.3% Intensity 2.\nMy Her2 statis was not amplified. and my Ki-67 was low at 6.9%\nI guess this is all great news as I should be able to be treated with hormone therapy. I suppose it's best to leave that up to the oncologist though, but the weird thing is that I'm not on either side of menopause yet. I'm not post and I'm not pre, I'm smack dab in it!!\nSo how are they going to decide which way to treat me?\nI'm pretty sure I'll be able to go with the quicker isolated radiation treatment that the surgeon suggested yesterday. \nHas anyone else have such a high progesterone receptor percentage as me?\nMrs C. ",
      "MessageIndex": 18,
      "PostDate": "08/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Hi Janice, \nThanks for asking ;) I'm doing alright today, and that's right I've met with my MO & RO. \nMy lumpectomy is this Friday (Feb 25th). \nI sort of had a minor freak out when I found a similar \"thickening\" on the other breast. It felt just like my other one felt 8 months ago, so I'm going back in to see my surgeon the day before my surgery so I can get his opinion. Over the phone he said that the mammo would have caught it, so most likely I'm freaking out about\n nothing, but then I've read some cases where mammos don't catch everything and more cancers are found on PEM scans or MRIs even after clean mammograms have been read. ",
      "MessageIndex": 21,
      "PostDate": "21/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Janice,\nThank you for thinking about\n me. I've sort of moved over to the breastcancer.org forum because there are so many more cases and gals there to read feedback from.\nMy lumpectomy last Friday went well. The injection of the radiation material into my breast was the worst, and really not that bad, it just stung like hell! But that was over in a few minutes then I had to wait for a couple of hours for it to filter through my system and finally find it's home in my my lymph node!\nI received a copy of the tumor pathology it was 7mm (tiny) and my node was negative!! I got clear 7mm margins most of it except the anterior margin (2mm margin, 1mm clear) which it was located tooo close to the skin surface, so unless I want to go back and excise that surface skin to get a wider clear margin, I can do that. I'll think about\n it some more... \nI went to my med onc yesterday to give 4 vials of blood to test, so that he can have the results available at my next week Wed appointment.\nI also have a follow up with my surgeon on Monday.\nDid I mention I am not going to have any radiation? My decision and I'm sticking to it!\nSo that's my update for now Janice!\nthanks for thinking about\n me ;)\n-Daisy ",
      "MessageIndex": 22,
      "PostDate": "04/03/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Yeah but Bev you have to remember that I'm stage one and have very favorable conditions! Even my surgeon, who was an MD Anderson cancer surgeon, has told me to give it a try but if I don't get on with it, not to be too worried. \nI met with my med onco yesterday concerning my CT scan. Uterus is enlarged and causes me continual cramping, an dno wonder with a very large fibroid on it, so I'm going to see my GYN April 6, I might talk about\n a hysterectomy (just uterus, -keeping ovaries and cervix) \nAlso the Abdomen CT showed some density in my lower lung lobe, so I have to go back on Monday and get a Chest CT! Everything else was in great shape. I'm not worried about\n the lungs just yet. \nHe gave me printouts of the Tamoxifen studies and wanted me to read them before he gives me a script\n. I suppose he's covering his butt! LOL\nI went to see a Acupuncturist earlier this week because I was feeling so drained and \"not myself\" She did wonders for me after spending about\n an hour gathering my history. I left there feeling balanced and very very calm and relaxed. I was kind of super surprised of the effects later, because at the time I was thinking, oh right this is not doing anything... She recomended some chinese pills specifically formulated for my symptoms, but safe for anyone diagnosed with estrogen receptor positive BC. So I picked them up from the special chinese pharmacy and started taking them 2 days ago. It may take a week or so to start feeling some benefit from them but so far so good.\n-Daisy ",
      "MessageIndex": 38,
      "PostDate": "25/03/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1977462&p=115923",
      "Content": " Best of luck to you Janice! I hope it goes perfectly on Monday! ",
      "MessageIndex": 18,
      "PostDate": "02/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1977462",
      "Title": "Settled on type of reconstruction"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1977462&p=115923",
      "Content": " I'm good, and much better today I'm optimistic! \nAnd you? \nI was wondering Janice. Will you take before and after pics? Have you up to this point? I know that I would if it were me, especially throughout the healing of it, and to see how far you've come. If you have I would love to see them. If I had to have a mastectomy I might be out of luck for reconstruction. I don't think my body would tolerate an implant either, and years ago I had a tummy tuck to remove a pound of flesh that was like a bunch of pizza dough, so I've got no extra skin there to use. However having said that, my plastic surgeon has done over 3000 breast reconstructions, and she is phenominal! I know she'd fix me up somehow! \nYou've been through so much already, if there is anything I can do to cheer you on, I'll do it!\n(((CYBER HUGS)))\nMrsC ",
      "MessageIndex": 19,
      "PostDate": "03/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1977462",
      "Title": "Settled on type of reconstruction"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " I met with my Surgeon yesterday for my followup, and we discussed the one margin.\nHe got a total of 2mm on the anterior margin (1mm of it was clear), because there was no tissue left. I have very very small breasts. The 1mm of clear margin was clear and he said we can go back and remove your outer skin if your med onco wants to, but I can assure you that anytime I've gone back to do that never, ever has the extra skin come back with anything in it. I feel very comfortable with the margin considering my circumstances.\nThe reason I am not doing radiation is because my cancer was on my left breast. I met with a radiation onco, and he said he could not do a mammosite on my breast because I do not have enough tissue to allow it. Like I said, I'm small breasted. Not to mention that it would damage my nipple, to the point it would be extremely painful, and I would curse him for a very very long time.\nHe did want to do partial breast radiation, but after much research on my part I chose to not have it. I was a smoker for 23 years adn was also exposed to massive amounts of asbestos within a few weeks time. He told me that the radiation would most certainly \"clip\" a part of my lung. That is a big ol can of worms I'm not will to \nopen over a stage 1a breast cancer! I may someday get Mesothelioma, but I'm certainly not going to egg it on. I also have a history of heart issues, my heart may or may not be \"clipped\" in partial radiation, no guarantees on that one.\nSo the choice was mine, and my surgeon agrees that I have made a good decision for me. \nNow to go meet with my med onc tomorrow and discuss my blood tests, and what road to travel with meds... ",
      "MessageIndex": 11,
      "PostDate": "08/03/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Thank you so much Janice. That meant a lot to hear from you. \nI know it's a big old goofy world, I know it's 50/50 even though they say 80% come back benign. I still believe it's a 50/50 chance just like you said you being positive and your neighbor being negative.\nI'll will post here as soon as I hear something. I'm preparing for a cancer diagnosis though. I just have that sinking gut feeling today.\nJanice please tell me how you handled it when they told you, did they tell you over the phone? What happened next?\nWhat was your treatment, and how are you now? \nThank you again, so very much for replying. \n \n ",
      "MessageIndex": 13,
      "PostDate": "02/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Wednesday's visit with my oncologist was not as good as I had hoped it would be.\nFirst of all he insisted that I should go back to do another surgery, and have the area of surface skin removed to get a wider anterior margin.\nThat shouldn't be a big deal and my surgeon reassured me on Monday, he would do it if it needed to be done, and it would be a breeze -in and out, nothing at all like the lumpectomy. OK I'll do that.\nHe's not at all happy with my decision to not have radiation, but this is one thing I'm not budging on. I finally had to tell in no uncertain terms that he was upsetting me about\n the radiation and that I wasnt getting it and why. He saw I was quite upset and said he wasnt going to push me to it anymore, I'll get lots followups and we'll be watching me closely.\nMy liver functions were a little \"weird\" so we're using that as an excuse to get a full CT and also a lung x ray -just so we have a clear picture of everything, he's not really concerned that something is wrong. He said \"Did you go on a drinking binge?\" and I said uh no way I never drink. Maybe a single beer once a month! Then he asked me if I took cholesterol lowering drugs and I said no. I have no idea why my liver function would be messed up ?\nHe presented me with my future drug therapy options, so I'm trying to decide whether I want to take shots of Luprin every 4 months + a daily Arimidex pill for 5 years, or just take Tamoxifen pill for 5 years. Each has their drawbacks and side effects. The Luprin would be to shut down my ovaries (instead of surgical ovary removal) which are still going full steam ahead right now, cranking out estrogen like I was 30! There is no telling how long until I reach menopause so I've got an appointment next week with my GYN and see if she can run some more complex hormonal tests to see how many more years I have before I'm menopausal, to help me in my decision to try and determine which course of meds I should go with. I need to weigh side effects of both, do my research and make the right decision for me.\nNot an easy task.\nWe registered on ajuvant therapy and looked at my recurrence chances and to be honest, I'm more likely to die of other causes than of the BC, and that's not taking any ajuvant at all!\nToday I'm leaning toward trying tamoxifen first, and seeing how I get on with it. I've read that AI's are much better as a treatment, but very difficult to do because of the side effects, most women hate being tired and achy. ",
      "MessageIndex": 25,
      "PostDate": "11/03/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2109649&p=115923",
      "Content": " Dents, or indentations, can be signs of cancer too. Have you been to your Dr yet for a mammo? Please have it checked out asap! ",
      "MessageIndex": 1,
      "PostDate": "24/05/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2109649",
      "Title": "dents"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " (Janice I'm going to post in your thread)\nI wanted to update this thread because I met with my medical oncologist (MO) and radiation oncologist (RO) on Wed. I absolutely love them both!\nMy MO will get a full blood proteins test in a few weeks to see what my hormone levels are before we even start talking about\n what therapy he suggests. Also we need to wait until the complete pathology of the mass is done and if my sentinal node is clear, this too makes a difference, so we wait for the lumpectomy on next Friday the 25th.\nMy RO said that my breasts are far to small for the mammosite radiation. When he told me this it was all I could do to hold back the tears. He went on to say that it would cause me great pain in my nipple and there is no way he could put me through that. All that was going through my mind was huge disappointment. 6 weeks of radiation, I know others have much worse with chemo, but I was so looking forward to 1 week of twice a day treatments so I could get on with healing and back to my active lifestyle. As my tears started to eek out, my RO began to tell me about\n an alternative. We would do external beam radiation to only the portion of my breast where the tumor was, taping down the nipple moving it out of the way, in accelerated twice a day treatments for one week. YES YES sign me up for that!!\nI want to post a link to his youtube videos because I think he is just an amazing Radiation Oncologist, and perhaps you can learn something about\n raditation therapy from watching it. There are 2 parts to the video, I found the second part to be the most interesting, but both are good! http://timdziuk.com/part1.html ",
      "MessageIndex": 20,
      "PostDate": "18/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Thank you so much Janice, you listed some very very wise advise that I will most certainly follow!\nThat is ironic and unforgivable what they told you. What nobs!\nI wish you all the best of luck for your surgery on Monday. I'm excited for you, and hope it goes well!\nThank you for sharing your whole story with me today as well. Did you have double mastectomy or one breast? I had read bits and pieces from some of your posts, but this made it more complete.\nThanks again, I'm patiently waiting to hear my pathology report. \nMrs C. ",
      "MessageIndex": 14,
      "PostDate": "02/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Bev,\nOh yes, of course I told my onc the day I started taking them, I brought in the information sheet on them so they wouldn't look at me funny! I did start feeling some benifits from them about\n 3 days ago, so I'm very hopeful.\nHad my chest CT and there are 3 tiny nodules in different \nlocations in my lungs. My onc said not to worry they are very common and are more than likely benign. They are too small to do anything about\n anyway, so I'll get another CT scan in 6 months to monitor them. My heart and other stuff looked great :)\nGYN next week for counsel about\n a possible hysterectomy...\nand so it goes...\n-Daisy ",
      "MessageIndex": 39,
      "PostDate": "30/03/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1977462&p=115923",
      "Content": " I missed this post on Friday, but I'm so glad you're on the mend. It will take a couple weeks before you start feeling better, so be easy on yourself and eat lots of protein, it helps in healing faster. Thinking of you ;)\ngentle hugs from eme too!\nMrs C ",
      "MessageIndex": 10,
      "PostDate": "15/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1977462",
      "Title": "Settled on type of reconstruction"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1977462&p=115923",
      "Content": " Janice please take it slowly and listen to what your body is telling you. Don't try to be a martyr! Don't push yourself. Nap often, your body is trying to mend, give it the rest it needs so it can do it's job better!\nIf you're resting and eating proper food, you'll be feeling a little better with each day. At 3 weeks post op you should start feeling like a person again, even though you still have many weeks of healing ahead!\n((gentle cyber hugs))\nMrs C. ",
      "MessageIndex": 24,
      "PostDate": "18/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1977462",
      "Title": "Settled on type of reconstruction"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Preliminary results confirm it's Ductal Carcinoma\nand invasive, that is all I know right now until more tests results are completed.\nLooking at meeting with some surgeons asap. ",
      "MessageIndex": 3,
      "PostDate": "03/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Cyber shoulder to cyber shoulder. I like that very much! You're awesome Janice!\nThank you so much :) ",
      "MessageIndex": 15,
      "PostDate": "03/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Bev one of the trade names for the radiation is called \"Mammosites\"\nI'm meeting with an oncologist wednesday morning to go over everything. I really really don't want to take any tamoxifen or AL's, so I'm going talk about\n it with the onco and see if there are any other options since my nottingham score (growth rate) was the lowest you can get: a 3 out of 9!\n-Mrs C ",
      "MessageIndex": 19,
      "PostDate": "14/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Bev and Janice,\nThanks for your replies. The more we investigate the easier the answers come. I'm leaning towards the tamoxifen. The only thing that freaks me out about\n it is the blood clots. We are going to take a trip to England in July, because my husband is British, and we like to go every 2 years to visit family. 10 to 13 hours on a plane. \nA long flight means I'll be cramped in a seat for many hours without being able to move around much. And that means blood can't flow through the body and back to the heart the way it needs to, which could possibly cause a dangerous blood clot. \nTerrific \n \nI spoke with a woman yesterday that I used to work with. She had stage III trip neg BC (BRCA gene positive)\nshe also refused radiation. She is a phd and specializes in statistics. She read every paper, every study about\n radiation therapy and was convinced it was not right for her either. It was good to have her on my side!! She had a lumpectomy and chemo. She said her chemo treatments were absolute hell, and that it shut her ovaries down for good. She went through 3 years of hot flashes and sleepless nights. But that is all over for her now and she hopes the BC never ever comes back!\nIf I choose Tamox hubby and the dr would like me to start right away. I guess I will start it and give it a good shot, I'm hoping that I'm one of those people who the side effects are bearable, but if it ruins my QOL I'll stop taking it. I can't deal with depression, period end of story. I can tolerate hot flashes, and minor crap like that!\nI'm wondering what the deal is with my liver function, guess I'll find out soon enough. \nonward... ;) ",
      "MessageIndex": 35,
      "PostDate": "12/03/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Oh I'm sorry Bev!\nLast summer I started having hot flashes which I agree are pretty bad. I started taking wild yam root and they went away. I had so many other horrible symptoms that my hormones were out of wack and I just rated the flashes lowest on the list compared to everything else I was going through. ;) ",
      "MessageIndex": 36,
      "PostDate": "14/03/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2018423&p=115923",
      "Content": " Yesterday I had the surgery to remove the remaining skin that would have been above the tumor site, just so we could get a nice wide margin.\nI was more sore than I was expecting aterward, but today is much more tolerable. It was probably overkill, but what the heck it only cost me a few hundred extra bucks, and now I can say I got wide clear margins all the way around!\nI'm meeting with a naturopathic dr on monday and then seeing an accupuncturist on tuesday. My GYN referred me to the accupuncturist, adn said she was fantastic in as far as treating for any pain or unpleasant side effects that I might get with the meds. \nI sure don't want to take Tamoxifen, but that's the way my decision is leaning right now. My onc told me I had to decide before I see him on thursday. So I guess I'm going to give tamo a try, and see if I can handle it. \nHow are you doing Janice? How about\n you Bev? ",
      "MessageIndex": 37,
      "PostDate": "19/03/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2018423",
      "Title": "Needle Core Biopsy earlier today"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2021629&p=115923",
      "Content": " Hi LadyGaga, I don't think your weight has a whole lot to do with it. I know that some women just get seromas. It's one of those things.\nYou might get more support online at a plastic surgery site called make me heal dot com. They have a super bunch of tummy tuck gals there on their forum, and several who have gone through seromas and necrosis who could give you an idea of what to expect. Do a search in their abdominoplasty section using the word seroma and alot of posts will pop up! \nGood luck with everything. ",
      "MessageIndex": 2,
      "PostDate": "08/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2021629",
      "Title": "Reconstruction problems coupled with new chemo - for LadyGaga"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1977462&p=115923",
      "Content": " Janice, How are you doing now?\nI was thinking about\n you this morning... I would give it more than 3 months to feel like getting close to normal. Major surgery like this is taxing on the body in more ways than we know, so take care of yourself especially now when people think you should be doing more, you listen to your body, it'll tell you what you should and shouldn't be ready to do ;)\ncyber hugs! ",
      "MessageIndex": 30,
      "PostDate": "04/04/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1977462",
      "Title": "Settled on type of reconstruction"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2032013&p=115923",
      "Content": " They can tell alot more with the ultrasound, it shows how a mass is positioned in the natural layers of tissue. If it's suspicious they'll order a biopsy.\nEven then they can only call it suspicious. Waiting for results really is the worst part. Hang in there. I hope everything turns out alright for you.\nThere is plenty support here and other places on the internet. \n(cyber hugs)\n-Mrs C. ",
      "MessageIndex": 2,
      "PostDate": "18/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2032013",
      "Title": "Thank you for sharing"
    },
    {
      "AuthorID": "MrsChorlton",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1994145&p=115923",
      "Content": " Fantastic!! That is excellent news \n ",
      "MessageIndex": 7,
      "PostDate": "07/02/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1994145",
      "Title": "Lump in breast for three years"
    }
  ]
}