{
  "AuthorID": "mrslovelycat",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2368603&p=142314",
  "Posts": [
    {
      "AuthorID": "mrslovelycat",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2368603&p=142314",
      "Content": " Update:",
      "MessageIndex": 2,
      "PostDate": "04/04/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2368603",
      "Title": "Benign Cyst or Malignant?"
    },
    {
      "AuthorID": "mrslovelycat",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=1233247&p=142314",
      "Content": " First you need to go get it checked out right now.\n I recently had a mammo and they found a \"round dense mass.\"\nI freaked out. I immediatly assumed the worst.\n After my ultrasound, and second mammo it was a Fibroadenoma tumor. Benign tumor. Those types of tumors can grow, but are usually painless. They are soft and squishy and move around. \nMy sister had her mammo last month, they found a very small -what they think is- a benign cyst. They want her back in three months to get it rechecked for growth. \nGet yourself checked asap, to ease your mind if not more than anything.\nGood luck! ",
      "MessageIndex": 13,
      "PostDate": "04/04/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=1233247",
      "Title": "Breast lump, but no pain???"
    },
    {
      "AuthorID": "mrslovelycat",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2368603&p=142314",
      "Content": " \n ",
      "MessageIndex": 0,
      "PostDate": "14/03/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2368603",
      "Title": "Benign Cyst or Malignant?"
    },
    {
      "AuthorID": "mrslovelycat",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2368603&p=142314",
      "Content": " Bev,\nThank you for responding..and your rational and kind words. :) \nI got a call from the radiologist yesterday, they want me back for another mammo on that side and an ultrasound. In his report he said (which the receptionist read to me) he found a dense round mass, which is probably benign, but wants to get more pictures. I googled \"dense round mass\" it came up with all different scenerios. Alot were of cysts caused by pre-menopause. Ironically my sister (bilogical) is going through the exact same thing. They found a cyst or mass in her left breast last month. She had an ultrasound done, he seemed to think it was benign, but wanted her back in 6mo. to see if it changed at all. Well, she got a letter in the mail from the radiologist, he wants her back in 3 months. She is a wreck like me. It's wierd we are going through this at the same time. It's odd.\nanyways..thanks again for your kind words. I know I shouldn't compare my situation with my mothers..I guess all those painful memories have come back during this. I hope and pray that my situatuon as well as my sisters ends better. \nI will come back next week and update. \nThank you ",
      "MessageIndex": 1,
      "PostDate": "17/03/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2368603",
      "Title": "Benign Cyst or Malignant?"
    }
  ]
}