{
  "AuthorID": "Notluvinit",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2289925&p=102334",
  "Posts": [
    {
      "AuthorID": "Notluvinit",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2289925&p=102334",
      "Content": " The hard spot is not directly under the incision... it is actually away from the incision site about\n an inch. And I have discoloration way down on the lower outside of the breast...the hard spot is also flat. I have had 2 biopsies on my right breast and have never even had a bruise. I see my surgeon for a follow up on Wednesday. My sis was wondering if it could be a hematoma? I dont even know what that is...this hard flat spot is bigger than a 50 cent piece but you cannot see it just by looking at it. My sis said that you would be able to see a bulge if it were a hematoma. (sp.) \nWith the 2 awesome biopsies I have had before, this one doesnt seem right at all.\nThanks for answering Bev! Gentle hugs to you.\nFibromyalgia, low thyroid, auto-immune, raynaulds syndrome, carpal tunnel/both hands, vit D deficiency \nGentle Hugs, Lori ",
      "MessageIndex": 1,
      "PostDate": "19/12/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2289925",
      "Title": "Post Biopsy~Large flat mass and brown blood from nipple"
    },
    {
      "AuthorID": "Notluvinit",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2289925&p=102334",
      "Content": " I have had lumpectomies on my right breast 3 times..I have never had problems with my left breast until 4 months ago. I found a small lump in my breast. It felt nothing like the ones I had removed from my right breast. It was different, roundish and would move one way but not the other. I had the mammo and the ultrasound but they both showed nothing. Keep in mind, I am not real pleased with my clinics and hospitals but I am not financially set to move elsewhere so I take what I can get. So, my regular doctor examined the lump again and insisted that I go to the surgeon. He felt it and said it was a mass and gave me the option to wait 6 months and keep an eye on it or have it removed. He said if it were cancer, 6 months wouldnt make a difference...Really??? So, he took it out on the 8th of this month. I have never seen so much bruising...Now, I have a huge rock hard flat something in there (below the incision, and down farther on breast) .I have a flaky area that itches like mad and I have very dark blood coming from the nipple..It is more dark brownish...It doesn't come out on its own, my nipple started itching so bad that when i squeeze it to get relief then the blood comes out. I see the surgeon on this Wed. and should get the pathology report....is this normal and is there questions that I should ask him?\nThanks so much for any input!\nLori ",
      "MessageIndex": 0,
      "PostDate": "18/12/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2289925",
      "Title": "Post Biopsy~Large flat mass and brown blood from nipple"
    }
  ]
}