{
  "AuthorID": "patsy42",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=192140",
  "Posts": [
    {
      "AuthorID": "patsy42",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=192140",
      "Content": " Hello everyone.\nThanks for having me here.\nI am a 27 year old and unfortunately slightly obese woman and a week before my last period I found a lump in my right breast in the upper outer quadrant. I had lost some weight recently so the lump might have been there awhile and just appeared?\nI have breast cancer in my family, my dads sister had breast cancer quite young, in her 30's. My aunt (not related) just developed breast cancer last year. She went to her doctor with a lump, they said it was a cyst and to come back in a year. Thank god she didnt wait because the cyst turned into three cancerous lumps! She had a mastectomy and is doing ok. I know three women, all under 50, who are dealing with BC right now so of course I am concerned. So far the stories are all alarmingly the same... doctors brushed them off, they demanded ultrasounds, found BC. \nMy doctor completely brushed it off, didn't ask for an ultrasound to be done, said I didn't have fibrocystic breasts but that I was too young for cancer. Did NOT like hearing those words from his mouth!!! \"Too young for cancer\" should not be a reason to not run some tests!\nWhere I got the cyst, I have had bruising in that area for a very long time, probably years. I tend to sleep on that side and as my breasts are large I always thought the pressure I was putting on it was causing random bruising. Well the bruising is getting slightly worse and I can feel that the cyst is getting bigger or getting closer to the skin. Last night when I lay down a certain way I could feel that the cyst is much larger than it seems.\nLast night I began having hot flashes, followed by shivering. I felt dizzy and whenever I would start to feel warmed up, the dizziness would get worse and I'd start to feel \"out of it\". I called a nurse hotline last night and this morning when the symptoms persisted, and both times they told me it was probably anxiety and not to go to the ER as I would be wasting my time as theres nothing wrong with me.\nI am having aches where the cyst is, slightly less now that my period is gone but the cyst has gotten larger after my period if anything. My arm above where the cyst is is sore. i can feel a lump in my arm, thought it was lymph node but doctor said lymph nodes are fine and the sore spot I felt was a muscle. \nWhy I am posting this is because my doctor cannot see me again until April. I am obviously very concerned and can't imagine leaving this untested until then!! Especially if I am having anxiety about\n it.\nHere in Canada, apparently the only way I can get an ultrasound or testing ordered on this lump is to go through my GP. Since he is GONE for most of march and has no \nopenings for me, I'm not sure what to do. \nI hate to be a worry wart but so far I have heard terrible things about\n doctors brushing off breast lumps only for them to end disasterously.\nI also have rheumatoid arthritis, low body temp (94-95 all the time) but apparently my thyroid function is fine.\nI've been getting chest pains and nausea around my period for the past while and the symptoms seem to improve after my period goes away. This last period the pains were particularly bad but my doctor believes the pains are occurring in my breast muscle and said my heart sounded just fine. He ordered an ECG just in case. But ordered no diagnostics on the lump. \nPlease forgive me for this wall of text and please forgive me if my worries make light of anyones cancer diagnosis. Not my intention at all!\nI guess I'm also wondering... if I can't get my doctor to take me seriously and I don't see him til April 7th... if this is cancer, is that way too long to wait? Will it be too late by then? ",
      "MessageIndex": 0,
      "PostDate": "11/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2989043",
      "Title": "Found a lump in my breast.. Doctor is blowing me off"
    },
    {
      "AuthorID": "patsy42",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=192140",
      "Content": " \nThank you so much for taking the time to reply to me!\nI was really looking forward to the cyst going down in size after my period but when it got larger and a bit harder and a bit more bruised, I started really worrying. \n \nI've also been having nipple pains in the breast that has the lump. Could all be hormonal of course. \nI know very well my fear is because of just how many women I know under the age of 50 have been diagnosed recently. I feel very selfish and silly for worrying so much.\nI feel much better about\n possibly having to wait until April. Thank you ladies so very much. Thank you for your patience. I feel terrible even asking these questions because my own worries and fears are nothing compared to you brave women who have or are facing this. I feel stupid and weak for worrying so much. My mom keeps telling me to ask my Aunts about\n their breast cancer but I just can't bring myself to burden them with my worries when they have very real worries of their own. So thank you so much for your advice, it means the world to me. \nI suppose another big worry of mine is that my drastic hormonal changes could be related to cancer. I've also switched diet quite drastically for my IBS, not sure if that could kickstart my hormones into overdrive, havent found much info online, but it seems to me I've been having whacky hormones for awhile now. progressively getting worse. \nSome good news is I quit smoking the day I found the lump. I haven't drank in months and if nothing else this has given me the push I needed to kick some very bad habits. ",
      "MessageIndex": 8,
      "PostDate": "11/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2989043",
      "Title": "Found a lump in my breast.. Doctor is blowing me off"
    },
    {
      "AuthorID": "patsy42",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=192140",
      "Content": " Hey guys, I ended up going to the ER yesterday morning. My nausea is near constant, but worse in the morning. He ordered a full bloodwork but said I'd need to go to my family doctor for a mammogram. I'm really not happy to wait that long. \nI've been feeling randomly weak and dizzy, have NO appetite, due to the nausea. Have not vomitted though. I am getting the shakes as well in my arms and weak in the knees feeling.\nDoctors think it is all anxiety related. It's hard to imagine having anxiety symptoms last for 5 days at a time?? Non stop? \nI feel strange and not myself at all. \nEveryone is absolutely freaking me out, I have friends that are telling me ALL about\n how their friend died of breast cancer at the age of 28 and stuff like that and its definitely not helping me to hear this stuff. ",
      "MessageIndex": 3,
      "PostDate": "13/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2989043",
      "Title": "Found a lump in my breast.. Doctor is blowing me off"
    },
    {
      "AuthorID": "patsy42",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=192140",
      "Content": " Also the lump seems to not only feel a bit bigger, but has also got harder. All after my period ended this Saturday. \nI'm going to go to the ER tonight and just hope and pray that they will listen to me and refer me for an ultrasound. No idea if it will work but I'm not waiting until April. ",
      "MessageIndex": 6,
      "PostDate": "11/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2989043",
      "Title": "Found a lump in my breast.. Doctor is blowing me off"
    },
    {
      "AuthorID": "patsy42",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2989043&p=192140",
      "Content": " \nThank you for your response so very much. \nMy family doctor is a new doctor to me, I have only seen him three times. He has really dropped the ball on some things, such as neglecting to put my RA in my file and neglecting to tell me a blood test from SEPTEMBER showed high cholesterol. I suppose its these things that are making me second guess him. I also didn't like to hear \"you are too young for cancer\", as someone who watched her ten year old cousin die from brain cancer, it is almost offensive to hear. \nI am in Canada and where I am, I cannot see anyone but my family doctor. There are no walk in clinics. My only option is to drive two hours to another province and pay out of pocket for a walk in clinic there, which I can and probably will do. I will have to lie to them and say I do not have a family doctor so that they will hopefully refer me for more testing. But then all that testing will be very costly and all out of pocket for me. \nI desperately want an ultrasound done and I so appreciate you guys saying it can wait til April!! I guess it comes down to I know I will be very worried and probably anxious til then. Apparently I had an anxiety attack last night and this morning. (What a nurse hotline told me)\nI can give it some more time and if it continues to grow bigger and harder then go to the ER? I know the ER is for emergency situations but I am quite desperate to be referred to a specialist. Where we are there are \"mini hospitals\" that are not busy at all and since its rural, I'd be in an out in an hour. If I were to go to the hospital in the nearest big city my wait time would likely be 10 hours+. ",
      "MessageIndex": 2,
      "PostDate": "11/02/2014",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2989043",
      "Title": "Found a lump in my breast.. Doctor is blowing me off"
    }
  ]
}