{
  "AuthorID": "PC",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=349559&p=178644",
  "Posts": [
    {
      "AuthorID": "PC",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=349559&p=178644",
      "Content": " I posted above about\n going back for a diagnostic mammogram. They took me right in on time which I appreciated. I was expecting them to take multiple views, but they didn't. The tech explained to me that from the top to bottom view on my mammo, they saw something they couldn't identify. I don't know why the woman who called me went on and on about\n density increase on one side, etc. They did a core compression which is compression of only one small area. Ouch. She really clamped down but it was over in seconds. I was told to go into the \"interior\" waiting room (where you sit in your little gown) and the doctor would come out and talk to me. Barely five minutes later the nurse came out and said everything was fine. Whatever had shown up on the first mammo was regular tissue that might have been compressed in a funny way. The view she took showed everything was normal. Of course I made a fool of myself thanking her profusely and telling her what a great job she'd done! \nI will now forever be very regular about\n getting mammos (I was playing a little fast and loose for awhile there) because earlier is better and who knows if I might have a problem down the road.\nFunny thing is we went for a drink afterwards and saw a couple who had been in the waiting room at the same time as me and hubby. We recognized each other and she gave me a thumbs up so obviously her test came out fine, too. ",
      "MessageIndex": 60,
      "PostDate": "04/09/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=349559",
      "Title": "Second Call back On Mammogram and scared"
    },
    {
      "AuthorID": "PC",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=349559&p=178644",
      "Content": " Hi, I'm new here. Had my screening mammo on Tuesday and got a call today (just when I thought I was out of the woods!) for a diagnostic mammo on Wednesday (it would have to be labor day weekend which I had been planning to enjoy.) Apparently there is an area that is denser than it was last year...or something like that. It was hard to focus on what the woman was telling me. Unfortunately the main breast center, where I have to go for the diagnositic mammo, is located in the middle of the cancer center! On a positive note, they have what they call \"rapid results\" so if I need further testing, it can be done right away. Hoping it's nothing. Odds are in my favor, but my brain refuses to believe that. ",
      "MessageIndex": 58,
      "PostDate": "30/08/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=349559",
      "Title": "Second Call back On Mammogram and scared"
    },
    {
      "AuthorID": "PC",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=349559&p=178644",
      "Content": " Krissis, I wouldn't worry unless your doctor tells you to. The techs know a certain amount from having been on the job, but they don't know everything. It's probably nothing. ",
      "MessageIndex": 59,
      "PostDate": "04/09/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=349559",
      "Title": "Second Call back On Mammogram and scared"
    },
    {
      "AuthorID": "PC",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2700293&p=178644",
      "Content": " Hi Dee,\nKeeping you in my prayers. Sometimes they do an ultrasound because it shows more/different things than a mammo. It doesn't necessarily mean anything is wrong. Let us know how it goes. ",
      "MessageIndex": 1,
      "PostDate": "04/09/2013",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2700293",
      "Title": "Waiting for answers"
    }
  ]
}