{
  "AuthorID": "reenee",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=473155&p=19593",
  "Posts": [
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=473155&p=19593",
      "Content": " It is amazing I was just setting here talking to my husband about\n how miserable I feel.  I am on arimidex.  I have two ruptured disk lower lumbar, and fibro.  However my legs have been hurting me so bad, I cannot lay, set, stand or anything with out being acutely aware of them as well as my feet.  I am also super tired.  I get little sleep at night because of aches and pains. So I can explain some of that because of lack of sleep. \n \n \n \n \n ",
      "MessageIndex": 8,
      "PostDate": "07/05/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=473155",
      "Title": "Arimidex vs aromison medicine"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=473155&p=19593",
      "Content": " I went today for follow up mamogram on remaining breast. Last NOV. they had found an area that was suspect.  HOWEVER today they checked rechecked and finally the radiologist came in and said I HAVE WONDERFUL NEWS FOR YOU.  Everything checks out looks great no change in this area, looks as though it has been there a very long time, and is not a problem. See you in six months.  I FELT LIKE THE WORLD WAS LIFTED OFF MY SHOULDERS.  Thanks God.  I cried and so did she. I think she wanted me to stop hugging her. \n    I am so tickled, had to share the great news.   PS thanks for follow up  on Arimidex vs. aromison, I am going to check with oncologist when I go for appt. May 24.  Appreciate so much your reply. \n \n \n ",
      "MessageIndex": 9,
      "PostDate": "08/05/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=473155",
      "Title": "Arimidex vs aromison medicine"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=370833&p=19593",
      "Content": " Thanks for all the kind replies. Would it be possible radiologist was able to tell, and then say sometimes lymph nodes enlarge and there is no problem. He spent a very long time looking for other signs and symptoms? \nIs there a blood test to tell if a person has cancer?\nCan they biopsy a node?\nI really am tossing idea of just getting breast off, no simple decision. \nI have had one mastectomy, know what it involves. Regretting not having it done when I had last surgery. I know I do not have the type of cancer that mirrors itself in other breast. \nOne of the dr.s mentioned a P E T SCAN However that was never mentioned again. \nDoes the surgeon or the oncologist usually call the shots with treatment. \nThanks all for your suggestions love and concern\nreenee ",
      "MessageIndex": 12,
      "PostDate": "01/12/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=370833",
      "Title": "Emotions-Another lump?-Dr's Reaction"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=370833&p=19593",
      "Content": " Yes I am going to seek another opinion, I have an opinion with our Dr. on Monday. They are faxing all paperwork to him. We are going to have him look at all reports and follow his instructions, or advice. Hoping it will be news that will bring some relief. I know the mammogram done the previouos year showed slight enlargement in node from previous reading. \nBe Well \nReenee ",
      "MessageIndex": 6,
      "PostDate": "03/12/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=370833",
      "Title": "Emotions-Another lump?-Dr's Reaction"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=370833&p=19593",
      "Content": " Hi no it is not another onoc. This is our medical dr. very good, always seems to be able to sit down and listen. That is important to me. I have some hard copies from mastectomy. I will take with us. \nI am so emotional over this situation. Have a very hard time talking about\n it. I think Arimidex has something to do with that, depleting my hormones, making a mess out of me emotionally. I have never been such a basket case of tears. I am also going to talk to him about\n that.\nI have a wonderful husband. Very supportive. However he doesn't know how to handle the emotional part of me, makes him feel very bad when I cry. I try not to do that in front of him. Sometimes my cup runneth over and out of my eyes. \nThanks again all, I will let you know what I find out. Appreciate your love and concern. \nreenee ",
      "MessageIndex": 7,
      "PostDate": "03/12/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=370833",
      "Title": "Emotions-Another lump?-Dr's Reaction"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=370833&p=19593",
      "Content": " \n \n \n \n \n \n \n \n \n \n \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "29/11/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=370833",
      "Title": "Emotions-Another lump?-Dr's Reaction"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=370833&p=19593",
      "Content": " What the tech said was that the picture had changed since last mammogram.  THe radiologist was called to read and evaluate.  He said there was a change in size of node, from last year.  I would think there is a difference in nodes and lumps in their shape.  He said node was slightly larger than last time. He checked it for a long time and said, they would keep an eye on it, and evaluate in another six months.   \n \n \n \n \n \n ",
      "MessageIndex": 5,
      "PostDate": "03/12/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=370833",
      "Title": "Emotions-Another lump?-Dr's Reaction"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=370833&p=19593",
      "Content": " Hi all went to our MD, he gladly takes time to talk with you, and re-examine your thoughts, as well as read the reports and explain in laymans terms. \nHe felt for a lump, said he felt nothing remarkable at all. He said you have fibrocystic disease, I knew that. \nHe read the radiologist report, said Dr. is very thorough and concluded it was a lymphnode just slightly larger than before. He said edges are smooth, and node is in shape that is acceptable for healthy node. \nHe did say IF I WOULD FEEL BETTER I could get a biopsy. He concluded saying he doesn't feel it is anything at all to be concerned with, there are no signs within the breast of calcifications, lumps or anything. \nHe said most surgeons see their patients again throughout first couple years some do not, he felt that is why the oncologist said what she had said.\nI do feel more at ease, than I did. I still may go in after the holidays and get a biopsy to be sure. I am weighing that now.\nThanks for all your kind help, and nice post. \nBe WEll God Bless, Keep smiling. \n \nreenee ",
      "MessageIndex": 8,
      "PostDate": "07/12/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=370833",
      "Title": "Emotions-Another lump?-Dr's Reaction"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=325814&p=19593",
      "Content": " Insurance companies are indeed required to pay for breast surgery to allow patient to have equal size breast. Also if the larger breast is bothering your back, you are off balanced from removal of breast, and it can have serious consequences on your spine, and balance. I am considering have same done, I am extremely large breasted on one side and had mastectomy on the other side. I have had terrible back aches since having the mastectomy, the surgeon said I might, as did the oncologist. I do have fibro, and two ruptured disk, which only add to the problem. Good luck, stand your ground with insurance.\nBe Well God Bless\nreenee ",
      "MessageIndex": 2,
      "PostDate": "18/09/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=325814",
      "Title": "reducing the good breast"
    },
    {
      "AuthorID": "reenee",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=281078&p=19593",
      "Content": " \nWhy Grandma.  I was given Arimidex after my breast surgery.   I have ductal cancer stage 1, the arimidex is causing me (i think) bone muscle, and joint pain.  I had been diagnosed with fibro some years ago, so I am not one hundred % certain, that is what is causing it.  However your reply about\n oral drugs only has me worried. \n ",
      "MessageIndex": 13,
      "PostDate": "10/08/2005",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=281078",
      "Title": "Chemo Options"
    }
  ]
}