{
  "AuthorID": "Ryoko",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=401257&p=14735",
  "Posts": [
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=401257&p=14735",
      "Content": " (((((Mia))))),\n I know what you are going through! I feel for you!! For dry skin there is a lotion I found in WalMart's diabetic section. I am at a loss for the name Keto something anyway it works WONDERS for dry skin and doesn't smell bad either. The memory thing is another thing I hate too. I used to take Ginko but found even herbals aren't as effective after a while. My loving husband thought a PDA might help but the technology is not my thing so post-it's are everywhere. lol .\nThe emotional distress and hot flashed will go away after a little while once your body gets used to the absence of estrogens in the amount it used to have. I ate chocolate to make me feel happier. I think it works :o). But the one thing I will say is talk to your doctor about\n vaginal dryness, it goes along with menopause. I had no idea until I had to make an appointment with my gyno and she told me I was atrophied due to dryness. My hubby is understanding but I wouldn't wish it on my worst enemy.\nYou might already do this but drink lots of water, it helps with the hot flashes. Big hugs for you and rambling is okay! It does get better, think of the money you can save on sanitary supplies \n . Take care!\nMelissa ",
      "MessageIndex": 9,
      "PostDate": "18/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=401257",
      "Title": "Any help available for menopausal symptoms?"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=402659&p=14735",
      "Content": " I have a question. I went for my mammogram and sonogram today. The technician came in and said he couldn't see any abnormalities, but I am to still get the biopsy done. Here's my question: Do I need to do that if he didn't find anything wrong? They are pretty reliable aren't they? Are sunken depressions and lumps normal? Okay that's more than one but they didn't have time to answer my questions and I was hoping you might have some insight. Thank-you for being here.\nMelissa ",
      "MessageIndex": 0,
      "PostDate": "19/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=402659",
      "Title": "One Appt Down!"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=406376&p=14735",
      "Content": " Thank-you all so much for your support. I really do appreciate your kind words and encouragement. I am not panicking anymore, I will let you all know how it goes. I hope you all have a great evening!\nMelissa ",
      "MessageIndex": 2,
      "PostDate": "24/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=406376",
      "Title": "Biopsy reset!?"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=406376&p=14735",
      "Content": " Thank you too Steph! Yeah I am quite the impatient person. I am planning to get out and have a little fun this weekend, celebrate my B-day and leave my worries at the door. Have a great weekend!\nMelissa ",
      "MessageIndex": 6,
      "PostDate": "26/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=406376",
      "Title": "Biopsy reset!?"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=416488&p=14735",
      "Content": " Thank you so much ladies! God bless you all! ((((Big hugs!))))\nLove,\nMelissa ",
      "MessageIndex": 10,
      "PostDate": "08/02/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=416488",
      "Title": "Results!"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=413153&p=14735",
      "Content": " OOOhh Thank=you for your thoughts and prayers! I managed okay, I am sore through the shoulder and underarms now though. They told me I should know b Tuesday. They took 5 core samples, my DH didn't pass out! I am so proud of him. \n I have purchased some chocolate covered pretzels and Tylenol and I am going to lounge in front of the t.v. tonight. Thank you for being so supportive, I will let you know how it turns out! Have a great weekend!\nLove,\nMelissa ",
      "MessageIndex": 9,
      "PostDate": "03/02/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=413153",
      "Title": "Ack!! Biopsy tomorrow!"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=396690&p=14735",
      "Content": " Hello,\n I usually can be found in ADHD but I have a question. A little history, I am 31 and have been post menopausal for 10 years now. I never carried a child to term and I smoke. I know it is bad. My husband's step father a few years ago lost his wife to BC and made it his mission in life to get out the word on early prevention. When he met me he told me to always do a self exam at least once a month and to be familiar with my breasts, and he gave me a shower card. I listened. The problem is last night I was getting ready for my shower when I was taking off my shirt and my arms were raised I looked at my breasts. My right breast had a large sunken depression just below a large lump. I got in the shower and did my exam and panic started to set in. I had my husband see the depression and feel to see if he thought it was a lump. He told me he wants me to go to the doctor. Is this normal? I am too scared to think entirely straight. \nMelissa ",
      "MessageIndex": 0,
      "PostDate": "11/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=396690",
      "Title": "A sunken depression on my right breast???"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=396690&p=14735",
      "Content": " Thank you all,\n I appreciate the input. I have an appt tomorrow morning. (Sigh) nerves.\nMelissa ",
      "MessageIndex": 3,
      "PostDate": "12/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=396690",
      "Title": "A sunken depression on my right breast???"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=396690&p=14735",
      "Content": " Okay, still breathing. I went to see my doctor and he did the exam. He said I do indeed have a lump, there are changes in my breast and he did not believe it to be a fibroid. He is sending me to get a mammogram and ultrasound and he wants me to see a breast specialist. He said he was concerned with the puckering of my skin and changes to the nipple. He was very kind and thorough. I guess I will find out the when and wheres on Monday. What a Friday the 13th. I know it doesn't help to panic, I am scared though.\nMelissa ",
      "MessageIndex": 11,
      "PostDate": "13/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=396690",
      "Title": "A sunken depression on my right breast???"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=400098&p=14735",
      "Content": " Hello,\n I have my mommogram and ultrasound set for this Thursday the 19th and then the following Tuesday they are doing a needle biopsy. That was fast! I am glad I won't have to sweat it out for another 2 weeks. I do have a question my husband mentioned and when my doctor mentioned made me wonder. I have lost over 13 pounds in the last month. Not by choice, I have been so sick to my stomach. I can't seem to keep things down much lately and when I do manage to I end up with diarrea. The other thing I was wondering about\n was hairloss. Handfuls everytime I wash or brush my hair. Can cancer cause that? I feel silly for even asking but it has been on my mind lately.\nMelissa ",
      "MessageIndex": 0,
      "PostDate": "16/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=400098",
      "Title": "Appointment set!"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=400098&p=14735",
      "Content": " I appreciate you all and I will let you know what they find after the biopsy. Thanks for being here!\nMelissa ",
      "MessageIndex": 6,
      "PostDate": "17/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=400098",
      "Title": "Appointment set!"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=406376&p=14735",
      "Content": " OOOhhh, big hug for you all!\n I have started researching and it has really helped me understand the procedure. I have my pink feather and I will let you all know how it goes. I can't tell you all how much you have helped me and countless others. I really do appreciate you!\nMelissa ",
      "MessageIndex": 5,
      "PostDate": "25/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=406376",
      "Title": "Biopsy reset!?"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=406376&p=14735",
      "Content": " Louieloui,\n She said they would take a chunk then place a metal marker in it so they could locate it again if need be. She said she would make an incision about\n the width of her finger and the marker would be the size of George Washington's nose on the quarter. Not too bad I guess. lol\nMelissa ",
      "MessageIndex": 3,
      "PostDate": "25/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=406376",
      "Title": "Biopsy reset!?"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=406376&p=14735",
      "Content": " Okay, what a day I have had! I didn't have a great to begin with. Sleep deprived and a headache to boot, I know I couldn't have aspirin or tylenol so I refrained. I went to appt and was 15 minutes early and had all my paperwork. I was sent to my room fifteen minutes after my appt was supposed to start. I got the paper top and put it on. My hubby came with me for support and we sat down to wait in our room.\nAfter 45 minutes went by I was beginning to think they had forgotten about\n me so I popped my head out and saw no one around, after another 15 minutes my hubby had to leave to go back home to get our son from school. I flagged down a nurse and asked how much longer and she said any minute. Finally she came in and asked what was going on. She said the mammo and sonogram were fine. I showed her the sunken spot and the lump. She had me raise my arms and lower them and put them out to the sides and front and then she did a breast examination of both breasts and said: \"Oooh here it is. There is a lump here for sure.\" She said there was a large lump and my lymph nodes were slightly swollen. She wanted to do an ultrasound to get some pictures. She marked the spot and did the ultrasound and took 2 pictures of the lump. It looked huge to me when it was on the screen, surely they magnify the images don't they?\nLong story short she said since I took aspirin 2 days ago I had to wait another week aspirin free and come back for a biopsy. She said because of it's size she was going to make an incision instead of a fine needle aspiration. Now I am panicking. I am glad she found the lump because I hate feeling like I am crazy, but scared because it is there. I go in on the 3rd of February.\nMelissa ",
      "MessageIndex": 0,
      "PostDate": "24/01/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=406376",
      "Title": "Biopsy reset!?"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=416488&p=14735",
      "Content": " Hello everyone!\n The results came back B-9!!!!! I still have another appointment but I wanted to thank everyone for their support and caring words and the PCE in my time of crisis. Thank you sooo much! I will still be in from time to time to check on everyone, I hope you all have great days. \nLove,\nMelissa ",
      "MessageIndex": 0,
      "PostDate": "07/02/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=416488",
      "Title": "Results!"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=413153&p=14735",
      "Content": " Sigh, \nI am a nervous wreck, soo I went and did a little retail therapy. I have gone from a size 24 top to a 14! The puckering on my left breast is more pronounced and it started to get sore, but only where the lump is. I know worrying is useless but I am such a needle weenie. Well I will let you know how it goes. Looking out for the PCE!\nTake care,\nMelissa ",
      "MessageIndex": 0,
      "PostDate": "02/02/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=413153",
      "Title": "Ack!! Biopsy tomorrow!"
    },
    {
      "AuthorID": "Ryoko",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=413153&p=14735",
      "Content": " (((Thank you Ellen.))) I am so scared, I have been doing research every day. I will let you all know how it turns out, I have my pink feather and thinking happy thoughts. \nLove,\nMelissa ",
      "MessageIndex": 5,
      "PostDate": "06/02/2006",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=413153",
      "Title": "Ack!! Biopsy tomorrow!"
    }
  ]
}