{
  "AuthorID": "Schumann",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2259562&p=134614",
  "Posts": [
    {
      "AuthorID": "Schumann",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2259562&p=134614",
      "Content": " I had a lump detected on the mammogram and it was malignant. I have since had the biopsy, the surgery, the radiation treatments and the tamoxifen. But, I am still here. I do not think it is a good idea to ignore a lump as they can be very aggressive. A biopsy should tell you what you want to know, and it should be done soon. This is not the time to be squeamish or a chicken. It is the time to be brave and get it seen to. I am also a 44 DD and it makes no difference at all. You don't need to lie on your stomach, do you? I didn't. So much depends of the size of the lump if it is malignant and the idea of leaving it would worry me, unless there is some good reason to think that it is ok. ",
      "MessageIndex": 4,
      "PostDate": "13/11/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2259562",
      "Title": "Scheduling a breast biopsy and dont know which to choose. scared and confused."
    },
    {
      "AuthorID": "Schumann",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2259605&p=134614",
      "Content": " 13 years! Carcinoma is cancer, I am afraid. Do have it removed and don't worry about\n the Tamoxifen. I take it; don't like it, but I am still here. I had radiation, which I hated, but I am still here. Just do exactly what they tell you to do, and it will hopefully turn out ok. Chemo is bad for the hair, but tamoxifen rarely causes that problem. I did not have chemo, but lots of people do, and they get through it. You just have to steele yourself to go through with the treatments, knowing that you will come through on the other side and hopefully, without the cancer. I am 72, and it is no different for us older women. We are all scared and facing a lot of unknown stuff. It has actually been much less bad than I expected, so just be brave!! ",
      "MessageIndex": 2,
      "PostDate": "13/11/2011",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2259605",
      "Title": "breast lump for 13yrs"
    }
  ]
}