{
  "AuthorID": "Sunshine0822",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2337788&p=139959",
  "Posts": [{
    "AuthorID": "Sunshine0822",
    "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2337788&p=139959",
    "Content": " In 2010, I moved back to a small, rural town. In July 2011 I went to the doctor because I had a lump (about\n the size of a marble) in my left breast. My nipple had also become inverted. She told me that it was nothing to worry about\n because of my age (36 at the time) and I had no family history of breast cancer. She did schedule a mammogram to be on the safe side. The report stated that I have dense parenchymal breast pattern. The lump did not show up on the mammogram and I was sent to a breast surgeon in a slightly larger town for a needle aspiration biopsy. When the doctor performed the physical exam, he said that I wasn't a candidate for aspiration and that he was going to need to take it out. I was schedule for an excisional biopsy that took place three days later. Before I left the hospital that day, the doc told me that it looked like a papilloma. When I went to my follow-up to have the stitches removed, he gave me my results. It wasn't cancer, but there were microcalcifications, fibroadenomas, fibrocystic breast disease, hyperplasia, etc. There were about\n 6 benign conditions listed. Since that time, I have been diligent about\n performing my BSE. \nBack in December, I noticed a pea sized lump in my right breast. I am accustomed to my breasts feeling \"lumpy\", but this one was caught my attention because it didn't feel like the rest. It stands out from the general \"lumpiness\". I told myself that it was probably just a cyst and waited through a couple of cycles to see if it would change with my hormones or anything but it did not. I also noticed that I had an enlarged lymph node in the breast/armpit area. I finally went to a new doctor Tuesday since this didn't seem to be going away, and he was a bit concerned. He asked me if they did an ultrasound or MRI over the summer, which they did not. He said that this is something that should have been done. He also did the exam and felt the lump, plus quite a few enlarged lymph nodes (I had only noticed one). I haven't been sick in a couple of years and the lymph nodes are not painful. I'm scheduled for a digital mammogram and ultrasound tomorrow. \nI'm just wanted to run this by people who have been through it because I don't know anyone who has had breast cancer. I know that the chances are great that this will be benign as well, but any advice would be great. Are the enlarged lymph nodes a bad sign? Should I seek a second opinion, regardless of the outcome? Will I have to go to the doctor each time I feel a lump? How did you guys find peace of mind? ",
    "MessageIndex": 0,
    "PostDate": "08/02/2012",
    "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2337788",
    "Title": "Breast Lumps...Questions"
  }]
}