{
  "AuthorID": "TigerFan",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=977570&p=56397",
  "Posts": [
    {
      "AuthorID": "TigerFan",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=977570&p=56397",
      "Content": " Saw the breast surgeon today and he recommended the core biopsy at first b/c he doesn't believe the microcalcs are malignant. However, after a discussion on how he can't be sure he would get all types of tissue to biopsy, I requested that he remove all the tissue in question. So, tomorrow I am having a breast needle localization and then he will surgically remove the area.\nI feel much happier with this decision. I feel confident that the results from the pathologists will be thorough b/c they will be able to test all the tissue involved. My mind is already at rest! ",
      "MessageIndex": 10,
      "PostDate": "28/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=977570",
      "Title": "Microcalcifications found"
    },
    {
      "AuthorID": "TigerFan",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=977570&p=56397",
      "Content": " My sister is doing fine; although communication is not great about\n her cancer b/c she has always refused to talk about\n it... even to her own adult daughters! \nGuess I'm a bit confused by your reply, MK. Are you saying that a needle biopsy is good as a first step b/c if it is cancer, then plans for reconstruction can be made when a mastectomy is scheduled? \nBut if the findings are benign after the needle biopsy, I'd still have the microcalcifications in my body. And for me, no matter what the findings, I'd want them removed. I'd worry if I didn't have them removed.\nI'll get a lot of answers Wed. from the breast surgeon, but thanks for responding so I can arm myself with the right questions to ask! ",
      "MessageIndex": 1,
      "PostDate": "24/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=977570",
      "Title": "Microcalcifications found"
    },
    {
      "AuthorID": "TigerFan",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=977570&p=56397",
      "Content": " After spending lots of time reading other posts here, I called and got the radiologist's report this afternoon. It confirms a \"cluster of calcifications, which are regarded as suspicious for neoplasm. Stereotactic core biopsy is recommended.\"\nQuestion: From my understanding after researching this type of biopsy, I'm not sure this core needle will vacuum out all the questionable cells. If I want to be sure there is no doubt they get all the suspicious cells, shouldn't I ask for a type of biopsy where they cut and remove everything around the cluster? \nThanks for all the advice. I just want to be armed with all the knowledge and questions for the breast surgeon when I go this Wed. ",
      "MessageIndex": 2,
      "PostDate": "26/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=977570",
      "Title": "Microcalcifications found"
    },
    {
      "AuthorID": "TigerFan",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=977570&p=56397",
      "Content": " \n \n \n ",
      "MessageIndex": 0,
      "PostDate": "23/11/2007",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=977570",
      "Title": "Microcalcifications found"
    }
  ]
}