{
  "AuthorID": "timirand",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2445419&p=148597",
  "Posts": [
    {
      "AuthorID": "timirand",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2445419&p=148597",
      "Content": " Hello everyone - iam a 38 yr old healthy woman, I have 2 kids. i do kick boxing, just recently I got hit in the breast during kick boxing, to make a long story short, my boob swelled up like a clogged milk duct, it was hot to the touch very sore. went to the Dr thy did an ultrasound, said it was a bruise, after a little bit it went down alot, then a few months later it came back, went into the office they drained it said it was a breast abcess, put me on antibiotis for 40 days it went down a ton, but the lump is still there, so I went back my dr ordered an MRI and he called yesterday and now they want to do a biopsy, Iam so scared, but i talked to my old dr she retired, but she said that its probably just the abcess hasn't gone away all the way, and that they should have kept me on the antibiotics untill it went away all the way, of course iam freaking about\n about\n cancer, but my dr said that it was cancer it would not have reacted to the antibiotics, anyone ever go through this? I can't sleep or eat or anything iam so scared, any thoughts please let me know!!\n \n ",
      "MessageIndex": 0,
      "PostDate": "19/06/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2445419",
      "Title": "So scared - Breast Abcesss breast biopsy"
    },
    {
      "AuthorID": "timirand",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2445419&p=148597",
      "Content": " what if it was there before I got hit and just didn't notice then it could be cancer or something? does Cancer have puss in all that as well? I have my biopsy this morning @ 8:30 and Iam so scared, I read the MRI report and it said Inflammatory Breast Cancer or the abbcess!! thats why I was asking if Antibiotics respond to cancer, well since you said no, I do feel better, but let me know about\n the lumpp if it was there before.\nThanks you,\nTina ",
      "MessageIndex": 1,
      "PostDate": "20/06/2012",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2445419",
      "Title": "So scared - Breast Abcesss breast biopsy"
    }
  ]
}