{
  "AuthorID": "What is really wrong?",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=4106021&p=171518",
  "Posts": [
    {
      "AuthorID": "What is really wrong?",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=4106021&p=171518",
      "Content": " Hello to all. Hoping for similar stories to help ease my mind. \n1st mammogram 1/24/19. Didn’t hear anything for 2 weeks, thought I was clear\nGot called back for follow up diagnostic mammogram and ultrasound. To say I was scared is an understatement. Since last week I have barely slept or eaten. Went today and saw a white spot in question. Ultrasound was a bit more challenging as the tech couldn’t find it. Radiologist came in and guided her. Still unsure I had to sit up in order for the image to be picked up. \nRadiologist seems sure it’s a Fibroadenoma and stated he’s 95% sure it’s benign. Of course only a biopsy will tell. \nDue to my health anxiety which was clear to them he gave me the option to wait 6 months and return or for a piece of mind get the biopsy since he felt due to nervousness I probably wouldn’t make it to that point. \nOf course I’m going 2/26 for the biopsy but I must admit I’m fearing the worst. Radiologist was very sensitive to my feelings and kept stating I would be fine. \nIn reading I see that this is more common in your 20-30’s but I am 41 so I believe this is why I fear it’s something more. As per the radiologist, the spot is smooth and gives no indication of anything dangerous. \nAnyone who can relate or has been given the same diagnosis please chime in so I can hear your story. This means the world to me and I see there is loads of support on this forum\n— no history of Breast cancer in family both sides ",
      "MessageIndex": 0,
      "PostDate": "12/02/2019",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=4106021",
      "Title": "Still worried"
    },
    {
      "AuthorID": "What is really wrong?",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=4106021&p=171518",
      "Content": " Thank you for responding. I keep trying to convince myself that the 95% sounds encouraging but my problem is that I get on google and read all sorts of articles that end up making me worst. \nHealth anxiety sucks and this is not how I want to be ",
      "MessageIndex": 5,
      "PostDate": "13/02/2019",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=4106021",
      "Title": "Still worried"
    },
    {
      "AuthorID": "What is really wrong?",
      "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=4106021&p=171518",
      "Content": " Thank you. I received my ultrasound results yesterday. \nNot exactly sure what I’m reading but the part that stood out was the BIRADS 4 Score. Doctor also noted that it’s 0.8 x 0.4 x 0.6 cm circumscribed hypoechoic nodule deep in breast\nHis recommendation is ultrasound guided core needle biopsy as the patient is very anxious and cannot wait for short term follow up\nI’m afraid of that score now. Sorry for rambling but my nerves are on a million. I somehow feel every pain possible when I never felt pain before outside my cycle. \nAre biopsies only given if the score is a 4 or is it possible he thinks something is wrong although he was very confident when stating he is 95% confident it’s benign. I just can’t function these past 2 weeks. \nI apologize for the long post but the responses mean so much to me. ",
      "MessageIndex": 6,
      "PostDate": "15/02/2019",
      "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=4106021",
      "Title": "Still worried"
    }
  ]
}