{
  "AuthorID": "Alpine",
  "AuthorURL": "https://www.cancerforums.net/members/114684-Alpine?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "Alpine",
    "AuthorURL": "https://www.cancerforums.net/members/114684-Alpine?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "Hello, I am new to this forum. This is my first post. I am 64 years old, have been diagnosed with T3 Prostrate cancer. PSA of 59 and a Gleason score of 7, prostrate enlargement at 38 mms,. normal being 36? Had needle biopsy done two months ago with results showing 92% high volume cancer involved. Every one of the biopsies had cancer cells, every one. Have no symptoms at all other than ED. Don\u0092t pee at night, no pain, still have orgasms although reduced and harder/longer to obtain. I have had a MRI and a bone scan. No sign of cancer anywhere but my prostrate. The Doctor said I need to do/decide something soon as this a high volume cancer and it this is the killer form of cancer and it will escape soon and get into bones or onto the bladder or into my spine next. I have talked to my Urologist,.. Aggressive treatment would be surgery with Radiation and Hormone therapy. Slightly less aggressive treatment would be 9 weeks of radiation therapy and if that didn\u0092t do it hormone therapy. Talked to a Radiation oncologist and the surgery oncologist etc and they have all given me worst case, best case options. That being said they all want the business and each doctor downplayed the others treatment? If I have Radiation first I can\u0092t have surgery later, if I have surgery most likely I will also need radiation and hormone therapy anyway. It all sounds like a run around end game of medical salesmanship. I eat raw foods mostly, exercise plenty, work outdoors everyday, I don\u0092t eat sugar or red meat and rarely even chicken, maybe once a week. I eat a lot of green raw vegetables. I am taking an alternative therapy,.. THC suppositories rectorally of very high dosages of lab tested cannabis oil,, 700 mgs of THC, every night for the past three months. They make me sleep like a baby and generally reduces my aches and pains great. I have arthritis pretty bad. Butt,.. the prostrate cancer is still there, the callus or lump is still there by another DRE exam recently last week. My question is anyone else at this stage or done this exact treatments offered to me and what have been the results of such treatments? Thank all of you for even reading all this and much appreciation to all this who answer. I have read all of Bob Keenans excellent thread. >>> Image Guided Radiation Therapy - week by week.",
    "MessageIndex": 0,
    "PostDate": "10/02/2015",
    "ThreadURL": "https://www.cancerforums.net/threads/42898-PSA-59-Gleason-7-Biopsy-92-cancer-in-all-lobes-of-prostrate-Still-contained?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "PSA 59, Gleason 7, Biopsy 92% cancer in all lobes of prostrate. Still contained"
  }]
}