{
  "AuthorID": "Austin",
  "AuthorURL": "https://www.cancerforums.net/members/32966-Austin?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Austin",
      "AuthorURL": "https://www.cancerforums.net/members/32966-Austin?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I am about to turn 15, but before all of you flame me for being too young, my main intention is just to help my dad in any way possible. He also does know a lot about this topic, but I was just trying to widen his research and look for any additional knowledge to help him make decisions. Also, are there any procedures that are non-invasive, at this point?",
      "MessageIndex": 3,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/24321-Alarming-PSA-Jump?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Alarming PSA Jump"
    },
    {
      "AuthorID": "Austin",
      "AuthorURL": "https://www.cancerforums.net/members/32966-Austin?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hello, my dad had an alarming PSA jump. He jumped from 3.4 PSA to 9.6 PSA in the span of 2 years and 3 months. Also today, he received his Free PSA results and it was 6% We know that a biopsy is the next step but can anyone recommend anything else, what types of treatments to take into consideration, etc.? I have heard people on this forum saying it isn't the place for \"legal\" children to be around but I just want to have a Dad for a while longer, and since we have great dietary habits at home we presume it is genetic. Therefore, knowing more about this for when I'm older would help a lot. Thanks",
      "MessageIndex": 0,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/24321-Alarming-PSA-Jump?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Alarming PSA Jump"
    },
    {
      "AuthorID": "Austin",
      "AuthorURL": "https://www.cancerforums.net/members/32966-Austin?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I forgot to mention a couple of things. He is 54 years old and has a small prostate, said by doctors who performed the prostate exams on him. He also has trouble urinating, and has had trouble for 5 years now. Therefore we can only speculate that because his prostate is small, that there is some interference between the inner prostate and his urethra. Thanks to all who reply to this post",
      "MessageIndex": 1,
      "PostDate": "21/07/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/24321-Alarming-PSA-Jump?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Alarming PSA Jump"
    }
  ]
}