{
  "AuthorID": "BriG",
  "AuthorURL": "https://www.cancerforums.net/members/116707-BriG?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "BriG",
      "AuthorURL": "https://www.cancerforums.net/members/116707-BriG?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks for the Reply. You did not mention if you were in the midst of a prostatitis flare up at the time of your latest PSA blood drawing. That's a bit of a tricky part. I was diagnosed with pudendal neuralgia earlier this year after injuring myself last year while cycling. So far it's seemed like a textbook case but pudendal neuralgia can be fairly tricky. Some symtoms do have a crossover with prostatitis. With these latest numbers I'm starting to wonder.",
      "MessageIndex": 2,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/45010-New-here-recent-increase-in-PSA?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "New here, recent increase in PSA."
    },
    {
      "AuthorID": "BriG",
      "AuthorURL": "https://www.cancerforums.net/members/116707-BriG?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Age: 46 Not in any PC risk categories. PSA 12 months ago 2.51 PSA 6 months ago 2.62 Current PSA 6.2 with a free PSA of 11% DREs by two different Urologists over the last 6 Months were normal. History of several flare ups of prostatitis in my mid 20s, early 30s with one chronic case lasting 9 months. Has not seemed to be a issue in the last decade though. My Urologist is currently scheduling an MRI, not sure what type, they haven\u0092t gotten back to me yet. Currently trying to get up to speed on everything. Is there anything I should be looking out for, or pushing for at this juncture? Thanks for any insights you may have.",
      "MessageIndex": 0,
      "PostDate": "27/07/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/45010-New-here-recent-increase-in-PSA?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "New here, recent increase in PSA."
    }
  ]
}