{
  "AuthorID": "canesmacker",
  "AuthorURL": "https://www.cancerforums.net/members/117988-canesmacker?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "canesmacker",
      "AuthorURL": "https://www.cancerforums.net/members/117988-canesmacker?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi all. This is my second post on the board. First post disappeared and the admins are working to resurrect it if possible. Therefore, I will provide my history again to provide context to my question: I'm 48, no family history of prostate cancer on both mother/fathers side, PSA 2.43, cystoscopy revealed slight enlargement of prostate. What got me to the Dr in the first place? About a year ago I noticed my urine flow was weaker but didn't pay much mind to it. However, approximately 6M ago my wife commented to me that she noticed my ejaculate was less than what she remembered. I also noticed after masturbation too. About a month ago, I noticed the urine flow was noticeably weaker than before. That's when I decided to go to the Urologist. Urologist had urine sent for urinalysis - negative - no infections, etc. Then a blood test to check PSA - came back 2.43 - he stated high for my age but not an indication of anything until further blood tests in 6M. Recommended second urinalysis - negative - no infections, etc. Recommended cystoscopy - revealed slight enlargement of prostate which was most likely the cause of urinary issue. Recommended MRI So now to my question. After receiving recommendations from other members of this forum in my first post that I should obtain a 3T MRI vs a 1.5T, I would like to better understand why. My Dr stated that the facility he set me up with has a 1.5T MRI and the technician is very good at interpreting the scans. He has a relationship w/the technician and I guess they review the scans together to come to an agreement, etc on results. All fine and dandy except if you have the latest technology at another facility, why not use it? I'm in NY so I found a few facilities in NYC and out in the suburbs with 3T MRI capability. My Dr stated I could use any facility I preferred and he would review like any other scan which I expected him to state such. Any comments/recommendations/experiences would be appreciated. If there's another post on this very subject I apologize as I didn't find it. Thanks again to everyone who provided the info to ease some of my anxiety in my first post.",
      "MessageIndex": 0,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/46639-3T-vs-1-5T-MRI?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "3T vs 1.5T MRI"
    },
    {
      "AuthorID": "canesmacker",
      "AuthorURL": "https://www.cancerforums.net/members/117988-canesmacker?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thx ASA. So I understand your reply - you mention use of \"an endo-rectal coil, and also use a contrast dye, that will further sharpen the images.\" I'm only going in for an MRI not a biopsy at this stage. So \"an endo-rectal coil, and also use a contrast dye, that will further sharpen the images\" would only apply if I were to have a biopsy - correct?",
      "MessageIndex": 2,
      "PostDate": "14/12/2015",
      "ThreadURL": "https://www.cancerforums.net/threads/46639-3T-vs-1-5T-MRI?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "3T vs 1.5T MRI"
    }
  ]
}