{
  "AuthorID": "Caregiverinfo",
  "AuthorURL": "https://www.cancerforums.net/members/113021-Caregiverinfo?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Caregiverinfo",
      "AuthorURL": "https://www.cancerforums.net/members/113021-Caregiverinfo?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi, My dad was underwent a radical prostectomy 2.5 years ago. His PSA started rising over the past year. Over the past 9 months (.02, .02, .03) so now they are recommending 7 weeks of radiation. He is reluctant to tell anyone about his recurrance. So I thought I would ask some others who have gone through similar treatment and your experiences. First mapping... Where is the tattoo located, how many and where are they located? He does not want people to be able to see it. Two, he intends to drive himself to 7 weeks of radiation ( about 5 hours including treatment round trip). Does the radiation make you tired? I have heard it is a cummulative effect. If so at what point in your treatment did it start to effect you? Three... Are there any lotions or treatments that you used to avoid / treat radiation burns? Four and lastly were there any other side effects? Incontinence? That is his biggest worry. I would appreciate any and all answers. I am a breast cancer survivor myself and found these boards extremely useful during my treatment. Thanks All Kim",
      "MessageIndex": 0,
      "PostDate": "06/10/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/41127-Radiation-2-5-years-after-prostectomy-Questions?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Radiation 2.5 years after prostectomy... Questions"
    },
    {
      "AuthorID": "Caregiverinfo",
      "AuthorURL": "https://www.cancerforums.net/members/113021-Caregiverinfo?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Yes I was wrong 😄. Thanks for your help. He hates asking and is so worried people will look at him differently. I went through chemo 10 years ago for breast cancer and didn't have the choice to not tell people... It was quite obvious being bald and all. We all handle things so differently. It's hard being on the either side, the diagnosed or the loved ones. Congrats on one year post! Here' s to many more to come Originally Posted by Bravehardon I am almost exactly 12 months post radiation. Did you have the decimal point in the wrong place re your dad's PSA? Tell your dad not to be afraid of radiation, it is now state of the art. The actual radiation lasts less than five minutes. There is an additional five minutes getting you positioned on the table and taking a mini cat scan to ensure everything is ok (empty bowel/full bladder). Allen",
      "MessageIndex": 5,
      "PostDate": "06/10/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/41127-Radiation-2-5-years-after-prostectomy-Questions?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Radiation 2.5 years after prostectomy... Questions"
    },
    {
      "AuthorID": "Caregiverinfo",
      "AuthorURL": "https://www.cancerforums.net/members/113021-Caregiverinfo?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks Allen! Great news for you and the info will be helpful. How long post radiation are you now? Hoping 0 is your new normal 😃",
      "MessageIndex": 3,
      "PostDate": "06/10/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/41127-Radiation-2-5-years-after-prostectomy-Questions?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Radiation 2.5 years after prostectomy... Questions"
    }
  ]
}