{
  "AuthorID": "David-RP-client",
  "AuthorURL": "https://www.cancerforums.net/members/121792-David-RP-client?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "David-RP-client",
      "AuthorURL": "https://www.cancerforums.net/members/121792-David-RP-client?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi everyone- seasons greetings to all. In line with everybody else here, I got quite an initial shock, when diagnosed with advanced prostate cancer. Removal was my best option, I was told, and that happened 3 years ago. I got very good information and counselling from the urologist and the nurses, and they pointed me towards people who could offer more information and advice. You need to continually develop a positive attitude to this scenario, and that is where spousal support and comfort is indispensable. Keeping a good sense of humour is also a great help. And I often joked about the procedure, with family and friends. Don\u0092t think that it\u0092s an easy fix \u0096 it is a major hurdle, especially for a couple who have had an extremely active sex life. But time assists you to find ways of coping. The first year took quite a bit of adjustment, until we now have our connubial bliss twice weekly, or more often if we are inclined. At 71, I still work outdoors, and sometimes it\u0092s 7 days a week, so fitness has been quite important in our return to a reasonable facsimile of life as we previously knew it. I chose not to dwell on my problem, but to stay optimistic, and to always move forward. Rather than hiding the problem, I found that talking with others about it was often therapeutic. May you all find a similar path.",
      "MessageIndex": 0,
      "PostDate": "28/12/2016",
      "ThreadURL": "https://www.cancerforums.net/threads/49801-Life-changing-hiccup?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Life-changing hiccup"
    },
    {
      "AuthorID": "David-RP-client",
      "AuthorURL": "https://www.cancerforums.net/members/121792-David-RP-client?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi, fellow survivors, I have no experience in using forums, so this may not be correct protocol. -Case details not yet available-Uro now practising overseas. Layman’s terms for now- Not aware of any prostate problems in extended family. Very few doctors visits for 30 years. Late 2012 – PSA reading found to be 6. Late 2012- Biopsy undertaken, adenocarcinoma. Early 2013-ordinary radical prostatectomy. Gleason scale 8 out of 10. Uro advised that prostate was quite enlarged, cancer was only 1mm from prostate edge. – catheter out 13 days. Incontinence at 6 months was bearable. After exercises, at 12 months, no pads except for emergency. Cialis prescribed, – only about 50% erections – with vacuum pump and injections, erections later about 80%. Current erections very satisfactory (90%) with pump only. Orgasms are quite good, considering. The urethra was quite shortened, with a large prostate removed, (original difficulty after the procedure, in locating the penis, for urinating accurately), but it has now stretched and lengthened amazingly with regular CAUTIOUS use of the pump. Now at 3 to 4 inches at rest, and back to 8 inches erect. Very pleased. -David.",
      "MessageIndex": 0,
      "PostDate": "29/12/2016",
      "ThreadURL": "https://www.cancerforums.net/threads/49806-Laymans-case-notes?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Laymans case notes"
    }
  ]
}