{
  "AuthorID": "Deb 27",
  "AuthorURL": "https://www.cancerforums.net/members/112515-Deb-27?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Deb 27",
      "AuthorURL": "https://www.cancerforums.net/members/112515-Deb-27?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "So my husband had a positive biopsy for prostate cancer 4+3=7 and 3+3=6 and is considering having his prostate removed. We live in a mid sized town where the doctor told him that b/c of prior abdominal surgery, he may not be a candidate for the robotic surgery due to potential adhesions and may have to get the open prostate surgery. Has anyone had prior abdominal surgery and then needed to get their prostate out? What method did they use? It sounds like the robotic surgery is a little easier. We are going to get a 2nd opinion at another urology clinic anyway but I was wondering if anyone here had that experience. Thanks!!",
      "MessageIndex": 0,
      "PostDate": "30/08/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/40563-Previous-abdominal-surgery-and-need-to-have-prostate-out?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Previous abdominal surgery and need to have prostate out"
    },
    {
      "AuthorID": "Deb 27",
      "AuthorURL": "https://www.cancerforums.net/members/112515-Deb-27?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thank you so much for your replies. We decided to go over to Mayo Clinic, which is about 2.5 hours from where we live. That way, we should get a very experienced surgeon and a lot of technology. We felt that surgical skill was also important!!",
      "MessageIndex": 4,
      "PostDate": "31/08/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/40563-Previous-abdominal-surgery-and-need-to-have-prostate-out?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Previous abdominal surgery and need to have prostate out"
    },
    {
      "AuthorID": "Deb 27",
      "AuthorURL": "https://www.cancerforums.net/members/112515-Deb-27?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "So, my hubby had his prostate removed 2.5 weeks ago via open procedure and seems to be doing pretty well. At the time, his doctor said he is not recommending any further treatment but a post op PSA at 4 months. Isn't that a long time to wait? The following are his results: All 5 lymph nodes negative Adenocarcinoma, involving right and left lobes and confined within the capsule. Tumor involes right super inked surgical margin. Seminal vesicles are uninvolved. Primary pattern was grade 4, secondary grade 3. Percentage of prostate involved by tumor 5%. Margins involved by invasive carcinoma, unifocal. Perineural invasion was present. Additionally, it said it was high grade prostatic intraepithelial neoplasia. PT2c. So, the positive margins have me a little concerned as well as the perineural invasion!!! I just realized that was positive when I looked back at the report today. I am worried there is radiation in our future. His dad had aggressive prostate ca. Also, should he be watching his diet like eating a lot of veggies, cutting back on dairy and red meat? I asked his doc this and he said that is not conclusive that there are fads that come and go that get disproven and none have stuck so far. He has not gotten his urinary control back yet. At night he gets the urge, gets out of bed and pee's just fine. During the day, it's diaper time b/c it dribbles out. He is doing his kegel exercises. Thanks so much. I've read a lot on this forum and it's really great. I wish my hubby was good with the computer and could get on here. He'd really get a lot out of it.",
      "MessageIndex": 0,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/41445-I-am-worried-about-these-results-from-final-prostate-surg-path-report?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "I am worried about these results from final prostate surg/path report:"
    },
    {
      "AuthorID": "Deb 27",
      "AuthorURL": "https://www.cancerforums.net/members/112515-Deb-27?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thank you all so much for your replies! These forums are such a life saver, or should I say sanity saver! I feel a lot better now. I tend to get anxious anyway but hate it b/c there's just no use in worrying. His father did have aggressive prostate cancer with extensive surgery. He survived for 20 years and did not have a relapse. Glad to hear that radiation isn't too bad if you have to get it. Yes, the nurse at Mayo told him not to overdo the Kegels. They suggest three times a day, one set standing, the other seated and the other lying down. They said if you feel sore at all to back off. So, that's what he is doing. Thanks again and wishing you all good health-",
      "MessageIndex": 6,
      "PostDate": "29/10/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/41445-I-am-worried-about-these-results-from-final-prostate-surg-path-report?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "I am worried about these results from final prostate surg/path report:"
    }
  ]
}