{
  "AuthorID": "ForeverFree",
  "AuthorURL": "https://www.cancerforums.net/members/31420-ForeverFree?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "ForeverFree",
    "AuthorURL": "https://www.cancerforums.net/members/31420-ForeverFree?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "I wanted to discuss a situation that is unique to me, and see what thoughts people have on it. First, some background. I am 56 yrs old. I was diagnosed with PCa earlier this year. I had complained of problems with urination with my doc, who ordered a PSA; that came back at 4.14. My urologist was concerned that my PSA had risen from a 1 many years earlier to a 4.14 - I think this escalation in PSA is called PSA velocity. I did a biopsy, which discovered I had prostate cancer, Gleason score of 8. Surgery was recommended. I did go to see a radiation oncologist; he told me in no uncertain terms that surgery was the best option given that my Gleason score indicated an aggressive cancer. I had DaVinci laproscopic surgery on April 26. My post recovery has been very difficult, for a number of reasons that I won't get into right now. But one issue I have is that, almost 3 weeks after surgery, I still have a catheter. As I understand it, most people have their catheter removed after 2 weeks. Mine is still in because x-rays/scans indicate there are 2 \"leaks\" from my bladder. As best I understand it, in a prostatectomy, the bladder is attached to the urethra tube after the prostate is removed; in my case, this process resulted in small pin-sized holes in the bladder (or perhaps in the area where the bladder was reconnected to the urethra). Has anyone here experienced this? I wonder - is this a sign that perhaps the surgeons \"didn't do a good job,\" so to speak? No, I'm not ready to cry \"malpractice,\" but I wonder why so many have their catheter removed after 2 weeks - in some cases, even 10 days - while my catheter could be in for an entire month. Note that, I will have cystogram or other type test this coming Friday (22 days after surgery), and the urologist has indicated that there is a chance that the leaks might not be healed by then. The cystogram will test for leaks and other aspects of bladder function. (If the catheter was as problem free as, for example, my Jackson-Pratt drain - which was removed 19 days after surgery - I'd have no issues with it. But I have had inflammation and slight bleeding issues with the catheter, and I do wish it could be removed - but the timing of that is out of hands.) Any thoughts?",
    "MessageIndex": 0,
    "PostDate": "16/05/2012",
    "ThreadURL": "https://www.cancerforums.net/threads/23264-Catheter-in-for-3-4-weeks-how-normal-is-this?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "Catheter in for 3-4 weeks; how normal is this?"
  }]
}