{
  "AuthorID": "gbob",
  "AuthorURL": "https://www.cancerforums.net/members/109896-gbob?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "gbob",
    "AuthorURL": "https://www.cancerforums.net/members/109896-gbob?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "Originally Posted by Sarg I agree! I have ate hot peppers in one form or another almost every day for as long as I can remember. And now I am waiting on a surgery date to be set for my prostate to be removed. So did it do anything for me, probably not! But for you or someone else it may. What works for one may not for another. Also, I do not plan on quitting eating hot stuff either any time soon! I was given less than a 20% chance of 5 year survival with my spreading out of the organ and into my gut, gleason 8, 3 month doubling time tumor in 2003. At diagnosis I was 53 with 4.6 PSA. Three months later I was 9.8 at surgery. By chance, I had started eating habaneros at this time. I didn't learn until last year that prostate tumors in mice fed the equivalent per weight of 10 habaneros per week didn't grow. I can eat as many as 9 at a meal but my eating of them (and ghost peppers is not a constant dose). I am still so healthy that it is a bit embarrassing to say I have cancer. I don't know how many hot peppers you munch, but few can keep up with me. Since Sept 15, 2013 I have eaten: 18 Ghost Peppers 147 Habaneros 48 jalapenos 6.97 cups of crushed red pepper on pasta. On a weight basis, I am eating more than what the mice did in this article. http://m.cancerres.aacrjournals.org/...66/6/3222.long This is also an interesting article http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2825034/ There will never be a clinical trial of Habaneros because if someone isn't used to them such high levels of hot peppers will rip up their guts. High doses of capsaicin may not be helping me but I am a statistical outlier and I do eat loads of habaneros. There are old studies (1994) suggesting capsaicin causes gastric cancer, but I already have a life-threatening cancer. If capsaicin will stave off the day it gets me, I might risk gastric cancer. I haven't seen anything new on this.",
    "MessageIndex": 6,
    "PostDate": "10/03/2014",
    "ThreadURL": "https://www.cancerforums.net/threads/27275-Habanero-Peppers-Capsaicin-questions?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "Habanero Peppers / Capsaicin questions."
  }]
}