{
  "AuthorID": "iLoveDad",
  "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "What does triple play means? I'm sorry I am very new to this, but trying to find and read as much info as I can",
      "MessageIndex": 12,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54476-Gleason-9-10-Progression-amp-Mortality-RP-vs-EBRT-vs-EBRT-Brachy?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Gleason 9-10 Progression & Mortality: RP vs. EBRT vs. EBRT+Brachy"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "What does triple play means? I'm sorry I am very new to this, but trying to find and read as much info as I can",
      "MessageIndex": 2,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54476-Gleason-9-10-Progression-amp-Mortality-RP-vs-EBRT-vs-EBRT-Brachy?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Gleason 9-10 Progression & Mortality: RP vs. EBRT vs. EBRT+Brachy"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Originally Posted by Michael F Welcome iLoveDad ! Very sorry about your father's status and hope that his medical team of MDs arrive at the best treatment regimen for an optimal outcome. We are not MDs, so we can not give medical advice. However, several members of The Forum have experience with metastatic prostate cancer (PCa) and will provide information from their experiences. Prostate Biopsies (Bx) are very small samples from the prostate gland. They can miss site of PCa and result in (-) findings when, in fact, there is PCa present. Starting HT immediately was the most important 1st step. This will slow down the progression of his PCa. His PSA will drop as well. His MDs will monitor his PSA to determine his response. Metastatic PCa is not curable BUT it is manageable. In the U.S. there are many types of drugs that block the effects of testosterone. There are also chemotherapy, immunotherapy, and radioactive agents used to manage the disease. Try to find out if, in Singapore, there is a Medical Oncologist on his team who treats a lot of PCa patients. You are a wonderful and caring daughter. Stay optimistic as we all hope that his MDs get this under control and successfully managed for many years ahead. The entire Forum is with you! MF Hey Michael F, thank you for your reply, super informative. So I guess the prostate biopsies (according to my Dad, he did twice) shown clear and no findings are what you've mentioned a miss site.(this is quite frustrating because it could've been found years ago!) I was initially unsure about HT injection, because the doctor hurried him to do it right after informing him of his report. He did not mention any side effects or any concerns, but he did say injection Lucrin depot(Leuprorelini acetas) will cause loose bones. (not sure what he mean by that) I have very vague information as I am in States and he is located in Singapore. However, it is a major center and he has been seeing the Urologist doctor for years. According to doctors, there is only one medication for HT used in Singapore. Doctor has mentioned that chemo,immu,radio are not an option for him, I wonder if its due to his age or health condition as he did two major surgeries in past. I'm thinking of transferring him to National Cancer Center, but he seems to refuse it. I'm glad that there are Metastatic PC survivors here, Im afraid to lose him. I have very little information, I do have his full PET and CT scan reports and a gross description of the recent biopsy taken from the bone, still trying to get the past 2 prostate biopsies from the doctor via email, hope he replies. Not sure what does \"Core of biopsy\" mean, I'm very new to this.",
      "MessageIndex": 6,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Originally Posted by DjinTonic Welcome iLoveDad, but of course I'm sorry you and your dad have to deal with this. I'm not clear if the prostate biopsy has been done. If it was, you should get the path report. If there is a diagnosis of metastatic prostate cancer (bone and lymph nodes?), and the docs have no standard-of-care drugs other than ADT they think will be of benefit, you could ask them if there is a clinical trial that might be suitable. I wish you the best of luck--let's see what other Forum brothers have to say--I don't know much about metastatic PCa. Thank you for your prompt reply, i'm trying my best to give him encouragement, looking through for metastatic PCa survivors. I'm requesting for the path report, not sure why it wasn't given to us. After reading some posts, I am getting positivity that this can be controlled and we can do it!",
      "MessageIndex": 15,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Originally Posted by DjinTonic Welcome iLoveDad, but of course I'm sorry you and your dad have to deal with this. I'm not clear if the prostate biopsy has been done. If it was, you should get the path report. If there is a diagnosis of metastatic prostate cancer (bone and lymph nodes?), and the docs have no standard-of-care drugs other than ADT they think will be of benefit, you could ask them if there is a clinical trial that might be suitable. I wish you the best of luck--let's see what other Forum brothers have to say--I don't know much about metastatic PCa. Thank you for your prompt reply, i'm trying my best to give him encouragement, looking through for metastatic PCa survivors. I'm requesting for the path report, not sure why it wasn't given to us. After reading some posts, I am getting positivity that this can be controlled and we can do it!",
      "MessageIndex": 5,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi everyone, I'm a new member here. I'm here to share a strange case of my father's situation, hope to get some feedback. My dad is 68 years old and recently diagnosed with Prostate Cancer. He's been doing exercises and balanced lifestyle, however used to be a heavy drinker. I am currently living in the States married to my American husband, however I come from Singapore, and both parents living there. It is hard for me to go through these because being far away half a globe from home. I'm currently going through Permanent Residence pending process, which only allows me to travel till December, when the temporary document expires, I will not be able to travel. This frustrates me alot because I am very worried and afraid that I will need to travel whenever there's emergency. I'm trying my best to give moral support to my dad as much as I can by talking to them daily via Skype and texting. I don't know what more I can do, but I know all parents do want to see their children being well and able to support on their own. This is now my priority. So let's discuss now about his prostate case: He had a open heart valve surgery many years ago, and a portion of his pancreas has been removed. He has genetic minor Thalessemia (Sickle Cell disease, I am inherited with minor mild of it too) For two years, he had difficulty in urinating, the first findings was when he was urinating blood, went to see a doctor and was given Tamsulosin, he has been taking it daily. PCa was not found and clear at that time. In 2017 Dec, it all happen when he started feeling pain on his backbone thinking that it was a sprain on the back, he went to see a Chinese physician who rubbed his back with medicated oil, and it really hurt him. Thinking that something is not right, and also it was time for him to do his regular check-ups for Pancreas, a CT scan was done, that was when they detected PSA level of 17.8H. Here is a portion of the report information: MAIN FINDINGS: 1. The left 10th rib destructive bone lesion with soft tissue component shows intense FDG uptake (SUVmax 7.6), suspicj-ous for metastasis. 2. Intense FDG uptake seen in bil-ateral external il-iac lymph nodes, the right with SUVmax 4.9 (Im 241) and the left with SUVmax 6.1 (Im 240) suspi-cious for disease. A further right internaf iliac lynph node shows only mild FDG uptake (SUVmax 2,0, Im 243) but j-s al-so suspicious for disease, 3. Enlarged prostate gland with mild heterogenous EDG uptake. There is slight focaf increased uptake in the left posterior aspect of the prostate gland (SUVmax 4.0, Im 256) which is indeterminate however, in view of rising PSA 1evels and bifateral- i-l-iac nodes, prostate carcinoma is not excluded. 4, Status post distal pancreatectomy and splenectomy for IPMN. Stable sna11 tubular fluid collection in the surgi-ca} bed extending from the distal pancreas to the stomach with calcifications. Stabfe mil-d soft tj-ssue thickening wi-th minj-mal- FDG uptake (SUVmax 2.4, Im 170) at the distal pancreatectomy surgical bed is stabl-e since CT of L9/03/1-4 and is 1i-ke1y post-operative. No evi-dence of local- recurrence. Other findings: No gross i-ntracranial mass fesion or significant metabolic abnormality. No FDG avid cervical or supraclavicuLar adenopathy. The nasopharynx, oro- and hypopharynx are unremarkable. Physiologj-ca1 FDG uptake is present in the tonsifs. No FDG avid hilar or medlastinal- adenopathy. No FDG avi-d pulmonary nodule. No pleural or pericardial effusion. Prior midline sternotomy, tricuspid and mi-tral- annuloplasty. Minor atel-ectati-c changes in the lung bases, Stabfe hepatic hypodensities with no discernible FDG uptake are too sma11 to characterise. Uncomplicated chol-elithiasis. There are stable small non-specific abdomi-nal- nodules in the Ieft anterior abdomen (Im 177 vs 4-44) , left posterior abdomen (Im 167 vs 4-43) and anterior to the urinary bladder (Im 241 vs 4-136) with no discernibfe fDG uptake. Mil-d FDG uptake within the bowel and stomach is likely physiological. He was then asked to do further PET SCAN and here is a portion of the report: MAIN FINDINGS: 1. The left 1Oth rib destructive bone lesion with soft tissue component shows intense FDG uptake (SUVmax 7.6), suspicious for metastasis. 2. lntense FDG uptake seen in bilateral external iliac lymph nodes, the right with SUVmax 4.9 (lm 241) and the left with SUVmax 6.1 (lm 240) suspicious for disease. A further right internal iliac lymph node shows only mild FDG uptake (SUVmax 2.0, lm 243) but is also suspicious for disease. 3. Enlarged prostate gland with mild heterogenous FDG uptake. Th-ere is slight focal increased uptake in the left posterior aspect of the prostate gland (SUVmax 4.0, lm 256) which is indeterminate however, in view of rising PSA levels and bilateral iliac nodes, prostate carcinoma is not excluded. 4. Status post distal pancreatectomy and splenectomy for IPMN. Stable small tubular fluid collection in the surgical bed extending from the distal pancreas to the stomach with calcifications. Stable mild soft tissue thickening with minimal FDG uptake (SUVmax 2.4, lm 170) at the distal pancreatectomy surgical bed is stable since CT of 19103114 and is likely post-operative. No evidence of local recurrence. IMPRESSION Overall findings may suggest underlying prostate carcinoma (possibly in the left postero-lateral aspect)with FDG-avid bilateral pelvic nodal and bone (solitary left 1Oth rib) metastases. Further imaging and histological correlation is however suggested. On February 2018 this year, he went for tests and reports shown that his Prostate is CLEAR, however since PET SCAN shows high level of PSA, he was advised to do biopsy and they found out that it has spread to the bone, and its metastasis. I am not sure why a full report is not given, but will request for it. I do not have information such as Gleason score, etc like what many of you have, but here is the report that was given to us: DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary. What confuses us is, the prostate test shown it was clear and hence the doctors told us they do not know and unsure where the Primary is. He is asking the whole team of doctors to discuss his case during the meeting and will let us know what we can do. But currently, he is given injection of LUCRIN DEPOT 11.25 mg on a 3 months basis, he just had his first Hormone Therapy yesterday, and was experiencing Hot Flushes, Headaches, Short of Breath, Soft legs at 2-4am. The doctor also informed us that it is not possible for other therapy as he is at the last stage as it spreads to BONE, we want to stay as positive as possible. I am trying to do what I can as much as possible as a daughter. I would like to hear from you guys who are going through the HT and have similar symptoms, if there's any diet or anything we can do.",
      "MessageIndex": 10,
      "PostDate": "07/03/2018",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Originally Posted by Michael F Welcome iLoveDad ! Very sorry about your father's status and hope that his medical team of MDs arrive at the best treatment regimen for an optimal outcome. We are not MDs, so we can not give medical advice. However, several members of The Forum have experience with metastatic prostate cancer (PCa) and will provide information from their experiences. Prostate Biopsies (Bx) are very small samples from the prostate gland. They can miss site of PCa and result in (-) findings when, in fact, there is PCa present. Starting HT immediately was the most important 1st step. This will slow down the progression of his PCa. His PSA will drop as well. His MDs will monitor his PSA to determine his response. Metastatic PCa is not curable BUT it is manageable. In the U.S. there are many types of drugs that block the effects of testosterone. There are also chemotherapy, immunotherapy, and radioactive agents used to manage the disease. Try to find out if, in Singapore, there is a Medical Oncologist on his team who treats a lot of PCa patients. You are a wonderful and caring daughter. Stay optimistic as we all hope that his MDs get this under control and successfully managed for many years ahead. The entire Forum is with you! MF Hey Michael F, thank you for your reply, super informative. So I guess the prostate biopsies (according to my Dad, he did twice) shown clear and no findings are what you've mentioned a miss site.(this is quite frustrating because it could've been found years ago!) I was initially unsure about HT injection, because the doctor hurried him to do it right after informing him of his report. He did not mention any side effects or any concerns, but he did say injection Lucrin depot(Leuprorelini acetas) will cause loose bones. (not sure what he mean by that) I have very vague information as I am in States and he is located in Singapore. However, it is a major center and he has been seeing the Urologist doctor for years. According to doctors, there is only one medication for HT used in Singapore. Doctor has mentioned that chemo,immu,radio are not an option for him, I wonder if its due to his age or health condition as he did two major surgeries in past. I'm thinking of transferring him to National Cancer Center, but he seems to refuse it. I'm glad that there are Metastatic PC survivors here, Im afraid to lose him. I have very little information, I do have his full PET and CT scan reports and a gross description of the recent biopsy taken from the bone, still trying to get the past 2 prostate biopsies from the doctor via email, hope he replies. Not sure what does \"Core of biopsy\" mean, I'm very new to this.",
      "MessageIndex": 16,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi everyone, I'm a new member here. I'm here to share a strange case of my father's situation, hope to get some feedback. My dad is 68 years old and recently diagnosed with Prostate Cancer. He's been doing exercises and balanced lifestyle, however used to be a heavy drinker. I am currently living in the States married to my American husband, however I come from Singapore, and both parents living there. It is hard for me to go through these because being far away half a globe from home. I'm currently going through Permanent Residence pending process, which only allows me to travel till December, when the temporary document expires, I will not be able to travel. This frustrates me alot because I am very worried and afraid that I will need to travel whenever there's emergency. I'm trying my best to give moral support to my dad as much as I can by talking to them daily via Skype and texting. I don't know what more I can do, but I know all parents do want to see their children being well and able to support on their own. This is now my priority. So let's discuss now about his prostate case: He had a open heart valve surgery many years ago, and a portion of his pancreas has been removed. He has genetic minor Thalessemia (Sickle Cell disease, I am inherited with minor mild of it too) For two years, he had difficulty in urinating, the first findings was when he was urinating blood, went to see a doctor and was given Tamsulosin, he has been taking it daily. PCa was not found and clear at that time. In 2017 Dec, it all happen when he started feeling pain on his backbone thinking that it was a sprain on the back, he went to see a Chinese physician who rubbed his back with medicated oil, and it really hurt him. Thinking that something is not right, and also it was time for him to do his regular check-ups for Pancreas, a CT scan was done, that was when they detected PSA level of 17.8H. Here is a portion of the report information: MAIN FINDINGS: 1. The left 10th rib destructive bone lesion with soft tissue component shows intense FDG uptake (SUVmax 7.6), suspicj-ous for metastasis. 2. Intense FDG uptake seen in bil-ateral external il-iac lymph nodes, the right with SUVmax 4.9 (Im 241) and the left with SUVmax 6.1 (Im 240) suspi-cious for disease. A further right internaf iliac lynph node shows only mild FDG uptake (SUVmax 2,0, Im 243) but j-s al-so suspicious for disease, 3. Enlarged prostate gland with mild heterogenous EDG uptake. There is slight focaf increased uptake in the left posterior aspect of the prostate gland (SUVmax 4.0, Im 256) which is indeterminate however, in view of rising PSA 1evels and bifateral- i-l-iac nodes, prostate carcinoma is not excluded. 4, Status post distal pancreatectomy and splenectomy for IPMN. Stable sna11 tubular fluid collection in the surgi-ca} bed extending from the distal pancreas to the stomach with calcifications. Stabfe mil-d soft tj-ssue thickening wi-th minj-mal- FDG uptake (SUVmax 2.4, Im 170) at the distal pancreatectomy surgical bed is stabl-e since CT of L9/03/1-4 and is 1i-ke1y post-operative. No evi-dence of local- recurrence. Other findings: No gross i-ntracranial mass fesion or significant metabolic abnormality. No FDG avid cervical or supraclavicuLar adenopathy. The nasopharynx, oro- and hypopharynx are unremarkable. Physiologj-ca1 FDG uptake is present in the tonsifs. No FDG avid hilar or medlastinal- adenopathy. No FDG avi-d pulmonary nodule. No pleural or pericardial effusion. Prior midline sternotomy, tricuspid and mi-tral- annuloplasty. Minor atel-ectati-c changes in the lung bases, Stabfe hepatic hypodensities with no discernible FDG uptake are too sma11 to characterise. Uncomplicated chol-elithiasis. There are stable small non-specific abdomi-nal- nodules in the Ieft anterior abdomen (Im 177 vs 4-44) , left posterior abdomen (Im 167 vs 4-43) and anterior to the urinary bladder (Im 241 vs 4-136) with no discernibfe fDG uptake. Mil-d FDG uptake within the bowel and stomach is likely physiological. He was then asked to do further PET SCAN and here is a portion of the report: MAIN FINDINGS: 1. The left 1Oth rib destructive bone lesion with soft tissue component shows intense FDG uptake (SUVmax 7.6), suspicious for metastasis. 2. lntense FDG uptake seen in bilateral external iliac lymph nodes, the right with SUVmax 4.9 (lm 241) and the left with SUVmax 6.1 (lm 240) suspicious for disease. A further right internal iliac lymph node shows only mild FDG uptake (SUVmax 2.0, lm 243) but is also suspicious for disease. 3. Enlarged prostate gland with mild heterogenous FDG uptake. Th-ere is slight focal increased uptake in the left posterior aspect of the prostate gland (SUVmax 4.0, lm 256) which is indeterminate however, in view of rising PSA levels and bilateral iliac nodes, prostate carcinoma is not excluded. 4. Status post distal pancreatectomy and splenectomy for IPMN. Stable small tubular fluid collection in the surgical bed extending from the distal pancreas to the stomach with calcifications. Stable mild soft tissue thickening with minimal FDG uptake (SUVmax 2.4, lm 170) at the distal pancreatectomy surgical bed is stable since CT of 19103114 and is likely post-operative. No evidence of local recurrence. IMPRESSION Overall findings may suggest underlying prostate carcinoma (possibly in the left postero-lateral aspect)with FDG-avid bilateral pelvic nodal and bone (solitary left 1Oth rib) metastases. Further imaging and histological correlation is however suggested. On February 2018 this year, he went for tests and reports shown that his Prostate is CLEAR, however since PET SCAN shows high level of PSA, he was advised to do biopsy and they found out that it has spread to the bone, and its metastasis. I am not sure why a full report is not given, but will request for it. I do not have information such as Gleason score, etc like what many of you have, but here is the report that was given to us: DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary. What confuses us is, the prostate test shown it was clear and hence the doctors told us they do not know and unsure where the Primary is. He is asking the whole team of doctors to discuss his case during the meeting and will let us know what we can do. But currently, he is given injection of LUCRIN DEPOT 11.25 mg on a 3 months basis, he just had his first Hormone Therapy yesterday, and was experiencing Hot Flushes, Headaches, Short of Breath, Soft legs at 2-4am. The doctor also informed us that it is not possible for other therapy as he is at the last stage as it spreads to BONE, we want to stay as positive as possible. I am trying to do what I can as much as possible as a daughter. I would like to hear from you guys who are going through the HT and have similar symptoms, if there's any diet or anything we can do.",
      "MessageIndex": 0,
      "PostDate": "07/03/2018",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Originally Posted by DjinTonic A biopsy consists of a hollow needle being \"punched\" into the prostate. After each punch the needle is removed and the \"core\" of tissue inside is removed. The number of tissue cores taken ranges from about 12 to 50+ depending on the type of biopsy. Logically, the more cores taken, the greater the sample of tissue from different zones of the prostate and the less likely it is to miss cancer, but, unfortunately biopsies do miss existing cancer. As biopsies are repeated, the chances of missing cancer go down. Hi DjinTonic again, thank you for your reply. This clarifies so much, I have been doing hours and hours of research and reading. Going to head to bookstore this weekend to get more information. Does this also mean the Pathologist is bad since it was taken twice before? I strongly suggest dad to move to another hospital, I just need to encourage and persuade him.",
      "MessageIndex": 18,
      "PostDate": "08/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hey DjinTonic, yes he has done prostate biopsy but it is a strange case that it is clear, doctors are unclear where the primary is. We are trying to retrieve path reports from doctor, it seems hard to get from them as they only provide us gross summary. I believe that when the doctor said the whole team is coming to discuss during the meeting tonight refers to the clinical trial. I hope for the best for him. However if he experience short of breath again tonight, should he be going to A&E? Or is this normal due to the side effects of LUCRIN DEPOT? I've been trying to research more about PCa and metastatic PCa which I have no clue of before this happen.",
      "MessageIndex": 2,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Originally Posted by DjinTonic A biopsy consists of a hollow needle being \"punched\" into the prostate. After each punch the needle is removed and the \"core\" of tissue inside is removed. The number of tissue cores taken ranges from about 12 to 50+ depending on the type of biopsy. Logically, the more cores taken, the greater the sample of tissue from different zones of the prostate and the less likely it is to miss cancer, but, unfortunately biopsies do miss existing cancer. As biopsies are repeated, the chances of missing cancer go down. Hi DjinTonic again, thank you for your reply. This clarifies so much, I have been doing hours and hours of research and reading. Going to head to bookstore this weekend to get more information. Does this also mean the Pathologist is bad since it was taken twice before? I strongly suggest dad to move to another hospital, I just need to encourage and persuade him.",
      "MessageIndex": 8,
      "PostDate": "08/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hey DjinTonic, yes he has done prostate biopsy but it is a strange case that it is clear, doctors are unclear where the primary is. We are trying to retrieve path reports from doctor, it seems hard to get from them as they only provide us gross summary. I believe that when the doctor said the whole team is coming to discuss during the meeting tonight refers to the clinical trial. I hope for the best for him. However if he experience short of breath again tonight, should he be going to A&E? Or is this normal due to the side effects of LUCRIN DEPOT? I've been trying to research more about PCa and metastatic PCa which I have no clue of before this happen.",
      "MessageIndex": 12,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54475-My-dad-s-strange-case-Beginning-of-PCa-Journey?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "My dad's strange case: Beginning of PCa Journey"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks for sharing! This is great and awesome, my dad wants to go on a vacation with family and I'm hoping to plan something soon when his condition is stable.",
      "MessageIndex": 7,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54478-Surviving-prostate-cancer?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Surviving prostate cancer"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks for sharing! This is great and awesome, my dad wants to go on a vacation with family and I'm hoping to plan something soon when his condition is stable.",
      "MessageIndex": 17,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54478-Surviving-prostate-cancer?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Surviving prostate cancer"
    },
    {
      "AuthorID": "iLoveDad",
      "AuthorURL": "https://www.cancerforums.net/members/127062-iLoveDad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "That is amazing! Keep it up and stay positive! Happy for you!",
      "MessageIndex": 4,
      "PostDate": "07/03/2018",
      "Signature": "DOB 1949, 68 years old, 173cm, 76kg, overall health good on regular light exercises, non smoker, drinker. 2009 Open Heart Valve Repair Surgery 2012 Half Pancreas and Whole Spleen was removed Prostate and colonoscopy tests shown clear. Biopsy 19 Feb 2018 DIAGNOSIS LEFT TENTH RIB LESION: Metastatic Adenocarcinoma,' Favour Prostatic Primary GROSS DESCRIPTION SPECIMEN LABELLED AS 'LEFT TENTH RIB LESION': 2 tissue cores are received fixed in formalin, 0.1 to 0.4 cm. The tissue is completely passed for histological examination. (1 block) tyn MICROSCOPIC DESCRIPTION LEFT TENTH RIB LESION: Section shows lytic bone lesion with metastatic adenocarcinoma surrounded by desmoplastic stroma. There is nuclear hyperchrmasia, inconspicuous large nucleoli, Immunohistochemical stains with appropriate controls show the following: Positive: CK19, PSA (Focal), PSAP Negative: CK7, CK20, P63, Hepar-1 TTF-1 Interpretation: The immunohistochemical stain results support a prostate primary",
      "ThreadURL": "https://www.cancerforums.net/threads/54480-Good-news-today?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Good news today"
    }
  ]
}