{
  "AuthorID": "JManarite1",
  "AuthorURL": "https://www.cancerforums.net/members/111589-JManarite1?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "JManarite1",
      "AuthorURL": "https://www.cancerforums.net/members/111589-JManarite1?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi - It's 2 weeks today from this conference for patients & caregivers in Punta Gorda. Just wanted to make sure anyone in FLORIDA knows about it. Click on this link for full details,www.TinyURL.com/Mar4Conf but here are a few things that might interest you: * Dr Stephen Bravo from Sandlake Imaging will answer questions about the new Axumin PET Scan * Dr Tom Fabian will answer questions about prostate MRI * Dr Michael Katin will answer questions about radiation & recurrent prostate cancer * Peggy Mellody, RN will talk about Insurance Exceptions & Appeals FULL Conference Details - www.TinyURL.com/Mar4Conf I worked for PCRI in Los Angeles for 14 years - I'm happy to bring a conference into my own neighborhood. Hope you can make it. FREE Lunch (if you register by March 2nd), and FREE Registration for anyone who cannot afford $25 pp donation. Call me if you have any questions - (239) 208-4400 Jan Manarite Executive VP, Prostate Cancer International FULL Conference Details - www.TinyURL.com/Mar4Conf",
      "MessageIndex": 0,
      "PostDate": "18/02/2017",
      "ThreadURL": "https://www.cancerforums.net/threads/50244-March-4th-in-SW-Florida-Conference-for-Patients?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "March 4th in SW Florida - Conference for Patients"
    },
    {
      "AuthorID": "JManarite1",
      "AuthorURL": "https://www.cancerforums.net/members/111589-JManarite1?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I wanted to let everyone know about a Prostate Cancer Conference for patients and family members, in about a month. It is being organized by PCRI, Us TOO, and SNMMI. Speakers currently include - Dr William Catalona, Dr Aytekin Oto, Dr Michael Tomblyn, Tom Kirk, Jan Manarite, and more. Topics include - Patient Empowerment, Prostate MRI, Focal Therapy, Hormone Therapy Side Effects, Xofigo (radium 223), and more. Full Details and Agenda here. Register for FREE here. (required) Feel free to email me with any questions. [email protected]",
      "MessageIndex": 0,
      "PostDate": "21/06/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/39283-July-26th-FREE-PC-Conference-in-CHICAGO?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "July 26th - FREE PC Conference in CHICAGO"
    }
  ]
}