{
  "AuthorID": "Kazike",
  "AuthorURL": "https://www.cancerforums.net/members/106149-Kazike?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Kazike",
      "AuthorURL": "https://www.cancerforums.net/members/106149-Kazike?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "About 2 years ago I was treated with radiation for prostate cancer. My PSA has been stable since, but I have been having pain in the pelvic area. It feels like having a ball or obstacle between the legs. I am not able to seat for work for a couple of hours. Most of the time I work standing in front of my PC. For the first 1.5 years the pain was not constant and moderate. Lately the pain is permanent, feeling a burning sensation after weak up in the morning, seating is impossible. Anybody having similar experience? Any recommendations? Thank all for your advice.",
      "MessageIndex": 0,
      "PostDate": "13/01/2016",
      "ThreadURL": "https://www.cancerforums.net/threads/46878-Pain-in-pelvic-floor-2-years-after-radiation?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Pain in pelvic floor 2 years after radiation"
    },
    {
      "AuthorID": "Kazike",
      "AuthorURL": "https://www.cancerforums.net/members/106149-Kazike?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Diagnosis: Gleason 4+3, several tissue samples with cancer cells. Therapy: Radiation About 3 weeks ago the gel was injected between prostate and colon as a shield to protect colon from radiation. Radiation is underway now. This gel is a new development ho help reduce radiation side efects. Problem: Spaceoar Gel apparently to low positioned and eventually some gel in the injection cannula holes. Situation: Permanent pain in the perineum area between scrotum and anus. Very uncomfortable. This gel gets hard right after the injection. Now it is pressing hard and rubbing permanently from the inside. No seating for lunch or dinner, no car driving. Pain is always there. Geld gets dissolved and disappears apparently after 2-3 months. I can't imagine waiting so long with that pain. Any experience with such a situation or any advice? Thank you",
      "MessageIndex": 0,
      "PostDate": "31/08/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/33422-Experience-with-Spaceoar-Gel?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Experience with Spaceoar Gel"
    }
  ]
}