{
  "AuthorID": "langcole",
  "AuthorURL": "https://www.cancerforums.net/members/106694-langcole?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "langcole",
    "AuthorURL": "https://www.cancerforums.net/members/106694-langcole?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "Hello friends, this is my first time here and i'm looking for some good information to share with others. These are results of my latest MRI and one I had last year. My Doc says all looks good and he's reassured with the results. It looks to me like much has changed in a year. I am on Active Serv but the biopsys are too much if the end result will be to take the prostrate eventually. I'm scheduled for PSA test in November. Given these results should I have any short term concerns and should I look for a second opinion? Just made 50 this year. Thanks for any information you can share with me. 8/27/2013 5:25 PM -------- Upon further review of the images an additional lesion is identified. Lesion 3 Probability for tumor (1-5 scale): 3, Equivocal Appearance on T2-weighted images: Geographic, moderately decreased T2 signal Appearance on diffusion-weighted images: Mildly increased signal on high b-value images, moderately low ADC. Appearance on dynamic post-contrast images: Mild early enhancement without definite washout Size: 13 x 7 mm as measured on image 15 of series 7 Side: Left. Zone: Peripheral Level of prostate: Midgland Location within transverse plane: Anteromedial Shortest distance from midline: Abuts the midline Shortest distance from prostatic capsule: Abuts anterior fibromuscular stroma, 3.9 cm to the posterior capsule Impression: Additional 13 x 7 mm left anteromedial mid gland peripheral zone lesion that is equivocal for tumor (MRI score 3/5). Final Report: 8/27/2013 5:25 PM MRI Prostate with and without intravenous contrast Clinical history: Prostate cancer on active surveillance. Prostate biopsy on 8/30/2012 and 5/10/2012. Biopsy findings: Gleason 6 in a single core, involving 5% of the core; Gleason 6 in 2/13 cores, 20% of a single core. PSA: 4.1 (5/24/2013), PCA3 positive Technique: Multi-parametric 3.0 Tesla MRI was performed using a torso phased-array coil, including multiplanar T2-weighted images, axial T1-weighted images, axial diffusion-weighted images, and volumetric dynamic post-contrast images of the prostate. Axial 2D in-and-opposed-phase gradient-echo T1-weighted images and pre- and post-contrast 3D fat-suppressed gradient-echo T1-weighted images of the entire pelvis were also obtained. Dynacad software was used for image processing and analysis. Contrast: 20 cc of Magnevist. Comparison: Prostate MRI 8/30/2012 FINDINGS: Prostate size: 5.7 [CC] x 4.5 [AP] x 5.8 [transverse] cm for an overall volume of 77 cc. Intra-vesical protrusion of prostate: 0 cm Post-biopsy hemorrhage: None Tumor localization: Areas in the prostate suspicious for tumor are described below: Lesion 1 Probability for tumor (1-5 scale): 2, Low probability Appearance on T2-weighted images: Wedge shaped low signal Appearance on diffusion-weighted images: Focal low signal on series 10, image 13. Appearance on dynamic post-contrast images: Diffusely increased perfusion throughout the left peripheral zone broader than the area of interest Size: 6 x 6 mm as measured on image 14 of series 7 Side: Left. Zone: Peripheral Level of prostate: Midgland Location within transverse plane: Posterolateral Shortest distance from midline: 14.1mm Shortest distance from prostatic capsule: Abuts Additional peripheral zone findings: None Additional transition zone findings: Enlarged and heterogeneous in appearance, consistent with BPH. Extraprostatic extension: No evidence of EPE Seminal vesicle invasion: None Lymph nodes: None. Osseous structures: No focal lesion Additional findings: - Tiny fat-containing left inguinal hernia Component Results There is no component information for this result.",
    "MessageIndex": 0,
    "PostDate": "25/09/2013",
    "ThreadURL": "https://www.cancerforums.net/threads/33917-test-results?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "test results"
  }]
}