{
  "AuthorID": "Lil_DeE",
  "AuthorURL": "https://www.cancerforums.net/members/111445-Lil_DeE?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Lil_DeE",
      "AuthorURL": "https://www.cancerforums.net/members/111445-Lil_DeE?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I'm 48, I was told by my GP on friday 6th June that i had a PSA reading of 8. I actually live in North London so am I safe to assume I should hopefully qualify for eligability to attend the Royal Marden as I live in the London area? is there a website available that I can check what other specialist units are in the London area or should i stick with the Royal Marden as the best choice for prostrate cancer diagnosis/treatment?",
      "MessageIndex": 4,
      "PostDate": "10/06/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/39083-What-is-the-best-Hospital-in-London-for-prostrate-Diagmosis-treatment?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "What is the best Hospital in London for prostrate Diagmosis / treatment?"
    },
    {
      "AuthorID": "Lil_DeE",
      "AuthorURL": "https://www.cancerforums.net/members/111445-Lil_DeE?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hello all, I have just had a higher than normal PSA test and i'm about to be refered to a specialist for further diagnosis/treatment. I've been told by a friend that I dont have to go to my local catchment Hospital but I can ask my Doctor to be refered to any hospital of my choice. The Royal Marsden was suggested as a world leader in cancer diagnosis/treament. Can anyone here confirm: a) That I can pick which NHS hospital I attend in the UK under current rules? b) The Royal Marsden would be the best hospital to attend for Prostrate cancer diagnosis/treatment in London? Any advice would be greatly appreciated.",
      "MessageIndex": 0,
      "PostDate": "09/06/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/39083-What-is-the-best-Hospital-in-London-for-prostrate-Diagmosis-treatment?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "What is the best Hospital in London for prostrate Diagmosis / treatment?"
    }
  ]
}