{
  "AuthorID": "Mary N.",
  "AuthorURL": "https://www.cancerforums.net/members/101677-Mary-N?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Mary N.",
      "AuthorURL": "https://www.cancerforums.net/members/101677-Mary-N?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi, I post in another forum because I have NHL. My husband has been through several treatments for prostate cancer. 15 years ago it was discovered and it was quite severe and had become so within the year before and he was operated on. Everything seemed find for several years and then it spread again and they did radiation for 6 weeks daily. It has now been about 7 years and his psa is again going up again. He has an appointment next Tues. I think they are considering hormone therapy. Is there anything I should know? Is there any diet that might help? He is now almost 86 and really except for this he has been doing fairly well. Thanks. Mary N.",
      "MessageIndex": 0,
      "PostDate": "18/04/2014",
      "Signature": "Female ,age 70, Diagnosed Jan 2010 Primary CNS DLBCNHL Treatment every 6 weeks with High dose MTX and Rituxan for 9 months. Tumors shrunk and one was gone in 4 months and the larger one left some brain damage but has not become active as shown on MRI since Aug 2010. Since 2012 monthly Rituxan High Dose MTX and MRI every 4 months. June 6, 2014 NED No more chemo 6/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/38074-M-husband-s-psa-just-went-higher?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "M husband's psa just went higher."
    },
    {
      "AuthorID": "Mary N.",
      "AuthorURL": "https://www.cancerforums.net/members/101677-Mary-N?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Ah newporter, it seems my husband's psa has been going up for a year and a half and he just told me when I told him what you said. I guess he was trying to shield me. It has gone up too much and we will certainly keep what you said in mind as we visit his doc. Thanks you so much for the information and scare. I will be interested to find out what protocols and choices there are. Mary",
      "MessageIndex": 6,
      "PostDate": "19/04/2014",
      "Signature": "Female ,age 70, Diagnosed Jan 2010 Primary CNS DLBCNHL Treatment every 6 weeks with High dose MTX and Rituxan for 9 months. Tumors shrunk and one was gone in 4 months and the larger one left some brain damage but has not become active as shown on MRI since Aug 2010. Since 2012 monthly Rituxan High Dose MTX and MRI every 4 months. June 6, 2014 NED No more chemo 6/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/38074-M-husband-s-psa-just-went-higher?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "M husband's psa just went higher."
    },
    {
      "AuthorID": "Mary N.",
      "AuthorURL": "https://www.cancerforums.net/members/101677-Mary-N?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "We went to the doc's today. We asked a lot of questions and my husband had to deal with the possibility of not making it to 100 to see the littlest grandchildren (3 1/2) graduate. Funny, he always just assumes he will go on forever. Anyway the doc started him on Lupron 22.5 mg every 3 months. We discussed a lot about diet and scans. The doc indicated that he would probably want him to stay on it for quite some time and said if side effects such as hot flashes are too bad there is some medicine to help.",
      "MessageIndex": 7,
      "PostDate": "26/04/2014",
      "Signature": "Female ,age 70, Diagnosed Jan 2010 Primary CNS DLBCNHL Treatment every 6 weeks with High dose MTX and Rituxan for 9 months. Tumors shrunk and one was gone in 4 months and the larger one left some brain damage but has not become active as shown on MRI since Aug 2010. Since 2012 monthly Rituxan High Dose MTX and MRI every 4 months. June 6, 2014 NED No more chemo 6/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/38074-M-husband-s-psa-just-went-higher?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "M husband's psa just went higher."
    },
    {
      "AuthorID": "Mary N.",
      "AuthorURL": "https://www.cancerforums.net/members/101677-Mary-N?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks, I was wondering about if he was going to be needing scans to see if it has spread. I will question the dr if he doesn't suggest any. His psa 3 months ago was 3 and a week ago it was 10. He had his operation when he was 70 and it was fairly complete and they were not able to salvage any nerves because it was wrapped around them. He then about 7 years later had what I assume was salvage radiation because his psa went from 3 to 30 in 6 months. His psa has been less then 1 for 6 years and then it was 3, 3 months ago and now it is 10 so the doc called and we will go in on Tues. Aside from the prostrate cancer and earlier a kidney cancer that was removed completely he is in great heath. BP 120/70 and so forth but must admit he no longer goes rock climbing and I won't allow him on the roof either. Because of my NHL in my brain, I am far more aware of things spreading and have had to learn to ask a lot of questions and I want to be prepared. I must admit that because of my nhl, I am feeling much more vulnerable and a bit frightened but am thankfully really doing well according to my doc.",
      "MessageIndex": 4,
      "PostDate": "19/04/2014",
      "Signature": "Female ,age 70, Diagnosed Jan 2010 Primary CNS DLBCNHL Treatment every 6 weeks with High dose MTX and Rituxan for 9 months. Tumors shrunk and one was gone in 4 months and the larger one left some brain damage but has not become active as shown on MRI since Aug 2010. Since 2012 monthly Rituxan High Dose MTX and MRI every 4 months. June 6, 2014 NED No more chemo 6/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/38074-M-husband-s-psa-just-went-higher?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "M husband's psa just went higher."
    },
    {
      "AuthorID": "Mary N.",
      "AuthorURL": "https://www.cancerforums.net/members/101677-Mary-N?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi Martha, I know it is really hard waiting for responses . I don't have the knowledge to help you but wanted you to know that someone heard you. I'm sure someone with the knowledge will be responding, hopefully soon. Try to be as calm as possible and take some deep breaths. Call the doc. if you have questions. We often are in shock when we hear what is happening and don't think to ask questions. Often there is a nurse in the office who can answer questions for you. Hugs. Mary",
      "MessageIndex": 1,
      "PostDate": "04/09/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/40652-Need-help-URGENT!!!?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Need help-URGENT!!!"
    }
  ]
}