{
  "AuthorID": "mick54",
  "AuthorURL": "https://www.cancerforums.net/members/108375-mick54?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "mick54",
      "AuthorURL": "https://www.cancerforums.net/members/108375-mick54?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "My story - but first I must thank you all, and especially the \u0093regulars\u0094, for all your postings; a wealth of information that should be the first place your urologist should send you after diagnosis. So, after my diagnosis, my urologist told me the survival rate @ 10 years is 90% for surgery and 89% for radiation and that I should go and talk with both a surgeon and a radiation oncologist. I first visited the radiation oncologist and, after a discussion with him, decided there and then to go down the radiation path. He recommended a CT and bone scan so I dropped the request off at my PCP\u0092s office for approval. My PCP called me at 7pm to discuss it with me, then recommended I get a second opinion and sent me off to the Cleveland Center and UMiami. Could not get a quick appointment with Cleveland but did with UMiami. I met with Dr Dipen Parekh who answered all my questions and was very pleased that he would do my surgery. For me, surgery had been my first choice but after meeting with the radiation oncologist we decided to take the easier recovery path not realizing that that may bite me down the road. If I had to make the choice again, I would choice surgery with Dr. Parekh without hesitation. Surgery went well, had pain when I come round and they gave me some additional pain meds apart from the drip which allowed me to rest that night. Up and walking first thing the next day, drain out about 3pm and off home. First night home took pain meds but after that none. Main problem was constipation or pressure of a full bowel pressing on damaged area, found that as soon as I woke up had to go for a 30 minute walk to work things out, so to speak. A few days later, it got so bad I had to take ibuprofen once or twice a day. Two other issues, night sweats where I would wake up and the bed was cold and wet but that went away after a couple of weeks. The other issue was for a couple of days I slept 24 hours a day, very weak and cold but that cleared up too. I was off work for 4 weeks then back gradually over the next 2. After 3 months I was capable of doing everything, well not quite I still have 100% ED but the cancer is gone and, hopefully, forever. I have my 6 month appointment with Dr. Parekh\u0092s PA Tara Abboud who, like everyone I have dealt with at UMiami, has been exceptional and I ended up there just by good luck as up to that point I did a very bad job of sorting out my options.",
      "MessageIndex": 0,
      "PostDate": "16/12/2013",
      "Signature": "Age 55. 11th April 2013 yearly physical DRE detected hard area 17th April 2003 Urologist DRE prostate. 24th April 2013 Biopsy 1st May 2013 Age 54 DXd adenocarcinoma in 1/12 cores (25%). 2.4mm Gleason 3+3=6. No CT or bone scan. 18th June 2013 DaVinci prostatectomy at University of Miami Hospital Surgeon was Dr. Dipen Parekh, *****. Final pathology shows tumor confined to prostate. Gleason 6 Lymph nodes, seminal vesicles, extraprostatic and margins all negative. Perineural invasion is present Prostate 48 grams, tumor: < 5% pT2c NX Mn/a Catheter out in 8 days. No incontinence, minor dripping for a week. Post-op exams 9/16/13 - 8/1/14 PSA <0.1 8/1/14 100% ED so far pump & 20mg Cialis every other day",
      "ThreadURL": "https://www.cancerforums.net/threads/35481-Thankyou-to-everybody-here-and-can-I-join-your-club-please?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Thankyou to everybody here and can I join your club please"
    },
    {
      "AuthorID": "mick54",
      "AuthorURL": "https://www.cancerforums.net/members/108375-mick54?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Both nerves were spared, taking 10mg of Cialis daily for 2 months and now going to look at trying out the pump.",
      "MessageIndex": 4,
      "PostDate": "17/12/2013",
      "Signature": "Age 55. 11th April 2013 yearly physical DRE detected hard area 17th April 2003 Urologist DRE prostate. 24th April 2013 Biopsy 1st May 2013 Age 54 DXd adenocarcinoma in 1/12 cores (25%). 2.4mm Gleason 3+3=6. No CT or bone scan. 18th June 2013 DaVinci prostatectomy at University of Miami Hospital Surgeon was Dr. Dipen Parekh, *****. Final pathology shows tumor confined to prostate. Gleason 6 Lymph nodes, seminal vesicles, extraprostatic and margins all negative. Perineural invasion is present Prostate 48 grams, tumor: < 5% pT2c NX Mn/a Catheter out in 8 days. No incontinence, minor dripping for a week. Post-op exams 9/16/13 - 8/1/14 PSA <0.1 8/1/14 100% ED so far pump & 20mg Cialis every other day",
      "ThreadURL": "https://www.cancerforums.net/threads/35481-Thankyou-to-everybody-here-and-can-I-join-your-club-please?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Thankyou to everybody here and can I join your club please"
    }
  ]
}