{
  "AuthorID": "NavyChief",
  "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I have some lidocaine gel for if it gets to uncomfortable. The drain is still there for me. There is still quite a bit of drainage coming from it. Talking to my dr he said that the cancer was pushing into the berovasvular bundles quite a bit on the right side. He was able to save more of the bundles than he expected. Said about 50% on the right and 80% on the left. Hopefully I do end up getting some function after its all said and done. I am a little surprised than most didn't have a drain when they left the hospital. I do know the surgeon took all of the lymph nodes around. Could that be why? Lol. The catheter is supposed to come out on saturday. I wonder where that's gonna get done at. Lol. I guess I will wait until Monday I suppose",
      "MessageIndex": 5,
      "PostDate": "23/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/27907-Day-Three-After-Surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Day Three After Surgery"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I don't really want to over do it on the updates.. I guess I am answering my own questions I had each day that goes by I got checked out of the hospital last night pretty late. We got to our hotel about 11pm. remember its gonna be a 4 1/2 hour drive normally. I am figuring quit a bit more with having to stop quit a bit. Ok, the catheter, last night. I went to the toilet thinking I was going to finally have a proper bowel movement. I didn't, but I did have what I was told was a bladder spasm. It hurt bad, it felt like I had to pee for days and a little bit leaked around the catheter. I was told thats fairly normal but to do your best not to do it. Easy for him to say. I have noticed a little bit of blood around the catheter enters me. I have been just keeping it as clean as I can. Ok, the drain. I don't remember anyone really speaking about going home with a drain tube. I have one, its not the most bothersome thing on earth. I don't like the idea of there being, what amounts to, an open wound on me. It leaks a little bit which I was told is normal. I have to leave the drain in until it pretty much stops collecting anything. Anyone else have to have one? Other than that. I have decent appetite, my stomach is sore but not to bad. I know its gets my attention when I feel the need to cough. I feel like there are a bunch of empty spaces that stuff is moving around. I am certain that will go away. I can't imagine trying to do any of this without my wife. She is a total godsend and I am lucky that we found each other. Anyways, I will most likely do what I can to update every day for a little while. Just to perhaps chronicle some of the holes in persons stories that I read over the past few months to help others.. Thanks friends, every day is better than the last! Chief",
      "MessageIndex": 0,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/27907-Day-Three-After-Surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Day Three After Surgery"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "\"Seminal vesicles are negative. Lymphovascular invasion and perineural invasion is not identified.\" I read that a feel pretty good about it. The only part thats disturbing was \"Tumor is fairly extensively present at the bladder neck margins.\" But thats not necessarily bad news though. Fall back to the PSA. as long as that stays at ZERO, I don't really care what the path said LOL!! It could tell me that the Dr left half of my tumor in there and as long as my PSA stayed ZERO, I would consider that a success!",
      "MessageIndex": 1,
      "PostDate": "17/01/2013",
      "Signature": "40yo Diagnosed 9/12 PSA 13.1 5/12 PSA 14.5 9/12 PSA 14.6 10/12 Biopsy 10/12 8 of 12 cores gleason 3+4(7) 6 cores on right side with over 85% T2C PSA 16.5 11/12 PSA 13.9 12/12 RRP 12/19/2012 Pathological T3a, SVI-, Lymph -, one margin inconclusive 80% nerves removed from the right, 50% from the left. Surprisingly enough I was having partial erections with catheter in. Some incontinence but getting better quickly First POST surgery PSA < 0.1.",
      "ThreadURL": "https://www.cancerforums.net/threads/28691-Surprising-but-hopefully-good-news?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Surprising but hopefully good news"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "The Command Master Chief that I work for still has his in. I think his comes out today. His surgery was on November 7th. He has had a nightmare of an experience. Everything that could go wrong has gone wrong with him. He also still has a JP drain at 6 weeks.",
      "MessageIndex": 6,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/28034-Foley-catheter-still-in-4-weeks-tomorrow-anyone-else-had-it-this-long?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Foley catheter still in, 4 weeks tomorrow, anyone else had it this long?"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "The Command Master Chief that I work for still has his in. I think his comes out today. His surgery was on November 7th. He has had a nightmare of an experience. Everything that could go wrong has gone wrong with him. He also still has a JP drain at 6 weeks.",
      "MessageIndex": 16,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/28034-Foley-catheter-still-in-4-weeks-tomorrow-anyone-else-had-it-this-long?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Foley catheter still in, 4 weeks tomorrow, anyone else had it this long?"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I am a big fan of boxer briefs. Support yet no where near as annoying as briefs. I used TENA I think. I liked them. I only needed two or three a day at the works. I am six months out now and really don't need anything. Hopefully you will be there soon brother.",
      "MessageIndex": 6,
      "PostDate": "13/06/2013",
      "Signature": "40yo Diagnosed 9/12 PSA 13.1 5/12 PSA 14.5 9/12 PSA 14.6 10/12 Biopsy 10/12 8 of 12 cores gleason 3+4(7) 6 cores on right side with over 85% T2C PSA 16.5 11/12 PSA 13.9 12/12 RRP 12/19/2012 Pathological T3a, SVI-, Lymph -, one margin inconclusive 80% nerves removed from the right, 50% from the left. Surprisingly enough I was having partial erections with catheter in. Some incontinence but getting better quickly First POST surgery PSA < 0.1.",
      "ThreadURL": "https://www.cancerforums.net/threads/31758-What-s-your-preference?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "What's your preference?"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Well friends. My surgery was done on Wednesday in Houston at MD Andseron. I have no super complaints as yet. I was told I could prolly leave yesterday but I wasn't feeling ready for that just yet. Today is a different story. I feel much better. The catheter is by far the largest annoyance. I have a drain right now ony right side. They say its coming out today before I go home. We shall see. The sucky part is when I am released from here. I am at least 4 1/2 hours from home. Wife and I are going to stay in a hotel room tonight and start the drive home tomorrow. I think once the catheter is out I will be alot less annoyed Over all, not too terrible. Just sore like I didn't an ass ton of sit-ups.",
      "MessageIndex": 0,
      "PostDate": "21/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/27882-Two-days-after-surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Two days after surgery"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I been watching this forums for a couple of months now. I guess I would be classed as a lurker. I little back story on me. I have been in the NAVY for 21 years. I am 40 and I was recently diagnosed with Prostate Cancer. In September the Command Master Chief came into a meeting with all of us and told us that he had just been diagnosed with Stage 2 Prostate Cancer. He urged all of us to goto medical and tell them we wanted a PSA test since the Navy doesn't do it noramally until your 50. I rolled in there two days later to get a Tentnus and my FLU snort and went to the corpsman and asked him to get me a PSA test ordered. He mentioned that I had already had one in May. I wasn't aware of it and said ok. He told me that I neede to see the Doc. Well, to shorten the story. I did have a PSA in May and it was 13.05. Apparently it was ordered my a corpsman that was just about to retire and he had taken it upon himself to order PSA's for all men 40 and older. Anyways apparently the results were basically floating around the internet waiting for someone to type in my SSN for 3 months. Yes the search continues for this Corpsman who as my Urologist stated , \"Most likely saved your life\" They pulled another one that day, the results came back 14.5. I was sent to a urologist three days later and scheduled for a biopsy since my prostate felt extremely hard. Not lumpy, just really hard is what he said. Biopsy came back as follows I had a 12 core done. All six cores on the right side were 3+4 90% and two on the left were 3+4 at 15% I must say I am still pretty much in shock about this. A week later I am in Houston at MD Anderson. I saw a Dr Kamat down there who is a Surgeon and I went and got a consult from a radiation Dr. After those coversations I more or less decided on going the RP route. His notes since I hate typing so much Genitourinary exam: Digital rectal exam, he has a 3 x 3 x 3 cm prostate gland. Both lobes are firm and consistent with a clinical T2C exam. Outside hospital PSA 10/18/12 was 14.6. Outside hospital creatinine on 09/18/12 was 0.8. Outside hospital pathology report, left lateral apex 3+ 4, 15%; left lateral mid 3+ 4, 15%; right lateral apex 3+ 4, 95%; right lateral mid 3+ 4, 75%, right lateral base 3+ 4, 95%; right medial apex 3+ 4, 80%; right medial mid 3+4, 80%; right medial base 3+4, 90%. I must say that MD Anderson is definitely quick. I had a Bone Scan the same day as my appointment and then an MRI the next day. BONE SCAN RESULTS FULL RESULT: Examination: Whole Body Bone Scan, 11/14/2012 Clinical History: This is a 40-year-old male with prostate cancer. He comes to MD Anderson in consultation. Indication: Study is performed for staging purposes. Technique: Whole-body images were obtained in anterior and posterior planes after intravenous injection of 19.9 mCi technetium 99m MDP. Additional views of the arms above the head were also obtained. Findings: No suspicious sites of activity within osseous structures. Physiologic activity within genitourinary system. IMPRESSION: No active osseous metastases. MRI RESULTS Clinical History: A 40-year-old male patient with history of prostate carcinoma, elevated PSA level of 14.6 in 10/2012. Biopsy confirmed Gleason 7 disease. Here for initial treatment planning. Indication: Initial staging for newly diagnosed prostate cancer. Comparison: Bone scintigraphy, 11/14/2012. Technique: After 3-plane localization, axial T1-weighted wide field of view imaging were acquired through the pelvis. Dedicated small-field-of-view axial T1-weighted, 3-plane T2-weighted, axial diffusion weighted, and pre- and postcontrast axial 3D LAVA sequences in dynamic phase, were acquired through the prostate. Findings: The prostate gland measures 2.6 x 3.9 x 4.4 cm in AP, transverse, and craniocaudal dimensions. Multifocal disease is identified within the peripheral zone of the prostate gland, with a couple foci of tumor located in the midline posterior aspect of the peripheral zone on image 23, and at the same image there is another focus noted in the right lateral peripheral zone in the mid gland. There is subtle low T2 signal focus also noted in the left medial peripheral zone at the prostate base, image 20, series 4. These foci, with the exception of the left base low T2 focus demonstrate associated increased enhancement with early peak and associated slow washout, suspicious for malignancy. All of these foci do demonstrate low ADC value. There is suggestion of minimal extraprostatic extension bilaterally, image 21 through 23, right greater than left, including in the region of neurovascular bundle. There is no evidence of seminal vesicle involvement, however. The urinary bladder is unremarkable. There are nonspecific mildly prominent bilateral iliac lymph nodes identified, image 22 through 25. These are most likely reactive lymph nodes, considering their size and appearance. There is indeterminate T1 hypointense, slightly heterogeneous lesion identified in the right iliac bone in the region of the sacroiliac joint, image 13, series 2. This is not seen on any other sequence. This lesion is not covered within the field of view of other sequences. No other suspicious bony lesion is evident. This lesion in the right iliac bone is not showing any uptake on bone scintigraphy from 11/14/2012. IMPRESSION: 1. Multifocal prostatic disease with minimal extraprostatic extension in the region of neurovascular bundles, right greater than left. 2. No evidence of seminal vesicle involvement. 3. Indeterminate abnormality within the right iliac bone without corresponding increased uptake in the bone scintigraphy. Plain radiographs can be obtained of this region to further evaluate. Old imaging comparison if available of this region would be helpful. I guess I am just tired of reading everyone elses stories and figured I would contribute. I don't understand much about this iliac bone abnormality. I also am a little unclear about prognosis. Mainly what appears to be the third most important to the DR which is typically a little more important to many of us, ED. I am not really going to be talking to the DR until the 18th of DEC which is the pre-op appointment to ask these types of questions. Perhaps some of the insight of the \"PRO's\" that have actually been through this can help clear of some of the fuzziness to me. Thanks brothers. I'll be sure to enjoy a nice Irish Coffee for each of you! Rick",
      "MessageIndex": 0,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/27011-This-sure-is-happening-fast!?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "This sure is happening fast!"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Oh sure, I am definitely not one to complain about that particular pain LOL!",
      "MessageIndex": 2,
      "PostDate": "27/12/2012",
      "Signature": "40yo Diagnosed 9/12 PSA 13.1 5/12 PSA 14.5 9/12 PSA 14.6 10/12 Biopsy 10/12 8 of 12 cores gleason 3+4(7) 6 cores on right side with over 85% T2C PSA 16.5 11/12 PSA 13.9 12/12 RRP 12/19/2012 Pathological T3a, SVI-, Lymph -, one margin inconclusive 80% nerves removed from the right, 50% from the left. Surprisingly enough I was having partial erections with catheter in. Some incontinence but getting better quickly First POST surgery PSA < 0.1.",
      "ThreadURL": "https://www.cancerforums.net/threads/28046-1-week-PostOp?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "1 week PostOp"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I have to agree with Race. It was a nightmare the first day or two. When I sat I could feel the tube all the way in. I dunno if I just got used to it, but it really ended up not being to bad. I had it in for 12 days. Don't base the decision on having the surgery just on that.",
      "MessageIndex": 2,
      "PostDate": "15/01/2013",
      "Signature": "40yo Diagnosed 9/12 PSA 13.1 5/12 PSA 14.5 9/12 PSA 14.6 10/12 Biopsy 10/12 8 of 12 cores gleason 3+4(7) 6 cores on right side with over 85% T2C PSA 16.5 11/12 PSA 13.9 12/12 RRP 12/19/2012 Pathological T3a, SVI-, Lymph -, one margin inconclusive 80% nerves removed from the right, 50% from the left. Surprisingly enough I was having partial erections with catheter in. Some incontinence but getting better quickly First POST surgery PSA < 0.1.",
      "ThreadURL": "https://www.cancerforums.net/threads/28633-Catheter?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Catheter"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I do feel like I should be able to deal with it since I see commercials on TV where people install them themselves. Lol. It just doesn't seem natural to me.",
      "MessageIndex": 6,
      "PostDate": "25/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/27966-Day-5-after-Surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Day 5 after Surgery"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Well, I have been posting a bunch trying to fill in gaps on question that I have had up to this point before my surgery. Today is just another one of those except I am not sure I really have any questions Catheter is more of an annoyance at this point. I keep it clean. I remember to walk around with my buddy. I get a shooting pain every so often thats not terrible, just gets my attention. Occasionally I get what feels like (Don't be mad if I am being too graphic) a pain in the head that you have if you have been erect too long. It passes pretty fast. Its just a really strong ache for a few seconds. I never thought I would ever be excited about it, but the 'morning wood' that I had two or three days ago was confirmed again this morning. Dang that hurt because of the catheter but, its so worth it to know the hydraulics are operational. Yea, so I woke the wife up to tell her, she didn't share my excitement at 0430. My JP drain was draining about 300-400CC per day total. This morning the dump was completed at 0645 and it was 75CC so I think that it might finally be slowing down. Anyways, stay safe my friends. Maybe I am going to be one of the guys that ends up in pretty good shape after this is over. I am already doing a ton better than my Command Master Chief that I work for. He is well over 6 weeks and still has his catheter and a Drain, has been back in the hospital twice since surgery for infections and urine leaks. I really feel bad when he asks me how I am doing.",
      "MessageIndex": 0,
      "PostDate": "27/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/28046-1-week-PostOp?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "1 week PostOp"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I kinda skipped yesterday. Pretty much no news to post. I have learned over a few days with the catheter that when having a bowel movement you need not be in a rush otherwise you will cause a bladder spasm which doesn't feel good at all. I feel much better than I expected to feel. The JP drain that I have still fills quite a bit. Its around 300cc per day total. So far as I have noticed nobody else really as gotten one. Maybe its because I am not exactly a thin person is why I have it. The other person I know that had one out of surgery was a pretty big guy. I am supposed to keep the catheter for ten days after surgery which puts me a saturday. Anyone ever thought to do it on your own? I know they kept telling me I could do it at home no problem. I kept thinking I am sure I could get someone a whole lot more qualified to do that than me! Otherwise why would it hurt to wait until Monday? How long did your catheters stay in after? What kind of incontinence issues did you all have right off the bat? I woke up this morning with a semi-morning wood. That wasn't pleasant at all considering there as a catheter in. right now I can tell when I have to go. I can feel myself attempting to stop it. I am wondering if anyone else thinks they feel that way? Anyway, Merry Christmas all. Just asking questions at this point to get a view and maybe other well find these posts in the future and perhaps some questions answered",
      "MessageIndex": 0,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/27966-Day-5-after-Surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Day 5 after Surgery"
    },
    {
      "AuthorID": "NavyChief",
      "AuthorURL": "https://www.cancerforums.net/members/85646-NavyChief?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Merry Christmas all!! My JP still drains about 300cc per day. its pink and quick watery what its leaking out. I was told its lymph fluid. I really doesn't smell at all. I am wondering still if its because I am a big fat boy I do know they took a bunch of lymph nodes. I was told perhaps a week. One more thing about the catheter. I know many people have had them removed. I have read about leaks and stuff like that. I would much rather know before the catheter came out that all was good or bad. I was not conscious when it was installed. I would rather be the same way if it has to go back in to tell you the truth..",
      "MessageIndex": 4,
      "PostDate": "25/12/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/27966-Day-5-after-Surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Day 5 after Surgery"
    }
  ]
}