{
  "AuthorID": "Pat32rf",
  "AuthorURL": "https://www.cancerforums.net/members/119433-Pat32rf?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "Pat32rf",
    "AuthorURL": "https://www.cancerforums.net/members/119433-Pat32rf?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "I guess you could say it started back about 1989 when I had my heart attack. I was 44 and the last person one would expect. An electrical serviceman on call 24/7, married with kids, etc. It took me 6 months to talk my GP into a stress test even. He thought the angina was just muscle pain. Even after the stress test (that lasted two minutes) he OK'd my continuing work, since I was a \"type A\" guy. Six weeks later I stopped at emerg on the way to work and wound up in intensive care.... Back then the health system in Ontario was not the same as it is now and I waited 10 months for my ByPass. After the surgery I attended various rehab classes and was assured that I would probably live for another 5-8 years with no problem....... I spent 8 months before I got the OK to return to my job but could not fit back in to a restricted work schedule, and after waking up twice in intensive care, just packed my tools and walked away, loosing any union drug plan or government assistance. My union pension became \"locked in\" where it still sits. I then bounced around different \"jobs of interest\" for ten years while we waited for my 5-8 year lifespan to run out. Life was getting more interesting each year and when the two oldest got married within six months of each other we sold our place in town and bought a house on 80 acres, still doing any jobs that looked like fun... Still hadn't used up my 5-8 years due to a few lifestyle changes so when my PSA came back at 23 it was quite a shock. My old GP felt that the only logical choice was surgery so he sent me to a urologist who shared his thoughts. We looked at the probability of ED (I was 67 years old) and started researching other choices. The only real option was External Beam Radiation. My oncologist explained that after 3 years the odds on ED, cancer re-appearing or incontinence would be the same with either choice. Thanks to the Canadian Cancer Society my wife and I spent that summer (2012) living in a fancy hotel 200 km from home, the first real holiday in years and we drove home every weekend.... Life was good, with NO side effects of the radiation and no ED. A few other health issues requiring a new hip and daily blood sugar tests but every 3-4 months we would drive down to Kingston to chat with my oncologist and do a few tests. Suddenly after three years my PSA jumped back up and within a week I had more tests than I believed possible spread between hospitals in three different towns, wherever there was a machine available. At the end it was decided that my cancer had metasticized and shown up in five spots scattered thru-out my skeleton and I would start on the Hormone treatment. By now I had a new GP and my first prognosis was 6-8 months. This upset him more than us as we still hadn't processed the situation. After a few weeks that 6-8 months changed into possibly 6-8 years or more, but I would never see my \"towel hanger\" again. After all, by now I was 70 years old and when I took those first hormone (Eligard) shots, it was pretty well instant wilt... It has been a year since the first shots and later on this week we will drive down to Kingston to get the latest news.",
    "MessageIndex": 0,
    "PostDate": "17/05/2016",
    "ThreadURL": "https://www.cancerforums.net/threads/47988-Long-Windy-Road?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "Long Windy Road"
  }]
}