{
  "AuthorID": "Revloren",
  "AuthorURL": "https://www.cancerforums.net/members/111199-Revloren?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Revloren",
      "AuthorURL": "https://www.cancerforums.net/members/111199-Revloren?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Got my first post surgery PSA it is a 0.04 which I am told that means there are still some microscopic cancer cells still present. I see an oncologist tomorrow which from what I am being told now mean radiation therapy. Six weeks after surgery I developed an abscess at the surgery site which landed me back in the hospital for a week with I.V. antibiotics for two weeks at home. Plus side bladder control is getting better. Wore the diapers for a week after the catheter came out then went to large pads wore the large pads for about 4 weeks now using moderate pads only maybe 2 or 3 a day and no leaks at night. Only time I have a problem is when I laugh, strain, fart or sneeze. Partial erection starting to come back. Going through days of feeling great then couple of days feeling like crap. Not back in the gym yet but was told I could start walking again. I used to do 8 to 10 miles a day but was told to limit my walks to 3 miles to start out. No used to this mess just want to get back to (ab- normal). I'm 53, prostate was 80% cancerous nothing in the bone or lymph nodes. Gleason's were in the 6's and 7's. Doctor said it was very advanced but what does that mean, like most doctors I get better info from his PA than from him.",
      "MessageIndex": 0,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/40623-Post-Surgery-PSA?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Post Surgery PSA"
    },
    {
      "AuthorID": "Revloren",
      "AuthorURL": "https://www.cancerforums.net/members/111199-Revloren?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I am 53 and had radical prostate surgery 10 weeks ago. The doctors did a 10 week PSA and it came back .05 now they want me to see an oncologist about radiation treatments. I am more afraid of the radiation than I was the surgery. At the time they did the PSA test I was suffering from an infection at the surgery site that landed me in the hospital for 7 days and on I.V. antibiotics for 14 days but they say this would not have effected my tests so I have to believe them. Just so done with this whole thing.",
      "MessageIndex": 0,
      "PostDate": "02/09/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/40635-Prostate-Cancer-Recovery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Prostate Cancer Recovery"
    }
  ]
}