{
  "AuthorID": "RottyDad",
  "AuthorURL": "https://www.cancerforums.net/members/126439-RottyDad?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "RottyDad",
    "AuthorURL": "https://www.cancerforums.net/members/126439-RottyDad?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "I have some questions about my PSA levels and Biopsy? trying to educate my self. I have been reading some of the post and you guys are way more educated then I am on this subject, so if I mis-speak, please correct me. Little bit about me. 55Yr old, 5'8\" 155 lbs, on zero meds. pretty good shape, can still lift 100 lbs. Smoked from 15 till about 22, but very light, pack would last 3 weeks. Drank like a fish from 16 till 28 (when I became a Christian) didn't drink at all for about 10 years. Now an occasional beer, or glass of wine. I have been having problem with the strength of my stream, maybe 5 years, give or take. And every time I get a digital, I am told my prostrate is large. No blood in my urine, and only once had it in my semen, but that was 3 or 4 years ago, non since. So I got an appointment with a urologist in early December, it took me 6 months to get in with him. Everything looked ok, except the enlarged prostrate and a PSA of 7.9. So he told me not to worry and gave me some Rapidflo for a month. I took that but suffered the dizzy side effects from it, so i cut back to half a pill. I just went back and got a PSA again and it's now 9.0. I did not see the original doctor but different one, she instantly set me up for a biopsy in about 3 weeks. So I started looking into this and found that a lot of reputable medical people don't want a biopsy this soon into the deal, Also I had a doctor tell me they dont even do the PSA any more due to the un-reliable ness of it. The original doctor also told me that he has patients with a PSA of 15 that have no cancer. So I have some questions maybe you can help me out with. 1. Are most of the people that post here doctors, or people that have just been through it and done the research? 2. Are there any other signs of prostrate cancer that the doctors can look for? 3. when getting a second opinion would you go to another Urologist for a second opinion, or is a family doctor ok? Thanks all",
    "MessageIndex": 0,
    "PostDate": "08/01/2018",
    "ThreadURL": "https://www.cancerforums.net/threads/53795-All-new-to-me?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "All new to me"
  }]
}