{
  "AuthorID": "Ryshea",
  "AuthorURL": "https://www.cancerforums.net/members/96444-Ryshea?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "Ryshea",
    "AuthorURL": "https://www.cancerforums.net/members/96444-Ryshea?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "Originally Posted by markinphoenix I'm moved by the good experience and results I had with my prostate surgery to tell others with prostate cancer to investigate all your treatment options and to find the best doctors you can. I searched this forum and the internet to find out all I could, and it paid off. On this forum I found out about the amazing results achieved by Dr. Ash Tewari and his robotic procedure. He uses a unique procedure to reconnect the bladder that reduces incontinence. I went to the extra trouble and expense to travel to New York from Arizona to have Dr. Tewari perform the prostate removal at NewYork-Presbyterian Hospital/Weill Cornell Medical Center, located in New York City. I had the surgery on August 6th and was out of the hospital on August 7. I was up a walking about 7 hours after the surgery. I felt good enough on August 8th to walk around New York for about an hour, per doctors orders. The catheter was removed after only 7 days. I had a little incontinence at first during the day but that went away after a couple of weeks. And I've had some leakage at night on 3 nights in the 2 weeks since taking out the catheter. I've been able to achieve erections sufficient for intercourse and had orgasms. But the erections are slower to develop and take more stimulation than before. It's been 3 weeks since the surgery and I expect things to improve over time. The biopsy for the removed tissue indicates the cancer was probably contained to the prostate and I have a 95% chance of it not reoccurring. I'll have a PSA test at 6 weeks. It hasn't all been easy or fun, but I'm thrilled with the results so far because I've heard so many tales of men fighting incontinence and struggling with sexual function for long periods after prostate surgery. I'm 59 years old, had a gleason score of 3+3, 6 total, and a PSA of 4.9. I highly recommend Dr. Tewari. His internet URL is http://www.theehealth.com/2005art/ His web page is very informative. I wish you all the best. If you have questions I'll respond. Hi Mark, I'll be visiting Dr. Tewari in January 2013. To tell you I am nervous about surgery would be an understatement. I never had surgery before and I've been stalling. Time to man up and get this done. I have a gleason of 6 with a very low grade cancer according to my Connecticut Urologist. My only symptom is that I urinate a little more frequently. I hardly ever get up at night to go. Can you drop me a line and tell me about your experience? Especially the anesthesia and how quick you went out. My email address is [email protected] Thanks John",
    "MessageIndex": 5,
    "PostDate": "27/12/2012",
    "ThreadURL": "https://www.cancerforums.net/threads/7551-Hard-and-Dry-After-Prostate-Removal?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "Hard and Dry After Prostate Removal"
  }]
}