{
  "AuthorID": "SamGC",
  "AuthorURL": "https://www.cancerforums.net/members/109354-SamGC?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "SamGC",
      "AuthorURL": "https://www.cancerforums.net/members/109354-SamGC?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Here\u0092s a long thread from another forum with discussion/info on Focal Laser Ablation ... one guy had this treatment 5 years ago. http://www.inspire.com/groups/us-too...tion-patients/",
      "MessageIndex": 5,
      "PostDate": "08/02/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/36628-Recently-Diagnosed?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Recently Diagnosed"
    },
    {
      "AuthorID": "SamGC",
      "AuthorURL": "https://www.cancerforums.net/members/109354-SamGC?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Good question. Actually, the % of men with microscopic amount of PCa are the same as the decade they are in. i.e. 50% of men in age 50\u0092s, 60% in age 60\u0092s, etc. It\u0092s a natural part of aging. Also, your PSA will rise slowly as you age because your prostate will become larger and give out more PSA, which is not prostate cancer specific. To understand AS, you have to understand PCa. Not all cancers are the same. PCa is not one disease. Scientists have identified at least 24 different types/variants of PCa with varying degree of virulence. 10 to 15% of these are the fast growing, aggressive types (high Gleason score) that need immediate and aggressive treatments. The majority are the slow growing, non-aggressive types that don\u0092t spread beyond the prostate gland. So for a person diagnosed with a low volume and low Gleason score PCa, it may make sense to choose AS (i.e. confirm staging first and monitor its progress) to defer treatments with potential physical/ psychological SE\u0092s that could be worse than the disease itself. Studies have shown that for low-risk Pca, the results are the same between immediate treatment and treatment deferred until necessary. These days, some experienced AS doctors and established AS programs (e.g. MD Anderson) do not rely on standard biopsy only to qualify or monitor patients for AS. They use the latest imaging technology (similar to mammogram for breast cancer and colonoscopy for colon cancer). 3T/ Multiparametric MRI (mpMRI) can provide functional information and multiple high-resolution images of the prostate and its surrounding, including the location, size and character of all clinically-significant tumors and any extra-capsular spreading. This can be followed by a targeted biopsy to confirm the Gleason Score. Others use 3T MRI-guided biopsy or mpMRI/ultrasound fusion guided biopsy. Studies find that the results of these advanced imaging techniques have 95%+ accuracy. It\u0092s not 100% but no treatment is. If you want to consider/pursue AS, you should consult with a doctor who is experienced with AS and is knowledgeable about the latest AS approach, protocols, tools and tests. Not all urologists or Radiation Oncologists are. This is no different from hiring the best surgeons to do surgery or the best Rad On to do RT.",
      "MessageIndex": 6,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/37265-Why-choose-active-surveillance?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Why choose active surveillance"
    }
  ]
}