{
  "AuthorID": "Shelson",
  "AuthorURL": "https://www.cancerforums.net/members/108225-Shelson?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Shelson",
      "AuthorURL": "https://www.cancerforums.net/members/108225-Shelson?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks for welcoming me to the forum. Based on what I have read so far it does not appear that there is interests on \"holistic treatments\". Yes I was diagnosed 7 years ago and have been on AS. Originally biopsied (if this is a word) with 3+3 but with only 8 vores one of with was positive with 15% malignancy. PSA was 4.1 and with strict diets etc. got it down to 3.6 but in the last year 2 yrs. it has been increasing and just got a PSA of 8.1. Have not had a repeat biopsy due to the unproven data that it could spread the disease. Took a high powered MRI ( I think they call it a 3 Tesla machine) and the Oncologist's report was & I quote, \" It is marginally suspicious that it is low grade cancer\", Obviously this was comforting regardless of the rising PSA. Will be repeating the biopsy in January as I know have a baseline to compare it to. I am years old, retired engineer in search of a \"natural\" way on comtrolling my condition.",
      "MessageIndex": 2,
      "PostDate": "09/12/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/35321-Prostasol?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Prostasol"
    },
    {
      "AuthorID": "Shelson",
      "AuthorURL": "https://www.cancerforums.net/members/108225-Shelson?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Any new information on the risks or benefits of using Prostasol to control prostate cancer?",
      "MessageIndex": 0,
      "PostDate": "07/12/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/35321-Prostasol?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Prostasol"
    },
    {
      "AuthorID": "Shelson",
      "AuthorURL": "https://www.cancerforums.net/members/108225-Shelson?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I replied to your post but before it was posted I got a message that said that the post had to be reviewed by the moderator before posting and I notice that it is still not posted. Am I doing something wrong? To answer you questions, I am 63 years old and I heard about the product from the manager of a health store. He has been using it for some time now with reported success.",
      "MessageIndex": 4,
      "PostDate": "14/12/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/35321-Prostasol?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Prostasol"
    }
  ]
}