{
  "AuthorID": "Smurfsdad",
  "AuthorURL": "https://www.cancerforums.net/members/103580-Smurfsdad?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "Smurfsdad",
      "AuthorURL": "https://www.cancerforums.net/members/103580-Smurfsdad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks Chuck for your reply. I haven't talked to my urologist about this yet. The catheter was taken out Monday and I have an appointment on Thursday. I'll go over all this with him then. Appreciate your input on the Kegels, everyone seems to have a different take on the amount of exercise. Smurfsdad .",
      "MessageIndex": 2,
      "PostDate": "05/05/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/31147-Incontinance-following-radical-prostatectomy?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Incontinance following radical prostatectomy"
    },
    {
      "AuthorID": "Smurfsdad",
      "AuthorURL": "https://www.cancerforums.net/members/103580-Smurfsdad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi folks, my first post. I had a radical prostatectomy 6 weeks ago Thursday. I had the catheter in for two weeks then it was removed. I went home and couldn't urinate. The next morning I had the catheter put back in. Two weeks later I had a laser surgery done to remove some scar tissue in the urethra. When the surgery was done, the catheter went back in for another week. All totaled, the catheter was in for two days short of 6 weeks. I am now urinating all the time. If I'm standing, I'm peeing. At night I collect some in my bladder and have to get up to go to the bathroom. Nighttime is better. My question is....Does anyone know it this is to be expected after having the catheter in for so long? I'm so worried about wearing this diaper for the rest of my life. Am doing the Kegels like my life depends on them. ( no pun intended for the \"depends\") Today for the first time I stood in front of the toilet and had a little success when I tried to urinate. Can anyone give me any encouragement? Thanks folks, Smurfsdad",
      "MessageIndex": 0,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/31147-Incontinance-following-radical-prostatectomy?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Incontinance following radical prostatectomy"
    },
    {
      "AuthorID": "Smurfsdad",
      "AuthorURL": "https://www.cancerforums.net/members/103580-Smurfsdad?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks for your post. I'm having issues right now and don't know what the future holds. This will help me out!",
      "MessageIndex": 1,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/31160-Living-with-urinary-incontinence-after-prostate-surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Living with urinary incontinence after prostate surgery"
    }
  ]
}