{
  "AuthorID": "sspanda",
  "AuthorURL": "https://www.cancerforums.net/members/126769-sspanda?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "sspanda",
    "AuthorURL": "https://www.cancerforums.net/members/126769-sspanda?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "Hi, I am writing on behalf of my father (Age: 65). My father was diagnosed with prostate cancer in 2015, following which he underwent radical prostatectomy (2015), hormone therapy (2015), and radiation therapy (2016). This year his PSA level started rising and PET CT scan has revealed metastases in right iliac bone. Please find below a detailed case history with PSA levels at different points in time. We\u0092d be grateful if you could share what are the potential treatment options and implications on quality of life because of the disease. Thank you! Case History: + 2015 Jan: Diagnosed with carcinoma prostate cancer (PSA: 9.3) through fusion biopsy of prostrate (Gleason score-8) \u0096 age at the time of diagnosis: 62 + 2015 Mar: Surgery done; histopathological report post operation: Tumor 2C reported (Surgery methodology - Robot Assisted Radical Prostatectomy with Extensive Pelvic Lymph Node Dissection) + PSA post operation: 0.11 in May 2015; 0.50 in August 2015; and 0.82 in Nov 2015 + 2015 Nov: Hormone therapy (Firmagon) started - loading dose (240) followed by five maintenance doses (80) at monthly intervals + 2016 May: PSA .07 + 2016 May: Bone scanning done \u0096 no traces found, MRI done - no issues found + 2016 May: Radiation given (IGIMRT \u0096 30 times) between May 2016 May and Jun 2016 + PSA post radiation: < 0.07 in Oct 2016; <0.07 in Jan 2017; <0.07 in May 2017; 0.11 in Aug 2017; 6.6 in Jan 2018 + 2018 Jan: PET CT Scan done \u0096 metastases detected in right iliac bone à one dose of Hormone given, Doctor have suggested Orchiectomy to contain growth",
    "MessageIndex": 0,
    "PostDate": "01/02/2018",
    "ThreadURL": "https://www.cancerforums.net/threads/54234-Treatment-options-for-metastases-post-Radical-Prostatectomy?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "Treatment options for metastases post Radical Prostatectomy"
  }]
}