{
  "AuthorID": "TheDaughter",
  "AuthorURL": "https://www.cancerforums.net/members/50649-TheDaughter?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "TheDaughter",
      "AuthorURL": "https://www.cancerforums.net/members/50649-TheDaughter?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "His Gleason score before his surgery was 7, they are saying its at a 9 now.... but I'm hesitant to believe that as they cant tell us why. At the time of surgery they checked the surrounding area, nodes included and everything came back clear. I don't think radiation is a good idea since he's older, I think it would cause more problems than good. Are there any medications that might help? We're not necessarily looking for a cure, just more healthy years of life. Thank you Chuck!",
      "MessageIndex": 2,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/25792-New-here-need-advice?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "New here, need advice."
    },
    {
      "AuthorID": "TheDaughter",
      "AuthorURL": "https://www.cancerforums.net/members/50649-TheDaughter?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "His PSA before surgery was 7. His PSA right after surgery was 3. He had his prostate out last November, by March it was 4.3 and then in May it was 4.7, just last month it was the same at 4.7.",
      "MessageIndex": 7,
      "PostDate": "03/10/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/25792-New-here-need-advice?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "New here, need advice."
    },
    {
      "AuthorID": "TheDaughter",
      "AuthorURL": "https://www.cancerforums.net/members/50649-TheDaughter?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hello, my name is Maria. I'm writing in regards to my father, he is 75 years old. He had his enlarged prostate removed last fall after detecting cancer. His PSA stayed at 3 for 6 months and then went up to 4.3 and now currently at 4.7. His Urologist referred him to a Oncologist who preformed a CAT scan, Bone Scan, and other tests. The scans came back clear, they can not find any obvious cancer. Yet they are recommending hormone therapy and radiation of his pelvis. We aren't sure what to do. He's healthy, feels great...we hate to start radiation that will cause more harm than good since they have no real target. Do you guys have any suggestions? Is there anything else that we can do? Any help would be great as we're all quite stressed.",
      "MessageIndex": 0,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/25792-New-here-need-advice?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "New here, need advice."
    },
    {
      "AuthorID": "TheDaughter",
      "AuthorURL": "https://www.cancerforums.net/members/50649-TheDaughter?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks you guys, I really appreciate all of your help. I was reading this article. http://www.mayoclinic.com/health/pro...cancer/HO00032 I see that PSA can also be produced by tissue left behind after the Prostatectomy. Could this be our situation or no?",
      "MessageIndex": 5,
      "PostDate": "02/10/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/25792-New-here-need-advice?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "New here, need advice."
    }
  ]
}