{
  "AuthorID": "TKIGuy",
  "AuthorURL": "https://www.cancerforums.net/members/34398-TKIGuy?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "TKIGuy",
      "AuthorURL": "https://www.cancerforums.net/members/34398-TKIGuy?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks for responding. I've read some stuff about other causes but I was getting the impression that those things would only cause slight elevations. Is it realistic to assume that anything else other than PC could cause a 4.4 for a 39 yr old? I haven't been able to find anything with someone in my age range who had a 4.4 and it didn't wind up being PC.",
      "MessageIndex": 2,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/24945-Younger-guy-with-PSA-4-4-can-anyone-help-me-to-calm-down?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Younger guy with PSA 4.4 can anyone help me to calm down?"
    },
    {
      "AuthorID": "TKIGuy",
      "AuthorURL": "https://www.cancerforums.net/members/34398-TKIGuy?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "No, I am not taking any supplements. My treatment for leukemia makes it so I can't take most stuff like that. When Dr ran PSA she also ran testosterone - it came back low end of normal. Uro said that was not good because low testosterone could mask the PSA and make it look lower than it is, giving me the impression the 4.4 could be even higher.",
      "MessageIndex": 4,
      "PostDate": "23/08/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/24945-Younger-guy-with-PSA-4-4-can-anyone-help-me-to-calm-down?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Younger guy with PSA 4.4 can anyone help me to calm down?"
    },
    {
      "AuthorID": "TKIGuy",
      "AuthorURL": "https://www.cancerforums.net/members/34398-TKIGuy?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I am 39 years old and went for a routine physical last week. I asked doctor if she was going to do a PSA and she said usually wait until at least 40 but why not? All results came back good except for PSA which was 4.4. I'm really upset about this. I saw Urologist two days ago and he said to repeat test in 6 weeks. He put me on Cipro. Said DRE was normal. I have had a lot of groin pain in pubic bone area and testicle, also some pain in perinium. I have been to doctor for groin pain, possible hernia a few times and urologist who said my issue was most likely due to pelvic floor muscle issues. My lower back has been hurting as well. No difficulty urinating and no sexual dysfunction. Sometimes ejaculation can help with the groin pain. I am trying not to freak out but at my age with PSA 4.4 I am getting the sense this is not good. Dr was clear PSA does not show cancer but he did not have any real theories. I asked about infection and he said maybe but unlikely. Said if number doesn't go all the way down < 1 he will want to do a biopsy. That seems unlikely. This is really hard for me, besides the obvious reasons, I was diagnosed with leukemia two years ago. I am on oral chemo and in remission. I am terrified of having another cancer. I am trying to find any information to calm my nerves but I can't find anything that doesn't point to prostate cancer.",
      "MessageIndex": 0,
      "PostDate": "22/08/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/24945-Younger-guy-with-PSA-4-4-can-anyone-help-me-to-calm-down?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Younger guy with PSA 4.4 can anyone help me to calm down?"
    }
  ]
}