{
  "AuthorID": "TomsWife",
  "AuthorURL": "https://www.cancerforums.net/members/109958-TomsWife?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [{
    "AuthorID": "TomsWife",
    "AuthorURL": "https://www.cancerforums.net/members/109958-TomsWife?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Content": "Hello Everyone! I am new here to posting but not to the board. My lurking here throughout the year has given me some sanity and peace of mind. I appreciate the insight and encouragement that the members give so freely to one another. So here's our story. It's been a little over a year since my husband had robotic surgery for his Pca. He is still struggling with incontinence and erections. He was only 39 years old when he was diagnosed, and 40 at the time of his surgery. The Physician who performed the surgery had high hopes that he would recover fast due to his young age. This was very encouraging to say the least since my husband was very worried about the side effects. Fast forward a year and a few months later and my husband still hasn't improved from his incontinence. He is still wearing diapers. I have suggested a man's pad but he feels more secure in the diaper. He is also having problems with impotence. He's been using the vacuum pump weekly, but that only serves to keep his penis from atrophying. We've tried having sex three times total since his surgery but it's literally impossible. Once he pumps, and puts the ring around his penis, it doesn't stay erected much -- only half at best; therefore making sex difficult. He's also tried a few ED drugs (Viagra, etc.) to no avail. But considering he's on blood pressure medication it serves as a double whammy (ED meds don't mix well with BP meds). We've discussed the Trimix option, but considering the side effects, it goes right out the door. I love my husband very much and miss the intimacy we previously shared before his cancer. I know this is an extremely touchy subject so I don't push him one way or another. I just feel stuck. Since this can be a very delicate subject for a man whose gone through hell and back, is there any way I can approach the subject or try new methods? I don't want to cause any more turmoil than he's already suffered. Thanks for your time, -TomsWife",
    "MessageIndex": 0,
    "PostDate": "12/03/2014",
    "Signature": "My husband Tom was diagnosed at age 39 with prostate cancer in October of 2012. He had robotic surgery in December of 2012. PCA level: 3.0 Gleason score: 7 (3+4) Biopsy: 6 of 12 cores positive Suffers from incontinence and impotence",
    "ThreadURL": "https://www.cancerforums.net/threads/37322-Struggling-After-Surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
    "Title": "Struggling After Surgery"
  }]
}