{
  "AuthorID": "vaportrail",
  "AuthorURL": "https://www.cancerforums.net/members/105370-vaportrail?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "vaportrail",
      "AuthorURL": "https://www.cancerforums.net/members/105370-vaportrail?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hello everyone- I just had my first psa test, and results were 5.6. The doctor scared the crap outta me, and scheduled another test in 4 months. A little background info- Mid 40's, overweight white male. I've been living outside the country for several years. I'd been gaining weight, feeling fatigue and even though my wife is much younger, and very sexy, I had lost interest in sex. Blood test revealed low testosterone. My urologist (also a somewhat famous micro surgeon in his area) recommended TRT. Fast forward a year or so, and I'm back in the USA. I went to the VA and saw a doctor who compared my use of testosterone to heroin or cocaine. He kept calling it a controlled substance that's usually abused. He was very upset that I only took a total testosterone test, and no psa. I've been off the testosterone for 6 weeks, and back to feeling like crap. Can't concentrate by noon. I've gained 10 pounds in 6 weeks. Ready to give up and find a bed by afternoon, and not interested in getting cozy with my wife in the evening- The new doctor is convinced that TRT to prostate cancer is like \"pouring gasoline on a wildfire\" and said I'll be looking at getting a biopsy if my psa levels don't drop in 4 months. I've been reading all I can, trying to make sense of all the different info, and opinions about prostate cancer.",
      "MessageIndex": 0,
      "PostDate": "28/07/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/32745-5-6-psa?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "5.6 psa-"
    },
    {
      "AuthorID": "vaportrail",
      "AuthorURL": "https://www.cancerforums.net/members/105370-vaportrail?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Originally Posted by Fairwind Have you had a DRE and was the result \"normal\" or \"abnormal\"? Yeah, as soon as he told me my psa was 5.6, he had me bending over the examination table with my pants around my ankles. He said it was slightly enlarged but nothing to worry about. I guess that's bph? I'm a little bit hesitant about getting a biopsy. I don't like the idea of bacteria from my colon getting introduced into my prostate and blood stream. Also, if I do have a slow growing cancer tumor, is poking it with a needle a good idea? I was doing good losing weight on testosterone. I shed 15 pounds without much problem. But now I'm gaining it back... I have a lot of other old injuries, that prevent me from exercising. Makes it really hard to for me to get back into shape.",
      "MessageIndex": 4,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/32745-5-6-psa?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "5.6 psa-"
    },
    {
      "AuthorID": "vaportrail",
      "AuthorURL": "https://www.cancerforums.net/members/105370-vaportrail?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thanks for the replies, everyone. I'm actually going in for a pre-op appointment tomorrow. I'm supposed to have all the hardware removed from my lower leg/ankle/foot, and re-fuse my ankle. So hopefully after the surgery, I'll be able to at least swim, and ride a bike again. One thing that I should have told the doctor, but didn't think of it at the time... Is I went through a period, a couple of years ago, where I was having pain in my prostate. When I would sit for a long time, on my wood rocking chair, I would get a tingling pain, right in the prostate area. Sometimes the mild pain would linger for hours, even when I'd get up and go walking. I also had some urgency, getting up multiple times at night to pee, and a little bit of dribbling. I went to my urologist, and he told me that the urinary issues were due to my slightly enlarged prostate, which is farily common and not a sign of anything serious. Same story with the pain. He told me to wait and see if it was still bothering me in 6 months. The symptoms went away, and I pretty much forgot about that episode.",
      "MessageIndex": 7,
      "PostDate": "29/07/2013",
      "ThreadURL": "https://www.cancerforums.net/threads/32745-5-6-psa?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "5.6 psa-"
    }
  ]
}