{
  "AuthorID": "vmhthomas",
  "AuthorURL": "https://www.cancerforums.net/members/125609-vmhthomas?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "vmhthomas",
      "AuthorURL": "https://www.cancerforums.net/members/125609-vmhthomas?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hello All- My father was recently diagnosed with prostate cancer and a fatty liver and has been taking it very hard. My grandfather, his father, passed away two years ago from a 22 year long fight with prostate cancer that had morphed into cancer throughout his entire body. Understandably my dad has been extremely distant and hasn't given me any details that he's received from his doctors/tests. I really don't want to pry to much because I know this is very difficult for him to be dealing with but Im scared/nervous and need more info. I've been an open ear, supportive and loving but I just want to make sure I can take care of my dad. Does anyone have any diet tips, exercise tips, or any other info that can be shared so I can understand this better and help him? Thank you guys! VHT",
      "MessageIndex": 0,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://www.cancerforums.net/threads/52786-2nd-Generation-Prostate-Cancer?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "2nd Generation Prostate Cancer"
    },
    {
      "AuthorID": "vmhthomas",
      "AuthorURL": "https://www.cancerforums.net/members/125609-vmhthomas?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Thank you for the feedback! I currently live in the DC area and my dad lives in Los Angeles, California. So im unable to be there for him to go to doctors visits. From my understanding he hasn't told anyone yet about the diagnosis. I wish I had more answers to give you but I dont have them myself and unfortunately I cant get access to any records without his consent. Thank you for the support.",
      "MessageIndex": 4,
      "PostDate": "16/10/2017",
      "ThreadURL": "https://www.cancerforums.net/threads/52786-2nd-Generation-Prostate-Cancer?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "2nd Generation Prostate Cancer"
    }
  ]
}