{
  "AuthorID": "VW Tuner",
  "AuthorURL": "https://www.cancerforums.net/members/46173-VW-Tuner?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "VW Tuner",
      "AuthorURL": "https://www.cancerforums.net/members/46173-VW-Tuner?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hey Everyone, Getting really excited not to be leaking myself all the time. I was wondering how other people deal with this. I continue to have high PSA and an enlarged prostate. Today, as I am working away at my desk, with a paper towel wrapped around my member, I realized that I've reached my breaking point with this feeling. I feel like I have lost my muscles that help with expelling urine all together. Every time I apply pressure to my bottom, I have this issue. I was thinking about just throwing a catheter on there and calling it good. I also have this warm almost burning sensation, right where my prostate is, like sitting on warm, uncomfortable piece of coal. I cancelled my biopsy and urinary scope because things were doing great for a couple days. I'm going to go ahead and schedule that again.",
      "MessageIndex": 0,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/26192-Dealing-with-Urinary-Incontinence?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Dealing with Urinary Incontinence"
    },
    {
      "AuthorID": "VW Tuner",
      "AuthorURL": "https://www.cancerforums.net/members/46173-VW-Tuner?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "I'm going to go buy some pads. I appreciate the suggestion. I was originally going to buy some menstral pads. I think I'll buy a hemorrhoid donut, to see if that eases some of the pressure when I sit. I think taking the positive attitude route works best. I more than likely contributed to the problem, so no use in getting down about it. I'm in my late twenties, with a PSA that is back down 10. I abused Deca Durabolin, anabolic steroid, during my puberty years. After all the testing, my doctor wouldn't be surprised if it is cancerous. I have a mass on the my prostate. I haven't asked for a size comparison of the prostate, such as three times the normal size. There have just been comments along the lines of \"it is real big\". There was the use of \"huge\" initially. I have done two sets of antibiotics. First round, thirty days of Levaquin, with no drop in PSA. The second round was a ten day run of another type, which I cannot remember. Are pain pills something I can ask for with this? That may be a poor idea, as I think it could increase the leaking problem.",
      "MessageIndex": 3,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/26192-Dealing-with-Urinary-Incontinence?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Dealing with Urinary Incontinence"
    },
    {
      "AuthorID": "VW Tuner",
      "AuthorURL": "https://www.cancerforums.net/members/46173-VW-Tuner?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi Everyone, My Background: I had my first bout of Prostatitis when I was twenty, with a simultaneous testicular cancer scare. Both issues checked-out fine, at the time, and never followed-up on the issues - I've had a hard time urinating since I was fifteen, so this is \"normal\" for me. Last week, it feel like I was urinating myself. Wow, what a crazy feeling. Turns out I really wasn't, after hours of staring at myself, attempting to analyze the situation. I went to the ER, and the doctor's face, after examining my prostate was scary and a little humorous. I had asked if I could wait a few months (hoping to blow it off completely), before seeing a Urologist. His response, was that if it wasn't Sunday, I would be seeing one now. I had my blood drawn, and my PSA is 10.1. From my internet researching, it appears this is seen in men around seventy years old. I had just had a lung cancer scare, also. It seems I may be flirting cancer, but nothing yet . I'm getting so many infections, in all parts of my body, this last month. I see the urologist, tomorrow. I imagine I will be getting a biopsy. I also imagine my cancer risk is relatively high. Questions: - I get this \"Charlie Horse\" feeling, so painful, when I urinate. Is this related to my prostate? I have had this pain, for about a decade, but never asked anyone. - I smell ammonia/chemicals, most of the day. The smell is in my nose. Anyone heard of this, or better yet, does this tie into the prostate at all? - PSA of 10.1, at 26 years old, do I need to be mentally preparing myself for some really bad news? Thanks!",
      "MessageIndex": 0,
      "PostDate": "26/09/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/25652-Newcomer-26-Years-Old-PSA-10-1?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Newcomer: 26 Years Old - PSA 10.1"
    },
    {
      "AuthorID": "VW Tuner",
      "AuthorURL": "https://www.cancerforums.net/members/46173-VW-Tuner?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Update: I had a uroflowmetry done and I didn't get past the first line, which is an unmarked five, I believe. The machine stopped too early, haha. The ultrasound shows I emptied my bladder completely. I had about a third of what most individuals expell from their bladder. My PSA is up to 11.4, now. I have a biopsy and urethra probing, for scar tissue, next Monday.",
      "MessageIndex": 3,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://www.cancerforums.net/threads/25652-Newcomer-26-Years-Old-PSA-10-1?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Newcomer: 26 Years Old - PSA 10.1"
    }
  ]
}