{
  "AuthorID": "yellowkelly",
  "AuthorURL": "https://www.cancerforums.net/members/108088-yellowkelly?s=89a03c807a8995ef0d3cb76194d4bc08",
  "Posts": [
    {
      "AuthorID": "yellowkelly",
      "AuthorURL": "https://www.cancerforums.net/members/108088-yellowkelly?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi Tom's wife, sorry you had to be here, but glad you found this forum. My bf age 49 had nerve sparing DiVinci surgery October, 2013 so he is in the recovery stage as well. With pills he gets about a 50% erection. He started using the pump at 2 months post surgery. It works to get him the rest of the way there. I agree totally with Flkjr when he said, \"It does take some effort, adjustment, and perserverance but I find it worth it on a number of fronts.\" I tell people to have patience, you need to figure out the technique with the pump. I also agree when he said you need to use a \"ridiculously small constrictor ring to maintain an erection.\" Very true. We hope to start using injections next week. If you haven't read the book written by Dr. Mulhall, Saving Your Sex Life, that would be a good place to start. There are also books out there about having intimacy without intercourse. His incontinence may be stopping him from wanting the intimacy, but intimacy without intercourse is very possible and very enjoyable for both of you. Prior to using meds, my bf had no response, but we were still intimate. He can reach orgasm without erection. I often help my bf reach orgasm often without an erection. His doctor was not much help at all for ED. We really had to educate ourselves and ask for what we needed. There are doctors who specialize in this. Perhaps you can find one. Also, he may need some therapy for his incontinence. There are ways to help guys learn how to do Kegels correctly. Is he doing them every day? Several times a day? It is possible he is not doing them correctly and a visit to a doctor or someone who can help make sure he is using the right muscles might help? Don't give up hope. There is still time for recovery, but you may need help with this. Read Mulhall's book if you haven't already. Good luck!",
      "MessageIndex": 8,
      "PostDate": "13/03/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/37322-Struggling-After-Surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Struggling After Surgery"
    },
    {
      "AuthorID": "yellowkelly",
      "AuthorURL": "https://www.cancerforums.net/members/108088-yellowkelly?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Content": "Hi! I saw an earlier post of yours and sent you a private message. Look up at the top of the page, under the word blog, it says private message. You should have one waiting for you. My boyfriend, age 48, was diagnosed with PCa last summer, DiVinci surgery October, 2013. We are now 5 months post surgery. I sent you a private message about our experience. Bf's cancer was also located in the apex, also Gleason 6. Both nerves were spared during surgery. He is about 96% continent. Erections 50% with Viagra or Levitra. We use Vacuum Erection Device (VED) to get him the rest of the way there and a penis ring to keep erection for intercourse (that happened at 2 months). Three days ago had his second injection of Trimix. It was successful and we were able to have intercourse using the Trimix. Feel free to ask me any questions. You can do that through private message if you like. The skill of the surgeon is critical to the outcome results. My bf's surgeon seems to have done well enough, but I wonder if we had gone to a doctor with a know reputation for excellent outcomes, if he would be doing better than he is. I'm not going to complain though, I do believe he will recover spontaneous erections again, eventually.",
      "MessageIndex": 7,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://www.cancerforums.net/threads/37563-Questions-for-the-doc-Before-surgery?s=89a03c807a8995ef0d3cb76194d4bc08",
      "Title": "Questions for the doc.... Before surgery...."
    }
  ]
}