{
  "AuthorID": "melissasmitherly",
  "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2121340&p=123531",
  "EmotionInfo": {
    "EmotionKeywords": [
      "quiet",
      "thoughtful",
      "willing",
      "sure",
      "lost",
      "fearful",
      "terrified",
      "tearful"
    ],
    "Emotions": {
      "AFRAID": "2",
      "ALIVE": "0",
      "ANGRY": "0",
      "CONFUSED": "1",
      "DEPRESSED": "0",
      "GOOD": "1",
      "HAPPY": "0",
      "HELPLESS": "0",
      "HURT": "0",
      "INDIFFERENT": "0",
      "INTERESTED": "1",
      "LOVE": "0",
      "OPEN": "0",
      "POSITIVE": "1",
      "SAD": "1",
      "STRONG": "1"
    }
  },
  "GleasonInfo": {},
  "NExperiencePosts": 1,
  "NPosts": 1,
  "PSAInfo": {},
  "Posts": [{
    "AuthorID": "melissasmitherly",
    "AuthorURL": "http://www.healingwell.com/community/profile.aspx?f=14&m=2121340&p=123531",
    "Content": " I am 24 years old and (sorry but im in the midst of throwing myself a \"pity party\" lol) have just had the worst twelve months. My husbands brother and father were killed in a car accident in September last year and we have been trying so hard to find our way through the greiving process and now when things are slowly getting easier, I find a lump in my breast. Well, actually I found the lump a year ago a week before my wedding and I got so busy with wedding stuff I completely forgot to go to my referred ultrasound scan. I finally went back to the doctor (just under a year later) and he checked the lump after reading about\n it on my file and referred me for an ultrasound again. I went to the ultrasound and nothing showed up, so I assumed that meant everything was fine and I (ignorantly) didnt even bother going back to my doctor. Eventually I went back for an infection I had from a dentist appointment and the doctor said he had wanted to see me about\n my ultrasound. He said that he isnt convinced by nothing showing up on the scan as the lump is about\n 2 cms in diameter and is solid. He has referred me to a breast surgeon/specialist for a biopsy. \nMy biopsy is in ten days from now. I am not really sure what I am here for... I think I just need to know that someone knows how I feel. I feel as though I am going insane with fear. I'm quiet a strong person usually but this is just eating away at me. Breast cancer is such a senseless disease that heartlessly tears mothers away from children, daughters away from mothers, etc. I just cant cope with the idea that after the year I have already had, I might have to fight this too. I cant believe my husband whom has lost so much (including losing his best mate in a house fire a couple of years ago) might have to consider the possibility of losing me. I know I sound rather dramatic but I cant even comprehend how deep the fear runs, Ive never experienced anything like this before. Is it normal to become so afraid during this testing process? Is it normal to be unable to \"squash\" the \"worst case scenarios\" from your mind. I just keep staring at my son and breaking down (silently) at the thought of leaving him. \nI am so afraid and waiting is just so horrible. I have no idea how my husband and I will fight this after how much the last year and fighting the greif has taken out of us. I feel as though I am falling apart and its so completely the opposite of how I usually am. Any words of wisdom/advice - anything - would be appreciated. ",
    "Demographics": {
      "AgeInfo": [{
        "Confidence": 1,
        "Phrase": "<Z> <Z> <Z> I am 24 years old and  sorry but",
        "Relation": "unknown",
        "Tense": "present",
        "Value": 24
      }],
      "GenderInfo": {
        "MedicalTermBasedGender": {
          "FemaleMedicalTerms": ["breast"],
          "MaleMedicalTerms": []
        },
        "NounBasedGender": {
          "MainSubject": "I",
          "NarrationType": "first-person",
          "NarratorGender": "female",
          "PatientGender": "female"
        }
      }
    },
    "MessageIndex": 0,
    "PostDate": "27/05/2011",
    "ThreadURL": "http://www.healingwell.com/community/default.aspx?f=14&m=2121340",
    "Title": "Terrified, found a lump in my breast and am now waiting for appointment with surgeon."
  }],
  "ProfileDemographics": {
    "Age": {
      "Confidence": 0,
      "Relation": "unknown",
      "Tense": "unknown",
      "Value": -1
    },
    "Gender": {
      "Confidence": 1,
      "Gender": "female",
      "NarrationType": "first-person"
    }
  },
  "SideEffectTypeInfo": {
    "SideEffectType": [
      "Infection",
      "Hernia"
    ],
    "SideEffectTypeKeywords": [
      "infection",
      "lump"
    ]
  },
  "TreatmentDecision": {
    "DoctorRecommended": {
      "Age": 0,
      "Best Cancer Control": 0,
      "Bowel Symptoms": 0,
      "Doctor Skill": 0,
      "Erectile dysfunction": 0,
      "Financial": 0,
      "GP Mentioned": 0,
      "Less Invasive": 0,
      "Medical Indication": 0,
      "Nerve": 0,
      "Radiologist": 0,
      "Recovery Time": 0,
      "Source": 0,
      "Surgeon": 0,
      "Urinary incontinence": 0,
      "Value": 0
    },
    "PatientDecided": {
      "Age": 0,
      "Best Cancer Control": 0,
      "Bowel Symptoms": 0,
      "Doctor Skill": 0,
      "Erectile dysfunction": 0,
      "Financial": 0,
      "GP Mentioned": 0,
      "Less Invasive": 0,
      "Medical Indication": 0,
      "Nerve": 0,
      "Radiologist": 0,
      "Recovery Time": 0,
      "Source": 0,
      "Surgeon": 0,
      "Urinary incontinence": 0,
      "Value": 0
    }
  },
  "TreatmentTypeInfo": {
    "TreatmentMentions": [],
    "TreatmentType": "",
    "TreatmentTypeKeywords": []
  },
  "WordCount": 501
}