{
  "AuthorID": "alabama_survivor",
  "AuthorURL": "https://csn.cancer.org/alabama_survivor",
  "Posts": [
    {
      "AuthorID": "alabama_survivor",
      "AuthorURL": "https://csn.cancer.org/alabama_survivor",
      "Content": "I will be having a bilateral mastectomy around the middle of January. I am doing chemo before surgery and will be finished December 15. I will be having radiation on one side only following surgery.  I have decided not to have immediate reconstruction.  I was just curious what some of you in this situation might have done about breast forms and garments, especially when you first came home from the hospital.  I am familiar with the TLC catalog.  I will be fitted for professional prostheses once treatment is done and everything heals.  I was just wondering what some of you might have done in the meantime.  Also,  what do/did you wear when you left the house? Thanks.  Jeanelle",
      "MessageIndex": 0,
      "PostDate": "04/12/2014",
      "ThreadURL": "https://csn.cancer.org/node/290055",
      "Title": "Breast forms and garment recommendation while healing fr bilateral mastectomy"
    },
    {
      "AuthorID": "alabama_survivor",
      "AuthorURL": "https://csn.cancer.org/alabama_survivor",
      "Content": "I love the Montgomery Cancer Center in Montgomery Alabama, which is about 17 miles from house.  This place treats so many patients, yet everyone is so personable.  The nurses in the treatment room knew me, when I did chemo, and they tried to give me the same nurse each time.  Often, my oncologist would be in the hall when I would go back to the exam room, and was very personable and laid back, and I've always been made to feel like an individual, and like I was important.  Also, on the couple of occassions I've had reason to call down there, a person, not a recording will answer my call.",
      "MessageIndex": 7,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://csn.cancer.org/node/293864",
      "Title": "not happy with M D Anderson"
    },
    {
      "AuthorID": "alabama_survivor",
      "AuthorURL": "https://csn.cancer.org/alabama_survivor",
      "Content": "Mine is self explanatory.  I live in Wetumpka, AL which is in the Montgomery metro area.  Since my brother and sister also have cancer, I wanted to be able to talk openly and remain anonomous without anyone recognizing me.  Now that I am stage 4, some would argue that I a \"metster\" and not a survivor, but I was under the impression that as soon as one is diagnosed, they become a survivor.  My first name is Jeanelle, btw, and it's hard to be anonomous with a name like that, especially with the unusual spelling.",
      "MessageIndex": 19,
      "PostDate": "24/08/2015",
      "ThreadURL": "https://csn.cancer.org/node/296208",
      "Title": "screen names-curuious if what they mean to everyone"
    },
    {
      "AuthorID": "alabama_survivor",
      "AuthorURL": "https://csn.cancer.org/alabama_survivor",
      "Content": "The anonomous is more for my brother and sister's privacy.  They just need to be able to deal with their cancers in their own way.  The three of us have always been close, and this has certainly been an interesting way for the 3 of us to support each other.  Both my brother and I are stage 4.",
      "MessageIndex": 22,
      "PostDate": "02/09/2015",
      "ThreadURL": "https://csn.cancer.org/node/296208",
      "Title": "screen names-curuious if what they mean to everyone"
    },
    {
      "AuthorID": "alabama_survivor",
      "AuthorURL": "https://csn.cancer.org/alabama_survivor",
      "Content": "When I was a kid, Mom always got New Year's off from cooking.  Dad would roast a turkey, and maybe a ham, and he would make a meat tray, a tomato & lettuce tray, and maybe a pickle tray. Since he would watch football all day, everyone just kind of ate when we got ready. When Doug and I got married 21 years ago, he insisted on pork and sour kraut. I'm in Alabama and have lived here since 1971. I've never adopted the tradition of black eyed peas. ",
      "MessageIndex": 6,
      "PostDate": "01/01/2015",
      "ThreadURL": "https://csn.cancer.org/node/290945",
      "Title": "Traditional New Years meals"
    },
    {
      "AuthorID": "alabama_survivor",
      "AuthorURL": "https://csn.cancer.org/alabama_survivor",
      "Content": "I didn't do reconstruction, but did have to do chemo since my cancer was stage 3 on one side, and stage 0 on the other.  I had a bilateral, and I honest thought surgery was easier than chemo.  Chemo is very doable, though.  I did have some side effects, mostly low blood counts and extreme fatigue.  I also have some neurapathy.  But the nausea and throwing up my toenails, which I most scared of, never happened.  At most I had very mild queeziness which was easily taken care of with the meds I was given.",
      "MessageIndex": 2,
      "PostDate": "12/05/2015",
      "ThreadURL": "https://csn.cancer.org/node/294185",
      "Title": "Ductal Cancer"
    }
  ]
}