{
  "AuthorID": "Anonymous user (not verified)",
  "AuthorURL": "https://csn.cancer.org/Anonymous user (not verified)",
  "Posts": [
    {
      "AuthorID": "Anonymous user (not verified)",
      "AuthorURL": "https://csn.cancer.org/Anonymous user (not verified)",
      "Content": "This is just a thought I wanted to share that maybe you have had too. My work asked us to bring a picture of ourselves when we were little. So I hauled out the old photos to pick one out. As I looked through my life in pictures I was at first struck with sadness. Look at that little girl, me, how unfair that she should grow up and deal with BC. And look at how healthy a young woman she grew to be, only to become this bald, one breasted woman looking into the past. And how about this one, taken just a few years ago, so care free! The sadness was replaced with another thought. I love myself. Seems funny to write it down. But of course that has been the source of some of my tears, crying for myself. But it is not just because I pity myself...I actually love myself and can now see past the too long nose and dorky smile. Grappling with BC has left peacefully confident that I love myself. Just like all the self help books say you should. Just like all the self esteem articles promote. Now I really believe it. Maybe this is easy for some of you to say to yourselves. But for me, I have spent much of my life not always loving myself. So this Valentines Day, lets all champion the love we have for ourselves, that keeps us fighting, that sometimes brings us tears of fear, that reaches out to each other. To myself, and to each of you, Valentines, LOVE! Joyce",
      "MessageIndex": 0,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://csn.cancer.org/node/156929",
      "Title": "self love"
    },
    {
      "AuthorID": "Anonymous user (not verified)",
      "AuthorURL": "https://csn.cancer.org/Anonymous user (not verified)",
      "Content": "Wow, today I went to a \"real\" support group with people in the same room. And I want all of you wonderful ladies and Bill to know how much I appreciate you for making this site my real support group. Here, whenever I read posts and responses, I am aware of how much we take care of each other and I feel you all closer than physical. There is a Jewish saying, what comes from the heart goes to the heart. So, here it may go through cyberspace on the way, but it always finds its way back to the heart. I am lucky to have met all of you. LOVE - Joyce",
      "MessageIndex": 0,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://csn.cancer.org/node/158563",
      "Title": "support in the flesh"
    },
    {
      "AuthorID": "Anonymous user (not verified)",
      "AuthorURL": "https://csn.cancer.org/Anonymous user (not verified)",
      "Content": "I have around my neck some plastic beads. I got them today from my radiation clinic because I finished treatment this morning. When I was first diagnosed I thought I was going to die. I looked around at all the things in my life that were precious, furniture, jewelry, my hair even, that had been so important to me and they were meaningless in light of my cancer, completely unable to save me or lift my spirits. It was devastating. As my treatment began, and chemo dragged on, I wondered if these things, if life, would ever have the same meaning as it once held. I didn't know that I was asking the wrong question. Today, after all that I have been through, I have learned to give things and life new meaning and not just to hope to go back to the old. My plastic beads, given to each patient after completion, are about the most precious of things I have ever received or worked for. There is more truth in them than the hardest of diamonds in my jewelry box. And, by the way, they are mardi gras beads. And yes, I did have to show (for 30 rads) my bare chest to get them! Courage to all of you who are still working for your beads. Love, Joyce",
      "MessageIndex": 0,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://csn.cancer.org/node/157920",
      "Title": "plastic beads"
    },
    {
      "AuthorID": "Anonymous user (not verified)",
      "AuthorURL": "https://csn.cancer.org/Anonymous user (not verified)",
      "Content": "As I read and write posts on this fabulous discussion board, I sometimes wonder - what type of people use this resource? For instance, in the discussion of how to move on after cancer, are all those who have moved on, without a backwards glance not even coming here to tell us that? Are we a self selected, self defined group? What traits do we share? I am articulate, enjoy communication, believe that knowledge is power, perhaps a tad obsessive (ouch!). Additionally, I am a nurturer of others, empathetic to a fault, educated, and analytical. I am also an artist, but I don't see how that fits in. Do you all think that we are more alike than different? This discussion board serves the entire U.S. and we are all saddened by how many lives are touched by cancer, and yet the numbers using this resource are relatively small. Perhaps most haven't found it, or have other support groups. But, one thing I know, whatever type of person I am, I sure do need this forum. I might add here, that I like the writing aspect and don't think I would do as well in face to face contact (mostly because I would hog the speaker's chair!) What about you? What type of person are you? Are we similar? Just asking for fun. love to all - Joyce",
      "MessageIndex": 0,
      "PostDate": "21/03/2008",
      "ThreadURL": "https://csn.cancer.org/node/157299",
      "Title": "What kind of person are we?"
    }
  ]
}