{
  "AuthorID": "arkansasgirl",
  "AuthorURL": "https://csn.cancer.org/arkansasgirl",
  "Posts": [
    {
      "AuthorID": "arkansasgirl",
      "AuthorURL": "https://csn.cancer.org/arkansasgirl",
      "Content": "Hi I try to do anything to put a smile on any ones face considering what we all have been going through. This is the first time I've told this. So go ahead and laugh. I also took the same type of chemo you did and by the 2nd treatment which I was taking every 3 weeks my hair started coming out every time I brushed it and started leaving bald spots. My head was a little sore but it got better. Well my onocology nurse made a suggestion I should just go ahead and shave, so I said guess I will. That evening I came home and thought okay lets get this over with. I had tears in my eyes and went to the closet got the vacuum cleaner out, hooked up the hose and started running it all over my head thinking my hair would just be sucked right off. Well that didn't happen. I thought this was going to be an easy thing to do, but I was wrong. None of my hair came out. My husband walked in and said what are you doing and he could see that it did not work. My husband done thought I had lost it so we stood there crying and laughing. He got the clippers out and started shaving my head. When he got finished he said I had a birth mark. I said where? Well I've always wore my hair short and parted on the right side and he goes right there on the part. I told him that's not a birth mark goofy that is where my part has been for at least 50 years. I had a tan where the part was. lol Husbands can't live without them and can't live with them. Well I could not wear wigs. It was so uncomfortable. My daughter bought me a black cap with a pink ribbon on it and that is what I wore. As of today my hair has come back in so soft and healthy. I still wear my cap sometimes. But also I'm so relieved to say I'M CANCER FREE from a very rare type of BC that chemo and radiation has no effect. So here's my thought on cancer: The cancer won the 1st battle and now I've won the 2nd but the war is not over for I will not give up. I know this was not much help but you have got to stay strong and keep a positive attitude that no matter what the battle, God says put on the armor for the war. God Bless You ARKANSASGIRL",
      "MessageIndex": 4,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "arkansasgirl",
      "AuthorURL": "https://csn.cancer.org/arkansasgirl",
      "Content": "Hi Terry I'm 54 and got diagnosed with a very rare BC which chemo and radiation has no effect. I also have TRIPLE NEG BC. I had both breast removed (APRIL 200) but only had cancer in the right breast. My lymph nodes were negative (3 removed). My tumor went from 2cm to 5cm in about 4 weeks. I'm not going to say those 6 treatments every 3 weeks were easy but what I can tell you is that as of FEB 1st I'm CANCER FREE. You have a lot to live for with 5 grandchildren. Those 13 years will go by so fast. As i see it all of us live from day to day not knowing what tomorrow will bring. You shouldn't accept your life should end in 13 years. If you accept that then why have surgery? I don't mean to be point blank about this, but God knows our numbered days and for whatever reason we have been stuck by this disease. Even though there are risks with chemo I personally feel it knocked out the Triple Neg BC for me. This cancer is a very aggressive cancer and usually returns within 2 to 2 1/2 years targeting the brain, bones. lung, and liver. I don't want to give it a chance to return. I took the risk with chemo. The first and last treament landed me in the hospital because of my white blood count dropping. This is a decision only you can make and try find answers to your questions. None of us I'm sure didn't want to take any treatments because of the side effects but we can not give up. Here's my motto on cancer: CANCER WON THE 1ST BATTLE AND I WON THE 2ND BUT THE WAR IS NOT OVER FOR I WILL NOT GIVE UP. I hope for whatever your decision to do will be the best one for you. God Bless You ARKANSASGIRL",
      "MessageIndex": 8,
      "PostDate": "17/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192300",
      "Title": "Just Joined today, May 15,2010 :)"
    },
    {
      "AuthorID": "arkansasgirl",
      "AuthorURL": "https://csn.cancer.org/arkansasgirl",
      "Content": "Hi Ronda I can tell you that I had 6 treatments - 1 every three weeks. The first one and the last one put me in the hospital for a week. I have a rare BC that chemo and radiation has no effect on. After the 5th treatment I was so sick, I begged my Dr and Hubby please don't make me take the last one. If I heard the word chemo, thought the word chemo, saw the place I took chemo I would get just sick as a dog. The Dr and Hubby said \"you've came this far - and what if something happens and I would regret not taking the last one\". So you know I said ok. Well the last one put me in the hospital because of my white blood count dropping. So when both of them came to see me - you know I pointed my finger at both of them and said see where I'm at!!! lol They hung there heads!! But it was for the best. Instead of cancer killing me, I knew chemo would. I felt like I was putting posion in my body to kill a posion. I was dx in Mar 2009 and had both breast removed in April 2009. I found a lump that was 2cm in the right breast that went to 5 cm in 4 weeks. I did not want reconstruction. My thoughts are God giveth and God taketh. I did not want any more surgery and just wanted to get this diease out of my body. AS of Feb 1st I'M CANCER FREE!!! WOOHOO I not only survived Chemo but Cancer too!! My motto is: Cancer won the 1st battle and I won the 2nd but the WAR is not over for I will not give up. God Bless You and Good Luck with Everything ARKANSASGIRL",
      "MessageIndex": 16,
      "PostDate": "03/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195664",
      "Title": "May I ask you, how many chemo treatments did you have altogether?"
    }
  ]
}