{
  "AuthorID": "atiredparent",
  "AuthorURL": "https://csn.cancer.org/atiredparent",
  "Posts": [
    {
      "AuthorID": "atiredparent",
      "AuthorURL": "https://csn.cancer.org/atiredparent",
      "Content": "Yes it is.",
      "MessageIndex": 8,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233655",
      "Title": "Any advice for mouth sores during chemo?"
    },
    {
      "AuthorID": "atiredparent",
      "AuthorURL": "https://csn.cancer.org/atiredparent",
      "Content": "I have read that drinking ice drink or chewing ice during the chemo treatment is suppose to help. I had mouth sores and the doctor gave me a gargle that numbed it. I stayed away from anything spicy or citrusy.",
      "MessageIndex": 5,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233655",
      "Title": "Any advice for mouth sores during chemo?"
    },
    {
      "AuthorID": "atiredparent",
      "AuthorURL": "https://csn.cancer.org/atiredparent",
      "Content": "It is very hard to keep dealing with things sometimes isn't it. I hope it turns out benign.",
      "MessageIndex": 1,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224821",
      "Title": "One step forward and two steps back?"
    },
    {
      "AuthorID": "atiredparent",
      "AuthorURL": "https://csn.cancer.org/atiredparent",
      "Content": "It was very helpful for me to have baby wipes in the bathroom. I used them to freshen up. It saved on laundry of towels and helped me feel fresher in the week that I couldn't shower because of the drains. Pill wedge or recliner was a life saver. Button down or zip shirts necessity. Get couple size larger because it is hard to get your arms in if too tight. Ask Doctor when you can start excercising your arms after surgery. I had a frozen shoulder and not fun to recover from. I was driving after 1 week (after drains out) and back to work 3 weeks later. I had a double mastectomy with 3-4 lymph nodes on right side and no flap. I did not do much lifting though for about 4=5 weeks. Stock up on easy to make foods for you and reading material to distract you.",
      "MessageIndex": 8,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/232898",
      "Title": "Needs advise before surgery!"
    },
    {
      "AuthorID": "atiredparent",
      "AuthorURL": "https://csn.cancer.org/atiredparent",
      "Content": "I had my first chemo Taxoter on Wednesday. I have felt a little tired yesterday and today and had insomnia both nights. Now I am starting to feel a little queasy and a little more fatigued. Hope this is as bad as it gets! Day 3: Doing ok. It is manageable. Tired, some nausea off and on. Cracker seem to help. Have been able to take dogs out for short walks. Hope this is the worst that it gets. Any advice is appreciated.",
      "MessageIndex": 0,
      "PostDate": "12/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224370",
      "Title": "Day 3 after 1st chemo dose..."
    }
  ]
}