{
  "AuthorID": "Balentine",
  "AuthorURL": "https://csn.cancer.org/Balentine",
  "Posts": [
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "They did a sentinol node biopsy when I had my mastectomy where they only take 2 or 3 nodes and test them while you are going through surgery and if they find cancer in those nodes then they will take more until they don't see anymore cancer. I am not trying to tell you what to do but I would discuss this with your breast surgeon before ruling it out. I have had no problems with lymphedema at all. I plan to do reconstruction sometime soon but have not decided yet since I may decide to have the other breast removed because I just found out I am a poor metabolizer for tamoxifen. I will talk to another onc on 7/1 to get a 2nd opinion. Lorrie",
      "MessageIndex": 1,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195128",
      "Title": "Bilateral Mastecomy with Reconstruction"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "Thank you Kickie for your beautiful prayer. I appreciate it. God bless! Lorrie",
      "MessageIndex": 2,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195011",
      "Title": "My Survivor's Poem Hope you enjoy Much Love"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "Sounds to me that you need to ask your doctor how all of that would affect your fibromyalgia and do some research on it also before you make any decision. Also I agree with Eileen that you definatley need to wait until after radiation and then let the plastic surgeon give you his opionion. I had a right breast mastectomy in January, going through chemo now but have not made any decisions on reconstruction yet. I may not do anything for another year until I really feel that is what I want to do. The bras with the prosthesis still hurt my right side where the drain tube was and where lymph nodes were removed if I wear them 2-3 days so then I have to go back to wearing camisoles with a foam breast form in the camisole for 3 days. So I go back and forth. I have to wonder it my side still hurts that much after over 2 months since surgery, what will it feel like after reconstruction? Will I even be able to wear a bra without pain on a regular basis. There are alot of things to think about and always remember that our breasts don't define who we are....it is our heart and mind that people really see and that draws them to us to love us and support us and for us to love and support them. Good luck with your decision and God Bless. Lorrie Balentine",
      "MessageIndex": 3,
      "PostDate": "05/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189473",
      "Title": "Anyone with fibromyalgia have breast implants after mastectomy?"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "If you use biotene toothpaste with some backing soda sprinkled on it and biotene mouthwash it should help alot but you should do this 3 times a day. Also drinking warm, mint tea helps alot. Lorrie",
      "MessageIndex": 2,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195382",
      "Title": "What do I expect after next treatments?"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "I want to thank you for such a heartfelt prayer of portraying to God our deepest feelings and need for Him to come and give us peace and rest from the very vast range of emotions we are all experiencing. God bless you and your family. Lorrie",
      "MessageIndex": 3,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194495",
      "Title": "Prayer for tonight (just a suggestion)"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "Dear Rrogers, I am so sorry to hear about the loss of your father and I know nothing can ease that pain other than your faith in God (which is evident that you do) and time. When I lost my mother in 1997 it took me about a year to get past it. I would cry at the drop of a hat for no particular reason. I would see a woman my moms age at a restaurant and just start crying. We have to grieve though so know that this will be normal...you have to expell all of those emotions to get better. Also, having to deal with an unfaithful husband especially going through cancer is one of the hardest things to take. When you need them the most, they are just not there for you and worse....betraying you. I know the feeling....like you, my faith gets me through each and every day...one day at a time (as they say)...it is true....God gives you enough grace for each day and His mercies are new EVERY morning. Keep your eyes on Him my friend because there are no guarantees in this life but with Christ we have His guarantee living within us....His Holy Spirit who teaches us, sustains us, intercedes for us with groanings which cannot be uttered when we are too weak to pray for ourselves and who will carry us home to be with Him once this life is over. Receive the peace and comfort of God which passes all understanding. Love and hugs, Lorrie",
      "MessageIndex": 2,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195452",
      "Title": "Lost my Dad June 21st"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "It is so disheartening to read these recurrences. Every day we log on to this network, we do so to support one another to get through and start looking for the light at the end of the tunnel, but when we hear it is starting all over again for one of our friends here, our hearts just drop and break. This is why our lives will never be the same and why we have to be stronger and more positive than those who have never known cancer in their lives. We cannot give in to it or give up. We have to trust God and know He is with us and never leaves our side. Please know I will be praying for the both of you as you go through this together and support one another and hold each other up to God in prayer as well. Please stay encouraged and continue to come here for support and for venting. We are all here to listen, to cry with you and also to strengthen and encourage you. May God bless you, give you strength, comfort and peace and heal each of us of this awful disease never to return again...in Jesus name I pray. Lorrie",
      "MessageIndex": 44,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "It is so disheartening to read these recurrences. Every day we log on to this network, we do so to support one another to get through and start looking for the light at the end of the tunnel, but when we hear it is starting all over again for one of our friends here, our hearts just drop and break. This is why our lives will never be the same and why we have to be stronger and more positive than those who have never known cancer in their lives. We cannot give in to it or give up. We have to trust God and know He is with us and never leaves our side. Please know I will be praying for the both of you as you go through this together and support one another and hold each other up to God in prayer as well. Please stay encouraged and continue to come here for support and for venting. We are all here to listen, to cry with you and also to strengthen and encourage you. May God bless you, give you strength, comfort and peace and heal each of us of this awful disease never to return again...in Jesus name I pray. Lorrie",
      "MessageIndex": 91,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "I went to the plastic surgeon today to discuss my reconstruction options. He has done over 300 breast reconstructions and is trained also in doing the DIEP. After examining me and from his experience, he advised me my best option was something called 'muscle sparing free TRAM flap' surgery. He said it gives the best results in good blood flow to the tissue from the transplanted blood vessels that they move from the stomach area to the breast area. They do not transplant any of the abdominal muscle...only tissue and fat to create a new breast and the blood vessels of course. You get a tummy tuck and a new belly button. They open the existing mastectomy incision but the other incision will be below the new breast so it is hidden. So the only new scar will be on the abdomen right around the panty line. Recovery is 4-6 weeks, hospital stay is 3-4 days and 3 drains...2 in abdomen and one is breast. I also have 2 years to get it done. My tricare insurance covers the reconstruction for that long so I can recover from the mastectomy and chemo for awhile before I have to do the reconstruction. Anyway, you go back in later to have the other breast lifted and at that time when they do the lift, they take some tissue to make the nipple and add that to the new breast at the same time. He seemed very confident in his work and put to rest alot of my fears. Especially the fact that I have time to wait and heal and won't be rushed to get it done. He also told me not to lose any weight which was also nice...now I have a reason to be fat for another year. He said I right now have enough tummy fat to do one breast but if I lose weight, I may not have enough. I am 5'7\" and 180 pounds. Let me know if anyone has had this type of reconstruction and what your experience has been like. Thanks and God Bless. Lorrie Balentine",
      "MessageIndex": 0,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191720",
      "Title": "Update on DIEP vs TRAM flap procedure decisions"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "It is so disheartening to read these recurrences. Every day we log on to this network, we do so to support one another to get through and start looking for the light at the end of the tunnel, but when we hear it is starting all over again for one of our friends here, our hearts just drop and break. This is why our lives will never be the same and why we have to be stronger and more positive than those who have never known cancer in their lives. We cannot give in to it or give up. We have to trust God and know He is with us and never leaves our side. Please know I will be praying for the both of you as you go through this together and support one another and hold each other up to God in prayer as well. Please stay encouraged and continue to come here for support and for venting. We are all here to listen, to cry with you and also to strengthen and encourage you. May God bless you, give you strength, comfort and peace and heal each of us of this awful disease never to return again...in Jesus name I pray. Lorrie",
      "MessageIndex": 138,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "I have read that vitamin D and asparagus actually cure cancer. I have started both and am hoping there is some truth to it. Lorrie",
      "MessageIndex": 6,
      "PostDate": "30/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/193098",
      "Title": "The AntiCancer Way - book"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "I am going to have muscle sparing free tram flap surgery next summer so I will keep this nipple reconstruction technique in mind when I have mine. Since I did not finish chemo until just last month, the plastic surgeon told me I could not being reconstruction until August but I will be going back to work at school in August so I am waiting until next summer to have mine done. I am looking forward to it of course but not looking forward to the recovery of 4-6 weeks with 3 drains. I have a whole year to get mentally and emotionally ready for another surgery though so I am sure by that time I will be ready. Lorrie",
      "MessageIndex": 12,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "Samuri, I love to read your posts. They are always so encouraging and uplifting. I have always by nature been a most melancholy personality but reading yours and so many others posts here, I have learned to be more positive and look up a whole lot more. It is easy to lay down and just have a big pity party...we can all do that just about everyday...but to pick yourself back up, look to God and know that He will carry you during those times gives you hope and causes you to know and believe that with His help and the help of my sisters here that I know I can get through this. I am also glad that my insurance company (tricare) is allowing me 2 years to do my reconstruction. I really needed that time to get past my mastectomy and chemo physically and also emotionally and mentally be able to prepare myself for another major surgery and recovery. I just hope that by next summer I don't chicken out of it. I am sure I will be ready by then. Thanks and God bless you! Lorrie",
      "MessageIndex": 17,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "I am going to have muscle sparing free tram flap surgery next summer so I will keep this nipple reconstruction technique in mind when I have mine. Since I did not finish chemo until just last month, the plastic surgeon told me I could not being reconstruction until August but I will be going back to work at school in August so I am waiting until next summer to have mine done. I am looking forward to it of course but not looking forward to the recovery of 4-6 weeks with 3 drains. I have a whole year to get mentally and emotionally ready for another surgery though so I am sure by that time I will be ready. Lorrie",
      "MessageIndex": 11,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "I was dx IDC stage 1 2.2 cm lump, no nodes and 50 years old. No family history of bc. Had mastectomy and 4 rounds of chemo. Period stopped after 3rd round and getting hot flashes now. They wanted me to take tamoxifen but I am a poor metabolizer so 2nd onc advised having ovaries out and then doing arimidex or femara. I have opted not to do anything else for the same reasons you have stated....all of the side effects. I have changed my diet to mainly veggies and fruit....cut my sugar intake by about 80%...no dairy...some organic chicken, green tea, vitamin D3 and calcium for the most part. I feel my chances are much better doing what I am doing and quality of life is my main priority. Everyone is different and has to make their own choice. Pray about it and God will lead you. Lorrie",
      "MessageIndex": 1,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196477",
      "Title": "2nd opinion today"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "June 14, 2010 - 11:27am Kathi, Meena and Chen are like the captains of the football team I look up to you guys for guidance and for strength because I am just one month out of chemo and just 6 months past my dx. It is like a see-saw for me right now. Some days I am positive and strong and others I am worried and paranoid. Especially when we see recurrences of our captains. However, you all remain so strong and full of a zest for life that I have to tell myself..I want to get there...certainly not by way of a recurrence but by way of adapting to my circumstances...accepting where I am and getting on with my life...living each day to the fullest. Instead I find myself some days running out to do errands, then running home to take my scarf off...hoping my hair will grow and doing research on everything from diet and chances of recurrence to whether I should follow through and take tamoxifen. Some days it consumes me not knowing what to do, what to eat and not eat and where to go from here with further treatment. I pray and ask God for guidance to tell me what to do and not to do and lead me in His will for my life. I am afraid to take tamoxifen because of the chances of problems with my liver and all the other side effects it can have. Initially they told me it would only increase my chance of not having a recurrence by like 9 or 10 percent. Is all the other risks worth that? I know I have asked this before and you all said YES emphatically but I guess I am scared of the unknown and what else this cancer can take from me. Losing my breast was very difficult. I don't want to lose anything else. I am wondering if diet can benefit more than the tamoxifen. Well I am rambling now. ...sorry. In closing I want all 3 of you to know that you are in my prayers and that I admire your strength and will and I know God looks down on you all and your lives and smiles upon you because you all 'get it'...you have come to a point in your lives of reckless abandon and have discarded the negative baggage and only hold on to the things in life that are really important....love, laughter, humility, selflessness, and living life to the fullest extent as if today is your last. Many of us say we are doing that or are striving to do that and struggling to do that but you 3 are there and have arrived and truly living it. God bless you all and thanks for your inspiration and courage. Love always and many hugs, Lorrie",
      "MessageIndex": 0,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194371",
      "Title": "Kathi, Meena, Bj and Chen are like the captains of the football team"
    },
    {
      "AuthorID": "Balentine",
      "AuthorURL": "https://csn.cancer.org/Balentine",
      "Content": "I pray that God heals your body....that He gives you His comfort, strength and peace as you battle again...know that God is with you through this to lighten your load....cast your cares on Him Meena and allow Him to carry you through this....this was not meant for you to carry alone. He is there with you and with comfort you and bring you through this..In Jesus Name I pray. Be strong in the Lord and the power of His might. Lorrie",
      "MessageIndex": 2,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196050",
      "Title": "For Meena1"
    }
  ]
}