{
  "AuthorID": "Ballerina",
  "AuthorURL": "https://csn.cancer.org/Ballerina",
  "Posts": [
    {
      "AuthorID": "Ballerina",
      "AuthorURL": "https://csn.cancer.org/Ballerina",
      "Content": "Yellow New word Power",
      "MessageIndex": 29,
      "PostDate": "17/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238042",
      "Title": "Rhyming game"
    },
    {
      "AuthorID": "Ballerina",
      "AuthorURL": "https://csn.cancer.org/Ballerina",
      "Content": "Good news is I just celebrated my 27th year anniversary Dec 14th and we are just really starting to enjoy each other. I thank God I am alive to experience this. Ballerina",
      "MessageIndex": 5,
      "PostDate": "22/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232658",
      "Title": "We need some really good news today!"
    },
    {
      "AuthorID": "Ballerina",
      "AuthorURL": "https://csn.cancer.org/Ballerina",
      "Content": "My favorite color is pink and the pink family because it makes me feel danty and cheery. Ballerina",
      "MessageIndex": 11,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/231219",
      "Title": "I thought it would be great to see what your favorite color is, so, what is your favorite color?"
    },
    {
      "AuthorID": "Ballerina",
      "AuthorURL": "https://csn.cancer.org/Ballerina",
      "Content": "Kayrnic, cancer truely sucks but don't limit your life span. I am survivor but I have a friend that has had cancer in her entire body except the brain for six years. She told me she was not leaving this earth anytime soon and she will take treatment for as many times needed. When we do get together she gets up and dances then laughs because she says she will need her walker or cane tomorrow but not today. She always tell me to stay prayerful, positive, laugh,try to have a sense of humor and fight it's life we are talking about. You hang in there and my prayers and hugs are with you. There is nothing unrealistic about living a long time even with cancer. Ballerina",
      "MessageIndex": 6,
      "PostDate": "12/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237012",
      "Title": "What to expect?"
    }
  ]
}