{
  "AuthorID": "Beepositive",
  "AuthorURL": "https://csn.cancer.org/Beepositive",
  "Posts": [
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "Hello Jazz I am Taking Letrozole since march of this year (about 6 months )..mostly bone and joint pain (stiffness) when I first get and and when I set for long periods of time . my ONC did increase my calcium and vit D intake. so make sure you check with your Doctor on amount you need to add daily....so far so good for me .I always get on my treadmill each morning for about 20min that really help loosen up my musles.....things could be a lot worse.....IM BLESSED  (everyone system is so different) Best wishes to you!!!! Beepositive ",
      "MessageIndex": 2,
      "PostDate": "06/12/2017",
      "ThreadURL": "https://csn.cancer.org/node/313262",
      "Title": "Letrozole/Femara"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "Helllo All as I said in Dec about in my comments i have been taking Letrozole since 3-2017 bone and joint pain in legs especially when I first get up and sat for long period of time. I walk treadmill first thing in mornings and that helps a lot.  my onc dose have me taking more calcium and vit D .  Please check with your doctor on how much they want you to take....everyone body is different..PRAYERS AND BLESSINGS TO ALL!!! BEEPOSITIVE  ",
      "MessageIndex": 16,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://csn.cancer.org/node/313262",
      "Title": "Letrozole/Femara"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "hello Drios...as with all medications it has a different effect on everyone because our bodies react soo different to medications depending on your age and other meds you are taking..i know people with little side effects who are taking Letrozole. but as with everything PLEASE consult with your doctors..we can only give our experiences . PRAYERS AND HUGS TO YOU! bEEPOSITIVE",
      "MessageIndex": 12,
      "PostDate": "22/01/2018",
      "ThreadURL": "https://csn.cancer.org/node/313262",
      "Title": "Letrozole/Femara"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "Hello CSN Crew! I call myself BEEpositive and found out I had cancer just a couple months ago! It was like running into a BRICK WALL..on day I going along and then all of a sudden ..life changed!!! it took me a couple of days to myself to wrap my head around it.. i found out Jan 17, 2017 after imaging and a Biopsy that  I requested because of a mass that the mammography did not seem to mention. I have always had dense breast tissue but the one in my left breast seemed different especially since the outside shape of the breast started looking different than the right breast! It was there 6 months ago during my last mamo but doctors say mamo does not pick up everything especially \"Invasive Lobular carcinoma  good receptors postive (it appears as a mass and branches out instead of a lump) so in january my process started completed MRI  Feb completed CT chest scan , pelv scan and bone body scan prior to any surgery. All showed no signs of cancer in those areas ..Thank GOD. a few weeks ago I had my left breast total mastectomy and started plastic surgery steps at same time Mentor brest tissue Expander. the pathology report showed majority of the lymth nodes had cancer that were removed during surgery. currently I am seeing plastic surgeon and started brest tissue expander to start eppanding my breast tissue to prepare for the implant later. working with medical oncology to start best Anti horomone bills and and have appoint to discuss and schedule radiation treatment. the doctors are not as positive as i am about everything. to me I feel very blessed to have demanded additional testing and found the cancer in the breast other wise i would have gone another  year without another mamo! I am still in moderate pain but I am going to go thru this with my head held HIGH and count my blessings! I am not going to spend my life thinking when..if cancer could come back..thats not living! I am a very Positive person and have always and will continue to be the one who helps others...thats my motivation and healing! BEEPositive!!",
      "MessageIndex": 0,
      "PostDate": "23/03/2017",
      "ThreadURL": "https://csn.cancer.org/node/308666",
      "Title": "New TO ME!!"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "hello HapB..the Medicial oncologist did recommend/highly suggest chemo after my surgery because large amount lymph nodes with positve that were removed. I had Invasive Lobular Carcinoma /estrogen recptor/progesterone receptor positive and HER2-Negative....ask lots of questions. did you have chemo when you was Diagnosed in the past?   Keep asking questions and what your options are ? and second opinion is always good to if you not sure..  Best wishes to you..YOU WILL BE FINE!! KEEP THE FAITH!!    BEEPOSITIVE ",
      "MessageIndex": 8,
      "PostDate": "30/04/2017",
      "ThreadURL": "https://csn.cancer.org/node/308697",
      "Title": "My mother just told me she has cancer!"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "Im with you HapB! i did the same thing with my daughter she know there were cancer cells found and i had surgery. I did not want to get her all worked up she has two little ones and I told her pits and pieces and may tell her more if/when necessary. The way I see it my cancer was removed and Im doing preventive measures now with the radiation and the anti homo pills...IM LOOKING TOWARD THE FUTURE..HAD SCAN AND MRI, BONE SCANS prior to my surgery no cancer found just in left breast that was removed (march 2017)and nodes  GETTING  BUSY  LIVING!!!  SUCCESS AND PRAYERS TO EVERYONE!!  BEEPOSITIVE",
      "MessageIndex": 6,
      "PostDate": "30/04/2017",
      "ThreadURL": "https://csn.cancer.org/node/308697",
      "Title": "My mother just told me she has cancer!"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "hello TY ! Welcome to the site! I am new to this also just found out I had breast cancer two months ago (see my info on \"New to Me\" under this breast cancer link) we sometime, not forget, but dont realize how much it effects our love ones this type of bomb shell ! I have sisters and a daughter etc and they are concerned I am very positive person and the most you can do for your mom is to ...BE THERE FOR HER call her , go with her to appointments or make sure someone is there to hear all doctors have to say..its always a lot of information and good to have other ears around..and foHopefully you and your sister can put whatever aside focus on your mom! (im sure she will want all of you and your support right now)   Good Luck to you and your mom and Family..Together you can get thru it!!!  Be strong for her..I know when I first found out I was more concerned with telling my family especially my mom and daughter (I told my sisters all but limited some of the info to my daughter and mom she is 80 and doing find dont what to worry her so much) I just had my surgery on March 7, 2017 and left breast mastectomy and had some lot of nodes removed cancer (did CT scans and bones scan prior to surgery nothing there THANK God) and about to start radiation and some other treatments and also started breast reconstruction during the surgery (lot going on at same time)   I am very positive and know things could be a lot worst if i did not request additional testing after my last mamo because i knew something did not feel right.....Stay Strong for your MOM and put aside difference with all and focus on Mom and her needs.   God Bless and much success to your Mom!     BEEPositive!!",
      "MessageIndex": 2,
      "PostDate": "26/03/2017",
      "ThreadURL": "https://csn.cancer.org/node/308697",
      "Title": "My mother just told me she has cancer!"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "Hello swimmergirl , yes as Jessiesmom1 stated about talk to your plastic Surgeon about what you are looking for in size. also if you had chemo and or Radiation they normally have to wait months before implants are done to give body time to heal. I had expander placed  same time as  left breast removal and did had a couple of fills done before the radiation treatments..but the plastic Surgeon said he needed to wait min of at least 6 months before he can do implants due to radiation and need time to heal. Good Luck with everything...prayer and blessing to you! BEEPOSITIVE",
      "MessageIndex": 2,
      "PostDate": "24/02/2018",
      "ThreadURL": "https://csn.cancer.org/node/315116",
      "Title": "Reconstruction - How do I know what size to go?!?"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "I AGREE WILL YOU ALL!!  I have changed my diet and exercise and trying to drop some more weight also. but mine over matter is HUGE..ITS HARD SOMETIMES but think positive and keep busy pay it forward and find something positive to focus on.. family grand kids ..friends  and get busy living..we may out live our doctors..only God knows...  so enjoy life and dont focus on what if ..focus on your new Normal...you will be fine. hug and prayer for ALL   Beepositive  ",
      "MessageIndex": 6,
      "PostDate": "02/10/2017",
      "ThreadURL": "https://csn.cancer.org/node/312304",
      "Title": "Stage 3b now, fear of future metastasis"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "Best Wishes and prayers With everything, Cherryblssm!! you will be fine!   continue to  BEEPOSITIVE!!",
      "MessageIndex": 1,
      "PostDate": "28/08/2017",
      "ThreadURL": "https://csn.cancer.org/node/311677",
      "Title": "1st Chemo on Thursday"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "Everyone Have a Blessed And HAPPY Thankgiving...I have a lot to be Thankful For!!!   Hugs prayers and blessing to all on continued recovery and FIGHT! BEEPOSITIVE!!",
      "MessageIndex": 0,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://csn.cancer.org/node/313134",
      "Title": "HAPPY THANKGIVING TO ALL**BE POSITIVE**BE BLESSED"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "Get another opinion and see what he say...GOOD LUCK AND PRAYER TO YOU.. Beepositive",
      "MessageIndex": 1,
      "PostDate": "26/04/2017",
      "ThreadURL": "https://csn.cancer.org/node/309273",
      "Title": "I'm So Confused"
    },
    {
      "AuthorID": "Beepositive",
      "AuthorURL": "https://csn.cancer.org/Beepositive",
      "Content": "hello Oldbeauty, thinking if you..Good luck with everything..you will be fine ! beepositive",
      "MessageIndex": 2,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://csn.cancer.org/node/311126",
      "Title": "Breast Biopsy"
    }
  ]
}