{
  "AuthorID": "bev49",
  "AuthorURL": "https://csn.cancer.org/bev49",
  "Posts": [
    {
      "AuthorID": "bev49",
      "AuthorURL": "https://csn.cancer.org/bev49",
      "Content": "That is really awesome! How wonderful, and exciting too! Can't wait to see the photos. bev49",
      "MessageIndex": 3,
      "PostDate": "05/03/2008",
      "ThreadURL": "https://csn.cancer.org/node/157129",
      "Title": "Look for me on the catwalk!!!"
    },
    {
      "AuthorID": "bev49",
      "AuthorURL": "https://csn.cancer.org/bev49",
      "Content": "For me, I think that as I became an adult, wife, and mother, I just moved so far away from that little girl in my old photos, because we don't have much time to think about the past. Now, as a 3 year bc survivor, I not only long to be that child again, I thurst for all the fun I can have, realizing that my life could have been shortened. Now, I want to make snowmen in the front yard when it snows, color with my grandchildren, and more. I sometimes feel like I lost time fighting cancer, and now I feel like I need to rush to make up for it. I too have learned how to love the child in me again, and she is a lot of fun to be with. I told my 6 year old graddaughter when she asked me who was my best friend...that I was my own best friend. Maybe she thought it would be her, and she is to young to understand, but I was very surprised at my answer. Cancer makes us love ourselves, because we actually have to take the time to learn who we are. We tap into the inner strength we need to survive, and are amazed to find how strong we actually are, as we focus on ourselves in order to accept what we we are going through. I adore each and every one of you, and certainly have enjoyed reading the past few days of these messages, as it confirms some of what I have been thinking and feeling. Blessings, bev49",
      "MessageIndex": 7,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://csn.cancer.org/node/156929",
      "Title": "self love"
    },
    {
      "AuthorID": "bev49",
      "AuthorURL": "https://csn.cancer.org/bev49",
      "Content": "Hey guys, For your info..I watch ABC news every am, and today they talked about a new web page called abc News On Call...Breast Cancer. You can find it by going to abcnews.com, you'll see the big pink box, click on that, and it takes you there. Check it out..it is fabulous. Lots of info. As for me, I am frustrated at the moment..like that is something new for us, right? I saw my surgeon last Wed. and he sent me for an ultrasound concerned about the \"knot\" in the middle of the incision made to remove a cluster of calcium deposits 6mos. ago.There were no cancer cells..thank goodness. While I am hoping it is just scar tissue, the report has not come back after a week, and you all know how we get anytime we have to wait for reports. I can feel this tiny lump too, which didn't show up until 2 mos. ago, but still, we all worry don't we? This is scar #7,and on the other breast, not the one with the cancer 2 years go, so the decision has already been made that if they need to go back in for anything, they want me to just have a double mastectomy. I am sort of sitting on thin ice right now, and needed to vent to you as we all understand the waiting game. Thanks for listening. Take care ladies, and don't think for one moment that this web page at abc can do for us what we do for each other here on this network. I saw my onc for the yearly visit today, and passed this site on to a very sweet man sitting in the waiting room. He and his wife have been married for 50 years. She will be going through chemo for a full year, and he needs the support to. I hope they visit us soon. Catch ya later. God Bless, bev49",
      "MessageIndex": 0,
      "PostDate": "04/10/2007",
      "ThreadURL": "https://csn.cancer.org/node/155763",
      "Title": "FYI & Frustrated"
    }
  ]
}