{
  "AuthorID": "bgfreed",
  "AuthorURL": "https://csn.cancer.org/bgfreed",
  "Posts": [{
    "AuthorID": "bgfreed",
    "AuthorURL": "https://csn.cancer.org/bgfreed",
    "Content": "I, too look at other women's boobs. I had an estrogen-positive, fast-growing, malignant double-cancer in my left breast. I then had a mastectomy (only ten month's into my yearly mammo)five years ago. I have been on Arimidex, Aromasin, & Tamoxifine for the past five years. I am very happy to be pronounced cancer-free after these 5 years, but I really feel NO ONE in the medical field is helping us AFTER the crisis. I don't think there is enough research dealing with the after-effects of mastectomy and chemotherapy for women. Today, I felt a tear roll down my cheek. I wondered where it came from until I remembered that ten minutes before, I had been thinking about my physical dilemma. I had chemo and lost all my hair, I then took adjuvant therapy for five years. During that whole five years, my hair came in thin (believe me, I had the thickest head of hair before that the beautician had to use thinning scissors) now scant in spots, sores grew in my head, and I gained weight from the adjuvant therapy meds (over 30+ lbs. after I had lost 17 lbs in the first two weeks of chemo). I elected to have a tram-flap procedure during mastectomy surgery. I had a total of five surgeries during the first year of breast cancer. (I had a re-excision where the doctor found another cancer growing under the first lump, and then an unexpected start-stop mastectomy because of a heart problem during surgery.) By the way, my doctors, ICU staff, chemo nurses were ALL excellent. After being very tired of doctors' hands all over me, I elected to stop the reconstruction of the breast after two surgeries. I was tired and ready to just fight my cancer, regain strength, and get on with living. What I want to express is my dismay and aloneness in womanhood now. I was 60 yrs old during my cancer, now I am left with a huge stomach scar, one actual-looking right breast (no left), thin kincky strands of hair, and a mental depression that I cannot even begin to describe. I am looking at maybe another 20 years or more most likely without sex with my husband. I am in therapy and I have a sweet, wonderful husband that stood beside me ALL the way, BUT look at what is left (besides the eradication of cancer). I have no cleavage, I am scarred, and I would \"repel even a rapist\" as Ann Rice puts in one of her books. I am just now trying to wear augmented bras because 'braless' just made me look older. I am seeing a nutritionist for weight (they are highly recommended), and I walk 3 miles three to four times a week, all of which has been a YEAR of only 26 pounds lost, leaving me still 20 pounds overweight (of which the researchers are telling us that weight gain attributes to cancer!?!). I want to know WHO is helping us survivors be physically viewed or loved again?? Does anyone really expect a human husband to find his cancer-surviving wife physically appealing and touch her again?? This is a subject I find extremely hard to describe to even a therapist. Where do we begin to make repairs in such a scarred life?? I talked with the NIH Cancer Research people (very nice , informative, and helpful) and they told me there is very, very little 'out there' upon which to draw on concerning this subject. Anyone out there have any words or ideas to help? (Please know I AM, however, thankful for my LIFE.)",
    "MessageIndex": 14,
    "PostDate": "31/10/2012",
    "ThreadURL": "https://csn.cancer.org/node/245072",
    "Title": "I look at boobs a lot more now....LOL"
  }]
}