{
  "AuthorID": "billswife",
  "AuthorURL": "https://csn.cancer.org/billswife",
  "Posts": [
    {
      "AuthorID": "billswife",
      "AuthorURL": "https://csn.cancer.org/billswife",
      "Content": "Happy Easter to all too. Yes, it is beautiful here in SC but it got cold! We look at Easter with hope. Four different doctors advised no radiation after my chemo and \"so far so good\" was the comment at our last doctor's visit for my husband's brain tumors. He has 3 more radiation treatments to go and an MRI scheduled for May ( after our trip to see our family in Michigan) May we continue to be blessed. Kathy",
      "MessageIndex": 2,
      "PostDate": "07/04/2007",
      "ThreadURL": "https://csn.cancer.org/node/154095",
      "Title": "Happy Easter All"
    },
    {
      "AuthorID": "billswife",
      "AuthorURL": "https://csn.cancer.org/billswife",
      "Content": "I haven't posted in a while so I thought I'd update our life. My husband is 1/2 finished with the radiation for the brain tumors and is still feeling well. The fatigue is kicking in but we know how to deal with that from the last time. The Doctors were very happy that they were able to find a path to radiate that would not cause further damage to the area already radiated when the sinus cancer was treated and yet still be effective. They are still calling him a Gamma Knife candidate and our oncologist had a much more positive spin on Bill's condition that the radiologist ( it's all in the presentation) We felt like telling Elizabeth Edwards and Tiny Snow \" get in the boat-- there's room\" for we all are looking at how to live, not getting ready to die. I meet with the doctor on Thursday for my check up and to discuss adding the radiation--I've decided to go with it. In the meantime, we take 1 day at a time. We just got back from a quick trip back to NJ and next month we will head to Michigan to see the rest of the family. We, like Spring, begin again. Kathy",
      "MessageIndex": 0,
      "PostDate": "02/04/2007",
      "ThreadURL": "https://csn.cancer.org/node/154043",
      "Title": "How we're dealing"
    },
    {
      "AuthorID": "billswife",
      "AuthorURL": "https://csn.cancer.org/billswife",
      "Content": "Let me start with the good news. Last week's MRI showed improvement in Bill's brain tumors over the original one. Our oncologist will now take everything to the Gamma Knife team and they'll decide if they want to wait another 6 weeks to see if there is additional improvement or forge ahead now. To be honest we were both surprised at this news because while we were in Michigan and he was completely off the steroids, his symptoms came back ( falling, disorientation-- he didn't even remember we were in Michigan) Thankfully I had discussed what happens when you come off the steroids with the doctor before we left and he told me to take the pills with me and call him directly if I saw a problem. You bet I called! He immediately put him back on a medium strength dose and once again there was improvement right away and the last half the visit was fine! Each day now gets better again and he can stay on these meds until the team decides what to do next. AND.. a support group for caregivers started while we were away. I'll be going this week to check it out. Kathy",
      "MessageIndex": 0,
      "PostDate": "13/05/2007",
      "ThreadURL": "https://csn.cancer.org/node/154436",
      "Title": "A better day for Mother's Day"
    },
    {
      "AuthorID": "billswife",
      "AuthorURL": "https://csn.cancer.org/billswife",
      "Content": "Congratulations on the encouraging news. If you're in North Jersey, look into Hackensack Medical Center (sorry about the spelling) If you're in the central part of the state The Cancer Institute of NJ is at Robert Wood Johnson University Hospital in New Brunswick ( it's a NCI center) Overlook in Summit has a good program and Sloan-Kettering now has several outpatient centers in NJ Kathy",
      "MessageIndex": 4,
      "PostDate": "15/03/2007",
      "ThreadURL": "https://csn.cancer.org/node/153838",
      "Title": "AN UPDATE!!!!"
    }
  ]
}