{
  "AuthorID": "BioAdoptMom",
  "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
  "Posts": [
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "Even though its an extra expense, it sounds like it will be something which will make you feel a lot better! And it will be so easy, just pop it on top your head, no styling, no blow drying, nothing at all. You will have perfect hair in an instant! And your post encouraged me to also consider a wig. I was just going to go with scarves and hats, but I think a wig will be a great self-esteem boost. (((((HUGS))))) Nancy",
      "MessageIndex": 4,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216750",
      "Title": "I'm going wig shopping!"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "It's just my opinion, but if you are not in pain or especially uncomfortable with it, I would let nature take its course. If it is bothering you, see a podiatrist to see if it needs to come off. They do this stuff everyday and I would much rather have one of them do it than a regular doctor. Good luck to you! I have had two removed and it wasn't fun, though those were not coming off, just ingrown and infected. Nancy",
      "MessageIndex": 1,
      "PostDate": "08/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218063",
      "Title": "Toenail"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "I am just wondering how common this side effect with Taxotere and Cytoxan is? I will be starting in a couple of weeks and I think I am dreading the thought of mouth sores more than anything else (besides nausea but that can be controlled or so I am told). Is there anything you can do to prevent them, or relieve them if they do occur? Thanks! Nancy",
      "MessageIndex": 0,
      "PostDate": "19/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216702",
      "Title": "Are mouth sores common with T/C?"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "(((HUGS)))! One of my co-workers told me she wished she had BC so she could get a boob job paid for by her insurance company! People can be so insensitive. Nancy",
      "MessageIndex": 13,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/217943",
      "Title": "comments"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "(((HUGS))) and prayers! Nancy",
      "MessageIndex": 11,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218399",
      "Title": "pre op testing"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "I haven't done Tam yet, but have heard it can cause us to be very emotional. You are also dealing with a ton of emotion just because of your diagnosis alone. I would think the two combined would indeed bring some tears. As I said, I have no experience, but have heard that it also gets better over time. (((((HUGS))))) and prayers! Nancy",
      "MessageIndex": 1,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/217832",
      "Title": "twlight zone"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "Nice to meet you Pammy, just sorry it's here! I'm Nancy and just joined this group about a month ago. I had a lumpectomy in February, more surgery to clear margins in March and started chemo last Friday. I am glad this place is here for us! I hope everything comes back negative and am adding you to my prayer list! Nancy",
      "MessageIndex": 12,
      "PostDate": "04/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/217702",
      "Title": "Stopping by...."
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "I see the medical onco for the first time tomorrow and don't know exactly what the plan will be. I am stage 1, grade 3, ER/PR+ and HER2-, so may end up having to wait awhile longer for an Oncotype. At any rate, I have decided as of tonight that IF chemo is recommended and whatever anti-hormone therapy may be recommended, if it improves my long term life expectancy by even just a few percentage points, I am going for it! Of course not for a 1 or 2% increase, but I think anything greater than that. This is so hard. I hope it's the right decision, but I have an 11 y/o DD as well as 2 young adult sons and I want to be here for all the college graduations, weddings and to enjoy any grandchildren! I'll give it all I've got! Nancy",
      "MessageIndex": 0,
      "PostDate": "29/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/215253",
      "Title": "I have decided to give this everything I've got!"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "Thank you for sharing your FABULOUS news! Soooooooooo happy for you! Nancy",
      "MessageIndex": 6,
      "PostDate": "05/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215717",
      "Title": "No Colon Cancer,Thank you Jesus"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "You all are going to be sorry I ever found this site with all these constant questions of mine. I was wondering what your oncotype score was, and if you had chemo or not based on that? My onco told me I'll be getting it if I fall into either the high or intermediate range, but I know others who had scores in the 20's who turned it down. I am also trying to get an idea of the most typical score range for those of us who have this test. I tried to find the stats on percentages of BC survivors on the Internet last night, who fell into each range, but couldn't find it. Thanks! Nancy",
      "MessageIndex": 0,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/215382",
      "Title": "If you had oncotype, what was your score?"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "You might arrive early or you might arrive late, no matter what you did hope your birthday's been great! Nancy",
      "MessageIndex": 13,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218299",
      "Title": "Today is CanoeGirl's Birthday!"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "Wow, you have so much on your plate. No wonder you are \"freaking out\"! I am so sorry you are having to deal with this all at the same time. As far as the kids' activities, birthdays, etc. I totally understand what you are saying. All 3 of ours are at home and the youngest is 11. She is involved in so much and sometimes I get so frustrated because I just want to take care of me, but I can't. I totally relate to that and hope you were able to still enjoy your day with your family and friends. It can be hard though. I think things are hardest when we don't have answers and feel out of control. That is where you are right now. I wish I knew what the answer for that is, other than to just pray and try to find time to do something relaxing you enjoy. Someone on here last night suggested journaling. I haven't tried that yet, but maybe it would help to write down your feelings. You and I seem to have a lot of similarities with our breast cancer. I was diagnosed in mid January and am also waiting for my Oncotype score to come back. I will have rads after chemo if chemo is needed. When were you diagnosed? I am guessing it must be a recent diagnosis for you as well. (((HUGS))) and prayers! Nancy",
      "MessageIndex": 12,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215470",
      "Title": "Freaking Out"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "I am sorry about your diagnosis and to have to meet you here, but am glad you found us! And, I am glad you are going to be able to harvest some eggs to help preserve your fertility. I am starting the same cocktail this coming Friday, 4x also and my MO just told me on Thursday that he thinks I'll do fine without a port. It looks like we'll be traveling this road together huh? Nancy",
      "MessageIndex": 7,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217003",
      "Title": "Four rounds of chemo, will I need a VAP?"
    },
    {
      "AuthorID": "BioAdoptMom",
      "AuthorURL": "https://csn.cancer.org/BioAdoptMom",
      "Content": "How scary and frustrating this has to be for you! The physical part is bad enough, then to have doctors who don't listen and won't give what you need to deal with the pain? I agree that you need new doctors, and you need something different for the pain. (((GENTLE HUGS))) and prayers! Nancy",
      "MessageIndex": 16,
      "PostDate": "01/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215436",
      "Title": "I'm another one that needs to vent"
    }
  ]
}