{
  "AuthorID": "butterflylvr",
  "AuthorURL": "https://csn.cancer.org/butterflylvr",
  "Posts": [
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Nope... lucky me the curse is gone. Are you currently taking tamoxifen or any other estrogen blocker? If so I believe your oncologist will want to know... I know of women getting the periods back and with each of us it's different. Most usually return within six months or so of stopping chemo... I'd say you are normal, but make sure your MO knows. Hugs, Lorrie",
      "MessageIndex": 1,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228103",
      "Title": "My period came back???"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I agree with Suzanne, I love my gyno. It was with his loving hand that I started my cancer journey. I saw him last month for a uterine ultrasound and I too have fibroid tumors. Nothing he is concerned with yet, so I am in the watch, wait and see phase. He gave me his thumbs up to start my tamoxifen regimen. Good luck Jen.. you know I'm in your corner cheering you on buddy... Hugs, Lorrie",
      "MessageIndex": 7,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225293",
      "Title": "Biopsy and surgeon visit"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Bonnie is right Dawne, the time does go by fast. I can tell I must be getting near the end of my graduating class because the guy I usually see in the slot before me graduated today and the gentleman behind me is done next week. Ha... then I will be top dog to all them rookies. LOL I had treatment 22 today and had to get a script for biofine as the burning under my boob area was getting pretty intense. I already got some of that slathered on as I type... I'm glad to hear you are doing well buddy. Hey are you on Facebook at all? If so look me up.. there aren't too many Rumpfs on there and my pic is pink. I pray your journey continues positively... You sure have the attitude. Hugs my friend, Lorrie",
      "MessageIndex": 20,
      "PostDate": "16/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220212",
      "Title": "Finally started rads today"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Jojo you are a true friend for stepping in. After his daughter gets the much needed counciling she needs their relationship is going to be so much better. If she was left any longer in that environment she may have done something more drastic. You have a good heart sweetie..",
      "MessageIndex": 17,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230357",
      "Title": "Did i do the right thing?"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "That is exactly why I asked about being on a estrogen blocker. Bleeding can be the cause of other things besides ones natural cycle. I just turned 50 last month, so I hope my monthly curse is gone.. LOL Hugs, Lorrie",
      "MessageIndex": 4,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228103",
      "Title": "My period came back???"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Good Luck Dawne girl, I just crossed over the half way mark with my rads today. So far just a little pink.. but doing well. How are you recovering from your surgery? Do you have your full range of arm movement back yet? It's good to catch up on how your doing, I've though about you over the past couple of weeks. Keep in touch, Lorrie",
      "MessageIndex": 14,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220212",
      "Title": "Finally started rads today"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I am so sorry. Words fail me right now but be rest assured I will be on your side of the ring once you put those pink gloves back on. Adding to the love, Lorrie",
      "MessageIndex": 5,
      "PostDate": "24/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225100",
      "Title": "Monday's Biopsy Results"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I had a follow up appointment with my RO yesterday and everything is healing up nicely. My original doctor was out of the office my graduation week so this was the first time I've seen him in a month. He pulls a sheet out of my file that the \"Substitute Dr.\" had written upon my discharge describing all my owies. He read aloud a long paragraph of words I didn't even understand. Upon finishing he looked up at me and without missing a beat I said \"Yup sounds about right\". We both had a good laugh and then he ordered me up on the exam table. LOL... now for some reason he wants to see me back in six months.Something about wanting to see how the skin is healing after my implant exchange surgery. Oh well what's one more visit down the road? While I was there I did pop back to see if my Rad Tech girls remembered me. Anna says to me \"Do we remember you? We have a picture of you up on our walls\". Now mind you at first I panicked thinking most of the pictures of me that they took were of my naked foobs (fake boobs)with my rad tattoos. I had to chuckle myself when I saw the picture she was speaking of was that of me holding the cake I brought in for my graduation party. Needless to say we all got a good laugh when I told them of the pictures I was thinking of because centerfold material I am not. Haha... Lorrie",
      "MessageIndex": 0,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/223642",
      "Title": "RO appointment - had to chuckle"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "What do you mean not having an amazing story? I would say that you are pretty amazing ....",
      "MessageIndex": 5,
      "PostDate": "15/06/2012",
      "ThreadURL": "https://csn.cancer.org/node/241739",
      "Title": "Detailes of Chicago Trip"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "JoJo, I agree with Janelle. You need to write a letter to somebody because this kind of professional behavior is unacceptable. Does your hospital ever give you those after procedure surveys? You were lucky you caught their mistake, think of all those people that might not be so lucky after you. Blow the whistle I say... Hugs, Lorrie",
      "MessageIndex": 19,
      "PostDate": "13/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222247",
      "Title": "Venting after surgery"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "My tumor was detected just like yours. My left nipple started retracting inwards and it felt hard too. I also had some skin dimpling. Without knowing what your biopsy results will find, since my nipple retracted too, I was diagnosed as IDC (Invasive Ductile Carcinoma) the most common form of breast cancer. It starts in the milk duct and can spread beyond that. My tumor didn't spread but just grew and grew... So I had to have a mastectomy because a lumpectomy would have left a caved in breast. I opted to have them both removed. Yes, everything is a whirlwind right now and that's a good thing. The sooner your doctors can assess the tumor the faster you can get treatment. Now with that in mind, don't think the worse about everything or you will worry yourself silly. I had to do chemo, surgery, radiation because of the tumor size and I am now on hormone therapy (Arimidex) to block my estrogen. Every course of treatment they can give you betters your odds of survival. Listen to your doctors and do research. This website The American Cancer Society is a great place for that. I am sure if you even looked hard enough there will even be an article or two on when and how to tell family member. We are here to hold your hand though your journey, just reach out for us. Hugs, Lorrie",
      "MessageIndex": 3,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238981",
      "Title": "I am very scared!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "and been given the strength it takes to keep on fighting. Everyday I am inspired by so many women on this board whom are back in the ring with their pink gloves. Fighting not just for themselves and their families but for all of us whom have come to rely on their wisdom. Lorrie",
      "MessageIndex": 6,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225394",
      "Title": "Sometimes we don't always say it but..............."
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "See all men can have a positive side. What a sweet thing for the hubby to do, although we wouldn't have expected any different. It's just nice that he pushed all his cards in emotionally for you. Kuddo's to him and good luck on the rest of your journey.. Hugs, Lorrie",
      "MessageIndex": 2,
      "PostDate": "20/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220958",
      "Title": "Hubby was good today...."
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Me too... I am beyond words. It's a good thing going through this process made us tough gals. Why don't people think before they speak?",
      "MessageIndex": 2,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/217943",
      "Title": "comments"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Denise you of all people should have this down pat by now. I'm sorry that your walls seem to be crowding in around you. You are a strong woman and this too shall pass. Treat yourself to something fun this weekend to try and help take your mind off it. I think maybe you need a night out with girlfriends, that always works for me. Non stop giggles... Hugs and well wishes my friend, Lorrie",
      "MessageIndex": 1,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218399",
      "Title": "pre op testing"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Thinking about you and praying you are hearing good news right about now. Lorrie",
      "MessageIndex": 32,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219583",
      "Title": "Two Kindred Spirits need the Magic Pink Bus and our Prayers for appointments on Wednesday and Thursday"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I am so sorry to hear this. It sounds like a lifetime friendship was in the making and I am sure Nathan had comfort in his final days knowing Sandra had such great support in friends like yourself. My condolences and prayers to the family... Lorrie",
      "MessageIndex": 2,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://csn.cancer.org/node/235897",
      "Title": "My Chemo buddy lost ..."
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Count me in... My hair is just long enough now where I can do it all up in pink bows. Pick me up on the street corner after my rads appointment. Maria warn your husband, if it's loud outside he might want to lock those hospital doors. Let's see what can I bring... hmmmm.. I'll bring a big heart shaped box of chocolates. Everybody loves chocolate right? Good luck girls, Hugs, Lorrie Chen glad to hear you still got a nice booty...",
      "MessageIndex": 3,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/219583",
      "Title": "Two Kindred Spirits need the Magic Pink Bus and our Prayers for appointments on Wednesday and Thursday"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Merry Christmas Marge, Enjoy and celebrate... Lorrie",
      "MessageIndex": 4,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232158",
      "Title": "Six month visit with Med Onc"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Prayer vigal started and sending positive thoughts and loving prayers at this moment.. You will wake up feeling energized with all the love here on the pink bus. Jennifer will you get your butt back in on this side of the window, you're going to fall out girl. Somebody please strap her in her seat I thought I saw a police car heading in the other direction. I think they may be on to us... You can dress them up but you can't take them anywhere.. LOL Thinking of you Maria, Lorrie",
      "MessageIndex": 29,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219583",
      "Title": "Two Kindred Spirits need the Magic Pink Bus and our Prayers for appointments on Wednesday and Thursday"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Whew.. snuck in just in time.. \"Happy Anniversary Denise\". Twenty Six years is long time, my hubby and I will be celebrating our 25th next year. We have such great guys... Hugs, Lorrie",
      "MessageIndex": 6,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221083",
      "Title": "Happy Anniversary Disneyfan2008 - Denise!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Deb, I wasn't here for your initial diagnosis, but I too want to extend my love and support to you as you venture down this new journey set before you. Good luck at Mayo, you will be in fantastic hands. Prayers coming, Lorrie",
      "MessageIndex": 12,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Deb, I wasn't here for your initial diagnosis, but I too want to extend my love and support to you as you venture down this new journey set before you. Good luck at Mayo, you will be in fantastic hands. Prayers coming, Lorrie",
      "MessageIndex": 62,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Wow Mary.. you have one amazing man there. Together the two of you will get though this no matter how terrifying things seem now. I think by being forced to be the strong one will actually make you the strong one. See girl... you have it within. Keep up the fight... Hugs, Lorrie",
      "MessageIndex": 22,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222439",
      "Title": "My Chemo Drugs??"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Before your surgery, your surgeon and oncologist probably believed your breast cancer was of the most common kind. Meaning in the milk ducts like mine was. I was given 4 infusions three weeks apart. After your surgery they knew exactly which type of cancer you are dealing with so your treatment plans changed. Many of the women on this board blazed the same trail you are about to go through and I am sure you will find great advice from them. My tumor took me down a different route then yours but either way that first day of chemo can be so scary. The others offered you some great advice, after you get that first one under your belt you will just blaze right through all this. After your first treatment you will know how your body responds and you will soon figure out your good days and bad days. On those good days you can be mommy to all those precious children of yours, but on your bad days... let them pamper you. You will be amazed at how important they will feel just running after a pillow for you or getting you a glass of water. Mary take our hand and let us walk with you through those chemo doors and we promise to never leave your side. Post away any concerns and I guarantee you will find you have so much strength within you never realized you had. It is truly amazing when you realize this... Hugs my dear, Lorrie",
      "MessageIndex": 7,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222439",
      "Title": "My Chemo Drugs??"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Posted this on her Facebook wall about one hour ago \"Saddest of news. My sister Claudia Cable is losing her long battle with cancer. I'm on my way to California right now.\" I'm heartbroken... Lorrie",
      "MessageIndex": 6,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://csn.cancer.org/node/261005",
      "Title": "Chenheart -- Any word, or updates?"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Looks like a big party for us next week. Cool.... Lorrie",
      "MessageIndex": 2,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/219495",
      "Title": "National Cancer Survivor’s Day"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "The following was posted by Claudia Cable's beloved niece, Siobhan...   To the kindreds.. Thank you for always being the light in her dark days.. Thank you for loving her though some of you never got the chance to meet her in person. She has fought so hard for so long and all of you have stood by her side and this touches her heart more than I can express..   As we enter the final stages of this battle, carry with you the messages of hope, strength and love that I know she has imprinted in your hearts. She will remind you to \"be stronger than not angry at\" and now is indeed time to heed these powerful words.   She is the light in our hearts, the strength in our souls and the inspiration to help the other fellow kindreds to do good unto others and to remain strong.   I have been lucky enough to have had her in my life longer than anyone, days, months, years of memories and she has shaped me into the person I am today and will live out my days always asking myself \"what would Chen do?\" when I'm faced with life's challenges. She and I encourage you all to do the same now and always..   Raise a glass, light a candle, say a prayer, for our 50 foot woman.",
      "MessageIndex": 28,
      "PostDate": "17/07/2013",
      "ThreadURL": "https://csn.cancer.org/node/261005",
      "Title": "Chenheart -- Any word, or updates?"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Thanks Jean ♥",
      "MessageIndex": 4,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232701",
      "Title": "Thank you Jean.."
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Is always in my love and prayers. I miss her wisdom and friendship... Please lord give her some good news.   Love you Claudia... ♥ Lorrie",
      "MessageIndex": 17,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Is always in my love and prayers. I miss her wisdom and friendship... Please lord give her some good news.   Love you Claudia... ♥ Lorrie",
      "MessageIndex": 64,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "OMG Jennifer you crack me up. At least you still got your good sense of humor about you. I'm sure glad the weekend is here because my left girl can sure use the rest. I'll wait for you at recess when you return to school. We got some life to live girlfriend.... Hugs, Lorrie",
      "MessageIndex": 4,
      "PostDate": "24/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221189",
      "Title": "Not flunking rads.....out of school suspension"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I too am joining in on the celebration, but I would have been there holding your hand had I known. Now please let us know when surgery is scheduled so we can all do our part in lifting you in spirit. You have always been here for us, we want to be here for you too Vicki. Luv you girl, Lorrie",
      "MessageIndex": 10,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233694",
      "Title": "Some 'HAPPY' news -- Just want to share with all of you -- thru the good times, and bad"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I've been thinking about you a lot and wondering how you and your family are doing. Thank you for the update, I'm glad to hear you are through with rads..Yay. Your body has been through a lot so exhaustion is to be expected. We miss you here buddy... but I'm glad to hear you are doing as well as can be expected. Hugs, Lorrie",
      "MessageIndex": 5,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224950",
      "Title": "How is TexasGirl? Anyone knows?"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Heehee.. double post. I got so excited.",
      "MessageIndex": 7,
      "PostDate": "23/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224950",
      "Title": "How is TexasGirl? Anyone knows?"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I wouldn't miss it you girls are fun to party with. Sending lots of pink love and prayers with you tomorrow Sue... Hugs, Lorrie",
      "MessageIndex": 11,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229504",
      "Title": "The Pink Bus Is Rolling For Sue Relays - Let's Show Our Support"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Had my \"pink\" candle burning in the evenings for the past three days. Oh boy... I'm gonna have to buy a new one by the weekend I see.. My torch is lit... Lorrie",
      "MessageIndex": 15,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225318",
      "Title": "1 Week -- Prayer and Candle VIGIL -- starting 8/28/11 -- 8:00 EST // STRENGTH, COURAGE AND HOPE"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Wow.. how insensitive. I'm not sure what to read into this as I am sure you either. Maybe it was just an accumulative effect from having a bad day, and his comment was meant more as a question to gauge how you are doing at home? I don't really know what to think of it but if it's bothering you too much maybe a phone call is in order to answer some of your questions and concerns. Try and stay positive maybe it's that whole man versus women thing, words don't always come across the way they should or the way we feel they should. But dog gone it, him being a doctor you'd think he should excel in the communication field. Hugs, Lorrie",
      "MessageIndex": 2,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225195",
      "Title": "Saw doc today and felt even worse......"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "When my gyno told me I had BC he at that time mentioned my Pap was clear but I also have fibroid s. He said we will concentrate on the cancer first, then deal with the fibroid s. When I go back to him, I know he wants to do an ultrasound on me too. That reminds me I really need to schedule that while the deductible is paid up. Thanks for the heads up on problem symptoms. My chemo also pushed me into menopause. I wish you well with the gyno and it's nothing too serious. As far as your daughter goes.. No help from me.. I'm kidless. Hugs, Lorrie",
      "MessageIndex": 3,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220199",
      "Title": "finding things a little difficult - acupuncture update"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Ouch... think I pulled a hip muscle trying to keep up with you. Congrats on the good news, always happy to hear that from a pink sister. Hugs, Lorrie",
      "MessageIndex": 19,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223231",
      "Title": "Make room for one more on the dance floor."
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I am not sure what I had this past weekend but it wasn't fun. Friday I had the chills, a 101 degree temperature and muscle aches. It's been two months since my last radiation and even my tissue expanders hurt. Darn pectoral muscle.. 24 hours later all is back to normal. Crazy I tell you crazy... Is this going to be a new norm with body aches? Lorrie",
      "MessageIndex": 0,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/225766",
      "Title": "Flu bug?"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Thanks for the chuckle... very cute.",
      "MessageIndex": 2,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217357",
      "Title": "Attitude (e-mail from my mom)"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "My dear my heart goes out to you and all the other newbies going through this \"just finding out\" stage. We all know what you are going through, all the tests, questions, worries and concerns. I can only tell you that you have found a great source for support right here on this board. A year ago I was in your shoes, now I am happy to say I am in remission. The tunnel looks dark and dismal right now, but if you look real hard you can see us holding flashlights on the other end guiding you through it. Reach out to us when you need it and ask a million questions. We don't mind... Wishing you nothing but great results along the way... Lorrie",
      "MessageIndex": 8,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233798",
      "Title": "new diagnosis...."
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Oh my gosh Emma, I am so glad to read this. Awesome news sweetie... You and that loving husband better celebrate hard this weekend. So, so much to be thankful for. Hugs, Lorrie",
      "MessageIndex": 12,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/233133",
      "Title": "Biopsy update"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Hey I was told just this weekend that my hugs are now firmer, of course I credit my fully inflated tissue expanders for this modern miracle. So get ready girls for some serious nice firm hugs... {{{Hugs}}} Lorrie",
      "MessageIndex": 14,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220413",
      "Title": "GROUP HUG time!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "My oncologist showed me a chart, each treatment procedure I endured decreased my odds for cancer re-occurrence by a lot. So since I've done chemo, had a mastectomy, currently doing radiation and soon will be on hormone therapy my odds for re-occurrence are in the low percentile. Radiation is very much a key to beating cancer permanently. Lorrie",
      "MessageIndex": 4,
      "PostDate": "26/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221364",
      "Title": "Does radiation make sense when you have already gotten chemo?"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "You are truly an amazing woman, go get em tiger... Hugs, Lorrie",
      "MessageIndex": 4,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221108",
      "Title": "Wish me luck! Here I go with the new chemo drug!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Wow.. haven't we all walked in your shoes. Believe me when I say it will be over before you know it. I like Jennifer above me just completed my radiation phase, prior to that I had a double mastectomy and chemo. I only had the tumor in my left breast and a lumpectomy wasn't an option for me. I also made the decision at the time too to remove my right healthy breast as well because I wanted to prevent if I could having to go down this road again. Are you still going to have to do chemo and radiation once you have a mastectomy? You are so brave, it's not an easy decision to make and it was once I grappled with for quite some time because I had chemotherapy first. I will be thinking and praying for you this Thursday. Hugs, Lorrie",
      "MessageIndex": 10,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222640",
      "Title": "Two cancers in one breast.....overwhelmed and scared."
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Hey Rad buddy... now you know why your RO took his time. Glad to hear the breathing issue is nothing serious. You were always an overachiever in rad school. Continued good health my friend, Lorrie",
      "MessageIndex": 11,
      "PostDate": "16/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228328",
      "Title": "Forks down"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Happy birthday... ( can you see me waving??) Hugs, Lorrie",
      "MessageIndex": 3,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/227544",
      "Title": "Today is rrogers34's Birthday!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I received the following message in a \"Thank You\" card from Katrina Larson's Mom: Dear Lorrie: I'm wanting to let you know how much you and all the other members of the BCSN meant to her. She was so grateful there was a place she could go where she could level about how she felt and also support others in their struggle to find a way beyond this awful disease. We miss her so much and I am so grateful that she was loved so well by all of you. I know it made the difference to her recovery from each of her surgeries that she had so many praying & hoping for her improved health. Katrina had fabulous friends and I know all you ladies looked to her as a daughter and she was lucky to have so many doting Moms. I could love on her and empathize with her losses and her pain, but you guys really knew how she felt, so she didn't feel alone. I'm so grateful she found you when she needed you, and I hope all of you will hold her memory dear. She loved you guys and you enriched her life. She wore the bracelet you sent her and was thrilled to get it. I got an ornament to send for her exchange and then with everything going on didn't get to send it. I'm sorry about that... Thank you for everything Joan & Gary Larson",
      "MessageIndex": 0,
      "PostDate": "02/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/253739",
      "Title": "A Message from Katrina Larson's Mom..."
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "I too was overweight and big busted. I had IDC my left breast only but opted to remove them both for the exact same reasons Heather mentioned above. My plastic surgeon didn't hesitate with immediate reconstruction. If your Plastic surgeon is telling you to lose the weight before surgery seek a second opinion. Keep in mind implants only cover a certain circumference of the chest wall. My implants are currently in place but I need a little bitl of fat grafting around near the armpit area and they should be fine. I went from a DD before cancer to a C cup implant size. I love my small girls... Best of luck as you continue your journey to getting well, Lorrie",
      "MessageIndex": 6,
      "PostDate": "21/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237239",
      "Title": "Single or Double Mastectomy"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Hey.. wait for me. I know.. I know... late again. Yawn... I think I'm awake now though. Can I ask a special favor to swing over to my RO about 11:45. He wants to check to see how I'm healing up from radiation. I promise not to keep you girls long. Good luck to all my pink sisters getting tests and scans today. Boy this bus is crowded... LOVE IT !!! Hugs, Lorrie",
      "MessageIndex": 19,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/223475",
      "Title": "Gas up the bus, girls!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Awww.. thank you for sharing your gift of prayer with us. I for one know my journey wouldn't have been as successful if not for the help of all the prayer chains and individual prayers I have received. That big guy upstairs has been with me every step of the way. That was truly beautiful and I thank you... Hugs, Lorrie",
      "MessageIndex": 2,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218481",
      "Title": "a prayer for all"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Strapping on my pink gloves, got the candle lit and I am sending nothing but positive pink energy, love and prayer to our fellow sister. My heart is so heavy at this moment, fight hard dear Libby... Lorrie",
      "MessageIndex": 9,
      "PostDate": "24/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/226955",
      "Title": "Prayers for our Pinkflutterby"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "We need \"like\" buttons. Sounds beautiful...",
      "MessageIndex": 1,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232135",
      "Title": "Christmas Ornament"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Well aren't you the night owl? LOL... sorry buddy no help from me, my sleep is sporadic. I doze off around 10 o'clock and wake up every couple of hours. I do seem to fall back to sleep though. Broken sleep is better then no sleep I guess. Jennifer has a good idea benadryl always makes me sleepy and so does tylenol pm. Hugs my friend, Lorrie",
      "MessageIndex": 3,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/229193",
      "Title": "Up all Night"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Happy, happy birthday Dot. Save some cake for me.... Have a good day!! Lorrie",
      "MessageIndex": 3,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218669",
      "Title": "Today is Dot53's Birthday!"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "Sending my prayers along as well. You mother is so lucky to have such a loving and caring daughter. Keep us posted on how she did, we will be here for you sweetie whether it be through prayers or answering questions. Stay in touch... Hugs, Lorrie",
      "MessageIndex": 6,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/227376",
      "Title": "plz pray for my mother ,she is suffering from breast cancer and bone infection"
    },
    {
      "AuthorID": "butterflylvr",
      "AuthorURL": "https://csn.cancer.org/butterflylvr",
      "Content": "You will never know sweetie, how much you, in your young life has taught us the older and wiser generation. I say this tongue and cheek because we are older, but it is you who are wiser. Your zest and spirit I will take with me, you are a true role model on how to live in the moment and we all can learn from that. You truly have touched our hearts ♥ Lot's of love, Lorrie",
      "MessageIndex": 13,
      "PostDate": "11/06/2012",
      "ThreadURL": "https://csn.cancer.org/node/241524",
      "Title": "Lots of thoughts lately"
    }
  ]
}