{
  "AuthorID": "cabbott",
  "AuthorURL": "https://csn.cancer.org/cabbott",
  "Posts": [
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I live in nearby Delaware. The folks at Johns Hopkins lined me up with a Wellness Community support group that just happened to be three miles from my house. They were free and designed to support cancer survivors and their families (hubbies and kids)with the emotional stress cancer diagnosis brings. I was very impressed. You have a Wellness Community in DC. Here is the website link: http://www.thewellnesscommunity.org/dc/ . I also found support groups at my local hospital (very medically oriented) and the local breast cancer coalition (very much into prevention and treatment for low income women). I had to go a few times to each to decide what I liked. Right now, the internet support here fits the bill, but soon after surgery I needed the face-to-face group. The Relay for Life is a once a year fling, but a great place to find support from folks who have been there too!",
      "MessageIndex": 8,
      "PostDate": "01/02/2008",
      "ThreadURL": "https://csn.cancer.org/node/156784",
      "Title": "Your experience - Support groups?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "When a path report on cancer comes back estrogen positive, it means that estrogen \"fuels\" the cancer growth. For those folks, something like tamoxifen or like Arimidex (the ad with the pink boxing gloves) will work to stop or slow the cancer growth by interferring with or limiting the body's estrogen. If you are estrogen negative, that means your cancer is fueled in a different way and those meds won't help at all. If you are HER positive, there is a drug on the market that will stop or slow your cancer growth. You can take it all you want if you are HER2 negative and it won't help a bit. This means your medical options are limited if you are triple negative. Triple negative cancer can be the aggressive sort. That means it can grow and spread elsewhere causing trouble for you and your body. This is a double whammy for your doctors to help you with: possibly more aggressive concerns and few medical options. Yours has already shown the ability to set up camp outside the breast. Even though it is just one lymph node, take notice. I don't mean panic. Lots of folks with triple negative cancers are doing well with the medical treatment that we have now (though I would love them to find a sure cure for all of us diagnosed with cancer no matter what the type!). I just mean take notice that this stuff isn't totally small potatoes here. It is a serious concern. There is good news. The good news is that your kind of cancer, triple negative,usually responds well to chemo. Some research I have read suggests that your cancer will respond more fully to the beneficial effects of chemo than someone with ER+ cancer. More good news is that you have caught your cancer early. It was only one lymph node and you are only at stage 2. It is still a nasty beast, even if it is little now. The doctors are giving you great advice. Chemo is strong medicine, but given the state of the research out there right now, it is the best kind of medicine available for your kind of cancer.",
      "MessageIndex": 6,
      "PostDate": "13/09/2008",
      "ThreadURL": "https://csn.cancer.org/node/162227",
      "Title": "Surgical Pathology Report"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I remember being scared for days after finding out I had breast cancer. At the time all I knew was that people died of it and I didn't know if I had a week, a month, or a year left. Boy, did I have a lot to learn! That was almost 5 years ago and I'm still doing great. I now know that for most of us, cancer is a chronic disease that you live with. It is almost always treatable and sometimes even curable. This is a great place to ask questions as you get your treatment plan together. I was MUCH calmer once I had a plan in place and a doctor's appointment to start fighting this stuff. I learned a lot from books like Susan Love's \"The Breast Book\" and \"The Breast Cancer Book for Dummies.\" Folks with breast cancer took the time to come by and share their stories. Meeting long-term survivors (like 22+ years and still doing well) convinced me that I had a good chance of making it more than a week, a month, or even a year. For me it took surgery and tamoxifen followed by exemestane. Some of my friends have had chemo and radiation. It depends on your particular cancer. Keep a 3 ring binder of all your reports as you have tests. I took a tape recorder as well as my hubbie to our first meetings with the surgeon and the oncologist. It really helped.",
      "MessageIndex": 5,
      "PostDate": "25/07/2007",
      "ThreadURL": "https://csn.cancer.org/node/155155",
      "Title": "A newbie"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I hate to be the one to mention that depression can also cause fatigue and is VERY common with all cancer survivors, but I don't see it in your other messages. Looking back on my last few years with cancer, I can see that that were times I could have been considered clinically depressed had I been screened. I fought even being screened since that seemed like another thing going wrong in my life and I had had enough of being sick just with the cancer treatment. Of course, if the treatment is affecting brain chemistry and a pill for depression corrects the brain chemistry, I could have prevented a lot of problems by asking for help. Eventually exercise and time did the trick for me, but if that isn't working you might consider talking to the oncologist about screening you for depression as well as the other problems folks mentioned. Best of luck! I'll be praying for you. Carol",
      "MessageIndex": 7,
      "PostDate": "18/11/2006",
      "ThreadURL": "https://csn.cancer.org/node/152634",
      "Title": "Re; still stay tired is that normal"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Surgeons do surgery. Oncologists do treatment plans. Both are very knowledgeable about cancer, but they try not to step on each other's territory. I brought both another person(my husband) and a tape recorder to my first oncology session. The stats on various treatment plans were a little mind boggling to me and I minored in stats in college years ago.I had read up before I went what treatment plan was likely for my kind of cancer. But the data pouring out of the doctor's mouth was still impressive. The choice of treatment plan is up to the patient, but you have to take in a lot of information to make a good choice for yourself. Yes, you can just do what the doctors tells you to do, but it helps if you understand why they are recommending a treatment plan, especially if it is going to involve heavy duty stuff like chemo. If you understand what you are getting out of the treatment, you will be in a better position to deal with everything. If they recommend a treatment plan for you, they will also inform you of every single side effect that can go wrong with the plan. That is so you can make an informed choice. Just because some people have a particular side effect doesn't mean that it will happen to you. The doctor let me know that many of the worst outcomes happened to older patients(at the time he considered me young even though I thought I was over the hill in my mid-forties. No treatment at all also has statistical outcomes. In the end, you have to decide how bad your particular cancer is, what plan will probably work the best for you, and how to deal with whatever baggage that comes with that plan. The oncology nurses are wonderful resources in that last department. Don't be shy about contacting them any time you need them! My oncologist always did a breast check, as did the surgeon, on every visit. Occasionally I had a blood test or a flu shot done when I went to the oncologist, but I did not have chemo and didn't need much in the way of tests. Of course, the oncologist wanted to review all scans and prescribe needed meds to prevent the BC from coming back for me even though I did not have chemo or radiation. I really liked my oncologist and found the visits positive. Back in 2002 when I first was diagnosed, he let me know that they were beginning to keep 20 year statistics on breast cancer survivors. At the time I wasn't sure if I had a month or a year to live! So hang in there. Here is another tip. It didn't hurt that I always went out to eat somewhere nice after every visit to the oncologist or recheck with the surgeon. After awhile a visit to the oncologist for a recheck even meant to my husband that we were going out to eat. So don't forget to do something nice for yourself every time you have to face a difficult medical situation. Children get rewarded by the doctor and the dentist when they make it through their visit. We adults have to reward ourselves and we deserve that reward just as much!",
      "MessageIndex": 9,
      "PostDate": "17/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/194881",
      "Title": "First Oncology appointment/ What to expect?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "There is a lot of support here for all cancer survivors, but the discussion board for breast cancer is one of the most active sections of all of them. If your friend want to \"talk\" to someone in real time, the chat room is great. If she prefers to post questions and check back for answers, tell her to try the discussion board here. There is more information on cancer in other parts of the website. There is also a place for registered folks to tell their own stories. It is hard enough to deal with cancer. Dealing with being alone and unsupported just makes it harder. Tell her about this place and suggest she give it a try. There are other places for support too. If she needs support with arms, call the local hospital for suggestions. There is a branch of The Wellness Community in my town. That group specializes in emotional support for individuals and families dealing with cancer. Hospice helps folks with terminal cancer, but the doctor has to refer them for that help. Those are just a few places I know of that can help, but I'm sure there are others. A call to the local cancer organizations might turn up several more resources for your friend. Good luck! C. Abbott",
      "MessageIndex": 3,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/164056",
      "Title": "New here, have question."
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Well, Bill, there is Jodee, a mail order place for mastectomy bras and seeing as you have had one, the number is 1-800-821-2767. Can't say that I've seen any male models in the book, but you could volunteer to be the first! ; ) C. Abbott",
      "MessageIndex": 9,
      "PostDate": "26/07/2008",
      "ThreadURL": "https://csn.cancer.org/node/158563",
      "Title": "support in the flesh"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Right now this site is doing what I need in terms of support. However, there have been times that I found a group with arms for even more support. When I had had cancer for about two years and my family had kind of moved on emotionally but I still needed to talk about issues the group helped out a lot. Also I learned a lot of survivor issues and what to do about them in that group. I have kind of an informal group of friends that are survivors at church, but there is also a formal support group in town with the Wellness Community. I can't say enough great things about them. They are free, they chair the group with a trained social worker, and they deal with the emotional issues of cancer diagnosis. The local hospital has a group too centered on medical issues. That is where I would go during chemo for support. But right now, I'm just here.",
      "MessageIndex": 2,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://csn.cancer.org/node/158563",
      "Title": "support in the flesh"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Never forget: knowledge is power. Knowledge about your particular cancer is power against cancer. If you know you are BRCA1, you can read up on recommendations that have shown to increase survival and reduce reoccurance in fellow survivors with the same kind of genetic makeup. Only about 10% of breast cancer survivors can do that. The rest of us (me included) don't know what resulted in us having cancer or what in particular we can do to change our prognosis. Cancer is always genetic. Some of it is caused by a gene doctors recognize like yours. Some is cause by an individual mistake. Many more may be caused by a gene combination that doctors don't recognize yet. And some are the result of other things that changed the genes for the worse. You know what you have. That is power.",
      "MessageIndex": 4,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://csn.cancer.org/node/157684",
      "Title": "BRCA gene"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Dear KathiM, I am so sorry to read of your loss. I cannot imagine how difficult it must be to lose a child unexpectedly. You are in my thoughts and prayers and I pray that someone close to you will be there to give you support and hugs when you need them.",
      "MessageIndex": 13,
      "PostDate": "12/01/2007",
      "ThreadURL": "https://csn.cancer.org/node/153173",
      "Title": "I'm back, with sad news"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I hope it turns out to be nothing, but either way know that I'm praying for you. Keep us posted. C. Abbott",
      "MessageIndex": 5,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163450",
      "Title": "Results of CTScan"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Calcium is a mineral. It is not tissue. Microcalcifications means tiny calcium deposits. The calcium forms around fast growing tissue. The calcifications are NOT cancer. But there may be cancer in the area. Doctors don't get worried about solitary calcifications. They are fairly normal occurances. That means that sometimes they miss a cancer when it may be there. When the calcifications kind of cluster together, they do worry and usually do find the cancer. The cancer cells often fill a duct (tube) in the breast, so a cluster means the cells are filling in that spot in the tube. I had a fairly normal looking solitary calcification that I talked to the radiologist about. She said it looked normal, not like the cluster that means danger. Six months later she called for a biopsy of the same spot. Radiologists since that looked at that film told me they would have never recommended biopsy at that time for what they saw. Mine too ended up being a very very small spot of ductal carcinoma (cancer) that was missed on the biopsy but some atypical hyperplasia (weird looking overgowth of cells) showed up which led to a lumpectomy to prove it wasn't cancer. But it was! So sometimes the solitary calcifications may be near a spot of cancer after all. The surgeon told me that it was so small that it probably wasn't causing all the problems that we normally associate with cancer. Because the radiologist was on her toes and looking (after I talked with her), I was operated on earlier than most women with similar films. Was that better? I bet most of us would answer emphatically \"YES\". But the research is beginning to show that our bodies often rid themselves of very small spots of cancer if their findings on tests are correct. Places where mammograms have just been introduced so that they can find cancer early are compared with the statistics from the same area of how many people were found with cancer using other means (like finding a lump) before the advent of sensitive tests. The conclusion the researchers made was that maybe our body sometimes gets rid of very small cancers before they cause problems. I must admit I wouldn't want to wait to see if it would resolve on its own if I knew it was there. That would be foolhardy knowing how deadly this stuff can be. But if you and your doctor have done your best to find cancer and they don't stop watching you when a microcalcification is pretty benign looking, you are being careful enough. Rest easy that if they are checking you every 6 months you are being as careful as the best research says you should be. C. Abbott",
      "MessageIndex": 10,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164468",
      "Title": "Microcalcifications?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Dear Tasha, Your story brought back memories of when I was a teenager (longer ago than I want to think about)and I took my first summer job in a cotton mill down south as a spooler spare. About half way through the summer, one of the guys at the plant caught a seven or eight foot black snake and carried it into the room on a stick where several of us were working. Most of the girls were screaming and I was quite aware that he was carrying one mighty big, wiggly black snake (only about ten feet from me too!) My mentor for the summer walked up to the boy and told him to take the snake out in a loud enough voice for all the girls to hear. Then in a whisper I caught too she added, \"Take it out back son, but leave the door propped open. It'll kill the rats.\" She had been warning me not to put my hands in any bins without looking or making some noise first. I followed her advice quite closely from then on and made it through the rest of the summer without incident, but I pass on her advice to you just in case. . . C. Abbott",
      "MessageIndex": 6,
      "PostDate": "16/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I'm no expert either, but don't forget the birth control if there's any question! Arimidex pamphlets state that it is not safe to take during pregnancy.",
      "MessageIndex": 2,
      "PostDate": "29/06/2007",
      "ThreadURL": "https://csn.cancer.org/node/154861",
      "Title": "chemopause?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Microcalcifications are just what they sound like: they are little tiny spots of calcium that can form in tissue. Calcium spots are much denser than soft tissues so they show up on tests like mammograms. Calcium spots can be either microcalcifications or macrocalcifications. One of my relatives had the macrocalcifications. Her regular radiologists didn't report the difference (maybe didn't know) and asked for a biopsy. When she went to a large teaching university clinic that specialized in breast cancer, she found out. Macrocalcifications form when you have arthritis of the breast. They do not indicate a possible problem with cancer and don't need to be biopsied. She still gets her mammogram, but she skipped getting a biopsy. Microcalcifications don't always indicate a problem. If they appear all by themselves as a little spot, they are usually just harmless spots of calcium--no big deal. But microcalcifications are known to sometimes form around fast growing tissue--like cancer. If the calcifications form in a pattern that radiologists see often around cancer spots, the radiologists request a biopsy to make sure nothing is going on there. When they see little spots of calcifications, they may ask for a mammogram in another 6 months to see if things are changing. If there is only a spot or two here or there, they probably would do absolutely nothing because these spots are very common in perfectly normal breasts. If you are concerned, you can go back and talk with the radiologists. You can also send your mammograms to a breast center to be read by a breast specialist. It is not good to miss cancer, but it is also not good to have biopsies and operations when you don't need them. The radiologists know your history and I know they would rather err on the side of being over-cautious and look for cancer when there was a chance things were normal than being careless and let things go too long without checking. But again, if it is keeping you up nights, it would certainly be understandable to send the films for another reading with a breast specialist. That is what my relative did and she was able to avoid an unnecessary biopsy. Good luck! C. Abbott",
      "MessageIndex": 3,
      "PostDate": "08/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164468",
      "Title": "Microcalcifications?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "http://www.hopkinsbreastcenter.org/ For an Appointment Call: 443-287-BRST (443-287-2778) Dear Melanie, My heart goes out to you. I am a breast cancer survivor since 2002. I well remember the panic I had when I first found out I had cancer and knew I needed to get to the best doctors I could find. But I had no idea where to turn to get an appointment. Then I found a website written by a nurse(Lillie Shockney)and a number to call at Johns Hopkins. The Breast Center is right at the Outpatient Center and they really know their stuff. I met Lillie and she's even nicer and more knowledgeable in person than she is on the net. You couldn't be in better hands. The oncologists in the Weinberg Center are great too. The folks at the Breast Center can give you their number if you don't already have it.It doesn't matter how much I read, the doctors at Hopkins are always up to date on the latest research and that's what you need when you are battling cancer.I have LCIS as well as ductal carcinoma and a few other messed up cells. I have read that lobular cancer often doesn't show on a mammogram and may feel more like a rope than a lump when it is detectable by feel. It is closer to the chest wall so it is harder to detect manually and on film. I think MRI's are sometimes used to determine what is going on. I would ask the doctors when you consult them if you would be a candidate for Fosamax or some other bone-builder to strengthen your bones. That might help keep the cancer at bay too by giving the cancer less room to get a foot in and less space to grow. Many many many of us cancer survivors get depressed. Why wouldn't we be depressed when you think of it! Talking to other survivors, getting daily exercise, eating a healthy diet, making a plan to deal with the cancer and taking things one day at a time help wonders. But antidepressants can help too if the above isn't doing enough. Again, talk the doctors and nurses till your questions are answered. Good luck!",
      "MessageIndex": 3,
      "PostDate": "15/01/2007",
      "ThreadURL": "https://csn.cancer.org/node/153235",
      "Title": "Stage IV breast cancer - in bones"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Dear faithhopelove1, You have a right to all your path reports. If they found a patch of DCIS that was large enough, they should have checked it for ER and PR status. If there was some reason they didn't check it, they should have indicated why. However, some small hospitals don't test until the final surgery. My first stop for surgery was like that. I was not terribly impressed and ended up going to a large teaching university hospital that had a speciality in breast cancer after seeing what my hometown didn't offer. If you don't know your status, it makes choosing the right treatment a shot in the dark. I have no idea if they can go back and test it now. If you have no idea, tamoxifen is a pretty safe preventative, but you have to weight the side effects with the outcome. Several of the newbies here have mentioned the test to see if you are tamoxifen resistant or not. I think you would have to contact a teaching university hospital for a consult on that test. Hormones can fuel the growth of many types of breast cancer, so good luck with the sex drive shots. Watch out for herbal remedies too. If it works like a hormone, it probably fuels cancer growth too. C. Abbott",
      "MessageIndex": 7,
      "PostDate": "05/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171168",
      "Title": "meeting with onocologist"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Great news! Best wishes for a Happy Mother's Day!!!! Carol",
      "MessageIndex": 4,
      "PostDate": "13/05/2007",
      "ThreadURL": "https://csn.cancer.org/node/154436",
      "Title": "A better day for Mother's Day"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "There is an overwhelming amount of information to learn to make very significant decisions when you are diagnosed with cancer and you get almost no time to look up all those things before you commit. That makes decision making VERY stressful. Rather than take a shot in the dark and guess what is right for your cancer, I would hightail to the best breast center in the best University teaching hospital and ask them about the standard of care for your particular cancer. It is great that you caught it early at stage 1. That's the good news. But I suspect that the grade 2 and the 5% positive receptors mean that it is borderline aggressive. That means that it may reoccur if you don't wipe it out. It may not be the sort responsive to tamoxifen that works with ER+ cancers. However, it might be very responsive to chemo of the right sort. Yep, the nasty stuff, but remember that chemo is strong medicine designed to kill nasty cancer.You will have to decide what is the best route to go. I'm sure you will make the best decision for you. Chemo definately has side effects and is tough at times, but it also can work wonders for many folks. Most doctors now believe that whenever possible a lumpectomy plus radiation is equal or superior to a mastectomy as long as you get clean margins. If the cancer is in more than one place and two lumpectomies are not cosmetically acceptable, mastectomy with (or without) reconstruction, with or without radiation is standard of care. Aggressive tumors and those found near the armpit often get radiated even if you have a mastectomy. At least they recommend it, but the decision as always is yours. That is because they cannot make any guarentees. Most breast surgeons do followup the following way: see you until all stitches are heal and then see you every 3 months for 2 years, every six months for 2 years, and then once a year till they decide to dismiss you. Some stop the regular visits at 3 years because of time constraints. I could bounce the visits between my oncologist and surgeon so that I was seen according the above schedule but saw the two alternately so that the oncologist could keep up with my meds. If you have chemo, you probably see your oncologist frequently that year to handle how you are doing and decrease the side effects as much as possible.",
      "MessageIndex": 4,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://csn.cancer.org/node/158542",
      "Title": "Why does my cancer team have varying opinions?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Welcome to a board you hoped you never had to read! The folks here are very supportive and they will be glad to answer all your questions with a wealth of information that comes from experience. I have read tons of great things about Anderson and I'm sure you will get state of the art care. +Estrogen receptor cancer is the kind I have too. It is more common than some of the other varieties and often responds well to stuff like Tamoxifen or the Aromatase inhibitors. Cancer stresses everybody. So if you feel like you're living in a hurricane right now with all the phone calls, decisions to be made, and stuff coming at you, you are perfectly normal! Hang on and ask all the questions you want. Good luck on your journey! C. Abbott",
      "MessageIndex": 3,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164740",
      "Title": "Just diagnosed, with tons of questions"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "It sounds like you are in good hands from your description. I started with a general surgeon in a small town and transferred to a teaching facility when I realized the difference. Going to a breast surgeon who does a lot of these operations makes a big difference in recovery time but it is still stressful! I hope your wait goes quickly and the findings are positive. ((((HUGS)))) C. Abbott",
      "MessageIndex": 5,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://csn.cancer.org/node/158542",
      "Title": "Why does my cancer team have varying opinions?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I am small breasted with one dense breast(right mastectomy 6 years ago). To get a good picture, I swear those plates almost touch! I can't say that it bothers me much, especially since I usually figure it is my life at stake. I knew that after the surgery they needed a really good picture because they had to get a new baseline. Knowing that the test was important helps me. They will compare future shots with the new baseline. Usually the mamograms are once a year after the baseline shot. It will be sooner if they are looking at a concern (problem cysts or a spot of calcifications). Another reason they do so many exams the first two years is that if cancer is going to show its ugly face again, it is most likely to do so in those first two years. Catching a reoccurance early is best, so they check you a lot. But part of the fact that I don't mind so much is that my nerves aren't really all that sensitive. It sounds like your problem is the pain issue. You don't want it to hurt and it hurt you a lot last time. You may be a lot more sensitive than me. (You didn't say if you were a redhead, but I read somewhere that red haired folks have more pain sensor nerves than other folks. I don't have red hair.) Anyhow,you might call the radiologist in advance and ask him or her as the EXPERT (flattery helps when you are asking for a favor...)what drug or method might make your next mammogram closer to painfree. There's a lot of meds around that can either knock the pain or knock you out. What does the doctor recommend? Mind you, you would need a designated driver to get you home afterward! Maybe acuputure works, or something else. But if you can make it through the test painfree, both you and your oncologist will be happy. It is not being a baby to ask for help that you need so that you can follow the doctor's recommendations. Stand your ground and get the help you need given the sensitivity of the nerves you have. Good luck! C. Abbott",
      "MessageIndex": 3,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163423",
      "Title": "Do I HAVE to have a Mammogram?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "When I was a kid my mom made me go to the dentist. I didn't mind going to the doctor, but I HATED going to the dentist. I had to. I went. If you knew my mom, you'd know I didn't have a choice. Then I grew up. Nobody makes me go to the dentist now. I know my teeth need to be seen at least every six months to a year to prevent major problems. My mom told me that when I was a kid, my teachers told me that, the health magazines agreed, and the dentist told me that too. I still HATE to go to the dentist. To make matter worse, now I have to pay for it when I go. And I go every 6 months to a year because I know I should. I still HATE it. And I go anyhow. I go because I like having teeth. I go because I want to be healthy even more than I HATE going to the dentist. I don't know what the medical system is like where you are, but around here nobody would make you go get a mammogram any more than they would make you go to the dentist. You could refuse treatment. The doctor might drop you as a non-compliant patient because he wouldn't want to be responsible for you getting an advanced cancer because you wouldn't do the test he recommends to catch things early, but he wouldn't make you go. If I had a doctor that wouldn't listen to my concerns about pain here, I would look for a different doctor. As soon as I found a better one, I would drop the old one. Here that is possible. If I have a car and the right insurance, I could go to any number of doctors for treatment. I don't know what your choices are where you are. But I do know that you really need at least a yearly mammogram between now and age 70 or so. If anything iffy is showing up on the slides, you may need them every six months until they are certain that nothing worrisome is developing. Not all cancers can be felt, not all show up on mammograms, not all show up on ultrasounds. Of the three, mammograms seem to find them the earliest and most often. Finding cancer sooner rather than later gives more options for treatment and surgery. It may result in a cure. You probably have been told that by medical experts. You can read it in health magazines. You can listen to the other survivors or check out this website for facts on mammograms and other tests to monitor health and cancer concerns. But you have to decide for yourself what is best for you. Even though I have dense breasts, they were still able to find two cancers growing in my right breast while I was still at stage 1. Dense doesn't mean that nothing shows up. With age your breasts naturally becomes less dense. Some of the cancer treatments also result in making your breasts less dense. So consider your choices and do what you think is best for you. I still hope that you can find a way to have a less painful mammogram. Good luck! C. Abbott",
      "MessageIndex": 4,
      "PostDate": "12/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163423",
      "Title": "Do I HAVE to have a Mammogram?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Many many women have cysts in their breasts. You will know if you feel one. It feels like a roundish marble with smooth sides. If cysts suddenly appear, they may consider an ultrasound to make sure it is just a fluid filled cyst, but that's what the smooth feeling lumps usually are. Ones that appear suddenly are worth watching even if they are not cancer. A radiologist told me that when they suddenly appear, sometimes they are filled because a tiny spot of cancer has blocked the duct. The cyst is not cancer, but the blockage can be. Watchful waiting (like another scan in 6 months) is usually done just to make sure that everything is normal. Because cancer does not double overnight, this is considered a safe wait. If it is too small to show up on a normal mammogram, even if it doubled every 28 days (a very aggresive sort of breast cancer) it would barely be visable in 6 months. That may not make you sleep easier, but that is what I've learned over the years. Cancer feels more like a small piece of gravel with rough uneven sides.",
      "MessageIndex": 2,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220206",
      "Title": "Cysts???"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I had a single mastectomy and so had day surgery. Your surgery involves the tram flap and you will probably be in the hospital for 3 to 5 days and then home to recover for a few weeks. Go get some hard candies for the sore throat. The general anesthia often causes a sore throat for a few days and I did not expect this. Ice chips help too. Buy the Phillips Milk of Magnesia, a box of prunes, some prune juice, and maybe whatever other laxitive you like to have in the house now. The pain meds stop more than the pain. You will need all of the above for about a week or two after you come home. Once you get off the major meds you will be able to stop with the prunes and such! Call every friend and supportive organization you know and tell them what you need for the next month. Kids need rides everywhere. Meals need to be delivered. Forget the flowers(after the first bunch of course) and ask for gift cards to the local restaurants and fast food spots. Someone else will have to drive you around for at least two weeks after you come home. You don't get driving privileges until you are off pain meds and the drains are out. Laundry needs washing and drying.You can't lift though you can sort the clothes. Someone needs to run the vacuum and mop and it shouldn't be you for a month. Get someone to take you walking daily and be your cheerleader when you work on your stretching exercises after surgery. Kids can do a lot of this with some supervision. Tell the schools where your children attend so they can provide support to them as needed. My nurse also recommended that I buy some Palmer's Shea Butter with vitamin E found in the African hair treatment section of the local department store like Walmart or Target. It is useful for putting on the surgery site after the stitches are out. Do not put anything on the site until the doctors give the okay and they may prefer another lotion, ointment, or cream. But the Palmer's was cheap, nice smelling, and I still use it for moisturizing hands, chest, legs, and everything else. It has more shea butter than regular lotions and creams. It is also cheaper and works. A moisturizing soap in the shower helps too. Avoid hot showers and baths to prevent skin problems and lymphadema. No hot tubs. (I hate the list of restrictions but I read the list and try to follow them to the best of my unmotivated ability. Good luck!) Also ask the doctors or nurses for a set of exercises to promote flexibility after you leave the hospital. There are some listed on the internet if they have no clue, but it would be better for them to tell you what will work best for your situation so that you do not over do things. Remember, if it causes pain, it is not good to do. I tried pulling up a weed after a single mastectomy. I immediately knew to stop.OUCH!!! A month later, I could manage most weeds with few problems. Avoiding scratches while weeding though is a constant challenge. My operation was back in 2002 and I know I still have to be careful of injuries. Ugh. Buying an electric razor is not a bad idea either. Regular razors can nick the skin and cause infections that lead to lymphadema, so most doctors tell you to stop shaving with them. Permanently. This is for under your arms, not your legs. Also, use bug sprays to avoid insect bits, avoid chapped skin by using moisturizers, and avoid all arm injuries for the same reasons after surgery. I am very accident prone and found this to be difficult. Learning to wear gloves when I wash dishes is also a pain to me. But staying well is important to me so I try to follow precautions. Take it one day at a time and know that your body will recover from surgery.",
      "MessageIndex": 7,
      "PostDate": "03/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/232898",
      "Title": "Needs advise before surgery!"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I haven't had the pleasure of acupuncture, but I notice more and more studies are proving that it really does provide pain relief when an expert is doing it. Also, I noticed that the university hospital I had my surgery at offers it for cancer patients now while they are undergoing chemo. I don't live close enough to use it, but I would consider it if I did. You might also experiment with ice water instead of warm to see if that works better. My son does the ice water bit after he races. Hot water brings blood to the area and increases swelling right after an injury (like walking or running on sore feet). Cold water reduces the same. However, note that muscles are very tight when they are cold. Don't exercise or stretch cold muscles or they might tear. My son does the ice bath right after a practice and then takes it easy for awhile. A podiatrist specializes in feet and might be able to notice if you need insoles in your shoe to correct a problem or be able to see on an xray if the heel spurs are causing the problem. A sports medicine doctor helped me once with a pain across the middle top of my foot. I had laced my running shoes a bit tight and my foot had swollen some during a walk causing the laces to get even tighter. Though it was only for a short time, afterward my foot hurt every time I walked and it seemed to be getting worse every day. He told me that the liagaments across the top of my foot had been injured(they are very close to the skin and ran right across bone underneath) and that I needed lots of ibruprofen and really good fitting running shoes that I would have to wear every time I wore shoes for about a year. He wasn't kidding! I even had to wear them to church and to work. The better running shoes felt better right away than my usual leather shoes. After about 9 or ten months I noticed the pain was pretty much gone for good. Now I really watch how I lace my shoes not to mention how well the shoes fit in the first place. Apparently skiers also manage to injure their feet the same way fairly frequently. While I was on tamoxifen when I hurt my foot, it was not the Tamoxifen that caused it, just an injury. A final thing I worry about a lot when a pain won't go away is about whether it mean the C stuff has come back. Worrying about about it or denying that it could be that doesn't cause it or make it go away. If your pain doesn't respond to treatment you try on your own, it's time to get to the experts and let them do some tests to find out just what is causing the problem. Good luck!",
      "MessageIndex": 5,
      "PostDate": "07/10/2006",
      "ThreadURL": "https://csn.cancer.org/node/152191",
      "Title": "help, my feet our killing me"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "My nurse practioner at Johns Hopkins told me I just may be Vitamin D3 deficient when I had joint pain with one of the aromatase inhibitors. I told her \"No Way!\". After all, I was already taking calcium supplements with D3, three glasses of milk each day fortified with vitamin D, and a Daily multi with D. I also am an active person that got outside a fair amount. But the pain in my feet was bad enough that I went in for the blood test anyhow. Sure enough, I was low enough to qualify for prescription strength Vitamin D3. And in 2 days the pain disappeared. It turns out that many of us cancer survivors are D deficient and vitamin D controls inflamation. Even being moderately low may be a problem. They(my cancer docs) want me to be on the high end of normal just to prevent reoccurances. My primary care physician still thinks the multi alone is sufficient. According to the bottle it is. According to my feet and the cancer research, it isn't. If you haven't checked your level but want to stay on the arimidex, it is worth a look-see. Good luck!",
      "MessageIndex": 9,
      "PostDate": "14/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192140",
      "Title": "Arimidex."
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "The God I believe in never promised that bad things won't happen to me. He just promised that he would be with me when they did. And when the cancer struck and I couldn't handle it, I just gave it to God. My body won't make it; none of us make it out of this world alive. But that doesn't stop me from believing that God is in control of my future, He is good, and I can lean on him for comfort when I can't take it anymore. It took about a minute after the doctor said, \"you have cancer\" for me to get to that point (of not being able to handle it anymore!). I agree though, that articles that talk about \"beating cancer\" are just not medically valid. If someone had the sure cure, we all would stay well. Life just doesn't work that way.We don't get any choice in what kind of cancer we get or how aggressive it is. I asked the doctor if I was cured after he did his surgery and the nodes were clear. He looked away and then told me if I lived 20 years and died of something else, then I was cured. Otherwise, I still had it. I know he thought he was giving me good news when he said I had a good chance of making it 10 years...but I was only 45 and I had been planning on living to 108. He snorted and suggested that it may only be 106.",
      "MessageIndex": 3,
      "PostDate": "17/01/2008",
      "ThreadURL": "https://csn.cancer.org/node/156671",
      "Title": "false hope?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I don't know what part of NJ you are in, but I have heard good things about Fox Chase in Philly and Sloan-Ketterring in New York. Good luck!",
      "MessageIndex": 2,
      "PostDate": "14/03/2007",
      "ThreadURL": "https://csn.cancer.org/node/153838",
      "Title": "AN UPDATE!!!!"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "How often depends on how your first test turned out and what kind of treatment you are getting. If your bones are absolutely within the normal range and you have finished treatment, don't do the test more often than the general public. If you are taking a bone thinning medicine like aromasin, arimidex, or on-going chemo, you may want to recheck bones every two years to make sure they are not getting weak. I had one place that was in the oesteopenia range (not dangerous but borderline). The second bone scan two years later showed a definate downward trend I didn't like. I insisted that we begin Fosamax as well as calcium supplements, weight training, and vitamin D3 (1000 to 2000 units a day in the winter, discontinued unless joint pain in the summer). We continued the density tests in two years. The one last fall showed that the intervention above worked great! My bones are back in the normal range and I am about to quite taking the BC meds next week. Today I see my primary care doc and I'm sure he will take me off the Fosamax too. In two years we will monitor things again. I don't want to live through BC and then die of a broken hip!",
      "MessageIndex": 17,
      "PostDate": "17/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209356",
      "Title": "Muscle Girls... was a Bone Density Test recommended for You?"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Shucks, I had a right mastectomy without reconstruction (my choice, I just didn't want it) and they did it as day surgery. They even said that most folks that had the same surgery I was scheduled for would go out to eat the night of surgery. I figured they were telling me a tall tale. They weren't. I went in to surgery around 6 AM and was out at 4 PM. I really and truly wanted to go out, but we were two hours from home and I wanted to see my 10 year old before he went to bed. We settled for a fish sandwich at Burger King and a tall glass of ice water. I had a sore throat from the anethesia intubation and my arm was stiff and a bit sore like a sore muscle. I didn't want to be bumped, but I was walking and feeling fairly okay. With reconstruction, you will need to stay in the hospital. How long depends on the kind of reconstruction you picked. Some kinds take a night or two, others up to five or six days. Tissue transplants take longer than implants. The cool thing with those surgeries is that you will not need a prosthesis so for most people it is worth it. Call your insurance company NOW to make sure what they will cover. Mine covered a nurse to come once and check the incision. I had met with the occupational specialist and a surgical nurse BEFORE the operation so that I would have exercises for rehab and know how to handle all the drains and stuff when I got home. Frankly, it was a good thing that they put everything down on handouts to take home. I couldn't remember squat the day of my surgery! I was much too rattled! My friends had their surgery at the local hospital. They were all given a night in the hospital for mastectomies without reconstruction, but almost no directions on what to do when they came home. One lady I met from around here was not even told about prostheses and tried to invent one to sell or give to other ladies that were embarassed to go out in public. That she was so unprepared by her doctor still makes me furious. But there it is. You need a medical plan and a rehab plan now. Ask and see if you can get it. If they don't have one, see if you can find something out here or on the internet. It is much less scary to have an operation when you know what to expect and what to do to maximize your recovery.",
      "MessageIndex": 3,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://csn.cancer.org/node/158096",
      "Title": "decision"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "Tamoxifen is a piece of cake next to chemo. The gyn needs to keep an eye on your uterus, so tell him or her if you have any abnormal bleeding. I have heard that if you do experience hot flashes, that means you respond to tamoxifen more than if you don't. So I guess even hot flashes have a silver lining! Good luck!",
      "MessageIndex": 4,
      "PostDate": "16/07/2008",
      "ThreadURL": "https://csn.cancer.org/node/158475",
      "Title": "I need help again!!!!"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "It was a big surprise to me to find out that protheses come in different shapes. I am definately not terribly observant when it comes to female chests, but those folks that make prostheses were. Some of us need one shape, some do better with another. Because of the different surgeries we have (even when they are all called mastectomies), the shape of the back of the prostheses matters. In addition, the protheses also come in different weights. If you are very large, a solid form might make your shoulders ache. I like the silicone, but that is because I am fairly small. There are foam ones and even inflatable ones, so I'm told, for folks that really can't tolerate any weight.Going to a professional fitter the first time might help you make a better decision. There are usually a few around a large city. I live in a rural state that is very small but there are at least three places I can go with a large selection of prostheses to choose from within 45 miles of my house. Good luck on your search! I'm sure you will find the one that is right for you. C. Abbott",
      "MessageIndex": 2,
      "PostDate": "10/09/2008",
      "ThreadURL": "https://csn.cancer.org/node/162246",
      "Title": "mastectomy forms"
    },
    {
      "AuthorID": "cabbott",
      "AuthorURL": "https://csn.cancer.org/cabbott",
      "Content": "I haven't taken either, but I looked them up. I prefer eating my antioxidents (ie a colorful plate full of fresh veggies!), but I'd be interested in what research you can find on the Resvert. Super supplements sometimes don't behave like the super foods they come from. Look at soy supplements (and don't use them if you are estrogen positive bc please) and soy foods (not a problem for women to eat once or twice a week.). Extract from a Venus Fly-trap sounds even stranger. That's what I found on Carnivora on the net. I feel more comfortable with well-researched medicine or treatments, but who knows? My onc. suggests a cheap multivitamin, a varied diet full of veggies and whole grains, and plenty of daily exercise. But my lung specialists (I'm blessed with both bc and lc!) suggested selenium and vitamin C to decrease the lc. I found research on both of those either completed or in process. So good luck and let me know how they work or if you find any research on them beyond the fliers from their manufacturers.",
      "MessageIndex": 1,
      "PostDate": "16/03/2007",
      "ThreadURL": "https://csn.cancer.org/node/153859",
      "Title": "Resvert and Carnivora? Anybody take these?"
    }
  ]
}