{
  "AuthorID": "Cat64",
  "AuthorURL": "https://csn.cancer.org/Cat64",
  "Posts": [
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR iL2R2 HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Wishing you all the best on your special day! ♥ Cat",
      "MessageIndex": 0,
      "PostDate": "07/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/221992",
      "Title": "Today is IL2read2's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "go to the top of the page where it says \"Click here to Create or update your Member About Me\" page. There they will ask you ?'s about your diagnosis, treatments, etc... No you did not approach this site incorrectly, it's that there are so many spammers that come on here, if there's no information about someone, we tend to be leery of them & their posts. Hope this helps! ♥ Cat",
      "MessageIndex": 5,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/204579",
      "Title": "Disneyfan2008"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I'm so sorry you have to go through this-as if you haven't suffered enough! Everyone here has given you great tips, I hope one or some of them work and you're feeling better real soon! Keep us updated on how you're doin' and what worked! Prayers & Hugz, Cathy",
      "MessageIndex": 14,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175624",
      "Title": "Need help ..sensitive subject .. private area is raw and inflamed from constipation (5 days with movement) .. I need help"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR BRENDA HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! I'm sorry I missed your birthday-hoping you had a grand day filled with lots of love! ♥ Cat",
      "MessageIndex": 4,
      "PostDate": "05/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/227621",
      "Title": "Today is Sparkle1's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "This is my latest dilemma. My last treatment of Chemo was on October 26th. My Oncolgist said it was time to see the surgeon to determine is I was ready for surgery.(did this the 12th) My tumor started at 3cm. After the 1st round, no change, 2nd it got down to 2cm. My gut feeling said I would probably do at least 1 more round of Chemo so I was ready for it. I was surprised when the surgeon said I was ready for the Lumpectomy and no more Chemo. Yet, relieved on the other hand to not do anymore Chemo! I was hoping to get it down to at least 1cm where I started from. I went in the 16th to see the Onc. He said he would of done between 2-4 rounds of Chemo,but didn't argue against the surgery either. Then he told me instead of the original 48wks of Herceptin, I would only get 6wks/1xweek+6wks.radiation. I know I need to get this beast out of me because everyday that it is in there can leave it to spread. I also can't shake the possibility of having it shrink even more. In the beginning,the surgeon told me I was looking at a 6mo. window for surgery, which will be in January. I know I shouldn't put if off until then, but I also feel like I have time. I have been waiting for both of them to call since yesterday to dicuss my confusion & uneasy feeling about the difference of opinions. My questions are: How long did you wait after Chemo to do surgery? What are your thoughts or opinions on who I should listen to foremost? Shouldn't the Onc & the surgeon speak to each other & determine what the best plan of action is? This brings me back to my very first post which was \"Stuck in the Middle\"! Here I am again! :-) I really appreciate your input! Thanks! ♥ Cathy",
      "MessageIndex": 0,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180193",
      "Title": "Surgeon vs. Oncologist"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Thinking of you today & praying for a sucessful surgery & a speedy recovery! Let us know how you're doing when you feel up to it. Hugz, Cathy",
      "MessageIndex": 25,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186483",
      "Title": "surgery next wednesday"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I am in Florida, but further South. I had to look up where you will be. It appears as though you will be near Jax? I think they have a MD Anderson Cancer Hospital there, maybe you could call them for a referral. I hope that helps. I can relate to your thinking what's the rush now, but the rush is that you have \"INVASIVE\" BC. That IS aggressive, fast growing, and has a great chance of spreading further. I don't know much about triple-, but I'm sure those that do will be posting soon. I am happy you made the decision to get treated sooner!! Congrats on being a month away from retirement! I'm sorry you will be spending the first part of it treating BC. Prayers & Hugz, Cathy",
      "MessageIndex": 2,
      "PostDate": "25/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186826",
      "Title": "Trying to Find an Oncologist in Orange Park FL"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I'm so very sorry to hear your news. :-( My thoughts & prayers are with you & your family. ♥ Always, Cat",
      "MessageIndex": 9,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225100",
      "Title": "Monday's Biopsy Results"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR JM HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Wishing you all the things you love most on your special day & throughout the year! Have a great weekend! ♥ Cat",
      "MessageIndex": 7,
      "PostDate": "26/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214958",
      "Title": "Today is jessiesmom1's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Wonderful! So glad to hear you are feeling better! Hugz to you, Cathy",
      "MessageIndex": 17,
      "PostDate": "15/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175624",
      "Title": "Need help ..sensitive subject .. private area is raw and inflamed from constipation (5 days with movement) .. I need help"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "If you are still determined to use your own hair, I aksed the LGFB volunteer today about your idea. She said if you had the patience, you could glue your hair to a piece of material, then sew it into a cap. You do have beautiful hair and I know it must be tough letting it go! Hugz, Cathy",
      "MessageIndex": 6,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/176749",
      "Title": "When I cut my hair..."
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Don't be sorry about any post. We share it all. So sorry to hear the news of Carter's passing. Will definetely pray for you & his family to get through this difficult time. Hugz, Cat",
      "MessageIndex": 22,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192114",
      "Title": "Sorry to post such bad news"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR CINKAL HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Lordy Lordy Look who's 40! 40 is only 18 with 22 years experience! Wishing you all the best today & throughout the year! ♥ Cat",
      "MessageIndex": 0,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212074",
      "Title": "Today is Cinkal's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR GEORGIA HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Wishing you the best today & throughout the coming year! ♥ Cat",
      "MessageIndex": 0,
      "PostDate": "05/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/204905",
      "Title": "Today is LadyG's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Hello, So sorry to hear you have reached this part of treatment. During my journey of hair loss, I never quite lost it to complete baldness. Once it came out drastically, I had it shaved. Then I started using the lint roller thereafter as it still seemed to be \"loosening\". I was left with patches of baldness & stubble. I would say it is up to you whether or not you want to shave it down to \"baldness\". I preferred to hang onto whatever I could. I still had to shave my legs because there was a rough sort of feeling there and when I did they were smooth for awhile. Believe it or not, here I am 3 months post-Chemo and it is still the same effect. I'll take that! No hurry on going back to full shaving! ♥ SisCat",
      "MessageIndex": 1,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184384",
      "Title": "How long did it take for your hair to totally fall out?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Ok the waterfall eyes are driving me crazy! If they aren't flowing they are crusty. Anyone else have this happen and what to do? I'm afraid to use any drops thinking it may burn. Help! Thanks Cathy",
      "MessageIndex": 0,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179511",
      "Title": "Chemo Chicks"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR LIZZIE HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! What a special surprise your daughters gave you for your birthday! Enjoy your special day & visit! ♥ Cat",
      "MessageIndex": 8,
      "PostDate": "15/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/207710",
      "Title": "Best Birthday Surprise!!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Am I the only one or does this subject touch on others as well? Mind you from the beginning of BC journey, I have gone to the SAME hospital for the tests, the port, Lumpectomy, more tests, etc...Yet EVERY time I have an appointment scheduled, they call to pre-register me asking alot of ?'s, then when I get there, they have me fill more papers out asking me more ?'s. Mostly all the same ones that have already been asked. The questions are usually ones that THEY have all the answers to! I realize things can change, granted, but all the medical history they keep asking me about is right there! Not to mention having to take a copy of my drivers license & insurance card every time also. (C'mon, I don't get a new drivers license or change my insurance daily, weekly, or even monthly). And yes, I do look alot different than the picture today because I don't have that hair anymore! I can't even begin to tell you how much time \"I\" have saved in this process by taking the advice of the the senior warriors here & getting copies of all my test results and taking them with me to new appointments. Having those copies has saved alot of time and hassle. Most of the time it was the only way I could know what was going on with me! For that, and so much more, I thank you!! I just basically fired my Onc. & General doc. and am now finally being \"treated\" at a Cancer Center closer to home. I have had to pick up alot of slack lately on the part of people not doing THEIR jobs! It's frustrating! I just can't help to see this as pure & simple (\"WASTE\")!!! Skyrocketing health care costs?! For what? Us doing their job and not getting paid for it? For all the copies they make, or for all the needless paperwork they have created duplicating all the information that should be right there in their computers? How about having treatment or results delayed because they need the paperwork? I'm sorry, but it really makes me mad! Thanks for listening to me dump all that! I needed to get it out! ♥ Cathy",
      "MessageIndex": 0,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185182",
      "Title": "Medical Records Vent"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR JANICE HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Best wishes on your special day & throughout the coming year! Merry Christmas! ♥ Cat",
      "MessageIndex": 0,
      "PostDate": "22/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208276",
      "Title": "Friday is Jd1224's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "What a great idea! Mine is simple, Cat is what my friends call me (Cathy) & the year I was born.",
      "MessageIndex": 162,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "What a great idea! Mine is simple, Cat is what my friends call me (Cathy) & the year I was born.",
      "MessageIndex": 112,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "What a great idea! Mine is simple, Cat is what my friends call me (Cathy) & the year I was born.",
      "MessageIndex": 12,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "What a great idea! Mine is simple, Cat is what my friends call me (Cathy) & the year I was born.",
      "MessageIndex": 62,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "It's so good to hear you finally got a break from something! That's great news-no drains and the surgery went well. (Glad your BP went down too) Rest up & take care of you ♥ Cat",
      "MessageIndex": 25,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197073",
      "Title": "Vicki Sam is home, resting and recovering -- Not too bad // Exchange went well this morning at 7:30, home by 1 p.m."
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I made this post a few months ago & thought I would update it since there have been so many \"Newbies\" joining lately. You don't have to expose the year you were born, just the month & day. I will put you on the birthday calendar and it will get posted so that we can all join in on the celebration! Must warn you though, you may want to buy ALOT of ice-cream in a varity of flavors! And we LOVE chocolate cake too! ♥ Cathy",
      "MessageIndex": 0,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "When the lump was found, 44 when diagnosed 8/11/09, 45 now & still fighting the battle. Cat",
      "MessageIndex": 36,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "When the lump was found, 44 when diagnosed 8/11/09, 45 now & still fighting the battle. Cat",
      "MessageIndex": 86,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR RAINBOW HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! HAPPY 69TH BIRTHDAY-HOPE YOUR SPECIAL DAY IS FILLED WITH LOVE, LAUGHTER, A GOOD DINNER, & LOTS OF GREAT PRESENTS! ♥ Cathy",
      "MessageIndex": 0,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185600",
      "Title": "Today is Rainbow4's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I made this post a few months ago & thought I would update it since there have been so many \"Newbies\" joining lately. You don't have to expose the year you were born, just the month & day. I will put you on the birthday calendar and it will get posted so that we can all join in on the celebration! Must warn you though, you may want to buy ALOT of ice-cream in a varity of flavors! And we LOVE chocolate cake too! ♥ Cathy",
      "MessageIndex": 50,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY! JUST ATE SOME CHOCOLATE CAKE IN YOUR HONOR! I JUST TURNED 45 IN NOV. WE ARE GETTING YOUNG AREN'T WE? I'VE DECIDED TO STAY THIS AGE..LOL I'M SORRY I MISSED YOU ON MY B-DAY POST, I DIDN'T HAVE YOUR INFO. HOPE YOU HAD A BLESSED DAY! :-) ♥ Cathy",
      "MessageIndex": 18,
      "PostDate": "12/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181843",
      "Title": "45"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I get so mad when I read stories like these! No doctor should ever deny(or have the right to) someone a simple test! Maybe you should tell that doc to come on here and read how many \"young\" women there are & joining everyday! My dog actually found my lump back in May'08-No family history here either. I didn't have insurance at the time so I went to the Health Dept.(Whole 'nother story about my experience, but I will say that I wouldn't be in the situation I am now if the hospital would of taken the time to listen to me & had someone more professional reading my Ultrasound & Mammo!) This may be another option for your D-I-L, they have a grant that will help or pay for it entirely,there are plenty of places that can do it on a sliding scale as well if $ is an issue. I would find a way to get it done! Don't take \"No\" for an answer! Hugz, Cathy",
      "MessageIndex": 14,
      "PostDate": "20/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175916",
      "Title": "Mammogram for the under 40"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I believe mine was a Susan B Komen grant. It's a shame that these things are not publicized more to encourage women to get one & also let them know that help \"IS\" available! Glad you pursued getting one! Although sorry you got the result of cancer. As we are learning & have learned,that it's so much better to be safe than sorry! Hugz, Cathy",
      "MessageIndex": 16,
      "PostDate": "20/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175916",
      "Title": "Mammogram for the under 40"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I have decided to make a calendar of all of our birthdays. It warmed my heart when I received all the wishes on my birthday and it made me think that we should all receive the same on our special day! Ya don't have to share the year! :-0 Just the day! Hugz, Cathy",
      "MessageIndex": 51,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "When the lump was found, 44 when diagnosed 8/11/09, 45 now & still fighting the battle. Cat",
      "MessageIndex": 136,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I have decided to make a calendar of all of our birthdays. It warmed my heart when I received all the wishes on my birthday and it made me think that we should all receive the same on our special day! Ya don't have to share the year! :-0 Just the day! Hugz, Cathy",
      "MessageIndex": 0,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Thank you for posting this! I love Hugs!! I'm there! ♥ Cat",
      "MessageIndex": 15,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220413",
      "Title": "GROUP HUG time!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR CHERYL HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Best wishes on your birthday and the year to come! ♥ Cat",
      "MessageIndex": 0,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198634",
      "Title": "Today is Cheryl4's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "WooHoo!! No more Chemo!!! Fabulous news! Congratulations graduate!! ♥ Cat",
      "MessageIndex": 6,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213639",
      "Title": "Thanks to all my Pink Warriors"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Good to hear from you. Can't answer your ? regarding Rads, but just wanted to say hang in there! You are almost done. Hope you feel better soon! Hugz, Cathy",
      "MessageIndex": 3,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184861",
      "Title": "Nauseated with Rads ???"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR MARLENE HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Wishing you a day filled with love, laughter, good food & great presents! We've missed you on here. Hope you see this post & check in to let us know how you are. ♥ Cat",
      "MessageIndex": 0,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199663",
      "Title": "Today is MarleneK's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR MARCY HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! May all your dreams & wishes come true! ♥ Cat",
      "MessageIndex": 0,
      "PostDate": "12/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218299",
      "Title": "Today is CanoeGirl's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR RR HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Hope your special day is filled with love, laughter, great food & wonderful gifts! Haven't hear much from you lately-how are you doing? ♥ Cat",
      "MessageIndex": 2,
      "PostDate": "03/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/227544",
      "Title": "Today is rrogers34's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "WhooHoo! That's great news! You are almost there.... Hugz, Cathy",
      "MessageIndex": 3,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175607",
      "Title": "Great 6 monthl check-up"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Congratulations on being a Rad Grad and completing treatment! How wonderful to receive flowers & dinner on the same day! ♥ Cat",
      "MessageIndex": 16,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214794",
      "Title": "I am a rad grad! Yipee!!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I just came across an interesting article yesterday about cysts. MedicineNet.com Search Cysts. The article I read was by Melissa Stoppler & William Shiel Jr. Hope you find this helpful! ♥ Cat",
      "MessageIndex": 7,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220206",
      "Title": "Cysts???"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I don't know how to answer your ? but what I can say is that I don't know where I would be without all of you! I'm newly diagnosed and haven't even started treatment yet, I come here for knowledge, advice, support and to hear other's stories and experiences. I'd be so lost without all of you! So, for me I'd say STAY! Even if you just pop in once in a while to tell your story or to update on how your living life with NED. It helps. You have something to give! Hugz, Cathy",
      "MessageIndex": 6,
      "PostDate": "08/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175285",
      "Title": "☺When Is It Time?☻"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Thank you for checking in with us, so glad to hear your first one went well. Wow! and to have the whole room & tv all to yourself, food & beverages served, and napping included?! Can't beat that for relaxing. (Almost sounds like you were off on a tropical island somewhere)lol Take gentle care of yourself Hugz, Cathy",
      "MessageIndex": 5,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184877",
      "Title": "My first treatment"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Happy Anniversary! What's your secret? Hope you & Danny have a fabulous time in NY! If you climb the Empire State Bldg. while you are there-wave to all of us when you are at the top! (I love that movie \"Sleepless in Seattle!) Share your trip when you get back! ♥ Cathy",
      "MessageIndex": 14,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180063",
      "Title": "Our 35th anniversary"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Yesterday I received this beautiful arrangement from our sister JennyTwist. What a wonderful surprise it was! It completely made my day! She had meant to surprise me for Valentine's Day, but the Florist lost my address, so it was a little delayed. Not only are they beautiful, they smell absolutely Heavenly! Thank you again so much Jenny for your loving kindness!! ♥ Always, Cat",
      "MessageIndex": 0,
      "PostDate": "19/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212503",
      "Title": "My New Pic"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I'm so sorry to hear you are having a rough time. Sending you & your family healing thoughts & prayers. ♥ Cat",
      "MessageIndex": 24,
      "PostDate": "25/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/226955",
      "Title": "Prayers for our Pinkflutterby"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR CINDY HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! Wishing you a day filled with love, laughter, and all the things you love most! Love, Cat",
      "MessageIndex": 0,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://csn.cancer.org/node/243823",
      "Title": "Today is MamoLady's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Anytime! Glad to hear you flew through the surgery colorfully! Get lots of rest and take it easy. Keep us posted! Prayers & Hugz, Cat",
      "MessageIndex": 6,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214825",
      "Title": "Thank you for Prayers from Ticky"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Happy 64th Birthday! Have a wonderful day & may all your wishes come true! ♥ Cat",
      "MessageIndex": 14,
      "PostDate": "26/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195161",
      "Title": "Today is Rague's birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Yeah for the last Chemo!! Cake & ice-cream are indeed good, but the last Chemo deserves a nice dinner out too! I finished mine 10/26 & as you can see by my pic I'm still waiting for hair. I still loose alot of stubble and have bald patches. That's just my experience, I have read on here varied hair regrowth time. So...hard to say when. Be Patient-it'll sprout! Hugz, Cathy",
      "MessageIndex": 5,
      "PostDate": "13/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181923",
      "Title": "Last Chemo on Monday"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR SANDY HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! *So sorry I am late. I was not able to get service yesterday. I hope you had a wonderful day filled with all the things you love most. Love, Cat",
      "MessageIndex": 0,
      "PostDate": "18/07/2012",
      "ThreadURL": "https://csn.cancer.org/node/243504",
      "Title": "Yesterday was LineDancer54's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "You look fabulous! Hope I have that much hair in 2 more months and look that good @ 61! And Happy Belated Birthday! I have added you to the list. I'm sorry it was missed! ♥ Cat",
      "MessageIndex": 4,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198674",
      "Title": "This is me with 5 months of new hair."
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY TO YOU HAPPY BIRTHDAY DEAR DOT HAPPY BIRTHDAY TO YOU!! AND MANY MORE...!!! May all your dreams & wishes come true! ♥ Cat",
      "MessageIndex": 0,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218669",
      "Title": "Today is Dot53's Birthday!"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "Hello & Welcome, I first hesitated to reply to your post because almost 2 years ago I was mis-diagnosed with a \"Cluster of Cysts\" and ended up being diagnosed 8/11/09 with Invasive Ductal Carcinoma. I didn't want to scare you or cause you any needless worry...but, I also felt I had to try to make sure the same thing doesn't happen to anyone else! Here is what I know: Calcifications are mineral deposits in the tissue. There are two types, Macro & Micro. Macro are large calcium deposits and micro's are of course smaller. However, clusters of calcifications CAN mean there is cancer or it CAN develop, it depends on the shape & density of the cluster. The clusters can sometimes be DCIS (ductal carcinoma insitu). Then again, it may NOT be cancerous. I'm so relieved to hear they ARE doing biopsies to check for sure! Do you know what kind of biopsy you are having done? I know it's easier said than done, but try not to worry too much until you get the results and know for sure what it is. Hope this helps! Hugz, Cathy",
      "MessageIndex": 5,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185866",
      "Title": "Cluster Calcifications"
    },
    {
      "AuthorID": "Cat64",
      "AuthorURL": "https://csn.cancer.org/Cat64",
      "Content": "I totally agree with the others. Why spend the money when you don't even know if it will happen.? I only lost some lashes on one side and my eyebrows thinned a little. That's awful costly too! Wish there was a miracle cure for the hair loss! But, it does come back shortly after Chemo. There is a class called \"Look Good-Feel Better\" that the ACS sponsors for all the Newbies out there going into Chemo. It's awesome! They give you tips on applying make-up, skin care, show you how to make a turban out of a t-shirt,etc..and send you home with a free bag of make-up and skin products. Just call and they can help you locate a class in your area. It is SO worth going! Cathy",
      "MessageIndex": 6,
      "PostDate": "20/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184306",
      "Title": "Brian Joseph's Lash & Brow Gel???"
    }
  ]
}