{
  "AuthorID": "chcnsac",
  "AuthorURL": "https://csn.cancer.org/chcnsac",
  "Posts": [
    {
      "AuthorID": "chcnsac",
      "AuthorURL": "https://csn.cancer.org/chcnsac",
      "Content": "I am a nurse and sometimes we are the worst patients. ;-) .  I had my sentinel node biopsy (bx) Oct 2015 and port placement at the same time. In my nursing career , I had routinely administered conscious sedation to patients in a hospital endoscopy unit. I told both my surgeon and the anesthesiologist that I didn't want to know anything.  As I told my breast surgeon, \" I don't want to know nuttin' (nothing) honey!\" so that part didn't bother me. I too was very scared (nervous is not a stong enough word) and had worked myself into such a state (southern expression), for the injection of the radioactive material that had to take place prior to the surgery. I expressed my concerns because I had \"heard\" so many stories about how painful that part would be. It was not at all like I had heard.  There was an initial prick then she injected the solution. The young lady who gave me the injection was very caring and understood when I expressed my concerns. My advice is to express your concerns to the person giving the injection; ask them to tell you what they are going to do every step of the way (just before and as they are doing it) and they should understand and take their time in giving it. Also, the person administrating the anesthesia will give you something called Versed, which will very quickly make you relaxed in the holding area, just before they take you back for the actual surgery. Versed gives you an amnesia effect, then once they get you back to the surgical suite,they might give you something called propofol which makes you go into a deep sleep but is very short acting. It takes longer (we used to say up to 24 hrs) to \"clear\" your system of the versed than the propofol. After I got home, there was initial pain which I anticipated at both surgical sites , but my Dr. gave me a prescription for the pain medicine percocet.  I took only 1 1/2 total. (More can cause constipation, which you don't want) I switched to tylenol later, but after 2 days, mine didn't hurt much at all. Turning over and getting up from a reclining position was initially difficult because my surgical sites were on opposite sides of my body, but as I told him later at my post op visit, it was a non-event and he laughed. At first I truly was a scaredy cat. Hope this helps, and God bless.",
      "MessageIndex": 3,
      "PostDate": "09/06/2016",
      "ThreadURL": "https://csn.cancer.org/node/302702",
      "Title": "Pet Scan and Sentinel node biopsy"
    },
    {
      "AuthorID": "chcnsac",
      "AuthorURL": "https://csn.cancer.org/chcnsac",
      "Content": "Adding to the above......My care path required me to have my chemo before the mastectomies (March 2016).",
      "MessageIndex": 5,
      "PostDate": "09/06/2016",
      "ThreadURL": "https://csn.cancer.org/node/302702",
      "Title": "Pet Scan and Sentinel node biopsy"
    }
  ]
}