{
  "AuthorID": "Christine Louise",
  "AuthorURL": "https://csn.cancer.org/Christine Louise",
  "Posts": [
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "When I first started chemo, I walked the dog with only my hands uncovered and got a horrible, itchy, poison ivy-like rash within 15 minutes. The oncologist said it was from the chemo, so I suppose Tamoxifen could make you sun-sensitive, too. She thought that using lots of sunscreen -- way more than usual -- would prevent it.",
      "MessageIndex": 2,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192718",
      "Title": "Tamoxifen and sun exposure"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I love your boots and hat! Not too big on pink ribbons, personally (I applaud the thought, just not the look), so a green Tough Chick hat sounds fab and I'm gonna look for it. Good tip about the sunscreen, thanks.",
      "MessageIndex": 8,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192718",
      "Title": "Tamoxifen and sun exposure"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I'd rather shred this entire box of documents than watch baseball. Hmm, the shredding sounds like vuvuzelas -- puts me in the mood for more soccer!",
      "MessageIndex": 3,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196019",
      "Title": "Looks like it's The Netherlands and Spain!!!! World Cup update!"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I haven't decided who to cheer for, but I never can be neutral at a sporting event. I'd better get aligned soon and choose how to paint my face. Holland, Netherlands, Dutch -- what's with all the seemingly unrelated names? And, why orange for the team when there's no orange in their flag? A strange, mysterious people, I think. (As for the Spanish ...)",
      "MessageIndex": 5,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196019",
      "Title": "Looks like it's The Netherlands and Spain!!!! World Cup update!"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Yeah -- just the final we wanted! I hope both teams show up with their A game and give us a thrill. My husband is in sports heaven right now -- World Cup and Tour de France. He's logging lots more TV time than usual.",
      "MessageIndex": 1,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196019",
      "Title": "Looks like it's The Netherlands and Spain!!!! World Cup update!"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "My hair started coming out in strands and clumps right before my daughter's play. I didn't want to distract her or take attention away by shaving then, so I \"glued\" my hairdo with hairspray for four days and hoped I wasn't trailing hairs everywhere. I was the one who was distracted and rather miserable! Then, what a relief to have it shaved! She said she wouldn't have cared if I'd done it during the play. Scalp was quite tender. Buzzed, it's less sore. I'd like to shave it slick because even the stubble catching on hats and pillow is slightly painful. They don't want you to risk cuts, however, but I'm still thinking about it. I do run the sticky lint roller over it GENTLY several times a day but still have plenty of stubble. I know people who didn't shave and say they have a combo of random long strands and peach fuzz. Sorry, but yuck! Like the woman in the Shutter Island ad, yes.",
      "MessageIndex": 13,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I, too, got a bad cold with an out-of-control chest cough during chemo. I never had a fever and thought it was \"just a cold,\" so didn't call the oncologist. After coughing day and night for a week, I went in and got antibiotics and codeine cough syrup. Although I didn't think it was a bacterial infection, they said it easily could become one, so I took the antibiotics. The second day, the cough syrup made me sick, but I do think it helped stop the whole nasty cough cycle. Please call your onc and see if they want you to come in! Don't be foolish like I was. Could a friend with clippers come to your house? Don't go anywhere but the doctor's right now, though, please. People talk about the \"dreaded Day 10\" after a chemo infusion, when white blood counts supposedly are lowest. I've learned to stay away from people as much as possible around this time. Best wishes to you, Pat!",
      "MessageIndex": 7,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192180",
      "Title": "Hair Loss Symptoms"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "So, they take 6-8 weeks to heal? Before that, they can collapse, and after that, they won't? Did the first monopoly hotel disintegrate? How are you disguising them under your clothing, or are you? Fascinating stuff for those of us contemplating getting nipples! You're our \"go to\" girl for info on this -- thanks.",
      "MessageIndex": 2,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195403",
      "Title": "Nipple Update"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I don't know how long ago her surgeries were, but it is common to be depressed and tearful after any surgery. This may not show up immediately. There are often alternative medications without side effects of sleeplessness, etc. They each need to talk to their doctors as soon as possible about their meds and possible referral to a psychologist. It doesn't have to be this way! Yes, introduce them to this site so they can vent. Maybe the \"mean\" one, especially, needs an outlet for her anger and frustration. This is the place.",
      "MessageIndex": 2,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191476",
      "Title": "I have a family member who just had a double mastectomy and hysterectomy because she has breast cancer (BRAC gene)"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "The funny taste went away after the second infusion. I only had a sore mouth after the first infusion. The fatigue and the dry eyes, however, got a bit worse each time. Personally, I had to stop my exercise program during chemo because it wore me out to where I couldn't get through the rest of the day adequately. In about two weeks after my fourth and last chemo, the energy started returning!",
      "MessageIndex": 11,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195382",
      "Title": "What do I expect after next treatments?"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I sure hope your infusion went smoothly today, shortscake!",
      "MessageIndex": 23,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191789",
      "Title": "back to chemo on Monday 5/10/10"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I hope you are doing well after your first chemo, Cheryl!",
      "MessageIndex": 7,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/193211",
      "Title": "wrong diagnosis"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "We're pretty evenly divided between young and old and everything between on here -- all are welcome! Lots of these women have grandchildren, so you're in the right place. I'm so glad you insisted and caught this cancer. It is very good that you caught it \"early\" despite the bad diagnosis, and I hope your treatment goes smoothly. My kids' pediatrician always said he listens to the mother -- if the mom thinks something's wrong, it nearly always is. Women really are intuitive. By the way, my Oncotypedx percentage (not number, percentage) was 15% possiblity of recurrance within 10 years if I didn't get chemo. Not huge, but not nothing. I just finished 4 rounds of chemo this week. Anything I can do to eradicate the cancer for good, I'll do. Bi-lateral mastectomy, uterus and ovaries out, Tamoxifen followed by Arimidex -- I've done or am doing it all. That's just my take on things.",
      "MessageIndex": 3,
      "PostDate": "29/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/193211",
      "Title": "wrong diagnosis"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Yep, I've got 'em. It's not even really annoying, just odd. I rarely think of it when I'm listing my side effects, but, there they are. I've never heard anyone else mention it. My hands and feet have started tingling this week, too -- 6 weeks after the end of chemo. The tingling isn't painful, but sometimes they also swell unpleasantly. All temporary, I hope, Heidi!",
      "MessageIndex": 3,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195903",
      "Title": "lips vibrating?"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Ronda, I got 4 cycles of C & T, too, but after bi-lat. As we say, very do-able. I think they're trying to shrink your cancer so you can have a better lumpectomy result, aren't they? Yes, HER- would indicate you won't take Herceptin.",
      "MessageIndex": 12,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195664",
      "Title": "May I ask you, how many chemo treatments did you have altogether?"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I thought maybe they were trying for a lumpectomy now. Still, it would seem they want to shrink the cancer before surgery to be sure they can get it all. It's good to hear that your nausea was so minimal! Only fifteen minutes? You're the champ. Love, Chris",
      "MessageIndex": 14,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195664",
      "Title": "May I ask you, how many chemo treatments did you have altogether?"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I am so, so sorry to hear of this awful surprise. You are a fighter and I know you will do battle again. Best, best wishes to you.",
      "MessageIndex": 60,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I am so, so sorry to hear of this awful surprise. You are a fighter and I know you will do battle again. Best, best wishes to you.",
      "MessageIndex": 13,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I am so, so sorry to hear of this awful surprise. You are a fighter and I know you will do battle again. Best, best wishes to you.",
      "MessageIndex": 107,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Let us know how you're doing afterward, please. You know a number of us are contemplating the same procedure and want to know alllll about it. Thx!",
      "MessageIndex": 2,
      "PostDate": "17/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194563",
      "Title": "Funky vein looking thing..."
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Janice, I was afraid you wouldn't see this in the middle of the other thread. Dry eyes can occur when the composition (oil, water, mucus) and balance of tears changes. That can be due to hormonal changes, antihistimes (like they give during chemo), antidepressants and many other reasons. From emedicine: A symptom of Dry Eye Syndrome may be intermittent excessive tearing. When your eye becomes dry and irritated, it may initiate reflex tearing and produce a large amount of tears to try to get moist and comfortable again. Your eye can only handle so many tears; the rest pour down your cheeks. Those tears do not help your eyes, so soon your eyes become dry again, and the whole process may repeat itself. I've read that vitamin A and omega3 fatty acid can help. My dry eyes are improving since chemo is behind me.",
      "MessageIndex": 0,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196038",
      "Title": "Dry eyes & tearing - for Janice/Boppy"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Rippling. A new fun thing to learn about! I suppose it will keep changing as the pecs loosen and the implant settles? ANYWAY, on with the nipplization! I'm with ya on the comfort eating. Blah. Let's worry about that AFTER these surgeries!",
      "MessageIndex": 1,
      "PostDate": "16/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194563",
      "Title": "Funky vein looking thing..."
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "We hate cancer. But, thank goodness your treatment is a breeze, as you say. Best wishes to you!",
      "MessageIndex": 1,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194208",
      "Title": "Hello pink warriors :)"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I had bilateral mast and three nodes removed on each side. During chemo, they alternate arms for my blood counts and blood pressures and for my infusions. They don't seem too concerned about problems since I had so few nodes removed. Sure hope they're correct! They say it's such a pain to use legs and feet for these things.",
      "MessageIndex": 7,
      "PostDate": "06/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191688",
      "Title": "? on bilaterial mastectomy"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I alternate among three sleep medications, taking a different one each night -- Ambien, Lorazepam and Diazepam (Valium). I know many people would condemn this, but it works for me and my doctors have approved it. I had insomnia for years before bc and feel that I \"lost\" a lot of possibilities in my life because of it. It had to stop. Now that I can take a daily walk and generally be more active around the house, I have been sleeping better anyway.",
      "MessageIndex": 9,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196302",
      "Title": "Sleep?"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I need to google up a picture of those. Glad to know they can look that good. m-star, are you done with expansions?",
      "MessageIndex": 16,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Is that a current picture of you? I'd say you look great and gracefully curvy!",
      "MessageIndex": 19,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "I get expanders out and implants in July 7. Haven't decided about the nipples yet because I so love my new smoothness. My real nipples were long and almost impossible to suppress. If I had a nickel for every time my daughter said, \"Mom, you're nippin' out!\" Those of you who've gotten nipples -- are they so small that you could go braless without embarrassment? I've thought about getting just the tattoos. Anyone done that and like it? On the other hand, someone on this board once commented that getting the nipples really reduced the Frankenstein look of her scars. That's appealing. I'm looking forward to hearing all about your procedure, SamuraiMom. Please keep us posted, and best of luck to you on Saturday and always.",
      "MessageIndex": 14,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Michelle, have you had the OncotypeDX test that gives a recurrance score -- how likely it is you'll have bc return if you don't do chemo? Is that what your onc is basing her recommendation on? (I had bi-lateral mastectomy -- extensive DCIS with but Invasive Lobular Carcinoma and LCIS also, so not quite the same diagnosis as yours. I did have chemo based on my OncotypeDX results.)",
      "MessageIndex": 2,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196477",
      "Title": "2nd opinion today"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Hope you are doing great today!! We're thinking of you. You are very generous to post photos -- thanks.",
      "MessageIndex": 27,
      "PostDate": "19/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "That'll definitely wise him up to the reality. It will be very helpful, I'm sure. Good luck with your appointment and everything!",
      "MessageIndex": 10,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190389",
      "Title": "My husband is my best friend....but since this IDC stage i grade III cancer he seems weird at times"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "allforlee, your story about \"your\" Brad Pitt movie strikes a chord with me. My comfort movie that I watch over and over is the version of \"Pride and Prejudice\" with Colin Firth. The countryside, costumes and language are soothing and beautiful. Like you, I often fall asleep to it. Friends gave me a soft, furry throw that I cried into for several weeks. I'm now sharing this special blankie with my teenaged daughter who's having a rough time with my cancer and her own teenaged stuff. Remember how little kids are unashamed about seeking comfort? They know what works, and it's okay for us to be that way, too. Embrace whatever comforts you, and let others take care of life's details. For everything there's a season, and this is the season for you to recuperate. Eventually, the season changes, you know.",
      "MessageIndex": 8,
      "PostDate": "14/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/188146",
      "Title": "New to discussions and have questions"
    },
    {
      "AuthorID": "Christine Louise",
      "AuthorURL": "https://csn.cancer.org/Christine Louise",
      "Content": "Maybe he needs someone else -- onc or nurse or other survivor? -- to inform him of the realities of your situation. You may or may not be able to work that soon. He must not push you. That being said, I was surprised how soon I could get back to typing and billing, which I do from home for my husband's business. Since I \"just\" have to sit, I found I can keep up. (Housework is another matter ...) I find it satisfying to do my work. Husband did have his receptionist do the typing right after my surgery. I hope you have more sympathetic people in your life to listen when you need to talk. No one -- husband, mother, friend -- can fill every emotional need we have. Some people prove to be limited, even dear spouses. Yours sounds scared, frankly, and in denial. Another thought: Since my husband is unsure of how I feel from day to day, he refrains from initiating sex. He becomes more removed, emotionally. So, when I make the advances, it's like a wall breaks down between us and he is reassured about both my condition and our marriage.",
      "MessageIndex": 8,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190389",
      "Title": "My husband is my best friend....but since this IDC stage i grade III cancer he seems weird at times"
    }
  ]
}