{
  "AuthorID": "Cindy54",
  "AuthorURL": "https://csn.cancer.org/Cindy54",
  "Posts": [
    {
      "AuthorID": "Cindy54",
      "AuthorURL": "https://csn.cancer.org/Cindy54",
      "Content": "You haven't said if you have had follow-up care in these past three years. I am sure hoping your doctors did mammograms. If you don't have insurance, they also do mammos for free. Contact the cancer society. They should be able to refer you to someone who can help. Not knowing is worse than anything. Please contact them. They will help you. And please post again so we know how things are going. Maybe some of the ladies here will have some better suggestions. Hugs, Cindy",
      "MessageIndex": 1,
      "PostDate": "23/05/2008",
      "ThreadURL": "https://csn.cancer.org/node/157916",
      "Title": "After effects of breast cancer surgery"
    },
    {
      "AuthorID": "Cindy54",
      "AuthorURL": "https://csn.cancer.org/Cindy54",
      "Content": "ohilly..I had two aunts with breast cancer as well as my Mom with ovarian. That means there was a pretty good chance I would end up with one of those and I did. I asked the doctor about gene testing. He said that all it does is confirm that you carry a gene in your body that could/maybe one day turn into cancer. It does not mean it IS cancer.I am still waiting on my insurance to approve testing for this. If they do I will be tested. If they don't approve it, I won't be. You are in the beginning stages of fighting your cancer. You have taken steps to deal with it. That does not mean it is a death sentence. My doctor said that even if I tested postive for one of the genes, it did not mean I had to take drastic action. They would monitor me for any changes, either breast changes or the Ca125 test for ovarian. If anything out of the ordinary showed up, then we would take action. It is NOT meant to be a death sentence. It is mainly a means to test for this because of family concerns. You are not going to die from having this. Yes, it is scary and serious. But DO NOT believe everything you read on the internet. Ask your doctor to be more specific.Ask some of the nurses. Maybe some of the ladies here can offer more.Just because you have this gene does not mean that you have to automatically remove your breast or have your ovaries removed. It is up to the individual.And their doctor. Please don't panic. Ask more questions of your doctor. Cindy",
      "MessageIndex": 1,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://csn.cancer.org/node/157684",
      "Title": "BRCA gene"
    },
    {
      "AuthorID": "Cindy54",
      "AuthorURL": "https://csn.cancer.org/Cindy54",
      "Content": "Hello Everyone, Well, tomorrow is my lucky day... I am going back to work. My doctors have released me, though reluctantly, to go back. I said I was tired of fighting with the insurance folks, so for now I am going back. I feel a lot beter than I did when all of my battle with the beast started. The only concern now is not getting as run down as I was. Also, last week I went to the local Walmart to get safety glasses for my return to work. I was pretty excited because my eyes have actually gotten a little better. But they found a cyst below my eye that they want me to have looked at. It was not there 2 years ago and because I have plastic surgery under both eyes due to childhood Steven Johnson Syndrome..well, I have to see a specialist. Not looking forward to this but I will get through it. And, I will be going for my first gyno appointment on Monday in over 10 years. I know, I know. But as a care giver and someone who never had a reason to go, or so I thought. Well, the doctors said that since my Mom had ovarian, it was wise to start checking NOW!! So, we will get through this also. Well, now you all have been updated on my latest adventures. I hope everyone has a good week, and I sure will keep you all posted. Hugs to everyone, Cindy",
      "MessageIndex": 0,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://csn.cancer.org/node/158023",
      "Title": "Going Back To Work"
    },
    {
      "AuthorID": "Cindy54",
      "AuthorURL": "https://csn.cancer.org/Cindy54",
      "Content": "Hi Ladies, I was prescribed Evista because I was very progesterone receptive. I got the prescription about a month ago and was supposed to start taking it after the radiation. Since my finances are not good right now, and I don't seem to be getting any public assistance, I have not got it filled yet. Will this delay in starting it make a significant dent in my fight against the beast? Or will delaying it by a month or so increase the chance of the beast getting a foothold again. Hugs, Cindy",
      "MessageIndex": 0,
      "PostDate": "09/05/2008",
      "ThreadURL": "https://csn.cancer.org/node/157782",
      "Title": "Taking Your Hormone Drugs"
    },
    {
      "AuthorID": "Cindy54",
      "AuthorURL": "https://csn.cancer.org/Cindy54",
      "Content": "Your post is something I really enjoy reading here. It's all the little things that make life worth it and all we go through. it is a beautiful sunny, windy day in Erie, Pa, the snow capital of the state..we had 145 inches of snow this year! And it is also a day to celebrate..I am finally going to see the ocean. One of my friends got a trip to Atlantic City that is free. Her hubby is passing this time. So, on May 17, 18, 19, I will get on a plane for the first time in my life, stay in a hotel for the first time in my life, and see the ocean and the boardwalk. I am excited beyond words. I hope I don't cry at every turn. Everything is free, all I have to pay for are my meals...McDonalds here I come! I have not had a vacation, a real one, where I went some where in almost 19 years. I still cannot believe I am going! I hope everyone else has a joyfilled day today! Hugs, Cindy",
      "MessageIndex": 15,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167771",
      "Title": "Moopy and Aortus are ALIVE!"
    },
    {
      "AuthorID": "Cindy54",
      "AuthorURL": "https://csn.cancer.org/Cindy54",
      "Content": "Joe and Moopy...home is just the best place to be. Rest and just enjoy being there, then you can celebrate. I'm so glad to hear that you both will still be with us on this board, I can't imagine it without you. You guys are always, always so supportive and compassionate. And you have so much to share. I look forward to many more posts from you. Hugs to you both for sharing your lives with us...Cindy",
      "MessageIndex": 9,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173685",
      "Title": "Home from St. Louis... at last!"
    },
    {
      "AuthorID": "Cindy54",
      "AuthorURL": "https://csn.cancer.org/Cindy54",
      "Content": "Claudia...thinking of you today...hugs, Cindy",
      "MessageIndex": 11,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173693",
      "Title": "((( CLAUDIA )))) AKA ((( CHENHEART))) Just following up.."
    },
    {
      "AuthorID": "Cindy54",
      "AuthorURL": "https://csn.cancer.org/Cindy54",
      "Content": "Hi Ladies. I have a question that I don't think I have seen here before. I also p[osted this to my friends on the ovarian board. If any of you have had to switch jobs or careers, did they do background checks on you and if they did, did it include a credit report check? I am asking because quite honestly my credit is terrible. The last three years have not been kind to me. Between caring for Mom and my own health issues I ended up in bankruptcy and my credit is still not right or good. I lost out on some retail jobs. Had interviews and was informed that the policy was that I was a high risk when it came to handling money because of my credit history. While I am not proud of this credit issue, I am proud of the fact that I managed to hang onto a job through everything, go to school, pay for Mom's funeral, and keep a roof over both our heads and now mine. I may have had to let bills slide or pay them late and yes I have medical bills that are in collection, but sometimes I feel that if the interviewer knew the whole story they would not be so quick to dismiss me. But of course you can't bring up health issues because that will never get you hired. So what to do. I would hate to think that I have struggled through all this, even going to get my 2 year degree for nothing. I just would like the opportunity to show someone what I can do. I had tried very hard the beginning of this year to land a job, any kind, to get some medical insurance. But since nothing happened, I made up my mind to just enjoy this summer while I still had unemployment, and look for a job once it was closer to my graduation. Today I interviewed for a part time job at the ACL lab here. It would be a perfect time to try something new, something I have been trained to do, and would add some extra money for me. But when it was over I thought about the background check. Guess I should believe that God had plans for me in all of this and let Him worry. But to be honest, that is hard to do at times. Mainly because I have no family left to fall back on. If anyone has any ideas or experience on this, please let me know. Thank ladies. Cindy",
      "MessageIndex": 0,
      "PostDate": "02/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171002",
      "Title": "Job Interview Questions"
    }
  ]
}