{
  "AuthorID": "cindycflynn",
  "AuthorURL": "https://csn.cancer.org/cindycflynn",
  "Posts": [
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "you have to deal with this. I don't have any experience with this to share with you, but wanted to let you know that I'm thinking of you and wishing you the best with this new challenge. Please keep us posted on how you're doing. (((HUGZ))) Cindy",
      "MessageIndex": 8,
      "PostDate": "19/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186179",
      "Title": "Osteoporosis diagnosis"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "after my first chemo, but I had also started using a different facial moisturizer that I'd gotten for Christmas about that time. I stopped using the new creams and just started slathering aloe on my face and it cleared up after a few days. Good luck, Cindy",
      "MessageIndex": 1,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183897",
      "Title": "ITCHY RED FACE"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I can always use more friends! Welcome!",
      "MessageIndex": 4,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182942",
      "Title": "What does the + sign mean next to all of your names?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "So glad to hear that it went so well. Get as much rest as your body tells you you need. Healing takes a lot of energy! Take care, Cindy",
      "MessageIndex": 18,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178043",
      "Title": "Tomorrow's the \"Day\" (10--21-09)"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "you can add that person as a friend. I'm not sure what adding a friend actually does for you, other than add it to your list of friends on your profile, but there it is!",
      "MessageIndex": 1,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182942",
      "Title": "What does the + sign mean next to all of your names?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "And sending prayers and positive thoughts your way. It may seem like a long road to get to the other side, but any journey can only be taken one step at a time. You're taking an important step tomorrow and you have a lot of caring companions here to cheer you on your way. Take care, Cindy",
      "MessageIndex": 4,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178043",
      "Title": "Tomorrow's the \"Day\" (10--21-09)"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "My thoughts and prayers are with sweet Carter's family at this time of loss. I know it was difficult for you to post this, but please don't ever feel bad about posting your sadness, we want to support our sisters in any way we can through the good times and the bad. Peace, Cindy",
      "MessageIndex": 11,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192114",
      "Title": "Sorry to post such bad news"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I will be praying for very successful surgeries, and a quick and easy recovery for you next week. I couldn't say it any better than Stef did, so I'll just say that I'll be there with you too, helping you make it through to the finish line. Please keep us posted on how you're doing. Hugs, Cindy",
      "MessageIndex": 2,
      "PostDate": "21/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186483",
      "Title": "surgery next wednesday"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "Although I still have hot flashes, the Effexor has reduced them to the point I can deal with them. I started out at 37.5, but had to go up to 75 for it to be effective for me. I would definitely discuss the dosage with your oncologist, but DON'T just stop taking it. From what I read there can be side effects from stopping this medication, and my Onco told me if I reach the point where I wanted to stop taking it, I should taper off before stopping. Hugs, Cindy",
      "MessageIndex": 14,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211901",
      "Title": "effexor for hot flashes"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I'm so sorry for the reason you have to be here, but glad you found this wonderful resource. You will find a very understanding and supportive group of women and med here. Of course you are scared witless. We all are, especially in the beginning. Shame on that nurse for first not giving you a way to contact someone when they were not in the office, and even moreso for scolding you when you reached out for answers and support. My guess is that she may have been scolded herself by whoever called her, but that is no excuse. I would try to talk to your doctor about your concerns. Your mental and emotional well being are just as important as your physical, and you have the right to insist on being treated with respect and caring. In the meantime, come back here as often as you need to for support, answers from those who've walked this path, and even for laughter. Hugs, Cindy",
      "MessageIndex": 1,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191509",
      "Title": "Newly diagnoised with breast cancer"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "As it started falling out, just before my second T/C cycle. I had already had it cut to a short hairstyle prior to starting chemo, but even with it short, it hurt every time I brushed it or ran my fingers through it, and of course I could pull handfuls of short hairs out every time I pulled on it. It also looked dull and seemed to have less body. I happened to be camping when it started to come out, but since we knew it was coming we had borrowed some clippers from my stepson and my hubby buzzed it on New Years day for me. It still took a while for it to be mostly bald, and I used the lint roller and had the stubble buzzed a second time before I was done with my chemo. A few hairs never fell out, but now it is starting to grow back (last chemo was 2/17). It hurt much less after I had it buzzed, so I would definitely recommend doing that. I didn't exactly throw a party since we were camping, but I realy like the idea I've seen others post about. Good luck, Cindy",
      "MessageIndex": 16,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "We can do something! And, while prayer can indeed be powerful in this case I would strongly advocate political action to go along with it for the best results. If we pray that God gives us the wisdom to do the right thing, I think this is what he would lead us to do. After all, he led us to this boards to get this information, correct? You can go to www dot house dot gov and there's a link to write your representative. It will pop up with a lookup by your location. There's a similar process to find your senator at www dot senate dot gov, or you could just search for those websites if you're more comfortable doing that. Since we all have web access, we can all do this! Usually our elected officials will actually pay attention when someone writes to them. So few people actually do it that they figure for each 1 that actually talks to them there are hundreds if not thousands of others who feel the same way!",
      "MessageIndex": 8,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182045",
      "Title": "Senate Health Care Bill Would Allow Insurers to Limit Coverage for Seriously Ill Patients"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I didn't see your post until today, but am glad you got through the night and are feeling uplifted today. Sending you hugs, Cindy",
      "MessageIndex": 17,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183388",
      "Title": "Tomorrow (tonight) is a bit tough...."
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "My diagnosis was Stage I, estrogen/progest+, HER2 neg. Had lumpectomy on 10/12 with clear margins and negative lymph nodes. I opted to have the Oncotype to help me make a decision about chemo, and my score came back at 20, which is intermediate risk. I haven't fully discussed with my oncologist (my appointment is this Friday), but I'm leaning toward getting the chemo. I'm not a big risk-taker and just want to make sure I do everything possible to only have to fight this battle once. I also posted a discussion thread about this and got some great responses. I'm sure you will as well. Everyone's risk tolerance is different, and of course the final decision is up to you. Try to clear your mind of as much chatter as possible, and then go with what feels right to you. I will be sending you positive thoughts and best wishes for ultimate success, no matter what you decide. Take care, Cindy",
      "MessageIndex": 4,
      "PostDate": "30/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180867",
      "Title": "Finding someone with similar dx"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "for both of you. I'm sure you will be a great comfort to your friend as she continues her brave fight, and you know you have so many sisters right behind you. Hugs, Cindy",
      "MessageIndex": 8,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/189015",
      "Title": "Benefit for a friend, need prayers"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I'm sending prayers and giant cyber-hugs your way. You have already had more on your plate than anyone should have to, and you just seem to keep on keeping on, but don't feel like you have to be strong for others' sake. Please talk to your doctor about taking something to help you through this difficult time. The disease and the chaos you've had in your life lately can alter the normal chemistry and balance in your body, and sometimes you need help to bring it back into balance. It is not a crutch, it is oftentimes necessary for us to just be ourselves. Girl power, Cindy",
      "MessageIndex": 12,
      "PostDate": "08/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191789",
      "Title": "back to chemo on Monday 5/10/10"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I started chemo on 12/16, and by 12/30 my hair was coming out in handfuls. I decided to have it buzzed to about 1/16\" on New Years Day, and expected to be totally bald shortly thereafter. Well, although I still have what seems like a ton of little short hairs falling off of my scalp every day, I STILL have stubble on my head. I did shave my legs last Saturday as the hair there was also thinning but not totally gone, and so far the hair doesn't seem to be growing back there. I'm thinking of just going ahead and shaving off what's left of my stubble because it's kind of irritating under my hats and scarves. Any stories or advise you have about this would be greatly appreciated. Thanks, Cindy",
      "MessageIndex": 0,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184384",
      "Title": "How long did it take for your hair to totally fall out?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "Come on down. There's always room for one more transplant! Even though we're supposed to get rain through tomorrow, but the middle of next week, it's supposed to be back up in the 80's! Start packing!!",
      "MessageIndex": 3,
      "PostDate": "13/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179749",
      "Title": "There's this funny stuff falling from the sky!!! Is the sky falling??????"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "Thanks for sharing this. I'm done with my chemo, but I will talk to my doctor to see if she thinks that taking it now might help counteract any damage that may have been done during chemo. Even if it doesn't apply to me, I'm sure many of the ladies about to start chemo might want to discuss with their doctor. Cindy",
      "MessageIndex": 1,
      "PostDate": "05/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198013",
      "Title": "milk thistle and liver function during chemo"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "And Thanks so much for posting this! After I read it and before I even replied, I did a few Sun Salutations (Yoga routine for those not familiar) and it felt great! Like Maureen and you, I've been stuck in the vicious cycle of too tired to feel like excercising even when I know that excercising will give me energy. I hope this will insipre others to do the same, and I'm really glad to hear that you're able to accept the compliments you're being given. I know it's hard to feel beautiful when we see the changes in the mirror, but your beauty does come from within, so I'm glad to hear that you're able to feel that beauty now. Take care, Cindy",
      "MessageIndex": 6,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184777",
      "Title": "Facing forward - exercising again!"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "They should not have to do that. You might try writing a letter to the hospital administrator to politely point out that their inefficiency probably costs the hospital money and certainly doesn't move you to recommend them to others. I haven't had that particular problem myself. The Cancer Center I've been going to had just put a new computerized record system in place about 4 months prior to my diagnosis. For the most part it works pretty well - my only problem has been in scheduling appointments which they still need to get some bugs out of. I think all of us want to feel like those that we're paying to take care of us are really taking care of us! (((HUGS))) Sis Cindy",
      "MessageIndex": 2,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185182",
      "Title": "Medical Records Vent"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I'm adding my prayers to those of all your other Kindred Spirits. I wish I could just wrap you in my arms and give you a huge hug right now. I've also heard really good things about Moffit, but have no direct experience. I know that you are a very brave and strong woman, and that you have what it takes to beat this thing. We are all right behind you in your fight. Hugs and Prayers, Cindy",
      "MessageIndex": 16,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210344",
      "Title": "it's back again....... in my spinal fluid"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I will also be there with you tomorrow. You are very special, and will be surrounded with love and support on your birthday/operation day. Hope you heal up quickly so you can enjoy the cake and ice cream - you don't mind if we start without you, do you? Love, Cindy",
      "MessageIndex": 2,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209961",
      "Title": "Thinking about you pinkflutterby"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "for the lucky recipient. I haven't received mine yet (hey, maybe it's me!!!), but I'm actually really enjoying the anticipation. It gives me something to really look forward to every day I come home from work!",
      "MessageIndex": 1,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180431",
      "Title": "Ornament mailed (sorry it took so long!)"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I know when my throat is sore, it feels better to have warm liquids going down rather than cold. Have you tried some herbal teas or soup? I also think the suggestion of foods with a high water content would be a good idea. I hope you feel better soon. I had that indigestion feeling also during chemo. Not fun at all, but this too shall pass - hang in there, and let us know what your doctor says. Healing Hugs, Cindy",
      "MessageIndex": 4,
      "PostDate": "05/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187419",
      "Title": "need suggestions on how to get water into my body"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "4 treatments, 1 every 3 weeks is also what I had. Mine was done after surgery as I was Stage 1 and I opted for a lumpectomy. I was very lucky to have had very few side effects. No nausea at all - just fatigue, funky mouth, and some digestive/constipation issues. I hope you will be as fortunate as I was with your chemo side effects. Take care, Cindy",
      "MessageIndex": 20,
      "PostDate": "05/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195664",
      "Title": "May I ask you, how many chemo treatments did you have altogether?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "But listen to your sister and cut it out with the housework! Save your energy for that beautiful dance with NED - you've earned it! Cindy",
      "MessageIndex": 17,
      "PostDate": "07/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187444",
      "Title": "Glad to meet you, NED"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "So glad it went smoothly (once your BP went down!) and that you're home resting up! Take care! Cindy",
      "MessageIndex": 6,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197073",
      "Title": "Vicki Sam is home, resting and recovering -- Not too bad // Exchange went well this morning at 7:30, home by 1 p.m."
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "It looks like she did post on cats_toy's \"Did I get everyone here?\" thread, and said that her first chemo is scheduled for the 6th. Not much more detail than that, but at least she's up to checking in a bit. Hopefully she'll feel up to giving us more details soon.",
      "MessageIndex": 6,
      "PostDate": "04/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191455",
      "Title": "Shout out to SUNRAE! How are you?????"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "When diagnised on Sep 3, 09. Just celebrated my 51st Bday and am getting my last round of chemo any minute now. Yea!!! Cindy",
      "MessageIndex": 27,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "When diagnised on Sep 3, 09. Just celebrated my 51st Bday and am getting my last round of chemo any minute now. Yea!!! Cindy",
      "MessageIndex": 77,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "Wishing you a day filled with rainbows (even if the weather doesn't cooperate), and of course, lots of cake and ice cream!",
      "MessageIndex": 6,
      "PostDate": "09/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185600",
      "Title": "Today is Rainbow4's Birthday!"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "For Dear Chenheart, and for all of those on this board!!! As far as terminology - How about Crab (relating to the Zodiac sign) instead of Beast? I know that hearing about yet another person hit with this makes me extremely crabby!!! Love, Cindy",
      "MessageIndex": 4,
      "PostDate": "28/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210880",
      "Title": "My Message to Chenhart"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "When diagnised on Sep 3, 09. Just celebrated my 51st Bday and am getting my last round of chemo any minute now. Yea!!! Cindy",
      "MessageIndex": 127,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I'm so sorry to read about the loss of your father. It sounds like he was a very special man in your life and I'm sure you will miss him. Know that he will always be in your heart and his love for you will never go away. I'm also sorry to hear that you had to learn these things about your husband at such a difficult time. I know you had been trying to work things out with him, but it looks like he is not committed to your marriage. My heart goes out to you, and I want to send my arms to hold you and give you even more strength than you have already shown to get through this time in your life. As sad as it is to learn about his betrayal, things might actually be easier for you being on your own. Sometimes a difficult relationship is worse than no relationship at all and we just need to learn to rely on ourselves and find the strength we never knew we had. It will get better, and we are here any time you need us to help you. Take care, Cindy",
      "MessageIndex": 17,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195452",
      "Title": "Lost my Dad June 21st"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "HAPPY BIRTHDAY SHORTSCAKE!!!!!!!!!! Hope you have a beautiful day! Mine is February 14th.",
      "MessageIndex": 41,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "Last night after I came home from school at around 10:00pm, I found a special package from Texas, and a closer look revealed that it was from Libby/Pinkflutterby! Not only did the box contain an extremely cute Pink Pig with wings holding a heart (how did you know that I was born in the Year of the Pig and that my B-day is on Valentine's Day?!?!?!?), but also a very stylish cowgirl boot from my Texas sister, AND a pink candy cane with the Susan G. Komen logo, AND a small box of chocolates, AND some Sno-Balls (malted milk balls covered in \"snow\"), AND hot cocoa mix!!!! How did you manage to find all of my favorite things???? I LOVE, LOVE, LOVE that you sent such a thoughtful collection of goodies and can't thank you enough. All of the ornaments will be placed with honor on our tree (which is being delivered on Sunday) along with the beautiful angel I received last year from MyTurnNow. I'm sad to say that I haven't sent my own ornament yet, but I WILL get it sent this weekend - Dear sister - thank you for your patience!!!! As always, thank you dear Chenheart for putting this together. This is the second year your efforts along with my sweet sisters have really made my holidays special. Love and Peace, Cindy",
      "MessageIndex": 0,
      "PostDate": "03/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/206872",
      "Title": "~~~~Thank you Sooooooo Much Pinkflutterby!!!~~~~"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "HAPPY BIRTHDAY SHORTSCAKE!!!!!!!!!! Hope you have a beautiful day! Mine is February 14th.",
      "MessageIndex": 92,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "And it hasn't been too terrible. The most difficult side effect for me has been the hot flashes. There are things you can take to help with those, including vitamin E. I do also have just a bit of bone pain, and have been taking Chondroitin and Glucosamine as well as Calcium to help minimize any bone loss. Nothing has been debilitating or even interferes with my ability to enjoy my life. Of course it is your choice, and if you're concerned you should talk to your doctor about your cocerns. Best wishes, Cindy",
      "MessageIndex": 5,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197011",
      "Title": "reoccurrences and tamoxifen?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I may be at the other end of the spectrum. For me, chemo was optional as it will only improve my chances by about 4%, but for me that was enough to make it worthwhile. It sounds like you fear for your quality of life during chemo, and that fear may be exaggerated. I was also fearful at first, but after coming to these boards and seeing how many have made it through their chemo regimens and, like Mimi, have gone on to live a beautiful life beyond cancer and beyond the treatment for it. I don't want to minimize the difficulties some have experienced, either. It has caused a great deal of difficulty for some, and some have stopped the treatment because for them it just wasn't worth it. My own experience hasn't been bad at all. I've just completed my 2nd of 4 treatments and have had minimal side effects, thankfully. I am very happy with my decision to go ahead with the chemo, but certainly wouldn't judge someone for making a different decision. I just want to agree with Mimi that your decision should be an informed one. Getting as much information about your particular cancer, your prospects, the possible side effects and what can be done to minimize them, etc. should all be explored and included as part of your decision. I know it's not an easy one, and I wish you only the best not only with your ultimate decision but with your health for the rest of your hopefully ridiculously long life. Take care, Cindy",
      "MessageIndex": 34,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/182624",
      "Title": "Has anyone out there refused chemo?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I'm no help in answering your questions, but I wanted to thank you for posting them. I meet with my Rads doctor for the first time on Tuesday, so I will be sure to ask all these questions when/before I start. And thanks to all who responded with their own experiences. It really helps to hear from those who have been in the trenches before I have to dive in myself. Hope all goes well with you in your treatment. Keep us posted on how you're doing! Take care, Cindy",
      "MessageIndex": 5,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179799",
      "Title": "Overachieving Rad Girl -- would appreciate advice from Rad Graduates!"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "Since I'm also in CA, I can't help with your information request, but I wanted to wish both you and your mother a speedy road to recovery. As I'm sure you already know, this site is a great resource. Best of luck, Cindy",
      "MessageIndex": 1,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177755",
      "Title": "Hi"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "Which may be similar to the concept of the gleason score, although I'm not familiar with what the gleason score grade is. The Oncotype DX test will give a rating indicating the chances of recurrence. This is done generally once the tumor is removed (after lumpectomy or mastectomy) and usually only in cases where the lymph nodes test as clean. If the lymph nodes already show signs of cancer, then chemotherapy is recommended regardless, so I think they don't do the Oncotype. However, if the lymph nodes are clear, the Oncotype score can give the doctors more information about what benefits chemotheraphy might bring. Second opinions are recommended in general prior to deciding on a final treatment plan, but not everyone does get them. I feel very confident in my doctors so far and am not planning to get a second opinion. I just had my lumpectomy this past Monday, and am waiting until after my surgical follow-up to meet with the Medical Oncologist who will do the Oncotype test for me (my lymph nodes were negative) and help me create a treatment plan. Good luck!",
      "MessageIndex": 7,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177755",
      "Title": "Hi"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "We miss hearing from you, but I hope that it's just because you're enjoying your life to the fullest! Wishing you a wonderful Birthday, filled with all the things you love. Cindy",
      "MessageIndex": 3,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199663",
      "Title": "Today is MarleneK's Birthday!"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I'm so sorry to read this. When I read your title, I thought your were just nearing the end of your visit to Holland this time around...sorry that I was wrong. I know that you will ultimately make the choice that is right for you and for Hans, but I also know that making that choice will not be easy in any way. Sending virtual hugs until you come back to the states and we can exchange those for real ones! Cindy",
      "MessageIndex": 13,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214141",
      "Title": "Off topic....may be my last dutch treat....sigh...."
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "You guys are making me cold just reading this! Hope you're all OK - I'm sending you sunshine and warmth from So Cal!!",
      "MessageIndex": 10,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185728",
      "Title": "SOCKED WITH SNOW......IN PHILADELPHIA"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "Since the demise of my hair, which coincided with the beginning of 2010, I've been wearing various hats and scarves to work, and usually get nice compliments on them. I do have a wig, but it's not nearly as comfortable as the hats or scarves. Well, I just learned that tomorrow the High Muckety-Mucks from our corporate HQ are going to be in town. Although all of the local folks know about my medical condition, and I don't care so much about keeping it a secret, I do want to make the right impression on these folks, some of whom I've never met. I'm thinking it will be less conspicuous to them if I wear the wig. On the other hand, since I haven't worn it yet to work, it may raise more comments just because it will be a \"new look\" for my coworkers. There's also a fair chance I may not even get the opportunity to be introduced to any of these folks and will be concerned over nothing. In case it matters, I'm the Regional HR Manager, and usually dress pretty conservatively - pantsuits or skirts with jackets. I just can't seem to make up my mind about this. I guess this is really more of a vent than anything because I know that I'm the only one that can make this decision, but just wanted to put it out there in case someone has an opinion. Thanks for listening! Cindy",
      "MessageIndex": 0,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185183",
      "Title": "To wig or not to wig?"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "all of a sudden. I've been doing really well, and today I just have been tearing up (here at work, which isn't good) and have no idea why. I'm no expert, but I'm thinking that it very well could be related to your starting on Tamoxifen since that wreaks havoc with your hormone levels, which in turn can wreak havoc with your emotions. Also if the Tamoxifen or if something else is keeping you from getting a good night's rest, it could very well make you an emotional wreck. Please call your doctor and see if there's something that could be adjusted or added to your medication to help you through this. And don't feel bad about feeling bad. Sometimes, at least for me, it makes it go away quicker if I just allow myself to have a pity party and wallow for a bit with the understanding that this, too, shall pass. (((((((HUGE CYBER HUGZ))))))) Cindy",
      "MessageIndex": 1,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184055",
      "Title": "Cry"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "So glad you have a plan in place, and I will be praying that you are cleared to proceed with your plan. Please keep us posted on how your test results come out. Take care, Cindy",
      "MessageIndex": 14,
      "PostDate": "15/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185944",
      "Title": "Finally Made My Decision Re Surgery"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "So glad you finally got some good news - just in time to ring in the new year with a big smile =:) I'll keep sending my thoughts and prayers for more good new in 2010! Cindy",
      "MessageIndex": 31,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182397",
      "Title": "If I didn't have kids . . ."
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "is still as SWEEEEEET! So happy for you and your dance partner - may the song go on forever! Congratulations!!!! Cindy",
      "MessageIndex": 11,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189598",
      "Title": "Hands off, girls -- NED is all mine today!"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "It's always good to hear about the research being done and the progress being made to battle this beast. Thanks for sharing!",
      "MessageIndex": 3,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211276",
      "Title": "New compound shows promise against chemo-resistance"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "It is hard to predict. I also got progressively more tired with each chemo and was worried about the fatigue I was expecting during rads. I worked through both, just taking 2 days off after each chemo. I actually felt my energy getting better during rads, but getting more sleepy-tired. I'm actually still feeling like I need a lot of sleep although I finished rads at the end of April. If I could have taken more time off work I would have, although being at work did take my mind off the cancer. I don't know if my experience helps you, but I wish you the best with whatever you decide. Take care, Cindy",
      "MessageIndex": 7,
      "PostDate": "05/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/197896",
      "Title": "Worried about returning to work"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I am so very sorry to hear of the loss of your dear cousin. I also have two cousins that are like sisters to me, and I can only imagine losing one of them so tragically. I just don't even know what to say... I will be thinking of you through this difficult time and sending prayers to you and all of your family. Wishing you peace, Cindy",
      "MessageIndex": 51,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I am so very sorry to hear of the loss of your dear cousin. I also have two cousins that are like sisters to me, and I can only imagine losing one of them so tragically. I just don't even know what to say... I will be thinking of you through this difficult time and sending prayers to you and all of your family. Wishing you peace, Cindy",
      "MessageIndex": 1,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    },
    {
      "AuthorID": "cindycflynn",
      "AuthorURL": "https://csn.cancer.org/cindycflynn",
      "Content": "I haven't gotten much accomplished at work today. It's a good thing it was a quiet Friday at work, and that my hubby's out of town so I have the house to myself and can just light my candle and meditate on what this all means. I was glad to read Joe's post about the funeral arrangements. Not of course for the reason for the post, but it sounded like he does have loving support around him at this unbelievably difficult time. Hugs to all, Cindy",
      "MessageIndex": 3,
      "PostDate": "14/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209843",
      "Title": "I know I am not alone."
    }
  ]
}