{
  "AuthorID": "corey50",
  "AuthorURL": "https://csn.cancer.org/corey50",
  "Posts": [
    {
      "AuthorID": "corey50",
      "AuthorURL": "https://csn.cancer.org/corey50",
      "Content": "Hi All, I was wondering what is your Dr's protocol for follow-up blood work testing? For a stage 1 breast cancer with lumpectomy, chemo and rads, how often is your dr. ordering blood work? I am actually asking this question for someone else who is concerned her dr isn't doing enough. Thanks all and continued good health and peace to you. This year was 10 years post dx for me and hve just gone to one year check ups with my onco. He has been doing blood work every 6 months for ten years and now will be once a year.",
      "MessageIndex": 0,
      "PostDate": "07/12/2015",
      "ThreadURL": "https://csn.cancer.org/node/298614",
      "Title": "follow up blood work"
    },
    {
      "AuthorID": "corey50",
      "AuthorURL": "https://csn.cancer.org/corey50",
      "Content": "I did not have tripe negative bc, so I'm not well advised in that area, but I would definitely get the advice/opinion of the three doctors who should be taking care of you. Your oncologist, obviously, but also your breast surgeon and your radiation oncologist should be able to give you some advice and input. You said you are definitely getting radiation, but if you haven't met with a radiation oncologist yet I suggest you do that and get their opinion. You are right, 1.7 mm is a tiny tumor and your dr probably just wants to spare you the side effects of chemo if you don't need it, but the decision is yours to make.  Did you have the oncotype test done? The Oncotype DX test is a genomic test that analyzes the activity of a group of genes that can affect how a cancer is likely to behave and respond to treatment. The Oncotype DX is used in two ways: to help doctors figure out a woman’s risk of early-stage, estrogen-receptor-positive breast cancer coming back (recurrence), as well as how likely she is to benefit from chemotherapy after breast cancer surgery to help doctors figure out a woman’s risk of DCIS (ductal carcinoma in situ) coming back (recurrence) and/or the risk of a new invasive cancer developing in the same breast, as well as how likely she is to benefit from radiation therapy after DCIS surgery. this would just be another piece of information for you and your dr.s to use to make a decision. Whether or not to have chemo is a very hard decision to make, but find out as much as you can, read alot.  Wishing you good health. ",
      "MessageIndex": 9,
      "PostDate": "26/03/2015",
      "ThreadURL": "https://csn.cancer.org/node/293073",
      "Title": "Newbie! Tiny 1.7 mm triple negative w/amended lymph report needs help choosing right treatment plan"
    }
  ]
}