{
  "AuthorID": "CypressCynthia",
  "AuthorURL": "https://csn.cancer.org/CypressCynthia",
  "Posts": [
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Contact your local ACS and ask about free wigs. Many local chapters distribute free wigs. Also, there are many inexpensive wigs that look pretty darn good--I know because you should see how many gals wear wigs for Mardi Gras around here. If you have insurance, it is a good possibility that a wig will be covered. My wig was covered as part of my treatment. Call and ask.",
      "MessageIndex": 8,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216750",
      "Title": "I'm going wig shopping!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Carol, my heart breaks to read your post and all that you have suffered.  It sounds like you have come to a very thoughtful decision., one that may be the very best for you.  We are all here for you!  Big hugs and prayers.",
      "MessageIndex": 9,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://csn.cancer.org/node/253564",
      "Title": "Latest MRI..."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "First, I just wanted to say that I am so very sorry that you are going through this. I know little about this type of cancer, but did find a couple of articles, which you may already have found (see below). \"Metaplastic breast cancer starts in the cells that support the breast tissue, rather than in the glandular breast tissue itself, and it behaves very differently. The treatment recommendations are based primarily on stage, because there haven't been any clinical trials specifically in women with metaplastic disease. Metaplastic disease is sometimes less sensitive to commonly used breast cancer therapies, but may be more sensitive to chemotherapies that are more commonly used for lung cancer or other cancers that have a similar squamous cell appearance. Unfortunately with more rare tumors, it's always difficult to do focused studies to be able to provide patients with clear information to guide their decisions.\"http://www.breastcancer.org/research-news/ask_expert/12_2009/q24 \"What Are the Treatments for Metaplastic Squamous Cell Breast Cancer? Print Sep 2, 2010 | By Louise Tremblay Louise Tremblay recently finished an M.Sc. in molecular and cellular biology in Ontario, Canada, with years of cancer research experience. She has experience writing articles and Web content on science, heath and fitness, diet and personal wellness. Metaplastic squamous cell breast cancer is an exceedingly rare form of the disease, accounting for less than 0.1 percent of breast cancer cases, according to a study published in the journal Onkologie in 2007. Cells in a metaplastic squamous cell carcinoma of the breast have a flattened squamous shape, which is used to help diagnose the disease. This form of cancer is generally aggressive and often fails to respond to hormone-based therapies, but it may respond to other cancer treatments. Mastectomy The primary treatment for metaplastic squamous cell carcinoma of the breast is a mastectomy, a breast-removing surgery. Since metaplastic squamous cancer cells are typically invasive and aggressive, surgeons often perform aggressive surgeries to fight the cancer. During a mastectomy, the surgeons excise the metaplastic squamous tumor along with any remaining breast tissue, the breast skin and nipple, and layers of chest muscle underneath the cancerous breast. The doctors also remove a series of small structures called lymph nodes, since invasive breast cancers often invade lymph nodes around the breast. Following surgery, patients with metastatic squamous cell breast cancer may receive additional cancer treatments. Adjuvant Chemotherapy Many breast cancer patients with metaplastic squamous cell carcinoma receive adjuvant chemotherapy--drug therapy designed to kill cancer cells and shrink breast tumors. Chemotherapy drugs are designed to inhibit normal processes in the cell as well as damage essential cellular structures, essentially damaging the cancer cell and preventing it from making the chemicals it needs to survive. Patients with metaplastic squamous cell breast cancer may receive a number of chemotherapy treatments, either alone or in combination, depending on the aggressiveness and characteristics of the tumor. The use of adjuvant chemotherapy can lead to a number of side effects, such as nausea, fatigue and hair loss, though these effects subside after cessation of treatment. Targeted Therapy Some patients with metaplastic squamous cell breast cancer may receive targeted therapies--drugs that identify and kill cancer cells by targeting proteins found on the cells' surface. A study published in the Journal of Clinical Oncology in 2005 indicates that many patients with metaplastic squamous cell breast cancer have tumors containing a protein called epidermal growth factor receptor, or EGFR. Under normal conditions, EGFR aids in cell growth by promoting cell division. Some metaplastic squamous cell breast cancers begin to overproduce the EGFR protein, causing constant cell proliferation and driving cancer growth. Drugs that target EGFR, such as ZD1839, can therefore target and kill metaplastic squamous cell cancers in some cases. Patients looking to receive targeted therapies must first undergo medical testing to assess whether their cancer will likely respond to specific drugs. References Onkologie: BRCA1 Germline Mutation in a Woman with Metaplastic Squamous Cell Breast Cancer Journal of Clinical Oncology: Squamous Cell Carcinoma of the Breast Breast Cancer Research and Treatment: The Role of EGFR-Directed Therapy in the Treatment of Breast Cancer Read more: http://www.livestrong.com/article/218925-what-are-the-treatments-for-metaplastic-squamous-cell-breast-cancer/#ixzz2BsULxtmI\" http://www.livestrong.com/article/218925-what-are-the-treatments-for-metaplastic-squamous-cell-breast-cancer/",
      "MessageIndex": 1,
      "PostDate": "10/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/249762",
      "Title": "."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Ok, now I am a little nervous.  My markers doubled and my liver enzymes and alk phos are elevated.  Cardiologist NP just called to tell me to stop statin, but she wanted me also to know that alk phos is not usually elevated with statins.  I see my oncologist on Tuesday and, of course, Danny is out of town then. Katherine is coming with me to oncologist, but I kind of hate to burden her right now so have very mixed feelings.  You see she became engaged last night!  At least we have a wedding to plan to keep me distracted.  ",
      "MessageIndex": 0,
      "PostDate": "20/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254818",
      "Title": "Pink Bus on Tuesday"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I would do all 6 too, because I like to fight!  Sometimes less is more, but this disease is so treacherous! Fun was a terrible word to use.  However, stupid words sometimes spring out of my mouth...Lol.  I hope he meant to say that reconstruction can be a positive.  Not for everyone, but, for me, it was a relief not to have to fool with a swimming prosthesis, etc. and I do appreciate having breasts even though the nipples and breast are not perfect.  Maybe it was being 33, but I was glad to have that option.  I couldn't do implants because the plastic surgeon said there was not enough left (large tumor) for an implant to be cosmetic. Keep fighting!",
      "MessageIndex": 16,
      "PostDate": "30/06/2013",
      "ThreadURL": "https://csn.cancer.org/node/260338",
      "Title": "Opinions please"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "So very sad - a tragic loss.  Prayers for Carrie and her entire family.  She will be missed.",
      "MessageIndex": 5,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://csn.cancer.org/node/281418",
      "Title": "Rest in Peace Dear carriesoup"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "It does help many, but it didn't work for me and my awful nausea. Taking nausea meds every day I had chemo finally did the trick.",
      "MessageIndex": 11,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203123",
      "Title": "Medical MJ"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You and your family and especially Troy are in my thoughts and prayers this am. Check your messages as I have pm'd you.",
      "MessageIndex": 0,
      "PostDate": "07/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200347",
      "Title": "For natly15"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "OK, like I don't have enough going on.... Yesterday before leaving. I managed to catch a black and white cat who has been hanging around in my yard for a couple of months. I thought he belonged to someone but he looks identical to my black and white cat-a stray who is probably related. Anyway I took new kitty to my vet, left him my credit card, and boarded the train. Vet called back and said kitty was feline leukemia and fiv free. We just named him Amtrak. He is getting neutered and shots today. ;-)",
      "MessageIndex": 0,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224703",
      "Title": "Amtrak"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Just to balance it out, I took tamoxifen for 7 years and never had any uterine problems. In fact, somehow I still have my uterus. Lol, how did that happen! My gyn is very nervous about my female parts, but I am not. My family has this incredibly weird history of tons of breast and colon cancer, but no ovarian or uterine cancer. Geez, I hope I didn't just jinx myself ;-). BTW, I see my gyn tomorrow-ugh. He insists that I see him every year. He is a nervous Nellie about me. I don't really want to see him so much, but he is the kindest doctor I have. He is the one who came to my home and started an IV and gave me fluids when I was sick with the GI infection this year. I'm taking him Christmas cookies in an LSU tin tomorrow to stay on his good side.",
      "MessageIndex": 4,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/250834",
      "Title": "Question about TAMOXIFEN - Anyone knows research info?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Awesome! So glad that the meds are doing their job :-). As Claudia says, \"We do what we have to do, so we can do what we want to do.\" Hang in there!",
      "MessageIndex": 1,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/250616",
      "Title": "Progress and a question on side effects"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "The Kindred Spirits strike again...lol. It was so much fun to be a part of this and Aysemari was an angel to organize and send everything. I am glad that you liked the blanket--please know that it was made with love and admiration especially for you.",
      "MessageIndex": 1,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210287",
      "Title": "A big Thank You!!!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Big prayers heading west. Please be safe and let us know how you are doing",
      "MessageIndex": 5,
      "PostDate": "06/09/2012",
      "ThreadURL": "https://csn.cancer.org/node/246015",
      "Title": "Praying that all of the pink sisters in California are safe from the fires"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I also had to have a mastectomy because my tumor was large and my breast was small. I later had reconstruction because it did bother me (many women are not bothered). I was just 33 at the time. Years after the first mastectomy, I had a second preventive one because 2 of 3 sisters had subsequently also been diagnosed. I would have reconstruction again as I just feel better in a swimsuit, etc. I had the surgeries using my own tissue rather than the implants as my younger sister had so many problems with her implants that I figured I would too. My younger sis and I were tested for BRCA and were negative. My doc says this is not uncommon as they have not yet to identify every gene that is involved in heriditary type of cancers. It is not uncommon for those of us who have a strong family hx to test negative for BRCA. My doc is sure that ours is inherited (generations riddled with breast and colon cancer), but we may never know the gene involved.",
      "MessageIndex": 21,
      "PostDate": "14/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203151",
      "Title": "Mastectomy is my only option"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "P.S. In terms of avoiding a med that will affect her liver, I would avoid any pain med with acetaminophen (tylenol).  There is a pain med called vicoprofen, which is hydrocodone and ibuprofen (advil).  Most drugs are processed by the liver at least somewhat, so I would definitely ask her doc about this question.  Tylenol is a big no no for liver problems.  Hope this helps!",
      "MessageIndex": 4,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://csn.cancer.org/node/264243",
      "Title": "Best pain management med?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Marijuana can change pain perceptions and help to make pain more bearable, however, marijuana does not block pain pathways to eliminate (or nearly eliminate pain).  Marijuana can have side effects such as headache, sinus problems (if smoked), paranoia, mental fog, etc.  First law of pharmacology is EVERY drug has a side effect.  If marijuana helps, use it, but we are all so different. Re marijuana: http://www.medicalnewstoday.com/articles/254454.php The gold standard for pain remains opioids.  They do indeed have side effects.  The most common are nausea, fatigue and constipation.  Taking them with meals can help with nausea, but I battle nausea with nearly everything.  The chart below describes the relative strengths of different opioids.  Oral morphine is the reference drug and ascribed a \"1\" rating.  Every other opioid is then compared to it.  For example, IV morphine is assigned a \"3\" because it is 3 X stronger than oral morphine and fentanyl is assigned a \"50-100\" (depending on dose) because it is 50-100 X stronger than oral morphine.  I hope this makes sense and helps.  If not, feel free to pm me. See chart: http://en.wikipedia.org/wiki/Equianalgesic Part of why I have made it so long (nearly 27 years, 8 with Stage 4), I believe, is that I try and puzzle out what will work for my side effects.  I do not stop therapy if at all possible, because I am very, very stubborn about fighting cancer.  For me, cancer is the enemy, not the treatment.  This is not always easy.  And what works for me may do nothing for you.  We are all so biologically and chemically unique.  ",
      "MessageIndex": 3,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://csn.cancer.org/node/264243",
      "Title": "Best pain management med?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Wonderful!!  Please tell her welcome from me.  I am an NP who has been in nursing since 1980 and I still love it.  Welcome aboard--we need good nurses!",
      "MessageIndex": 9,
      "PostDate": "21/04/2013",
      "ThreadURL": "https://csn.cancer.org/node/257918",
      "Title": "GOOD NEWS!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Happy Birthday!!!!",
      "MessageIndex": 1,
      "PostDate": "02/06/2013",
      "ThreadURL": "https://csn.cancer.org/node/259691",
      "Title": "NewFlower's Birthday"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "In my new photo, you get to meet me and my 3 sisters. I have glasses. The sister who is 3rd from the left and next to me is the only one who had not had breast cancer. She just finished 5 yrs of preventive aromasin.",
      "MessageIndex": 0,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200051",
      "Title": "Sisters"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thomas, my heart is so sad for you. Hospice can be a real rock to lean on and a wealth of knowledge. Keep Lesley as comfortable as you can and you will know when the time is right for the kids to visit. I hope that my husband is never faced with what you are facing, but if he is, I hope he can be as brave and caring as you are.",
      "MessageIndex": 11,
      "PostDate": "10/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202960",
      "Title": "Lesley is home"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I know Meena1 has IBC and there are many others here. Where are you ladies?",
      "MessageIndex": 2,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201760",
      "Title": "IBC (Inflammatory Breast Cancer)"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Chen, that is awesome news!!! Now, go and celebrate Memorial Day. In my house, we never pay attention to dates, but celebrate the holidays when they fit into our healthcare schedules. Katherine has never known the concept of a holiday occurring on that actual date. So, try it!!! Congrats!",
      "MessageIndex": 8,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219583",
      "Title": "Two Kindred Spirits need the Magic Pink Bus and our Prayers for appointments on Wednesday and Thursday"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I love your advice. Cake yum! I am beyond jealous--now I can just taste cake--maybe wedding cake or chocolate or doberge??? Cake yum!",
      "MessageIndex": 14,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202903",
      "Title": "Please just LET IT GO..Thanks"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Monday is surgery day for KathiM's sister. All aboard; bus is gassed and I've got cafe au lait and beignets. I get a window seat this go round. Who can join me?",
      "MessageIndex": 0,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233588",
      "Title": "Pink Bus Requested for KathiM's Sister-Monday"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Push over girls, I'm all in. Remember that I'm bringing beignets (no blowing powdered sugar on each other) and lots and lots of good wishes!",
      "MessageIndex": 28,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219583",
      "Title": "Two Kindred Spirits need the Magic Pink Bus and our Prayers for appointments on Wednesday and Thursday"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so very sorry for the loss of your precious angel. She sounds as if she were an angel--so loving and devoted! I know that you will miss her.",
      "MessageIndex": 101,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Molly, you might also try sending a certified letter asap. If you get no result, you might also try talking with an attorney. This just sucks and I hate that you are having to go through both cancer and then having to deal with insurance idiocy also. Hugs and prayers coming your way. Good luck and keep us posted.",
      "MessageIndex": 4,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230315",
      "Title": "Xeloda approval delayed by BC/BS"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Great idea! Why didn't I think of that New Flower?",
      "MessageIndex": 6,
      "PostDate": "14/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230315",
      "Title": "Xeloda approval delayed by BC/BS"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I had no trouble with radiation 23 yrs ago. Last year I had just a little queasiness and my rad onc said that was because he had to zap a little bit of my liver to get my ribs. But it was nothing terrible. I'm so happy it is going well for you too! You are in my thoughts and prayers.",
      "MessageIndex": 17,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203542",
      "Title": "Cyberknife was a BREEZE!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so very sorry for the loss of your precious angel. She sounds as if she were an angel--so loving and devoted! I know that you will miss her.",
      "MessageIndex": 50,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I have having abdominal MRI tomorrow to check the liver mets.  Keep fingers crossed!",
      "MessageIndex": 0,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://csn.cancer.org/node/263567",
      "Title": "Pink Bus Please"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "My oncologist told me I would gain weight and he said that I could gain as much as 40 lbs. I didn't, but I did gain about 10-15 lbs. The good news is that I did lose the weight when I stopped the drug and the best news is that I am still alive when, back in 1987, they told me that my prognosis was not good. :-) All because of the wonder drug tamoxifen! I think it really helped that he warned me because it made me be more careful and, although I was more tired on tamoxifen, I tried to be more active.",
      "MessageIndex": 19,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/208086",
      "Title": "Tamoxifen and weight gain"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You are truly an inspiration and I am so happy that it went well. You are in my thoughts and prayers.",
      "MessageIndex": 42,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203542",
      "Title": "Cyberknife was a BREEZE!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I have had numerous PET/CT scans and, after 26 years, it is the least of my worries.  The PET/CT scans have been very helpful in getting a diagnosis.  Most recently, the PET showed the liver mets clearly and then I had biopsy which confirmed diagnosis. If I can skip a PET/CT (I am aware of the radiation dosage) I do, but the last one I had before this year was 2010 and I can't help but wonder, if I had had another in 2011 or 2012, would it have shown mets earlier? Good fortune and a strict adherence to treatment has kept me alive this long.  Don't ever forget who the enemy really is (CANCER).",
      "MessageIndex": 3,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://csn.cancer.org/node/260316",
      "Title": "CT Scan or not?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am feeling very blessed to me in remission right now and our Christmas present to each other...we are all going to Disney World in February!!!",
      "MessageIndex": 9,
      "PostDate": "23/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232658",
      "Title": "We need some really good news today!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I love your advice. Cake yum! I am beyond jealous--now I can just taste cake--maybe wedding cake or chocolate or doberge??? Cake yum!",
      "MessageIndex": 60,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202903",
      "Title": "Please just LET IT GO..Thanks"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Crying is normal and should gradually subside.  Just remember that, if it doesn't or if you are overwhelmed, talk with your oncologist.  Depression/anxiety is more common in cancer survivors and your onc will know this.  Many of us take something to cope--for me 1/2 dose of the lowest lexapro keeps my tears dried up and my anxiety under control.  Do talk with your oncologist before taking anything for depression/anxiety because some drugs are not compatible with our treatments. Some links: http://psychcentral.com/blog/archives/2012/01/04/when-cancer-patients-also-grapple-with-depression/ http://www.cancer.org/acs/groups/cid/documents/webcontent/002816-pdf.pdf",
      "MessageIndex": 6,
      "PostDate": "09/01/2013",
      "ThreadURL": "https://csn.cancer.org/node/252568",
      "Title": "When does the crying stop"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Nancy, I am so sorry that you are going through this. You are so incredibly brave! I know that your participation, however brief, will help us all further down the road and I thank you for it. Praying that your new treatment plan will work and make you mor comfortable too.",
      "MessageIndex": 1,
      "PostDate": "03/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/223765",
      "Title": "The new plan...I flunked out of the clinical trial....lol"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I believe that noone knows your body as well as you do. In 2005, after Katrina, I broke 3-4 ribs moving boxes. I was very concerned and knew that I had not done enough to warrant the ribs breaking. In 2008, as the rib pain persisted, I remember telling my physician that it felt like I had \"an alien in my chest\" trying to push out. I insisted something was very wrong. He told me that he really didn't see how it could be cancer as my CT, etc hadn't changed that much. In 2009, I presented to the ER with shortness of breath and severe rib pain. This time the bone scan came back: + bone mets. A biopsy confirmed what I already knew--that after a 22 year remission my breast cancer had spread to my ribs.",
      "MessageIndex": 11,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/193211",
      "Title": "wrong diagnosis"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Sending healing thoughts and prayers.  Decreasing liver lesions sounds great!  Here's hoping CT in October has knocked out bones too!",
      "MessageIndex": 5,
      "PostDate": "31/08/2014",
      "ThreadURL": "https://csn.cancer.org/node/287112",
      "Title": "Updated Test Results"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so sorry Debbie that you are going through this again. Please know that you are in my thoughts and prayers. And you point out something so important: we should trust our instincts. I began to have rib pain in 2005, but it took me until a rib biopsy in 2009 before I got the diagnosis of bone mets and then everyone finally began listening to me. We do have to be proactive. When I complained about rib pain, I was told that, because I had had fractures, I would have pain forever. I even remember telling my physician that it felt like I had an alien trying to push out of my rib cage and was told \"I don't know what kind of cancer metastasis would be so stable looking on PET scans.\" Long story, but I was right and they were wrong. Ladies, if you think something is really wrong, keep pushing for answers. Thank you Debbie, because you may have helped save lives with your story!",
      "MessageIndex": 4,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Yes. I think we all woke up to many winged angels this morning and most of them are on our very own message board. Merry Christmas to all!",
      "MessageIndex": 1,
      "PostDate": "25/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208462",
      "Title": "\"Every time you hear a bell ring, an angel gets it's wings\""
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thank you for this.",
      "MessageIndex": 7,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/227180",
      "Title": "Pinkflutterby's (Libby's) Obituary"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I don't know what, if any, other symptoms you are having, so it is impossible to diagnose here. It could be almost anything, but I am also worried about your kidneys. If you continue with the flank pain, especially if accompanied by other symptoms such as fever and urinary frequency (see link below), you should see a health care provider. Kidney infections can lead to life-threatening complications. See: http://www.webmd.com/a-to-z-guides/kidney-infections-symptoms-and-treatments",
      "MessageIndex": 16,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194229",
      "Title": "Flank pain...."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so sorry Debbie that you are going through this again. Please know that you are in my thoughts and prayers. And you point out something so important: we should trust our instincts. I began to have rib pain in 2005, but it took me until a rib biopsy in 2009 before I got the diagnosis of bone mets and then everyone finally began listening to me. We do have to be proactive. When I complained about rib pain, I was told that, because I had had fractures, I would have pain forever. I even remember telling my physician that it felt like I had an alien trying to push out of my rib cage and was told \"I don't know what kind of cancer metastasis would be so stable looking on PET scans.\" Long story, but I was right and they were wrong. Ladies, if you think something is really wrong, keep pushing for answers. Thank you Debbie, because you may have helped save lives with your story!",
      "MessageIndex": 54,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I had pain for about six weeks to 2 months. The pain was not continual. if you are having terrible pain all day long, please call your physician, but, if your pain is very slowly getting better, it may be normal. Mostly, for me, the pain was bad at night or when I was very active. I do remember taking a pain med in the evening for quite awhile, but mostly able to get by with advil during the day. Pain 101 (this is from nursing school); As Linda pointed out, you heal faster if you move more. Take your pain med (prescription or advil or tylenol), wait about 15-20 min and then get up and take a walk (not a marathon though). Pain meds work best on mild to moderate pain, so do not wait until your pain is severe to take something. If you do, it is very hard to manage your pain and you will end up taking more meds with a less effective result. You have to anticipate pain too. For example, if you know you are going to do an activity that may cause pain, take something ahead of time. Pain is worse at night (probably related to prostaglandin levels). Pain meds are prescribed not just to make you comfortable; they are prescribed because they make you more active and acivity=healing faster. Contact Reach to Recovery (with you surgeon's ok, of course). They will send out a trained person who teaches you very mild but effective exercises (such as climbing your fingers up a wall) that promote healing and do help with pain. They helped me sooo much! If you call your local ACS, they can put you in contact with a volunteer. http://www.cancer.org/treatment/supportprogramsservices/reach-to-recovery I believe that, with your described history, you will need folow up and your oncologist can do this. Some surgeons will follow you for awhile, but your oncologist would be the one to order scans and tests to monitor your progress.",
      "MessageIndex": 3,
      "PostDate": "03/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/250849",
      "Title": "How long does the pain last after a mastectomy?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I believe in you and I think that you are the best judge of all of your body. When I had the rib fractures and pain in 2005, I pressed for a diagnosis. Not that I wanted it to be a recurrence, but I had that feeling. In 2009, after a bout with pneumonia, I finally had a biopsy and a diagnosis: bone mets. My pain in the ribs felt like an alien in there trying to push out. So, if this persists and you are worried, please get it checked. We all want you well and are praying that you are!",
      "MessageIndex": 17,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194229",
      "Title": "Flank pain...."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "My heart is broken.  Chen is such an amazing spirit.  I hate this freakin' disease so much! ",
      "MessageIndex": 9,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://csn.cancer.org/node/261005",
      "Title": "Chenheart -- Any word, or updates?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I was apprehensive but I am so glad that I went. Seeing people of every age struggling to make that lap was one of the most moving and inspiring things that I have ever seen. There was a tiny girl (about 3 or 4) struggling in a walker and teenagers with friends helping them around. It was hard not to cry but very cathartic somehow. My husband and daughter walked proudly in the caregiver lap and I was so proud. Geez, you have me crying all over again. Just do it--it will all be good!",
      "MessageIndex": 59,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196042",
      "Title": "Going To My First RELAY FOR LIFE --- My UPDATE On How It Went! :)))))"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Glad you got it safe and sound.  The butterfly really has come to symbolize hope for me and I had to share. :-)",
      "MessageIndex": 1,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://csn.cancer.org/node/265009",
      "Title": "Beautiful butterfly ornament for my tree!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thank you!",
      "MessageIndex": 7,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/219495",
      "Title": "National Cancer Survivor’s Day"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I was apprehensive but I am so glad that I went. Seeing people of every age struggling to make that lap was one of the most moving and inspiring things that I have ever seen. There was a tiny girl (about 3 or 4) struggling in a walker and teenagers with friends helping them around. It was hard not to cry but very cathartic somehow. My husband and daughter walked proudly in the caregiver lap and I was so proud. Geez, you have me crying all over again. Just do it--it will all be good!",
      "MessageIndex": 27,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196042",
      "Title": "Going To My First RELAY FOR LIFE --- My UPDATE On How It Went! :)))))"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "So very true. And I will pass this on to Danny, a mechanical engineer, who worked on the space shuttle fuel tank for 30 years. :-) He'll be all puffed up!",
      "MessageIndex": 5,
      "PostDate": "09/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213699",
      "Title": "Discovery and Space Station"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "My \"baby\" sister, Wendy, is flying here tomorrow from San Diego. We are staying in the French Quarter for a few days. Some of you got to meet her when I was in San Diego. She is a IDC survivor too. I am looking forward to visiting and playing tourist :-)",
      "MessageIndex": 0,
      "PostDate": "21/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221063",
      "Title": "OT: Wendy is coming to town!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thank you for this Ritzy. We are definitely a community--one that is now such an important part of my life. A community of unique voices but a community in which all share in protecting, encouraging, strengthening, educating each other--and also grieving with each other. I am proud to be a small part of such an amazing group!",
      "MessageIndex": 13,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thank you for this Ritzy. We are definitely a community--one that is now such an important part of my life. A community of unique voices but a community in which all share in protecting, encouraging, strengthening, educating each other--and also grieving with each other. I am proud to be a small part of such an amazing group!",
      "MessageIndex": 61,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I had one relative who would burst into tears every time she saw me. I finally had to tell her that I was fighting for my life but I was going to get better and I needed to be surrounded by positive people. She then became like my cheerleader, but I could handle that much easier. I think it's ok to say you don't want drama if you don't. I prefer laughter and positive thoughts, but everyone is different so you need to let people know what helps you.",
      "MessageIndex": 19,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179329",
      "Title": "Rookie could use some advice"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "If the coating persists, I would see an ENT or dermatologist. This could be an infection--either bacterial, fungal or viral and you will need a swab to determine exactly what it is. Chemo can cause dry mouth which makes your tongue more susceptible to infection. Here are some suggestions for combatting this (from http://www.chemocare.com/managing/dry_mouth.asp): \"Keep mouth and lips moist: •Rinse mouth with water frequently (every 2 hrs while awake & when awake during the night). May add salt or baking soda (1/2 to 1 teaspoon in 8 ounces of water). •Use saliva substitute (commercially available). •Biotene® products can be purchased without a prescription. Products available for treating dry mouth are; mouthwash, toothpaste, as well as, chewing gum that has the pH of saliva. •Oralbalance® moisturizing gel can be applied to the mouth or tongue and acts as a moisturizing coat. •Apply lip moisturizer often (i.e. Chapstick®). •Suck on tart hard candies (lemon drops, Jolly Ranchers®). Watch sugar content with candy - can produce cavities. •Use cool mist room humidifier at night in the bedroom. A humidifier on the furnace doesn't provide enough humidity for treating dry mouth. Keep mouth & teeth clean •Use soft-bristle toothbrush (can soften even more by placing brush in very warm water), cotton swabs, mouth swabs (popsicle stick covered with gauze) to clean teeth after each meal and at bedtime. (3 or more times a day). •Clean dentures and/or bridge after eating. Leave out dentures if experiencing any discomfort caused by xerostomia. •Floss gently with unwaxed floss (if platelet count not too low). •May use Water-Pik® •Avoid mouthwashes with alcohol base. Use non-alcohol based mouthwashes. •Avoid lemon glycerin swabs - contribute to dryness. Increase fluids: •Drink plenty of liquids at least 8-12 glasses of fluid a day, unless advised not to by your doctor. This helps to thin and loosen mucous. •Carry a water bottle with you and sip frequently during the day to help alleviate dry mouth. •Limit coffee, tea and alcohol. These contribute to dry mouth. Caffeine products as coffee, tea and colas act as diuretics. •Try Ovaltine® and Postum® drinks - each has calories and vitamins - as a substitute for tea and coffee. Diet: •Eat a soft, high protein moist diet. •Substitute moist fish, eggs, cheese for red meat. •Serve food lukewarm, hot food can burn mouth. •Avoid dry foods (bread, dry meat, pastries, toast and crackers, snack foods that are dry and salty). •Soak bread and or rolls in milk or sauces. •Eat moistened casseroles and meats with gravies, sauces, soups, stews. •Use sour cream, and half & half cream as sauce bases (adds calories). •Avoid citric foods, juices such as tomato, orange, grapefruit based products and sauces. •Blenderize food and drink. •Yogurt, fresh fruit, powdered milk •Fruit slushies •Milk shakes with or without fresh fruit. •Avoid sodas that are fizzy. May try letting the soda go flat and then drink. •Milk is high in protein but may produce thick saliva. If this is true for you try soy or rice milk. If dry mouth is due to infection, medications for treating the infection may be prescribed such as: •Antifungals: nystatin,clotrimizole, fluconozole •Antibacterials: Mouthwash antiseptic, rinses are the basis of the oral decontamination regimen. •Antivirals: acyclovir (Zovirax®) or famciclovir (Famvir®) When to call your doctor or healthcare professional: •Temperature greater than 100.5 F (38 C). •Nausea (interferes with ability to eat and unrelieved with prescribed medication). •Vomiting (vomiting more than 4-5 times in a 24 hour period). •Diarrhea (4-6 episodes in a 24-hour period). •Unable to eat or drink for 24 hours or have signs of dehydration: tiredness, thirst, dry mouth, dark and decrease amount of urine, or dizziness. •Pain or any sign of infection (such as heavily coated tongue).\"",
      "MessageIndex": 6,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210676",
      "Title": "don't mean to be gross, but has anyone's tongue turned orange?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Switched to the sancuso patch yesterday and woke this AM vomiting with a migraine.  Not what I had hoped! Ended running over to the cancer center for another shot of neupogen, IV fluids and ativan.  Back to taking zofran every 8 hrs.  Feeling better tonight and hoping to get a handle on this!",
      "MessageIndex": 0,
      "PostDate": "14/05/2013",
      "ThreadURL": "https://csn.cancer.org/node/258933",
      "Title": "Switched to the sancuso patch yesterday and woke this AM vomiting with a migraine."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Prayers and hugs!  I'll be there, holding your hand.  Let us know how you are.",
      "MessageIndex": 3,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://csn.cancer.org/node/264469",
      "Title": "I finally have a date for my second mastectomy with reconstruction"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "It takes time to heal and I am so sorry about the necrotic area--hopefully it will heal soon. Just FYI, for others, my sister just had a bilateral and she was given a velcro drain holder by Virginia Mason in Seattle.  Here is an example of such a device: http://www.tlcdirect.org/Post-Surgical-Drain-Belt-with-Pockets.html When I had my mastectomies (1987 and 1997), I had to tape and tuck...Lol. Sending hugs and prayers!",
      "MessageIndex": 2,
      "PostDate": "13/07/2013",
      "ThreadURL": "https://csn.cancer.org/node/260951",
      "Title": "Double mastectomy DIEP reconstruction June 25"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I love that! My dessert stomach is empty too. Can I have a separate stomach for chocolate? Or does that have to be all crowded in there with desserts ;-)",
      "MessageIndex": 19,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211402",
      "Title": "the funny things kids say..."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I'm in Louisiana, but I might be able to swing Florida--just need to know dates as soon as you can. My work schedule comes out months in advance, but, with enough notice, I may be able to request off. Would love to meet everyone if non-Floridians are invited? :-)",
      "MessageIndex": 17,
      "PostDate": "20/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/239977",
      "Title": "Florida"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Decadron keeps me up too. And makes me eat like a starving person and pee like a horse. It hypes me up. Ask if there is something you can take to help you sleep. Luckily, it doesn't make me nervous--just hyper and unable to sleep. I use the extra energy to clean a closet or read a book.",
      "MessageIndex": 2,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208110",
      "Title": "Finished 4 rds AC Starting 4 rds Taxol Worried about mega dose of Decadron"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Oh Mama G, I am so, so sorry to hear this. I have a link below about spinal fluid metastasis, but I have never experienced it myself. Please know that you are in my thoughts and prayers. Metastatic Tumors to the Brain and Spine",
      "MessageIndex": 23,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210344",
      "Title": "it's back again....... in my spinal fluid"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "So very happy for you! This is great news!",
      "MessageIndex": 23,
      "PostDate": "26/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212900",
      "Title": "I have been deported!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Meena, I have really been thinking about you lately. Please think about talking with your oncologist if you are too down. Remember that, as Elizabeth Edwards so eloquently said, each of us will die--it is how we live that is important. You are in my thoughts and prayers and please keep in touch!",
      "MessageIndex": 13,
      "PostDate": "08/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/207165",
      "Title": "RIP Elizabeth Edwards"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so very sorry for your loss. Cancer is a beast and I hate what it does to both patients and families. It sounds like you sister in law was a special lady. But I am confused about a stent? Do you mean an IV or a nasogastric tube? I would want an IV as IV pain meds can really help with pain. Food and IV fluids do not usually help with end-of-life care. In fact, they often make a patient much less comfortable. IV fluids can go straight to the patient's lungs and cause difficulty breathing (pulmonary edema). Appetite disappears near the end of life and nutrition can cause nausea and vomiting. Ice chips, lemon swabs for dry lips, etc may be more humane options. Here is an excellent link for families: Comfort Care http://continuumcarehospice.com/documents/Hospice%20Care%20Pamphlet.pdf When my husband's grandmother was dying, the doctors did \"everything\" and the result was disastrous. She ended up with a surgical wound and infection that never healed (won't go into it but truly gruesome); every breath was a rattle and gasp, etc. Her daughter, my husband's aunt, researched end-of-life care and, when she was dying years later from cancer, she died a truly beautiful death. She worked closely with hospice to let them know what she wanted and they titrated her meds in her own home to keep her comfortable. We visited her the day before she died and it was an amazing experience. The moral of the story for me is to be prepared, make your wishes known, put them in writing, and, if possible, die in the comfort of your own home. P.S. I have Stage 4 cancer, so you can tell I have thought about this a lot. I have a \"Five Wishes\" form which carefully describes what I want. My hospital gave me the form, but they can also be ordered on line: http://www.agingwithdignity.org/catalog/",
      "MessageIndex": 3,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/245624",
      "Title": "Palliative care, kill or cure?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Oh, I hate this disease soooo much and I hate that Claudia is suffering .  Her spirit and sense of humor have so inspired me.  I am praying that she turns this corner, begins to respond and feel better.  Sending healing (((hugs))) and prayers!",
      "MessageIndex": 77,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Yes, great job! It has been such fun and I enjoy reading everyone's responses. Merry Christmas all!",
      "MessageIndex": 6,
      "PostDate": "24/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232701",
      "Title": "Thank you Jean.."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "That sounds great! In 1987, faced with Stage 3A and, back then, a grim prognosis, I made the decision, after finding an oncologist who is brilliant (but a little House-like), to trust my onc and fight with everything that I had. He had trained extensively and I was just learning about my diagnosis. Many of his decisions were controversial at the time. He recommended tamoxifen for a premenopausal woman--not normally done back in 1987. I didn't argue, I did it. Now, here I am 24 years later and his expertise and my fighting spirit got me this far. And, even though I had a setback in 2009 (bone mets after a remission of 22 years), I am still functional and fighting. My recommendation, fight the beast with all that you've got!",
      "MessageIndex": 5,
      "PostDate": "30/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/215253",
      "Title": "I have decided to give this everything I've got!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "This sucks so bad!!!  I just want to hit something, so I can imagine how you must feel.  I am so very sorry!  Keep fighting my fellow longterm survivor!  I know ou will find something!!!!  Big (((hugs))) and lots of prayers!!!  ",
      "MessageIndex": 2,
      "PostDate": "10/04/2014",
      "ThreadURL": "https://csn.cancer.org/node/270588",
      "Title": "Taxol Failed ..."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Oh, I hate this disease soooo much and I hate that Claudia is suffering .  Her spirit and sense of humor have so inspired me.  I am praying that she turns this corner, begins to respond and feel better.  Sending healing (((hugs))) and prayers!",
      "MessageIndex": 30,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Linda, there are few people who I say this about that I really, truly mean it about--I just love everything about you! You have handled your illness with such grace and dignity. You are so wise and so amazing. And you often make me laugh out loud to boot. If I can do anything to help, please PM me. And give your wonderful family a hug from me (and I know they must be wonderful if you love them). I know you are a fighter and I am praying that the Xeloda kicks your cancer to the curb! When I had chemo years ago, I used to visualize the chemo as little Pac-Men (Or Pac-Women if you like bows) gobbling up the cancer. Hope that image helps :-). As always, you are in my prayers.",
      "MessageIndex": 20,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/227065",
      "Title": "Next step in my journey"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Whew! I am so relieved! I didn't even care about the LSU game, because I am so happy for you ;-). We will get together again--I want a bigger California reunion this time (can't say better because the last one was so wonderful). Love you and am so happy for you! (((Hugs)))",
      "MessageIndex": 19,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233694",
      "Title": "Some 'HAPPY' news -- Just want to share with all of you -- thru the good times, and bad"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Ask your doctor. I have a PAP yearly and a colonoscopy every 5 years. My initial colonoscopy was a couple of years after chem and done because of my family history of breast and colon cancers. I am not sure of recommendations with IBC? But if you haven't had a GYN checkup in a year, of course you need to get in there. Even though we all love our GYN exams ;-). At least my GYN is a true sweetie and he often goes over many other aspects of my health that others have missed.",
      "MessageIndex": 5,
      "PostDate": "05/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213408",
      "Title": "Yearly pap and colonoscopy"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so very, very sorry to hear this.  I hate that such a truly wonderful person is going through so much.  Sending big, big hugs and prayers.",
      "MessageIndex": 61,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Atta Girl, AttyGirl :-). So proud of you. There is absolutely no doubt in my mind that tamoxifen saved my life. When I was diagnosed, way back in 1987 with Stage 3, my prognosis stank. Tamoxifen was considered \"experimental\" by many for premenopausal women back then It made sense to me and my oncologist, so I went for it and took it 7 years (back then we didn't know how long that I should take it). Obviously, I am still here 25 years later. My mantra is to be as compliant as you possibly can. Sooo happy that you are doing this :-).",
      "MessageIndex": 28,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/246857",
      "Title": "Just took my first Tamoxifen pill"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Atta Girl, AttyGirl :-). So proud of you. There is absolutely no doubt in my mind that tamoxifen saved my life. When I was diagnosed, way back in 1987 with Stage 3, my prognosis stank. Tamoxifen was considered \"experimental\" by many for premenopausal women back then It made sense to me and my oncologist, so I went for it and took it 7 years (back then we didn't know how long that I should take it). Obviously, I am still here 25 years later. My mantra is to be as compliant as you possibly can. Sooo happy that you are doing this :-).",
      "MessageIndex": 59,
      "PostDate": "07/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/246857",
      "Title": "Just took my first Tamoxifen pill"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so very, very sorry to hear this.  I hate that such a truly wonderful person is going through so much.  Sending big, big hugs and prayers.",
      "MessageIndex": 14,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Happy St. Nicholas Day! Are you in the Netherlands now? If you are, I am sooo jealous :-)",
      "MessageIndex": 1,
      "PostDate": "05/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231720",
      "Title": "It's Dutch St. Nicholas day today!!!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I found a photo of him for my San Juan ladies.  He was a very sweet lizard.  May he RIP.",
      "MessageIndex": 0,
      "PostDate": "19/07/2014",
      "ThreadURL": "https://csn.cancer.org/node/283781",
      "Title": "OT Fluffy the Iguana"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Ditto here.",
      "MessageIndex": 15,
      "PostDate": "03/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/188728",
      "Title": "antidepressants"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "This is an awful shock! What a jerk! I don't know what to tell you except that I am here for you 100%.",
      "MessageIndex": 87,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "What fun! I love a fat tree.",
      "MessageIndex": 1,
      "PostDate": "12/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/207497",
      "Title": "Fattest Christmas Tree"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Nature really renews the spirit, doesn't it? Thanks for the beautiful and peaceful image before I head out to work. I especially like the image of the geese, working as a team and helping each other out. We could learn a lot from geese!",
      "MessageIndex": 2,
      "PostDate": "02/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208963",
      "Title": "It's morning here, and the skies are filled with geese...."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "This is an awful shock! What a jerk! I don't know what to tell you except that I am here for you 100%.",
      "MessageIndex": 37,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "The test to check vitamin d is a simple blood test called vitamin D, 25-hydroxy total. Hope this helps. I had terrible neck pain before my vit d level was \"fixed.\" I have been able to tolerate arimidex much better since then (almost no neck pain and less aches in general). Hope this helps!",
      "MessageIndex": 6,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198230",
      "Title": "QUESTIONS RE: ARIMIDEX & SIDE EFFECTS"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Happy Father's Day!  I miss my dad and father-in-law sooo much.  They were the greatest!  A special Happy Father's Day to the wonderful men on this site.  Hope you guys are doing well?  I miss you!",
      "MessageIndex": 8,
      "PostDate": "16/06/2013",
      "ThreadURL": "https://csn.cancer.org/node/260191",
      "Title": "♥ Wishing Everyone A Happy Father's Day ♥"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "This is great news. Way to go!",
      "MessageIndex": 9,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223189",
      "Title": "126/84"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Please have your doc check your vitamin d level. The aches and pains from arimidex are magnified by a low vitamin d level. My level was quite low (20's) and my endocrinologist upped my vit d intake from 2000IU to 5000IU per day. My level has creeped up to 55 and I am having less pain. See http://www.breastcancer.org/treatment/hormonal/new_research/20091215.jsp for more on vitamin d and arimidex pain. It is worth a try and I would hate to see you give up without checking if your vit d level is normal.",
      "MessageIndex": 5,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198230",
      "Title": "QUESTIONS RE: ARIMIDEX & SIDE EFFECTS"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thanks! Between you and Traci, I am bound and determined to exercise more ;-).",
      "MessageIndex": 2,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229712",
      "Title": "local paper article"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so sorry for your loss. She sounds like a beautiful person. You and your family are in my prayers tonight.",
      "MessageIndex": 71,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208154",
      "Title": "I Lost My Sister Today"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Everyone is soooo different. Your body is a unique set of thousands of chemical reactions and no one can tell you what, if any, side effects that you will have. But I would definitely do it in your case. It, in my opinion, is an excellent option that has saved so many, many lives.",
      "MessageIndex": 13,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197011",
      "Title": "reoccurrences and tamoxifen?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Hope you are well and bundled up and staying warm.  Sending hugs and prayers!",
      "MessageIndex": 2,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://csn.cancer.org/node/263821",
      "Title": "SIROD -- Doris, Please check in with us when possible"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Oh man, I just missed getting your autograph in CA!!!  That is really interesting, but it is a dilemma too.  However, I keep getting the testing - if not for me, maybe for one of my future relatives.  So far though, we haven't found a mutation - even though I am sure we have one.  Good luck with your geneticist!  Big hugs!!!",
      "MessageIndex": 4,
      "PostDate": "19/09/2014",
      "ThreadURL": "https://csn.cancer.org/node/288074",
      "Title": "I'm in The New England Journal of Medicine!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You are beautiful inside and out and I think your eyes are gorgeous--not spooky!",
      "MessageIndex": 4,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/202096",
      "Title": "The story behind the eyes..."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so sorry for your loss. She sounds like a beautiful person. You and your family are in my prayers tonight.",
      "MessageIndex": 21,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208154",
      "Title": "I Lost My Sister Today"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Hang in there!  I have had Stage 4 since 2005.  First, lung and bone mets and, recently liver mets.  Still fighting it but I am determined to go as long as I can.  Sending big hugs and lots of prayers.  Remember, many Stage 4 survivors are living many years.  You do not come with an expiration date!",
      "MessageIndex": 1,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://csn.cancer.org/node/258277",
      "Title": "Stage IV"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I was diagnosed in 1987 with Stage IIIA ( and was treated with tamoxifen for 7 yrs (they weren't sure how long I should take it back then). The textbooks at the time said that I had a 75% chance of a recurrence before 5 yrs. I did not have a recurrence for 22 yrs. Now I'm on arimidex and zometa and doing fine again. Although I also had chemo, rads and a mastectomy in 1987, I think the tamoxifen is what has kept me going as my tumor is ER+ and tamoxifen was the \"new\" addition to my treatment at the time. Honestly though, I wasn't crazy about some of the side effects--maily being a little tired and having no sex drive at such a young age. But I'll take life any day!",
      "MessageIndex": 7,
      "PostDate": "21/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197011",
      "Title": "reoccurrences and tamoxifen?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Depression/anxiety is so common with survivors.  There are times when it has hit me by sursprise, even though I am a healthcare professional.  I had one nurse ask me (when I was crying buckets) whether I was taking anything for anxiety/depression. I got the hint and called my oncologist and he called in a prescription for an antidepressant/antianxiety med.  Within a few days, I felt better. Don't neglect this side of your medical care.  The constant stress of being ill, having cancer, not healing, etc - it probably all takes a biochemical toll on some of those psych neurotransmitters. Your feelings about your breasts are your feelings and, I suspect, fairly common.  I had reconstruction decades ago, and yet there are times when I still miss my original breasts.  I have no idea why!  Lol.  The feelings do subside in time.  Sending gentle hugs and prayers!              ",
      "MessageIndex": 4,
      "PostDate": "15/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288708",
      "Title": "failed reconstruction"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I think I gained about 10 lbs (over 7 years), but I lost it again when I stopped taking it. I would just try and eat healthy and exercise when you can.",
      "MessageIndex": 2,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194331",
      "Title": "am I destined to be fat while on tamoxifen?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am an animal lover too and I know how hard this is. To me, the hardest part of being a pet owner is knowing when it is time to let go. There are no tools that can help and your dog can't tell you either. I think that the only guide is both your heart and your mind really examining the quality of Bodhi's life. If he is not really living anymore, it is time and you will know. You are in my prayers tonight.",
      "MessageIndex": 26,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214129",
      "Title": "my dog has cancer"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I would let your breast surgeon take a look at it. Sometimes absorbable sutures are not absorbed by the body and can cause problems or sometimes you can have a little infection. Anyway, there is no sense in guessing--you need to be checked!",
      "MessageIndex": 4,
      "PostDate": "16/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237313",
      "Title": "continued tenderness after surgery"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I was actually diagnosed with Stage 3 in 1987!  But I have been Stage 4 for 8 years.  It is normal to feel what you are feeling.  The diagnosis is so overwhelming at first and it has to be so hard on you being so isolated.  Allow yourself some time, but, if you feel too anxious and/or depressed, ask your oncologist for some help.  Depression/anxiety is more common in survivors and I found lexapro has helped me get through it.  If you decide to take something, make sure you clear it with your oncologist because some meds are not compatible with our treatments. Good luck!  I am sending all of the good thoughts and prayers that I can tonight.  Big (((hugs))).",
      "MessageIndex": 2,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://csn.cancer.org/node/258277",
      "Title": "Stage IV"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "When I was diagnosed, I was Stage 3, IDC, estrogen +.  I was scared to death and just wanted to see my 4 year old grow up. My 4 year old just turned 31.  I endured chemo, mastectomy, radiation and many years of hormone therapy. I had a recurrence after an 18 year remission.  I am still fighting but am so very, very grateful that my treatments have extended my life. I am doing chemo again now and there are difficult days sometimes, but I will get through it.  I always look at side effects as a puzzle to be solved.  I ask questions and read and try and figure out what will work for me.  Be as adherent with your treatment as you can! That is my advice ;-).  I know you are in shock but put on your boxing gloves asap and get in there and fight!!!  I am praying and pulling for you!!!",
      "MessageIndex": 10,
      "PostDate": "05/06/2013",
      "ThreadURL": "https://csn.cancer.org/node/259774",
      "Title": "came back high risk"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I hadn't heard of it, so, of course, I had to google it and found: \"Rebound from chemotherapy Some chemotherapy drugs work directly on dividing cells in the body - including the bone marrow where platelets are made. When the body is recovering from the effects of chemotherapy, a temporary overproduction of some cells can occur.\" From: Reactive Thrombocytosis",
      "MessageIndex": 1,
      "PostDate": "28/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/204271",
      "Title": "Rising Platelets"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Linda, you inspire me every single day!  (((Hugs)))  ",
      "MessageIndex": 7,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://csn.cancer.org/node/258277",
      "Title": "Stage IV"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Yippee!!!",
      "MessageIndex": 12,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213639",
      "Title": "Thanks to all my Pink Warriors"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am olive-complected and never worried about sunburn.  On taxotere, I am having a terrible time with sunburned, swollen cheeks and eyelids.  I also felt nauseated and awful the next day. The rest of me is fine. My oncologist warned me that my chemo would make me photosensitive, so I use SPF50 sunscreen and wear a large UV hat and guess what?--still a no go.  I am now doing mall walking because I just can not go out in the middle of the day. Be very aware of how toxic the sun can be while you are on chemo.  My onc said the worst sunburn that he has ever seen was a patient on chemo who went to Florida on vacation. An umbrella will not be enough.  It is not just direct sunlight for me.  It appears to be indirect as well.  Use an excellent sunblock (minimum SPF 30) and cover up as much as you can.  Be careful and have an exit plan if you start to burn or begin to feel sick.  As far as the pool is concerned, it will depend on who is maintaining the pool.  Our daughter caught an eye infection from a public pool once.  I remember saying how nice it was that the pool had no chlorine smell...Lol.  Maybe not such a good thing to have less chlorine.  There are chlorine free pools that are safe too.  But you might ask pool manager how often and when pool is serviced just to be safe! Good luck and be safe!",
      "MessageIndex": 1,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://csn.cancer.org/node/260550",
      "Title": "Swimming during Chemo?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "First step I would take is to appeal their denial in writing. Do not telephone.",
      "MessageIndex": 7,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203689",
      "Title": "Reduction surgery denied"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I take arimidex but my sister takes femara. They are very close chemically--both aromatase inhibitors. We both had trouble with extreme fatigue taking either one in the am. Both of us now take it in the evening and have done much, much better.",
      "MessageIndex": 3,
      "PostDate": "29/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/219454",
      "Title": "Femara question?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "First, think about whether you are hot-natured or cold-natured and also consider your climate.  I am beginning to get hair but I still wear a soft cotton cap at home because my head gets cold. My favorite , go-to turban-type cap (or sleeping cap)  for around the house is the \"Hats with a Heart\" 3 seam chemo turban.  You can dress it up with a scarf.  It is just the least irritating, most comfortable cap for me and it is 100% cotton.  I don't like the cotton sleep turbans with the knot in the front.  You do not have to buy a scarf at the site-any scarf can dress it up.  If you live where it is cold, it may not be warm enough.  I am in Louisiana.  Link: http://www.hatswithheart.com/ I love cotton Parkhurst cloche (bell-shaped) caps for a dressier, going out option.  They are a little pricey(~$30), but they are very high quality (made in Canada).  They last forever and are casual but a little dressier.  They also make them in wool if you live wear it is colder.  My first one came from the TLC site, but it didn't say Parkhurst at the site.  I think this was similar: https://www.tlcdirect.org/Classic-Cotton-Knit-Cloche.html  I have purchased 3 of them, because they come in different cute colors and styles.  I mainly find them on ebay or amazon now. Polyester blend sleep caps are too hot for me. I have ended up with way too many caps...lol.  Hope this helps!",
      "MessageIndex": 2,
      "PostDate": "18/03/2014",
      "ThreadURL": "https://csn.cancer.org/node/268615",
      "Title": "What hair loss related products did you find most useful? Upcoming 1st chemo....."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Katherine has had a house rabbit since 2002.  She didn't really want a rabbit, but her boyfriend at the time (stupidly) bought 2 males and they nearly fought to death.  She took Bunny Man, stitches and all, nursed him along and he has been one of the sweetest critters that you ever saw.  He hops freely around her apartment, is litter trained and gets along well with her cats.  He really likes his nose petted.  His only downside is he won't go in a cage without fighting and honking at you--but she gave up trying years ago...Lol. Lately, he has been holding his foot weird and we were getting very concerned because 11 is quite old for a rabbit.  She took him to the vet today and found out that he just has mild arthritis and they gave him some meds to keep him comforatble. She is so happy tonight that I am happy too. :-).  Bunny Man is a little fighter!",
      "MessageIndex": 0,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://csn.cancer.org/node/257901",
      "Title": "OT Bunny Man OK"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You are amazing!  You are a true testament that age is just a number and I am in total awe.  At 60, I have been whining about my chemo for liver mets (taxotere, herceptin and perjeta).  You are my hero!!!!  And yay for a great check up!",
      "MessageIndex": 3,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://csn.cancer.org/node/262772",
      "Title": "Good visit to the oncologists"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so sorry to hear this Jean. Please know that my heart and prayers are with you and your family.",
      "MessageIndex": 35,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238274",
      "Title": "MIL Passed Away"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Lisa, how are things with Linda? Praying she is feeling better.",
      "MessageIndex": 13,
      "PostDate": "18/09/2012",
      "ThreadURL": "https://csn.cancer.org/node/246760",
      "Title": "Update on Linda Simmons from her Caringbridge blog.."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Praying your bone scan is clean.  Sending prayers and hugs!",
      "MessageIndex": 4,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://csn.cancer.org/node/259399",
      "Title": "Aromasin troubles--bone scan pending--need pink bus"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Sending more positive energy your way. Sounds like you're going to be really busy.",
      "MessageIndex": 1,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213818",
      "Title": "So, when all this started...."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Below is a good link from ACS.  I have had some mild neuopathy in my feet from taxotere, but have escaped the bad stuff.  When my feet get hot, I remove my shoes and socks and elevate them on a pillow and that has helped me.  Acupuncture may be something to try if you want to avoid medications.  Good luck!   http://www.cancer.org/acs/groups/cid/documents/webcontent/002908-pdf.pdf",
      "MessageIndex": 1,
      "PostDate": "11/11/2013",
      "ThreadURL": "https://csn.cancer.org/node/264344",
      "Title": "Neurothopy"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thank you, thank you so much for posting. I have missed Linda so much and have been so worried. Sent an email to Lisa offering help. To Linda, please feel the prayers and love from your sisters here. And get better soon-we need your sanity and warmth here! Big, big (((hugs)))",
      "MessageIndex": 5,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://csn.cancer.org/node/246760",
      "Title": "Update on Linda Simmons from her Caringbridge blog.."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am aggravated that my younger sister had chemo WITHOUT radiation for IDC. She then had a local recurrence that was treated with surgery, radiation and femara. I wish she had had the radiation to begin with!",
      "MessageIndex": 20,
      "PostDate": "30/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221364",
      "Title": "Does radiation make sense when you have already gotten chemo?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Praying as hard as I can!!!",
      "MessageIndex": 3,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://csn.cancer.org/node/265878",
      "Title": "Prayers needed please"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Cincy, I'm with you. I never know how to answer this question. I love almost all colors. I wear a lot of purple, blue, black, red and pink, because I think that they look better with my olive skin. I too like pink a lot; it just seems like a bright and happy color.",
      "MessageIndex": 22,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/231219",
      "Title": "I thought it would be great to see what your favorite color is, so, what is your favorite color?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I love your spirit and sense of humor. Stay strong! You are in my thoughts and prayers.",
      "MessageIndex": 5,
      "PostDate": "12/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194208",
      "Title": "Hello pink warriors :)"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Risk of infection is not the only severe possible adverse effect with a PICC.  In my career, I have personally seenmalposition (fairly frequently, clots, and cardiac tamponade (life threatening).  PICC's are safer these days, but I would not consider one for chemo if I could help it. I have had my port for 9 months now.  Recently while getting chemo, I asked my oncology nurse how long could it last.  She introduced me to a lady next to me with sickle cell anemia who has had a port for 15 years!  I love my port and I hope it lasts forever.  I wish I had had one with my first round of chemo because now my existing veins are so damaged and IV options are very limited (especially since they can't use my left arm). As far as flushing, I will have chemo every 21 days indefinitely, so I don't have to worry about it.  If I had to get it flushed, I would ask my oncology nurses if I could just run over and have them do it.  If you are far from an infusion center that might not be an option. One final word about my port, I no longer let anyone touch it except my oncology nurses (if I can help it).  I had a bad experience in the ER when an ER nurse did not use the central line kit and accessed it like an IV (you are supposed to wear mask, sterile gloves, etc.).  Fortunately, I was in the ER with febrile neutropenia and was started on IV antibiotics.  That experience shook me up though because I have seen central line infections.  And, yes, I should have spoken up, but when you are shaking with chills and fever, you aren't thinking straight. In spite of that, I strongly recommend a port.  Chemo can do permanent damage to veins and it is much better to have chemo infusing into a very large blood vessel where it is quickly diluted and much less likely to cause vascular damage.",
      "MessageIndex": 2,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266667",
      "Title": "pros and cons of pic lines or a port"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "For some, it may be fine to skip a port.  Here was my situation: in 1987 (before sentinel node choice), I had every lymph node in my left axillary area that surgeon could find removed.  Therefore, they never could use my left arm.  My hand veins have never been any good.  I don't know why, but, if they are able to get an IV there, it lasts about 5 minutes and then blows.  First chemo though, no real problem, they used my antecubital vein (vein in bend of elbow) over and over.  Unfortunately, that turned out to be my only reliable vein and, after chemo, it was too scarred to use anymore.  Sometimes, a nurse could get it and, because of the scarring, it was very painful. For years, if I had a minor or major surgery, they would start with using my one beat up vein (if they could) or stick me repeatedly to find something.  Then, I would wake up with a jugular (neck) IV that anesthesia would place.  Not a great place for an IV. I was on zometa (after metastases) without a port and it was traumatic for both me and the nurses.  I asked my onc to switch to xgeva because it is a shot and not an infusion. For me, the port has been a lifesaver.  Everyone is so individual but I remember my oncologist saying I didn't really need a port with my first chemo.  If I had had a crystal ball, I would have insisted - especially having just the one arm to use.  You never know how your veins are going to hold up until you've lived with the diagnosis for decades and you never know what the future holds in terms of surgeries and, God forgive, a repeat of the cancer. ",
      "MessageIndex": 21,
      "PostDate": "15/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266667",
      "Title": "pros and cons of pic lines or a port"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "So cold here-I can't imagine Maine!  Even though highs are in 50's, it is humid and cloudy and feels awful.  Supposed to clear up this afternoon.  Hope you are snuggled in near a fire and doing better!  Hugs and prayers coming your way.",
      "MessageIndex": 0,
      "PostDate": "10/12/2013",
      "ThreadURL": "https://csn.cancer.org/node/265101",
      "Title": "SIROD, how are you doing?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Praying for you and hoping you are doing well.",
      "MessageIndex": 3,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211820",
      "Title": "Meena .. How are you doing, our PINK WARRIOR .. We are thinking about you"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I haven't had real pain from it, but I have found it uncomfortable at times - this is almost always caused from something external irritating it: certain bras, seatbelt when I drive, etc.  I bought a fleece cover for my seat belt, so that is no longer a big problem (you can see what I am talking about at http://www.amazon.com/Fleece-Seat-Shoulder-Harness-Cover/dp/B000QZ6JF4).  Also, when I sleep, I have a king-sized down pillow I position around it, so I don't end up on top of it.  Hope this helps! PS Your port may still be irritated because you haven't had it very long.  If you have serious pain (especially if you have a fever or any redness), I would let your surgeon know.  ",
      "MessageIndex": 18,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266667",
      "Title": "pros and cons of pic lines or a port"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Kay, where are you?  Praying that you are doing well?!",
      "MessageIndex": 1,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://csn.cancer.org/node/258423",
      "Title": "Smalldoggroomer aka Kay"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Did I mention that I am not the only insane person?  My relatives have really, seriously gone insane. Apparently, my little nephew has taken up a collection on FACEBOOK (OMG)  for a juicer. Did he ask me if I wanted one?  Of course not until he started this mess.  Did I mention I already own a juicer?  Sigh....  Please shoot me now!  Ugh!!!  I know that he is very sweet and that he loves me,  but OMG.  I am mortified.  Maybe I'll have Danny juice some kudzu. Remember the tech who told me that kudzu tea cures cancer. Now I've got the giggles.  Save me from family!!!   ",
      "MessageIndex": 0,
      "PostDate": "18/03/2013",
      "ThreadURL": "https://csn.cancer.org/node/256396",
      "Title": "Mortified!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so happy that you had fun. Trish sounds like a sweetie and great support. And you look beautiful--inside and out!",
      "MessageIndex": 4,
      "PostDate": "12/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213912",
      "Title": "Back from vacation :)"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "My experience with tamoxifen (taken 1987-1994): I gained total of approximately 20 lbs. Real bummer. My oncologist had warned me about wt gain and told me to watch it and I really tried! The good news is that I lost it all within a year or two after stopping the drug. Everyone's experience is different though, I'm sure.",
      "MessageIndex": 7,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178062",
      "Title": "Tomoxifen and weight gain"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "The photo is of my college roommate (from 1972) and me from last night. She was my maid of honor in my wedding and I was one of her bridesmaids in her wedding. It was so much fun to visit. She is another adopted sister and it is always like old times when we get together.",
      "MessageIndex": 0,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223520",
      "Title": "OT: My \"old\" college roommate"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Barbara, I am so sorry that you are going through this--I hate cancer! My prayers are with you.",
      "MessageIndex": 22,
      "PostDate": "03/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219698",
      "Title": "Update on Bjmom1"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I get shotgun and I'm bringing my cafe au lait and beignets! I'm all in!!!",
      "MessageIndex": 1,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223475",
      "Title": "Gas up the bus, girls!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "It never seems the same without that swinging tail! Of course we missed you! Hope you have been doing well?",
      "MessageIndex": 15,
      "PostDate": "30/07/2012",
      "ThreadURL": "https://csn.cancer.org/node/243930",
      "Title": "I'm back!!! Did you miss me? Maybe a little bit? LOL"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I just came aboard this post, but I wanted to let you know I am praying and pulling for you. I had a recurrence last year after a 22 year remision (bone mets). Cancer sucks! Even though you are faced with bad news, I detect an inner light and strength in your words and I think you are very, very brave.",
      "MessageIndex": 38,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/182397",
      "Title": "If I didn't have kids . . ."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Found a very helpful link from Wales about kids' reactons to a parent with cancer and how to deal with them. Hope it helps! http://www.cancercouncil.com.au/editorial.asp?pageid=277",
      "MessageIndex": 39,
      "PostDate": "03/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/182397",
      "Title": "If I didn't have kids . . ."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "We were there, count on it! And I am smiling ear to ear to hear that you did so well. How wonderful!",
      "MessageIndex": 9,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212735",
      "Title": "1st chemo...the worst bit was walking thru the door!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I think this myth started because deodorant is in the vicinity of the breast. It never made a lick of sense to me and the research just doesn't back it up.",
      "MessageIndex": 12,
      "PostDate": "09/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218066",
      "Title": "Deodorant vs. No Deodorant - Relationship to BC?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I know that it is off the subject, but I just wanted to share that Danny and I are going to New York on Friday to celebrate our 35th wedding anniversary. We are excited and looking forward to the distraction.",
      "MessageIndex": 0,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180063",
      "Title": "Our 35th anniversary"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I had chemo back in 1987, so much has changed! I had as many nodes removed as possible from the left side (what they did back then). My surgeon said I could have blood draws from that side but NEVER any infusions or IV's of any kind. Back then I had a 6 month course of chemo with one good vein and, miraculously, my chemo nurse got it every time--never had a port. I have followed his advice and now, back in treatment again (after 24 years), I have infusions in my right arm, but I have all blood draws from my left (trying to save my few veins). I have been on IV treatment (zometa not chemo) once a month for 2 years and, so far, my pitiful right arm veins are holding out. I never, ever do lab draws from that right arm--only from the left. But please ask your surgeon if this is right for you. You are in my prayers.",
      "MessageIndex": 18,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217003",
      "Title": "Four rounds of chemo, will I need a VAP?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Kay is in my thoughts and prayers. Please let us know how she is doing.",
      "MessageIndex": 12,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/244419",
      "Title": "smalldoggroomer Update (Another update 8/12/12 & 8/13/12)"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Happy Birthday!!! Hope it is very happy!!!",
      "MessageIndex": 4,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://csn.cancer.org/node/259432",
      "Title": "Happy Birthday - Aisling8's -- Victoria"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Praying hard Kay. Big (((hugs)))",
      "MessageIndex": 63,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/244419",
      "Title": "smalldoggroomer Update (Another update 8/12/12 & 8/13/12)"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I need your help. Where is the post awhile ago about the stupid things people say?? I have a friend with breast cancer who wants to read that post. Thanks in advance!",
      "MessageIndex": 0,
      "PostDate": "29/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182863",
      "Title": "Stupid things people say"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Praying hard Kay. Big (((hugs)))",
      "MessageIndex": 16,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/244419",
      "Title": "smalldoggroomer Update (Another update 8/12/12 & 8/13/12)"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You are awesome and I can see why you are so loved. Thank you so much for sharing.",
      "MessageIndex": 5,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183242",
      "Title": "Any Teachers here?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Back before antidepressants were used for menopausal symptoms (yes I am that old of a survivor!), I was put on an old drug called Bellergal-S. It is a little this and a little that. It has an ergot for headaches, a small amount of phenobarbital and belladonna. Sounds like witchcraft, but it saved me. It can be addicting (low potential), but I had no problem at all weaning off after perimenopause. I think it is still around, but not used much?",
      "MessageIndex": 18,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237290",
      "Title": "How to minimize hot flashes from Tamoxifen?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Very interesting research re cancer and inflammation. I have, in recent past, read about the connection between cancer and inflammation. Because of it, Danny and I are trying to eat/drink more foods that lower inflammation. This research is showing that cells that are inflamed release substances that fuel our cancer, so cancer actually causes MORE inflammation and aging. This was a new concept to me, but it makes sense. Often I have a lot of inflammation, pain, arthritis, etc. that may actually be driven by my cancer. Bet it makes sense to many of you too. To recap, inflammation may cause cancer and cancer causes inflammation. Hopefully, researchers, now being aware, can figure out some powerful anti-oxidant therapies to help us out. Here is the study: Cancer Cells Accelerate Aging And Inflammation In The Body To Drive Tumor Growth More links: Top 10 Anti-Inflammatory Foods You’ve Got to Know Check Inflammation Factor of Foods at this Site",
      "MessageIndex": 0,
      "PostDate": "30/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/219505",
      "Title": "Cancer Cells Accelerate Aging, Inflammation--new research"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Laura, I am praying for you and sending you cyber hugs. I am so sorry for what you are going through. Please let us know how you are doing.",
      "MessageIndex": 30,
      "PostDate": "28/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201781",
      "Title": "Hey checking in just got out of hospital need prayers"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Kay is in my thoughts and prayers. Please let us know how she is doing.",
      "MessageIndex": 59,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/244419",
      "Title": "smalldoggroomer Update (Another update 8/12/12 & 8/13/12)"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You never whine! You are ventilating with every right to do so. Decadron is a nasty drug, isn't it? I feel so hyped up on it, but also tired because I can't sleep. I guess the word is \"wired.\" Linda, I admire your courage and grace so much. Keep fighting! Glad you are nearly done. Big hugs!",
      "MessageIndex": 11,
      "PostDate": "06/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/244398",
      "Title": "warning...I'm gonna whine"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thanks so much for always thinking of me. You are a sweetie. I saw your post after I posted my happy news, but wanted to thank you again for being there.",
      "MessageIndex": 1,
      "PostDate": "02/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213134",
      "Title": "Cypress Cynthia .. How did it go yesterday, 2/28? We are thinking about you :)"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I love this. This \"new\" tradition of ornament sharing with cancer survivors has become one of my favorite traditions!",
      "MessageIndex": 1,
      "PostDate": "24/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/250435",
      "Title": "Ornament Recieved"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I have been fortunate in being able to meet up with a few over the years: 3 in Ca, 1 in Orlando and 1 in New Orleans. What is truly amazing to me is that each and every person that I have had the honor of meeting is so genuine, sweet and, well, just lovely! Try and get together when you can cuz I highly recommend it!",
      "MessageIndex": 3,
      "PostDate": "21/10/2012",
      "ThreadURL": "https://csn.cancer.org/node/248484",
      "Title": "Meeting up"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "The latest article in The Lancet legitimizes what I have been preaching about tamoxifen being the main reason why I have survived so long. My prognosis was poor back in 1987 without tamoxifen. Tamoxifen was the new kid on the block that ended up saving my life. Now, 24 years later, I am hear to coax you ladies to just do it! And note that even those with weakly ER positive tumors were helped. Tamoxifen Wards Off Breast Cancer's Return for More Than a Decade http://www.emanuelmedicalcenter.org/body.cfm?id=148&action=detail&ref=39679",
      "MessageIndex": 0,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223348",
      "Title": "For those on the fence about tamoxifen and ER+....please read"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Just published in American Journal of Public Health: \"Objectives. Our goal was to provide current estimates of alcohol-attributable cancer mortality and years of potential life lost (YPLL) in the United States. Methods. We used 2 methods to calculate population-attributable fractions. We based relative risks on meta-analyses published since 2000, and adult alcohol consumption on data from the 2009 Alcohol Epidemiologic Data System, 2009 Behavioral Risk Factor Surveillance System, and 2009–2010 National Alcohol Survey. Results. Alcohol consumption resulted in an estimated 18 200 to 21 300 cancer deaths, or 3.2% to 3.7% of all US cancer deaths. The majority of alcohol-attributable female cancer deaths were from breast cancer (56% to 66%), whereas upper airway and esophageal cancer deaths were more common among men (53% to 71%). Alcohol-attributable cancers resulted in 17.0 to 19.1 YPLL for each death. Daily consumption of up to 20 grams of alcohol (≤ 1.5 drinks) accounted for 26% to 35% of alcohol-attributable cancer deaths. Conclusions. Alcohol remains a major contributor to cancer mortality and YPLL. Higher consumption increases risk but there is no safe threshold for alcohol and cancer risk. Reducing alcohol consumption is an important and underemphasized cancer prevention strategy. (Am J Public Health. Published online ahead of print February 14, 2013: e1-e8. doi:10.2105/AJPH.2012.301199)\" Read More: http://ajph.aphapublications.org/doi/abs/10.2105/AJPH.2012.301199?journalCode=ajph    ",
      "MessageIndex": 0,
      "PostDate": "18/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254650",
      "Title": "In the News this AM: Alcohol: No safe threshold"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Laurissa, I am not sure but I just wanted to say that I am praying for you. Please pm me if I can do anything to help.",
      "MessageIndex": 5,
      "PostDate": "11/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/226083",
      "Title": "stage 4 and disability"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Many posts reveal a lack of understanding re tamoxfen. Tamoxifen does not lower estrogen levels. Tamoxifen fits into a receptor site on your breast estrogen that cancer must use in order to feed on the estrogen. Thus the cancer may literally starve because it can not access your estrogen. Tamoxifen has side effects that can be estrogen enhancing (such as bone strengthening) or estrogen lowering (such as hot flashes). It is a very powerful tool in fighting ER+ tumors. See this link for more info: http://www.breastcancer.org/treatment/hormonal/serms/",
      "MessageIndex": 0,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179509",
      "Title": "Tamoxifen confusion fyi: hope this helps"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Happy Belated Birthday!!!  Hope it was great!!!  Big hugs!!!",
      "MessageIndex": 3,
      "PostDate": "18/05/2014",
      "ThreadURL": "https://csn.cancer.org/node/274621",
      "Title": "Happy Birthday Wishes to RE - May 16th"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am so, so sorry for all you are going through.  I hate to hear about your pain.  Can you get your onc or a pain specialist to help with that?   Just thinking you might feel more like being a little active, if you could get a handle on the pain. Cancer sucks and Stage 4 sucks even more!  Praying for you and sending lots and lots of hugs.  You are one of the strongest and most amazing ladies on this board.  I admire you so much; your spirit shines through in your every post.",
      "MessageIndex": 7,
      "PostDate": "14/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266629",
      "Title": "Femara update"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I can't remember if you had your vitamin d level checked? If not, I recommend having it checked for anyone having joint pain. Many of us have abnormally low levels and I am not sure why. Don't try adding more d supplements before checking your level. It is important to take the right amount for you. Any of your docs will order this simple blood test. Also, if you continue with the pain, ask for a referral to a rheumatologist. We are also at higher risk for autoimmune issues, so you might want to check this out. A good rheumatologist can help you to sort this out. All of us tend to blame everything on our meds and/or cancer, but the truth is that other events may be occurring that need to be checked out: arthritis, aging, etc. Last but not least, ask for a referral to a Physical Therapist as they can often start you on some gentle joint-lubricating exercises that may help you build up your stamina and get you on the right track. Good luck!",
      "MessageIndex": 1,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221395",
      "Title": "pain and exercise"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am not a teacher, but I would think it might be a good idea to share some information about your condition with your students. It would give them a chance to be supportive and they probably have figured something is going on. Why not be honest?",
      "MessageIndex": 1,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183242",
      "Title": "Any Teachers here?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Claudia, Hope you are doing well??? You have been in my thoughts and prayers lately too. Hope chemo is going ok?",
      "MessageIndex": 2,
      "PostDate": "08/10/2012",
      "ThreadURL": "https://csn.cancer.org/node/247973",
      "Title": "Chenheart"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I love that you gave them something to do. I bet that you have some great cards and emails. That would help me get through it. My daughter's 1st grade teacher had her students send me Get Well cards that they made themselves. One featured a lady lying down holding a lily (looked very dead). I still get it out 23 yrs later because it was so funny to me. Maybe I have a sick sense of humor but I found it hysterical.",
      "MessageIndex": 3,
      "PostDate": "04/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183242",
      "Title": "Any Teachers here?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "My oncologist told me she wants me to have one yearly while on the arimidex (which will be for the rest of my life or until the arimidex stops working). My bone density improved a little last year--I guess because I am on zometa infusions. I also have a thyroid condition that makes me higher risk for osteoporosis, but, so far, just osteopenia.",
      "MessageIndex": 7,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209356",
      "Title": "Muscle Girls... was a Bone Density Test recommended for You?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Time for a frank talk with your oncologist.  Tell him/her what you have told us and see if there are any other ideas to help with the nausea.  I am afraid I may be joining you with this problem as nausea is always a problem for me.  Last time that I ran into this problem, it was actually my oncologist's nurse who came up with the combo that worked for me.  Keep asking!  And you are the strongest person that I know.  Sending big hugs and prayers. \"How do doctors prevent nausea and vomiting? Most people undergoing chemotherapy receive anti-nausea (anti-emetic) medications to prevent nausea and vomiting. These drugs, given alone or in combination, can be taken in pill form or administered through a vein in your arm. Your doctor advises which to use based on the treatment you're receiving. Anti-nausea medications are typically given before treatment begins and on a scheduled basis for several hours or days after treatment. You may receive additional medications if you develop nausea and vomiting after chemotherapy. Your doctor determines which anti-nausea medications to use based on your specific situation, for example, what type of chemotherapy drugs you're receiving. Drugs used to prevent nausea and vomiting include: Aprepitant (Emend) Dexamethasone Dolasetron (Anzemet) Dronabinol (Marinol) Droperidol (Insapsine) Granisetron (Kytril) Haloperidol (Haldol) Methylprednisolone (Medrol) Metoclopramide (Reglan) Nabilone (Cesamet) Ondansetron (Zofran) Palonosetron (Aloxi) Prochlorperazine (Procomp) Drugs used to treat anxiety associated with chemotherapy nausea include: Alprazolam (Niravam, Xanax) Lorazepam (Ativan) Midazolam Doctors take this proactive approach to prevent nausea and vomiting because these side effects can be difficult to control once they begin. Nausea and vomiting can make you feel miserable, add to your fatigue and distress, and make you reluctant to stick to your treatment schedule. If you're unsure about taking anti-nausea medication when you aren't feeling nauseated, talk to your doctor about the risks and benefits of these drugs. What additional measures can you take to prevent nausea and vomiting? You can take steps to reduce your risk of nausea and vomiting. For example: Eat small meals. Stagger small meals throughout the day rather than eating fewer, larger meals. If possible, don't skip meals. Eating a light meal a few hours before treatment also may help. Eat what appeals to you. It's best, however, to avoid foods that are sweet, fried or fatty. In addition, cool foods may give off less bothersome odors. Cook and freeze meals in advance of treatment to avoid cooking when you're not feeling well. Or have someone else cook for you. Drink lots of fluids. Try cool beverages such as water, unsweetened fruit juices, tea or ginger ale that's lost its carbonation. It may help to drink small amounts throughout the day, rather than larger amounts less frequently. Avoid unpleasant smells. Pay attention to what smells trigger nausea for you. For some, a specific smell, such as the smell of something frying or a greasy smell, may cause nausea. Other people may experience nausea when smelling any strong odor. Limit exposure to unpleasant smells. Fresh air may help. Make yourself comfortable. Rest after eating, but don't lie flat for a couple of hours. Try wearing loosefitting clothing and distracting yourself with other activities. Use relaxation techniques. Examples include meditation and deep breathing. These self-care measures may help you prevent nausea and vomiting, but they can't take the place of anti-nausea medications. If you begin to feel nauseated despite the medications, call your doctor. Treatments may include additional medications, though your individual treatment will depend on what's causing your signs and symptoms.\" http://www.mayoclinic.com/health/cancer/CA00030/NSECTIONGROUP=2",
      "MessageIndex": 1,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://csn.cancer.org/node/257998",
      "Title": "Need what?"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I'm seeing my oncologist in one week and had all of my labs done today. Please send some healing vibes, good wishes, prayers--whatever you have. Thanks! I'm a little nervous.",
      "MessageIndex": 0,
      "PostDate": "08/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202896",
      "Title": "Had my markers drawn today"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Yes, I wish I could be there too, but I will be working. But then I am off for a week so Danny and I will do something fun. Jean, your little break sounds wonderful too. Have a great time ladies!",
      "MessageIndex": 6,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211986",
      "Title": "*~~~ Do You Have Any Special Plans For Valentine's Day? ~~~*"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am praying for you and your mom. She should not have to suffer until her last breath as there is pain management out that can really help. Ask for help in getting her pain under control. This can be a complicated issue and you may need to really advocate for her. Narcotics, antidepressants and many other medications can really help. They can have side effects, but they can be managed (such as nausea, for example, and she may need to take an anti-nausea med with the others). I do not know anything about healthcare in India, but I do believe in the power of prayer and I am praying that your mom gets better and I am praying that God keeps you strong. Please know that we care about you and your mom and come here anytime that you need a friend.",
      "MessageIndex": 13,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/227376",
      "Title": "plz pray for my mother ,she is suffering from breast cancer and bone infection"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Armidex is not an easy drug, but one that has helped me buy time and, for me, that makes it so worth it.  I did better taking it at night as if I took it in the am, I was too tired.  I had my vitamin d level checked (simple blood test) and it was low, so I worked with an endocrinologist to get it normal.  There are studies that indicate a low vitamin d level can make the joint pain worse. You are in a difficult position because I imagine you already have significant joint pain?  My advice is to take it and see and don't give up.  I had a sister who couldn't tolerate one of the aromatase inhibitors (that is what arimidex is) and she switched to aromasin.  She never had the joint pain.  My younger sister has had minimal se from femara (mild joint pain). I had mild joint pain on arimdex and would still be on it, but I am Stage 4 and it quit working after awhile.  SE are scarier, but cancer is scarier and very sneaky.  I am an old-timer who was originally diagnosed with Stage 3 in 1987!  I had a long remission and then have been Stage 4 since 2005 (bone, lung and liver mets).  I am currently back in remission, but I do not know how long before the cancer shows up somewhere else. My philosophy has been to take the cancer fighting meds and then deal with the side effects with exercise, eating right, other meds - whatever it takes to get through it.  Sometimes I feel like, if there is a reason why I am still alive after 27 years with this wretched disease, it is to encourage others to just do it!!!  and stick with it!!!  Big, big (((hugs))).  ",
      "MessageIndex": 5,
      "PostDate": "04/06/2014",
      "ThreadURL": "https://csn.cancer.org/node/276904",
      "Title": "Scared to begin Arimidex"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I love these milestones soooo much!!!!  Thank you so much for sharing and congrats!!!!!",
      "MessageIndex": 12,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266661",
      "Title": "Five years ago today!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I am ER + so am not in the same boat, but I fould this online: Tamoxifen therapy can provide three main benefits: prolonging survival, preventing reoccurrence, and preventing a second breast cancer from developing in the opposite breast from the first cancer. These benefits have been seen in women with ER and/or PR positive tumors – even weakly positive, but have not been seen in ER and PR negative tumors, therefore current recommendations are for women with ER or PR positive tumors to take Tamoxifen or another aromatase inhibitor ( anastrozole, letrozole, exemestane) for five years. Patients with ER negative tumors should consider the risk of reoccurrence with their oncologist (based on stage, tumor size and histology) and determine whether or not to use chemotherapy based on this risk. You can find more information on current guidelines at the National Comprehensive Cancer Network's website (www.nccn.org) Tamoxifen for Weakly Positive Breast Cancer",
      "MessageIndex": 1,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/204143",
      "Title": "Technically Triple Negative but Recommended for Tamoxifen"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You do not need to thank me! I am just so grateful to have a wise and serene presence here. You are a keeper!!! :-)",
      "MessageIndex": 1,
      "PostDate": "16/10/2012",
      "ThreadURL": "https://csn.cancer.org/node/248412",
      "Title": "I still need to say thank you."
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thanks!",
      "MessageIndex": 3,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/221756",
      "Title": "Different Subtypes of Triple-Negative Breast Cancer Respond to Different Therapies"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thank you all for the warm birthday wishes!  Love you all!!!!",
      "MessageIndex": 8,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://csn.cancer.org/node/267290",
      "Title": "Yesterday was Cypress Cynthia's Birthday!!!!!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "The bone density test is used to check the health of your bones (which can suffer because of treatments and disease). A bone density test is the gold standard for diagnosing osteoporosis. The bone scan is usually used to diagnose breast cancer metastais to bone. It can be done for other reasons, but, for most of us, that is why the docs do them. My doc did not do one though until I began having the rib pain and my CT scan was abnormal. My bone scan in 2009 showed bone mets to the ribs.",
      "MessageIndex": 9,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/206673",
      "Title": "Bone Scan vs Bone Density test"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You have a lot on your plate and I am happy to listen. I hope it helps to write it down and it was not ranting at all--just an eloquent expression about all you have been through. My only suggestion is, if you really think his behavior is alcohol-related, consider going to a few Al Anon meetings. They have really helped me in the past with family members struggling with substance abuse--if for no other reason then to make me realize that the addiction is an illness, I can't make excuses or enable and that I really do have to \"let go and let God.\"",
      "MessageIndex": 1,
      "PostDate": "27/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221390",
      "Title": "vent - husband being a jerk"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "See how well I added that link ;-) I think I should get credit for that...lol.",
      "MessageIndex": 2,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/204143",
      "Title": "Technically Triple Negative but Recommended for Tamoxifen"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Danny and I went to the French Quarter to see the river. It is so huge and angry looking--and much lower in New Orleans because of the flood spillways than further north. It breaks my heart to think of all of those who have flooded homes or will suffer flooded homes. I am praying that the drought we are having will slow the water down some. So awful.",
      "MessageIndex": 0,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218757",
      "Title": "OT Please say a prayer for all those suffering from the swollen Mississippi River"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Sue, you sound like a very rationale, thoughtful lady. It is perfectly reasonable to get a thorough check up before starting effexor. But also know that rates of depression are higher in breast cancer patients--probably in part due to stress and disease but also in part due to our very necessary treatments. And, if you do need the effexor, I would just think of it as part of my overall treatment. We need to be active and mentally strong to fight this! Major depression after breast cancer: a review of epidemiology and treatment Komen on Depression",
      "MessageIndex": 8,
      "PostDate": "28/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/213021",
      "Title": "I think I am in danger of becoming permanently attached to the couch"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "How about boniva? Will they cover it or one of the once a month pills? I took boniva before I had the recurrence and then was switched to the stronger zometa. Never had any problems with boniva.",
      "MessageIndex": 1,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224041",
      "Title": "Fosamax wkly pill vs Reclast annual infusion"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "I don't know how much I can do, but we are taking Katherine, Aaron and little Bella (Aaron's daughter and now our new granddaughter, age 5) to Disney World. :-) I am planning frequent rests and will take it easy, but really want to see Bella enjoy her first visit.",
      "MessageIndex": 0,
      "PostDate": "05/11/2013",
      "ThreadURL": "https://csn.cancer.org/node/264184",
      "Title": "Disney World!"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "You are amazing, but I guess we do what we have to do? I have had 4 or 5 colonoscopies because of a strong family history of breast and colon cancer. Your recommendations are helpful and I will try to remember them as I will have another next year. I have bad veins too and I have requested that I have my colonoscopy at the hospital. That way there are more available anesthesia folks to help. They often knock me out (per my request) using a smaller vein and then I wake up with a jugular (neck) vein catheter. Also, the one time I had the procedure at an outpatient setting, I ended up having to be admitted that evening for dehydration from severe nausea and vomiting. The outpatient setting didn't have the nausea medication that I am able to use. So maybe it is better to have a colonoscopy done in a hospital setting when possible?? At least for me it is ;-)",
      "MessageIndex": 25,
      "PostDate": "07/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213133",
      "Title": "20th colonscopy Thurs"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "OK, I give. Here is the poop. When Katherine was very little, she somehow talked me into buying this little itty bitty iguana. He was about 4-5 inches long. We named him Fluffy and bought the iguana book at the same time we got him. Big mistake, HUGE! Iguanas are not easy to care for. They are prone to metabolic bone disease and need a very specialized diet, basking lights with UVA/UVB rays, continuous warm temperature and a certain amount of sunshine every day. Katherine was over him in about a week. Of course, I fell in love with him and he loved me. He followed me everywhere. Every day, I would take him out to our deck and he would sun himself and then dive in our fish pond and poop. He would never ever poop anywhere except in water (a real problem in the winter). That is also another common iguana quirk. We could leave him in the back yard as he would just do the above routine and then scratch on the back door when he was done. He really never wanted to be anywhere except with me. As Fluffy grew and grew, Danny, the engineer, built larger and larger plexiglass cages that had multiple lamps. They were bigger than a refrigerator (but horizontally placed). One day when I was getting him out of his cage, so that he could get his daily sun soak, I wasn't paying attention and didn't notice his claws were curled around a very large basking rock. I pulled out the lizard and the rock went Bam on my foot. Ouch! Fluffy didn't mean it as an iguana's claws are curled like that so that they can climb trees well. He was a lot of work, but I did truly love him. However, I would never buy one again and I don't recommend iguanas as pets. Way too much maintenance! And, because I know you will ask...Fluffy died at age 12 of a tail infection. In the wild, an iguana usually loses his original tail to predators. The new shortened tail is actually healthier. An iguana with its original tail is at high risk for infection as the very long tail has very poor circulation. When he first showed signs of an infection, I took him to the vet immediately. The vet was in over his head. I recommended amputating the tail and he looked at me like I had 2 heads. He tried to treat him conservatively, but the infection kept returning. He finally called some iguana expert in California who told him to do an Xray and see if the infection had spread to his pelvic bones. Of course, it had, and the expert said that he recommended euthanasia. Very sad. He was the sweetest pet and very smart. TMI, I know but you asked...lol!",
      "MessageIndex": 0,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223383",
      "Title": "OT Iguana Story"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Thanks so much for the important myth busters. During various colonoscopies, my doc has removed polyps that could have ended up becoming cancer--so the procedure may have prevented another cancer for me. My dad and uncle had colon cancer. My great aunt had breast and colon cancer. I am not crazy about having colonoscopies, but, trust me, I will continue having them as often as my docs recommend.",
      "MessageIndex": 27,
      "PostDate": "08/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213133",
      "Title": "20th colonscopy Thurs"
    },
    {
      "AuthorID": "CypressCynthia",
      "AuthorURL": "https://csn.cancer.org/CypressCynthia",
      "Content": "Sounds divine! Can't wait to try it.",
      "MessageIndex": 13,
      "PostDate": "30/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217347",
      "Title": "off topic...The Most Dangerous Chocolate Cake in the World"
    }
  ]
}