{
  "AuthorID": "Dee",
  "AuthorURL": "https://csn.cancer.org/Dee",
  "Posts": [
    {
      "AuthorID": "Dee",
      "AuthorURL": "https://csn.cancer.org/Dee",
      "Content": "hello Onco doc said yesterday he only gives chemo through a portacath(?not sure of spelling) as he believes this is easier on the body and saves looking for a new vein every time you need drugs or blood tests He said it is inserted under a light general and stays there throughout the course of the treatment Has anyone had experiance with this?",
      "MessageIndex": 0,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211318",
      "Title": "any thoughts on portacaths?"
    },
    {
      "AuthorID": "Dee",
      "AuthorURL": "https://csn.cancer.org/Dee",
      "Content": "laughter is the best medicine :) My kids have been such a source of strength for me and keeping me laughing has been one of the best things ever! I asked my 10 year old boy how he was feeling about the op (masectomy) and he shrugged his shoulders and replied \"eh..I didn't pay much attention to your boobs anyway mum\" hahahaha awesome! I nearly fell off my chair laughing! Have any of your children told you any gems lately? Dee",
      "MessageIndex": 0,
      "PostDate": "03/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211402",
      "Title": "the funny things kids say..."
    },
    {
      "AuthorID": "Dee",
      "AuthorURL": "https://csn.cancer.org/Dee",
      "Content": "I made it and it wasnt even the slightest bit as awful as I had made it out to be in my head! No nauesa,just a bit tired...but still managed to to Wendys for lunch Yum! lol thank you all SO SO much for all your advice, kind words, thoughts and prayers...it really did feel like you were all there for me...again thank you so much xx lotsa love Dee xx",
      "MessageIndex": 0,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212735",
      "Title": "1st chemo...the worst bit was walking thru the door!"
    }
  ]
}