{
  "AuthorID": "DeeNY711",
  "AuthorURL": "https://csn.cancer.org/DeeNY711",
  "Posts": [
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "There are many sources of weighted breast protheses online and off. The cost may be covered in full or at least partially by health insurance coverage. To determine the correct size (they are not sized according to cup size) find a bra shop with a certified mastectomy fitter. I have to tell you, though, that following double mastectomy, my biggest problem was having the bra ride up with weighted prostheses or unweighted.....didn't matter. I ultimately switched from bras to a camisole with breast form pockets. Your Mom might want to try wearing the prosthesis in the camisole worn over the bra for the other side. The camisole is available in the American Cancer Society's TLC catalogue; Appliqued Tank Top Item # 7432 Cost $30 each. It only comes in white. There are two styles, and I think the other one is less expensive, but I am so happy with the results that I wear mine as a sleeveless top with a light open shirt. You can see it online at http://www.tlccatolog.org (Hope this helps. The bra riding up was the greatest source of my dissatisfaction, discomfort and aggravation after surgery FOR MONTHS. Love, Denise)",
      "MessageIndex": 1,
      "PostDate": "21/08/2003",
      "ThreadURL": "https://csn.cancer.org/node/140975",
      "Title": "Prosthesis that works"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "HOORAYYYYYYYY!!! Standing on the computer chair clapping like a seal for you! LAST CHEMO... what a delight. Love, Denise",
      "MessageIndex": 2,
      "PostDate": "02/07/2003",
      "ThreadURL": "https://csn.cancer.org/node/140677",
      "Title": "My last chemo, hoorah!"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "Today I went for doppler echocardiography, during which 3 electrodes similar to the ones used during EKGs are connected: one to the right arm, one to the chest and one to the left arm. The test does not involve the use of the arms at all. The doctor runs a thing that feels a lot like a roll-on deoderant ball on the chest wall. After the test, my right arm felt extremely odd and it scared the raisins out of me because I am always concerned about lymphedema. However, tonight the arm is fine as if nothing funny ever happened. (Thank God!) I had a simple mastectomy on the left side, but had a modified radical mastectomy with lymph node dissection on the right side, both in January of 2003. I was wondering if anyone else has had tests involving electrodes (EKG, echocardiography) and whether there was a funny sensation in the arm following the exam that went away within hours? Hugs, Denise",
      "MessageIndex": 0,
      "PostDate": "07/10/2004",
      "ThreadURL": "https://csn.cancer.org/node/144913",
      "Title": "echocardiography"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "One of the things that consistently helped me through many months of treatment and debilitation were the thoughtful colorful cheerful cards sent by a number of people throughout the entire year. With a five year old, simple things like a new pencil and simple maze puzzles can mean the world to a child. I loved doing crossword puzzles because it kept my mind in a totally neutral zone for hours, yet I could put the puzzle down and come back to it later whenever I liked. Maybe a new box of crayons and a coloring book would be great for your nephew. I sleep better with a soft hat on... perhaps a cap from a favorite sports team would be nice for him. You can download coloring pages from Crayola's website. Sunday comic sections sometimes have puzzles suitable for young children. It really doesn't have to cost more than a postage stamp to send good wishes, though. Friends and family from all over the country clipped out fabulous photos and articles from their own local newspapers that were delightful! The regular messages from friends reminded me that I was treasured and not forgotten. They really did mean the most. I hope this helps. Love, Denise",
      "MessageIndex": 2,
      "PostDate": "01/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142434",
      "Title": "HOW TO HELP"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "One of my doctors said that simply having a history of cancer puts a person in a higher risk category for developing blood clots. If you do not feel it would be fruitful to try to discuss this with your doctor, look at the Memorial Sloan Kettering site About Herbs, Botanicals and Other Products at http://www.mskcc.org/mskcc/html/11570.cfm Hugs, Denise",
      "MessageIndex": 3,
      "PostDate": "20/02/2004",
      "ThreadURL": "https://csn.cancer.org/node/142237",
      "Title": "wheat grass"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "You are very welcome, and your nephew and all of the family will be in everyone's prayers. Love, Denise",
      "MessageIndex": 3,
      "PostDate": "02/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142434",
      "Title": "HOW TO HELP"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "My last chemo was in August, and I also still have difficulty managing fatigue. If you think back to the years before it \"hit the fan\" you will probably recall that the holiday season has always been followed by a period of bone weary fatigue. Be patient with yourself. You've been through a lot. It is simply not yet possible for you to do everything the way you used to do it. That day will come, though. Love, Denise",
      "MessageIndex": 10,
      "PostDate": "08/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141772",
      "Title": "Hello I still find out especially after the Holidays that I still get tired very easy and worn out ."
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "I bet when your 19 year old was planning to savor a weekend home at this point in his first year at college, he was not thinking about the thrill of going to the movies. He was thinking about sleeping in his own home in his own bed with his own family there. He was thinking about just taking a break and relaxing, away from the stress of preparing in the coming weeks for finals. He was thinking about having a couple of days off from the daily college routine. Maybe he was thinking about the refrigerator being accessible 24/7. During the aftermath of diagnosis, surgery and during treatment, I thought that if I had realized the anguish I would cause my own two sons, I would have stuck with adopting a series of cats who live like royalty at my expense, and skipped having children only to leave them devastated and lost upon my death. I think you may be the only one who truly understands exactly what I mean, and that means a lot to me tonight. We are all simply doing the best that we can with this situation. We are not made-for-TV characters. I thank God every day for watching over my husband and our two sons because God knows I can't manage that on top of everything else. Oh, and here is the best way to move past this. The things you torture yourself over are never the things that your children even recall. The things that they might cite as flawed moments on your part are moments that you would cite as your finest in parenting. In other words, don't worry about this stuff. Love, Denise, and thank you for taking the time to post this message",
      "MessageIndex": 4,
      "PostDate": "28/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142886",
      "Title": "ROTTEN Mother"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "Thank you so much for gathering this information together for the benefit of everyone. It is much appreciated! Love, Denise",
      "MessageIndex": 1,
      "PostDate": "03/06/2003",
      "ThreadURL": "https://csn.cancer.org/node/140466",
      "Title": "My Favorite Web Sites - Helpful Information"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "The good news is that you will find you'll have this really stinky week now followed by a pretty okay week and then a fairly normal week before your next treatment. Flush, flush, flush with water. The really awful stinky days are very few. Hugs, Denise",
      "MessageIndex": 8,
      "PostDate": "25/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141910",
      "Title": "Chemotherapy Cyttoxan & Adriamycian"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "I have been mixing plain unflavored gelatin in water and taking it every day for about 3 weeks now, and also find that the gelatin actually does alleviate joint pain better than pain medication. I can sleep now, too. What a treat! Hugs, Denise",
      "MessageIndex": 1,
      "PostDate": "29/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141981",
      "Title": "Great way to take jello!!!"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "The nice part about AC is that you have a stinky week, followed by a better week, followed by an almost normal week. The fear and anticipation is horrific on that first appointment date. Thanks for taking the time to let us know that Mom got past that first appointment okay.",
      "MessageIndex": 1,
      "PostDate": "06/02/2004",
      "ThreadURL": "https://csn.cancer.org/node/142075",
      "Title": "update on mom"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "When the plan for surgery, chemotherapy and radiation therapy given to me, it was as if a sledge hammer fell between me and what used to be my life. All of the information about each, in combination with all of the negative things said by others about each, made for a crushing burden of decisions. Here is my very best piece of advice. Despite all of the things I have read on the message board about Adriamycin, Cytoxan and Taxotere, my experience has been no where near as dire as things described in lurid detail. It was no walk in the park, but I now have only two chemo treatments left (and the radiation & Tamoxifen)and I'm glad that I at least tried. When it hits the fan, there is absolutely no feeling worse than the feeling you get knowing that you could have done something, but chose not to. One way or the other, you are the one who must live with the consequences of your decision. I completely understand your wish for your life to return to normal, and share it 100%. When I read the same statistics you read, my mind says that the failure rate without adjunctive therapy is close to 20%, but with it, the failure rate is 14.4%",
      "MessageIndex": 2,
      "PostDate": "09/07/2003",
      "ThreadURL": "https://csn.cancer.org/node/140710",
      "Title": "risk of not taking tamoxifin?"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "I was so happy to find a post from you tonight! I had to giggle at the hospital menu part. The dietary ladies always found it astonishing that I consumed everything on every tray at every meal and placed the refuse in a neat little pile. It took until Day 3 to realize how long it was between supper and breakfast the next day, and learn to squirrel things away for later. Then I had it all! 3 meals a day prepared by culinary arts students, AND SNACKS for watching TV. Whoop-dee-do! Love you, Denise",
      "MessageIndex": 7,
      "PostDate": "07/06/2004",
      "ThreadURL": "https://csn.cancer.org/node/143602",
      "Title": "herceptin's downside - not pretty"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "Thank you so much for letting us know things are going beautifully for you! Congratulations!!",
      "MessageIndex": 2,
      "PostDate": "08/10/2003",
      "ThreadURL": "https://csn.cancer.org/node/141237",
      "Title": "I'm Back!!!!!!!!!!!!!!!!!!!!!!!!"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "Who scolded you for not doing BSE after bilateral mastectomies? I also had bilateral mastectomies. There is no breast tissue left to do BSE on.",
      "MessageIndex": 1,
      "PostDate": "15/07/2003",
      "ThreadURL": "https://csn.cancer.org/node/140757",
      "Title": "Question about BSE after Reconstruction"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "Ditto. I also nursed both babies and never had meds to dry milk up, but developed breast cancer anyway. In New York, there was meticulous research done in an attempt to define a link between breast cancer and insecticides used to fog the suburbs in the 1940's and 50's, but no link could be established. Jill, don't beat yourself up over what you did or did not do. Millions of women who did the exact same things as any of us never developed breast cancer. Hugs, Denise",
      "MessageIndex": 6,
      "PostDate": "31/05/2003",
      "ThreadURL": "https://csn.cancer.org/node/140433",
      "Title": "looking for a cause"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "Barb, we seem to be within four weeks of one another as far as surgery and chemo. I had a modified radical mastectomy on the right side and a simple on the left side. In December, I developed a \"pointy\" sort of pain under my left shoulder blade and am so relieved to find your message here tonight. I thought I pulled a muscle during daily one hour long exercise sessions 4-6 times each week. It seems to abate whenever the gym is closed for a holiday or Sundays. It bothers me a lot when I'm on the computer. Grrrrrrrr... yet one more thing. Phooey. I was going to ask whether there are any lymph nodes under the shoulder blade, but chickened out. I'm at the scared to ask but not looking for trouble OR appts stage. Hugs, Denise",
      "MessageIndex": 1,
      "PostDate": "05/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141746",
      "Title": "spasms in shoulder"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "I'm simply going to copy and paste information from a google.com websearch. What you really need to do is discuss your concerns with your Mom and her oncologist. There are plenty of people who make money selling hope to cancer patients and their family members. Cartilade costs $44 for 100 capsules and as per review by BC Cancer Agency Care and Research: Unconventional Therapies Cartilade Summary \"Shark cartilage proved worthless in the first careful scientific study for such products last year involving shark cartilage treatment for cancer. There is a protein in cartilage that can inhibit angiogenesis in test-tube laboratory research. However, this does not mean that cartilage can fight tumors in the human body. The most serious problem is that the active ingredient in shark cartilage is too large to be absorbed into the blood stream from the digestive tract, and actually perform any function. This is what happens to the shark cartilage promoted for human use. A typical regimen of shark cartilage costs $700 per month [U.S.]",
      "MessageIndex": 1,
      "PostDate": "09/09/2003",
      "ThreadURL": "https://csn.cancer.org/node/141072",
      "Title": "CARTILADE"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "Is it possible that this might be caused by the cumulative effect of clenching your teeth together tightly when stressed over these past months?",
      "MessageIndex": 1,
      "PostDate": "09/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142562",
      "Title": "facial pain"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "My gallbladder is g-o-n-e. History. But gallbladder is definitely a possibility if you have one, especially if the pain hurts worse in the shoulder when you bend over.",
      "MessageIndex": 3,
      "PostDate": "05/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141746",
      "Title": "spasms in shoulder"
    },
    {
      "AuthorID": "DeeNY711",
      "AuthorURL": "https://csn.cancer.org/DeeNY711",
      "Content": "After all you have been through, the removal of the portacath will be a piece of cake. The facial hair issue will resolve on its own. My surgery was in February of 2003, chemo ended August 11, 2003, radiation ended December 10, 2003 and I still have to be very careful in managing activity and rest. I still tire easily. Now, I am able to work an eight hour shift and walk out to the parking lot pretty well, but noticed that if the air is damp, take ten points off my energy level. If it is going to snow or rain, take 20 points off of my energy level and take medication for aching joints. We are both doing fine. Hooray for us! Love, Denise",
      "MessageIndex": 2,
      "PostDate": "31/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142947",
      "Title": "has any one had their portacatheter taken out"
    }
  ]
}