{
  "AuthorID": "DJC",
  "AuthorURL": "https://csn.cancer.org/DJC",
  "Posts": [
    {
      "AuthorID": "DJC",
      "AuthorURL": "https://csn.cancer.org/DJC",
      "Content": "Hi Marilyn - like you and everyone else who has responded to your post, I, too, have encountered huge mood swings since I was diagnosed and treated with chemo this past year. And looking like a human tennis ball and being thrown into premature menopause certainly hasn't helped my frame of mind much either. I started seeing a therapist this past month and tell you what, there is nothing more freeing emotionally than to sit and to be able to talk about nobody or nothing but yourself and your own well being, unencumbered by the guilt we women naturally manifest when talking about ourselves, for an entire hour. Please know that you are not alone in this regard and from what I hear and have read, more often than not we get to feeling better and stronger when we recognize and seek out help to lift our spirits - sometimes through therapy and/or the support of our loved ones, friends and sisters in this fight - and sometimes with the assistance of prescription drugs (I'm taking Buspar, myself) - or a combination of both types of assistance - but recognizing a need for support is the first step for all of us. Good luck on seeking out help if you decide to go that way. And I sincerely hope you feel better soon. Donna",
      "MessageIndex": 9,
      "PostDate": "08/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141772",
      "Title": "Hello I still find out especially after the Holidays that I still get tired very easy and worn out ."
    },
    {
      "AuthorID": "DJC",
      "AuthorURL": "https://csn.cancer.org/DJC",
      "Content": "Hi All - this seems like a very silly question, considering all the treatments and surgeries we go through and have gone through since being diagnosed with this disease - but here's my question anyway, has anyone out there used Grecian Formula to bring back color to their new hair growth after chemo? I finished chemo in mid-December and now have about 1.5 inches in new hair growth - but to my consternation, it has come in mostly gray - I don't want to color it because it is growing so fast - so I thought this might be a viable alternative - this or a henna rinse - thoughts on the subject? Also, I've read some pretty negative press of late on the use of permanent brunette coloring over time and its promotion of cancer. Have you all read the same? Thanks in advance for any responses that might come my way. Donna",
      "MessageIndex": 0,
      "PostDate": "01/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142440",
      "Title": "Grecian Formula"
    }
  ]
}