{
  "AuthorID": "Double Whammy",
  "AuthorURL": "https://csn.cancer.org/Double Whammy",
  "Posts": [
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "So happy for you. Suzanne",
      "MessageIndex": 18,
      "PostDate": "19/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220795",
      "Title": "laughs a lot's test is ok"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Don't forget that. Eating healthy is just what it is - healthy overall. I think it's important whether it prevents cancer or not. And life is too short not to have that cheeseburger, fries and a milkshake sometimes. Suzanne",
      "MessageIndex": 9,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218249",
      "Title": "Remember Our Organs"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "On the pecking order of things to be upset about during breast cancer, my lack of hair really doesn't trump being alive, but I just sat down and cried about it anyway. I did, however, make a decision - and that's to get a wig. Even if I miraculously start growing hair tomorrow, it's going to still be several months before it will look decent. I was actually looking forward to having a short GI Jane do, but I don't. My husband took some pics yesterday. I posted one on my Expressions page. I really thought the dandelion analogy was fun a couple of months ago, but it is no longer fun. I'm going to find something else for my profile when I get around to it. I compared the photos to photos of the day we buzzed my hair, and even though my hair was thin and fine, I definitely had a lot more of it. I'm 7 months post chemo and 9 months since I lost my hair. Being bald and in treatment was ok. I was sick and it was what it was. I'm not sick anymore and this constant reminder is not ok. I see my primary care physician on the 29th. Just looking for sympathy. Maybe it will get better in time. In the meantime, I think a wig will make me feel better at least occasionally. I just hate to spend any more $$ because of cancer. Suzanne",
      "MessageIndex": 0,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216750",
      "Title": "I'm going wig shopping!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "\"They\" seem to like to watch the liver enzymes, don't they?  Is that because bc likes to go to the liver?  So here's a positive thought. . . I was told that patients with mets typically  have symptoms before any blood work goes wonky, so wonky blood work by itself is not always reliable.  Yet, I know your mind goes there.  As Doris says, it doesn't really matter the stage, we don't let our guard down.  And neither do our docs, and that's why they check everything out.   I'm hoping this is one of those mysteries and levels go back to normal asap.  I do still want to be on that bus, tho.  My, oh my, we certainly do protect our chilidren, don't we?  And that's why they think we're invincible, brave, or whatever.  Just had this conversation with another survivor yesterday.  Her husband called kids (adults) as soon as she got the dx.  She called him from car - he called kids!   She would never have done that.  We do crazy things when we get news like this.  How wonderful that your daughter is getting married.  What a joy it will be to help plan the wedding.  I know you two are very close and she's probably honored to be with you at your appointment on Tuesday.  Suzanne (who will, of course, sends hugs and prayers in addition to riding the bus)",
      "MessageIndex": 6,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254818",
      "Title": "Pink Bus on Tuesday"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I hope the biopsy is ok and this whole discussion is moot. Remember, I had both breast and endometrial cancers at the same time. There was never a question about not having a hysterectomy and when the diagnoses were made, no one knew whether my breast cancer was \"significant\" or not. If it turns out that your biopsy is positive, please be sure to see a gynecologic oncologist, not a \"vanilla\" gynecologist. They are the experts and only a gyn oncologist can do the staging. My gyn oncologist was well aware of my breast cancer dx and the breast peeps knew/know about the endometrial cancer - and they communicated with each other. Talk to your medical oncologist about this, I'm sure s/he would help you connect with one. Regardless of the outcome, I wish you the best. If I can answer any questions about the endometrial stuff, feel free to send me a private message. Oh, my gyn/oncologist is a male. Not all male gyns are insensitive. Suzanne",
      "MessageIndex": 6,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225293",
      "Title": "Biopsy and surgeon visit"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "The prep for a colonoscopy is absolutely barbaric. How awful you have to do it again and again. I remember thinking \"what's the big deal? It's only one day/night?\" And then I had to have a colonoscopy . . . my heart goes out for you, Denise. Suzanne",
      "MessageIndex": 2,
      "PostDate": "13/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/236895",
      "Title": "O.T. Monday annual colonscopy"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "and I support it - and if you change your mind, I support that too.  On one hand I think it is wonderful that we are allowed to make our own decisions regarding treatments while on the other hand, I wish someone else would do it.  Nonetheless, that we have this option and understanding our disease is empowering.  You have handled all of this information, as difficult as I'm sure it was, with intelligence and grace.  Thank you for letting us know.  Hugs, Suzanne",
      "MessageIndex": 8,
      "PostDate": "31/01/2013",
      "ThreadURL": "https://csn.cancer.org/node/253564",
      "Title": "Latest MRI..."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "My tumor was Grade 2 (in the middle). While waiting for my oncotype test results, I decided I would do chemo unless my score was lower than 13 (or whatever the highest number is in the low risk range). I just knew my score would be in the mid range, just like yours. It was 31. I didn't need to make a decision. I had chemo. Taxotere and Cytoxin, 4 times. My personal decision was also based on the fact that I was 63 and knew I would only get older and develop other age-related health issues, so I felt now would be best for me while my health was still good (except for the cancer thing). I wanted to be able to give it all I could while I could. Only you can make that decision for you. It's good to hear what others chose, given similar scores. Chemo is no walk in the park, but it is doable. Good luck. Suzanne",
      "MessageIndex": 7,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237612",
      "Title": "Oncotype Dx Score of 19 - What to do? Chemo/No chemo"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "It's almost 8 months since my last chemo and my fingernails are no longer peeling and completely normal, but just yesterday I lost a toenail. Only my big toenails seem to have been effected. Finally lost the left one, waiting on the right one. I'm hoping the slow growing/falling off of my toenails means there's still a chance all my hair will return! Suzanne",
      "MessageIndex": 5,
      "PostDate": "13/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218063",
      "Title": "Toenail"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "For those who are new, my last chemo was September 23, 2010. I still have very little hair on my head (maybe 25% of what I used to have). This is consistent with the rest of my body hair. I have some, just not very much. Today I learned pretty much what I already knew, but it's still unknown whether it's possible that I will get more hair or not. I think it was agreed that the culprit is the Taxotere, but they all act like they've never seen this or heard of it before. So today I had a biopsy to determine whether or not I have any hair follicles where I don't have hair. No follicles = no hair and I can just close this chapter of my life. It is what it is. I saw 3 dermatologists today. The senior dermatologist said he had never seen such a response to chemotherapy before, but that usually most chemo patients don't end up with as much hair as they started with. Really? I didn't know that. Of course, Arimidex could be contributing. If the biopsy shows alive follicles, they may produce hair after Arimidex, but if no follicles, then I'm not going to grow any hair regardless of stopping Arimidex (which I'm not about to do). I just want to bring in the verdict on this hair thing. I don't understand all these supposedly bright minds acting like they've never seen this before! I know it's rare, but you know, even if they personally haven't seen it, they should know about it, shouldn't they? Actually, only my primary care physician has acted like she knows what probably happened - heck she's even drawn a picture for me! Anyway, my friends, I'll get my results late next week. Then I can move on. Suzanne",
      "MessageIndex": 0,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240715",
      "Title": "Finally saw dermatologist today about the hair thing"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I see many posts from people who made a significant difference in my life when I went through my ordeal in 2010.  Some of these women are now facing the beast again and this makes me so sad and sometimes fearful, but I'm well.   I keep coming back here to check on all of you and to make connections and offer any support to new folks. I guess you could say I'm here for the long haul, hoping to lend help and support, hoping to never need help again, yet continuing to remain connected.  Love you all, Suzanne",
      "MessageIndex": 0,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://csn.cancer.org/node/291373",
      "Title": "The Long Haul"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "and frightening. So sorry all this happened. I'm beginning to wonder just what is it that oncologists and surgeons do? Seems like the don't do weekends, evenings, or consider glitches as part of their jobs! Just don't have a problem on a weekend, or anytime not during office hours! I can't tell you how many times I had SE (minor, especially compared to yours) that I felt totally dismissed. Then they'd be so caring and sweet when my routine visit would come around. I learned to call my PCP. She would (and will) always see me (except for the weekend thing, of course) and at least make me feel like I mattered. It seems the oncologists know things will often get better or if they don't, they'll just fix them whenever . . . Happy Easter. So glad this is behind you. Or at least I hope it is. Suzanne",
      "MessageIndex": 7,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238145",
      "Title": "Another 5-day visit to hospital!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I think you came to the right place, Cricket.  I, too, am a Stage 1 survivor, almost 3 years now.  It took me at least 2 years to sort of relax a bit, but I still worry, especially around appointment time.  And everything new that goes on with me physically, makes me wonder.  Thank God I feel really really good 99% of the time.  I understand about hanging on to your wigs.  My friend is a 10-year survivor and she keeps hers on hand for insurance against a recurrence.  I gifted some hats and scarves (I didn't have a wig) and then most of my hair never returned and I wish I had them back.  Bad karma getting rid of things before their time!  Now I wear a wig!! We \"get it\", Cricket.  Most friends who have not had cancer really don't.  You will see many of us posting about our concerns that if we told some of our friends about, we would be told to get on with our lives and put anything cancer behind us.  I learned (and now accept) that our friends do get tired of hearing about it and I finally figured out that this is the place to come when I need that shoulder or cyber hug to get me over whatever I'm facing.  It's sort of like a bookclub.  If you don't read, you have no interest in whatever book is being discussed and you'd rather talk about something else.  You get tired of hearing about it. Welcome! Suzanne",
      "MessageIndex": 2,
      "PostDate": "07/09/2013",
      "ThreadURL": "https://csn.cancer.org/node/262596",
      "Title": "transitition from cancer patient to survivor, and living with side effects"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "This is so horrible!  I have NEVER in all the gazillion times I've had a mammogram even worried that something like this could happen.   I'm very happy your mammogram is clear, but this event does not sound like it should happen under any circumstances.  Hope you're not in a lot of pain. Suzanne ",
      "MessageIndex": 5,
      "PostDate": "17/08/2015",
      "ThreadURL": "https://csn.cancer.org/node/296099",
      "Title": "Yea 5year mammmo"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "in the stack of chemo information I got, it says not to have any immunizations while on chemo unless you ask your oncologist. I have a friend who had a flu vaccine while on chemo - and she got the flu. But you're not on chemo, right? I'd still ask my oncologist first. Suzanne",
      "MessageIndex": 1,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200006",
      "Title": "To flu or not to flu"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "So happy for you Marge. Just in time for the holidays. Suzanne",
      "MessageIndex": 19,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232158",
      "Title": "Six month visit with Med Onc"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "First, let me preface this with the statement that I'm absolutely not against monies raised to fund breast cancer research. Afterall, I had it and I want a cure found. I do wonder about all the pink stuff being sold and what all the money raised is actually being used for. Second, I'm sick and tired of pink, pink, pink, and the breast cancer hype. There are other cancers. My latest tirade: I just returned from the grocery store where there was a display dedicated to a chardonney produced by a company \"One Hope\". There it was, sitting out in the aisle so you can't miss it, all in pink, including the ribbon. Part of the sale is being donated to the \"Fight against breast cancer\" (whatever that means). I just visited the One Hope website. They have other wines for other causes, a cabernet for autism, a merlot for AIDS, a pinot noir for supporting Children's Hospitals, a zin for supporting our troops, a sauvignon blanc for saving our planet, and other varieties for a charity of your choice. Nice marketing ploy to sell wine. I don't know whether the store carries the other varieties, but I do know that the breast cancer wine sure as heck had a prominent display and I saw no others. I'm going to look for the others next time I'm there. Some people are like lemmings. I'm sure they'll sell this wine because supporting breast cancer is simply the thing to do these days. My friends who have had or have other cancers are not particularly happy that although they're active in fundraising, a lot of people don't support their efforts because of all the pink everywhere. I don't have an answer or even a good explanation for why I (a breast cancer survivor) feel the way I do about all the pink. The women who have had breast cancer and others have done an excellent job in raising awareness and generating funds. This is a good thing. I participate in events, too. Maybe it's the \"commercialization\" of breast cancer that irks me. Maybe it's because I am also an endometrial cancer survivor, have a friend who went through it at the same time as me, and now have another friend with it. Yet, I think many women don't know the early warning signs of endometrial cancer. Maybe because I've lost far too many people I knew to brain cancer. So I'll just whine about the wine for now. Suzanne",
      "MessageIndex": 0,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224234",
      "Title": "Wine Whine"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Have a wonderful day.  And here's to many more birthdays. Suzanne",
      "MessageIndex": 3,
      "PostDate": "13/01/2015",
      "ThreadURL": "https://csn.cancer.org/node/291540",
      "Title": "Today is VickiSam's Birthday!!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Did the Tamoxifen cause endometrial cancer or complex atypical hyperplasia?  I remember you needed a hysterectomy but I don't remember what the final pathology was.  I had endometrial cancer and had uterus, cervix, ovaries, fallopian tubes, lymph nodes -the whole kit and kaboodle -removed.  I have regular pelvic exams AND Pap smears from tissue at the top of my vaginal vault (every 4 months for fist 2 years, now every 6 months) - because even though my cancer was early stage, low grade and was confined to less than 50% invasion of uterine wall, there is a remote possibility it can recur.  And if it does recur, it typically happens at the top of the vaginal vault.   These exams are standard follow-up protocol (for endo cancer) for 5 years.   I have a \"friend\" who has no problem telling me it's ridiculous that I have to have exams because \"there's nothing up there anymore!\".   Denise, if you don't know what your pathology was, be sure and ask.  You said your uterus was greatly enlarged from the Tamoxifen and the concern, of course, is endo cancer.  If you didn't have endometrial cancer, then I'm not sure why you need further exams. I so understand the desire of wanting to no longer have to have the dreaded gyn exams!  But that exam saved my life 3 years ago, so I'll keep having them until I'm told I no longer have to. Suzanne",
      "MessageIndex": 4,
      "PostDate": "22/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254348",
      "Title": "Tomoxifen vs Hysterectomy"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "My weight is totally dependent on what I eat and how much I eat, and being older and more sedentary does not help.  I lost 25 lbs. on Tamoxifen because I stopped eating everything in sight and exercised regularly.  You know, the things that are good for anyone. . . I've gained some of it back lately because I've been once again eating everything I see and not exercising as much.  When I pay attention to what I'm doing, I can be successful.  It may be easier to gain weight on Tamoxifen and more difficult to lose weight on it, but for me, I think the issue was more related to my age and lack of discipline.  I can eat so much ice cream, it's embarassing. Suzanne",
      "MessageIndex": 33,
      "PostDate": "27/05/2016",
      "ThreadURL": "https://csn.cancer.org/node/208086",
      "Title": "Tamoxifen and weight gain"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Except for ice cream, of course.  We all know the drill about overeating and eating bad things,  but our bodies (especially when undergoing chemo) need good nutrition and calories to work efficiently.  I lost weight during chemo and in hindsight I really don't know why.  There were times when eating was a chore, but it was a chore I made myself do because I knew it was important fuel.  I did try to maintain and eat mostly what was good for me which is the food I actually prefer anyway.  After chemotherapy, you can focus on weight loss.  For now, please focus on health.  You might ask to see a nutritionist because I understand there are some foods that can really help get through the process.  Congratulations on being halfway through.  Suzanne Suzanne ",
      "MessageIndex": 4,
      "PostDate": "23/09/2016",
      "ThreadURL": "https://csn.cancer.org/node/305464",
      "Title": "Losing weight on diet"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "That ol' pink bus is sort of like Santa's sleigh, isn't it? We will be able to be there for Kathi's sister and get to Renee's PET scan in the blink of an eye. Hang on everyone, we're in for quite a ride tomorrow! Suzanne",
      "MessageIndex": 10,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233588",
      "Title": "Pink Bus Requested for KathiM's Sister-Monday"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I'll be there for your MRI with lots of noise to distract you from the sounds in the tube. Suzanne",
      "MessageIndex": 3,
      "PostDate": "10/10/2013",
      "ThreadURL": "https://csn.cancer.org/node/263567",
      "Title": "Pink Bus Please"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I'm glad your labs were ok. Have you hooked up with a social worker at your medical facility regarding financial assistance? As Jennifer suggests, check with the drug company as well. Wishing you the very best, Suzanne",
      "MessageIndex": 8,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/236954",
      "Title": "Oncologist this afternoon...hoping for answers."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I totally agree with Teach76.  I understood that the question was about Tamoxifen causing or not causing weight gain and wanted to convey my experience.  Weight should also not be a concern about whether to take the drug or not.  The estrogen therapies are said to be very effective and the possibility of weight gain should not even be considered when balancing the risks vs. benefits.  This is all a conversation to have with your oncologist, you need to trust your oncologist and get answers to any questions you may have about why a certain protocol is being recommended for your specific cancer.  Best of luck to you.  It is a long and difficult journey, but one that hopefully will all be worth it. Suzanne",
      "MessageIndex": 35,
      "PostDate": "27/05/2016",
      "ThreadURL": "https://csn.cancer.org/node/208086",
      "Title": "Tamoxifen and weight gain"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "and many, many more. Suzanne",
      "MessageIndex": 1,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229823",
      "Title": "Today is Ladyg's Birthday!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Three times in three years is way too many times. I'm so sorry you have to go through this again. Sending prayers and hugs and hopes tht your visit to Mayo will put things into perspective and provide some peace for you. I keep saying this, but I mean it - I hate cancer! Suzanne",
      "MessageIndex": 30,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "and hopes and well wishes. Thank you for letting us know. Please keep us all posted. Suzanne",
      "MessageIndex": 11,
      "PostDate": "06/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/236781",
      "Title": "Texasgirl 10 update"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Three times in three years is way too many times. I'm so sorry you have to go through this again. Sending prayers and hugs and hopes tht your visit to Mayo will put things into perspective and provide some peace for you. I keep saying this, but I mean it - I hate cancer! Suzanne",
      "MessageIndex": 80,
      "PostDate": "10/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I got my first set from an Ulta store and paid one of the hairdressers ($10) to put them on me and show me how to do it. I found that if I put on liner first, I had a line to follow to place them. If necessary, I'd touch up the liner, but it usually wasn't necessary. I also found that using a Q-tip to position them before the glue dried really worked well. I did have problems sometimes, but I really felt good with eyelashes. I loved wearing them and have considered wearing them now, too, since I don't have all my lashes and what I have are puny, but what I have seems to be ok with lots of mascara. Linda, I'll help you if you have problems. It takes a little practice - and yes, sometimes I'd lose one. The number on the lashes I purchased is 110, they're really nice and natural looking. Target, CVS, Ulta, everyplace has them and they even go on sale sometimes. I also always purchased more than one set at a time. After a while, the glue becomes difficult to remove. Remember, permanent makeup is also a great investment, but it is quite an investment. I wish I'd done the permanent makeup years ago. My friend just had it done and she's still on chemo, but be sure to ask your oncologist before getting tatooed. And remember, even women who aren't cancer patients wear this paraphenalia. It's called vanity. Suzanne",
      "MessageIndex": 10,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/234723",
      "Title": "I would like your advice please..."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Been thinking about you lots, Chen. I don't like it when you don't post. So sorry about the edema and other nasty side effects. Good that you have a cousin \"in the business\" to keep you supplied with frozen peas! My very very bestest to you- Suzanne",
      "MessageIndex": 10,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224064",
      "Title": "Treatment plans, Side Effects, you Kindreds know, the usual!!!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Thank you for putting this into words and for reminding me that no matter what the question, problem, news (good or bad) is, you have all become an important part of my life, too. Everyone's willingness to share the trials and tribulations of her/his own personal journey has only strengthened me on mine. Love you all, too. Suzanne",
      "MessageIndex": 62,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Thank you for putting this into words and for reminding me that no matter what the question, problem, news (good or bad) is, you have all become an important part of my life, too. Everyone's willingness to share the trials and tribulations of her/his own personal journey has only strengthened me on mine. Love you all, too. Suzanne",
      "MessageIndex": 14,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I was dxd in 2010 with both breast and endometrial cancers.  For years, I had low levels of Vitamin D  (13).  I just couldn't wrap my head around taking it every day even though my pcp advised me to, told me all it was needed for, etc.  Then bam - the news of cancer.  One of the first things my oncologist said to me is we need to get the levels up so I took 50,000 IU for whatever time I was supposed to and got things back into normal range - up to 39 in Dec. 2010.  Been taking 2000 IU daily since.  Last 2 tests put me at 24 which is lower than she'd like.  She suggested I try switching to liquid because \"although there is no scientific evidence, it seems to be absorbed better\".  I think I actually get more than 2000 IUs daily because it's just difficult to gauge with the dropper so we'll see how my levels are with my next blood work end of June.  My oncologist also said \"10-15 minutes in the sun every day and don't tell the dermatologist\".     I do believe that Vitamin D is important.  I don't believe I got cancer because my levels were low, but I believe it was one of the risk factors that contributed. Suzanne",
      "MessageIndex": 3,
      "PostDate": "27/04/2013",
      "ThreadURL": "https://csn.cancer.org/node/258171",
      "Title": "low serum Vitamin D correlated with cancer - Vital to get tested"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "My heart smiled when I looked at your pictures. Thank you for sharing these and showing us your new/old normal. Suzanne",
      "MessageIndex": 6,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210951",
      "Title": "new pix up"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "How could this happen? I'm so sorry I missed the bus, Denise, but I know there were plenty aboard to give you that support (and drive the folks doing your biopsy crazy). Needless to say, I'll be keeping you in my prayers, hoping for B9 results from your biopsy. And, now we have the weekend. . . Hugs, Suzanne",
      "MessageIndex": 22,
      "PostDate": "26/10/2012",
      "ThreadURL": "https://csn.cancer.org/node/248952",
      "Title": "4th time asking for PINK Bus in 6 wks"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Sorry, Carol, but I'm afraid you're going to have to be OUR expert on the effects of Eribulin. My little hopeful brain thinks that since it's been approved for use in breast cancer, it will do the trick and put you back into remission, because it must have already worked for others! Best of luck with this \"new\" chemo. Suzanne",
      "MessageIndex": 6,
      "PostDate": "26/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/219272",
      "Title": "Has anyone been on Eribulin?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "How could this happen? I'm so sorry I missed the bus, Denise, but I know there were plenty aboard to give you that support (and drive the folks doing your biopsy crazy). Needless to say, I'll be keeping you in my prayers, hoping for B9 results from your biopsy. And, now we have the weekend. . . Hugs, Suzanne",
      "MessageIndex": 55,
      "PostDate": "26/10/2012",
      "ThreadURL": "https://csn.cancer.org/node/248952",
      "Title": "4th time asking for PINK Bus in 6 wks"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Deb, you might try some volunteer work. When I completed my treatments I started volunteering at my cancer center. I've met some wonderful new friends - both women and men. We have so much in common. For me this has been the most rewarding part of my healing. How ever you make new friends, they will have other friends and who knows, maybe someone for you to date. Now what I'm doing in 2012 for fun - Tuesday I start knitting lessons (I just can't seem to get it on my own) with two of my new friends. Happy New Year everyone. Suzanne",
      "MessageIndex": 12,
      "PostDate": "01/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233050",
      "Title": "while we all pray for improved health, do we have a New Year's Resolution for fun?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Hi Doris- So sorry to hear about the taxol, but I'm sure he has a Plan B and lots more tricks up his sleeve.  Good luck on Wednesday.  I'll be standing by to hear from you on what next. Suzanne",
      "MessageIndex": 5,
      "PostDate": "12/04/2014",
      "ThreadURL": "https://csn.cancer.org/node/270588",
      "Title": "Taxol Failed ..."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "We're supposed to support you when you have things like this going on! Well, I'll support you now anyway, but wish I'd known what you have been dealing with. So I'm sending hugs, support, and prayers for that remaining 10% certainty. When is the surgery? Legion? Are you sure he didn't say \"lesion\"? Suzanne",
      "MessageIndex": 11,
      "PostDate": "09/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233694",
      "Title": "Some 'HAPPY' news -- Just want to share with all of you -- thru the good times, and bad"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "But we've just got to do something about Traci - she's really getting rowdy. It sounds like your oncologist is on top of everything and I don't think this sounds like bad news at all. Just sounds like he wants to up his troops a bit and since you've shown you can tolerate the chemo you're currently on, he's giving it an extra punch. Go Avastin! Hope you continue to tolerate these drugs well and we keep that ugly beast in its cage! Suzanne",
      "MessageIndex": 4,
      "PostDate": "01/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231469",
      "Title": "Scan results...."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I don't want to hear any complaints about Pap smears - I now have one every 4 months because of my endometrial cancer! Really, I don't mean to make light of any of this because I know this is serious business, but just want to be on record that (I think) I'm the frequency champion of Pap smears amongst this group. And my routine Pap smear saved my life, so make sure you all stay current having them. As women who have had breast cancer, I think it's particularly important that we remain our own best advocates and be sure we stay on top of any and all appropriate screening tests. No one mentioned a colonoscopy to me prior to chemo (I'm not \"due\" yet) and I had just had a hysterectomy prior to chemo so I don't know if either of those tests would have been ordered had I not been up-to-date. You probably had ekg, chest x-ray prior to surgery and they already have a good sense of what's going on with your heart and lungs. VickiSam, I hope your recheck gives you good results. I think our physicians are much more cautious with anything out of the ordinary once we've had a cancer diagnosis of any kind. This is a good thing. Suzanne",
      "MessageIndex": 7,
      "PostDate": "06/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213408",
      "Title": "Yearly pap and colonoscopy"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Thank you for letting us know.  I wish it was happier news.  I will keep her in my prayers.  I feel so lucky to have met her 2 years ago.  She is one very very special lady. Suzanne",
      "MessageIndex": 59,
      "PostDate": "16/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Thank you for letting us know.  I wish it was happier news.  I will keep her in my prayers.  I feel so lucky to have met her 2 years ago.  She is one very very special lady. Suzanne",
      "MessageIndex": 12,
      "PostDate": "16/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "You know you've got my prayers added to those of many, many others. You now have a plan in place and already underway. Lots of love, hugs, and prayers, Suzanne",
      "MessageIndex": 28,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/227065",
      "Title": "Next step in my journey"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I had shingles about 5 years ago (before cancer).  Since you can get it a second time, I asked my pcp if I should get the vaccine.  She said there was no data to support whether it prevents a second occurance or not, but I could have it if I wanted it.  I declined.  I just better not get them again! Suzanne",
      "MessageIndex": 2,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/252210",
      "Title": "Little bit of info about the Shingles Vaccine I found"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I'm sooo sorry you have such severe anxiety prior to medical stuff.  I'm all for support groups (we're all here aren't we) but did he have any suggestions for drugs?  If one is in a high state of anxiety, learning techniques that can be helpful and/or getting support just doesn't happen if you can't come down enough to be able to receive it..  This has all been a really hard time for you.  Please get all the help you can get to help you.  It's hard to fight when you're down.  Sending hugs, Suzanne",
      "MessageIndex": 4,
      "PostDate": "18/10/2013",
      "ThreadURL": "https://csn.cancer.org/node/263771",
      "Title": "Well this is just great! NOT :("
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Sue, I didn't respond to your post asking for support and encouragement because I didn't have a mastectomy. I'm sending support and encouragement, anyway AND I'm getting on the bus with the rest of the rowdies. Suzanne",
      "MessageIndex": 6,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/229504",
      "Title": "The Pink Bus Is Rolling For Sue Relays - Let's Show Our Support"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I don't know what to say, and I don't know what I'd do if this happened to me. Do you think he wanted to get caught? Sending hugs. Remember, I have a former son in law named Guido . . . Suzanne",
      "MessageIndex": 34,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I don't know what to say, and I don't know what I'd do if this happened to me. Do you think he wanted to get caught? Sending hugs. Remember, I have a former son in law named Guido . . . Suzanne",
      "MessageIndex": 84,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Because I was diagnosed with both brest and endometrial cancers, 4 days apart.  A double whammy! Suzanne",
      "MessageIndex": 7,
      "PostDate": "19/08/2015",
      "ThreadURL": "https://csn.cancer.org/node/296208",
      "Title": "screen names-curuious if what they mean to everyone"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Advice about the biopsy - take 800 mg. ibuprofen about 45 minutes before the procedure. Makes a world of difference. Ask me how I know. . . Here's hoping your results are benign. Will be thinking about you Thursday. Do you need the bus? Suzanne",
      "MessageIndex": 9,
      "PostDate": "21/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224821",
      "Title": "One step forward and two steps back?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Wonderful news. NED is surrounded by so many. Don't make him too tired now. Maybe you all could just give him a few minutes off his feet. A man's got to regenerate himself! Suzanne",
      "MessageIndex": 28,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223231",
      "Title": "Make room for one more on the dance floor."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I like your new look, too, Char! Suzanne",
      "MessageIndex": 9,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225212",
      "Title": "Char"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I'm going to get permanent eyeliner and maybe eyebrows (since I don't have any). A friend wondered if it was ok and thought maybe I should check with my doctor first. I'm tired of checking with my doctor for every little thing. Besides, some of you are getting nipples tatooed. And Heather, weren't you getting a new tat? How is this different? I think it's ok, but don't want to be foolish. What say you? Suzanne",
      "MessageIndex": 0,
      "PostDate": "14/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220562",
      "Title": "Permanent makeup - a vanity issue"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "You sound like a young woman since you say you have a 9 year old son.  I'm not saying that makes losing breasts any harder or easier, but losing what makes us feel feminine can be devastating.   Losing breasts IS a big deal for so many women.  Of course, you're happy to be alive, and losing breasts vs. losing your life is a no brainer.  It still doesn't feel good to not feel whole.  I hope you can wait and have a successful reconstruction down the road.  I was 63 when I had my surgery (a lumpectomy) and even at my age, I am often so thankful I did not have to have a mastectomy.  No one understands the loss or what breast cancer surgery and treatments leave us with.  It matters how you feel, not how someone else tells you they think you should feel.  All cancer surgeries leave people with a scar, but a scar from abdominal surgery doesn't have the same impact as losing a visible part of us.  I had a hysterectomy for uterine cancer and I dont look at those scars (laparoscopic) and say, OMG, I don't feel feminine - even though losing my reproductive organs probably contributed more to making me a woman than my breasts.  It's just not the same. Altho I have my breast, I have been left with permanent hair loss.  I think I understand what it means to lose a part of yourself that makes you feel feminine.  Of course, no one dies from not having breasts or not having hair, but . ..  Sure we can cover up the damage from surgery and treatments (I wear wigs, you can wear a prosthesis) and feel good for a while, but at the end of the day . . . . . Time has indeed helped me emotionally.  I do hope you can have a successful reconstruction, but perhaps you would benefit from some emotional support.  We can provide that, but some professional help might be needed to help you set a direction and problem solve some of the issues you're facing.  I'm not saying that makes everything ok and get over it, please understand that I don't mean that.  Intellectually we know our physical health trumps our physicality, but we are individual emotional beings and it's really ok to feel whatever we feel.  Sending my hugs and support that a solution will be found for you.  Perhaps a second opinion from a different plastic surgeon?  At a major teaching hospital? Suzanne",
      "MessageIndex": 7,
      "PostDate": "16/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288708",
      "Title": "failed reconstruction"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Great news, Georgia. Hope you can relax now - at least until next year. Hugs, Suzanne",
      "MessageIndex": 10,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/234365",
      "Title": "Update on mammo freak out!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "started even before I was diagnosed (2010).  It would be interesting to get some feedback from anyone who actually refused chemotherapy and radiation and how they're doing today.  The thing is, this breast cancer thing is a crap shoot.  The data on recurrence is for a population that was studied.  If, for example, you're told that amongst the people studied with the same type, stage,  grade, and genetic makeup  of breast cancer that you have, and  30% of the people studied had a recurrence without chemotherapy (that's what my ocotype test said), you don't know if you're going to find yourself amongst the 70% who did not recur, or the 30% of those who did.  There's simply no way of knowing for sure.  In my case, which is the only one I'm intimately familar with, chemotherapy was risk reducing, not life saving and it  shifted the number of recurrences from the 30% group to something like 12%.  Well, there's an 8% chance of getting breast cancer in the first place amongst the general population and  I figured since drew the card that put me in that 8%, chemo was a good idea.    I had chemotherapy and I had radiation and I take Tamoxifen (I have been told that hormone therapy is every bit, if not more, important than chemo).  I'm fine today.  I often wonder if I really \"needed\" chemotherapy for a number of reasons - mostly because I'm still here and nothing bad has happened.  If I had not done chemo and had recurred, then I know I would have always wondered and beaten myself up about not having the protocol that was recommended for ME and my specific breast cancer.   We are all different and we have to make the decisions that are best for each of us.  Just make an INFORMED decision.  Get a second opinion if you want, and get all the answers to the questions you have. Best wishes, Suzanne ",
      "MessageIndex": 7,
      "PostDate": "23/05/2015",
      "ThreadURL": "https://csn.cancer.org/node/182624",
      "Title": "Has anyone out there refused chemo?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "and had chemo. Waffle,you said \"randomized for chemo treatments\". Does this mean you had them or not? Just curious. My onc told me she had a hard time getting women to participate in the Taylor X study because most wanted to be able to make the choice themselves. Suzanne",
      "MessageIndex": 9,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215382",
      "Title": "If you had oncotype, what was your score?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Having experienced this 3 times with our pets, my heart aches for you. However, I believe it is one of the kindest gifts we can give our animals when they are in pain and suffering and death is right around the corner. It is also one of the most difficult decisions we have to make. If it's too soon, your vet will tell you. An ethical vet will not euthanize a pet unless the end of that pet's life is very near and the animal is suffering. Keep loving the furry darling for the rest of his life here with you. Hugs, Suzanne",
      "MessageIndex": 8,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214129",
      "Title": "my dog has cancer"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "One of my favorite songs by Leonard Cohen! But I can't carry a tune in a bucket, so go to You Tube and listen to KD Lang http://www.youtube.com/watch?v=P_NpxTWbovE. Can't get a much better Halleujah than that. Love, Suzanne",
      "MessageIndex": 1,
      "PostDate": "29/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232996",
      "Title": "Can I get a HALLELUJAH???"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "This is, indeed, good news. Very good news. Welcome in the New Year with open arms. Suzanne",
      "MessageIndex": 8,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/233133",
      "Title": "Biopsy update"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "for radiation to follow chemo if you've kept your breast (had a lumpectomy) and in some cases even after mastectomy. If you need chemo, they don't delay it because chemo is systemic and will hopefully destroy any microscopic cells in other areas of your body they don't know about. Doing radiation first would let them sit there and grow undisturbed. Radiation is the bullet to areas they KNOW you had cancer. With a lumpectomy, you still have breast tissue and since they didn't remove all of your breast, there could be some other areas left behind. All cancer treatments can cause a secondary cancer, including chemotherapy. Because treatments are improved and cancer patients are living longer, more of the long term effects are presenting themselves. For me, I wanted to do whatever I could to kill the breast cancer and both chemo and radiation (and Arimidex) were recommended. When facing surgery, I was told if I had a lumpectomy that I would also have to have radiation, that the odds were pretty much the same in early stage cancer with lumpectomy and radiation vs. mastectomy. I don't know what they would have said if I said I want a lumpectomy but no radiation. No one knows what the future is going to bring. I figured I needed to deal with the breast cancer because we KNEW it was there. IF a secondary cancer develops, I'll deal with that. The odds are small, but certainly not unheard of. Are you considering NOT doing radiation? Suzanne",
      "MessageIndex": 1,
      "PostDate": "26/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221364",
      "Title": "Does radiation make sense when you have already gotten chemo?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "The bottle would be empty if it was mine! Kathi, I'm glad they are taking everything seriously - and I hope the outcome is nothing.  I guess the good thing is if you were to present yourself to your doc with no past history of cancer, they might just watch this to see if anything changes.  You are being taken seriously and when this turns out ot be nothing, you can know it's nothing instead of waiting.  And if it is something, you will know how to proceed.  When do we need to get the bus out again? Suzanne",
      "MessageIndex": 7,
      "PostDate": "07/05/2015",
      "ThreadURL": "https://csn.cancer.org/node/294026",
      "Title": "Pink Bus back in the garage....for the moment...."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "How do you feel? How are you supposed to feel? So happy you were a candidate for this new drug. Hope it does its job well. Suzanne",
      "MessageIndex": 13,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221108",
      "Title": "Wish me luck! Here I go with the new chemo drug!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I start tomorrow. It's encouraging to hear you did so well. Suzanne",
      "MessageIndex": 3,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197146",
      "Title": "first day in the chemo bay"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Yahooie! I'm so happy for you. Suzanne",
      "MessageIndex": 14,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230893",
      "Title": "Good News from the Onc"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I'm drawn to vivid colors. I love reds and - black (is that a color)? I wear a lot of jewel tones (and black) or with black. I think every room needs some black and something red. Suzanne",
      "MessageIndex": 23,
      "PostDate": "29/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/231219",
      "Title": "I thought it would be great to see what your favorite color is, so, what is your favorite color?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Talked to Re earlier this afternoon and I contacted Lisa. I'm going to take food - Thursday I think is my day. I hope she's home from the hospital and whatever they're doing fixes whatever is going on. I'll keep on praying for her. She's got lots to do here still. We are a powerful group when we put together all our collective energies. Indeed. Suzanne",
      "MessageIndex": 7,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://csn.cancer.org/node/246760",
      "Title": "Update on Linda Simmons from her Caringbridge blog.."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Merry Christmas. Hugs, Suzanne",
      "MessageIndex": 18,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/250913",
      "Title": "Surgeon Just called home # left message..HE has results"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "and hugs, too. Suzanne",
      "MessageIndex": 2,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "You need it and yet they make you crazy with all the ways they try to avoid paying anything.  So far, I haven't had any problems with mine (that I know of).  I hear stories like yours and wonder what on earth people are supposed to do.  There's the public perception that all is well.  Well, it is - as long as you're young and healthy and only need a flu shot.  You need a hobby?  When I finished treatments I learned how to knit.  I could never knit in all of my attempts over the years.  Well, I did and now I'm hooked.  I find knitting very therapeutic.  They say the rhythm of the needles is like music to the sole.  And for me it is, it's rather meditative.  I always have a simple project on some needles to take with me when I have a doctor appointment because it makes the wait go by more quickly.  So, Carol,, that's my 2 cents about a hobby.  A simple knitting project that you can pick up and take your mind away.  Plus it feels good to me to create something.  I assume crochet would also have the same effect.  And somewhere today I read that knitting helps prevent Alzheimers. . .  just sayin' . . . Suzanne",
      "MessageIndex": 5,
      "PostDate": "22/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288806",
      "Title": "Sometimes I wonder when the Merry-Go-Round is going to stop!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "So happy surgery is over and healing has begun.  That sounds like one tough surgery.  Must be difficult not knowing (again) what type of cancer this is all about.  Hope they can figure that out soon and you can begin treatment with the knowledge that they will be treating the right type of cancer with the right chemo.  Thanks for checking in.  Will keep you in my thoughts. Suzanne",
      "MessageIndex": 9,
      "PostDate": "28/04/2016",
      "ThreadURL": "https://csn.cancer.org/node/301928",
      "Title": "Surgery is done"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Beautiful cakes and crochet. In my neck of the woods, there are many private cake makers who have home-based businesses. The trick is knowing who they are here - mostly happens by word of mouth. They are the ones to find, tho, because they will go outside the box and do something special for that special occasion. Good luck! You can do it. You might try Esty for your crochet items. I turned my love of sewing into a business about 12 years ago. The trick is finding the right niche to make your time worthwhile. I sew primarily \"to the trade\" and only items for the home (primarily window treatments, but also pillows, cushions, bedding, etc.). This means I sew for interior designers because they value my work and have the clientele who want custom work. For my embroidery, I don't do hats and shirts like many of the large embroidery shops do. I do custom monograms on pillows, slipcovers, linens, totes, etc. Big shops don't want to do one of a kind things. Fits right into my design trade niche. I can't afford me. There must be a similar niche for your interests/hobbies. Maybe hook up with an event planner for special cakes for special occasions? You go, girl! Suzanne",
      "MessageIndex": 2,
      "PostDate": "11/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216102",
      "Title": "Pics of my hobbies now posted on my expressions- Enjoy"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "and hugs, too. Suzanne",
      "MessageIndex": 53,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "It's a Word file.  How do I either post it or get it to you?  Suzanne  ",
      "MessageIndex": 1,
      "PostDate": "02/07/2014",
      "ThreadURL": "https://csn.cancer.org/node/281454",
      "Title": "Call out to Double Whammy For a Question"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "So good to read that our Traci is doing well.  Take good care of her as she heals.  Whew. Suzanne",
      "MessageIndex": 12,
      "PostDate": "30/01/2015",
      "ThreadURL": "https://csn.cancer.org/node/291910",
      "Title": "Update on TraciInLA"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "can be difficult in young women, I've heard. I've also seen a lot of women on this board get oophorectomies to avoid ovarian cancer and hysterectomies with oophorectomies to avoid the potential side effect of endometrial cancer from Tamoxifen. I would discuss this long and hard with your oncologists simply because of your age. They do prescribe drugs like Effexor to help with hot flashes but I don't know if it's helpful with all the other menopausal effects. I had both breast surgery and a hysterectomy/BOS last year because I had both breast and endometrial cancers. For me, I had no problems with surgical menopause because I was 63 years old and well past natural menopause. I'm on Arimidex now and I do have an occasional mild hot flash, but again, I'm now 64. On the other hand, I have this theory (based on absolutely no medical background or information) that we're going to start seeing a lot more endometrial cancers because gynecologists are now avoiding the hysterectomies they used to perform on younger women and so women are aging with a uterus intact to grow cancer in. There are others on this board your age who will be able to offer you more information/advice. Best wishes to you - Suzanne",
      "MessageIndex": 2,
      "PostDate": "09/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222097",
      "Title": "Hysterectomy and Breast Cancer"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I'm glad you're getting another opinion because I bet someone could do it.  You might try an academic medical center.  That being said, here is a similar story:  my friend had a growth on her lung.  It was in a difficult to access area.  Turned out to be mets from kidney cancer (and she's still perfectly ok 2 years later because the specialists at Stanford then knew what to do).  They needed to know what it was so they could treat it appropriately.   She was referred to a thoracic surgeon who truly thought he was God.  In fact, he told her she had been sent to the right person and even said \"if anyone can get to this, I can\".  He couldn't.  At our local community medical group, an interventional radiologist said \"I can do this\".  It was difficult and dangerous, her lung did collapse, but folks were right there to deal with the situation.  If your third opinion is the same as the others, then get all of your questions answered and let them know you are frightened and uncomfortable.  Make them explain everything to you and try to put your mind at ease about the next steps.  You may have to accept that no one can biopsy the growth, but it is especially good that you get another opinion.  Good luck. Suzanne",
      "MessageIndex": 5,
      "PostDate": "28/04/2017",
      "ThreadURL": "https://csn.cancer.org/node/309273",
      "Title": "I'm So Confused"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Duh and done . . . new topic:  Questions to Ask Your Doctor  ",
      "MessageIndex": 3,
      "PostDate": "03/07/2014",
      "ThreadURL": "https://csn.cancer.org/node/281454",
      "Title": "Call out to Double Whammy For a Question"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Thanks for letting us know how you're doing, Meena. You've been so good at keeping us up to date. Suzanne",
      "MessageIndex": 39,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211820",
      "Title": "Meena .. How are you doing, our PINK WARRIOR .. We are thinking about you"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Congratulations! You're done with rads and good to go for Saturday! Looking forward to meeting you in person there. I'll be the old lady still wearing a hat and false eyelashes . . . . Suzanne",
      "MessageIndex": 17,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214794",
      "Title": "I am a rad grad! Yipee!!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "A good friend took Arimidex for 7 or 8 years. She called it the \"Dutch protocol\", based on research done in Holland. Her husband is a rad onc so they did a lot of research and her med oncologist seemed to think it was a good idea, especially since she was HER-2 positive and she did not have chemo (her decision). She was diagnosed b4 Herceptin was used as first line treatment (it was only used for recurrence or mets at the time). She's still ok today, but is insecure without Arimidex as it and radiation were her only treatments (she was stage 1, but still HER-2+). Scarey stuff, this crap shoot we're all participating in. Suzanne",
      "MessageIndex": 6,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/250982",
      "Title": "Taking Tamoxifen Longer May Better Protect Against BC Recurrence"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I guess you just have to say \"thank you\" and love him for coming up with something he thought you'd appreciate.  Did he have to rally the troops via Facebook, tho?   Oh my!   Who the hell wants any gift when they've been told they have cancer, anyway?  It isn't a party . . . . Big hugs, Suzanne  ",
      "MessageIndex": 8,
      "PostDate": "19/03/2013",
      "ThreadURL": "https://csn.cancer.org/node/256396",
      "Title": "Mortified!!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Depending on the number of infusions they are recommending for your sister and the current condition of her veins, she might not need either.  I had 4 sessions of Taxotere and Cytoxin.  I did not need a port nor a PICC line.  My veins are ok and I have had blood drawn often since chemo.   I was 63 when I had chemo, so if age plays into the equation, I was old, and I'm fine.  I'm under the impression if I had needed a longer protocol, I would have had a port, and I've noted the women here who had longer chemo protocols had ports while those of us on the 4 cycle protocols didn't.  Suzanne",
      "MessageIndex": 8,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266667",
      "Title": "pros and cons of pic lines or a port"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Don't expect him to \"know\". It sounds like he is not the one for you, that he's selfish, and emotionally unavailable. Have you actually told him what you need/want from him? My guess is your relationship has created dance steps that make it ok for him to go do whatever he wants to do as long as he pays for it (nice home, financial security) and so he provides \"things\" to be able to be a naughty boy. If that dance has worked for the past X number of years, why would he think it no longer works? Especially if you don't tell him it ain't working? And, do think practically. Seek legal counsel and have a plan in place that works for you. Once you start treatments, you honestly won't be in a place to make huge emotional or physical places, but if you have a plan in place and a goal somewhere down the road, you will get through treatments with much less dispair. The most important thing now is to get treated and on the road to recovery. Then you can address other significant potential changes. What do you talk about at the end of the day when you go to bed and how loving or unloving (I'm not talking about sex) is that experience? Suzanne",
      "MessageIndex": 8,
      "PostDate": "28/06/2012",
      "ThreadURL": "https://csn.cancer.org/node/242290",
      "Title": "Unsupportive husband"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "The loss of your dear friend must be devastating. I hope you will find comfort in knowing that she is no longer suffering. Suzanne",
      "MessageIndex": 25,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214341",
      "Title": "With a heavy heart.."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Thank you so much for the message.  I've been following your updates from Janice, but it is so wonderful to hear from you personally.  I hope the Gemzar isn't too awful and mostly that it does its job! You are in my thoughts and prayers daily. Hugs, Suzanne",
      "MessageIndex": 6,
      "PostDate": "27/07/2013",
      "ThreadURL": "https://csn.cancer.org/node/261329",
      "Title": "Hi, it's me Texasgirl10"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "  I just know that estrogen blockers and Herceptin are not options and so chemotherapy is usually recommended. But she had a dinky tumor and was node negative???  I have no idea.   The bottom line is you and your wife do not feel comfortable with the advice of no chemo, so I strongly suggest you get a second opinion and that you get it from someone whose specialty is breast cancer, not a general oncologist.  Good luck. Suzanne",
      "MessageIndex": 1,
      "PostDate": "13/02/2016",
      "ThreadURL": "https://csn.cancer.org/node/299996",
      "Title": "Triple Negative - No Chemo????"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Congratulations. About being part of the \"cancer community\", I just want to comment that this community truly understands and helps us understand and accept whatever it is that is going on with us in our lives - because having cancer effects everything. Knowledge is power and I can't imagine what my life would have been like without this community. Obviously, people's lives go on without being connected to others with similar hopes and fears and outcomes, but I'm so happy to have you all. Real happy. Hugs, Suzanne",
      "MessageIndex": 25,
      "PostDate": "19/10/2012",
      "ThreadURL": "https://csn.cancer.org/node/248525",
      "Title": "BENIGN!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Please keep us updated. Suzanne",
      "MessageIndex": 17,
      "PostDate": "18/08/2013",
      "ThreadURL": "https://csn.cancer.org/node/261986",
      "Title": "Prayers needed now for Dawne please"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Thanks for the update. I hate that you've been through so much both physically and emotionally. You tell your roommate to watch out, a pink bus full of all of us may pull up and have a little chat with her when she's least expecting it. It is true that when someone gets cancer, everyone involved with that person also is effected. It sounds like she was very mean and that's just not ok! Great news on the boyfriend front, tho. Post pictures! I'm an old broad who just loves a good love story. Hope you will end up with a treatment plan that you can tolerate and one that knocks the socks off this stupid disease. Hugs, Suzanne",
      "MessageIndex": 6,
      "PostDate": "16/02/2012",
      "ThreadURL": "https://csn.cancer.org/node/235745",
      "Title": "Time for an update!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "as you and I tolerated it quite well.  While I was prescribed Neulasta the last 2 sessions because I had what I call mystery infections and skin toxicity, I really had no life threatening or incapacitating side effects, but I did have side effects and I had only 4 sessions of T/C.  I was so happy for it all to be over.   I do remember clearly that I could have worked all but the last session if I hadn't already been retired.  I did not feel THAT bad for THAT long.  If I had had a job, I would have planned my infusions on Wednesday.  I didn't start to feel bad until about 3-4 days after the infusion and that would have given me the weekend to take care of myself.  My hair fell out on Day 13.  I was as completely bald - everywhere.  I am one of the people whose hair did not return (I have some, but much less than an 80 year old man) and it is devastating.  It is rare, very rare, but it does happen.  Just know all the risks ahead of time and discuss themwith your oncologist, who will likely say they've never seen it before.  I don't know if  this is worrisome to you but I feel very strongly that women should be informed of it.  I wish I would have been warned this might happen, altho I do think I would have taken that risk.  This result just would not have been a surprise. Chemo is no picnic no matter what, but it is very doable and usually is a short period of being unwell on the big picture. Good luck, Suzanne",
      "MessageIndex": 7,
      "PostDate": "24/10/2016",
      "ThreadURL": "https://csn.cancer.org/node/306101",
      "Title": "Taxotere/Cytoxan newbie"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Looking forward to meeting everyone - now in 6 days. Suzanne",
      "MessageIndex": 3,
      "PostDate": "20/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214473",
      "Title": "One week from today!!!!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "just to feel safe.  I'm confused about the size of your tumor.  Is it .8 cm (8 mm) or  point 8 mm (millimeters)?  It is indeed dinky if it is .8 mm.  Look at a ruler and see how dinky .8 mm is, that's less than 1 mm which is really really dinky.   We really should have been schooled in the metric system because it is difficult to visualize anything that small even being identifiable, but maybe that's the amount that had broken out of the duct to be officially called invasive.  I just think a second opinion is in order so you can feel assured that you're making the right choice.  Know that we have all been where you are right now, scared to death, and sort of in limbo.  May you get to the place where many of us are now, looking back in our rear view mirrors and recognizing that our decisions were the correct ones - and most often the ones recommended by our oncologists.  I don't think I will ever be totally confident, but with each passing year it does get easier. Best wishes, Suzanne",
      "MessageIndex": 3,
      "PostDate": "18/11/2016",
      "ThreadURL": "https://csn.cancer.org/node/306602",
      "Title": "Treatment for HER2 Positive Small Tumor?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Now, did you ever think you'd be happy about that?  I was on Arimidex and then Tamoxifen for 5 years.  I had no joint pain while on either - other than the I'm getting old pain and stiffness which was there before and is there after.  So I'm probably no help as I had no pain on either drug.  Now, get that rotator cuff fixed and see how it is.  I don't think the tamoxifen would interfere with surgery, but ask the surgeon and oncologist.  Best, Suzanne",
      "MessageIndex": 4,
      "PostDate": "02/02/2017",
      "ThreadURL": "https://csn.cancer.org/node/306994",
      "Title": "tamoxifen question"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Oh my, Carol, some of the things on your bucket list really frighten me.  I know ziplines are not on mine.  I sure hope that woman was arrested and charged with battery.  That was just awful what she did and she is an awful person.  I'm pleased to see that you're able to keep on doing in spite of all of your troubles.  Broken ribs now?  Good grief. Suzanne",
      "MessageIndex": 1,
      "PostDate": "16/08/2016",
      "ThreadURL": "https://csn.cancer.org/node/304821",
      "Title": "Update on Brain Radiation"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "to each and everyone this holiday season.   Hugs, Suzanne",
      "MessageIndex": 5,
      "PostDate": "24/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/251909",
      "Title": "Merry Christmas, Happy Chanuka & Happy New Year to my dear Pinks & their Loved Ones"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Keep on dancing . . . Suzanne",
      "MessageIndex": 20,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/199976",
      "Title": "And the News Just Gets Better"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "and so perfect for this time of year, Taleena. Thank you for sharing this. My little sister is also the age of my oldest (how the heck did this happen? I was an only child!). I was present for the birth of her two children and it is an amazing experience. Also an experience we wonder how we survived and why we willingly did it more than once (or at least I did)! Anyway, because of the age difference between my sister and me, her children call me Auntie Grandma. I love it. I also count them as grandchildren, as my sister spent a lot of time with us growing up and was like our fifth child. She never felt like a sister, more like a daughter without the responsibility. Enjoy your new neice. Suzanne",
      "MessageIndex": 13,
      "PostDate": "28/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208576",
      "Title": "The Miracle of Life.... I just had to share..."
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "for a second opinion. They are the experts. Yes, a hysterectomy is major surgery, and it was much more frightening to me than breast surgery. And no, I wouldn't have one on a whim, but I was scared enough by the word cancer not to give it a second thought. My biopsy showed atypical hyperplasia and areas that were suspicious for adenocarcinoma. I was immediately referred to a gynecologic oncologist. He took this very seriously and he performed the hysterectomy (DaVinci robotic assisted laparoscopic hysterectomy). And it was cancer. And it had grown into the wall of my uterus 1/3 of the way. Lucky for me, it was early stage and grade 1, and I didn't need adjuctive therapy, but I have pelvic exams and Pap smears every 4 months. I had no symptoms - endometrial cells showed up on a routine Pap smear. Ultrasound showed the lining of my uterus to be 9 mm, then the biopsy. I've been wondering with so much media about unnecessary hysterectomies, how many women will go on to develop endometrial cancer and if the rate of postmenopausal endo cancer will increase - simply because they still have a uterus for it to grow in. I asked whether I would reap a double benefit from the chemo I received for breast cancer just in case there was an endo cancer cell floating around somewhere. Oncologist said no, the chemo for bc is not effective for endo cancer. Different cocktail. What can be effective for both, tho, is aromatase therapy. Interesting. I start that next week for my breast cancer. I may not need adjunctive therapy for my endo cancer, but it does sort of give me a sense of security (false or not) that I'm doing something that might also keep the endo ca at bay. Suzanne",
      "MessageIndex": 9,
      "PostDate": "11/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/207288",
      "Title": "D & C again (just had 6mths ago)"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Don't do anything you don't want to do, drink lots and lots of water, rest (don't overdo) and take all your meds as directed. Report side effects if you have them when you have them. They usually have help for just about anything that happens. Good luck to you and your husband. Suzanne",
      "MessageIndex": 7,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233561",
      "Title": "Here's the plan---What advice or experiences can you share?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "because this post is so out of character from other posts which have been encouraging and inspirational.  I hope you seek relief from these side effects and it's successful.  I'm so sorry you've had such awful nausea and can find a way to relieve it without stopping the treatment.  Lots of good suggestions and the best of which is of course, talk to your oncologist.  Mine always said she had a bag of magic fixes for any side effects.  Hope you find the right potion. Hugs, Suzanne",
      "MessageIndex": 10,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://csn.cancer.org/node/257998",
      "Title": "Need what?"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Are they also tearing? Suzanne",
      "MessageIndex": 3,
      "PostDate": "05/10/2012",
      "ThreadURL": "https://csn.cancer.org/node/247836",
      "Title": "Eye twitching"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I'm so sorry Femara acted like the other AIs you've had and you can no longer tolerate it.  Sending all the good mojo I can muster up. Suzanne",
      "MessageIndex": 4,
      "PostDate": "13/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266629",
      "Title": "Femara update"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Carol, the time of your post is 4:43 a.m.?  That's not night!  Are you not sleeping?  I also didn't know you were going back on Arimidex.  Hope you tolerate it better than the Femara. Re clinical trials and research for Stage IV.  I just don't understand why funding and research isn't there.  Of course, we want to figure out how to keep peeps from reaching Stage IV, but it is very obvious that some do in spite of early stage clinical trials.  And some people are Stage IV from the time of diagnosis, so come on people, let's stop thinking only about prevention and early treatment/cure and let's put more effort into killing the beast when it is at it's beastiest (that's a new word)! Hugs, Suzanne",
      "MessageIndex": 9,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266629",
      "Title": "Femara update"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "If your symptoms are worse, do you think you should wait a few days? I haven't heard of this side effect, but I got side effects I hadn't heard of either. Are you running a fever? When was your chemo? Listen to your body. If you're feeling apprehensive about waiting, go to the ER. Better safe than sorry. In the meantime, I'll add my prayers and thoughts that this will pass. Suzanne",
      "MessageIndex": 2,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224250",
      "Title": "I think I may be in trouble"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "These are the stories of encouragement that I think are so important for new members to read.  Congratulations and thanks for letting everyone know about your success.  I'm now 3+ years after completing my treatments for Stage 1 IDC and it feels so good to feel good and have less anxiety (not none, but a lot less) about the whole ordeal.  May you both have continued good health. Suzanne PJS - I'm going to strart another thread about lifestyle changes so the topic won't get lost.  ",
      "MessageIndex": 5,
      "PostDate": "16/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266661",
      "Title": "Five years ago today!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Step one, kick, step 2, kick. Kick, kick, kick. Shuffle ball change. Kick kick kick. Rest and regain your strength. Sounds like you've mastered Step 1. Great to hear everything went well. Suzanne",
      "MessageIndex": 11,
      "PostDate": "05/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229802",
      "Title": "I'm home surgery done"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "I don't have arthritis, but I was scared to death to start Arimidex.  I was also osteopenic.  I stared at the bottle for a month before I finally said, \"how will I know if I have side effects or not if I don't try it\".  I did and had no side effects - until . . .  my next dexascan showed more deterioration and actual osteoporosis.  I did not want to take a bisphosphonate and I did not want osteoporosis to progress.  I wanted to stop Arimidex anyway to see if it was having an influence on my lack of hair (that didn't all return after chemotherapy).  My oncologist said she didn't like the idea of me not taking anti hormone meds and instead suggested switching to Tamoxifen.  She explained that Tamoxifen is actually good for your bones.  Neither Arimidex or Tamoxifen work if you don't have any ER+ cancer cells and I like to believe that I don't so why do I have to take either?  Well, because  . . . . just in case.  So I switched a little over a year ago.  My hair is still the same but I feel sort of good about the Tamoxifen instead of Arimidex because of the osteoporosis thing.  Before Arimidex, there was only Tamoxifen and many postmenopausal women still take Tamoxifen.  I think \"they\" feel the aromotase inhibitors are better, but by what percentage?  And afterall (I thought) I did everything I was supposed to and it can still come back no matter what I take or do (unlikely, but possible).  So I'm taking my Tamoxifen and worried about getting a blood clot instead of osteoporosis.  Why can't I just be 25 again! Our diagnoses and ages are very close - I'm 66 (67 June 16 but not yet!), had Stage 1, Grade 2, ER+ PR+ breast cancer.  I did have chemotherapy because of high oncotype score.  I didn't have clear margins on tumor, but had a larger chunk of my breast removed for reduction (it was larger than the other one) at time of surgery so margins were very clear on the chunk.  There is no one size fits all in this breast cancer thing, but you have to do what feels best for you.  I'm content with my decisions, but I often wonder if I really \"need\" to be on Tamoxifen (or Arimidex).  I can't wait to stop it and I doubt that I'll do more than 5 years. I just don't want to. Suzanne  ",
      "MessageIndex": 1,
      "PostDate": "02/06/2014",
      "ThreadURL": "https://csn.cancer.org/node/276904",
      "Title": "Scared to begin Arimidex"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Dear JoJo- You and your family are in my thoughts and prayers. This is an amazing group - thank you for asking for our support. Suzanne",
      "MessageIndex": 43,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Thanks for this thread. My breast was just fine until after radiation was over (Dec 1). Now it aches and is tender. Since it didn't hurt b4 radiation, I figured it was related to the rads, but it is really helpful to know this. \"They\" didn't tell me about this! Suzanne",
      "MessageIndex": 11,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208870",
      "Title": "Breast still tender 1yr later after lumpectomy"
    },
    {
      "AuthorID": "Double Whammy",
      "AuthorURL": "https://csn.cancer.org/Double Whammy",
      "Content": "Dear JoJo- You and your family are in my thoughts and prayers. This is an amazing group - thank you for asking for our support. Suzanne",
      "MessageIndex": 93,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    }
  ]
}