{
  "AuthorID": "Dwwilburn",
  "AuthorURL": "https://csn.cancer.org/Dwwilburn",
  "Posts": [
    {
      "AuthorID": "Dwwilburn",
      "AuthorURL": "https://csn.cancer.org/Dwwilburn",
      "Content": "I finished chemo in May 2011. One day this summer I was sitting in a meeting at work with all men. I rubbed my finger across my chin and I realized MY KNUCKLE HAIR WAS BACK! I was SO happy! But, I didn't thing the guys would appreciate it. Now my head hair is back, I am keeping it short. I feel like letting it grow long would jinx things. I don't know why hair loss is so dang traumatic. I am sorry you have had to lose your hair twice.",
      "MessageIndex": 19,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230876",
      "Title": "short note on Hair..."
    },
    {
      "AuthorID": "Dwwilburn",
      "AuthorURL": "https://csn.cancer.org/Dwwilburn",
      "Content": "This story made my day!",
      "MessageIndex": 13,
      "PostDate": "27/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230876",
      "Title": "short note on Hair..."
    },
    {
      "AuthorID": "Dwwilburn",
      "AuthorURL": "https://csn.cancer.org/Dwwilburn",
      "Content": "I am so so sorry you are going through all of this. I don't know what message God is trying to send either. I had a lumpectomy, so I didn't have to go through all that you have. I can relate to the sadness and the anger. Talking with other people with breast cancer, I think everyone has that up and down with anger and being sad. When I didn't have any hair, I listened over and over to Bruce Springsteen's Streets of Philadelphia song. I know it was about AIDS, but I could so relate. I was bruised and battered and I couldnt tell What I felt I was unrecognizable to myself I saw my reflection in a window I didn't know My own face Oh brother are you gonna leave me Wastin´away On the streets of philadelphia [ Lyrics from: http://www.lyricsfreak.com/b/bruce+springsteen/streets+of+philadelphia_20025067.html ] I walked the avenue till my legs felt like stone I heard the voices of friends vanished and gone At night I could hear the blood in my veins Black and whispering as the rain On the streets of philadelphia Aint no angel gonna greet me Its just you and I my friend My clothes don't fit me no more I walked a thousand miles Just to slip the skin The night has fallen, Im lyinawake I can feel myself fading away So receive me brother with your faithless kiss Or will we leave each other alone like this On the streets of philadelphia",
      "MessageIndex": 1,
      "PostDate": "01/09/2012",
      "ThreadURL": "https://csn.cancer.org/node/245922",
      "Title": "I am so freakin done"
    }
  ]
}