{
  "AuthorID": "e_hope",
  "AuthorURL": "https://csn.cancer.org/e_hope",
  "Posts": [
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "yes... it does .. hang in there... also expect some tenderness when it comes back in...",
      "MessageIndex": 15,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181096",
      "Title": "Does head soreness go away after hair comes out?? (hopefully??)"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "i found my head to be very tender while the hair was falling out. and continued to hurt even after I shaved my head till the rest of the hair fell out. and was very tender when it grew back in too.. I would also get little scabs on my head.. Acs TLC catalog has sleeping caps which are suppose to be very soft I opted to shave my own hair... it started as strains and within a few days it was clumps.. You should be okay till Tuesday for you appt. but everyone is different.. As for being scared.. your not alone, I don't know anyone who was thrilled about the idea of one losing their hair and the thought of what you are going to look like bald.. Be strong... you are a beautiful warrior and in great company",
      "MessageIndex": 18,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "that's great ..... nice company that would do that",
      "MessageIndex": 2,
      "PostDate": "22/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192744",
      "Title": "returning bras that don't fit after reconstructive surgery"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "I just had my nipple reconstruction on April 1... I am pleased with the appearance.. I decided to go with just a slight nipple reconstruction.. and I mean slight.. I can still wear a tank with out a bra and not look obscene... I will have tattooing in about 3 months... My surgeon just made 2 small incisions on my breast and some how manipulated the skin and made very little nipples.. he also injected fat from my stomach into my left breast where in was a little concave to fill it out to match my right breast.. So I am pleased .. Wish you luck....",
      "MessageIndex": 5,
      "PostDate": "03/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189379",
      "Title": "Nipples or tattoos?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "Hi cvolk821... I had my double mastectomy with expander reconstruction in Feb. followed by 2 month recovery period.. than 5 months of chemo.. followed by a 3 week recovery period... than 7 weeks of radiation. I just finished radiation last week.. I meet with my plastic surgeon at the end of the month so he can look at my skin. He wants to wait 2-3 months after radiation is complete before doing the exchange for the permanent implants. So depending on how happy he is with my skin, will depend on when I will have my final surgery. So I am hoping to get an answer at the end of the month.. but looks like its going to be January or Feb. ITS A LONG PROCESS.. esp if you have to have adjacent treatment... Good luck",
      "MessageIndex": 21,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179329",
      "Title": "Rookie could use some advice"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "welcome.... I too had a double mastectomy back in Feb this year. **after surgery** * you will be very uncomfortable.... and the worst pain ever the first 12 hours after surgery * you will have 2 drains in.. when your discharged from hosp.. ( I had mine in for 14 days, surgeon orginally told me 1 week, so be prepared) * you won't be able to put your arms over your head * can't lift anything.. not even your kids (if you have them.. my youngest is only 2) * and even sitting in the car in uncomfortable.. ugh you feel every bump *** 2 weeks after*** * I still couldn't drive (or at least safely) because with the limited range of motion it was difficult to turn the stearing wheel esp to park ( I only started driving a little at around 3 weeks post op... and sitting in a car for long periods was terrible.. * I still had to have someone come in to help me with the kids (6, 3, and 2 when I had my surgery) if my hubby wasn't home * and still uncomfortable, but was getting out of the house a little **** managing love ones **** * let them help you, it makes them feel better and gives them a purpose in all of this, esp with cooking meals and doing your house work , which you won't be up for doing * I would also take a different person with me every time, to one take some of the stress off my husband, to give me a break from him, and my friends had a something they could do to help.. * you will see after surgery, people are less stressed about you.. (at least that is what I found) in the beginning everyone is there and concerned.. constant phone calls and visits... and after the double mastectomy and I started chemo.. less and less people came around",
      "MessageIndex": 12,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179329",
      "Title": "Rookie could use some advice"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "Sorry to hear... Hope everything turns out in your favor... keep us posted",
      "MessageIndex": 5,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176273",
      "Title": "Definitely NOT Dancing With Ned"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "I was diagnosed in Feb. 2009 1 month after my 36 birthday.... had double mastectomy, chemo, and radiation",
      "MessageIndex": 79,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "I was diagnosed in Feb. 2009 1 month after my 36 birthday.... had double mastectomy, chemo, and radiation",
      "MessageIndex": 129,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "I was diagnosed in Feb. 2009 1 month after my 36 birthday.... had double mastectomy, chemo, and radiation",
      "MessageIndex": 29,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "HAPPY BIRTHDAY TO YOU SHORTCAKE",
      "MessageIndex": 70,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "Katz... all the data I have read is 10 years younger than your diagnosis... So your daughter will start at 38... I have a 7 year old daughter... So I am so concerned about her as she gets older.. She will have to start at 26... I agree I don't see the harm in a baseline at 30... I know too many young woman who have this horrible disease...",
      "MessageIndex": 8,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175916",
      "Title": "Mammogram for the under 40"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "Hi.. I am 36 diagnosed Feb 2009.. I have no family history of breast cancer or any other cancer for that matter... First in my family.. aren't I lucky... NOT!!!! I found my lump by doing a self breast exam which I would do every couple of months. I never thought I had to worry till I was much older... I was 35 when I found lump right before my 36 th birthday,I have a birthday right after christmas, so I waited till the new year and to see if it would just go away because when I found the lump I was due to get my period in a few days and it was the holidays. so went to the doctor 3 weeks later, called first week in Jan., got an appt to see her the next week and then had my first ever mammogram 2 weeks after that.. I have read woman with a direct family history should start 10 years younger than youngest family diagnosed. Without family history they still recommend 40.. She just needs to be dillagent about doing self breast exams.. I was shocked to find out how many of my friends never do them.. So I am such an advocate for them.. It saved my life...",
      "MessageIndex": 12,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175916",
      "Title": "Mammogram for the under 40"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "HAPPY BIRTHDAY TO YOU SHORTCAKE",
      "MessageIndex": 19,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "DECEMBER 27",
      "MessageIndex": 81,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "None of us want chemo! But at the end of the day, you need to look at the big picture and decide to choose life. I was scared to death of chemo and losing my hair, but I did it. Yes, its a very hard and long journey. Filled with emotional roller coasters. Put a terrible strain on my marriage and a financial crunch. But we made it through and I look at it like this, you can't put a price on your health and life. There are programs out there to help with some of the financial aspects. I had a double mastectomy with reconstruction, 8 chemo treatments, and 34 radiation treatments. I did everything my oncologist wanted because I want to do everything humanly possible to reduce the chance of it returning. I need to be around for a long time for my young kids. You have a right to fear chemo and its side effects, but don't let it take over you. Be strong!",
      "MessageIndex": 23,
      "PostDate": "27/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182624",
      "Title": "Has anyone out there refused chemo?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "DECEMBER 27",
      "MessageIndex": 30,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "sorry can't help you.. I finished rad. Nov 2.. and my rad oncologist only wanted me using the pres. cream she ordered.. and NOTHING else... but I wanted to wish you a speedy radiation and hope all goes well for you...",
      "MessageIndex": 11,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179799",
      "Title": "Overachieving Rad Girl -- would appreciate advice from Rad Graduates!"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "I was given the choice to do lumpectomy if I wanted to do chemo first. I decided to do the double mastectomy... I made my decision based on I never want to go through this again. I am 36 with stage 2b, 2 post. nodes, triple negative tumor with grade 3 cancer cells.. I also didn't want to do months of chemo to try to shrink the tumor small enough to have the lumpectomy, my tumor size was 3.5cm at 12 o'clock on breast and I was only a big A cup. So unless the tumor was shrunk it would have left me disfigured.. For me.... the mastectomy was the easy choice. Listen to your heart, You have to do everything possible to beat this and that's just what you have to tell yourself. Despite how hard it is. I joke with my friends.. I got bigger boobs and never have to wear a bra again because they are so perky.",
      "MessageIndex": 5,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175650",
      "Title": "Bi-lateral mastectomy"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "i didn't see my oncologist for the first time till 4 weeks after my double mastectomy, i had no complications and am 36... and started chemo 2 weeks after seeing him... They won't start the chemo while she is having all these complications esp at her age... chemo kills the immune system, so i'm sure that is the reason for some of your wait..",
      "MessageIndex": 3,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177861",
      "Title": "Did anyone else have to wait 5 weeks to see oncology?"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "wooo hooo.. congrats.. what a great feeling.. enjoy your dance",
      "MessageIndex": 25,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189598",
      "Title": "Hands off, girls -- NED is all mine today!"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "I had a double mastectomy with reconstruction with expanders... What are you having reconstruction? if so what type... For me surgery wasn't too bad.. the drains are the worst.. I had mine in for 14 days.. They are a pain in the ***, always in the way and make it difficult to sleep.. when they start filling the expanders you have tightening and a lot of pulling as things stretch out, but its just uncomfortable not really painful. and that lasted for quite a few weeks even after I was done filling them. Expanders them self are uncomfortable... they are hard as rocks and you can't sleep on your stomach anymore Let us know what your planning and everyone can better help you with your question... good luck",
      "MessageIndex": 3,
      "PostDate": "15/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177654",
      "Title": "looking for someone who can tell me about pain and mastectomy"
    },
    {
      "AuthorID": "e_hope",
      "AuthorURL": "https://csn.cancer.org/e_hope",
      "Content": "talk to your rad oncologist.. they can prescribe a thicker cream to use on the open areas.. at least that is what my rad oncol told me to do if i develop blisters",
      "MessageIndex": 4,
      "PostDate": "02/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/178878",
      "Title": "Problems with radiation - need advice"
    }
  ]
}