{
  "AuthorID": "elizarose",
  "AuthorURL": "https://csn.cancer.org/elizarose",
  "Posts": [
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "I hate hats too, just never liked how they felt on my head. However, when it's really cold outside and you have no hair...a nice soft, warm hat is good to have. The only time I wore mine was when I was cold. :)",
      "MessageIndex": 5,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179555",
      "Title": "Starting Taxol"
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "I have a facebook account and that is usually where I post how I feel or what's going on inside me. Most times facebook is a very unsatisfactory place to vent so here goes... Tonight I am tired of this whole mess. I'm tired of fighting. I'm tired of hoping and waiting and I'm really tired of being disappointed. I'm tired of defending myself and my being sick. I'm tired of second guessing every decision I make. I'm tired of making decisions. I'm tired of being pulled and tugged in so many directions that my mind shuts down and I have to go on auto-pilot. I'm tired of having to be \"on\". I'm tired of people and I'm tired of being alone. I'm tired of never having anyone to just hold me and let me be tired. I'm tired of feeling selfish because I can't always say yes. I'm tired of feeling guilty because I can't get my cancer to go away. I'm tired of cancer. Matthew 11:28",
      "MessageIndex": 0,
      "PostDate": "01/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202376",
      "Title": "Because some things aren't suitable for Facebook..."
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "I always worry a little about how much to share with someone facing this battle. I had a mastectomy, right side, after 5 months of chemo so I was already pretty worn out. I will tell you that for me it was more painful than I expected it to be and the pain affected my arm and shoulder more than anything else. If you make plans for Thanksgiving, they should be plans to eat and rest! I got my drains out 2 weeks after surgery so I was very happy about that!",
      "MessageIndex": 4,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179329",
      "Title": "Rookie could use some advice"
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "Love your picture!! Bday is Jan 12!!",
      "MessageIndex": 52,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "Love your picture!! Bday is Jan 12!!",
      "MessageIndex": 1,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "I just finished radiation a week and a half ago. I used eucerin mostly, they have different kinds ranging from thick heavy cream to smooth lotions but they are all fragrance free. I also found out an aloe plant worked better for me than the bottled aloe. My skin became very itchy and blistered a little. The nurse told me to mix 4-6 cups of water to 1-2 tablespooons baking soda and 1 teaspoon of salt, soak a cloth in it and lay it on my chest. This really worked well!! They also gave me a prescription for silvadene that works great if you get blisters or raw places. I can't imagine putting corn starch on it... I would put the lotion, aloe or cream on right after treatment and then really slather it on at night before you go to bed. My skin is fair and I did have break down under my arm and on my collar bone. Thankfully I am still numb under my arm and couldn't feel the pain, the skin on my collar bone hurt A LOT although it was a small area.",
      "MessageIndex": 2,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179799",
      "Title": "Overachieving Rad Girl -- would appreciate advice from Rad Graduates!"
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "No, you didn't offend me. I'm sorry if my post made you feel that way. I was actually thinking of the woman who told me she wouldn't contribute to relay for life because she believed the acs is controlled by pharmaceutical companies and they don't want us to have a cure for cancer. So I supposed I was venting some :) Beth",
      "MessageIndex": 4,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179391",
      "Title": "natural cure stuff"
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "I have been confronted with this thought process to but I have a hard time believing that the entire healthcare industry is a part of some immense conspiracy theory to hide any type of cure for cancer. I've gone to homeopathic stores and been told awful things like all chemo is made from mustard gas all traditional medical treatments, chemo, radiation, etc are wrong. I've also talked to my doctors about using alternative treatments and they have encouraged me to try different different things and have even suggested treatments using herbs or acupuncture. I also know someone who chose not to do chemo and is only using natural remedies and they say its working. I don't know. I just know I had an aggressive stage III cancer and didn't feel like I had time to \"experiment\". Like Lori said, we each have to follow our own path. Beth",
      "MessageIndex": 2,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179391",
      "Title": "natural cure stuff"
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "I just finished 6 weeks of radiation today. I have had blisters, and now have peeling skin that is wet, and lots of itching. I'm using the silvadene and also, one of the nurses told me to mix 4 cups of water and 1 tablespoon of baking soda, wet a towel with it and place it on the radiated area. It helps a lot with easing the burn and the itchiness. I also had a friend give me an aloe plant that helped a lot and was much better than the bottled aloe. Hope this helps!",
      "MessageIndex": 7,
      "PostDate": "04/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/178878",
      "Title": "Problems with radiation - need advice"
    },
    {
      "AuthorID": "elizarose",
      "AuthorURL": "https://csn.cancer.org/elizarose",
      "Content": "I guess it's a little different for everyone so I can just give you my experience. My hospital has a large area divided by by curtains, each area has 2 chairs and a tv. We could recline and watch tv, read a book, put puzzles together, eat...whatever while getting our treatments. Before each of my treatments they drew blood and I had to wait about 30 minutes for them to get the results before they would start treatment. They had warm blankets, drinks and snacks or we could bring food. I was nervous mostly about how I would react to the drugs. The first treatment took longer than the rest because they gave it slowly to see how I would do. I know you'll be scared and nervous and that's ok, everyone is. Don't be afraid to tell the nurses and doctors how you feel and ask all the questions you want.",
      "MessageIndex": 1,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179856",
      "Title": "Starting chemo the week after Thanksgiving"
    }
  ]
}