{
  "AuthorID": "EveningStar2",
  "AuthorURL": "https://csn.cancer.org/EveningStar2",
  "Posts": [
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "Just an FYI, the Komen center may be able to recommend a place for counseling for BC survivors that is free/low cost. I know that I or my family can go to the counseling center here. Maureen",
      "MessageIndex": 20,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167422",
      "Title": "cancer survivor sleep problems"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "**************Hugs************* Maureen",
      "MessageIndex": 39,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225100",
      "Title": "Monday's Biopsy Results"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "If you need to even out a swimsuit, I suggest nerf balls. My mom had bilatmas 30 years ago, and I sewed pockets in her swimsuit and we cut a nerf ball in half and placed them in the pockets. The nerf material springs into place well and can be \"drained\" with a discreet push on the chest. I imagine you could use pieces to even it out. Maureen",
      "MessageIndex": 24,
      "PostDate": "23/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166475",
      "Title": "CONFESSIONS OF A GOOF"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "I have finished 23 treatments out of 33. The fatigue comes and goes with me but I do *try* to be aware and not over schedule myself. My breast is reddish but I slather Aquaphor on it twice a day. My treatment is in the morning so I shower, have the treatment then put the Aquaphor on thickly and then I wear a cotton bra--DD so going without is not a good choice for me. The bra also helps keep the underside of the breast dry which the radiation oncologist has been very concerned about. Then I put Aquaphor on before going to bed which is a little greasy but I can wash the sheets! Maureen",
      "MessageIndex": 13,
      "PostDate": "29/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166728",
      "Title": "Radiation bad effects????"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "I'd love to retire but can't either. When I got done with rads (didn't have chemo) my primary doc was doing routine tests and found out my thyroid quit working. No wonder I was tired! I'm back to full time work and have been on meds for about 2 months. Still get tired but it's better every day. Maureen",
      "MessageIndex": 9,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171101",
      "Title": "How long does fatigue last??"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "Hi! I'm brand spanking new to this. I had mammo in sept that showed \"calcs\" and they wanted to biopsy then. I couldn't because I lost insurance but had a repeat mammo last monday, biopsy on wednesday, report of DCIS on thursday and I see the surgeon tomorrow. What a week. Anyway, the radiologist walked into the room announced that it was benign and if he had read the mammo we would not be doing the biopsy. I said something to the effect that we were there, let's do it. It helps that I am an RN and am used to doctor's attitudes. So the point of the story is: be cautious and a second opinion may help. Maureen",
      "MessageIndex": 11,
      "PostDate": "18/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164468",
      "Title": "Microcalcifications?"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "I did not have chemo but I started radiation either 3 or 4 weeks after surgery. I know I started before they originally said that I would. Some of the sisters in pink have taken time off--sometimes involuntary to let their skin heal. The other question is could you have a weeks worth at you destination? It takes longer to get undressed/dressed that the actual treatment. Maureen",
      "MessageIndex": 1,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240553",
      "Title": "How long after surgery before starting radiation?"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "Hi! I can relate--I got the report last Thursday of ductal carcinoma in situ. I don't know anything more and I see the surgeon this afternoon. Welcome even if *none* of us wanted to be here. Maureen",
      "MessageIndex": 4,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164740",
      "Title": "Just diagnosed, with tons of questions"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "Agreed. I saw the surgeon today and we are doing a lumpectomy with radiation. I want the internal radiation but she thinks the area is too close to the nipple but we will see. Surgery is probably friday but they will let me know tomorrow. I think finding this board is the only thing keeping me sane in the middle of this whirlwind. Maureen",
      "MessageIndex": 5,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164740",
      "Title": "Just diagnosed, with tons of questions"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "You didn't mention your age but lumps and bumps on the thyroid as we age is \"normal\" or at least a lot of us get them. I had benign nodules on mine, had an US and biopsy and all was fine. I ended up getting half my thyroid removed but it was really my decision because I had a fluid filled cyst and it was a big ugly lump on my neck. I had the insurance and the sick time so I had it removed. Hurray for the clean mammo! Now this bunch of party goers can climb on the bus with you. I'm bringing margaritas! Maureen",
      "MessageIndex": 4,
      "PostDate": "24/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/245485",
      "Title": "I am asking for the pink bus ladies"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "I guess I'm different. First of all, I'm an orphan (my parents are both dead) and an only child. I raised my kids to be independent and I don't hear from them on a regular basis but I call them to check on life and they call me once in a while. My in-laws in live on a different planet so I don't worry about them. A couple friends have made it plain that I can rely on them but they don't make an effort to \"check\" on me. I understand being a bit frustrated with people but I don't expect anyone but the one living under my roof to be deeply concerned with the day to day stuff. Most of the others just want to know when stuff is over. Maureen",
      "MessageIndex": 28,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168677",
      "Title": "I am so dissapointed in my family"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "distance is a factor, some ladies here have stayed in a hotel during the week to get their treatments--or the entire 6 weeks. I know some got some financial help from one of the cancer organizations--I just don't remember who. Maureen",
      "MessageIndex": 11,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195826",
      "Title": "Anyone opted out of Radiation"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "distance is a factor, some ladies here have stayed in a hotel during the week to get their treatments--or the entire 6 weeks. I know some got some financial help from one of the cancer organizations--I just don't remember who. Maureen",
      "MessageIndex": 12,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195826",
      "Title": "Anyone opted out of Radiation"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "You can make the jam recipe that is in the sure jell box and process it in a water bath. Don't have a water bath? Got a large pan? You can do it. PM me if you want details, I have some strawberry jam here I made a couple of weeks ago. Maureen",
      "MessageIndex": 4,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217040",
      "Title": "OT - Strawberry jelly/jam/preserves"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "I had my lumpectomy 1/23 so it was time for the first six month mammo--eeeeeKKKK! But I went last Thursday and the tech was a breast cancer survivor and was very gentle. I got the report today and it said benign, so.....party! Maureen",
      "MessageIndex": 0,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173547",
      "Title": "Dancing with NED"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "Didn't see that coming! Like so many others have said: you are a strong woman and do what you need to do. It isn't easy but apparently, it is necessary. Anything that any of us can do, just let us know. Good wishes and luck to you. Maureen",
      "MessageIndex": 21,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214141",
      "Title": "Off topic....may be my last dutch treat....sigh...."
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "Several ladies have mentioned feeling a little lost after treatment ends and I can appreciate that since I finished April 10. Have I got a plan for you! Accept a job several states away and move with 3 humans and 4 cats! The movers/packer were here all day yesterday--those guys work--and will be here in an hour to finish up. Then we are homeless after I turn over the keys tomorrow. I will have quarters on the 12th, hopefully. In the mean time I just may lose my mind! The cats, however, are hilarious. I put harnesses on them with their rabies tag and a \"lost\" tag and they keep trying to back out of them or lick them off. Neither works very well. I think the youngest has PTST (I got her from the humane society) because she is freaking out. She slept right next to me last night, as did one of the others, so I was the middle of a cat sandwich. Normally, they ignore us at night. So I'm going to be in and out for the next few weeks. Maureen",
      "MessageIndex": 0,
      "PostDate": "30/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/169176",
      "Title": "After treatment"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "I've dealing with hives moving around my body for the last 24 hours. I called the American Cancer Society and the nice lady checked and she couldn't find hives as a reaction to radiation so it's probably something else. But I'm waiting for the clinic to open so I can go see about treatment before I rip my skin off. I didn't want to go to the ER because I would probably still be waiting to be seen. I cannot figure out what may have caused this. Anyone else ever have this problem? Maureen",
      "MessageIndex": 0,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166046",
      "Title": "hives"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "have answers and I understand you are venting. You have good reasons to be overwhelmed with all of this and not happy with what you have to deal with. It isn't fair and you should not have to put up with this. But what are you going to do? I get it--I just had a reoccurance and a bilateral. If I knew then what I know now, I would have done things differently the first time but I didn't and I'm here and dealing with what I've got. But we are here for you and understand the whole \"I'm fried and don't want to/can't deal with this sh** any more\". Hang in there, Maureen",
      "MessageIndex": 3,
      "PostDate": "02/09/2012",
      "ThreadURL": "https://csn.cancer.org/node/245922",
      "Title": "I am so freakin done"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "Sorry for the reason but glad the board helps. All the warriors in pink here have good words for all of us. Maureen",
      "MessageIndex": 8,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167045",
      "Title": "Special Thank you to All"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "Sounds like you have this under control. I wanted to let you know that you are not alone--look at my expressions page, I took pictures. Silvadene is wonderful. I was fortunate in that I was not working at the time so I didn't wear clothes much. Hang in there... Maureen",
      "MessageIndex": 11,
      "PostDate": "06/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/178878",
      "Title": "Problems with radiation - need advice"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "I didn't have to take it home but yes, it hurts and you can bruise. I'm an RN and a patient and had lovenox in the hospital last November--hate the stuff. But at least I'm still able to complain about it! My husband had to give himself the stuff a few years ago--I'm not sure that I could. Maureen",
      "MessageIndex": 5,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196751",
      "Title": "Has anyone had the 7 day take home shots \"lovenox\" after surgery for blood clots?"
    },
    {
      "AuthorID": "EveningStar2",
      "AuthorURL": "https://csn.cancer.org/EveningStar2",
      "Content": "You are obviously a strong woman. You'll get through this. I personally have a problem with being injured in treatment but *shrug* what can you do? Rads, working, and teenagers? I just did 2 out of three and only 1 teenager! *grin* Maureen",
      "MessageIndex": 12,
      "PostDate": "07/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/178878",
      "Title": "Problems with radiation - need advice"
    }
  ]
}