{
  "AuthorID": "fighting4five",
  "AuthorURL": "https://csn.cancer.org/fighting4five",
  "Posts": [
    {
      "AuthorID": "fighting4five",
      "AuthorURL": "https://csn.cancer.org/fighting4five",
      "Content": "Im with you Debi...I did taxol first my hair thinned so i got a pixie cut.After my first treatment of f/a/c it starting falling out by hand fulls so I shaved it off.I have 1 f/a/c to go and my hair is growing back already about a 1/4 an inch now,but my eyelashes and brows are almost gone, Very crazy!",
      "MessageIndex": 5,
      "PostDate": "23/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230876",
      "Title": "short note on Hair..."
    },
    {
      "AuthorID": "fighting4five",
      "AuthorURL": "https://csn.cancer.org/fighting4five",
      "Content": "When my son (2 years old) saw my bald head for the first time he looked at me smiled put his little arms around my whole head and hugged me. I cried. It does not bother him at all,at first he would come up and just rub my bald head now he is used to it. I only feel comfortable in public wearing a wig. I have a few different ones,my favorite i paid $54.00 you honestly can not tell that it is a wig,It has a part that looks natural. The shop I purchassed it from has a private room that you can go in a try wigs on. Some kinds are very bulky if you go to a shop they can help you find one that is more comfortable and will work well for you.",
      "MessageIndex": 9,
      "PostDate": "25/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230876",
      "Title": "short note on Hair..."
    },
    {
      "AuthorID": "fighting4five",
      "AuthorURL": "https://csn.cancer.org/fighting4five",
      "Content": "Good evening everyone. Today I had my first chemo consult,I was so confused halfway into it,he kept refering to things other patients had gone through or giving examples using cars and motors.He is a very highly recommended Oncologist,well respected in the medical field here. My surgeon had told me that I would need 4 rounds of chemo 3 weeks apart,I was prepared for that.The Oncologist comes in after we waited in room for an hour and really just rambles for the first hour. Then he tells me that because of my age(38) the size of my cancer(2.4cm) and my her2positve status that i would need 12 weekly treatments. He then wrote the letters TH an arrow and AC. He will call me in the morning with the day and time (he said the first of next week) for the first treatment. He did give me sheets with the names of the drugs how it is given and side effects. I didnt expect the Herceptin to be one of the first treatments. I really dont understand much of this. He said that they would explain more at my first treatment that the nurses were better at explaining. I am very stressed,confused and although I will not admit it to my family Scared! He told me that although they had gotten all of the visable cancer in my breast and removed all breast tissue in both breast that I still had cancer in my body and had a 40% chance of recurrance but I do not need radiation because my nodes were all clear. It just makes no sense to me.",
      "MessageIndex": 0,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222439",
      "Title": "My Chemo Drugs??"
    },
    {
      "AuthorID": "fighting4five",
      "AuthorURL": "https://csn.cancer.org/fighting4five",
      "Content": "Pam...My thoughts and prayers are with you. God Bless Mary",
      "MessageIndex": 1,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224250",
      "Title": "I think I may be in trouble"
    }
  ]
}