{
  "AuthorID": "FresnoD",
  "AuthorURL": "https://csn.cancer.org/FresnoD",
  "Posts": [
    {
      "AuthorID": "FresnoD",
      "AuthorURL": "https://csn.cancer.org/FresnoD",
      "Content": "Hi, I am currently going through the testing process. I recently was diagnosed with extensive DCIS. I am waiting for approval from my insurance company and then I will have the test. The company that processes the test in the US is Myriad Genetic Laboratories. Their website is www.BRACAnalysis.com and their phone number is 1-800-469-7423. I am not sure whether you can call the number so that is why I also gave you the website. If you don't get anywhere there I would call the childrens hospital in your area and see if they have a genetics department. My testing is being done at our local childrens hospital. Let me know if this doesn't help. What I am afraid of is that they won't do it unless you have cancer. The test is very costly so if you have to pay it yourself it is $2,680 in US. Basically, they told me that I have a 50% chance that I have the gene if my Mom had it. She passed away from Ovarian cancer 2 years ago and never thought to be tested. If the test comes out negative for me then my daughter doesn't have to be tested because she won't have the gene if I don't have it. If you have the test and yours is negative then your daughter won't have to be tested. If yours is positive then your daughter has a 50% chance she has the gene. Good luck! Diane",
      "MessageIndex": 1,
      "PostDate": "19/03/2003",
      "ThreadURL": "https://csn.cancer.org/node/139785",
      "Title": "genetic testing"
    },
    {
      "AuthorID": "FresnoD",
      "AuthorURL": "https://csn.cancer.org/FresnoD",
      "Content": "I also had the shot in 1978 to dry up my milk right after birth in the hospital. Then in 1988 I was given pills but I can't remember what the shot was called. I wonder if there is any relationship. Diane",
      "MessageIndex": 2,
      "PostDate": "30/05/2003",
      "ThreadURL": "https://csn.cancer.org/node/140433",
      "Title": "looking for a cause"
    }
  ]
}