{
  "AuthorID": "Grace_Refined",
  "AuthorURL": "https://csn.cancer.org/Grace_Refined",
  "Posts": [
    {
      "AuthorID": "Grace_Refined",
      "AuthorURL": "https://csn.cancer.org/Grace_Refined",
      "Content": "My Mom and Sister had breast cancer. Here's what happened to me when it was \"my turn\"! My husband and I had sold our home in California and purchased a home in New Hampshire and were expecting to move in April. Those plans were on hold as the Oncologist wanted me to begin chemo immediately. The cancer was stage III. Escrow closed, we moved into our 5th wheel trailer with our two golden retrievers, and I began chemo. Now here's the thing about the hair. My Sister tried to let things happen naturally. Her hair was beginning to fall out, but she wasn't going to shave it until it was REALLY coming out. Well, one day she gets in the shower and her hair hardens to her head like a brick! She calls me laughing hysterically while she's sitting on the floor with scissors and a BIG glass of wine, and try to cut between the brick and her scalp! So I HAD A WARNING! Shave it before you experience \"the brick\". Did I listen? Noooooooo! And yes, there I was, sitting on the floor of my 5th wheel with a retriever on each side of me, picking at the brick with my scissors! I had to call my Sister...we both had a glass of wine!",
      "MessageIndex": 7,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "Grace_Refined",
      "AuthorURL": "https://csn.cancer.org/Grace_Refined",
      "Content": "When I was going through treatment he was AWFUL! Especially when I had to ask him for help. I never ask for help and it was hard for me to ask, then he would say something nasty. I was so crushed. All the while I was still trying to take care of him, make his meals and keep the house. But after going through the ups and downs of the past 3 years with my health issues, I figured it out. I am his world. When I am here taking care of him, he is happy and his world is complete. He loves me so much that he can't even begin to allow himself to think of the possibility that he might have to live without me. When I ask for help, or tell him about a pain or something, he gets upset because he is seeing vulnerability (which I never show) and it scares him. Men are a lot like children. When something scares them and they can't articulate that, they act out.",
      "MessageIndex": 11,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190389",
      "Title": "My husband is my best friend....but since this IDC stage i grade III cancer he seems weird at times"
    }
  ]
}