{
  "AuthorID": "grams2jc",
  "AuthorURL": "https://csn.cancer.org/grams2jc",
  "Posts": [
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Good luck Dawne! I am 1/2 done now, including boost count. A little pink, a little rashy, but doing great! Wishing you an easy time with rads, Jennifer",
      "MessageIndex": 9,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220212",
      "Title": "Finally started rads today"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I had my endometrial biopsy on Thursday afternoon and won't be hearing those results for 7 to 10 days, I really didn't know what to expect but it wasn't bad. Thanks for the advice about taking ibuprofen prior everyone. I started going to this gyn because that is all she is...no baby deliveries, no surgeries, so she suggested I see the ob/gyn who shares her office as a surgical consult, not her partner just 2 practices in 1 office. Boy were they not on the same page. Her thinking was that because of Tamox. I will have to be checked for edometrial thickening regularly, (My pelvic ultrasound showed a fairly large fibroid, a cyst on left ovary, and thickening of the uterine lining, thus the biopsy) and worry about my ovaries because of the bc, plus I am not going to be having any more kids... chemopause, age, etc., so why not have the hyst and not have those issues to worry about. His thinking was that I should not have the surgery due to my rheumatoid arthritis and my \"significant\" breast cancer...HUH? He also told me based on the fact that I could not push my cervix down toward him...what are you asking me to do? and oh by the way you are my second exam of the day, AND I have to pee after waiting on you this long,that he would only do the surgery with the full bikini-line incision. SO, left his office knowing that whatever the biopsy says he is NOT touching me again. He asked me what each of my doctors had told me about my health status and what were they thinking, lectured me about the incidence of uterine cancer and Tamox., and basically left me feeling that either, A. I am not going to live long enough to merit having this surgery B. He just thinks it might cause my RA or BC to flare back up, or C. He is a jerk with the gentleness of a blacksmith. My attempts to get him to elaborate on his comment were unsuccessful. I am really sad she sent me to him because I really like her...and it makes me question her thinking that she sent me to him....HMMMMM Oh well, time to think since biopsy results won't be back for several more days, and this would probably be elective surgery, sort of. And that is something else he asked me, why did I WANT this surgery....guess I look like a crazy woman to him...could be right ;-) Thanks for letting me vent, Jennifer",
      "MessageIndex": 0,
      "PostDate": "27/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225293",
      "Title": "Biopsy and surgeon visit"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "So glad to know that things are going great! Sounds like your energy level is coming back and thats wonderful. Please pm me I'd love to find you on facebook Jennifer",
      "MessageIndex": 5,
      "PostDate": "23/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228990",
      "Title": "saying hello"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Sorry that you are going through this. Will be sending you positive thoughts and prayers as you start this fight. Jennifer",
      "MessageIndex": 19,
      "PostDate": "24/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225100",
      "Title": "Monday's Biopsy Results"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Glad you are on the mend. Praying it continues, nobody should have to deal with extra set backs, we have enough of those on our own! Good luck, Jennifer",
      "MessageIndex": 9,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238145",
      "Title": "Another 5-day visit to hospital!"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Fingers and toes crossed that all goes perfectly! Let us know, Jennifer",
      "MessageIndex": 1,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/226870",
      "Title": "Mammogram today!"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Just kidding! For some reason I have a feeling that you had a lot to do with the health improvements of your MIL It may not have been too exciting but sounds like a satisfying trip. Glad you are back! Jennifer",
      "MessageIndex": 6,
      "PostDate": "16/06/2012",
      "ThreadURL": "https://csn.cancer.org/node/241739",
      "Title": "Detailes of Chicago Trip"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Is that I have this amazing group of women who really \"get it\" and this site has saved some of my relationships with family and friends because they don't understand. I have also learned it is normal to not be over it as soon as treatment is finished, I'm not nuts,that is how you are supposed to feel Thanks everyone, Jennifer",
      "MessageIndex": 5,
      "PostDate": "30/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225394",
      "Title": "Sometimes we don't always say it but..............."
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Sounds like a fun weekend and a very nice tribute to Moopy who I never got to \"meet\". You are facing this second cancer jouney with grace and courage, I really admire your attitude and strength. Good luck with your rads and I hope you have a wonderful weekend! Jennifer",
      "MessageIndex": 1,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228179",
      "Title": "Last Week & This Week & Next Week"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "So happy for your good news! Jennifer",
      "MessageIndex": 9,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232158",
      "Title": "Six month visit with Med Onc"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I know I live in the boonies so you can pick me up in town. Haven't gotten to take this ride since I'm pretty new here, but how about I bring the pink sillystring for spraying unsuspecting pedestrians and anyone at intersections giving us dirty looks? Good luck to you both, keep smiling through your fears, Jennifer",
      "MessageIndex": 12,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/219583",
      "Title": "Two Kindred Spirits need the Magic Pink Bus and our Prayers for appointments on Wednesday and Thursday"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "However, the only things I have been singing lately are silly songs to my grandson. Old MacDonald had a farm or Animal Fair anyone? Wishing you NO surprising results, Jennifer",
      "MessageIndex": 4,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224726",
      "Title": "Requesting the Pink Bus for tomorrow"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Many drug companies offer discounts Maybe you have already checked that out Jennifer",
      "MessageIndex": 7,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/236954",
      "Title": "Oncologist this afternoon...hoping for answers."
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Trust me, I know, I nearly flunked rads due to burning and a bad attitude. You didn't do anything wrong, it just wasn't the right drug for you. Relax until next week then kick those nodes in the behind! Wishing you less pain and the strength to keep beating the \"nasty beast\", Jennifer",
      "MessageIndex": 12,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/223765",
      "Title": "The new plan...I flunked out of the clinical trial....lol"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I hate waiting, I don't even like to sit in an exam room for 20 minutes let alone wait days for test results. Here's praying that you have some irritation of the liver caused by medications that can be changed to make it all go away, Jennifer",
      "MessageIndex": 13,
      "PostDate": "21/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222923",
      "Title": "Liver catscan results on Monday"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "And don't forget to go to Central Grocery for a muffaletta, not that you 2 girls could eat a whole one, or even a 1/2. MMMMMMMMMMMMMM all that yummy olive salad! Have a fantastic time! And for a few days push us to the back of your mind and enjoy being a tourist. I love NOLA!! Have fun, fun, fun and enjoy that sister time Jennifer",
      "MessageIndex": 7,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221063",
      "Title": "OT: Wendy is coming to town!"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Sorry you have \"elephant knees\" but so glad your nurse got back to you promptly and you are seeing some improvement. If you aren't able to make it back on here before your appts....Good Luck, we will all be thinking of you and wishing you better days with less side effects, Jennifer",
      "MessageIndex": 7,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224064",
      "Title": "Treatment plans, Side Effects, you Kindreds know, the usual!!!"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Am sending you a PM Jennifer",
      "MessageIndex": 3,
      "PostDate": "28/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/234723",
      "Title": "I would like your advice please..."
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Maybe when our brains get too full of scary, negative baloney we can load it into the truck and dump it somewhere far away and evil. Might be cleansing. It looks like a truck that could haul a lot! Too funny! Jennifer",
      "MessageIndex": 1,
      "PostDate": "24/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223056",
      "Title": "I found a pink dump truck"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Even when I had no evidence of active disease I still had evidence of bc.....scars, port, prosthesis, crazy hair. But that's just me. I use the no expiration date on my butt just to remind me nobody knows when we are going, so keep putting one foot in front of the other. I think the phrase applies to everybody C or not. Isn't it funny what bugs us? Don't get me started on \"lost her battle with c\" Jennifer",
      "MessageIndex": 3,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240237",
      "Title": "No Expiration Date"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Not going to sweat that retirement account so much, going to poke around in old houses and churches and go to the Oklahoma City bombing museum. Gong to have to get a reality check from RO but planning an any znd all family member vakay at the end of July, 1 week on the beach watching my grandkids and as many of my hubby's (11) fly kites, poke things with sticks, boogie board, swim in the pool and turn into brown berries. Got to have goals, and those make me smile Jennifer",
      "MessageIndex": 6,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/233050",
      "Title": "while we all pray for improved health, do we have a New Year's Resolution for fun?"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I think there was more than one, and many candles lit out of love for your Mom. Hope your pain eases and your happy memories break through. Thinking of your family, Jennifer",
      "MessageIndex": 6,
      "PostDate": "15/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240292",
      "Title": "Laurissa"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "You aren't supposed to not tell us things! You are always here for all of us. You are in TROUBLE sister! But, THANK YOU JESUS!!! WooooooHOooooo! Jennifer",
      "MessageIndex": 21,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233694",
      "Title": "Some 'HAPPY' news -- Just want to share with all of you -- thru the good times, and bad"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "So sorry that he thought this was the right thing to do. Been through a divorce, don't wish it on my worst enemy (well maybe my ex) but you have to do what is right for you. The thought of you going through this makes my heart hurt, Jennifer",
      "MessageIndex": 91,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "So sorry that he thought this was the right thing to do. Been through a divorce, don't wish it on my worst enemy (well maybe my ex) but you have to do what is right for you. The thought of you going through this makes my heart hurt, Jennifer",
      "MessageIndex": 41,
      "PostDate": "18/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "So, I had my 28th, and last, regular radiation treatment today BUT just as I expected I did not get my markings for my boosts and was told not to reappear at the center until Monday. Even then he made no promises and said he might not do anything until Wednesday, wonder what happens on Wed? Do we wait until Friday if he's not happy? One of the techs suggested that if things don't look better to me Monday I could always just call them and let them know, saving me the 2 hour round trip. I think he wants to see me to be sure I haven't developed an infection but also to keep me in the groove so I don't just say \"forget it\" My sister told me to look at boosts as insurance, like a pair of suspenders worn in addition to a belt....I told her I never liked that look, LOL . Starting my 3 day suspension, I guess I am going to \"summer school\" before I am a rad grad, (and here I thought I was an overachiever), Jennifer",
      "MessageIndex": 0,
      "PostDate": "23/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221189",
      "Title": "Not flunking rads.....out of school suspension"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I have been known to trot that song out now and again, usually gets a few laughs and normally somebody sings along. So happy it was a good retreat! Jennifer",
      "MessageIndex": 1,
      "PostDate": "30/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/239589",
      "Title": "One of the BEST Retreats!"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Hi everyone, overall it's been a good week here in the warm midwest, some unsettled weather here at the end of the week to match the rest of my life. So I went to work this morning thinking how proud I was of myself....only Xanax I have taken this week, was right before the pelvic ultrasound my gyno ordered as a baseline due to Tamoxifen, and that was Thursday afternoon. If I had known it was both external and internal ultrasound I probably would have been on it all week, LOL. THEN, at 12:30 this afternoon my Gyn's name comes across the caller id at work...uh oh. She called to tell me the ultrasound had shown a follicular cyst believed to be benign in one of my ovaries and thickening of the endometrium (sp?) UGH She had 2 suggestions for me, take a short course of progesterone, EXCUSE ME hyper estrogen positive breast cancer patient here, you just said take hormones, or have a biopsy. I decided on the biopsy which is supposed to be no biggie except for cramping. She also told me that no matter how that comes out she will probably want me to see a gyn. surgeon for ideas regarding a possible hyst so I don't have to do all this again. OMG, what a baseline!! Been on Tamoxifen for 3 months and had never had a pelvic ultrasound before so I guess not really a true baseline as I have no idea what it all looked like before starting Tamox. ANYWAY, trying to be a \"grown up\" about it and stay rational BUT that isn't really my forte these days. AND of course, her first opening is on Thursday, here I go again waiting through the weekend for biopsy results, only other biopsy I ever had was a Thursday that ended with a BC dx on Monday. Looking at the bright side, if my gyno and MO get together and decide this is an opportune time for a hyst then so be it...I can get all of the BALONEY out of the way in 2011 and start 2012 fresh (Warned my husband that this New Year's Eve will be spent somewhere EXPENSIVE). Oh well, maybe next week will be 2 steps forward and 1 back. But I do have a filling and a biopsy scheduled....OMG!!!! Thanks for letting me vent, it just makes me wonder what's next....toe transplant surgery or something? I am gonna run out of girl parts to lose, Jennifer",
      "MessageIndex": 0,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224821",
      "Title": "One step forward and two steps back?"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Maybe the Tamoxifen makes us have worse muscle aches? I don't know, but I do remember that Traci posted a few months ago about her hot flashes being worse when she is sick and many others agreed. So, maybe it's just for as long as we are on estrogen supression? Glad you are feeling better, Jennifer",
      "MessageIndex": 2,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/225766",
      "Title": "Flu bug?"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I have a whole new case of hot pink silly string, since I'm really not a cook. And I love to spray anybody looking grouchy. Sending you prayers and positive thoughts. I didn't have bilateral, only left with no reconstruction...on the fence about the reconstruction but was told I have to wait until 1 year post rads, at least. We'll see. Good luck, Jennifer",
      "MessageIndex": 15,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229504",
      "Title": "The Pink Bus Is Rolling For Sue Relays - Let's Show Our Support"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "My MO doesn't do tumor markers either and I too am frustrated that there is not a BC specific tumor marker. Makes me feel like I am just hanging out here with no way to keep track. Again, congrats on the excellent results! Jennifer",
      "MessageIndex": 6,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228135",
      "Title": "Results on Tumor Markers"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "It is so hard to think we will ever get past it. I know that for several weeks after my dx we went to an unfamiliar church for mass because I would cry through the whole thing and couldn't stand my small town church folks thinking I had completely lost my mind. It seemed so unfair, I played by the rules, I was a good girl, why don't I get to live to be 100? Then I realized that God doesn't owe me anything, he isn't evil or out to punish me , and I may not ever understand why I have to deal with this. BUT nothing says I won't live to be 100, I just will do it with a breast cancer diagnosis. 3 1/2 months post chemo, 5 weeks post radiation, a clear chest CT, clear pap smear, healthy looking lab results and 4 smooth doctors appts have done me a world of good. So will a clear CT and Mammo in October should I be so blessed as to get them. My MO tells me it will take me 3 years to stop being so neurotic...that's what my brain will do, she made no promises about my cancer....I hope my Xanax perscription doesn't run out, LOL and they better not quit making it. Some days are no Xanax days, some are 3 full doses, you just never know what you're gonna get...kind of like Forrest Gump. Hang on, as you said, baby steps, and sometimes they are in the \"wrong\" direction. Thinking of you and wishing you peace of mind, Jennifer",
      "MessageIndex": 4,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224523",
      "Title": "life changing"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "My arms aren't the longest, but are reaching as far as they can, Jennifer",
      "MessageIndex": 9,
      "PostDate": "12/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220413",
      "Title": "GROUP HUG time!"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Enjoy not doing that anymore Jennifer",
      "MessageIndex": 18,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/234177",
      "Title": "Rad Grad!!!!!"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "so happy for you. Party BIG today!! Jennifer",
      "MessageIndex": 11,
      "PostDate": "31/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/233133",
      "Title": "Biopsy update"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Yes my lump was painful, so much for \"if it hurts it isn't cancer\", and it moved, my PCP thought it might be a cyst...wish he had been right. That doesn't mean yours is cancerous, there are so many other things it could be. It sure does drive you crazy til you know. Hang in there, Jennifer",
      "MessageIndex": 2,
      "PostDate": "05/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219892",
      "Title": "feels different than last time"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I had left mast. in November 2010, chemo and rads since then. It is terrifying but it gets better. Hang in there, and don't feel bad about wanting your family around that sounds normal to me. I went back to work 2 weeks after surgery and was truly surprised by how little pain I had and didn't fill my pain med script. Also, I think the mood swings are pretty typical, I still have them...one minute fine the next in tears. Take care, we'll be there with you Thursday, Jennifer",
      "MessageIndex": 9,
      "PostDate": "18/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222640",
      "Title": "Two cancers in one breast.....overwhelmed and scared."
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I'd try the inserts first too Here's hoping for an easy fix, Jennifer",
      "MessageIndex": 1,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/229225",
      "Title": "Heels"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "Ct results are in and were fine. Showed some irritation in my lungs from radiation. As my mo said my lungs are \"pissed off\" about the rads. That explains the shortness of breath. Anyway stress eating can cease, put the forks down for another 6 months. Thanks for all of the care and concern Jennifer",
      "MessageIndex": 0,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228328",
      "Title": "Forks down"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I did rads right after chemo and even though I burned and had to delay trtmt a couple of times, I gained energy and felt much better at the end than when I started. BC is very sneaky, I personally would do the mastectomy AND I would do the rads, using every available option to put this behind me and hope and pray it never comes back, while knowing that it could. Sorry to be a downer, just read a lot of stories both here and in other forums and have personal history that influences my thinking. I wish you an easier decision, peace with your decision, and easy treatment whatever you choose, Jennifer",
      "MessageIndex": 1,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/239672",
      "Title": "Feedback Needed: Study Shows Radiation Treatments Negatively Affect Cognitive Functioning"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "So glad you are still doing well! I have also learned to be careful what I wish for and pray for. Have fun at your relay Jennifer",
      "MessageIndex": 17,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/239014",
      "Title": "More \"Positive News\" - Monthly onc visit & Zometa Infusetion"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I get up at 4:15 to head to work so this will be no problem, I have the silly string ready! Jennifer",
      "MessageIndex": 10,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223475",
      "Title": "Gas up the bus, girls!"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I know that when I had to stop rads for a few days due to burning I wondered if it was really worth it to go back. I just knew that if anything ever came back up I wanted to feel like I had done all I could and would have no regrets. But prolonging treatment felt like a punishment and a torture. It took me into another month and I wanted a page on the calendar that was cancer-free. It messed with my feeble sense of control..AND I don't like surprises. I don't know your dx but I do know your frustration...I just want normal and I realize normal will never be what it was. Make the best decision that you can for yourself and know tht you will have support here no matter what. Jennifer",
      "MessageIndex": 2,
      "PostDate": "19/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222709",
      "Title": "Surgery, Radiation, and Frustration"
    },
    {
      "AuthorID": "grams2jc",
      "AuthorURL": "https://csn.cancer.org/grams2jc",
      "Content": "I take 1 tablet almost every night before bed. My problem is staying asleep and this seems to help...no more waking up at 2 or 3. I did mention it to my gyn and pcp and did not get negative feedback about it so am continuing to take it since it works. Good luck, Jennifer",
      "MessageIndex": 2,
      "PostDate": "26/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/229193",
      "Title": "Up all Night"
    }
  ]
}