{
  "AuthorID": "hoop77",
  "AuthorURL": "https://csn.cancer.org/hoop77",
  "Posts": [
    {
      "AuthorID": "hoop77",
      "AuthorURL": "https://csn.cancer.org/hoop77",
      "Content": "Anybody know how long these nasty scars remain nasty looking? Also, when does the tenderness, creepy feeling get better? I am 6 weeks out of exchange surgery where they opened up my mastectomy scars again and I'm just wondering if this feeling will ever go away...Grrrrrr",
      "MessageIndex": 0,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203132",
      "Title": "Mastectomy scars"
    },
    {
      "AuthorID": "hoop77",
      "AuthorURL": "https://csn.cancer.org/hoop77",
      "Content": "They're only boobs, just try to remember that...Your life is so much more important than a couple of bumps on your chest! I had mine in May and honestly, it's really not that bad. i still have days where I get down, but I'm so happy to have the dreaded cancer out of my body!!! I had a bilateral with expanders and just had exchange surgery 6 weeks ago. I still have discomfort, but nothing compared to the pain with expanders and my new foobs are actually a little bigger than the ones that tried to kill me. I know it's scary and heartbreaking, but you can get through this! Once again, your life is more important! Sending prayers and hugs your way!!! Laura",
      "MessageIndex": 13,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203151",
      "Title": "Mastectomy is my only option"
    },
    {
      "AuthorID": "hoop77",
      "AuthorURL": "https://csn.cancer.org/hoop77",
      "Content": "I went back to work after 2 weeks, could've gone sooner, but drains and the pain of driving kept me out. This surgery really is a piece of cake compared to the first one! You have immediate relief getting those hard expanders out. I had to have drains again which was the worst part. Best of luck to you in your journey!",
      "MessageIndex": 1,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203047",
      "Title": "Exchange surgery & Work"
    }
  ]
}