{
  "AuthorID": "iris48",
  "AuthorURL": "https://csn.cancer.org/iris48",
  "Posts": [
    {
      "AuthorID": "iris48",
      "AuthorURL": "https://csn.cancer.org/iris48",
      "Content": "Hello, I did a lot of research and soul searching trying to decide on which reconstruction surgery would be best for me and my lifestyle. You don't mention whether you have kids and are active with them, or what kind of work you normally do. That plays into some of the decision making, because I am active and physical on the job. To do the Tram Flap is using your abdominal muscle which also supports your back. The actual OR time in estimated at 10 1/2 hours on a surgical table for the double. If you do only one, then the natural one will sag in time and require a lift at the least to match the other side. The recoup time is different for everyone, but my research and several surgeons indicated that 7 to 8 months is about what you need. You need to be waited on because you cannot lift anything, that includes yourself from in and out the the bed, putting on clothes, etc. If you still choose this procedure, do yourself a big favor and point blank ask how many the surgeon has performed in the last three years, can you speak to some former patients and have dialogue with them, can you see pre and post surgical pictures that you know the surgeon has. If they don't readily give you answers here, run don't walk and find another surgeon. That is what I wound up doing. The orig. surgeon estimated 6 1/2 hrs on OR table for the Lastissimus Dorsi or Back Flap surgery for both sides. I later found out through professional friends in the field, he actually took 10 1/2 hours for this surgery, and the woman was in tremendous pain and discomforts for weeks and weeks. Some of these surgeons need assistance during the procedure and ego prevents them from choosing. You as the patient should request another surgeon be there. Better there and no problem than to have problem and no support. For me, I finally opted for two saline implants which was done 10/17/02. I am feeling so much better, and today went for a job interview and got the job and start in a month. I am a Licensed Massage Therapist. My swelling is mostly down and the \"Girls\" are looking more natural with gentle cleavage (I had a natural separation prior so this is new experience). The nipples will be done the end of November. This new surgeon specializes in this reconstruction surgery, so the implants (two sides) took 1/2 the time the other surgeon would have taken for a total of 1/1/2 hrs. The nipples take 12 - 15 min each in her office and i can drive myself (45 min) home. I feel like I've gotten my life back. The other concern was replacement. This surgeon said all the work is in place, should one leak or rupture for whatever reason it can be replaced in the office within 35 min. under just local anesthesia (you are awake but do not feel the procedure). She answered all the questions that had me feeling scared and gave very reasonable answers. The complicated procedures require micro vascular surgery and you need someone that does this all the time. Good luck on you choice. Hugs, Iris",
      "MessageIndex": 2,
      "PostDate": "04/11/2002",
      "ThreadURL": "https://csn.cancer.org/node/138871",
      "Title": "deciding on Tram flap after mastectomy"
    },
    {
      "AuthorID": "iris48",
      "AuthorURL": "https://csn.cancer.org/iris48",
      "Content": "Hi Maggs, Yes, I have thought about dying and wondered what I'd really experience. Somewhere along in my research/reading, I remember coming across an article or information that explained it in such a way that whatever fear I had disappeared. It went like this.. when you know this is your time, you feel very peaceful and your guardian angel in whatever form it takes for you is there with you, you get a chance to step out of your body (which is just a shell) and your energy/soul/light, however you wish to define yourself is free. Whatever pain or discomfort your mortal body might have experienced, is left behind and you are the energy that moves on. The irony is I don't remember how this information came to me, but I found it comforting. Hope I've helped you. Hugs, Iris",
      "MessageIndex": 3,
      "PostDate": "12/02/2003",
      "ThreadURL": "https://csn.cancer.org/node/139461",
      "Title": "Hey There Ladies!"
    }
  ]
}