{
  "AuthorID": "JanPat",
  "AuthorURL": "https://csn.cancer.org/JanPat",
  "Posts": [
    {
      "AuthorID": "JanPat",
      "AuthorURL": "https://csn.cancer.org/JanPat",
      "Content": "You are doing such a great job of enduring the multitude of not so pleasant effects of this nasty disease! I wore hats instead of a wig because my hair had always been so thick I couldn't wear hats and I figured if I was going to have to go through this then I would at least have as much fun as possible. I received tons of compliments on my hats and had people that knew others going through cancer ask me where I found my hats. Stay strong and just keep facing each day as it comes!",
      "MessageIndex": 5,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/251287",
      "Title": "Shaved it!"
    },
    {
      "AuthorID": "JanPat",
      "AuthorURL": "https://csn.cancer.org/JanPat",
      "Content": "I had a runny nose during chemo too and often had a slight nose bleed. I just chalked it up to having no nose hairs and more sensitive skin. Oh the joys of chemo :-)",
      "MessageIndex": 2,
      "PostDate": "28/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/250616",
      "Title": "Progress and a question on side effects"
    },
    {
      "AuthorID": "JanPat",
      "AuthorURL": "https://csn.cancer.org/JanPat",
      "Content": "What wonderful news! I'm joining you in your HAPPY Dance. What a wonderful Christmas present!!!",
      "MessageIndex": 2,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/250913",
      "Title": "Surgeon Just called home # left message..HE has results"
    },
    {
      "AuthorID": "JanPat",
      "AuthorURL": "https://csn.cancer.org/JanPat",
      "Content": "One month after finishing my treatment for Stage IIB Breast Cancer my father was diagnosed with Stage 4 Pancreatic Cancer. He lost his battle two and a half months later on October 27, 2012. It has been a very difficult year and now we are faced with the holidays. God has graciously blessed us with a beautiful granddaughter that was born four days before my father passed away and every time I hold her, I am reminded of the importance of finding a cure for cancer. Please keep our family in your prayers as we face our first holidays without my father.",
      "MessageIndex": 0,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/250119",
      "Title": "Trying to stay positive"
    }
  ]
}