{
  "AuthorID": "JKAlley",
  "AuthorURL": "https://csn.cancer.org/JKAlley",
  "Posts": [
    {
      "AuthorID": "JKAlley",
      "AuthorURL": "https://csn.cancer.org/JKAlley",
      "Content": "zimbo, first of all God Bless you for supporting your mother and being here on her behalf. The most important thing you can do is to support, love and be there for her. I just wanted to tell you that I had lumpectomy in Jan. I ended up having the node disection under my arm too, and that was definatly the worse of the surgeries. However, the next day I could lift my arm all the way over my head which I swear was because of yogi classes. But, that incesion still is a little sore and gets weird pains on occainsion. The incesion on my breast has healed with out problem or much pain, and they even had to go back in again because my margins weren't clean. That time I had only local anethesia and that was easy too. I went home in a couple hours and sat on my deck and enjoyed lunch with my best friend, felt great. I haven't had radiation yet, so I can tell what that's like. I'm in chemo right now. I'm 48, and before all this happen I was a strong, healthy, independent single mom. Chemo has kicked my butt basically, leaving me weak and feeling vulnerable. What I'm trying to say, is if chemo does this to me at my age when I'm healthy and strong, I can't imagine at 93, even if they're independent and active. A simple lumpectomy however, was a fairly easy procedure to go through. When you get into a masectomy or even a node disection it's a different story. I would agree with pam that I would stand by her whatever her decision, but she needs to know what she's in for in what she decides. I wish you the best, and come into the chat room sometime. There are caregivers and suvivors that understand what you are going through. Judy",
      "MessageIndex": 5,
      "PostDate": "14/06/2003",
      "ThreadURL": "https://csn.cancer.org/node/140523",
      "Title": "93 year old with breast cancer"
    },
    {
      "AuthorID": "JKAlley",
      "AuthorURL": "https://csn.cancer.org/JKAlley",
      "Content": "chemoqueen, once again you are a wealth of information, thanks for sharing. Judy",
      "MessageIndex": 2,
      "PostDate": "03/06/2003",
      "ThreadURL": "https://csn.cancer.org/node/140466",
      "Title": "My Favorite Web Sites - Helpful Information"
    },
    {
      "AuthorID": "JKAlley",
      "AuthorURL": "https://csn.cancer.org/JKAlley",
      "Content": "This is probably nothing, but the wonderful and knowledgable ladies here are always such a help so I thought I'd throw this one out there. I haven't been around for a while - except I do try ocainsionally to look through the posts. I'm 4 years out (YEAH!!) and so far so good. I noticed this morning there is a small, very bright red spot on the same breast I had cancer in (I had a lumpectomy) It's about the size of a bigger sized mole - at least my bigger moles. I just saw my onc dr last week, and of course it wasn't there then. It doesn't hurt or itch or anything - don't think a bug bit my boob, and haven't been bitten by anything larger - or pinched or anything fun like that. I'll give it a few days and see what happens, but I thought I had seen somewhere that the nasty beast can come to the surface, or something to that nature. I hate being this paranoid - but as we all know that's what happens - even after 4 years. Any thoughts from anyone? Jud p.s. I do miss talking in the chat room and knowing everyone - this place was my saving grace when I was going through treatments etc.",
      "MessageIndex": 0,
      "PostDate": "05/03/2007",
      "ThreadURL": "https://csn.cancer.org/node/153776",
      "Title": "red spot on breast"
    },
    {
      "AuthorID": "JKAlley",
      "AuthorURL": "https://csn.cancer.org/JKAlley",
      "Content": "Thanks Chemoqueen, you and rainyday both have been a wealth of info. Rainyday, I'm glad to hear you've made a decision. That's a difficult one to make. Don't think about if it comes back. Think positive it's not, and good luck with your treatment. Thanks to both of you. Judy",
      "MessageIndex": 2,
      "PostDate": "13/05/2003",
      "ThreadURL": "https://csn.cancer.org/node/140312",
      "Title": "More infor for Her2+ breast cancer"
    },
    {
      "AuthorID": "JKAlley",
      "AuthorURL": "https://csn.cancer.org/JKAlley",
      "Content": "Trixielee, I am the same as you, stage llla, her2 3+, and er/pr -. Terri is right, at this point it seems to be a blessing to be her2 pos. I was in the study for herceptin, and it seems everyone is singing it's praises. It was a long haul - chemo, radiation, and 52 weeks of herceptin - but if it works it was well worth it. Once the chemo and rads were over and I was just down to herceptin, it wasn't bad. There are some side effects, little things like heart failure, but they'll watch your heart through the whole thing. I did have to stop for a month or so because my heart showed signs of weakening, but got back on it and was able to complete the years worth. It's all very overwhelming right now for you I know, I'm so sorry. I remember thinking I'll never get through it all, but you do. I finished 1yr 1/2 ago, and looking back I'm so glad I did it. It's a journey, and this place is a great start to getting you through it. Knowledge is power, so start reading everything you can. There is a her2 web site as well. I don't have it right now, but google her2neu and I'm sure you can find it. Good luck, and let us know how things are going.",
      "MessageIndex": 2,
      "PostDate": "17/11/2005",
      "ThreadURL": "https://csn.cancer.org/node/148865",
      "Title": "StageIII Her2+++ /Est-/Pr-"
    }
  ]
}