{
  "AuthorID": "jojo elizapest",
  "AuthorURL": "https://csn.cancer.org/jojo elizapest",
  "Posts": [
    {
      "AuthorID": "jojo elizapest",
      "AuthorURL": "https://csn.cancer.org/jojo elizapest",
      "Content": "Oatmeal stuffed into a bag...now that is a great visual! I have tried on a couple of suits, spurred on by some early weight loss in chemo 1, I experimented with a few different sizes...it was as mind altering and some of the experiments I undertook in my earlier years. My port had swelled up twice the size of a hard boiled egg so as I tried on suits it seemed like I needed a third cup area under my right collar bone. They have since drained the port and it is now about 1/4 the size...but made me think I will stay with my old suit for know and wait to see what other changes are coming my way.. Lastly, your sarong reference and the psyche of young children. When my son was 11 years old he was the envy of many of his friends because we were taking a family vacation to St. Maartens and there was topless bathing at our resort! He was very anxious to go on the beach that morning...as was the apparently 150 year old woman doning nothing but a short sarong, dental floss (thong) and an old fishing hat complete with lures stuck onto it. She was bent over facing the beach using a colander type thing to drain out items from the waves washing on shore. Her breasts were pendulous to say the least, swaying in the outgoing waves. My son stood mesmerized. Then he said to us that they really shouldn't allow topless bathing. Of course he had many opportunities then and over the last 17 years to change his mind...but that day made an impression that he still shivers over...and every now and then I take a fishing hat to the beach with us and he just grins. jojo",
      "MessageIndex": 18,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166475",
      "Title": "CONFESSIONS OF A GOOF"
    },
    {
      "AuthorID": "jojo elizapest",
      "AuthorURL": "https://csn.cancer.org/jojo elizapest",
      "Content": "Today was a beautiful day in Wisconsin...and the city of milwaukee is preparing for Danny Gokie day! I haven't heard a good groaner in a while....thanks jojo",
      "MessageIndex": 15,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168292",
      "Title": "Great Joke......Had to Share"
    },
    {
      "AuthorID": "jojo elizapest",
      "AuthorURL": "https://csn.cancer.org/jojo elizapest",
      "Content": "when I first was diagnosed and found these boards I read one that for me coined the phrase \"chemo-sobby\"...I am not sure who posted it...but I have latched onto it and blame my crying jags on it. You know when you are crying and your significant other asks \"whats wrong\" blurting out chemosobby is so much easier than trying to figure it all out and put it into a nice verbal package...also seems to take the pressure off of me to figure out why...and just go with it. In the spirit of chemo sobby I have also taken to sending Lone Ranger Reports out on email to family and friends, my husband recieved a set of masks from a well meaning friend, and when I am overtaken wtih tears on the phone several of my sisters will just wait it out by humming the lone ranger theme song to me...that cracks the gloom! I am also on the oral hormone therapy...and my crying jags will be a part of me...whether I can blame them on anything or justify them in any way...",
      "MessageIndex": 9,
      "PostDate": "06/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168226",
      "Title": "\"hormonal\"crying"
    },
    {
      "AuthorID": "jojo elizapest",
      "AuthorURL": "https://csn.cancer.org/jojo elizapest",
      "Content": "I would like to echo the encouragement to buy shoes..but also understand how tired making that kind of decision can be...but wanted to address another aspect of this thread.... Joe...You are truly an awesome partner...and certainly no heel. How brave of you to expose such an extreme and disturbing dynamic going on in your household. I know of some soleful support groups for women and husbands of those women who have more shoes than they know what to do with...I have to believe that somewhere there are women who need encouragement to buy shoes...you may need to go beyond the US borders... Good luck to you both during this difficult time...",
      "MessageIndex": 15,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "jojo elizapest",
      "AuthorURL": "https://csn.cancer.org/jojo elizapest",
      "Content": "I am the cheesehead that Joe sent the link to. I haven't had time to thank him...but THANKS JOE!...I've been reading, feeling, thinking, digging, etc. I agree with the posts on your thread...this discussion board has it all...from life affirming schemes and dreams, to tips for handling side effects. I too am stage 4, three cycles of chemo down, one more to go before we take another look see...responding on the board is weird...these ladies know so much! but coming to this board is a daily dose of connection that I would not miss. And I have the most beautiful grandbaby...Jordan Rose...that I plan on spending a lifetime loving. 14 months old and truly a gift.",
      "MessageIndex": 11,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167298",
      "Title": "New to board"
    }
  ]
}