{
  "AuthorID": "JuJuBeez",
  "AuthorURL": "https://csn.cancer.org/JuJuBeez",
  "Posts": [
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "Hi Julie! I'm glad you're here, but sorry you have to be. I was dx 2 years ago, at age 43. I also was Stage 1, IDC, margin and sentinel node clear. I had lumpectomy. My BRCA was neg for mutation. My Oncotype score was 12. My onco had me do rads (2x/day for 5 days on Trial Study), and I've been on Tamoxifen since Aug 2010. Onco did not have me do chemo because the score was a 12. He said the chemo would be hard on me, and wouldn't change the recurrance rate by much. My thought was I would be conservative this time, but if I have to go through any of this again.. it's on. I will be much more agressive, mast, chemo, etc. I'm just hoping to fly below the radar. I also do not have any family history. I know it's a hard decision. I couldn't think of anything else while I waited for the Onco score to come back. The thought of chemo scared me. I think for me, if I had the same dx, with family history even though BRCA was neg, I would really consider the chemo to be sure I did everything I could. Esp at our age and with kids. I have a 9 yr old. It's a lot to think about, and to wonder if we are making the right decisions. Take care! Please keep posting and let us know how you are doing! Julie",
      "MessageIndex": 1,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237612",
      "Title": "Oncotype Dx Score of 19 - What to do? Chemo/No chemo"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "I have been on Tamoxifen since Aug 2010. I do have hot flashes, but I'm also just warmer in general. I have not gained any weight, but it's harder to lose weight. I do get bone pain and fatigue. And some crazy eczema on my right hand and foot. I cry like a lunatic at the drop of a hat. (so embarrassing sometimes). None of the side effects are horrible, but they are annoying sometimes. It's still better than the alternative.",
      "MessageIndex": 4,
      "PostDate": "22/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237612",
      "Title": "Oncotype Dx Score of 19 - What to do? Chemo/No chemo"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "Julie - You didn't seem to get any answers to the question about side effect tracking. Check with ACS. I had called the 800-number when I was diagnosed, and they send all kinds of booklets with my specific needs, plus I got a planner to keep my info. I recall a sheet to track meds and dr appts, perhaps there was something for side effects. I'm sorry, that was two years ago, and I just don't remember. Another site that has planners for treatment is the 'Livestrong' site. You might find what you need there, too. Take care! Keep us informed! Still praying for you and your hub!! xoxo Julie",
      "MessageIndex": 18,
      "PostDate": "11/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/237612",
      "Title": "Oncotype Dx Score of 19 - What to do? Chemo/No chemo"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "I work in North Syracuse and it's not uncommon for the planes to be really loud overhead. But since it was raining, I thought it couldn't be the planes, must be thunder. Then when everything kept shaking, I thought \"Crap, I hope it's not a tornado\". I'm originall from central Illinois, so anytime the weather is screwy, I still get into 'tornado mode'. I was wishing we had a bathtub at work to hide in! ha ha! (of course everyone up here thinks I'm crazy when I say we would hide in the bathtub when a tornado was coming...)",
      "MessageIndex": 12,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194993",
      "Title": "Anyone else feel the earthquake a little while ago??"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "Welcome to the group. I'm sorry you had to find us, but I'm glad you did. The PINKS are an awesome group for knowledge and support. And they're here 24/7, with NO question left unanswered. My daughter was 7 when I was dx 3/10. I knew for a week before I told her. I waited until after my first meeting with the surgeon so I could answer all Erin's questions. I also called the school nurse to give her a heads-up before I told my daughter, and she connected me with the school counselor (who was a 10-yr survivor, by the way). After I told my daughter, I told everyone else. I didn't want to risk her hearing it from someone else. Best wishes to you! Let us know how you're doing! Julie",
      "MessageIndex": 6,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238981",
      "Title": "I am very scared!"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "I'm right there with you! I haven't been acknowledging the pain and fatigue I've been feeling because we found out just two days after my rads were completed, that my father-in-law was dx stage iv lung cancer. I have felt, since 7/4/10, that I don't have the right to complain that I'm so tired I want to cry, or my left side aches, because I'm not fighting for my life like he was. Trying to ignore what I'm going through has made me feel depressed. Like I'm being selfish and a big baby because I'm 'just' tired. But how do we explain to everyone that just because we get up everyday and go to work, because we keep doing everything we did before, that we don't feel the same as we did before? And the same amount of activity may take twice as much energy? And some days I really would rather just stay home in bed and to he** with the day. How do you all keep going when you're so tired you're dizzy? (I'm on 20 mg Tamoxifen and 37.5 mg of Effexor... this could explain my fatigue and mood...) :-) Thanks, Ladies!",
      "MessageIndex": 18,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202376",
      "Title": "Because some things aren't suitable for Facebook..."
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "I haven't really gained any weight... I fluctuate +/- the same 7 lbs... BUT I do think it's harder for me to lose weight than before. I've been on Tamoxifen since Aug 2010. I blame every little weird and frustrating thing on Tamoxifen.. LOL",
      "MessageIndex": 22,
      "PostDate": "12/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/208086",
      "Title": "Tamoxifen and weight gain"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "Lots of positive thoughts and good juju sent your way. Julie",
      "MessageIndex": 3,
      "PostDate": "09/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/236954",
      "Title": "Oncologist this afternoon...hoping for answers."
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "Did I miss the bus? Since the kazoos got such a bad rap, I will bring harmonicas this time. NO? Hmm.. I'll have to think about it. I'm sending positive thoughts, good 'juju', prayers, everything your way Ladies. ~jules",
      "MessageIndex": 27,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219583",
      "Title": "Two Kindred Spirits need the Magic Pink Bus and our Prayers for appointments on Wednesday and Thursday"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "sorry for the double post",
      "MessageIndex": 4,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/203870",
      "Title": "Tamoxifen and Migraines"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "I am prone to migraines too, but I've learned what triggers to avoid for the most part. I've been on Tamoxifen since Sep 10, and I've noticed headaches around my period time. I was still getting periods at first, and it seemed my pms symptoms were stronger. I haven't had a period since January, but I still get the 2-3 day headaches around the time it should come. When I was on 'the pill' several years ago, I would get headaches for the week I was off. I figure it's just the hormone level change. Sometimes I just get the 'aura'. I see a herringbone pattern in my line of vision. It will start on one side, grow bigger, than leave from the other side. (Did that make sense?) Being too tired is one of my triggers, and it seems I am getting more tired more often. And I've definitely had more headaches as our Central New York weather is changing. Every time I have something new pop up, and I ask if it's because of the Tamoxifen, I usually get \"Well, it could be.. but we don't want to say for sure...\" My eyes water like crazy (esp when the temp is below 40), I get horrible cramps in my feet and calves. I have developed eczema (or something) on my hands, I have sensitivity to antibiotics that I could take last year before dx without any problem, headaches, tired all the time but can't sleep... But no one will commit to an answer. I get the most help from my wonderful pharmacist. She will tell me what the doctors won't. I don't know if I've helped you in any way. I actually have an appt with my onco this Friday. I had asked him back in January if he would consider taking my ovaries and switching my classification of medicine. His answer was for me to come back and we can discuss it. He doesn't like to make drastic medicine changes in the middle of winter. Plus my vit D level is 8 and we're trying to get it to go up. Take care, and let us know what you find out. (I just thought of something else I learned from the pharmacist. I was having what appeared to be an allergic reaction to an antibiotic, and I had asked how long the Tamoxifen stays in our system. I figured I could stop taking it and take the antibiotic with no problem. It takes 71 days for the Tamoxifen to leave our system.)",
      "MessageIndex": 3,
      "PostDate": "25/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/203870",
      "Title": "Tamoxifen and Migraines"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "Thanks for asking that question. I never totally understood why 5 is the 'it' number. I've got 3 years to go!",
      "MessageIndex": 2,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/239031",
      "Title": "5yr question??"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "I just received the most beautiful angel ornament from Jennytwist. She also included little treats for my daughter Erin! AND chocolates from the Rocky Mountain Chocolate Factory!! Woo hoo! You really brightened up my day! Thank you SO much!! <3 <3",
      "MessageIndex": 0,
      "PostDate": "12/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232067",
      "Title": "Thank you Jennytwist!"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "My tumor was 1cm, no positive nodes, ER and PR positive. The onc said I have about an 8% chance of recurrence with lumpectomy, radiation, and Tamoxifen. I just started the Tamoxifen about a month ago. Doc said that chemo would take my chance of recurrence down to about 7%, and he wouldn't recommend it because that 1% wouldn't be worth the effects of chemo. The only factor that would make him even consider chemo at this point is my age (43). I told him that I'm happy with our decisions thus far, and if something comes back, I will be more aggressive at that time.",
      "MessageIndex": 12,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198139",
      "Title": "oncotyping"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "LOVED the article! Thank you for sharing!",
      "MessageIndex": 4,
      "PostDate": "03/07/2012",
      "ThreadURL": "https://csn.cancer.org/node/242709",
      "Title": "This is spot on!"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "I'm 2 1/2 years in with Tamoxifen. My hot flashes have reached Global Warming these past couple of weeks. I told my gyno today, and he prescribed Clonodine. I already use 75 mg of Effexor, taken as 37.5 mg 2x/day. I will report how it works after I've taken it for a while. If it works, he's my new BFF. I am def going to get some Peppermint oil. I used that on the back of my neck once last summer, and it was soothing. I'm thinking of making gel inserts for bras that go in the freezer and pop in for relief. Or make bras themselves that can go in the freezer. LOL. I'm getting desperate.",
      "MessageIndex": 20,
      "PostDate": "20/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237290",
      "Title": "How to minimize hot flashes from Tamoxifen?"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "What time do you take your Effexor? How many mg do you take? I take 75 mg, but not the ER (Extended Release). I've had to change the time of day I take it, so I can sleep at night. When I first started Effexor, the doc gave me 75mg of the ER. I didn't hear my hubby snore for two whole months! It was awesome! But I would doze off at work at 8:30 am. I started taking it before lunch, and I get pretty sleepy at night. And I don't feel 'hung over' in the morning. My good sleeping comes and goes. I can sleep through the night for a few weeks, then not worth a darn for a while. Benadryl makes me nervous, unfortunately. I sleep good for the first couple of hours, then my heart races after that.",
      "MessageIndex": 14,
      "PostDate": "28/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/229193",
      "Title": "Up all Night"
    },
    {
      "AuthorID": "JuJuBeez",
      "AuthorURL": "https://csn.cancer.org/JuJuBeez",
      "Content": "Hi Ladies. I have a family member who was recently told she has breast cancer. She has had biopsy and pet scan, but will not have results until Thursday. She is scared and concerned about what's to come. I told her of this site, and how wonderful you pink sisters are. I know she has been checking out some of the posts, but hasn't yet signed up. She will know this post is for her! I will identify her only as 'Baby Whisperer'... She is still testing the water here, not yet sure what she needs to ask. I want to let 'BW' know that it's totally safe to jump in with both feet, once you know what you want to ask. Or you can just watch from afar. No pressure. Just know you aren't alone. Love, JuJuBeez",
      "MessageIndex": 0,
      "PostDate": "28/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/245671",
      "Title": "Pink Bus request for family member *Baby Whisperer* Thursday"
    }
  ]
}