{
  "AuthorID": "justme32213",
  "AuthorURL": "https://csn.cancer.org/justme32213",
  "Posts": [
    {
      "AuthorID": "justme32213",
      "AuthorURL": "https://csn.cancer.org/justme32213",
      "Content": "Im In ! Ive never been on the pink bus yet and now is the perfect time, I will ride with you if you ride with me on Tuesday. Tuesday is the day I see my doc and get the results of my brain MRI, MUGA and PET scan. I'm scared too, like real scared but I've got all you wonderful Pink Ladies and Gents to ride and guide me............(((((((hugs)))))))))",
      "MessageIndex": 7,
      "PostDate": "10/05/2013",
      "ThreadURL": "https://csn.cancer.org/node/258674",
      "Title": "My Pink Sisters, Can I get the pink bus for Monday Morning?"
    },
    {
      "AuthorID": "justme32213",
      "AuthorURL": "https://csn.cancer.org/justme32213",
      "Content": "Its justme again ! Its official, I am diagnosed with stage IV. Do any of you here have stage IV breast cancer ? I am looking for everyone here with information that could be useful or mind soothing at this point. I just sat at the kitchen table having dinner with Raul and we were discussing it, Im angry right now............. Plz Help ...........((((((hugs ))))))))",
      "MessageIndex": 0,
      "PostDate": "29/04/2013",
      "ThreadURL": "https://csn.cancer.org/node/258277",
      "Title": "Stage IV"
    },
    {
      "AuthorID": "justme32213",
      "AuthorURL": "https://csn.cancer.org/justme32213",
      "Content": "Hi Lisa here, I was diagnosed in March of 2013 and had a mastectomy of my left breast in October the same year. To date i am still very tender, sore, sometimes swollen and numb. My oncologist and my surgeon both said it is normal. Exercise that arm every day for at least 10 minutes and a few times a day if possible. I do it in the shower, it feels great, and I also do it right before bed. Hope this helps....this too shall pass they say. ",
      "MessageIndex": 36,
      "PostDate": "02/02/2015",
      "ThreadURL": "https://csn.cancer.org/node/208870",
      "Title": "Breast still tender 1yr later after lumpectomy"
    }
  ]
}