{
  "AuthorID": "kakennedy",
  "AuthorURL": "https://csn.cancer.org/kakennedy",
  "Posts": [{
    "AuthorID": "kakennedy",
    "AuthorURL": "https://csn.cancer.org/kakennedy",
    "Content": "I had a similar diagnosis without ER positive but was HER2 positive.  The study below (APT) is the foundation for my treatment....surely your oncologist knows of this study.  If not, you may wish to share it with him/her.  I would also recommend a second opinion.  Best wishes to you! :) Kathy      Clinical Trial Summary – APT Trial  February 19, 2015  Title  Phase II study of adjuvant paclitaxel and trastuzumab (APT trial) for node-negative HER2-positive breast cancer (NCT00542451; DFCI 07-199)  Plain language title  A clinical trial evaluating treatment with chemotherapy (paclitaxel) and a HER2 receptor blocker (trastuzumab) given after breast cancer surgery for patients with HER2-positive breast cancer without cancer in the lymph nodes.  Note: Trastuzumab is also known as Herceptin. Paclitaxel is also known as Taxol.  Why was the trial done?  The purpose of this trial was to evaluate the effectiveness of less chemotherapy for patients with HER2-positive node-negative breast cancer with small tumors (3 centimeters or smaller). Current treatment recommendations for HER2-positive breast cancer are based on results from a large group of patients, most of whom had breast cancer in the lymph nodes and/or had larger tumors. These treatment recommendations usually include two to three chemotherapy drugs, whereas the treatment in this trial includes only one (paclitaxel). The second study drug, trastuzumab, is an antibody that targets HER2.  This trial was specifically trying to show that there is a group of patients with small tumors and no cancer in the lymph nodes, who may not need as much chemotherapy as those with more extensive breast cancer.  In other words, the trial asks, can this group of patients be effectively treated with less chemotherapy?  Trial Enrollment and Follow-Up  This clinical trial enrolled a total of 406 participants from October 2007 to September 2010. One-third of participants were under the age of 50, and 10 percent were over the age of 70. Half had tumors 1 centimeter or smaller, and half had tumors larger than 1 centimeter.  At the start of the clinical trial, all participants had their breast cancer surgically removed and were considered “disease-free.” Each participant continues to be checked periodically for the presence of cancer and to report any side effects of treatment.  Treatment and side effects  Everyone on the trial was prescribed the same treatment for breast cancer: weekly administration of chemotherapy (paclitaxel) and trastuzumab together for 12 weeks after breast cancer surgery. This was followed by trastuzumab alone to complete a year of treatment. Treatment with paclitaxel and trastuzumab was generally well tolerated, with few severe side effects. However, most participants had hair loss, and many reported fatigue. Other side effects reported in more than six patients included diarrhea, neuropathy (nerve damage), low blood counts, hyperglycemia (high blood sugar), allergic reaction, and liver function blood tests above the normal range.  Because we know that trastuzumab can affect heart function, trial participants were closely checked for this through periodic heart imaging. Two patients (0.5%) experienced congestive heart failure serious enough to cause symptoms, but both recovered after they stopped taking trastuzumab. Thirteen patients (3.2%) had a significant decline in heart function, which could be seen on heart imaging, but did not show symptoms of heart disease. Of these 13 patients, 11 were able to complete the remaining year of trastuzumab therapy, and two had to stop taking trastuzumab.  Preventing the return of cancer  These trial results were reported after half the participants had been followed for at least 4.0 years. At the time of this report, 97% were alive and free of breast cancer. Among the 12 women who had cancer detected at some time after surgery or had died without cancer, 2 were due to distant metastatic breast cancer, 2 were non-cancer deaths, and the rest were in a breast or nearby lymph node.  What do these results mean?  Here are the top three lessons learned from this clinical trial:  • Yes, we can give less chemotherapy to patients with relatively small tumors (less than 2-3 cm) and negative lymph nodes. Because there were a small number of patients with tumors larger than 2 cm in the study, we would conclude that paclitaxel and trastuzumab can be considered a reasonable treatment for the majority of patients with stage I HER2-positive breast cancer (tumors 2 cm or less).    • This treatment represents a more tolerable (i.e., having fewer side effects) chemotherapy regimen for women with small HER2-positive tumors.     • The results of this trial helped to make possible a new randomized controlled clinical trial that compares the treatment you received to a newer treatment that may have even fewer side effects for patients treated in the future.    What does this mean for me?  At this time, we do not believe that any of the findings from this trial impact your care, and you should continue with your routine visits to your treating physician. If you have questions about the trial findings, or your care, we encourage you to speak with your treating physician.  Study sponsor  This study was led by doctors at Dana-Farber Cancer Institute, with participation from multiple hospitals around the country, and with financial support from Genentech.  Scientific publications about the study  A full report of the study has been published in the New England Journal of Medicine, volume 372, pages 134-41. The manuscript can be found at: http://www.nejm.org/doi/full/10.1056/NEJMoa1406281.  Thank ",
    "MessageIndex": 5,
    "PostDate": "20/11/2016",
    "ThreadURL": "https://csn.cancer.org/node/306602",
    "Title": "Treatment for HER2 Positive Small Tumor?"
  }]
}