{
  "AuthorID": "kamcat1962",
  "AuthorURL": "https://csn.cancer.org/kamcat1962",
  "Posts": [
    {
      "AuthorID": "kamcat1962",
      "AuthorURL": "https://csn.cancer.org/kamcat1962",
      "Content": "This man should be made to have reco. and see how fun it is.  I am not exaggerating but mine was horrible and most likely the reason I recurred, but that has been emphatically denied by those in the profession.  Reconstruction is a very personal decision that must be thought about seriously. It is no walk in the park and it is certainly not fun. Pleasde think about it carefully, get a 2nd or even 3rd opinion if possible and don't let any one pressure you.  I let myself be pressured qnd am so, so sorry I did it because I did have severe reservations.  I was having the left prophylactic mastectomy so everyone was \"Why not have the reconstruction done at the same time\". But I was still having reservations about such a large surgury (8hrs) and they were like \"oh it is no big  deal and then you will have your perky new girls.  Well the girls were not perky and I was in extreme pain.  So please educate yourself and don't let yourself be bullied. I hope all works out for the best for you. Take care and listen to that inner voice.  It's your body and  your family, friends, or cancer patients should just be glad that you are alive and living.  REconstruction fun.  That man/womwn belongs in a mental institution. HUgs and srength sent your way, Cathy K",
      "MessageIndex": 13,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://csn.cancer.org/node/260338",
      "Title": "Opinions please"
    },
    {
      "AuthorID": "kamcat1962",
      "AuthorURL": "https://csn.cancer.org/kamcat1962",
      "Content": "All Sisters, we all know that this is almost as hard as going through your cancer treatments. For the disease we have surgery, chemo, radiation, etc.  But  how do you survive cancer in your mind and soul?  I am on my 2nd time around so my eyes have gotten a little more open as to how we are as patients just treated for the disease that lives in our body. As you said \"what about the one that lurks in the back of your mind?\" Unfortunately I let myself get so anxious about disease reoccurrence that I had to seek professional psychological help.  I didn't know about all the resources that existed for cancer survivors and their caregivers because they were not presented to me.  I feel this is the responsibility of the cancer center or oncology department that you seek treatment at. They need to have these resources readily available and in place. The surgeon has the tools to cut the disease from your body.  Make them give us the tools to rid it of our peace of mind. That is not the case where I live. We don't even have a American Cancer Society representative where I live.  They don't even have a support group for any type of cancer available.  If you have resources available don't shut the door too tightly the first time around.  Find another group or start one of your own.  That is what I am starting, however it will be a group for all survivors.  I don't care what word or type there is before \"cancer\" we all have a disease that can kill us and we need to stand strongly together for all of us to be cured! I hope you find the peace of mind you need but you must seek it out.  I know this is difficult and  i humbly admit I didn't do very well myself initially, but i intend to this time. This board is a great tool to get to know people and to learn about concerns, treatments and just to get support and love.  There are other one out there too. Take care and Bless you in your quest you will make it!!! Cathy K.",
      "MessageIndex": 6,
      "PostDate": "23/09/2013",
      "ThreadURL": "https://csn.cancer.org/node/262596",
      "Title": "transitition from cancer patient to survivor, and living with side effects"
    }
  ]
}