{
  "AuthorID": "karbear",
  "AuthorURL": "https://csn.cancer.org/karbear",
  "Posts": [
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "I will also be praying for you that you have a clear mammo...i know how you feel I am also going for my first one june 5,which is one year and one day after finding out i had CANCER !!!! I am scared toooooo..I think its something we will deal with now for the rest of our lives !!!we just have to pray that our cancer never returns ! god bless.....karin",
      "MessageIndex": 7,
      "PostDate": "20/05/2002",
      "ThreadURL": "https://csn.cancer.org/node/137744",
      "Title": "in need of prayer and reassurance"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Grandma, just wanted you to know that I will be praying for you and that your next chemo is better than the first. Just remember its the only way to kick chemo in the butt !! Even though it may knock us on our butts. Just keep counting down those chemos ! Did you find losing your hair very difficult? I was so much better about it than I had thought, I was told I would be devastated, but actually I looked at it as MY HAIR or MY LIFE ?? and it made it so much easier, now my hair is growing back curly,just as I had heard it may, and I will never complain about a bad hair day again! I hope all goes well with your husbands doctor appt. I will keep him in my prayers also. God Bless you both !! karin",
      "MessageIndex": 2,
      "PostDate": "15/03/2002",
      "ThreadURL": "https://csn.cancer.org/node/137182",
      "Title": "up-date"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Just wanted to let you know that you will be in my prayers that all goes well. You sound like you have a wonderful attitude,and thats what gets us through all this. God Bless ! Please post as soon as you are able with your update. karin",
      "MessageIndex": 3,
      "PostDate": "13/03/2002",
      "ThreadURL": "https://csn.cancer.org/node/137170",
      "Title": "Quick Update"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Hello, Just wanted to say to Hang in there !! I just completed chemo end of Sept. and I too thought how can I do this,,but I did,,I just told myself I had to do it for myself,children (5 of them) ,husband and family . I laid there thinking now I know why people opt not to do chemo, but I wanted to make sure that all the cancer cells were gone and I would do anything to make sure they are gone forever!!!!!!!! I was usually sick for a week after chemo then another week before anything tasted good again. Its amazing what it does to us..My doctor told me that I shouldn't have been as sick either but they tried all the naseau meds. and nothing helped,,it made it worse,,as a matter of fact I would just look at the bottles of meds. and would be sick..it was awful, and I also before chemo would be totally nasaua the minute I hit the onlcology floor..the smell was awful,although everyone told me they smelled nothing ...I would sick while getting chemo and my stomach would be totally turning then as soon as I reached home I was sick,,Its awful for anyone to go through,some go through it without getting sick I read, but I still say I would do it all over again to rid CANCER !!! Just hang in there tough and if you need to talk ,I'll be here along with all the other wonderful women here to listen and help you through..Best of luck to your husband also. You both will be in my prayers. God Bless !! Karin",
      "MessageIndex": 1,
      "PostDate": "08/03/2002",
      "ThreadURL": "https://csn.cancer.org/node/137143",
      "Title": "1st chemo"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Pam, You keep hanging in there !! You have the right attitude, I admire that !! I will keep you in my prayers that this drug they are using helps kill those darn cancer cells , keep strong and god bless you!!! karin",
      "MessageIndex": 12,
      "PostDate": "11/10/2002",
      "ThreadURL": "https://csn.cancer.org/node/138736",
      "Title": "Now on Zeloda"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Hi Emmi, was just wondering how you're doing with you're treatment.I hope all is well. Keeping you in my prayers..God Bless,Karin",
      "MessageIndex": 0,
      "PostDate": "04/09/2002",
      "ThreadURL": "https://csn.cancer.org/node/138535",
      "Title": "Emmi,wondering how treatment went?"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Emmi, I hear ya about your bummer day! I have many of those. Its so hard all of this and people don't understand unless they have been through it. You want to be strong but somedays I think it catches us! I hope that you can rid those \"bummer days\"..we are all here for each other..god bless!! karin",
      "MessageIndex": 5,
      "PostDate": "08/06/2002",
      "ThreadURL": "https://csn.cancer.org/node/137916",
      "Title": "Bummer day"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Judy,,so sorry to hear about having your implant removed,I hope this helps with your pain..I will definately keep you in my prayers..GodBless...karin",
      "MessageIndex": 1,
      "PostDate": "21/06/2002",
      "ThreadURL": "https://csn.cancer.org/node/138047",
      "Title": "implant removed"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Hello, I am a 6 year survivor and have a question about what kind of precautionary steps your oncologist takes. I had my check-up with my oncologist only to find out that he has LEFT!! No one told me until I read the sign on the window in his office. I was devastated,felt like I lost my best friend (after all he saved my life and I trusted his every decision regarding my treatments)I wanted to cry as I waited to see a new oncologist,whom I've never met..The only explanation I had gotten for my doctors not being there was \"hes not wanted by the cops,hes not in jail,he hasn't fled the country\" ..I was so crushed..The new doctor didn't seem as concerned about doing any blood work,xrays or mammograms. My old doctor had told me that he will have that all done each year for the rest of my life..so now I'm feeling that I don't have any safety net underneath me anymore,,it was rough when they took all the meds. away,for some reason they were my saftey net also.now I have none!! This doctor had told me no reason for mammogram cause I had DIEP and a double mastectomy ,but my other oncologist said \"they would do ultrasound to check the surrounding areas\",So I was wondering what kind of precaution other survivors have done and for how long did you have them done for? Sorry to rattle on but this has been bugging me since my appt...Thanks again and God Bless!!",
      "MessageIndex": 0,
      "PostDate": "29/01/2008",
      "ThreadURL": "https://csn.cancer.org/node/156773",
      "Title": "A question for survivors"
    },
    {
      "AuthorID": "karbear",
      "AuthorURL": "https://csn.cancer.org/karbear",
      "Content": "Grandma,,its wonderful to hear all is going well for you. I am keeping you in my prayers as with your husband. You two keep kicking BUTT !!! God Bless...karin",
      "MessageIndex": 6,
      "PostDate": "03/05/2002",
      "ThreadURL": "https://csn.cancer.org/node/137433",
      "Title": "Kickin butt!!"
    }
  ]
}