{
  "AuthorID": "Kathy1108",
  "AuthorURL": "https://csn.cancer.org/Kathy1108",
  "Posts": [
    {
      "AuthorID": "Kathy1108",
      "AuthorURL": "https://csn.cancer.org/Kathy1108",
      "Content": "My then GYN doctor find the lump in my breast, sent me for a mammogram and ultrasound. She said both test was fine. I waited 6 more months (checking the lump regularly) before going back to the Dr. When went back to make sure that this was still fine, she examined me (that only took like a second) then she said that I needed to go see a surgeon. The surgeon did a biopsy and a few days later she called me to tell me that I had cancer. I also had it in 4 of my lymph nodes. So, please make sure that they do a biopsy on you.",
      "MessageIndex": 7,
      "PostDate": "01/02/2006",
      "ThreadURL": "https://csn.cancer.org/node/149481",
      "Title": "kinda silly question"
    },
    {
      "AuthorID": "Kathy1108",
      "AuthorURL": "https://csn.cancer.org/Kathy1108",
      "Content": "Hi Franny, My treatment was A&C and Taxol. Like what Sassy said, drinking a lot of water is the best thing she can do. Even if she isn't thirsty keep her drinking. Also she should have little snacks throughout the day. When I had my treatments I brought in a cooler that had water, cookies, crackers etc. When she get the taxol treatment her toes and fingers are going to be a little numb and tingly but unfortunately that will last for 1 year. My toes are still a little numb and my treatments were in 10/03. I too took the nausea medicine and it helped me get through the treatments. When I noticed that my hair was starting to fall out I had my hair cut very short and then I had my husband shaved the rest off. That did made it easier for me. I did wear wigs and hats because I could not (and never did) look at myself when I was bald. That was too hard for me to do. If you have anymore questions you can also email me too. Good Luck. Kathy",
      "MessageIndex": 3,
      "PostDate": "23/02/2005",
      "ThreadURL": "https://csn.cancer.org/node/146234",
      "Title": "New to this board"
    },
    {
      "AuthorID": "Kathy1108",
      "AuthorURL": "https://csn.cancer.org/Kathy1108",
      "Content": "Hi Wendy In 2003, I had the sentinel node biopsy and my surgeon took out 15 lymph nodes, 4 was positive. I had to have radiation because of that besides having chemo. I also had a mastectomy. I was progestron positive and estrogen negative. My onc doctor put me on Femara. Because of having some of my lymph nodes out I have to be very careful with that arm. I can not have blood, injection, IV and blood pressure taken from that arm ever again. I have to wear a medical alert bracelet now.",
      "MessageIndex": 4,
      "PostDate": "17/09/2005",
      "ThreadURL": "https://csn.cancer.org/node/148318",
      "Title": "Receptors??"
    },
    {
      "AuthorID": "Kathy1108",
      "AuthorURL": "https://csn.cancer.org/Kathy1108",
      "Content": "Hi Franny, My treatment was A&C and Taxol. Like what Sassy said, drinking a lot of water is the best thing she can do. Even if she isn't thirsty keep her drinking. Also she should have little snacks throughout the day. When I had my treatments I brought in a cooler that had water, cookies, crackers etc. When she get the taxol treatment her toes and fingers are going to be a little numb and tingly but unfortunately that will last for 1 year. My toes are still a little numb and my treatments were in 10/03. I too took the nausea medicine and it helped me get through the treatments. When I noticed that my hair was starting to fall out I had my hair cut very short and then I had my husband shaved the rest off. That did made it easier for me. I did wear wigs and hats because I could not (and never did) look at myself when I was bald. That was too hard for me to do. If you have anymore questions you can also email me too. Good Luck. Kathy",
      "MessageIndex": 2,
      "PostDate": "23/02/2005",
      "ThreadURL": "https://csn.cancer.org/node/146234",
      "Title": "New to this board"
    },
    {
      "AuthorID": "Kathy1108",
      "AuthorURL": "https://csn.cancer.org/Kathy1108",
      "Content": "I had Neulasta 4 times after A/C treatments too. My whole body ached. It was very painful to touch any part of my body. The good thing was that it only lasted 1 day. By the next day I was fine.",
      "MessageIndex": 6,
      "PostDate": "06/08/2005",
      "ThreadURL": "https://csn.cancer.org/node/147859",
      "Title": "Neupogen"
    },
    {
      "AuthorID": "Kathy1108",
      "AuthorURL": "https://csn.cancer.org/Kathy1108",
      "Content": "Hi Jill, I am on Femara too and my onc. doctor gave me pain medicine called Ultraset. It does help a little but I can only take it at night because it makes me sleepy. I used to be on Celebrex, Viotox (sp) and bextra but I stopped taking them because of the side effects. I feel the same way, I am also 44 but feel that a very old person. Kathy",
      "MessageIndex": 1,
      "PostDate": "07/09/2005",
      "ThreadURL": "https://csn.cancer.org/node/148242",
      "Title": "Femara side effects?"
    }
  ]
}