{
  "AuthorID": "Katmy",
  "AuthorURL": "https://csn.cancer.org/Katmy",
  "Posts": [
    {
      "AuthorID": "Katmy",
      "AuthorURL": "https://csn.cancer.org/Katmy",
      "Content": "My physician works with another that has horrible \"bed side manner.\" I complained to her after multiple unsatisfactory calls to him. She gave me her home phone. I don't think I am the only one who complains. Maybe tell your Oncologist what happened and then see what he/she recommends. You may not be the only one who has experienced brusk behavior from him. Your Onc may have another avenue for you. He was super rude to you. And... if it was not you to call him on his cell phone, the hospital was going to. Either way, the cell phone rings. What is up with this guy? I was a doctor's child and the phone rang off the hook at all hours. I learned to sleep through, go back to sleep, whatever. You put no imposition on his family. Let me assure you.",
      "MessageIndex": 5,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216185",
      "Title": "on call doctor out of line or not? your take ladies!"
    },
    {
      "AuthorID": "Katmy",
      "AuthorURL": "https://csn.cancer.org/Katmy",
      "Content": "I, too, am sorry about Bodhi. My dog has been my best friend through my cancer. She has listened to every emotion and loved me still. A good book you may enjoy is Merle's Door. If you love dogs, you will love the book. It may help you with your grieving. Keep a box of tissues near by toward the end.",
      "MessageIndex": 33,
      "PostDate": "18/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214129",
      "Title": "my dog has cancer"
    },
    {
      "AuthorID": "Katmy",
      "AuthorURL": "https://csn.cancer.org/Katmy",
      "Content": "My bc cancer was derailed for a day or two by something found on a test run for my Onc. Radiologist. I just zoned out of life when I could and went numb. Thinking of the possibilities and changes in current therapy was so much to comprehend. I am thinking of you and hope you can quiet your mind of cancer while \"life\" can occupy you. It is a most difficult thing to do. Now, bc treatment is started and I wonder, \"what will they find later, during follow ups, etc.\" Maybe the incidentals that they find will always cause stress beyond comprehension. I don't know. Hope you are feeling better after writing to the group.",
      "MessageIndex": 7,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215470",
      "Title": "Freaking Out"
    }
  ]
}