{
  "AuthorID": "Katz77",
  "AuthorURL": "https://csn.cancer.org/Katz77",
  "Posts": [
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I remember (yea) someone was taking effexor for hot flashes. Is it working? Dont want to take pills for another thing, but it may be worth it? Thanks, Katz",
      "MessageIndex": 0,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211901",
      "Title": "effexor for hot flashes"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "It is kind of weird without boobies, but got me some new ones. At least on the one side. Going to have elective mast hopefully on the 21st this month. See surgeon tomorrow. Then I shall wear my tee that says, course their fake, the real ones tried to kill me. Good luck with all your test. You know, thinking back I did an experiment. Had tight shirt(premast) and a girl (younger than me) was walking towards me with her boyfriend, she mean mugged me! We were about the same boob size, so I couldn't figure whyyy mean mug me. I have wrinkles even. I think we women consider our boobs a power source to a point. Weather it's conscience or not. I don't really miss mine any more. Think we all are stronger than we first realize. I'll be keeping you in my prayers. It will be ok :) Katz",
      "MessageIndex": 9,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203151",
      "Title": "Mastectomy is my only option"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "So sorry that cancer is throwing you and ur family a hard curve ball. People say (used to also) things happen for a reason. I haven't so far found the reason. Maybe a learning experience? Don't know why bad things happen to good people. You, Meena are one of these people. Your insight,compassion, knowledge and love you show for the others on this site is truely awe inspiring. We all respect your courage for posting. I just wish you felt better. This may sound a bit weird, but if I have a reoccurence, may I have the grace and stamina you seem to have at all times. I know I respect you for what you've done for me and others on this site. May all your tests and new Drs be a positive experience for you. Keeping you in my prayers and thoughts. Katz",
      "MessageIndex": 37,
      "PostDate": "17/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198639",
      "Title": "Update on my reoccurence"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Had to share my milk thistle story. I was finishing up the last of Taxol, and read a report, I think on NIH page about detoxing the liver. Milk thistle on there. I had asked my Onc. He wanted me to wait till treatment done. I even waited a couple more months. Didn't want to \"wash\" away Taxol. I don't know if anyone experienced a soft skin feel and even wrinkles were less, during treatment with taxol. I did. I loved my skin. Hated my hands and feet, neuropathy. lol Of course skin went back to it's normal texture and yes the wrinkles returned. Anyhow ( I'm a babbler)Started taking the milk thistle and the smooth and wrinkless skin returned for a couple of weeks. Then, of course back to \"normal\". Guess what I'm saying, I do believe in it. Take it daily now. Felt like a cleansing, esp after all the posion being dump into me. OF COURSE, DEF NEED TO TALK IT OVER WITH YOUR DOCS. This was my experience. Was I yelling? lol Everyone have a great day, weekend. Katz",
      "MessageIndex": 3,
      "PostDate": "05/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198013",
      "Title": "milk thistle and liver function during chemo"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "It's a new normal and the SE when start getting better. Everyone is different, but I found a nice relaxing bath with bubbles of course helped and a nice hike or walk and searched for the beauty around me. Chemical cocktails do a job on you, but it will get better i can promise you that. This site is a wonderful place to come to also. Positive energy to you. Katz",
      "MessageIndex": 22,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200759",
      "Title": "Cried my eyes out tonight !!!!"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I haven't had flank pain, but lower back discomfort. Guess that's what I'd call it. Had visible blood for a day. Seen onc last week. Did a urine test, no blood. Course, I waited a couple of weeks before told anyone, cause of having a appt. So off to the urologist on 7-10. I didn't have urinary problems like UTI. No popping feelings. I'm thinking kidney infection for you. Running a temp.?",
      "MessageIndex": 15,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194229",
      "Title": "Flank pain...."
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I'll keep it clean on this post... cancer sucks. Prayers to you mama g. Keep fighting the beast. We're all here for you and your family. God be with you on this lastest journey. Keep us posted. Hugs Katz",
      "MessageIndex": 47,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210344",
      "Title": "it's back again....... in my spinal fluid"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Bless you both. I don't know what to say, but your all in my prayers. HUGS, Katz",
      "MessageIndex": 24,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202578",
      "Title": "DOES IT EVER STOP????"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I'm sorry, I haven't had this issue. I'm very glad your going to your surgeon. Wish you well. Fingers crossed. I would expect maybe, besides a manuel exam, he/she may do an ultrasound, MRI or something along that line. Keeping it positive for you. Gayla",
      "MessageIndex": 1,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193485",
      "Title": "Breast secrtions"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Yabba, dabba, dooo! Good for you. Prayers do work. Katz",
      "MessageIndex": 17,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215717",
      "Title": "No Colon Cancer,Thank you Jesus"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I to have noticed a disturbinb observation. I was dx at age 48 (well above 40), and I no known family hx. Dad's side little scitchy. I have two daughters 23 and 30. I being in the medical field taught them at an early age to self exam. I told my oldest daughter she needed an mammo, and for my youngest to get herself checked at her drs(she had an appt.)and to tell her about my dx and to see if she needed a mammo. Well was surprised at both of their replys back to me. The oldest dr said she was to young, and the youngest dr said not to worry about it! Two daughters, two diff drs and a mother w a very aggressive brst ca and node involvement, and a scitchy hx on their gfathers side. My advice to them was to demand a mammo or ultrasound for at least a baseline. My ca WAS a fibroid and was told to back off caffiene! It grew to ca in 2months time All lymph nodes too. Early detection! Ur daughter-in-law has the right to a mammo. I don't understand what the issue is. At my chemo sessions, their are two under the age of thirty.",
      "MessageIndex": 7,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175916",
      "Title": "Mammogram for the under 40"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I don't mean to sound stupid, but what's \" oncotype\"? I haven't heard this word yet. I actually work in surgery for the last 18 yr. Know all about ports, mastectomies etc., but now I find myself on the other side of the wall and all is very strange new land. I was told, er pos., common ductal, total node involvement,and level 3. It's aggressive. Does this mean anything to the oncotype?",
      "MessageIndex": 5,
      "PostDate": "17/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175791",
      "Title": "Decisions to be made."
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Well, I did the same thing when I started Tamoxifen. I don't believe it's the herceptin, cause I had been on that before tamox. happy to report not driving and crying anymore. Been on tamox for 3 mons. Don't recall how long I was on tamox before crying stopped, cause I was crying. lol If it continues, say passed a month it may be something like depression. Keep smiling and hopefully it will pass soon. Gayla",
      "MessageIndex": 5,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184055",
      "Title": "Cry"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Me too, Me too. Thank you for the suggestion. Will get it next payday. lol",
      "MessageIndex": 8,
      "PostDate": "31/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/193098",
      "Title": "The AntiCancer Way - book"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Well, I did the same thing when I started Tamoxifen. I don't believe it's the herceptin, cause I had been on that before tamox. happy to report not driving and crying anymore. Been on tamox for 3 mons. Don't recall how long I was on tamox before crying stopped, cause I was crying. lol If it continues, say passed a month it may be something like depression. Keep smiling and hopefully it will pass soon. Gayla",
      "MessageIndex": 6,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184055",
      "Title": "Cry"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Wondered where u \"fluttered\" off too. Glad you've turned the corner. Yess, repeat it over and over if needed. I HATE BEING SICK! Before I'd get a bruise or nausea or leg pain, and I'd \" walk\" it off. Now it's like \"I need to call the Dr.\" Feel like a hypochrondiac sometimes. Keep us updated when ur up to it. Hugs and positive energy headig ur way. Gayla",
      "MessageIndex": 8,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194208",
      "Title": "Hello pink warriors :)"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I hope all goes well for you both. Feel better and stronger each day. Sounds like a cuddle weekend for you both. Update us as you feel like it. Hugs to you both,Katz",
      "MessageIndex": 28,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211820",
      "Title": "Meena .. How are you doing, our PINK WARRIOR .. We are thinking about you"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I don't think I'm going to get a nipple. Kind of liking the \"smooth\"look for now. I work in surgery and will say this. My own survey. Skin grafts sometimes have a hard time w healing, esp to the graft site. I think the purse string approach would be better. Also only one area to heal vs two. Graft site and donor site. I'll be interested on how you and ur new nipple do. Keep me updated. Gayla",
      "MessageIndex": 1,
      "PostDate": "09/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Wishing you the best. Praying for you and for the meds to work. Positive energy coming to you. Katz",
      "MessageIndex": 18,
      "PostDate": "25/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201781",
      "Title": "Hey checking in just got out of hospital need prayers"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "I dont know how often I'll get them though. Had one April 10'. Had bilat masts,chemo and rads. Last herceptin Sept 10'. When I started this little adventure I was premenopausal. Just took 4 months to make me post-menopausal. Lol On femara now to keep me that way. Scan in april and then one in Jan. are virtually unchanged. No osteoporosis, just osteopenia. Little thin. Get your bones checked girls. Happy your scan came back good too. Katz",
      "MessageIndex": 9,
      "PostDate": "07/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209356",
      "Title": "Muscle Girls... was a Bone Density Test recommended for You?"
    },
    {
      "AuthorID": "Katz77",
      "AuthorURL": "https://csn.cancer.org/Katz77",
      "Content": "Hi, Well I had 20+ nodes removed and 18 back positive for ca. I have mild ( compared to some) edema. Usually after a long work day, missed my exercises and elevation or sitting at the computer to long, esp w/o my \"sock\". My understanding of lymphedema is that it can occur at any time. Some as long as a yr later. That's what I read on a lymphedema site. Ahhh the joys of breast cancer. lol",
      "MessageIndex": 8,
      "PostDate": "07/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193737",
      "Title": "I am taking part in a Lymphedema research study"
    }
  ]
}