{
  "AuthorID": "krisrey",
  "AuthorURL": "https://csn.cancer.org/krisrey",
  "Posts": [
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "You are in my prayers also. Take care and God Bless Kris",
      "MessageIndex": 2,
      "PostDate": "14/06/2004",
      "ThreadURL": "https://csn.cancer.org/node/143761",
      "Title": "ASKING FOR YOUR PRAYERS"
    },
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "Hi DJC Like you and Roxanne, my hair also came back a different color of gray, white and black look. But now it appears to be turning brown, so I have no clue what its doing..lol My treatment ended September and its very cury and I have had two haicuts. I figured I would wait until April to see what it was going to turn into since it seems to be turning light brown now. I was going to get it highlighted but now you bring up some good points. Also, I did not want to dye it because I have never dyed my hair and I don't want to become a slave to keeping up roots. I wonder why it comes back such a different color, especially since I never had gray hair before. To tell you the truth I am getting kind of use to it and I am really excited about having hair, and curly too!!!lol. Lets see what others say about coloring the hair.. Kris",
      "MessageIndex": 2,
      "PostDate": "01/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142440",
      "Title": "Grecian Formula"
    },
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "HI grafidog, Thanks for sharing your wonderful story of hope, and congradulations on your new birthday. It will be one year of my dx coming on Good Friday, I finished treatment on December 30th. Like you I had many of the same exact thoughts. My twin girls are much to young (9years) and I just prayed that I will be able to raise them and see them lead a productive full life. I am not thrilled with my \"new\" status but I also know that I have done all I could do (treatments) and am doing everything possible now staying positive and learning to go on with my life and enjoy my girls.",
      "MessageIndex": 5,
      "PostDate": "17/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142650",
      "Title": "surviving"
    },
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "Hi Jean, I am so sorry to hear about all your stuggles. I have no idea why the patient has to work so hard and push for treatments. The patient has to be their own avocate along with all the other struggles of fighting with cancer!! I will keep you in my prayers. I wish you well Jean, Kris",
      "MessageIndex": 3,
      "PostDate": "31/05/2004",
      "ThreadURL": "https://csn.cancer.org/node/143602",
      "Title": "herceptin's downside - not pretty"
    },
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "Hi AngelBaby, I have the same dilemma. While I am totally delighted that my hair is growing back, it is coming in an entirely different color. I had blondish hair before chemo, now sometimes it looks brownish,or very dark, sometimes it almost looks white...eeek!! I really don't care what color it is, it just feels good to have it back, everybody tells me it looks great and I am starting to go without a hat, so I feel GREAT!!",
      "MessageIndex": 2,
      "PostDate": "09/12/2003",
      "ThreadURL": "https://csn.cancer.org/node/141575",
      "Title": "Hair Help..."
    },
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "Hi Sue, You must be reading my mind. I too have been thinking of Linda and wondering how she is doing. Also Sue...I just read a post from you in the other forum about your sister. I tried to reply but something kept knocking me off. Your sister has been through so much. I have been thinking of her (and you). Having gone through all she has gone through and then having her husband pass away....I just don't know what to say. Please tell your sister that I am thinking of her. How are you doing Sue? I sure hope Linda checks in also. I have not been on this board or any board for a while so it was great to see your post here. Hope to hear from you soon! Kristen",
      "MessageIndex": 1,
      "PostDate": "23/02/2006",
      "ThreadURL": "https://csn.cancer.org/node/149711",
      "Title": "Checkin' on LindaTN..."
    },
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "Hi Alien.. Nice meeting you today in the chatroom. Please let us know how the ultrasound turns out. I have never heard of this before. Hopefully it will be nothing.. Kris",
      "MessageIndex": 1,
      "PostDate": "14/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141823",
      "Title": "carotid artery"
    },
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "AngelBaby and Rizzo, I seem to have some sensitive spots on my gums also. But Rizzo..I would check with your dentist again because I remember that my dentist put some kind of white type of filling stuff over the sensitive area, kind of like blocking it..I also have gone for regular 6 months check-ups my whole life. My next appt is in April so I will see what happens. Kris",
      "MessageIndex": 2,
      "PostDate": "16/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141835",
      "Title": "Dental problems after chemo"
    },
    {
      "AuthorID": "krisrey",
      "AuthorURL": "https://csn.cancer.org/krisrey",
      "Content": "Hi all, As a continuation of the thread for MRI's, I thought I would post an article that I found. Maybe some of you have already read it. Since we all already had breast cancer, I think we are all in the high risk now. I have had my first MRI because the mammogram or ultrasound could not rule out cancer in my other breat. If you haven't already talked with your doctor about MRI, you may want to look into it. Both are valuable at reading different kinds of cancer that one or the other may not pick up. As in my case and many others here the mammogram did not pick up my cancer. Kris http://www.cancerpage.com/news/article.asp?id=7318",
      "MessageIndex": 0,
      "PostDate": "13/08/2004",
      "ThreadURL": "https://csn.cancer.org/node/144334",
      "Title": "MRI info for high risk"
    }
  ]
}