{
  "AuthorID": "lanie940",
  "AuthorURL": "https://csn.cancer.org/lanie940",
  "Posts": [
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I have osteopeana, it's before osteoporosis. Yes, Arimidex can weaken your bones. I was taking Fosamax for my osteopena and it gave me GERD after being on it 4 years. Then came my diagnosis of Celiac, which also is connected with osteoporosis! Many who have Celiac have underlying osteoporosis.",
      "MessageIndex": 2,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186179",
      "Title": "Osteoporosis diagnosis"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I made sure I put the ice pack on at least 20 minutes an hour after my surgery. I never had any breathing problems, my throat hurt from that tube they put down during surgery, though. I took extra stength Tylenol also. Actually, my right side was a bit tender, I sleep on my left side for the most part anyway. My tumor was in my RT. breast.",
      "MessageIndex": 1,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/176877",
      "Title": "Hard to breathe after surgery"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I agree! My Oncology surgeon and my Medical Oncologist are associates.",
      "MessageIndex": 2,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180193",
      "Title": "Surgeon vs. Oncologist"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I am very sorry for your recurrance. I have a friend who is your age and a Nurse who lives in Schumburg,ill. I live in PA. Wishing you the best. I am taking Arimidex, I was told by my Drs I had to take it.",
      "MessageIndex": 3,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184457",
      "Title": "Recurrence Very Rare for Initial Cancer 0 Stage DCIS"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "That brings to mind one of my residents I had in the Nursing Home I worked at. Her daughter made little sweaters for small teddy bears out of guess what? HAIR she combed off of her dogs! What talent!",
      "MessageIndex": 2,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/176749",
      "Title": "When I cut my hair..."
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Well, when I was in the hospital which was OK, now for my Lumpectomy in July, my hernia in October, and then 3 more times. I think I must have told time my name and birthdate over 100 times. I'M serious! They ask it over and over again! EVEN when I got my meal trays!",
      "MessageIndex": 4,
      "PostDate": "02/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185182",
      "Title": "Medical Records Vent"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "July of 09. I was 59.",
      "MessageIndex": 40,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "well, you look great!!!",
      "MessageIndex": 77,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Mine is Oct 7th. I'm an old lady,LOL",
      "MessageIndex": 25,
      "PostDate": "31/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "July of 09. I was 59.",
      "MessageIndex": 140,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "July of 09. I was 59.",
      "MessageIndex": 90,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Mine is Oct 7th. I'm an old lady,LOL",
      "MessageIndex": 75,
      "PostDate": "31/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "well, you look great!!!",
      "MessageIndex": 27,
      "PostDate": "01/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Ok, has anybody seen the public service announcement for Breast Cancer? It's a hoot.It's called Save the Boobs, it's a real \"Hooter\"",
      "MessageIndex": 2,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176565",
      "Title": "funny skit on youtube"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "It usually take 2 weeks for the test to come back. Most ins companies cover it, or at least 80% of the cost. It's not cheap, but I wanted to know. They have tissue saved from the tumor they took out. My tumor was only 1.1 cms so the mammoprint was not able to be done. My sentinal node was negative.",
      "MessageIndex": 4,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175791",
      "Title": "Decisions to be made."
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "My friend who was my Maid of Honor in my wedding found a lump in her breast at age 25. Her GYN just told her she was too young and it was hormonal changes! NOT! He put her off for 4 months! She started getting oozings out of her nipple. Went to another Dr. He ordered her a insisional biopsy. It was definately cancer, she had a modified radical mastectomy at age 25. She never had radiation or chemo or hormone treatment. She is 57 now, and is doing great. What the heck is wrong with these Drs?",
      "MessageIndex": 9,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175916",
      "Title": "Mammogram for the under 40"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "My Drs in the Cancer Care say 30 for baseline if you have a first relative family history. Like Mother,Sister. I had my first one at age 40. They have all been fine until this last one!",
      "MessageIndex": 11,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175916",
      "Title": "Mammogram for the under 40"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Did you have an Oncotype dx test done to see if you really need chemo?",
      "MessageIndex": 1,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175791",
      "Title": "Decisions to be made."
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I'm waiting on my results.I should find out soon. I see my Oncology surgeon and medical oncologist next tuesday. I also have to have a hernia repair operation and at that time the surgeon will remove a couple of tumors in my left axilla area that my oncology surgeon found in his initial examination of me back before he did the lumpectomy. He doesn't think they are cancer, but wants them out to see what they are. My hernia surgery is scheduled for Oct 8th. At that time he will remove the other lumps.",
      "MessageIndex": 2,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175791",
      "Title": "Decisions to be made."
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I have had 15 treatments so far, I haven't had any pinkness as of yet. I was told to use plain aloe and have been like 2 times a day. BUT, I noticed after 3 or 4 treatments I have been feeling queezy especially in the mid to late afternoon and evening. It was so bad last night I had my husband go buy me some Emetrol (nausea relief)I also have IBS and it has been acting up a lot and I have watery diarhea. I have lost 5 lbs in a little over a weeks time. I told my Radiologist I was having queeziness and he said that it couldn't be from the radiation (riiight)in the pigs eye. I even went to my family Dr. last Monday, she said I had a mild stomach virus, hmmm, well, it has lasted too long, I think for that. I have a call into my surgeon who did the hernia, he hasn't gotten back to me yet, I know he does a lot of surgeries. Hopefully he will this weekend. I'm so tired of not feeling well and the holidays coming up!",
      "MessageIndex": 4,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179799",
      "Title": "Overachieving Rad Girl -- would appreciate advice from Rad Graduates!"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "OH Geez, my Radiologist said something about Bag Balm! I've just been using the clear aloe so far, I haven't burned as of yet. Just one more thing to be agravating to me. I've had this nausea in afternoon and evening, I feel like crap. It kinda started after 4 or 5 RADs treatments, my Radiologist says no, my RADs shouldn't cause nausea, BUT my surgeon who did my hernia surgery said yes, it IS possible in some people. I'm known to be a strange one medically. I called him yesterday and his answering service paged him, he called me back. So far my weekend has been horrible, just a yucky feeling all way round and runny diahrea, so he wants me to get a abdominal X-Ray and stool sample (how with no stool)lol. He prescribed compazine for my nausea, and that has helped, but also Flaygl! I think he is thinking I may have C-diff! It is fairly common to get infections from a Hospital stay or 2 or more days, did you know that Ladies? I know i got my UTI from being catherized, and so that antibiotic CIPRO could be doing this number on me! ARRGH! My husband is acting like he is sulking or something because his wife can't do things with him. I'm so sick of this!",
      "MessageIndex": 9,
      "PostDate": "15/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179799",
      "Title": "Overachieving Rad Girl -- would appreciate advice from Rad Graduates!"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I put my clear aloe on at bedtime. If I remember I do it as soon as I get home after RADs, but today was nuts. I needed some blood tests, stool sample, and tomorrow X-Rays of my abdomen. All because of having to take CIPRO for a UTI after my hernia surgery. I have had 16 treatments, my chest above my boob is looking like it does in summer, just a bit of color, not burned. Sooo, I wonder if it will by weeks end, I'll of had 20 then. then only 10 to go!",
      "MessageIndex": 22,
      "PostDate": "16/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179799",
      "Title": "Overachieving Rad Girl -- would appreciate advice from Rad Graduates!"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Just to let you know, Radiation isn't cheap either. I don't think it's as expensive as Chemo, but it runs pretty close. I think when it's all said and done mine will have cost about 50,000! I have good ins through my husband. There is help out there, so I'm sure if you contact the ACS they can direct you for help.",
      "MessageIndex": 13,
      "PostDate": "24/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182624",
      "Title": "Has anyone out there refused chemo?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I had nausea during my RADs, but I'm pretty sure it was because my Celiac disease was coming to a head. It is had to tell, I was tired, some days very tired, but I think it was more do to the Celiac.",
      "MessageIndex": 14,
      "PostDate": "29/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184861",
      "Title": "Nauseated with Rads ???"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I agree with you, chemo would have only increased my odds by 2-3% so I refused it also. I based my decision on my Oncodx type report. My cancer was caught early, no lymph node involvement. Right now I'm dealing more with my Celiac disease! It has wreaked havoc with my bodily systems just as much as chemo possibly could be. I've been hospitalized twice 6 days for dehydration (nausea/vomiting/diarreah(may as well of had chemo,lol. Then this last time it was a severe electrolyte imbalance, and I am talking very severe! I could have died,seriously, this is what I was told,it was THAT BAD! My numbers were off the charts when I came to the ER last saturday. I'm home now, and hope I can maintain proper levels with suplements. I am still feeling some weakness, I need my strength back. I don't know how much RADS zap strength, I had 30 RADs, 25 full rt breast and 5 boosts. I was VERY lucky not to ever burn, only dryness. I will be starting Arimidex when I see my Medical Oncologist and ask him about what affects my Celiac and the suplements I'm taking for it. Celiac can be a very serious disease, why I got it at age 60 is a mystery. they say surgery and or severy emotional stress can bring it to a head if it's been in your system but only mild. I thought I had IBS for about a year, it was Celiac working on me. It destroyes your vili in your SM bowel, you can't take nutrition in, you loose a lot of weight in most cases from diarreah which is what causes the potassium imballance wich can cause other electrolyte imballances. you are also prone to lymphoma of the sm bowel. So far my plumbing organs and the others, liver,pancreas and gal bladder and kidneys are fine. They are still checking parathyroid. So we shall see. this whole breast cancer and hernia operation and now Celiac has been a real adventure I didn't want to be taking!",
      "MessageIndex": 12,
      "PostDate": "24/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182624",
      "Title": "Has anyone out there refused chemo?"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "OH Meena, it's a beautiful MESS! ARRGH. I hate it, even though the snow all flocked on the trees is beautiful, but enough is enough! We only got 8 inches whenyou got over 20 the first time, I thik we have at least 16 inches this time, AT LEAST! Our power was out for 3 hours this evening. luckily I had made a vegetable stew and it was still warm on the stove when the power went out.",
      "MessageIndex": 12,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185728",
      "Title": "SOCKED WITH SNOW......IN PHILADELPHIA"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Farmville has been keeping me busy, you should join us!",
      "MessageIndex": 15,
      "PostDate": "11/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185728",
      "Title": "SOCKED WITH SNOW......IN PHILADELPHIA"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "What steroid do they give you? I have taken prednisone twice for shingles, and it wrecked my appetite, things tasted like metal.",
      "MessageIndex": 9,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176071",
      "Title": "appetite"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Yes, I had that done before my lumpectomy, it's called a \"needle loc\"as in locater. No, it didn't really hurt because the Radiologist numbs the area, it won't be anymore uncomfortable than when they numbed you for your biopsy, at least it wasn't too bad for me. Are you getting the \"sentinel node\" done also? Now that is a little more painful, so I'm not going to sugar coat it. The Radiologist will tell you it will hurt for about 10-20 seconds with each needle. If you want to cry or grimace, do so! His Tech helper held my hand and let me squeeze it, she was a doll. Why are they doing the lumpectomy with a local or consious sedation? I was under General. I woke up and heard people talking behind the curtain next to me,LOL Then my surgeon came over and said it went well, sentinel node was clear, you're going to Disney World,LOL (I was in a few weeks) It was like a mammogram machine they used, but they don't squeeze you like in a regular mammogram, the side the Radiologist inserts the needle/wire is open. I had a side sticker sitting there, but I think it was my hernia bothering me,LOL",
      "MessageIndex": 3,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176460",
      "Title": "question about a lumpectomy"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "Mine didn't want me to take anything but Tylenol before any of the procedures.",
      "MessageIndex": 9,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176460",
      "Title": "question about a lumpectomy"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "OH my, I hate electrolyte imbalances! I was just in the hospital for 4 days before Christmas. But mine wasn't due to D&V it was do mostly to my Celiac which did give me too frequent BM's I guess. They aren't sure why all my numbers were off. I know CHEMO gals really have to watch your electrolyte imbalances. A calcium imbalance will give you numbness and timgling in your face. It is the weirdest feeling! also watch for numbness and tingle-ing/buzzing in your legs. I thought I had motors running in my calfs. My vision got blurry also. Please watch for all these signs, don't dely calling your Dr.s Sheesh, if it wasn't enogh having breast cancer this summer! I was so happy to finish my RADS last Thursday, then this electrolyte thing happened.! Why can't I say tingle ing?",
      "MessageIndex": 2,
      "PostDate": "26/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182752",
      "Title": "UPDATE after Third Chemo"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "(((Hugs))) to you Vicki, I was in shock also. I just wish I could Clt-Alt-Delete the cancer! I found out for sure on July20th the day after our 34th anniversary. I met my Oncologist Surgern on the 24th, my grandson's 11 birthday, and had my lumpectomy on the 30th of July. July was a month from hell! I knew it ws a possibility on the 6th of July, same day a motorcycle drove into my Honda Accord landing on my windshield ans spewing his chewing tobacco all over my windshild and roof! My cousin in California has been battling cancer also. She has said \"I want people to look at me and see me, not my cancer\" I wish you all the luck and hope everything goes well with your surgery.",
      "MessageIndex": 15,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173759",
      "Title": "I feel very old today...but I'm not really old"
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "I have been on Arimidex since January. The only side affect I have is some slight ankle swelling which goes down overnight. I have been taking Vitamin D3 since December, TWICE a day, plus I take Magnasium Oxide 400 mgs TWICE a day since December Plus I also take a Multi-vitamin Centrum. Also I chew two Viactive a day. I mostly need these suplements because I have Celiac Disease. Found that out in early December of last year after hernia surgery. I had a lumpectomy in July of 09. Was on RADS for 6 weeks starting 3rd week in October. Other than that, I'm doing well.",
      "MessageIndex": 12,
      "PostDate": "26/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192140",
      "Title": "Arimidex."
    },
    {
      "AuthorID": "lanie940",
      "AuthorURL": "https://csn.cancer.org/lanie940",
      "Content": "That's what I did! Restorative aide/CNA. I was only Restorative until the powers that be decided to eliminate the Restorative position. so me and my partner had to go back on the floor doing only CNA. The other girls were being a pain on the arse, I was always stuck feeding on the floor, while they always sat in the dining room feeding. I had quite enough of their crap, so me and my partner quit. I think maybe I even had the hernia or got it while doing CNA work. I haven't worked since Nov of 04. I miss it, but i surely can't go back to work now. I hate this Cancer and i get down from time to time, but guess it's normal.",
      "MessageIndex": 28,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174090",
      "Title": "I'm having a hard time..."
    }
  ]
}