{
  "AuthorID": "laverne",
  "AuthorURL": "https://csn.cancer.org/laverne",
  "Posts": [
    {
      "AuthorID": "laverne",
      "AuthorURL": "https://csn.cancer.org/laverne",
      "Content": "I have been done with radiation for almost a year now and yet I am still very tired. My breast is still very burned and sore(although it is not as sore as it was a few months ago) anyway I have been having some flu like symptoms and have been missing quite a bit of time from work. I have missed six days this month alone. My boss called me in the office on Thursday and told me that as a supervisor I am not setting a very good example and that my attendance is a problem. I immediately began to cry, it seems like the doctors' do not prepare you for the time when all the treatment is over. They don't tell you about the days when it hurts just to stand or sit or even lay down. I was so proud when I was promoted to supervisor, I felt like it was truly an accomplishment but now I have to wonder if I should just resign. I don't want to give into this disease but I don't know what else to do. I can't promise to never be absent and I have no control over how I feel. I have seen the oncologist and he says being tired is normal just try and get some rest. The radiation doctor tells me to just \"hang in there\" and my primary doctor will not even consider giving me any type of medicine to settle my nerves. Where do I turn now? I have even considered changing my primary care doctor just so I can get some type of drug to make me \"mellow\". I could really use some advice, thanks for listening. LaVerne",
      "MessageIndex": 0,
      "PostDate": "27/04/2002",
      "ThreadURL": "https://csn.cancer.org/node/137551",
      "Title": "help--need some advice"
    },
    {
      "AuthorID": "laverne",
      "AuthorURL": "https://csn.cancer.org/laverne",
      "Content": "Hi, congrats, I know how good it feels. I had my last Taxol on May 7th. I start radiation the first week in June. My doctor told me the same thing that he knew the cancer was gone and that I did not need any additional testing. I have to just trust that what he said is true and begin my journey thru radiation. God Bless and keep in touch. Love, LaVerne",
      "MessageIndex": 4,
      "PostDate": "19/05/2001",
      "ThreadURL": "https://csn.cancer.org/node/136141",
      "Title": "Good news!"
    },
    {
      "AuthorID": "laverne",
      "AuthorURL": "https://csn.cancer.org/laverne",
      "Content": "Tara, I am so glad to hear that your are feeling better. You have always been a great supporter of everybody else and I wish you all the best. Take care and keep up the fight. God Bless, LaVerne",
      "MessageIndex": 3,
      "PostDate": "02/05/2002",
      "ThreadURL": "https://csn.cancer.org/node/137607",
      "Title": "Returning to a Life I knew I would find"
    }
  ]
}