{
  "AuthorID": "live42day",
  "AuthorURL": "https://csn.cancer.org/live42day",
  "Posts": [
    {
      "AuthorID": "live42day",
      "AuthorURL": "https://csn.cancer.org/live42day",
      "Content": "It takes a while for your body to recover from chemo. My oncologist said it could take 2 years. It will be 2 yrs this March, and I still have times when I am just wiped out, but they are fewer and farther apart. As for mood swings, I found that writing my thoughts down in a journal really was therapy. When I was mad or upset, I just put my feelings in my journal and it made me feel so much better. It doesn't cost anything either. Just give yourself time to recover and don't rush it. Janet",
      "MessageIndex": 11,
      "PostDate": "10/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141772",
      "Title": "Hello I still find out especially after the Holidays that I still get tired very easy and worn out ."
    },
    {
      "AuthorID": "live42day",
      "AuthorURL": "https://csn.cancer.org/live42day",
      "Content": "Dear Rayswife, Between Oct. 2001 and March 2002, I had 4 a/c treatments followed by 4 taxol treatments. I didn't have trouble with nausea, but I started out with compazine, and my oncologist told me that if that didn't work to call him and they would order \"resue drugs\" for me. I guess what I'm saying is that if you are having some side effects, contact your oncologist and let he or she know what is going on. Compazine blurred my vision and when I complained he changed my anti nausea medicine. Your Dr. is there to help you and they have a wide variety of drugs to chose from. Good luck. It will be over quicker than you think. Janet",
      "MessageIndex": 5,
      "PostDate": "24/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141910",
      "Title": "Chemotherapy Cyttoxan & Adriamycian"
    },
    {
      "AuthorID": "live42day",
      "AuthorURL": "https://csn.cancer.org/live42day",
      "Content": "Well, here is one more reply to the hair saga. It is 19 months since my last chemo and my blonde straight hair came back in dark brown and wavy. I had always wanted to spike my hair but never had the nerve to get it cut that short. I have kept it short and get it cut every 4 weeks. It has gotten back to the original texture and is straight again, but still dark. You can go without a hat or wig pretty early if you go the spike route. And it is fun and in style. I agree, any day you have hair is not a bad hair day! Lots of luck with your new hair. Janet",
      "MessageIndex": 7,
      "PostDate": "11/12/2003",
      "ThreadURL": "https://csn.cancer.org/node/141575",
      "Title": "Hair Help..."
    },
    {
      "AuthorID": "live42day",
      "AuthorURL": "https://csn.cancer.org/live42day",
      "Content": "I went to a place where they fit you with a bra and a prosthesis. It was a good investment, and my insurance paid for most of it. If your bra fits well, it makes all the difference in the world. I have since had reconstruction, but I wore my fake boob for a year. Janet",
      "MessageIndex": 2,
      "PostDate": "19/02/2004",
      "ThreadURL": "https://csn.cancer.org/node/142239",
      "Title": "Staps!! Any suggestions?"
    },
    {
      "AuthorID": "live42day",
      "AuthorURL": "https://csn.cancer.org/live42day",
      "Content": "I had my left breast removed September 01 and started reconstructive surgery Oct. 02. I was asked at the time if I wanted an implant in the \"real\" side since I was having it lifted. I chose not to have the implant in the natural side because I did not want it to interfere with the reading of my mammograms. When I asked about it the plastic surgeon said it would make it harder to read a mammogram and I didn't want that. My mammograms weren't that helpful when I had cancer. Janet",
      "MessageIndex": 1,
      "PostDate": "27/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142882",
      "Title": "more questions on recostruction"
    }
  ]
}