{
  "AuthorID": "ludasue",
  "AuthorURL": "https://csn.cancer.org/ludasue",
  "Posts": [
    {
      "AuthorID": "ludasue",
      "AuthorURL": "https://csn.cancer.org/ludasue",
      "Content": "Hi! I am only a 4 year survivor so far. I have not had a recurrence, but I have had several scares. I feel like it is all out of my control, because it is. I try not to dwell on it, but I do find myself subconsiously always waiting for the other shoe to drop. My friends and family keep saying 'you've almost made it to 5 years'. I guess they don't understand how little that means. It is always with me that it can come back anywhere, anytime. I'm so sorry that you are having to face this again. Hang in there and remember we are all here for you. Best wishes, hugs and kisses and prayers your way, Angie",
      "MessageIndex": 4,
      "PostDate": "03/05/2002",
      "ThreadURL": "https://csn.cancer.org/node/137615",
      "Title": "It's Scary Out Here Isn't It?"
    },
    {
      "AuthorID": "ludasue",
      "AuthorURL": "https://csn.cancer.org/ludasue",
      "Content": "Hi LaVerne, Gosh can I relate to your work story. As a matter of fact, I just lost my job after 12 years of faithful duty. they say it was downsizing, but I know it was b/c of the time I have missed with the long term affects of my treatments. October will be 4 years since I completed everything. 6 months of A/C/5-FU and then 36 radiation treatments. I feel better now than I did then, BUT I am nowhere near how I felt before the treatments. The docs tell me it is b/c of the damage the chemo and radiation did to my body ... my blood counts have never been very good, I have fibrosis in my right lung, etc. I am sorry for you that your boss is so ignorant. I hope that your letter will help open his eyes. I could punch him myself for not being more compassionate. I say this b/c I sat in my boss' office at least 20 times to discuss my attendance (which was never an issue pre-cancer). And the day he let me go, as much as I thought I was dreading it, was the biggest relief of my life. I knew I NEVER had to go back there and listen to his insensitive, inconsiderate, ignorant, mean comments. I would definitely recommend you talk to your oncologist about something for your nerves. I took ativan which was great, but causes drowsiness and therefore not for everyone. It calmed me down just enough to stop worrying what they thought. Very mellow. I hope it all works out for you. I really do. If you ever want to talk, my email is ludasuesnout@yahoo.com. I hope your boss makes some changes in his attitude. Instead of coming down on you, he should be thanking God he doesn't have a clue what you have been through and are going through and what still lies ahead for you. Good luck and God bless, angie",
      "MessageIndex": 6,
      "PostDate": "29/04/2002",
      "ThreadURL": "https://csn.cancer.org/node/137551",
      "Title": "help--need some advice"
    },
    {
      "AuthorID": "ludasue",
      "AuthorURL": "https://csn.cancer.org/ludasue",
      "Content": "Hi Kelli, What's going on? What is it that you can't ... ? Let us know ... hugs, angie",
      "MessageIndex": 2,
      "PostDate": "30/04/2002",
      "ThreadURL": "https://csn.cancer.org/node/137580",
      "Title": "maniac and getting worse"
    },
    {
      "AuthorID": "ludasue",
      "AuthorURL": "https://csn.cancer.org/ludasue",
      "Content": "Hey Shirlann! Yuck on the tongue lump. Hope that all turns out good for you. It seems since the BC dx they would take an insect bite off if I let them ... lol. Best wishes your way. Let us know how it turns out. Hugs, angie",
      "MessageIndex": 4,
      "PostDate": "01/05/2002",
      "ThreadURL": "https://csn.cancer.org/node/137580",
      "Title": "maniac and getting worse"
    },
    {
      "AuthorID": "ludasue",
      "AuthorURL": "https://csn.cancer.org/ludasue",
      "Content": "Hi Emmi! Bless your heart! I have been there. I remember one time during my chemo, I was having a good week b/c I had not had a treatment for about 2 weeks ... anyway, I took my children to see a movie and ran into a co-worker. Before I knew it, they were all talking about me and saying things like 'if she feels well enough to go to the movies, she ought to be able to work'. They never could understand that going thru chemo, you have to seize any moment that you do feel good b/c those moments are so few and far between. I eventually ended up hating them all for their ignorance. It took a long time for me to get past the anger and hurt I felt. Like you, I took the cipro and amoxi, along with daily neupogen shots ... yuck!!! I just hate that you are having to deal with stupid people! They should be counting their blessing that they have NO IDEA what you are going thru instead of kicking you while you are down!!! Hang in there ... you can always talk to us sisters ... b/c we all know how you feel. You go enjoy this day, and the next, and the next ... don't even waste your precious time on simple minded idiots and there stupid opinions! God bless you ... hugs and kisses ... angie",
      "MessageIndex": 4,
      "PostDate": "08/06/2002",
      "ThreadURL": "https://csn.cancer.org/node/137916",
      "Title": "Bummer day"
    }
  ]
}