{
  "AuthorID": "Luv1pug",
  "AuthorURL": "https://csn.cancer.org/Luv1pug",
  "Posts": [{
    "AuthorID": "Luv1pug",
    "AuthorURL": "https://csn.cancer.org/Luv1pug",
    "Content": "Hi all,  My best friend recommended this site as a resource for making a huge decision in the next couple days. You guys helped her through a very rough ovarian cancer treatment. She suggested that you may help me too. This site looks great! I need to decide this weekend which treatment plan to go with as I am scheduled to begin radiation process on Tues. 3/24 unless we go the chemo route.  I have triple negative cancer with a tiny 1.7 mm tumor removed via lumpectomy along with  6 cm of DCIS. Lymph nodes were clear but then amended to \"isolated tumor cell clusters identified via immunohistochemical stains only.\" Then \"immunohistichemical study of CK7 shows a single cluster of 5-7 epithelioid cells which are CK7 positive.\" These were found when pathhologist used stain on one deep section he had a \"hunch\" about. Ironically, this staining technique is not considered part of criteria for diagnosis. According to guidelines, this staining technique is a non-guideline factor. To me, this puts a new twist on the decision making--or am I thinking incorrectly? International guidelines indicate chemo is minimally effective for trip neg under 5 mm. Thus my quandary. What is the right decision? Recommendation is radiation only, but doctor would support chemo if I was more \"comfortable\" with that treatment. (Can chemo really be comfortable?) Another doctor says all trip neg patients have chemo. Is there anyone here that has had such a tiny amount of triple negative like mine? If so, what treatment did you have? What results? Any informed advice is greatly appreciated. No one wants chemo but no one wants cancer either. What decision is right? HELP!!!  I would greatly appreciate any help and hope one day I too, can help other survivors.  Thank you in advance!",
    "MessageIndex": 0,
    "PostDate": "21/03/2015",
    "ThreadURL": "https://csn.cancer.org/node/293073",
    "Title": "Newbie! Tiny 1.7 mm triple negative w/amended lymph report needs help choosing right treatment plan"
  }]
}