{
  "AuthorID": "Madelyn80",
  "AuthorURL": "https://csn.cancer.org/Madelyn80",
  "Posts": [{
    "AuthorID": "Madelyn80",
    "AuthorURL": "https://csn.cancer.org/Madelyn80",
    "Content": "Up until today everything was 80% fine. I am in remission and I have started plans of eventually paying off our bills. I may need some sort of financial counseling in my future to have a concrete plan of attack but medically all everyone seems to be doing is adding not subtracting. I started getting a handle on what things would be like for the next few months. I had a plan for my surgery, healing, and being ready to continue my life and put this behind me. Then I find a plastic surgeon I like,today, after having a bad experience with a previous plastic surgeon, and just need to answer if I'll be having radiation. Until now no one has mentioned it, not my oncologist, not my breast surgeon, no one. One would think it won't be happening. Hmmmm..... So I call my oncologist's PA and ask her to let me know the info I need when she has a chance to talk to my medical oncologist. Then I get the call that they want to do radiation after my lumpectomy and reconstruction. Why, at the door of this huge decision, is this popping up now? Could this have been mentioned earlier so I would have all the facts...apparently not. Just to let it be known, I really don't want radiation. I am so tired of this, this is the final straw for me. I tolerated a year and a half of chemo and just when I felt like I was making progress and getting everything done for my surgery I'm adding another doctor, another appointment, more money, and another procedure to add the long list of things that have to happen to be able to push the play button on my life. I know I am preaching to the Mormon Tabernacle here! I am stuck on pause and just want to smash the remote with a hammer. It is just too much for me. I don't know if I can refuse but its an agonizing decision. No one is 100% sure they can get it all but I really don't want any radiation. I don't like being treated like I am going to just go along with every decision that is being made regarding my body. I am only one of 4 people who get to make decisions about my own body. Bollocks I say! I just want to have my surgery and go on my merry way. I don't want to have to consult two oncologists, a plastic surgeon, and a breast surgeon to make 1 decision about my life. I've grown bitter in my old age(31 this past Thursday). Grrrrr.....I know this will pass but it's still annoying! P.S. I may start writing a book. I don't know if it will ever happen, if it does a working title will be a \"A Lump and a Smile: Positive Attitudes in Curing Cancer.\" I guess I can start on it. If you are interested in reading it please let me know.",
    "MessageIndex": 0,
    "PostDate": "18/07/2011",
    "ThreadURL": "https://csn.cancer.org/node/222709",
    "Title": "Surgery, Radiation, and Frustration"
  }]
}