{
  "AuthorID": "mamolady",
  "AuthorURL": "https://csn.cancer.org/mamolady",
  "Posts": [
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Not sure if they are ok with chemo or what ever. I quit 14 years ago. I was eating carrots, rice cakes and what ever to not smoke. Finally I started eating sunflower seeds. It gives you something to do with your hands too and they are a natural anti depressant! Good luck! It is well worth it. Cindy",
      "MessageIndex": 15,
      "PostDate": "11/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231698",
      "Title": "im quitting smoking today"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I am 1/2 way through and just starting to get pink/dry. Fair skin doesn't mean you will automatically burn. I moisturize 3-4 times a day. Aloe then Aveeno. My RO just suggested hydrocortizone so I don't scratch. The time goes by quick. Good Luck! Cindy",
      "MessageIndex": 1,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220212",
      "Title": "Finally started rads today"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Jennifer, first off, I don't know that I will ever see a male ob/gyn because they don't seem to get it. Second, you should probably talk to your regular doc a little more. If she or your oncologist think it is to your advantage to have everything out, you should do it. I am for anything that will improve our odds. I had my ovary out because I am ER + and I didn't want to take tamoxifen. I did not have the uterus out because there is not that issue of CA with AI's and my uterus is fine for now. good luck, Cindy",
      "MessageIndex": 1,
      "PostDate": "27/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225293",
      "Title": "Biopsy and surgeon visit"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I have always been small. I could wear a swimsuit cut down to my belly button and not have cleavage! I figure when women have it, it may be hard to not let it show? Some women's boobs just sit higher? My daughter has trouble with some tops because of that. She is very tiny boned but she needs a larger size to accommodate her boobs. Funny though, I may have cleavage after my recon! Cindy",
      "MessageIndex": 5,
      "PostDate": "17/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/245072",
      "Title": "I look at boobs a lot more now....LOL"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "If you aren't sure about the self exam, ask your OB/Gyn. They should at least have literature. Or if there is a health education department at your clinic, they should have some thing too. Mostly, you want to look for changes. Lumps are quite obvious once you have them. I am \"lumpy\" anyway and the mass I found was completely different. It is hard to explain, but you would know if you found it. Annual clinical exams are important also so even if your health plan says 3 years for the PAP, you should have an annual clinical breast exam. Mammograms are also important. I started at 30 every other year then every year after 40. My sister was diagnosed at 30. Now they recommend 10 years prior to youngest diagnosis or 40, which ever is younger. Know your body, sounds like BC isn't the only beast in your family. If you have a concern, talk to your doctor. Cancer is a crazy beast, be proactive in your screening but do not let it control your life. \"Worrying does not empty tomorrow of it's troubles, it empties today of its strength\" Mary Engelbreit. Cindy Cindy",
      "MessageIndex": 7,
      "PostDate": "09/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229946",
      "Title": "How do you know?"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "You gave her the opportunity to have a normal life. It will be up to her to take it. We don't always see if what we did was right with kids till several years later. This may get harder before it gets better. In any case, neither Georg or his daughter deserve to live like that. Cindy",
      "MessageIndex": 13,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230357",
      "Title": "Did i do the right thing?"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Good Luck! May your tech have warm hands. Cindy",
      "MessageIndex": 2,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/226870",
      "Title": "Mammogram today!"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Glad to hear the good news!",
      "MessageIndex": 12,
      "PostDate": "23/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/226870",
      "Title": "Mammogram today!"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Susan, I can't imagine it would be easier the second time around.... It sounds like you have a wonderful network of support. Have fun with the walk. The rads will be done before you know it. All the best, Cindy",
      "MessageIndex": 4,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228179",
      "Title": "Last Week & This Week & Next Week"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I have been partial to the avon walk and susan komen also. I know a lot more people with breast cancer than any other type of cancer. I do always donate to the relay for life, I do the daffodil days in february and do tribute donations for mother's day and father's day. Since my diagnosis I will probably be more inclined to do the relay because now I know first hand how much ACS does for patients! One thing that irks me is that for October (BC Awareness month) the mammo department gets little trinkets to give the patients that month. The problem is that the things they buy do nothing for breast cancer. They just have the pink ribbon! I try and try to get them to purchase from www.thebreastcancersite.com or something where a part of the profits will go to funding something for BC but there are only a couple of us that are loudmouths about it. I wish you had to support funding for research or mammos or something in order to sport the pink ribbon! Ok, that's my two cents! Cindy",
      "MessageIndex": 5,
      "PostDate": "10/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224234",
      "Title": "Wine Whine"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I posted a pic of my survivor stamp on my expression page. I love the design that the artist came up with. Cindy",
      "MessageIndex": 0,
      "PostDate": "31/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/245867",
      "Title": "OT - phoenix tattoo"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Chemo is scary. It probably will be until you start. The unknown is worse than the is. It sounds like he will do dense dosing. I think they found that will lessen the side effects. I did 16 rounds of chemo. 4 AC and 12 taxol. AC sucked, taxol was not bad. Every one is different though. After the first couple you will get your groove and figure out your good days and not so good days. They may give you steroids and they will give you anti nausea drugs. Have the kids help keep the germs out of the house. My grand daughter knows to wash her hands when she gets home from school now. I spoke with her teachers about helping keep her away from sick kids. She didn't get sick once during chemo. Hand sanitizer should be kept every where. Chemo is easier to handle if you don't add illness to it!! The time does pass pretty quickly! All the best, Cindy",
      "MessageIndex": 3,
      "PostDate": "14/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222439",
      "Title": "My Chemo Drugs??"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "You know I didn't mention it before but you should mention to your husband that you are afraid. Kids don't need to know but your husband will help. He is probably scared too but may not want to tell you if you are being strong. There is nothing like having your husbands arms wrapped around you to make you feel like you can do anything! Cindy You'll be in my thoughts and prayers next week!",
      "MessageIndex": 21,
      "PostDate": "16/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222439",
      "Title": "My Chemo Drugs??"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "A PET scan is used to look for \"hot spots\", spots with extra uptake. This could be normal psychological function, arthritis, cancer or other stuff. PET is very non-specific, if something is found more imaging is done to get a better look. Traci mentioned on a previous post that breast masses do not show up on PET. My oncologist did not order a PET for me. She did order a CT prior to treatment to look for mets. (it was clear) Some doctors order a PET/CT so if something shows up they have a clearer picture of it right away. Some things are better imaged with MRI, some with Ultra-sound. Mammogram is still the best screening tool for Breasts for most people. If your breasts are really dense, MRI is good along with Mammo. Breast calcification's are best found with Mammo. X-ray is a good way to screen for bone mets. (much lower radiation dose than a full body CT) Oncologist all use different modalities for different reasons. My sister used to get a PET, MRI and a CT every 3-6 months after the cancer came back. Prior to that I don't think she went even once a year. All docs are different, I always ask why. Cindy",
      "MessageIndex": 2,
      "PostDate": "13/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220506",
      "Title": "Pet Scan info"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I don't think so! Give your self time to heal. Your energy will come back. I have heard that as long as it took for treatment, it will take at least that long to recover. I went back to work full time in september and I was wiped out at the end of the day for the first couple of weeks, now I can at least do other stuff besides just work. Personally, I think just raising a 6 year old is a full time job too! Take care and be good to your self! Cindy",
      "MessageIndex": 13,
      "PostDate": "06/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/224950",
      "Title": "How is TexasGirl? Anyone knows?"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I drank coffee through AC and Taxol. My oncologist said the main reason not to is to not get dehydrated. I had one normal size cup in the morning and added an extra glass of water to my required amount. (usually I have huge (12 oz) cup in the am) Still you should ask your doc because they all have different ideas about what is best. Mine was really against fresh produce that could not be peeled. It was really hard giving up lettuce for 5 months. Cindy",
      "MessageIndex": 5,
      "PostDate": "03/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/221698",
      "Title": "Is coffee okay?"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Carkris, I want that pass from dealing with other issues. How can we get that through congress! Cindy",
      "MessageIndex": 14,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220199",
      "Title": "finding things a little difficult - acupuncture update"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "No bodies troubles are any worse or easier than any one elses just different. 12 is a tough age for your daughter too. Just keep that in mind when you want to throttle her. My sister is going through similar stuff with her daughter. Fortunately my girls are 26 and 28. It will get better. (maybe 10 or so years..... :) ) Cindy",
      "MessageIndex": 1,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220199",
      "Title": "finding things a little difficult - acupuncture update"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "So glad you graduated! With honors to boot! Cindy",
      "MessageIndex": 6,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228740",
      "Title": "Just finished radiation hooray!"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "School is back in session, you may have just been sick! I know my grand daughter has a bug already. I heard it takes about a year to get back normal resistance to germs. Cindy",
      "MessageIndex": 3,
      "PostDate": "05/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/225766",
      "Title": "Flu bug?"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "What will you do? Awesome to have the free time and the good health to enjoy it. Cindy",
      "MessageIndex": 1,
      "PostDate": "26/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223189",
      "Title": "126/84"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Jayne, Having gone through this before, you are probably better at talking to docs than most of us. If you don't already, have them write down as much of the information as they can. Bringing some one is also important. Your mom/aunt or sister/brother or a friend. As far as BC, it could just mean a lumpectomy and radiation. BC can be less to manage than leukemia. As far as help, www.avonwalk.org may have resources. Susan Komen may also. I know Avon works with local groups to provide meals for women undergoing treatment. I am sure they have other resources. Church groups are also a big source of help. My daughters MOPS group always does meals for people when they have health issues. ACS probably has some other resources. You will find the strength to overcome this. All you have to do is look at your daughter. Come here any time you need to. You will find encouragement, hugs and prayers in abundance. Cindy",
      "MessageIndex": 6,
      "PostDate": "10/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222165",
      "Title": "Leukemia now breast cancer"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "It takes longer to find parking than to see the doc sometimes! Cindy",
      "MessageIndex": 24,
      "PostDate": "28/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223189",
      "Title": "126/84"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "When I was going through the chemo I wondered if I would ever feel good again. It all seemed so daunting at the time. After a year and a half, it is nice to feel more like me. Don't worry about the house, let some one else. If people visit, let them worry about food if need be. Your focus is to kick cancers butt! Cindy",
      "MessageIndex": 10,
      "PostDate": "14/06/2012",
      "ThreadURL": "https://csn.cancer.org/node/241635",
      "Title": "3rd chemo on Friday...this is getting harder to do!"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Betsy, My eyes were worse during treatment. I have always had glasses but I did notice they were getting worse about halfway through chemo. I got new glasses after rads and my eyes were back to normal. You should make sure it is something that doesn't require immediate attention but keep in mind it may just be a result of the assault on your body (chemo) and could resolve completely once your body starts to recover. Cindy",
      "MessageIndex": 13,
      "PostDate": "04/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231638",
      "Title": "Vision: Has anyone had their vision deteriorate?"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I know it is very frustrating for you, but this made me laugh! I wish I lived somewhere like London or New York so I didn't need a car because they are money pits. Not to mention a never ending source of frustration! Mostly because I am the one who has to deal with repairs even though I am married and it should be the man's job to take care of that stuff....... Good luck with the car, Cindy",
      "MessageIndex": 3,
      "PostDate": "16/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224571",
      "Title": "OT - ever just want to kick your car?!! :)"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Eva, The hot flashes probably are from chemo induced menopause symptoms. My sister was 30 when she had chemo and her periods went back to her normal but weird cycle after chemo. Since you froze embryo's, you are covered either way. The odds though are in your favor to get back to what ever is normal after BC. Cindy",
      "MessageIndex": 1,
      "PostDate": "08/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222061",
      "Title": "Am I in menopause? 29 years old on Cytoxan."
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Minka, Check out what you reach for in the house. In the kitchen, the bathroom, where every you may need to raise your arms. Move what ever you will need daily to a spot lower than your shoulder. You probably will not be able to raise your arms/arm for a bit. I had bilateral mastectomy and forgot a couple of things... Good thing my husband was home at the time. The surgery isn't bad. I didn't realize the itchy feeling I had was from the surgery. I thought it may have been residual chemo stuff. Use soft cotton sheets and soft cotton shirts after surgery and extra pillows. I didn't have much pain, the incisions will probably be numb for a bit. Chemo is also doable. Check out the ACS website for suggestions on what to eat and such. Stay away from sick people and carry hand sanitizer! It is not selfish to want your family close. My daughter flew from colorado to california once a month during chemo and stayed a week after surgery. It helped me keep my sanity. All the best, Cindy",
      "MessageIndex": 4,
      "PostDate": "17/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222640",
      "Title": "Two cancers in one breast.....overwhelmed and scared."
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Glad to hear the CT was normal! Cindy",
      "MessageIndex": 9,
      "PostDate": "15/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228328",
      "Title": "Forks down"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Sue is right, coming to the end of treatment is tough for a lot of people because fighting is doing something about it. Now is the unknown. Add to that sleep deprivation, other stress and normal life stuff no wonder you are having trouble. I personally have been seeing a councilor through out treatment. Try that and something to help you sleep and then the other stuff should become more manageable. Cindy PS - the effects of everything is accumulative, that may be why it is all hitting you now. I know I am still tired and rads ended on june 29th!",
      "MessageIndex": 3,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224168",
      "Title": "Having a really hard time..."
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "It is impossible to pick just one! I just love color. The mustard color on my living room walls is so warm and cozy, the purple and gold and green on my comforter is so rich, my rose garden is an explosion of red, gold, pink, lavender, rust, purple and yellow. I have quilts and afghans of all different colors, I have just about every color covered in my scrub tops. I will say though, I am partial to pink and I was even before diagnosis. Cindy",
      "MessageIndex": 16,
      "PostDate": "28/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/231219",
      "Title": "I thought it would be great to see what your favorite color is, so, what is your favorite color?"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Debi, can you pick up the Captain America Cake at Baskin Robbins? That or the Oreo Cookie cake. I can bring the chocolate chip cookies. It is not to hot to bake here...... Cindy",
      "MessageIndex": 7,
      "PostDate": "31/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223475",
      "Title": "Gas up the bus, girls!"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I knew I would start either tamoxifen or arimidex. The article is great though. Cindy",
      "MessageIndex": 2,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223348",
      "Title": "For those on the fence about tamoxifen and ER+....please read"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Thank you all for the Birthday wishes! I will be packing for my annual Colorado trip. (well I go more than once a year but I always go for my birthday) No better way to celebrate than to see my grand kids! I actually will be attending a t-ball game! Thanks again, Cindy",
      "MessageIndex": 7,
      "PostDate": "25/07/2012",
      "ThreadURL": "https://csn.cancer.org/node/243823",
      "Title": "Today is MamoLady's Birthday!"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "My mother died at 49, since then, I have tried to not wait to do things. There are still things on my list and I will get to them. Cindy",
      "MessageIndex": 2,
      "PostDate": "18/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/245144",
      "Title": "A bucket list...."
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I don't remember that being a side effect, I am curious to know if it is. I stopped breaking out during chemo and was surprised to have a little acne after my ovary was taken out. I thought it was related to my period which I haven't had since October. Cindy",
      "MessageIndex": 1,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224095",
      "Title": "Acne"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Surgery and radiation will cause scar tissue. I don't know if it would be sudden on set, but it has not been that long since radiation. Good to see the doc though. Probably normal, but always good to check it out. Cindy",
      "MessageIndex": 2,
      "PostDate": "04/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/221822",
      "Title": "Sudden swelling and pain in the breast"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "If you decide to have radiation, it would be to your advantage to have the reconstruction after. The rads may change the appearance of the breast. All the best, Cindy",
      "MessageIndex": 4,
      "PostDate": "19/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222709",
      "Title": "Surgery, Radiation, and Frustration"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "I am more a furry pet person but I know alot of people that prefer furless. I didn't know they could be trained so well. 12 sounds like a long life for a big animal. I learned 2 things today! Cindy",
      "MessageIndex": 2,
      "PostDate": "29/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223383",
      "Title": "OT Iguana Story"
    },
    {
      "AuthorID": "mamolady",
      "AuthorURL": "https://csn.cancer.org/mamolady",
      "Content": "Bilateral Mastectomy. I did not have recon yet. I still don't know if I want to or not. It is way more comfortable with out. I don't even bother with the prosthetic at all. At work I wear scrubs so it isn't that big of deal. My daughter went shopping with me to find clothes that look fine with out boobs. Most people don't even notice. I just work with one person that seems to think I should get the recon........ Once I loose the chemo weight I will decide if I want to bother with the recon. Cindy",
      "MessageIndex": 24,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229501",
      "Title": "Would love support and words of encouragement....."
    }
  ]
}