{
  "AuthorID": "Margeaux",
  "AuthorURL": "https://csn.cancer.org/Margeaux",
  "Posts": [
    {
      "AuthorID": "Margeaux",
      "AuthorURL": "https://csn.cancer.org/Margeaux",
      "Content": "I got a bad case of neuropathy from Taxotere and was finally put on Gabapentin. I, too noticed an increase in the pain, stabbing, shooting burning pains all the way up my leg and my hands. I read an article in one of the cancer magazines saying that this is due to nerves firing on all cylinders as they are trying to heal. Of course, it was in a scientifically correct language, but this is the way I remember it. The stabbing, burning and shooting pains eventually subsided, although, unfortunately, I still do have neuropathy in both hands and feet. It may take a 1 year or more for symptoms to disappear and for most they will be gone by the end of that time. Good luck to you and hang in there. Hugs, M.",
      "MessageIndex": 4,
      "PostDate": "06/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/239829",
      "Title": "I suddenly had an increase in neuropathy"
    },
    {
      "AuthorID": "Margeaux",
      "AuthorURL": "https://csn.cancer.org/Margeaux",
      "Content": "I have a secondary email address I use to order stuff, use it rarely, a few things here and there from Amazon.  This email is overrun by junk mail, lengthy crap from Nigeria, one kind lady who is suffering from cancer (???) is leaving me $12 mio., the usual high government official or two who need to move money out of the country, people stranded in London who need to transfer money, name it and I get it.  Lots of offers from a Canadian Pharmacy, like Viagra, no way to unsubscribe on that website.  In the last months also kinky sex offers, sexy ladies, and, oh yes, enlarge my manhood by Big Willie.  If I wouldn't spend so much time with playing Solitair I'd have shut that email address down by now. Margeaux",
      "MessageIndex": 19,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254871",
      "Title": "$ $ $ $ I Won The Lottery $ $ $ $"
    },
    {
      "AuthorID": "Margeaux",
      "AuthorURL": "https://csn.cancer.org/Margeaux",
      "Content": "Hi Pinks: How is this for a laugh - now I am getting messages about Facebook, here is one: Hi sexy - just saw your picture on Facebook, can we chat?  Signed - imyourdirtygirl, online & horny!  Considering I am not on facebook and a nearly 80 year old broad, it's kind of funny.  Hopefully it will stop one of these days.  Very much suspect Amazon, they are the only ones I purchases stuff from and after that it started.  Margeaux  ",
      "MessageIndex": 24,
      "PostDate": "09/03/2013",
      "ThreadURL": "https://csn.cancer.org/node/254871",
      "Title": "$ $ $ $ I Won The Lottery $ $ $ $"
    },
    {
      "AuthorID": "Margeaux",
      "AuthorURL": "https://csn.cancer.org/Margeaux",
      "Content": "Hi: I was diagnosed Sept. 2009 at age 76 with Stage IIB, HER Pos, ER/PR neg. 2 lymph nodes involved. 2 lumps - 3.5cm, one .9 cm, both in left breast. The treatment protocol was - 6 months chemo, then mastectomy and lymph node removal, followed by radiation. Chemo was unavoidable because of the lymph node involvement. Half way through chemo a mammogram and ultrasound could not find either lumps, chemo shrunk them to practically invisibility. At that stage doctor decided a lumpectomy could be performed. Frankly, I did not believe the oncologist, thought he is just telling me this to keep me going through another 3 months of chemo! I had to give the surgeon permission, though, he could perform a mastectomy, if necessary. I had a lumpectomy May 2010 (actually more like a partial mastectomy) and 18 lymph nodes removed. No cancer was found!!!!!!!!!!!!!!! Because I was HER Pos. I had to complete 1 year of Herceptin. As my old radiologist said - sofar-i, so goody-i. All the best to you Margeaux",
      "MessageIndex": 2,
      "PostDate": "01/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/249187",
      "Title": "Stage 2A"
    },
    {
      "AuthorID": "Margeaux",
      "AuthorURL": "https://csn.cancer.org/Margeaux",
      "Content": "  Had another 6 month visit to the oncologist.  No blood tests, no PET scan, just a thorough exam.  He is very pleased, with me and with himself for having gotten me through it.  Next appointment in March, after my annual mammogram.  I asked him about from what date does one start counting,  but apparently even oncologists can't decide - some count from the day of the first treatment, some from the end of treatment.  For me chemo started at the beginning of Nov. 2009, and ended with Herceptin mid Nov. 2010, a long, hard journey.  Looking back I can hardly believe I made it through, but I made it....whoopee!  He paid me quite a compliment, I am 80 now, he thought I look no older than 68 at the most, well, he is the best oncologist ever! Margeaux",
      "MessageIndex": 0,
      "PostDate": "12/09/2013",
      "ThreadURL": "https://csn.cancer.org/node/262772",
      "Title": "Good visit to the oncologists"
    },
    {
      "AuthorID": "Margeaux",
      "AuthorURL": "https://csn.cancer.org/Margeaux",
      "Content": "Yes, I do think you need to mention this pain to the docs. I have had a lumpectomy and lymph node removal May 2010. The breast is still tender, quite hard and sometimes, depending on how I move, the whole breast cramps painfully. On top of it I have chronic pain from lymph node removal (trauma to the nerves) and I am on Lyrica to keep the pain at a manageable level. Like you I fear every mammogram, I have had 2 so far. My last one was the new 3D in addition to the regular 2D, it is all done by the same machine at the same time and doesn't seem to last any longer than regular mammogram. The good tech squeezed the daylights out of me, also had me twist around to get under the axilla. It was painful and my owwww didn't keep her from giving it another twist, but, we are big girls and have been through so much more, that's what I kept telling myself! I also took a couple of Tylenol 1 hr. before. Hang in there! Margeaux",
      "MessageIndex": 1,
      "PostDate": "15/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237313",
      "Title": "continued tenderness after surgery"
    },
    {
      "AuthorID": "Margeaux",
      "AuthorURL": "https://csn.cancer.org/Margeaux",
      "Content": "Husband, who is 84, complains about our sex life, not enough, good grief! A little chuckle for you all - years ago I worked at a woman's health club around the corner. I saw one of the regulars sitting gingerly on a bench and wanted to know if she was ok - no, she told me, it hurts, pointing \"down below\" . Apparently she and her husband decided to spice up their love life and used a menthol type ointment (can't remember who used it), it started to burn mightily, no amount of rinsing helped and she spent the rest of the night legs spread apart fanning her nether regions. Love life went out the window, not only for that night but a whole bunch of nights! M.",
      "MessageIndex": 14,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237801",
      "Title": "I need info on sex!!!!!!!!!!!!!!!!!!"
    }
  ]
}