{
  "AuthorID": "mariam_11_09",
  "AuthorURL": "https://csn.cancer.org/mariam_11_09",
  "Posts": [
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I had a year and a half of no menstrual cycle and then I had my period on the 1st July and nothing since. I am 45 years old. This could actually be it for me or maybe not. However I spoke with two different gynecologists. One a male doctor, who told me I would never have a menstrual cycle again and the other a woment who told me that she has had patients who have started their menstrual cycle 4 years after they completed chemo and others that never did start up again. She did say the older you are or the closer you are to menapause the less likely it will start up again but then there are always exceptions. Everyone is different. FYI: I am not on tamoxifen and was on Herceptin for over a year.",
      "MessageIndex": 2,
      "PostDate": "10/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228103",
      "Title": "My period came back???"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Most certainly you have our support, well wishes, good thoughts and prayers. take care and good luck with the surgery.",
      "MessageIndex": 36,
      "PostDate": "01/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/186483",
      "Title": "surgery next wednesday"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "You are not your breasts! In fact you are much more than your physical body. The anxiety is for something that you don't even know yet. You don't know how you might react and you might just be alright about your appearance after surgery. Just deal with today and then deal with whatever you reaction is when you see yourself after surgery at that time. I wish you well.",
      "MessageIndex": 14,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203151",
      "Title": "Mastectomy is my only option"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Susan, you are right on about the gratitude. It is something that too sets me straight and humbles me. During treatment I was often told I had such a 'positive' attitude. One morning while wondering what that meant, I heard someone on the radio talking about 'positive' attitude as being grateful for what one has and not focusing on what one does not have. For me, it is exactly that! Best wishes for you treatment and much love to you.",
      "MessageIndex": 10,
      "PostDate": "13/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228179",
      "Title": "Last Week & This Week & Next Week"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I got the same information from my Onc. He told me to have the flu shot before chemo, if I was going to have one. He said it was too risky to have it while on chemo in case I have a reaction to it. I chose not to have one and won't have one this fall either. I have never had flu shots. I rarely get flu, if ever. Okay after saying that lets hope I don't get it. I second Suzaane, ask your Onc. just to make sure.",
      "MessageIndex": 2,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200006",
      "Title": "To flu or not to flu"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Sorry you are feeling this way. I had DIEP flap reconstruction immediately after my mastectomy on my left breast. It was a heavy duty surgery and even though I knew it was big there was nothing that prepared me for what I went through, not even the c-section. I couldn't stand up straight fully until at least 5 weeks after surgery, now 8 weeks it feels fine, sometimes a little tight on my stomach. I am still dealing with a part of the incision on my stomach being open and healing in a funky way. I see the plastic surgeon tomorrow. My breast has developed some hard skin below it, a ridge above it and of course has no nipple so is flat compared with my other. I have been told all will be corrected in the final surgery which won't happen until towards the end of the year. So I have one droopie and one perky breast with a ridge above it. Not to mention the port on the other side. The scars I have been putting Justine oil on them (from South Africa) but Vit. E oil is also good. It really has helped my scars and I just like the way they are healing on my breast and around my belly button. Really, give yourself time, allow yourself to take care, sleep plenty, get plenty of rest, eat well and hopefully have other people do as much as possible for you. All of this helped with the attitude. But you know what, if you feel crappy, you feel crappy you don't have to have a happy face all the time. If you can keep things in persepective that is also great, like right now you feel a great deal of pain and in time this will pass. However I can't stress rest enough. I am just extremely grateful that I have a breast and am not disfigured or with an implant AND most importantly am still alive. And life is never the same after a cancer diagnosis!",
      "MessageIndex": 1,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186665",
      "Title": "Any words of advice"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I hear you.  I have to answer that question every year because I our health insurance changes every year and the new plan requires you to fill in a questionaire about your health.     I typically say 'good' because really it is not bad and I feel ok.   It is such a difficult question but I was talking with a coworker who misses a lot of work because she is ill (asthma, allergies, bronchitis etc) and she rates herself as good!!!   So really I don't know.  ",
      "MessageIndex": 3,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://csn.cancer.org/node/252918",
      "Title": "How Does Someone with Cancer Rate Oneself as to General Health"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "For what it is worth, I thought I would share in a seperate post. It appears that milk thistle can help protect the liver during chemotherapy. I found the paper that was written on the study that was done with children with leukemia, that is those who took milk thistle were able to tolerate higher doses of chemo than the placebo group however the difference was not that significant. My Oncologist okayed the use of milk thistle during chemo. The reason I wanted to use it, is because I have had hep. C for the last 40 years and was concerned about liver function. I have had elevated liver enzymes but only marginal and then they fall again very quickly seemingly when I increase the dose of milk thistle (sylmarin). I don't know if this is because of the use of milk thistle or if I would have been this way anyway. However I thought it might be useful to share with you on this board but whatever you choose to do remember to always okay it with your doctor first. Human/Clinical Studies http://www.cancer.gov/cancertopics/pdq/cam/milkthistle/HealthProfessional/page6 Two published case reports describe the use of milk thistle as either a treatment or an adjunctive therapy in individuals with cancer. One case report describes the use of milk thistle in a 34-year-old woman with promyelocytic leukemia.[1] The investigators administered 800 mg of silymarin during the patient’s maintenance therapy, which consisted of treatment with methotrexate and 6-mercaptopurine. During the 4 months of treatment with silymarin, the patient who previously required intermittent breaks in therapy due to abnormal liver enzyme levels had normal liver enzyme levels with no further interruption of therapy. A second case report describes a 52-year-old man with hepatocellular carcinoma.[2] The patient began taking 450 mg of silymarin per day, and spontaneous regression of the tumor was reported in the absence of initiation of anticancer therapy. In a double-blind, placebo-controlled trial, 50 children who were undergoing treatment for acute lymphoblastic leukemia and who had chemotherapy -related hepatotoxicity were randomly assigned to receive silymarin or placebo for a 4-week period.[3] Four weeks following completion of the intervention, the silymarin group had a significantly lower aspartate aminotransferase (AST) (P = .05) and a trend towards a significantly lower alanine aminotransferase (ALT) (P = .07). Fewer chemotherapy dose reductions were observed in the silymarin group compared to the placebo group; however, the difference was not significant. No adverse events were reported. Another URL. http://www.cancer.org/Treatment/TreatmentsandSideEffects/ComplementaryandAlternativeMedicine/HerbsVitaminsandMinerals/milk-thistle",
      "MessageIndex": 0,
      "PostDate": "05/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198013",
      "Title": "milk thistle and liver function during chemo"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I posted a couple of photos on my expressions page http://csn.cancer.org/user/111056/view/expressions I think that might work. Of all the photos my daughter took, which were many, we either had goofy expressions on our faces, or they were out of focus, or our eyes were closed ...... so this is the best I could do without spending hours in photoshop.",
      "MessageIndex": 0,
      "PostDate": "21/06/2012",
      "ThreadURL": "https://csn.cancer.org/node/242101",
      "Title": "Now for the photos"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I am sorry to hear that the AC has been difficult for you. I am can really empathize. I ended up being super sensitive to the AC treatments and had eosophagitus, mucositosis along with a range of GI problems amoungst other things ......some of which have not gone away. I did have sores in the inside of lips and sometimes on my lips. I also had a strange sensation in my lips, a kind of weird tingling which I am not sure is the same as the vibration in your lips. Do tell you Oncologist about it. It might not seem like much but then you don't really know. Hang in there and take care, get plenty of rest, your AC treatments will be over soon enough.",
      "MessageIndex": 1,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195903",
      "Title": "lips vibrating?"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I am so sorry to hear that they found it in your spinal fluid. It is a scary place to be. However it must be after all those test a relief to fine know where it is and now move forward with treatment. I wish I could offer some advice but I haven't been there and can only learn from you all. I wish you all the best in your treatment.",
      "MessageIndex": 2,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210344",
      "Title": "it's back again....... in my spinal fluid"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Anybody got an ideas of how I can get water into my body? I have tried drinking with a straw but even that is not easy. This is a week after chemo and my throat is raw. I have a hard time swallowing, that is when food or water enters my stomach, I have a great deal of pain that appears to be gas and acid related. The oncologist gave me an acid blocker and some anti-acid/anti-gas, while this helps with the actual acid reflux it is not helping with the gas in my stomach, which is painful or the sore throat which according to the Onc. is not infected, just raw. I am not getting enough water into my body and now am having headaches, nausea and am getting a boil on my bum and in addition my port incision (which was almost healed) is now looking a little red and angry. And I just couldn't sleep. I guess one day at a time. Will call the Oncologist today to see what he has to say.",
      "MessageIndex": 0,
      "PostDate": "05/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187419",
      "Title": "need suggestions on how to get water into my body"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "  Am thinking of Chenheart and sending her plenty of love.  She is in my prayers.",
      "MessageIndex": 41,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "  Am thinking of Chenheart and sending her plenty of love.  She is in my prayers.",
      "MessageIndex": 88,
      "PostDate": "26/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I was 43 years when diagnosed on 11/09/09",
      "MessageIndex": 48,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I was 43 years when diagnosed on 11/09/09",
      "MessageIndex": 98,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "April 14th. I will be 44 years old. It will be different, I probably won't have any hair by then. It is amazing how having cancer really changes your life. I looove chocolate! cake, ice-cream whatever chocolate!!",
      "MessageIndex": 18,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "April 14th. I will be 44 years old. It will be different, I probably won't have any hair by then. It is amazing how having cancer really changes your life. I looove chocolate! cake, ice-cream whatever chocolate!!",
      "MessageIndex": 68,
      "PostDate": "30/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I was 43 years when diagnosed on 11/09/09",
      "MessageIndex": 148,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Since my cancer journery began I have always said that parenting (at least parenting my daughter) is way more challenging than dealing with cancer. That said, she is almost 12 years old and can't understand the consequence of bad grades, that is summer school for 4 weeks, 4 hours a day so life has descended into chaos and we are living in war zone andI am emotionally fatigued. In addition, I had my Herceptin treatment suspended in Feb. due to the significant drop in heart function although it is still within normal limits. I was meant to be done with Herceptin last Friday however I resumed treatment on Friday but have to have a MUGA scan in a couple of weeks so see if it has affected my heart again. The Onc. feels that 8 months of Herceptin might be enough for me as he doesn't want there to be permanent damage (bless his heart for his concern and caring). Fortunately I got over my attachment to completing the Herceptin treatment. So whatever happens happens. Just had an ultrasound on my uterus and ovaries. I have a very large fibroid that I have not noticed over the last year since my menstrual cycle stopped during chemo. Now it is protuding like I am 5 months pregnant. My Onc. referred me to the gynae who sent me for the ultrasound. I heard the tech. and the intern say I had fluid on the lining of the uterus as well as a cyst on my ovaries (that I kind of figured out because of the pain and discomfort). I thought the bloating was possibly my body trying to resume a menstrual cycle, maybe not. I will find out tomorrow when I visit the gynae. I am not overly enthralled by him and his very abrupt and dismissive manner however I will give him another chance before moving on and seeing someone else. Yeah, I know this is all kind of routine, daughter woes, heart affected by Hercptin but still within normal limits and the usual 'women' stuff in the lower half of the abdomen however I am feeling a little down and poopy and in need to just get this off my chest with a group of women who knows how all this goes. And I apologise to the women who have it way worse, I know this all might seem a little trifle. thanks for reading this.",
      "MessageIndex": 0,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220199",
      "Title": "finding things a little difficult - acupuncture update"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Hi Gloria, yes I leave it in for usually up to 2 hours. It really depends on the color of your original hair and what you want the end result to be. It is not as convenient as chemicals but by far significantly less harmful. I get it from Whole Foods. It comes in a box and there are several different shades. The black henna is usually indigio which is also comes from a plant but different one from henna. The one I get has a picture of different animals on the front. are kind of square box. If you live near a whole foods and they don't have natural hair dyes then you can ask them to order for you. It costs me about $6 - $7 for the box and I get two dyes out of it with medium length hair. It comes with plastic gloves, a plastic cap and instructions. You want to keep the henna as moist as possible when it is on your head but no big deal if it does dry out a little. If you live close to an Indian store then you can try them and probably get a bag of henna for a couple of dollars but be careful of the quality and make sure they have not added anything else. Sorry I don't have a box at home right now so I can't give you the brand.",
      "MessageIndex": 5,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183834",
      "Title": "Dying Hair with Henna."
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "henna is a plant that is used to dye hair. It usually results in shades ranging from dark red, to light red to orange depending on original hair colour and length of time it remains on the head. It is also used to condition the hair. The colour is meant to wash out over time however in my case because my hair is very porous it never does. In some cultures in North and West Africa, middle east and India it is used as a temporary tattos on women usually for marriages and special occaisions. Typically, the plant is dried out and pounded into a powder, the finer the powder the more expensive it is although for hair dying you don't want a fine powder as it is hard to wash it out. It is not something that has been readily available in the West until recently so really, I don't think it is a dumb question but rather good that you asked.",
      "MessageIndex": 8,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183834",
      "Title": "Dying Hair with Henna."
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I have been dying my hair with henna for years. I have dark brown hair with streaks of gray and parts bleached by the sun. The henna adds a richnes and depth, the dark brown becomes a dark auborn and the gray and bleached parts a light auborn. It also conditions your hair. I have always bought it at whole foods or an Indian store. It is very easy to do at home. Just mix the henna powder with water and let it sit for an hour or two. Then put it on your hair for 1 - 3 hrs after wash it out. If you hair is short this should be very easy. I have had mid length hair and I do it myself all the time although the shower ends up a mess. Do becareful for two reasons: 1.If you hair is light then don't leave it in too long as it can come out a bright orange. 2.Not all products touted as henna are actually henna and some have other chemicals in them in addition to henna. good luck and have fun. I always have people comment on the colour of my hair.",
      "MessageIndex": 3,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183834",
      "Title": "Dying Hair with Henna."
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I was told if I had a lumpectomy I would need radiation and if I had a mastectomy I wouldn't need rads at all. I had a mastectomy but because I had 4 positive lymph nodes (one with a mass) I now need radiation. So it really all depends on each person's situation. If you are having radiation before surgery it might be to continue to shrink the tumour. I know for some other cancers they do this but am not sure for breast cancer. wish you well.",
      "MessageIndex": 5,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198271",
      "Title": "Why am I being told I need Radiation if I haven;t even had surgery yet?"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Personally I would get your fiancee to Germany. I live between the US and Niger (also lived in Burkina Faso and know many of the neighbouring countries). Personally I would not want to have my cancer treated over there, no offense but there is world of a difference between health care in Africa and the US and Europe. I have experienced both and watched loved ones in both. It is correct that some of the best cancer treatment occurs in the US but you might not have that option and I am sure Germany comes in close behind and way above Nigeria. Are you a German citizen? If so marry her right away or see if there is a way you can get her insured in Germany and over there. If you can search for some organizations that might help woman from Africa get treatment or help fund their treatment in Europe or the US. I wish you and your fiancee well.",
      "MessageIndex": 3,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184057",
      "Title": "My fiancee was confirmed to have BC"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I hope you are all doing alright out there. Here in northern California we have been having plenty of rain which we need and pales in comparison with a snow storm. take care!",
      "MessageIndex": 2,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185728",
      "Title": "SOCKED WITH SNOW......IN PHILADELPHIA"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "I hope you are all doing alright out there. Here in northern California we have been having plenty of rain which we need and pales in comparison with a snow storm. take care!",
      "MessageIndex": 1,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185728",
      "Title": "SOCKED WITH SNOW......IN PHILADELPHIA"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "try the Cancer Society of South Africa. They do have great medical facilities. I also lived there and still have family over there.",
      "MessageIndex": 4,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184057",
      "Title": "My fiancee was confirmed to have BC"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Interest that you post this. I was poking around on the internet over the weekend researching inflammation because I know have so much of it since I had chemo and came across similar articles that describe the link between cancer and inflammation. In hindsight I realised that I had been suffering from some low level inflammation for a few years before I got a cancer diagnosis. The symptoms I had then are much more mild than I have now. I do typically eat the foods listed in the anti-inflammatory list so I am not sure what else I can do for my current condition. It might just be a matter of time before my body calms down. Thanks for posting the links.",
      "MessageIndex": 8,
      "PostDate": "31/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/219505",
      "Title": "Cancer Cells Accelerate Aging, Inflammation--new research"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Just when one needs the sleep the most in order to heal it seems to elude one. It was worse for me while I was on the AC and now I have to deal with the hot flashes at night that wake me up. I do nap each afternoon, make a point of it, even if it is just 10 - 15 minutes. Also excercise seems to help me sleep a little better.",
      "MessageIndex": 6,
      "PostDate": "12/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196302",
      "Title": "Sleep?"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "decadron = dexamethsaone I posted this list of possible side affects about a week go. Here it is again. I personally got a great deal of energy out of the decadron and took quite a large dose for while until my doctor told me to cut back. I did have weight gain, upset stomach, trouble sleeping, water retention, low potassium levels, sweating .... and I am sure more. It is not that bad and the doctor should closely monitor you. Good luck. http://www.cancer.org/Treatment/TreatmentsandSideEffects/GuidetoCancerDrugs/dexamethasone Common increased appetite trouble sleeping upset stomach excess fluid or swelling in the face, hands, or feet* weight gain slowed wound healing* increased blood glucose levels* Less common headache feeling dizzy mood swings (shifts between euphoria, anxiety, depression, and others) low blood potassium level* muscle weakness high blood pressure feeling restless skin rash nausea/vomiting hot flashes menstrual changes sweating bone or muscle pain increased risk of infection due to suppressed immune system* fewer and milder symptoms of infection* skin thinning or bruising easily (with long-term use) cataracts (with long-term use) glaucoma (with long-term use) thinning of bones (osteoporosis) (with long-term use) Rare bleeding or ulcers in the digestive tract* vision changes confusion or losing touch with reality change in heart rhythm congestive heart failure (can cause shortness of breath or swelling in hands or feet) acne (with long-term use) thinning hair (with long-term use) bone fractures (with long-term use) allergic reaction, with symptoms like trouble breathing or swelling of the face, lips, tongue, or throat after injections of the drug",
      "MessageIndex": 11,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198341",
      "Title": "Decadron"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Hi there, I don't know a whole lot but I did have something similar. I had a lump and clusters of calcifications. I had the lump and the biggest cluster biopsied. Apparently not all calcification is DCIS but often a cluster indicates that there is DCIS (Ductal carcinoma in Situ - non-invasive cancer). For me, the calcification cluster was DCIS and the lump was invasive. of course you don't want to have cancer however DCIS is non-invasive and chances of recovery are very high. best wishes",
      "MessageIndex": 1,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185866",
      "Title": "Cluster Calcifications"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Hi there, I don't know a whole lot but I did have something similar. I had a lump and clusters of calcifications. I had the lump and the biggest cluster biopsied. Apparently not all calcification is DCIS but often a cluster indicates that there is DCIS (Ductal carcinoma in Situ - non-invasive cancer). For me, the calcification cluster was DCIS and the lump was invasive. of course you don't want to have cancer however DCIS is non-invasive and chances of recovery are very high. best wishes",
      "MessageIndex": 3,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185866",
      "Title": "Cluster Calcifications"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Great to hear you survived the surgery and are doing well. One thing you knock of the list of many things you need to do for the cancer treatment process. Will be thinking of you in your recovery and sending you much love.",
      "MessageIndex": 9,
      "PostDate": "04/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229802",
      "Title": "I'm home surgery done"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Hi there, I don't know a whole lot but I did have something similar. I had a lump and clusters of calcifications. I had the lump and the biggest cluster biopsied. Apparently not all calcification is DCIS but often a cluster indicates that there is DCIS (Ductal carcinoma in Situ - non-invasive cancer). For me, the calcification cluster was DCIS and the lump was invasive. of course you don't want to have cancer however DCIS is non-invasive and chances of recovery are very high. best wishes",
      "MessageIndex": 2,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185866",
      "Title": "Cluster Calcifications"
    },
    {
      "AuthorID": "mariam_11_09",
      "AuthorURL": "https://csn.cancer.org/mariam_11_09",
      "Content": "Sorry to hear you are having horrible headaches. That can't be fun. Are you able to locate where on your head you have a headache and describe it a little? I do know when one has a headache right on top of ones head it is a liver headache. I sometimes suffer from these and my body feel poisoned which is really the liver trying to detox and I also get nauseau. However if it is not it might still be good to narrow down where the headache is. take care",
      "MessageIndex": 1,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183934",
      "Title": "Stage 4 chemo side effects"
    }
  ]
}