{
  "AuthorID": "Marsha Mulvey",
  "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
  "Posts": [
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "It's strange how quickly time can fly or go by at a snail's pace. You probably felt that way for this past year too. Anyway, congratulations on this milestone. Marsha",
      "MessageIndex": 2,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214130",
      "Title": "3/15..."
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Ditto to what VickiSam just wrote. Hoping for great results! Marsha",
      "MessageIndex": 11,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/226870",
      "Title": "Mammogram today!"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "I imagine your head is spinning with the speed at which this is moving forward. Just hang on tight because in this case, it's good to move quickly. Sending you best wishes. Marsha",
      "MessageIndex": 43,
      "PostDate": "31/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225100",
      "Title": "Monday's Biopsy Results"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "I love it. AND you can quote me on that! MM",
      "MessageIndex": 1,
      "PostDate": "21/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199077",
      "Title": "A quote I thought I would share"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Happy Birthday!",
      "MessageIndex": 14,
      "PostDate": "26/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214958",
      "Title": "Today is jessiesmom1's Birthday!"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "I'm still fighting, but it's getting harder. My last scan showed just what we expected - the two largest tumors in the liver have now come together with several of the smaller ones to make them very large. The side effects with Halaven have been difficult too. My abdomen is distended from the chemo and the enlargement of the liver so I am uncomfortable all the time. A couple of weeks ago they did an ultra sound of the abdomen - thinking it was filling up with fluid but none was found. This is not pain, but constant discomfort. Sleep is difficult because you are never comfortable, no matter what position you try to lay. The supraclavical lymph nodes are all swollen again and this is the first time for this since we were able to shrink them down about three months into the fight. Here's the good news: As many of you know, my cancer was too extensive when it was first found to warrant any surgery. So, the tumors in my breast have been an indicator as to what's going on. I can tell you for sure that those tumors have been shrinking while on Halaven. Usually that tells us what's going on with all of the cancer. This time though, I'm not sure because I'm not getting any relief in the abdomen. It seems like the distention in the abdomen would be getting better if the liver were shrinking too. It will be several more weeks before another scan in order to know for sure. I've continued to work but now take about an hour and a half to two hours for lunch. I drive home, grab a bite to eat and stretch out for a while. It's difficult to sit for a long time without a break. I'm very fortunate to work where everyone is so understanding. We're currently starting to train someone part-time who will eventually take my place. This is something that needs to be done, so I'm not having any hard feelings about it. My boss called me in to say he didn't want me to think I was being pushed out - that as long as I'm able to work any at all, I have a job in that office. I do want you to know that recently I've tried several times to get on and either my computer or this site have acted up to stop me from doing so. As always, I appreciate all of your thoughts and prayers and of course request that you continue. You'll be in mine as long as I'm able. Best wishes and God bless. Marsha",
      "MessageIndex": 4,
      "PostDate": "20/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230812",
      "Title": "Marsha Mulvey ~~ How Are You?"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Our pets become such a big part of our families! It is heartbreaking when we lose a family member. They are so true, and loyal, and caring. I feel deeply for your loss. God bless. Marsha",
      "MessageIndex": 36,
      "PostDate": "22/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Just another of the many medical miracles available today. We've come so far, but must continue the research that leads to these advances! Happy for you that it was a \"breeze\". God bless. Marsha",
      "MessageIndex": 7,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203542",
      "Title": "Cyberknife was a BREEZE!!"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Our pets become such a big part of our families! It is heartbreaking when we lose a family member. They are so true, and loyal, and caring. I feel deeply for your loss. God bless. Marsha",
      "MessageIndex": 87,
      "PostDate": "22/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Duh, I must have missed something Megan, but whatever it was, I agree with your sentiment. Thanks, Marsha P.S. It wasn't me, was it?",
      "MessageIndex": 6,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202903",
      "Title": "Please just LET IT GO..Thanks"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Duh, I must have missed something. But whatever it was Megan, I agree with your sentiment. Thanks, Marsha P.S. Was it me?",
      "MessageIndex": 5,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202903",
      "Title": "Please just LET IT GO..Thanks"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Duh, I must have missed something. But whatever it was Megan, I agree with your sentiment. Thanks, Marsha P.S. Was it me?",
      "MessageIndex": 51,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202903",
      "Title": "Please just LET IT GO..Thanks"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Duh, I must have missed something Megan, but whatever it was, I agree with your sentiment. Thanks, Marsha P.S. It wasn't me, was it?",
      "MessageIndex": 52,
      "PostDate": "09/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202903",
      "Title": "Please just LET IT GO..Thanks"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Hello Katie, New Flower is correct that I'm on Navelbine - but it's given through an IV - I don't believe it's available in pill form. I've been on it since October 8, 2010 and am having good results. I also receive Herceptin at each infusion and Zometa once every 4 weeks. I was diagnosed in Feb, 2010 and my breast cancer had already metastasized to the liver, bones, and skin with many lymph nodes involved. First, I had Taxol which was working, but after 12 weeks I developed a bad rash so my onc said we needed to stop for awhile. About 5 weeks later I had to start on chemo again as the cancer started growing. It continued rapid growth despite 9 consecutive weeks on Taxotere so we switched to Navelbine. It only took about 3 or 4 weeks to realize that it was beginning to shrink the tumors. It has continued to work well for me. So...HOORAY for NAVELBINE. I'm sure you're not looking forward to more chemo, but I'm hoping that you'll get good results too. Please come back and let us know how you're doing. Stay hopeful, strong, and positive! God bless us all. Marsha",
      "MessageIndex": 2,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218454",
      "Title": "Navelbene"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Compared to Taxol and Taxotere it has been more tolerable for me. Weeks 4, 5, and 6 were tough for some reason - I was really fatigued but somehow it got better. For all of these almost 15 months my muscles and bones have been sore to some extent but I've never really been sure which drug causes what. My fingernails do not grow the same anymore but I haven't lost any nails like I did on Taxol. Still have \"Charlie Horses\" in the rib area if I make certain movements. I was bald from Taxol but DID NOT lose my hair on Taxotere or Navelbine. For some reason, this week I've been much more tired again, I worked and did other things, but I was just tired. I have a scan scheduled for this Tuesday, so next Friday I'll have those results. The last one was in January, and it was really good. If I think of any other side effects I'll come back and share them. Overall, it's been the best chemo I've had - both for results and for the side effects. Best wishes to everyone!",
      "MessageIndex": 4,
      "PostDate": "14/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218454",
      "Title": "Navelbene"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "When my daughter was about 5 weeks old, my son who was three, got the Easter edition of \"Ranger Rick\" magazine. The centerfold showed an egg, then a crack in the egg, then the crack got bigger, etc. until finally out came the baby chick. As we looked at the pictures and I read the captions, I also made some comparison to Rachel having grown in mommy's tummy and then was born. Zach seemed to enjoy the story, listening very intently. Then there was silence for about 3 minutes when he said, \"Mommy, now when is Rachel going to turn into a chicken?\" ?????????????????TRUE STORY!!!!!!!!!!!!!!!!!!!! Marsha",
      "MessageIndex": 22,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211402",
      "Title": "the funny things kids say..."
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "MamaG, we're all in your corner as you fight-the-fight! I was surprised to read this, as I thought things were going better for you. All I can offer are my thoughts and prayers, and you have them. Marsha",
      "MessageIndex": 48,
      "PostDate": "24/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210344",
      "Title": "it's back again....... in my spinal fluid"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Love to hear happy news! Congratulations on the birth of Noah (love the name). Make sure he has lots of animals! Marsha",
      "MessageIndex": 13,
      "PostDate": "30/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/204431",
      "Title": "Sharing Good News - New Great Grandson (Non-breast cancer related)"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Sorry to say I'm not very good with words but want to let you know I'll be thinking about you as you begin this step of the journey. Staying positive is probably not going to save any of us, but I do think it helps us along the way. What did you finally find out about the \"mystery spots\" (as you called them) in your liver? That's very strange that they would show up on one scan and not another. Hoping Xeloda is your magic bullet, you're taking it on the same schedule as I did, 14 days on and seven off. Are you taking anything else in combination? Stay strong both physically and mentally, it takes both to get through. Living life one day at a time is certainly the right mind set and attitude. I'll be praying for all of us and am sending you my best wishes. Marsha",
      "MessageIndex": 18,
      "PostDate": "26/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/227065",
      "Title": "Next step in my journey"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Zometa can certainly cause bone pain all by itself, let alone the cancer. Sorry it was so bad for you. Best wishes on your upcoming surgery. MM",
      "MessageIndex": 13,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198623",
      "Title": "Update BJmom"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Glad you're letting us know how she's doing! Heather, now it's time for you to be your mom's ROCK as she has already instilled in you the strength you possess. FULL CIRCLE! Blessings to both of you and your family. Marsha",
      "MessageIndex": 1,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200669",
      "Title": "Update on mom"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Our pets are such a big part of our families and our lives. Your Bodhi knows you love him and it will take that love to help you through this difficult time and decision. We don't want them to suffer but we also don't want to lose them. You will know when that time comes. My thoughts are with you. Marsha",
      "MessageIndex": 3,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214129",
      "Title": "my dog has cancer"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Boy, what a busy day. I've been home from work for just about an hour and have already cleaned 2 litter boxes, fed 4 hungry cats, took the trash out, talked to my daughter, and did I mention...I added food and water in a NEW VASE to put my FLOWERS in. THANKS TO ALL OF YOU, it's another wonderful day. The flowers are going to be beautiful, there's a combination of a salmon color and a royal purple. Some are barely open now and they're getting a good drink of water. Sorry, I don't know the names of a lot of flowers, so I'll just call them \"PERFECT!\" This is a wonderful surprise and much appreciated. My thanks to all the Kindred Spirits for thinking of me. As always, best wishes to everyone. Marsha",
      "MessageIndex": 0,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214780",
      "Title": "thank you so much!"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Thoughts and prayers starting right now. Marsha",
      "MessageIndex": 1,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Thoughts and prayers starting right now. Marsha",
      "MessageIndex": 52,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "that all is clear in your liver. Let's also get those bone mets to stop growing! Best wishes, thinking of you. Marsha",
      "MessageIndex": 30,
      "PostDate": "07/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219698",
      "Title": "Update on Bjmom1"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Congratulations on taking part in the Komen \"Race\". I will be picking up T-shirts for my group on the 23rd, the \"Race\" is on the 25th. Still hoping for good weather. I'm curious, how many participants were there in NYC? Thanks for your efforts. Marsha",
      "MessageIndex": 14,
      "PostDate": "14/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200943",
      "Title": "Walked on Sunday in Komen Walk -Run in Central Park"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "That's me. How ya doin'?",
      "MessageIndex": 8,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211820",
      "Title": "Meena .. How are you doing, our PINK WARRIOR .. We are thinking about you"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "I knew what day it was and I love St. Patrick's Day, but I couldn't find any green to wear today. So...pinch me! Marsha",
      "MessageIndex": 12,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214334",
      "Title": "green: Who is wearing GREEN today?"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Thinking of you and hoping for good results!",
      "MessageIndex": 2,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214131",
      "Title": "Get pet scans RESULTS in the am.... left out an important word!!!"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "My oncologist gave me Decadron also as a pre-chemo drip while on Taxol. He said it was \"to help your body cope with chemo\". After the first week, I would be tired-but-wired at night, only slept about 1 to 2 hours each night. After week 2 I did the same then reported to him what was happening (lack of sleep), so he cut it in half. Things improved right away to about 4 or 5 hours of sleep each night. The only other thing it caused was a \"funny feeling\" in my head - can't really explain it, but that also got better with the smaller dose. Best wishes. MM",
      "MessageIndex": 6,
      "PostDate": "11/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198341",
      "Title": "Decadron"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Always happy to hear good news! Congratulations. Marsha",
      "MessageIndex": 12,
      "PostDate": "05/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/204880",
      "Title": "Non bc celebration :-)"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Thanks for asking, I'm doing alright. I've been working 4 days a week now instead of 3 and guess I've just been busy. Schedule is still 3 weeks of chemo, then a week off. Last Friday was chemo #52, this Friday I'm off! I have made a few short comments on the board lately but sometimes the topics are things I have no knowledge of (like surgery, reconstruction, etc), I read but don't reply. My really good news is that I finally got to go watch Rachel (my daughter) play softball on Saturday. She plays for IU Southeast and I was (am) so excited to get to finally see a game this season! She's awesome and this has been such a large part of our lives - when I was diagnosed last year, I wasn't sure I'd be able to watch her play again. HOORAY for chemo! Sylvia, I just saw your message and sent you a reply. Thanks everyone for checking up on me. Marsha",
      "MessageIndex": 5,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214081",
      "Title": "~Shout Out To Marsha Mulvey~"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "It is awful. Our country has been inundated this spring with floods, tornadoes, and wildfires - Mother Nature on a rampage. For about 6 weeks now my thoughts and prayers have been with all who have been affected. In my own tri-state area there have been millions and millions of dollars in losses due to tornadoes and floods, with other areas hit even harder. The good news here is that no human lives were lost. As cancer patients, we have all learned just how precious life is, but this opens your eyes to how quickly lives can be devastated. Thoughts and prayers to all.",
      "MessageIndex": 2,
      "PostDate": "17/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218757",
      "Title": "OT Please say a prayer for all those suffering from the swollen Mississippi River"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Cousins are special, 6 of my 8 cousins were my companions, playmates, and friends. We also went to school and church together. I'm so sorry for your loss. I did see it on the news and believe they said that her father had recently died. Do you think she was depressed over that or other things going on in her life? Regardless of the outcome, my prayers are with you, Stacy, and your family(ies). I believe they also reported that she had a young daughter. I'm so sorry. Marsha",
      "MessageIndex": 4,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    },
    {
      "AuthorID": "Marsha Mulvey",
      "AuthorURL": "https://csn.cancer.org/Marsha Mulvey",
      "Content": "Cousins are special, 6 of my 8 cousins were my companions, playmates, and friends. We also went to school and church together. I'm so sorry for your loss. I did see it on the news and believe they said that her father had recently died. Do you think she was depressed over that or other things going on in her life? Regardless of the outcome, my prayers are with you, Stacy, and your family(ies). I believe they also reported that she had a young daughter. I'm so sorry. Marsha",
      "MessageIndex": 54,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    }
  ]
}