{
  "AuthorID": "meena1",
  "AuthorURL": "https://csn.cancer.org/meena1",
  "Posts": [
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "i have watery eyes also, i thought it may be because i have no eyelashes. I am on carbo/taxotere.",
      "MessageIndex": 5,
      "PostDate": "21/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206046",
      "Title": "Wateru eyes"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I was taking a nap today, when what do I hear...no it wasnt a sleigh with 8 tiny reindeer, but close!!! It was the mailman delivering a package filled with cards and gifts from the ladies on this site. Thank you so much, that was so much fun opening the cards and packages, i also plan on writing each of you personally. The blanket is beautiful and will be useful with the snow tonight, and the jewlrey, picture, the key chain, necklaces, writing paper and trinkets and good luck pieces that each of you picked out for me. And thank you to our wonderful Aysemari who got all this together and sent it to me(i will admit i gave her a hard time about giving her my address). I love each gift and card that you sent to me, hmmm, i am wondering how you planned all this! You are so wonderul to do this, I know that now i will have to really fight this. Thank you all, you will never know how much this means to me",
      "MessageIndex": 0,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210287",
      "Title": "A big Thank You!!!!"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I had taxol/herceptin, and Yes, herceptin is hard on your heart. Your doc should send you for a muga scan to see if your heart is healthy before starting herceptin. I did not have a problem with my heart.",
      "MessageIndex": 6,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174082",
      "Title": "Anybody else get racy after a/c treatments"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Yikes. Contact your oncologist, I was also constipated at one time, I used Tucks Wipes on my butt, however I did not have a problem with my vj area. I think the emergency room sounds crazy too. You should not be that uncomfortable in that area.",
      "MessageIndex": 4,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175624",
      "Title": "Need help ..sensitive subject .. private area is raw and inflamed from constipation (5 days with movement) .. I need help"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I purchased my wigs from the TLC catalog, and I was very pleased. Alot of people thought it was my hair, or they were just being kind! The wig will fit better after you lose your hair, which I will warn you is very sad. But it will grow back very nicely. I also lost my eyebrows and eye lashes, just wanted to warn you that might happen. I lost mine in the summer, so I bought a really nice pair of Coach sunglasses and wore them alot. It is important to wear sunglasses since your eyelashes act as a shield for yours eyes. And who cares if it is a cloudy day! My lashes grew back thin, so I do need to wear mascara. Take care",
      "MessageIndex": 5,
      "PostDate": "03/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/176749",
      "Title": "When I cut my hair..."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I have Inflammatory Breast cancer, i was diagnosed in July 2008. Right now I am going through a reoccurance and i am stage 4. REMEMEBER, that IBC is the most agressive forms of breast cancer. I was in remission for a couple months as my doctors patted themselves on the back and took their eyes off me, and BAM, the cancer spread. I am back on chemo, and will be for at least a year! So it is important that you follow up with your doctor. I have since transferred to a different hospital (duh), and I am under the treatment of an expert in IBC. I am on a different chemo treatment, and still have a long way to go.",
      "MessageIndex": 5,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201760",
      "Title": "IBC (Inflammatory Breast Cancer)"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Heidi, I did not realize that you had IBC. Let me know what your oncologist decides to do, this is important. I believe that you may need to go through chemo again since you had so many positive nodes, was this mentioned to you? I had chemo before my surgery, then rads. Since then, i have found out that I should have had chemo, surgery, (actually the surgery was unnecessary), then chemo again. And remember, IBC is very agressive.",
      "MessageIndex": 8,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201760",
      "Title": "IBC (Inflammatory Breast Cancer)"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I have read and heard about this happening to other girls and the reason was too much estrogen in their bodies...there are alot of hair products and other items that could cause this. Also, soy products may be blamed. I have heard of someone who gave their daughter soy milk all the time and she started to grow breasts. I hope they check this out before they start scaring you. take care, and i hope your daughter is well.",
      "MessageIndex": 13,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178190",
      "Title": "prayers for my daughter"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "She is in my prayers. Please keep us updated",
      "MessageIndex": 34,
      "PostDate": "09/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183337",
      "Title": "Regarding Irishwhispers"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Well, I was a little too hopeful on my last post about my update. I did get a copy of the cat scan and it did show a slight decrease in the tumor in my liver which was originally 9x8 cm, yikes, it is huge. Also, there was a decrease in most of the swollen lymph nodes in my stomach area, however, there was a slight increase in one of the lymph nodes. Also, there was some activity in my bone mets. Soooo, i am going for a second opinion on Aug 24 at Fox Chase Cancer Center, with Dr Massimo Cristofanilli who is a specialist with Inflammatory breast cancer and has come to Philadelphia from MD Anderson in Houston. Spent 2 days on the phone setting this up, i am now trying to get all my records together. Pain is getting better, so that is a plus. I have been very tired and found out that I am anemic and my blood count was low, they did an iron panel to check that out. Still trying to set up an appointment for the Lymphedema issue, since there are not too many lymphedema specialists. And also, it seems like everyone is on vacation!!!! I am on disability from work, my doctor has me out for 6 months, which has been approved. I have been reading everyones posts, and it looks like everyone is doing well. I am a little concerned about switching doctors at this point, i saw a post about this. Take care...",
      "MessageIndex": 0,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198639",
      "Title": "Update on my reoccurence"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I have been through everything you are going through and feel the same way. I had a masectomy about 2 years ago. I also want my pre cancer life back. I used to be very active, i looked younger than 50 also, i used to love to go shopping at the mall with my daughter, i loved a margarita or sangria once in awhile. I had parties and family over my house a lot. I am going through a reoccurance right now, so it is back on treatment. I am 54 and feel 70 yr old. I do not have much energy, everything tastes so bland. A margarita would probably taste like water! Well, i hate to vent on your vent...but just wanted to let you know i feel the same. Also, we seem to be the same age. take care, you will get your hair back, you will lose the weight. Just have to work harder.",
      "MessageIndex": 9,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200759",
      "Title": "Cried my eyes out tonight !!!!"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "That was lovely and i am sure it is the way that all of us feel. This is a place to share our fears and our joys. Sometimes a happy place and sometimes so unbelievably sad that it just seems so surreal. But we all manage to pull through.",
      "MessageIndex": 83,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I love the pictures, i wish i could have been there. I live across the country in Philly, but so glad you guys had a great time",
      "MessageIndex": 12,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "That was lovely and i am sure it is the way that all of us feel. This is a place to share our fears and our joys. Sometimes a happy place and sometimes so unbelievably sad that it just seems so surreal. But we all manage to pull through.",
      "MessageIndex": 35,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I love the pictures, i wish i could have been there. I live across the country in Philly, but so glad you guys had a great time",
      "MessageIndex": 58,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "i have a problem with this also, i was googling something about breast cancer and my post and picture from this site came up. I did not like that because anyone looking up breast cancer can see my ramblings! That is why i took the pic of myself off. I had read about this on another board. It's a bit scary since i have heard that insurance companys look for info on fb and google.",
      "MessageIndex": 4,
      "PostDate": "26/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/204116",
      "Title": "Learned something about Facebook that I didn't know"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I have just heard the news that Elizabeth Edwards lost her battle with Breast Cancer. I saw that there was already a post opened about this but i wanted to also start a post since I am so saddened and shocked. I have just read that her cancer spread to her bone, then her liver. At Thanksgiving she became ill and was told that further treatment was useless. She overcame so much pain, both in her personal life and with her fight with cancer. She leaves behind 3 children, 2 of whom are very young. And oh yes, lets not forget the cheating ex husband. As you all may know, I am struggling through a reoccurance. My cancer has also spread to my liver, so each bit of news like this makes me think of my own mortality and how happy I am to be responding well to treatment but I am heartbroken to see that woman like Elizabeth and my cyber friend Deb are losing this battle too quickly.",
      "MessageIndex": 0,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/207165",
      "Title": "RIP Elizabeth Edwards"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I am so sorry to hear this. They did see some fluid in my pet scan but it was not cancer, I hope that they can help you at the Moffit Center, please let us know. Will they have to do chemo if it is in the fulid, i have been wondering about this.",
      "MessageIndex": 37,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210344",
      "Title": "it's back again....... in my spinal fluid"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Meena is a family nickname. My niece could not pronounce my name and one day my daughter was calling me \"mean\" , and she said to my niece, \"isn't she mean?\". So, my niece started calling me Aunt Mean-a! (she was only 3yo). It is similar to my name, so my family now calls me Meena. I put the number 1 after it because i thought you had to have a number.",
      "MessageIndex": 15,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Meena is a family nickname. My niece could not pronounce my name and one day my daughter was calling me \"mean\" , and she said to my niece, \"isn't she mean?\". So, my niece started calling me Aunt Mean-a! (she was only 3yo). It is similar to my name, so my family now calls me Meena. I put the number 1 after it because i thought you had to have a number.",
      "MessageIndex": 165,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I remember that song from \"West Side Story\" also. Tony sang it to Maria, and then she sang with him.",
      "MessageIndex": 4,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202362",
      "Title": "\"Somewhere\" is A Place We Call Our Second Home, Thank you so much"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Meena is a family nickname. My niece could not pronounce my name and one day my daughter was calling me \"mean\" , and she said to my niece, \"isn't she mean?\". So, my niece started calling me Aunt Mean-a! (she was only 3yo). It is similar to my name, so my family now calls me Meena. I put the number 1 after it because i thought you had to have a number.",
      "MessageIndex": 65,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Meena is a family nickname. My niece could not pronounce my name and one day my daughter was calling me \"mean\" , and she said to my niece, \"isn't she mean?\". So, my niece started calling me Aunt Mean-a! (she was only 3yo). It is similar to my name, so my family now calls me Meena. I put the number 1 after it because i thought you had to have a number.",
      "MessageIndex": 115,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I have IBC and was diagnosed on July 7, 2008. As you know, i have had a reoccurance this summer. I do not know what the stats are, however, I do know that IBC is the most aggressive and deadly form of breast cancer, and the rate of reoccurance is high. Stinks! In my case, I had been complaining that I was not feeling well but my breast surgeon and oncologist kind of blew me off. So, I would suggest that you know your body and insist on additional testing or get a second opinion. That being said, I am so happy that you are NED. You are on herceptin so that will also help prevent a reoccurance. Take care and Happy Birthday!!!",
      "MessageIndex": 17,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/206631",
      "Title": "Survivors of IBS"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Thanks for the info. I wonder what it was, keep an eye on it after chemo",
      "MessageIndex": 2,
      "PostDate": "19/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198912",
      "Title": "Had a tiny wart...warning"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Chen, i am so sad to read this. I also was just diagnosed with mets to my liver, we will be going through this together. I was having alot of pain, assumed it was my gallbladder and here it was my liver. If you saw my recent post, my insurance company denied my chemo treatment yesterday. They did not let me know why, so i am fighting with them today. I hope that you have better luck then me, please let me know, you can pm me also. Know that i love you and that we will both fight this and win. Oh chen, i cannot believe this.",
      "MessageIndex": 126,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I hope your treatment plan is authorized. My insurance denied mine, my oncologist wants to give me avastin and Abraxane. They are sending me a copy of the denial but i am assuming it costs too much money. We can compare our treatment plans, take care...",
      "MessageIndex": 88,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Chen, i am so sad to read this. I also was just diagnosed with mets to my liver, we will be going through this together. I was having alot of pain, assumed it was my gallbladder and here it was my liver. If you saw my recent post, my insurance company denied my chemo treatment yesterday. They did not let me know why, so i am fighting with them today. I hope that you have better luck then me, please let me know, you can pm me also. Know that i love you and that we will both fight this and win. Oh chen, i cannot believe this.",
      "MessageIndex": 32,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I hope your treatment plan is authorized. My insurance denied mine, my oncologist wants to give me avastin and Abraxane. They are sending me a copy of the denial but i am assuming it costs too much money. We can compare our treatment plans, take care...",
      "MessageIndex": 41,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Chen, i am so sad to read this. I also was just diagnosed with mets to my liver, we will be going through this together. I was having alot of pain, assumed it was my gallbladder and here it was my liver. If you saw my recent post, my insurance company denied my chemo treatment yesterday. They did not let me know why, so i am fighting with them today. I hope that you have better luck then me, please let me know, you can pm me also. Know that i love you and that we will both fight this and win. Oh chen, i cannot believe this.",
      "MessageIndex": 79,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I hope your treatment plan is authorized. My insurance denied mine, my oncologist wants to give me avastin and Abraxane. They are sending me a copy of the denial but i am assuming it costs too much money. We can compare our treatment plans, take care...",
      "MessageIndex": 135,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I was on chemo and herceptin for 3 months, then herceptin for another 9 months. I did not have any problems with herceptin. It truly is a miracle drug, Take Care",
      "MessageIndex": 6,
      "PostDate": "20/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175994",
      "Title": "Herceptin anyone?"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I am sorry that your bone mets are causing you such pain and the zometa is not helping, I also have bone mets, t-11 and have been on zometa for 2 years. I have not had much pain from the bone mets. I have been wondering how you were doing, i wish you well with your treatment",
      "MessageIndex": 9,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198623",
      "Title": "Update BJmom"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Please don't forget to give updates on how you are doing, I also have bone mets so i find your posts very helpful.",
      "MessageIndex": 16,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198623",
      "Title": "Update BJmom"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I lost a close friend on the boards in October and I still read her messages to me and cry! It is so hard to be positive when there is so much pain when you lose someone here. I know we all think \"that could have been me\". But we all need each other for support.",
      "MessageIndex": 2,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208916",
      "Title": "I have to escape for a while"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I live in Philadelphia and there is a wonderful cancer center here. It is called Fox Chase Cancer Center, I went there for my radiation and they were wonderful.",
      "MessageIndex": 2,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177755",
      "Title": "Hi"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I sent her a PM, but did not get a response. Just hoping that she is in good hands. She has posted that her doctor is in touch with my oncologist in Philly (who is the expert in Inflammatory Breast Cancer) so I am thinking positive thoughts.",
      "MessageIndex": 6,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208720",
      "Title": "I've been thinking about you Heidi - Please post when you can."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Right now there is a blizzard going on, so much snow. A complete white-out. We already had 2 feet of snow from Saturday. Power is going out all over, a mess. I know there are a few sisters in my area, how are you coping. I am watching a lot of TV, kind of ironic, but i am watching the snow storm on TV also, go figure. Should have enough food, but another storm coming Monday. Stay warm and safe.",
      "MessageIndex": 0,
      "PostDate": "10/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185728",
      "Title": "SOCKED WITH SNOW......IN PHILADELPHIA"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I did not take the 5 year pill, oncologist told me would not work for my type of cancer. My reoccurance occured 2 years after my original diagnosis and 1 year after i completed treatment.",
      "MessageIndex": 1,
      "PostDate": "14/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198598",
      "Title": "reoccurance question"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I read this book while I was in chemo and found it to be eye-opening. It is a must read. I could relate to everything in the book, even down to the personality traits.",
      "MessageIndex": 2,
      "PostDate": "27/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/193098",
      "Title": "The AntiCancer Way - book"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I loved the jokes. How did your surgery go? did you just have the silicone put in without the latissimus flap being done? my doctor is not happy about just putting the silicone boob in, he wants to take muscle from my back/ ouch",
      "MessageIndex": 5,
      "PostDate": "25/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180540",
      "Title": "Nudist colony‏"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I had a masectomy in November, I also had 11 lymph nodes removed, so my recovery was a little tough. I was told not to lift anything heavy with that arm, but I do not remember any pound limit. I was out of work for 8 weeks, I work at a computer all day and the typing was very painful for me. I still try not to lift anything heavy, even my pocketbook. I also had reconstruction, I had expanders put in. I guess it will depend on how many lymph nodes you have removed and how you feel afterwards. Each person recovers differently, I also had a tough time driving. My range of motion was way off. Take the time you need off work, your body needs to recover. I hope your surgery goes well, take care.",
      "MessageIndex": 2,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175358",
      "Title": "Restrictions after mastectomy/reconstruction"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I had a masectomy in November, I also had 11 lymph nodes removed, so my recovery was a little tough. I was told not to lift anything heavy with that arm, but I do not remember any pound limit. I was out of work for 8 weeks, I work at a computer all day and the typing was very painful for me. I still try not to lift anything heavy, even my pocketbook. I also had reconstruction, I had expanders put in. I guess it will depend on how many lymph nodes you have removed and how you feel afterwards. Each person recovers differently, I also had a tough time driving. My range of motion was way off. Take the time you need off work, your body needs to recover. I hope your surgery goes well, take care.",
      "MessageIndex": 3,
      "PostDate": "09/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175358",
      "Title": "Restrictions after mastectomy/reconstruction"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Gracie, I'm glad you are feeling better today. My husband said I am like the Bionic Woman with all these drugs I am taking! So when i am down, I think of that.",
      "MessageIndex": 5,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176069",
      "Title": "Zometa round 1, laid me low"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Hi Gracie, I get zometa every month, and I get achy after my treatments also. I seem to get a stiff neck mostly, but it usually is not too bad. I was getting it every 3 weeks, but after I complained, he made it every 4 weeks.",
      "MessageIndex": 4,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176069",
      "Title": "Zometa round 1, laid me low"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Hello, I am doing ok. My daughter had surgery, and the i had chemo yesterday. So it has been a busy week. I am saddened by the news about Mamag, she was so spunky! and positive. Tired tonite, will be back later",
      "MessageIndex": 15,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211820",
      "Title": "Meena .. How are you doing, our PINK WARRIOR .. We are thinking about you"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Please don't give up...this is a rough journey but you are stronger than you think. I also am stage 4 with mets to liver and bones. I was diagnosed in July 2008 and sometimes i feel like you, \"is this worth it\"? I have a 19 year old daughter who also gives me a lot of grief, she just never gives up! i pray that i can handle this, I also am in treatment for the rest of my life. There are other woman who feel like you..tired and sad. Take care",
      "MessageIndex": 5,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182397",
      "Title": "If I didn't have kids . . ."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "yea!!! Enjoy your vacation. I don't know where you are going, but weather is going to be beautiful here in Pa",
      "MessageIndex": 32,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/199976",
      "Title": "And the News Just Gets Better"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I did not know you were so sick, i am so sorry to hear this. I will keep you in my prayers, and remember to drop in more often",
      "MessageIndex": 7,
      "PostDate": "24/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201781",
      "Title": "Hey checking in just got out of hospital need prayers"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I had chemo first because of the type of cancer I had (Inflammatory) and because my tumor was very large and agressive. I want to reassure you that Chemo will kill the cancer cells, believe it. I also had met to my bone and liver and they were gone after 12 rounds of chemo. I read this book called, The Anti-Cancer, a new way of life. It was very good, along with the chemo you have to also apply healthy living. I wish you the best of luck, stay positive.",
      "MessageIndex": 6,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176057",
      "Title": "I got a question??"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Remember that you need to take care of yourself first! Hope your mom and dad are better and you have more support from your sister",
      "MessageIndex": 20,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/205725",
      "Title": "First Mom then Dad"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "so happy to hear from you! I have been wondering about you, don't stay away so long. I missed you!!!",
      "MessageIndex": 10,
      "PostDate": "05/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209224",
      "Title": "update on BJMOM"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I had chemo every week for 12 weeks. I also was so scared, but it was not as bad as i thought it would be. I found the following helped me. I would take a walk every morning, drink hot green tea, eat applesauce, popsicles, homemade soup, drink ginger ale. I was constipated, so I had to take a stool softener, your oncology nurse will recommend something. I also had anti-nausea drugs. My nurses were so helpful, I really believe you will be fine. I was tired, but I would rest alot. I also talked on the phone to friends and family, You will also meet people at chemo who are going through the same thing, talk to them. Think positive!",
      "MessageIndex": 8,
      "PostDate": "16/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173780",
      "Title": "Tips and tricks for chemo. - would appreciate"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I am so sorry for your loss, jo jo. This is so shocking. do they have any idea who did this to her? I will pray for her and her family. I hope they can find peace and heal from this tragedy.",
      "MessageIndex": 52,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Thank you for your post. I was diagnosed in July 2008 with Inflammatory breast cancer and it is truly awesome to hear of a success story. I also am feeling healthy and strong. I still have that fear that it may sneak back up on me, since the reoccurance rate is usually higher. I am seeing my oncologist every 8 weeks and he is very confident ( and has always been). I had a masectomy with an expander but i have not completed the final reconstruction yet. Take care",
      "MessageIndex": 5,
      "PostDate": "01/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/178848",
      "Title": "Inflammatory Breast cancer"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "You look beautiful! Your hair came in great, did it really come in that color? Mine came in very curly and skunky looking, remember the 1960's perms. Must feel great!",
      "MessageIndex": 1,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198674",
      "Title": "This is me with 5 months of new hair."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "I am so sorry for your loss, jo jo. This is so shocking. do they have any idea who did this to her? I will pray for her and her family. I hope they can find peace and heal from this tragedy.",
      "MessageIndex": 2,
      "PostDate": "10/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "It is perfectly normal to have this meltdown, I finished my treatment in May, however, I still go in for zometa monthly. It was so overwhelming at first, but you will get through this, and move on to a new \"normal\". I am sending positive vibes your way.",
      "MessageIndex": 10,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174090",
      "Title": "I'm having a hard time..."
    },
    {
      "AuthorID": "meena1",
      "AuthorURL": "https://csn.cancer.org/meena1",
      "Content": "Thank you for this post. I just found it. I was away in vacation for 3 days. i will start a new post to let you know what is going on",
      "MessageIndex": 7,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196050",
      "Title": "For Meena1"
    }
  ]
}