{
  "AuthorID": "mgm42",
  "AuthorURL": "https://csn.cancer.org/mgm42",
  "Posts": [
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "Joyce, I was having the same thoughts when I saw a picture of myself as a child. You have expressed your thoughts so well that all I can do is say \"thanks\" for putting my feelings into words and acknowledging that self love is a good thing. I love me, and I love you. Happy Valentine's Day. Marilynn",
      "MessageIndex": 3,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://csn.cancer.org/node/156929",
      "Title": "self love"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "Debi has hit the nail on the head for you and me and ALL of us. For those of us who are survivors, we remember all too well the FEAR, the side effects, the FEAR, the tears, the depression, the FEAR, the discomfort, the FEAR! We all needed support and we all needed to vent. That's why this place exists for me. And I think for all of us. Mike, I never read someone's post and think they are trying outdo someone else. All I read is that they are hurting and miserable and scared and if I can give a little support, hope, sunshine, silliness whatever, I try to help because so many were there to help me. Hang in there guy. Hugs, Marilynn",
      "MessageIndex": 11,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170152",
      "Title": "PLEASE forgive ME!"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "3 chemos down, one to go. Peach fuzz on my head. Life is good. I have 6 weeks of radiation after chemo, but that will whiz by, too. Thanks for asking Cindy. That was very kind of you. And thanks for sharing the GOOD news about yourself. That REALLY helps. Hugs, Marilynn",
      "MessageIndex": 2,
      "PostDate": "08/04/2008",
      "ThreadURL": "https://csn.cancer.org/node/157472",
      "Title": "How is everyone."
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "In order to handle the problem with constipation, I began using Miralax, now available over the counter. It softens the stool so that you won't need any effort to expel the movement. Once things are under control, stop taking it. When you need it again, take it again. I still use it occasionally and it's been 20 months. As for the burning upon urination, I strongly urge you to drink 2 - 3 litres of water the day before, the day of and for two days after chemo. If you are receiving Cytoxan, it can be rugged on your bladder. The water therapy helps to flush the toxic residue out of the system more quickly, which helps to prevent against irritation. Both of these things worked for me. Good luck kiddo. Hang in there. Hugs, Marilynn",
      "MessageIndex": 20,
      "PostDate": "16/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175624",
      "Title": "Need help ..sensitive subject .. private area is raw and inflamed from constipation (5 days with movement) .. I need help"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "Words escape me, but I want you to know that I care about you and wish you all of the best that life can offer. Hugs, Marilynn",
      "MessageIndex": 1,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164595",
      "Title": "My daughter Stephanie's lawsuit settled..."
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "What a beautiful sentiment. From my heart to yours. Love, The Hampster",
      "MessageIndex": 3,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://csn.cancer.org/node/158563",
      "Title": "support in the flesh"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "Sounds to me like you have received some wonderful advice and some great insights. I hope that everything the others have said has penetrated your fear and empowered you to deal with those test results and your upcoming decisions. Hugs, Marilynn",
      "MessageIndex": 5,
      "PostDate": "30/04/2008",
      "ThreadURL": "https://csn.cancer.org/node/157684",
      "Title": "BRCA gene"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "I had the same thing with my mouth and tongue. My doctors prescribed a mixture of salt, baking soda and water. I was to rinse 4 - 5 times a day. The mixture was 1/2 tsp baking soda, 1/4 tsp salt to 8 oz. of water. They also recommended a soft toothbrush, Biotene toothpaste and mouth wash (no alcohol). The Biotene products were good, but the baking soda/salt/water rinse was the best for me. They also suggested that I keep a supply of lemon drop on hand for the dryness. Hope this helps a bit. Marilynn",
      "MessageIndex": 7,
      "PostDate": "28/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/135474",
      "Title": "Sore and dry mouth"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "Oh, Pat. Please know how very sorry I am for what you are going through, and that I'm amazed and encouraged by your attitude. You are facing my worst nightmare - yet another mammogram which shows something suspcious and the interminable waiting - AGAIN! You are so strong. I'm sure we'll all be watching for your posts. And, I'm thinking positively that you WILL DANCE WITH NED. Hugs, Mariynn",
      "MessageIndex": 16,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176273",
      "Title": "Definitely NOT Dancing With Ned"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "I had invasive ductal carcinoma in my left breast (Stage 1C) and microcalcifications in the right breast, which was determined through my mammogram. My doctor said that microcalcifications were, generally, nothing to worry about. However, to be on the safe side, they would biopsy that breast. The microcalcifications were benign, as expected, but they used a new vacuum method for the biopsy and removed the calcifications at the same time. I'm glad they did. I believe in an ounce of prevention when possible. I don't know if this helps or confuses the issue for you. My best advice to you is to continue discussing this issue with your doctors. Good luck. Hugs, Marilynn",
      "MessageIndex": 6,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164468",
      "Title": "Microcalcifications?"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "I understand what you are saying. I lay in bed and plan so many things for each day even though I know, subconsciously, that I won't get them accomplished. But, I agree with Zahelene. You may be doing too much and not giving your body the time it needs to get back up to speed and to heal. My last chemo was 4/19 and my last of 33 rads was June 26th. Only now can I say that I have my old energy back - FOR HALF THE DAY. The mornings and early afternoon, I'm great. The rest of the day I need rest periods in between times of activity. Maybe you should give your brain some exercise that doesn't require physical exertion - like Suduko, crossword puzzles, reading a good mystery, etc. As for physcial exercise, walking may still be the best to untangle your muscles and your brain as well. Don't know if this helps, but hope you are feeling better soon. Hugs, Marilynn",
      "MessageIndex": 2,
      "PostDate": "25/08/2008",
      "ThreadURL": "https://csn.cancer.org/node/161849",
      "Title": "when do the aches and pains go away?"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "So glad you are enjoying yourself. Hugs, Marilynn",
      "MessageIndex": 1,
      "PostDate": "29/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210951",
      "Title": "new pix up"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "Although I cannot find a lot of hard data regarding the efficacy of quinine (tonic water)for muscle cramping, I have found a ton of anecdotal info from other bc survivors. Also, I found anecdotal info on the use of cherry juice, daily, for joint pain and swelling. I'm not advocating the use of both these products, but I can say that they seem to be working for me. I'm on Arimidex and at times I struggled with the side effects. My daily use of these products seems to reduce the muscle cramping along with reducing my joint pain to the point where I don't need to take Aleve or Tylenol on daily basis. You may want to check this out. Hugs, Marilynn",
      "MessageIndex": 0,
      "PostDate": "08/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179370",
      "Title": "Help for AI side effects, maybe..."
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "Lyrica is a drug designed to treat fibromyalgia; however, as with most drugs, it helps a number of conditions, one of them being neuropathy. My son-in-law is a drug rep and tells me that he's heard of good success with Lyrica for neuropathy. P. S. He doesn't rep Lyrica. In fact, he was prescribed Lyrica for his sciatic pain. Glad to hear that you are feeling better and that you are back! Super! Hugs, Marilynn",
      "MessageIndex": 1,
      "PostDate": "16/08/2008",
      "ThreadURL": "https://csn.cancer.org/node/161647",
      "Title": "Who's heard of Lyrica"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "It's PM.",
      "MessageIndex": 2,
      "PostDate": "27/03/2008",
      "ThreadURL": "https://csn.cancer.org/node/157369",
      "Title": "Chat"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "I'm so sorry, but yes, you really should get the mammogram. I, too, was very sore from the surgery and radiation burns, but my oncologist said that once I had passed the three month mark after finishing treatment that I needed to have one. The technician was very quick and made the experience as pleasant as she possibly could. It won't lie, there was some real discomfort, but when I got the results that said everything appeared to be benign, I was one happy camper. Hope this gives you a little courage. Marilynn",
      "MessageIndex": 2,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163423",
      "Title": "Do I HAVE to have a Mammogram?"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "I wrote to the CSN administrator, as I'm sure others did, and they emailed me to tell me that username32 has beenblocked from posting on our site and that all posts have been deleted. I love Greta at CSN. Marilynn",
      "MessageIndex": 0,
      "PostDate": "10/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177231",
      "Title": "Username32 Blocked"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "You are a wealth of wonderful information. I enjoy reading your posts and I come away very hopeful. Thanks so much. Hugs, Marilynn",
      "MessageIndex": 1,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211276",
      "Title": "New compound shows promise against chemo-resistance"
    },
    {
      "AuthorID": "mgm42",
      "AuthorURL": "https://csn.cancer.org/mgm42",
      "Content": "I echo Zahelene's advice and I would like to add that if you live near a teaching hosptial, you might want to consider starting your search there. Good luck. I'm still in treatment so I sort of know what you must be feeling. Instead of having my radiation treatments close to home, I've chosen to travel 165 miles round trip in order to have the doctors that I've grown to know, trust and love. Take care. mgm 42",
      "MessageIndex": 1,
      "PostDate": "30/01/2008",
      "ThreadURL": "https://csn.cancer.org/node/156773",
      "Title": "A question for survivors"
    }
  ]
}