{
  "AuthorID": "mimikitty",
  "AuthorURL": "https://csn.cancer.org/mimikitty",
  "Posts": [
    {
      "AuthorID": "mimikitty",
      "AuthorURL": "https://csn.cancer.org/mimikitty",
      "Content": "I didn't need chemo. I had a lumpectomy on 5/10. I have my first appointment with the radiation oncologist on 5/24. I believe the treatment will start shortly after.",
      "MessageIndex": 9,
      "PostDate": "22/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240553",
      "Title": "How long after surgery before starting radiation?"
    },
    {
      "AuthorID": "mimikitty",
      "AuthorURL": "https://csn.cancer.org/mimikitty",
      "Content": "Just stumbled on this site which has recommended radiation start dates... http://www.cmaj.ca/content/suppl/2007/06/14/158.3.DC1/cpg6-patient_version.pdf",
      "MessageIndex": 14,
      "PostDate": "23/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240553",
      "Title": "How long after surgery before starting radiation?"
    },
    {
      "AuthorID": "mimikitty",
      "AuthorURL": "https://csn.cancer.org/mimikitty",
      "Content": "Hi Everyone, I'm in the midst of deciding between a mastectomy with reconstruction or lumpectomy followed by radiation. I was told that it's likely I won't need radiation treatments if I get the mastectomy. In researching these options, I came across a medical research study that found radiation negatively affected breast cancer survivors' cognitive functioning in much the same way that chemo does. Below is a link to the study. http://www.sciencedaily.com/releases/2011/12/111212093738.htm I discussed this article with my oncologist and a radiation oncologist and they don't believe this to be the case. So I wanted to check with folks on this forum who have had radiation therapy, particularly radiation therapy without chemo. Have you felt that your cognitive functioning has been impaired since the radiation treatments? Thanks in advance for anything you can share.",
      "MessageIndex": 0,
      "PostDate": "02/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/239672",
      "Title": "Feedback Needed: Study Shows Radiation Treatments Negatively Affect Cognitive Functioning"
    },
    {
      "AuthorID": "mimikitty",
      "AuthorURL": "https://csn.cancer.org/mimikitty",
      "Content": "Hello, I wonder if anyone might have had a similar experience as mine and how they followed up? I had a lumpectomy last Thursday. The pathology report says the margins were \"close\" for both the DCIS and invasive cancer components of my tumor. The distance from the margin for each is 1 mm. My surgeon didn't recommend additional surgery in our phone conversation and she seemed to indicate the radiation treatment should take care of it. I will meet with her for a follow-up appointment tomorrow. Has anyone gone for additional surgery to remove the close margin? My cancer characteristics are as follows: Infiltrative Ductal Carcinoma, tumor largest width 1.7 cm, HER2-/ER+/PR+/KI67+ low (10-15%). Thanks in advance for any input.",
      "MessageIndex": 0,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240321",
      "Title": "Lumpectomy Close Margins"
    }
  ]
}