{
  "AuthorID": "mimivac",
  "AuthorURL": "https://csn.cancer.org/mimivac",
  "Posts": [
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "It's a hard decision for sure and you are getting different opinions, so I know it's not easy. Here are some of the reasons for doing chemo: you are young (cancer is more aggressive the younger you are); you have HER positive invasive and non-invasive cancer; you have extensive DCIS. Reasons to skip chemo include: you have a very small area of invasive cancer; chemo will only reduce your chances of recurrence by a small percentage; chemo has side effects, some of which could be serious. I'm wondering if you can just do Herceptin? It's not chemo, but a targeted agent to get the overexpression of the HER2/neu gene. Maybe just Herceptin and Tamoxifen afterwards? Maybe even a fourth opinion is called for?! Have you been seen at a major cancer center yet? Or by an oncologist who specializes in young women with breast cancer? Our disease can be different and require more aggressive measures. Remember that the best chance for a cure is right off the bat. Good luck! Mimi",
      "MessageIndex": 1,
      "PostDate": "29/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197600",
      "Title": "I am so confused!"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I never read any of your posts as overly negative, Mike. And even if they were negative, that's OK. How else is one to feel about cancer? We have room for all types of emotions here. Good, bad, negative, positive. While I think it's great to be positive (and I certainly try to be), there can be a tyranny about being made to \"think positive\" at all times. We are human and are being faced with perhaps the biggest disaster of our lives. Being negative is not unexpected. Having said that, I don't think you're negative at all. Mimi",
      "MessageIndex": 16,
      "PostDate": "18/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170152",
      "Title": "PLEASE forgive ME!"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Meena, so glad you liked everything and that it put a smile on your face. That is what we were aiming for. And a big thank you to Ayse for making it all happen. Mimi",
      "MessageIndex": 19,
      "PostDate": "26/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210287",
      "Title": "A big Thank You!!!!"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Consider yourself included in my good thoughts. Good luck on both surgeries. I hope they are both a great success and that there is minimal post-op pain. Mimi",
      "MessageIndex": 22,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186483",
      "Title": "surgery next wednesday"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I am thinking positive thoughts for you. Hope to hear that you are recovering soon. This is another step toward good health. Mimi",
      "MessageIndex": 6,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178043",
      "Title": "Tomorrow's the \"Day\" (10--21-09)"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "My parents live in Michigan. I'm calling my mom now. Mimi",
      "MessageIndex": 8,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194993",
      "Title": "Anyone else feel the earthquake a little while ago??"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Isn't it a relief? I had my drains removed the day before Thanksgiving 2008 and the nurse said I would feel like a new woman. I did! Glad it resolved for you. Mimi",
      "MessageIndex": 16,
      "PostDate": "14/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195995",
      "Title": "Can't seem to get rid of the Drains!"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I love all your new pics! Jeanne, you are a gorgeous little girl. And Aortus, what can I say?! A rebellious period? LOL. Mimi",
      "MessageIndex": 24,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/180949",
      "Title": "New Challenge for you"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Larisa, check with your oncologist's office or cancer center. Often the counselor who does the group therapy also does individual therapy. Your oncologist's office might have a list of names of individual counselors who deal in survivor issues. That's how I found mine. Good luck. Mimi",
      "MessageIndex": 1,
      "PostDate": "24/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195082",
      "Title": "Breast Cancer Survivor Counselor"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Now that you're home you can decide when and if you will take pain medication, and what to eat. Great to be in control again, isn't it? Rest easy, do things you enjoy, and post when you feel like it. Mimi",
      "MessageIndex": 19,
      "PostDate": "22/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178043",
      "Title": "Tomorrow's the \"Day\" (10--21-09)"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I think we should all put on our suits in pride! We've through too much to cover it up. When my condo pool opens up, I will strut whatever is left of my stuff.",
      "MessageIndex": 12,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166475",
      "Title": "CONFESSIONS OF A GOOF"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "There are innumerable factors to cancer, but environmental ones are high on the list. You are so right about the modern lifestyle. It has to go. I, too, have been struggling with this and trying to make better choices. A ten-year-old with breast cancer is just so unconscionable.",
      "MessageIndex": 2,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168739",
      "Title": "10 year old girl with cancer"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Here is an article that came out today in the NY Times about the effect of vitamins, including antioxidant supplements on diseases, including cancer: http://www.nytimes.com/2009/02/17/health/17well.html?_r=1&8dpc Any thoughts? I am wondering what the scientists controlled for when they did the mortality study on people who take antioxidants. It could be that people who are are less healthy in the first place are more likely to take supplements. So the 5% higher mortality rate could actually represent a gain in mortality for these people. Unless you do a double-blind human study it is hard to tell. The mice with the vitamin C is troubling though. There was another study that found the opposite result: they tested several nutrients, Vitamin A (beta-carotene), selenium, magnesium, and Vitamin C (I think) on mice with no immune systems and found that the mice who were feed each ingredient in normal food doses were significantly less likely to develop breast cancer tumors, and when they did they were much smaller. As they introduced each one, the rate of cancer went from 100% to 10% when the mice got all four at once. I don't take supplements, but I'd like to know that all my efforts at eating an \"anti-cancer\" diet may have some affect, or at least will not be harmful. Mimi",
      "MessageIndex": 0,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165554",
      "Title": "New Article on Vitamin Study: Thoughts?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "You're hilarious, Claudia. I will represent you at the condo pool. I do envy that you live so close to the beach. I always pictured myself living by the ocean, drinking tea as I looked out at the sunrise in the morning. Basically, like one of those commercials for an allergy medication, depression pill, or tampons. Mimi",
      "MessageIndex": 14,
      "PostDate": "20/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166475",
      "Title": "CONFESSIONS OF A GOOF"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "But unless you have experience in weaving wigs or something similar, I think it would be fairly difficult to make it look decent. Maybe you could take it to a wig shop and have them do something like that?",
      "MessageIndex": 1,
      "PostDate": "02/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/176749",
      "Title": "When I cut my hair..."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "It beautifully demonstrates how important we are to the people in our lives. Mimi",
      "MessageIndex": 7,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199077",
      "Title": "A quote I thought I would share"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I have a little scar from the port surgery and a bump where the port is implanted. The day after my port surgery, I went for a weekend stay at a hot springs resort and took a dip in the springs-fed indoor pool. My scar and bump were visible in my bikini, but I didn't care -- the water was so soothing.",
      "MessageIndex": 19,
      "PostDate": "18/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165221",
      "Title": "Port and Chemo"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Will be thinking about you today. There can be many reasons for unusual bilirubin numbers, most of them not too serious. Please let us know about the results, if you feel like it. Mimi",
      "MessageIndex": 4,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168290",
      "Title": "Ultrasound tomorrow"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "You have talked about your precious daughter before, and I can't imagine the heartbreak you must feel at this anniversary. I think you have the right idea to turn off the phone and just have quiet reflection and loving memories of your daughter. We are here for you during this difficult time. Mimi",
      "MessageIndex": 2,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183388",
      "Title": "Tomorrow (tonight) is a bit tough...."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I am wishing you and your family the very best through this very difficult time. You cry when you need to. Also, I think it's a good idea to ask your doctor for a prescription to help you through this. That is what they're there for. I don't know what I would have done without Xanax and Lexapro through treatment. I don't take the Lexapro anymore, but I still take Xanax as needed. For instance, I'm going in for my annual MRI today and you better believe I'll be popping a xanax before I go in. I'm thinking of you. Mimi",
      "MessageIndex": 17,
      "PostDate": "10/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191789",
      "Title": "back to chemo on Monday 5/10/10"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "So sorry you are dealing with this again. But let me tell you that recurrences do happen and are usually treated successfully. You have every reason to be hopeful that chemo and/or radiation will knock the cancer out. Aggressive cancers respond best to chemotherapy. I had an aggressive cancer from the get-go. We fought it aggressively and I'm doing great now. I know you're scared but you will make it through this part of the journey, too. Let us know what your treatment plan will be. Lots of hugs. Mimi",
      "MessageIndex": 13,
      "PostDate": "03/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187252",
      "Title": "BC reoccurence"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I am so sorry you are down and having these issues with relatives and your mobile home. It just seems like everything at once sometimes, doesn't it? As many women here can attest, the people who are supposed to care for us the most can disappoint and hurt us the most, too. I think it stinks that your nieces and nephews have not supported you very well. People are often wrapped up in their own lives and problems and don't even realize that others need help. Not that it's an excuse. They should have reached out more and asked what they could do for you. They should have called, sent letters, and visited. Can you talk to them or have another relative talk to them? They may not know how much you really need them right now. Sometimes it just takes a reminder to jolt people out of their own lives. Since they are on facebook, can you send them an email saying that you miss them and would appreciate their help? You helped raise those kids and they should be willing to help their aunt right now. They may appreciate specific instructions from you, like asking them to see you when they visit their father in a few weeks. I hope they come around, Pat. Mimi",
      "MessageIndex": 1,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170588",
      "Title": "Pity Party"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I am thinking good thoughts for you today. Let us know how it went when you can. Mimi",
      "MessageIndex": 9,
      "PostDate": "10/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169678",
      "Title": "For Pammy"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I cannot imagine how this must feel, Kathi. I send thoughts of peace and love to you. You have helped me so much in the short time that I've corresponded with you on this board, that I can imagine what a great mom you are and how much you have hurt for your daughter. I hope it is some comfort to you that your actions may have helped others in that facility. Mimi",
      "MessageIndex": 9,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164595",
      "Title": "My daughter Stephanie's lawsuit settled..."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "So sorry to hear this from Facebook. I haven't been on CSN for years, but I've been in touch with Chen and several of you. Wishing her well and feeling so heartbroken.   Mimi",
      "MessageIndex": 7,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://csn.cancer.org/node/261005",
      "Title": "Chenheart -- Any word, or updates?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I am very excited for you and thinking good thoughts on a speedy recovery. Please let us know how thing went when you can. We are all with you. Mimi",
      "MessageIndex": 3,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165854",
      "Title": "A Note From RE"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "It sounds like you've been through a lot. Almost done with chemo, though! I don't have experience with Lupus or Chron's disease, but I know there are a few ladies here who are also dealing with either of these conditions. Hopefully one of them will chime in. Good luck and keep posting. Mimi",
      "MessageIndex": 1,
      "PostDate": "21/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184356",
      "Title": "Breast cancer, bilateral mastectomies and Lupus"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "You guys are making me reminise about the good old days -- I mean the bad old days. The nose thing: yes, I remember all my nose hairs falling out and having a runny nose all the time. My eyelashes actually fell out several weeks after chemo ended. They have since grown back, but they are not as long as they used to be. Ask your onc. about which drops to use. There has to be something out there that helps. Good luck to you all. Mimi PS. Judy, I have that same IKEA cat tent and a similar looking cat!",
      "MessageIndex": 14,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179511",
      "Title": "Chemo Chicks"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I think you'll find that many of us here have had ports. It's easier on the veins and many doctors do recommend them. I had a very easy time with mine and had it removed a month of so after treatment ended. You'll probably get a variety of prespectives here. Good luck! Mimi",
      "MessageIndex": 1,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211318",
      "Title": "any thoughts on portacaths?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Sounds like you really made up for your day of snake fright! Shopping and planting sound great and just what you needed.",
      "MessageIndex": 26,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I'm sorry you are going through these continuous surgeries for scar tissue. I have not had that experience, but it must be very frustrating. Congrats on being a long-term survivor! If you would like, please start a post introducing yourself. There are many wonderful women here who would love to welcome you. Mimi PS. The post you replied to is over a year old, so you might not get a response. It's easy to dig up old posts and not notice the date. We've all done it. In fact, once in a while we'll see one from 7,8,9 years ago on the front page!",
      "MessageIndex": 10,
      "PostDate": "17/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/163450",
      "Title": "Results of CTScan"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I was hoping the mammogram would be totally clear. But still, Pat, the sonogram showed what could be a cyst or hematoma, so please don't despair yet. We are here for you no matter what. But I am still holding out for totally benign. Mimi",
      "MessageIndex": 9,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176273",
      "Title": "Definitely NOT Dancing With Ned"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I went through chemo last winter, worked full time, and thankfully didn't get the flu. I have something against the shot. I'm not in any high risk group, so I won't get it this year either. I think my husband gets it every year, though.",
      "MessageIndex": 6,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175843",
      "Title": "Got my Flu Shot today, did you get yours?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I am sorry for this latest news. Going through diagnosis is so hard because each bit of new news can be like another blow. The tests, the waiting, the wondering... I remember being told that my cancer would respond to hormone therapy and then being tested again only to find that it is a type of aggressive cancer that does not respond to hormone drugs. I thought I knew my diagnosis, so this new news devastated me. I do know how it is. The good news is that they only found it in 2 lymph nodes. Vascular invasion does not necessarily mean that the cancer has metastasized. There are many women here with lymph node involvement and/or vascular invasion that do not have distant metastis. I know it is hard, but try not to panic before the PET scan. In any case, you and your doctor are attacking the cancer aggressively. Avastin may be a breakthrough drug, so it is good that you're in the trial. Mimi",
      "MessageIndex": 1,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166240",
      "Title": "+ on Lymph Nodes => Blood Vessel => PET scan"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "LOL. This what I thought, too! Mimi",
      "MessageIndex": 196,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Joy, I don't know the answer to that. Your doctor may use bisphosphonates along with the chemo to help strengthen the bones. I found this quote on the American Cancer Society site about bone metastasis: \"If systemic treatments work (meaning chemo), the symptoms of the bone metastases will go away and new symptoms are not likely to develop soon.\" But let's not assume you have bone mets yet. It's unlikely given that only 2 nodes are positive for cancer. Can you take something to sleep? I went through this when first diagnosed. Your adrenaline and \"fight or flight\" response is probably through the roof right now. But you need sleep to fight this thing. Mimi",
      "MessageIndex": 2,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166240",
      "Title": "+ on Lymph Nodes => Blood Vessel => PET scan"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "LOL. This what I thought, too! Mimi",
      "MessageIndex": 46,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "There are two kinds of mouthwash they can give you. One is a preventative (caphasol, I think) and the other \"Magic Mouthwash\" is for the sores you do have. I had trouble swallowing at first, too. It was very annoying and sometimes painful. How about eating soft, liquidy foods like applesauce and mashed potatoes? Can you do smoothies? The swallowing problem gradually went away for me. I wish you luck. Mimi",
      "MessageIndex": 3,
      "PostDate": "05/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187419",
      "Title": "need suggestions on how to get water into my body"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Things will get better. I can tell you that for sure. Being down in the dumps, depressed, scared, and hopeless is very normal right now. You just have to get through these emotions. You're human and feeling this way is par for the course, unfortunately. But it will absolutely get better. Most of us here were bald at one time or another or are currently bald. I am wearing a wig right now as I write to you from work. I finished chemo in April and radiation in June, and my hair is almost long enough to ditch the wig. When I started this process I thought that I would be depressed, hopeless, sad, bald, and sick forever. Then I came on this site and saw all the wonderful women (and some men) who were getting on with their lives, who had finished treatment and were LIVING. I didn't believe I could ever be one of them. Not me. But, you know what? Now I'm done with treatment, too. Now, I have joy and laughter in my life again, too. This will happen to you, Linda. Now it's a difficult time. Let us help you through it. Soon you will be on the other side of this. Believe it and hang on. Mimi",
      "MessageIndex": 3,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172107",
      "Title": "Hair loss is getting me down"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "LOL. This what I thought, too! Mimi",
      "MessageIndex": 146,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "LOL. This what I thought, too! Mimi",
      "MessageIndex": 96,
      "PostDate": "28/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I'm not sure Maureen will respond. If you'll notice, she posted about acupuncture in 2002! I hope she's doing well as a 7-year survivor today! I would say to go for the acupuncture. I've heard it can have very good results for nausea, pain and other chemo side effects. I wish I had done it while going through treatment. You might want to ask your onc. if she recommends anyone. Acupuncture is practically mainstream medicine these days and doctors even have referrals. Good luck with treatment, and keep posting! Mimi",
      "MessageIndex": 5,
      "PostDate": "28/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/138982",
      "Title": "Chemo 1 Down, 3 to Go!! How about Acupincture??"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "August 23rd for me, too. I will be 36 this year. Still can say mid-30's, I guess. You know I used to dread getting older (\"oh my god, I'll be 40!\"), but now seeing 40 will be such a BIG celebration! Hugs to all you birthday girls. Mimi",
      "MessageIndex": 97,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I didn't know she was triple negative. Wow. After treatment anxiety was really unexpected for me. It's a huge challenge that I am still processing after 2 years. I will try to find the article. Mimi",
      "MessageIndex": 2,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212309",
      "Title": "Interview with Robin Roberts on post-treatment anxiety & depression"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I think the feeling of dread will come and go for us. Like you, I have found joy again, but then something happens and I am back to questioning whether I will ever be rid of this disease and its aftermath. Congrats on being 22 months post treatment! As you know, your risk drops after a few years as a triple negative. I'm 2 years 3 months past diagnosis and 1 year 8 months past all major treatments. Not that I'm counting or anything. :) Mimi",
      "MessageIndex": 4,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212309",
      "Title": "Interview with Robin Roberts on post-treatment anxiety & depression"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "August 23rd for me, too. I will be 36 this year. Still can say mid-30's, I guess. You know I used to dread getting older (\"oh my god, I'll be 40!\"), but now seeing 40 will be such a BIG celebration! Hugs to all you birthday girls. Mimi",
      "MessageIndex": 47,
      "PostDate": "26/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/184886",
      "Title": "When is your Birthday?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "That sounds great, Teena. I'm glad you know the people to lean on and the people to tune out right now. That in itself is crucial and hard to do.",
      "MessageIndex": 31,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168677",
      "Title": "I am so dissapointed in my family"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Jackie, I am sorry this is happening to you and that your sister cannot be more supportive. Of course, she should be. They should be be taking care of and supporting you now. You have been the family caretaker and it's your turn. I guess sometimes when you take on a certain role in the family (being the reponsible one, for example. Or, in the case of your sister, the baby of the family with no responsibilty, perhaps), it is difficult to change. Seeing you, the one who always took care of others, need care yourself is probably disorienting and scary for your sister. She might not be capable of shifting her place in the family. Given all that, I think Rita is right on the mark. You cannot change your sister and it will hurt to even try. The best you can do is to tell her sincerely how her actions have made you feel and hope that she can find it within herself to change. If not, you must let it go. Once you give up the idea that you have control over this issue, maybe you can find some peace with it. I don't know. I can feel your pain in your posts, but maybe try to accept that this is all your sister is capable of giving, for whatever reason. That is not to say that her actions are acceptable or that you have to put up with it. You can choose to limit contact if that's the way to protect yourself, but know that her actions are HER issue, not yours. You are doing the right thing. I'm sorry this has made you feel so bad. Mimi",
      "MessageIndex": 22,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168677",
      "Title": "I am so dissapointed in my family"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "diagnosed at 34. I had never had a mammogram, but all of the sudden I had a huge lump in my left breast. They take it seriously when it grows that fast. I had very little family history and initially had a hard time getting a mammogram, but I insisted. Unfortunately, it is not as unusual as you may think to have breast cancer in your 30's and even 20's. And, tragically, young breast cancer is more aggressive breast cancer. It's a different beast in young women and more of them die. So, it's important to be vigilant.",
      "MessageIndex": 2,
      "PostDate": "19/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175916",
      "Title": "Mammogram for the under 40"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Sorry to hijack, but what is up with all the cleansing and bleeping of posts? We're all adults here, aren't we? I can't say a \"bad word\" here without seeing ****? Sometimes colorful language is the best way to express how we feel. Rant over. Sorry. Mimi",
      "MessageIndex": 23,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168677",
      "Title": "I am so dissapointed in my family"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Ha ha. Good idea!",
      "MessageIndex": 25,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168677",
      "Title": "I am so dissapointed in my family"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Wow, a lot of strong opinions on this topic. Jamie, if you're still reading, please let us know what you've decided. You've certainly received lots of advice and heard different experiences. I had chemo. There wasn't a lot of hesistation for me since I had an extremely aggressive tumor that wouldn't respond to hormonal therapy or Herceptin. So, chemo and radiation were all I really had. You need to find out the facts before you decide. What is the pathology of your tumor? What stage are you? What are your recurrence risks with and without certain treatments? What about hormone receptors? Unlike what some here have suggested, having or not having chemo is not as simple as deciding that it's toxic, and therefore unacceptable. What an uninformed opinion. Yeah it's toxic. But it's also toxic to cancer cells. It's a known killer of cancer, as is radiation. For me, what was unacceptable was dying of cancer in my 30's. I'm 14 months from diagnosis and feeling great. Did I love chemo? No, but I made it through. I now have pretty, short curly hair. I go to the gym every day. I take vacations. I relax with my husband, and I have a good life -- a life that was given to me through conventional cancer therapy. Yes, I also avidly read research on nutrition therapy and am very careful to eat \"cancer fighting\" foods, teas, and get plenty of exercise. I believe in alternative therapy, but not in lieu of other life-saving treatments. They can work together. Of course, you have every right to refuse chemo. Sometimes the risk isn't worth the benefit. It's a decision to be made with your doctors in the light and with the facts, not with fear and magical thinking. I wish you luck on this journey. Hugs. Mimi Edited to add: my comments are not aimed at anyone who made an informed decision to refuse chemo, just at the attitude that chemo is bad because it makes your hair fall out and that's that.",
      "MessageIndex": 33,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/182624",
      "Title": "Has anyone out there refused chemo?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Wishing your pain-free days, dear. Mimi",
      "MessageIndex": 35,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198623",
      "Title": "Update BJmom"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Jamie, I am triple negative, too, stage 2a, no nodes. You need chemo. You have every right to refuse it, but any oncologist will tell you that you need chemo. Get a few more medical opinions to round out your thinking. Talk to your doctors. Can you tell me what you're specifically afraid of with the chemo? I was afraid, too. Terrified in fact. But I made it through just fine. It's especially important that triple negatives have chemo b/c that is our entire arsenal. And chemo is particularly effective on us. My best to you with this.",
      "MessageIndex": 32,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/182624",
      "Title": "Has anyone out there refused chemo?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "This is good to know. Homeless people have so little, we can often overlook their very basic needs, such as eating utensils. I like Chen's idea, too, of making food that is ready to eat like sandwiches and including plastic forks with her lasangna. These touches often make all the difference. Great ideas. Mimi",
      "MessageIndex": 1,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177561",
      "Title": "Mimi and Chen ... and food"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Definitely mention this to your radiation oncologist. Nausea is not common with rads, I don't think, but your doctor should know. Good luck and I hope the symptoms go away. Mimi",
      "MessageIndex": 4,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184861",
      "Title": "Nauseated with Rads ???"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "This is a great point, and I wanted to re-iterate. This isn't to pressure or impose our own beliefs on you, but just to let you know our own varied experiences and opinions in this stressful world of breast cancer. Clear margins are great and I truly hope your surgery is completely successful on this front. But radiation (and chemotherapy) is not just for cancer that we know is there. I had clear margins, yet I am in the middle of six treatments of strong chemotherapy. Technically, I don't have any cancer in my body, but I was stage 2 with an aggressive cancer, so my risk of recurrence -- while still low -- is not acceptable to just leave without further treatment. Like young one said, the goal is to remove even microscopic cancer cells. Thankfully, you will not need chemotherapy. I look at it this way: surgery crushes and removes the beast; chemo and radiation disinfect and secure the house so that it is not welcome to return. Hope we can all help you here. Mimi",
      "MessageIndex": 4,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164676",
      "Title": "Is there anyone that had a wide excision for DCIS stage 0 & had clear margins?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "So happy that this anniversary finds you healthy and happy. You've helped many people here and for that I thank you. Many, many more years to come. Mimi",
      "MessageIndex": 10,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173042",
      "Title": "To perhaps relieve some ambivalence..."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Haven't heard from you in a while. Hope all is well! Mimi",
      "MessageIndex": 1,
      "PostDate": "20/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184325",
      "Title": "Pammy How was returning to work"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "But, personally, I agree with Derbygirl. No one is saying that cancer treatment is fun or convenient, and you have to weigh the risks of treatment versus the benefits. Your doctor is trained to make these assessments and will give you his or her opinion. You can get more than one, and you should if you are uncertain. But if radiation will significantly help you, just remember that it is a finite time of hassle and discomfort. Then it is over and you have fought to give yourself the best outcome possible. It may not seem like it now, but treatment will end and you will return to your normal life. Many of us even return to that life during treatment! Don't let everything overwhelm you. You will handle it just fine. Mimi",
      "MessageIndex": 2,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164676",
      "Title": "Is there anyone that had a wide excision for DCIS stage 0 & had clear margins?"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Claudia, you should scan those old pictures into your computer so you have them electronically as well. Really easy if you have a printer that is also a scanner (most of them are). I have begun to study film editing for fun and I can put them into a little quick time movie for you with music. Offer open to anyone. Just beware that I am not a professional. LOL. Mimi",
      "MessageIndex": 22,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I do understand that urge, Claudia. But please don't let this delay you from marrying your Reggie! Maybe you can have a very discreet photographer, or even just a friend who is good with the camera. This person can take some candids at the wedding, without you even noticing very much. And you don't even have to do any posed photos. The candids are the best anyway. Then, you can either look at them or pretend they don't exist. Good for the descendants, as Marcia says. Mimi",
      "MessageIndex": 31,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Claudia, you should scan those old pictures into your computer so you have them electronically as well. Really easy if you have a printer that is also a scanner (most of them are). I have begun to study film editing for fun and I can put them into a little quick time movie for you with music. Offer open to anyone. Just beware that I am not a professional. LOL. Mimi",
      "MessageIndex": 59,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I want to do something like this as well. One of my relatives put together a bunch of pictures and then set them to the song, \"The Rose.\" It was horrid. Just awful. The pictures weren't even well selected. So, I want to do something a little better than that. I love that gift idea, though. I'm sure your relatives were so appreciative. You can't buy those memories.",
      "MessageIndex": 32,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I do understand that urge, Claudia. But please don't let this delay you from marrying your Reggie! Maybe you can have a very discreet photographer, or even just a friend who is good with the camera. This person can take some candids at the wedding, without you even noticing very much. And you don't even have to do any posed photos. The candids are the best anyway. Then, you can either look at them or pretend they don't exist. Good for the descendants, as Marcia says. Mimi",
      "MessageIndex": 68,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Wow, those are some great looking kids, Natly.",
      "MessageIndex": 5,
      "PostDate": "18/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186253",
      "Title": "New photos of Brooke and Charlie"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I want to do something like this as well. One of my relatives put together a bunch of pictures and then set them to the song, \"The Rose.\" It was horrid. Just awful. The pictures weren't even well selected. So, I want to do something a little better than that. I love that gift idea, though. I'm sure your relatives were so appreciative. You can't buy those memories.",
      "MessageIndex": 69,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I am really sorry you are going through this stress right now. When do you see your onc? Please hang in there until you get the facts from your doctor. Much love and hugs. Mimi",
      "MessageIndex": 18,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I am really sorry you are going through this stress right now. When do you see your onc? Please hang in there until you get the facts from your doctor. Much love and hugs. Mimi",
      "MessageIndex": 69,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Jan, I am on my third week of radiation and my eyebrows and lashes seem to continue their thinning. The hair on my head is coming back, however, and yesterday I noticed a few hairs starting to grow on my legs. So I'm in the same boat... Mimi",
      "MessageIndex": 14,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168702",
      "Title": "Eyelashes"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I thought I would \"breeze through\" as well. I even planned a weekend away. Well, let me tell you I was holed up in the hotel room for most of the weekend. Same symptoms as you. I had planned to live it up, go to the hotel spa, and drink martinis at the hotel bar. Didn't quite work out that way... My best to you for next time. It should get better, right?! Mimi",
      "MessageIndex": 8,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176069",
      "Title": "Zometa round 1, laid me low"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Best of luck, Sherry. We look forward to hearing from you soon. Mimi",
      "MessageIndex": 4,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169750",
      "Title": "Butterfly12 (Sherry) June 11 surgery"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Surf, I finished TAC in April and my eyelashes and brows have started falling out in earnest now, weeks after the last chemo session. I have almost no bottom lashes and my big ole' bushy eyebrows are thinned out. I sympathize. I have a friend with non cancer related hair loss who uses eyebrow pencils to great effect. At least ours will grow back! BTW, the hair on my head IS growing back. Mimi",
      "MessageIndex": 6,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168702",
      "Title": "Eyelashes"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "My wishes for benign results on Friday, ladies. I like Austin's attitude of staying in the \"now.\" Keep it up and let us know how things went. Mimi",
      "MessageIndex": 11,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/169034",
      "Title": "Biopsy on Friday"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Ladies, I would like to make something for Laurie. I was thinking of a collage with everyone's picture wearing their scarf, or maybe even a video of some kind, set to music. What do you all think? Would people be OK sending me pictures of themselves with the scarves on? If so, I can PM those ladies with my personal email account. Hope there's enough interest out there. I will, of course, send everyone a copy and try to post it on here if all agree to that. Just an idea. Mimi",
      "MessageIndex": 0,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173664",
      "Title": "For all who have received a scarf or headwrap from Laurie...."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Welcome. There are women here from all stages of cancer, although not as many stage IV ladies. This is a general board and we discuess everything, from treatment and diagnosis to life after cancer, and our personal lives. You are most welcome here. I do second the notion of also getting in contact with a stage IV group, whether online or in person. They will have more answers to your specific questions. We all support each other here, but we are a diverse bunch, too. For instance, because I am on the younger side, I also belong to a support group for women under 40. There I get unique perspectives to some of my more specific concerns. You can never have enough support! Mimi",
      "MessageIndex": 9,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167298",
      "Title": "New to board"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "These may not help you on your walks with Joe and the dogs, but...: http://www.katespade.com/product/index.jsp?productId=3496698&cp=1855192.1991455&parentPage=family",
      "MessageIndex": 24,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "These doctors are always coming up with different terms. Rest assured that NED and NERT are one and the same and they do both the waltz and the hokey-pokey. So, dance, girl, dance!! Have a great week! Mimi",
      "MessageIndex": 9,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189598",
      "Title": "Hands off, girls -- NED is all mine today!"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "You need to know the \"whys\" of what is going on in your situation. a mastectomy after chemo is pretty standard practice, especially if there is residual cancer after treatment. Even if there isn't, you'd want to at least remove the tumor bed. Your tumor might have been too big for a lumpectomy, or there might be other issues, like a bit of cancer left after chemo. These are all good reasons for mastectomy. You've gone through difficult treatments to erdicate the cancer. You don't want to undo all that hard work and considerable suffering by leaving cancer in your body (if that's the case). It is ultimately your decision, but get all the facts first. Ask your doctor why you need a mastectomy; what the biopsies showed and what would happen if you didn't take the surgery. Also mention your fears of infection. Many people have surgery without infection, even if they have had them in the past. Good luck. You're going through a lot right now, but please get all the information you need to make an informed decision. Mimi",
      "MessageIndex": 2,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189703",
      "Title": "Does anyone ever say no. . ."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Yes, it's everything. VickiSam is right, when you add up all we have gone through, it's a wonder we are still going strong. I'm glad you and your hubby were able to find humor. That is key, I think. BTW, my husband is the same way. He does a lot around the house, but wants to do it when he wants to do it. I guess I'm the same, so I can't complain too much. We recently hired a cleaning service to come in twice and month and it's been a god-send. I hope you have a wonderful time with your son and his family. Mimi",
      "MessageIndex": 5,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179573",
      "Title": "Bald Headed Dictator"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Very happy to hear that you and the Moopster walked through the front door of your precious home last night. What a nice feeling that must be. I hope that this weekend you will relax, take in the familiar surroundings and watch as the pups re-discover their favorite place. Wishing you peace and joy in this new phase of your lives. Mimi Edited to add: oh and I remember that little thing that Claudia mentioned, too. When will you get to that, huh?!",
      "MessageIndex": 12,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173685",
      "Title": "Home from St. Louis... at last!"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I'm sure you were ready to get it over with. Best wishes to you for Friday. Try to put it out of your mind until then. Mimi",
      "MessageIndex": 2,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194854",
      "Title": "Broken Mammo Machine!"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Yes, this happens to most people. Doctors will tell you that recovering completely can take the same amount of time as all your treatments. So, if you had chemo and radiation for six months, it will take another six months until you are fully better. This doesn't mean that you will have the same level of fatigue for six months, but that it will gradually fade over that time. I am just now beginning to feel some residual chemo effects, 2 months post-treatment (I'm still undergoing rads). Just let it run its course. It WILL get better.",
      "MessageIndex": 7,
      "PostDate": "12/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169811",
      "Title": "So, if i'm done..."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I saw your post on YSC. Thanks for posting it here. I think it's important for women to have choices in their treatment. With TN it's even more important not to limit our already limited options. I hope we will continue to have this option. Mimi",
      "MessageIndex": 1,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201485",
      "Title": "Triple Negative Breast Cancer and Avastin"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "Thanks for updating us. I, too, have been wondering. So sorry to hear of the pain and swelling. I am thinking that the mammo and MRI will diagnose the problem and let you move on to treatment and recovery. Have a wonderful weekend, my dear. Mimi",
      "MessageIndex": 6,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173693",
      "Title": "((( CLAUDIA )))) AKA ((( CHENHEART))) Just following up.."
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "I didn't lose my eyebrows and only lost the lashes after chemo ended. Everything is now back. I wish there was a miracle cream through, especially for the hair on your head! Good luck. And I agree, spend that $$ on some cute scarves. Mimi",
      "MessageIndex": 10,
      "PostDate": "20/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184306",
      "Title": "Brian Joseph's Lash & Brow Gel???"
    },
    {
      "AuthorID": "mimivac",
      "AuthorURL": "https://csn.cancer.org/mimivac",
      "Content": "It's hard for me to write this because it makes me feel like such a failure. I've been having a hard time coping lately, and it's why I haven't been posting much. I'm pretty sure my hormones are out of whack and that I may be about to emerge from chemo-induced menopause. This has made me extremely emotionally unstable. I'm very angry, at times. I imagine that my friends now pity me and feel that as bad as their lives can be, at least they're not me -- the poor, pathetic, sick one. I wish that no one knew about my breast cancer. There are many things that I fall short of: I wish I were perfect with my diet and exercise; I wish I would re-start my passion for filmmaking; I wish I could be happy and content the majority of the time. But I'm not. I feel that I'm on the outside of life looking in at all the happy people and unable to join. I have always been a perfectionist and this disease has really augmented those tendencies. I want many things. I want to be strong, fulfilled, happy, stable, smart, productive, healthy, consistent, and content. I am far from there. Ok, that made me feel better. I really just wanted to get it out and knew this was a safe place to vent. Thank you. Mimi",
      "MessageIndex": 0,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174090",
      "Title": "I'm having a hard time..."
    }
  ]
}