{
  "AuthorID": "Minka",
  "AuthorURL": "https://csn.cancer.org/Minka",
  "Posts": [{
    "AuthorID": "Minka",
    "AuthorURL": "https://csn.cancer.org/Minka",
    "Content": "Hi all. What is happening to me has happened all in three weeks. Felt a lump which got bigger fast, called the doc who set up 'diagnostic mammo w/ultrasound' ..'atypical'.....hollow core needle biopsy 4 days later....again pathology 'atypical'.....lumpectomy 2 days later.....pathology 'atypical' showing invasive cancer on one side of the perimeter tissue and non-invasive in situ on the other. My surgeon wanted to 'take a little more tissue and a couple of lymph nodes\" to finish the staging and told me I'd have to have chemo and radiation. I said no. I want the entire breast removed....both if they'll take them. My oncologist is kind and says if I want 'em gone, I should be able to get 'em gone. He called the surgeon who agreed to take the one, which is happening this Thursday. No one but a kind sister on this website has given me any information on what to expect from having the masectomy. (Thank you Cinnamon...I went and got zip and button front gowns today). I'll be off work for 6 weeks...but other than that, I'm clueless. I'm not letting many know, but I'm really frightened. I have good moments....and I joke a lot (getting eyes tattooed on the back of my head if I lose my hair...always told my kids they were there, might as well have 'em)... to crying my heart out. I'm not scared of surgery...I've had a ton. No thyroid, c-section, doctor blew my colon during a colonoscopy and didn't find it for a day so I went septic...and even more. But....my son, daughter-in-law, and 4 grandkids live 900 miles away and I don't want to be without them. Selfish to a degree.....but I want them here nonetheless. I cry just thinking of them. There is no cancer in my family. This came out of the blue. I know there is a purpose behind everything that happens in life....and I know I'll figure out what this one is sooner or later, but right now I want to curl up in a ball and sleep...and sleep....and sleep. Thanks for listening.",
    "MessageIndex": 0,
    "PostDate": "17/07/2011",
    "ThreadURL": "https://csn.cancer.org/node/222640",
    "Title": "Two cancers in one breast.....overwhelmed and scared."
  }]
}