{
  "AuthorID": "mjfromtx",
  "AuthorURL": "https://csn.cancer.org/mjfromtx",
  "Posts": [
    {
      "AuthorID": "mjfromtx",
      "AuthorURL": "https://csn.cancer.org/mjfromtx",
      "Content": "I'm from San Antonio also. I had my treatments with Dr. Lang at the Start Center on Medical Dr. She was at 7979 Wurzbach but moved to the Medical Dr. location in January. Good to meet all of you from here! My last chemo round was Jan 5th and I don'th have to have any rads. The fatigue was hard for me too, I just slept when I needed to and that helped a lot! MJ",
      "MessageIndex": 5,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166762",
      "Title": "my choice to do chemo????"
    },
    {
      "AuthorID": "mjfromtx",
      "AuthorURL": "https://csn.cancer.org/mjfromtx",
      "Content": "Hi everyone! As many of you already know, I had a mastectomy almost two weeks ago with lymph node dissection. I have my pathology report and wanted to share: 1 positive Lymph node Stage II (not sure if A or B) They took 16 nodes in all with the one being positive. I am a 'triple negative' meaning I do not test positive for estrogen, progesterone, or HER2/neu factor. Dr says I will not need radiation but would need some kind of chemo. I see an oncologist this Thursday at 9am. What can I expect from this oncology visit Thursday? I think these results are good in that they got all the cancer with the mastectomy and the lymph node dissection, but they think I still need chemo. Is this true and why? Any thoughts you can send my way would be great! Thanks! MJ",
      "MessageIndex": 0,
      "PostDate": "09/09/2008",
      "ThreadURL": "https://csn.cancer.org/node/162227",
      "Title": "Surgical Pathology Report"
    },
    {
      "AuthorID": "mjfromtx",
      "AuthorURL": "https://csn.cancer.org/mjfromtx",
      "Content": "Good luck on the second opinion! I just came back from MDA and they were great there! Hard to make the switch but it is worth it and be true to yourself. Trust your instincts. I know mine are usually right on!! I totally understand the med rec thing...just went through that to get into MDA. Quite the challenge but you are totally worth it. Prayers and hugs coming all the way from San Antonio tx! MJ",
      "MessageIndex": 14,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198639",
      "Title": "Update on my reoccurence"
    },
    {
      "AuthorID": "mjfromtx",
      "AuthorURL": "https://csn.cancer.org/mjfromtx",
      "Content": "Since I have triple negative breast cancer I did not take any hormone drugs. They would not have helped my cancer type. Now that I have recurrance I will be looking for a new regimen to stop the new tumor growth. Breathe, pray, rest, relax, smell the roses, one day at a time. MJ",
      "MessageIndex": 14,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198598",
      "Title": "reoccurance question"
    },
    {
      "AuthorID": "mjfromtx",
      "AuthorURL": "https://csn.cancer.org/mjfromtx",
      "Content": "I am currently taking Avastin to reduce the tumors in my two lungs, two lymph nodes, and abdomenal tumor. I am very glad they gave the 90 days so I can find out it if works for me. I am also TN and recurrant having been dxed stage 2 in 2008. Right now I am battling lots of fatigue from the Abraxane/Avastin regimen. I have my next scan 10 4 10 to see what is going on. MJ",
      "MessageIndex": 3,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201485",
      "Title": "Triple Negative Breast Cancer and Avastin"
    }
  ]
}