{
  "AuthorID": "mmontero38",
  "AuthorURL": "https://csn.cancer.org/mmontero38",
  "Posts": [
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Congrats, Kathi. Sooo happy for you. Post a picture on your web page after the event so we can see your dress. Hugs, Lili",
      "MessageIndex": 1,
      "PostDate": "05/03/2008",
      "ThreadURL": "https://csn.cancer.org/node/157129",
      "Title": "Look for me on the catwalk!!!"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "I knew exactly what she meant since it was addressed to me. HAHAHA!!! Gotta love it. Hugs, Lili",
      "MessageIndex": 2,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/165927",
      "Title": "Too funny"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Mimi, my oncologist said I should eat a healthy diet which included very little red meats, lots of fish and chicken, lots of green leafy vegetables and fruits. I also take a multi-vitamin every day and my calcium. I exercise 6 days a week now and do some weight lifting for strength. You're mediterranean and so am I so following that diet should not be difficult and we reap many benefits from it. The article meant to say that we shouldn't replace with a pill the benefits of eating the actual vegetable or fruit which is the natural source of the vitamin. You are doing the right thing by eating healthy and once you are done with ytour treatments and start feeling better, you'll have more energy to do some excercise. Hugs, Lili",
      "MessageIndex": 3,
      "PostDate": "17/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165554",
      "Title": "New Article on Vitamin Study: Thoughts?"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "You can wear a regular bra...I went to a store that could fit me with the correct size.  You didn't say when you finished your surgery, but I was wearing a bra about 6 weeks after my reconstruction.",
      "MessageIndex": 1,
      "PostDate": "07/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288465",
      "Title": "Bra for Right side Mastectomy"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "I don't know Vicki but would Desitin or Balmex work? After all we do use it on babies and kids for diaper rash. I don't think it would have any adverse side effects to try it and it may give you some relief. Also, you might want to try a natural laxative such as metamucil or citracel or even senokot tablets which are all natural to help with constipation. I had that problem and my oncologist recommended Senokot tablets. It worked within 24 hrs and then I took it while going through chemo. Hugs, Lili",
      "MessageIndex": 12,
      "PostDate": "14/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175624",
      "Title": "Need help ..sensitive subject .. private area is raw and inflamed from constipation (5 days with movement) .. I need help"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hey Cindy: Miss you in chat. I had my reconstruction and now scheduled the second surgery for May. My first year anniversary is coming up soon and am so glad for you going into your 6th year. All of you long time survivors give us lots of hope and inspiration. Hugs, Lili",
      "MessageIndex": 3,
      "PostDate": "08/04/2008",
      "ThreadURL": "https://csn.cancer.org/node/157472",
      "Title": "How is everyone."
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Do we have to put on that swimsuit? Aarghhh!!!! Love ya all, Lili",
      "MessageIndex": 7,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166475",
      "Title": "CONFESSIONS OF A GOOF"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "I can just picture your son's face. ROFL! My son also had one of those moments. On one of our trips to the southern coast of Spain, where topless sunning is the norm, my son at the time was 5 and was flabbergasted by all the pendulums swaying. LOL. Very ironic that the old ones with pendulum **** are topless while the young pretty ones are all covered up. Hugs, Lili",
      "MessageIndex": 20,
      "PostDate": "22/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166475",
      "Title": "CONFESSIONS OF A GOOF"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "You can do everything with the port. The port is inserted under the skin so all you see a like a lump where it is. Or at least, that is how mine looked when I had it. Hugs, Lili",
      "MessageIndex": 18,
      "PostDate": "15/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165221",
      "Title": "Port and Chemo"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Nancy: I remember only too well the tenderness and soreness when the port was first put in but you will come to value the port as you go along. It will save your veins from being damaged and having to get an IV in every time. I hope all goes well tomorrow and know you will be in my prayers. Hugs to you dear friend. Lili",
      "MessageIndex": 6,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165221",
      "Title": "Port and Chemo"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "My hospital also had a support group but I was afraid that I would get depressed listening to how bad others had it while I was having an easier time of it. Not that cancer is easy, but there are others out there that are having a very rough time going through it. I was very glad to have happened on to this site and met so many wonderful survivors. Your words, wisdom and experience have helped me and many others get through this. Love you, Joyce. Lili",
      "MessageIndex": 5,
      "PostDate": "25/07/2008",
      "ThreadURL": "https://csn.cancer.org/node/158563",
      "Title": "support in the flesh"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Kathi, there are no words that I can say that would express how sorry I am for your loss. Hopefully, the facility will make much needed changes and insure that this doesn't happen again. Sending much needed hugs your way, Lili",
      "MessageIndex": 6,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164595",
      "Title": "My daughter Stephanie's lawsuit settled..."
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi, can't say I've been on this med but call the pharmacist and ask if this can cause you to have nausea and dizziness. My son was on something similar but in ointment form for a fungus on his leg. I hope you feel better soon. Hugs, Lili",
      "MessageIndex": 1,
      "PostDate": "28/05/2008",
      "ThreadURL": "https://csn.cancer.org/node/157955",
      "Title": "Anyone taking Fluconazole"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "I'm so sorry I couldn't chime in either. I had a conference call for work and couldn't call in. Please set one up for the evening, so that we can all call in. Hugs, Lili",
      "MessageIndex": 15,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172708",
      "Title": "It Was A Great Conference Call Today! :)"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Pat I'm crossing my fingers and saying lots of prayers that it is a benign cyst. Please keep us posted. Hugs, Lili",
      "MessageIndex": 13,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176273",
      "Title": "Definitely NOT Dancing With Ned"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Pat I'm crossing my fingers and saying lots of prayers that it is a benign cyst. Please keep us posted. Hugs, Lili",
      "MessageIndex": 14,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176273",
      "Title": "Definitely NOT Dancing With Ned"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Syl: Glad everything sounds like it might be good. Sometimes, scar tissue can be very dense and cause to have abnormal readings. Keep us posted. Hugs, Lili",
      "MessageIndex": 7,
      "PostDate": "21/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163450",
      "Title": "Results of CTScan"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi CR: I also had swelling in the mastectomy area after the drains were removed. The dr had to aspirate quite a few times before it stopped filling up with fluid. Don't put hot compresses as that will make you swell up more and be a bigger risk for lymphedema. Try putting a pillow under your arm on the affected side to keep it elevated. That helped me some. Luck to you and hugs, Lili",
      "MessageIndex": 3,
      "PostDate": "23/08/2008",
      "ThreadURL": "https://csn.cancer.org/node/161763",
      "Title": "Problem with swelling..."
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "OMG!!!!!! You guys just crack me up. I think Tasha would look good with one of those snake charmer outfits in turquoise of course. LOL Lili",
      "MessageIndex": 35,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Pat I'm crossing my fingers and saying lots of prayers that it is a benign cyst. Please keep us posted. Hugs, Lili",
      "MessageIndex": 12,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176273",
      "Title": "Definitely NOT Dancing With Ned"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Sylvana, hopefully it won't be anything serious. I'll keep you in my prayers. Try not to worry and know that we are here for you. Hugs, Lili",
      "MessageIndex": 3,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163450",
      "Title": "Results of CTScan"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Cindy: Glad you're going back. It means you're going that one step forward in reclaiming your NEW life. I found that it was better to work since it kept me distracted and I didn't have time to dwell on how I felt. I also had an exceptional boss who actually took me to almost all my chemo sessions. Just take it one day at a time and good luck to you on your first day. Hugs, Lili",
      "MessageIndex": 2,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://csn.cancer.org/node/158023",
      "Title": "Going Back To Work"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Aren't kids great? They are our best supporters. You should post the picture on your expressions page. Hugs, Lili",
      "MessageIndex": 2,
      "PostDate": "26/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166704",
      "Title": "Son supported MOM today"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Welcome Ellie to the club none of us wanted to join, but alas here we are. You've come to the right place. We are a wonderful group of survivors here that can probably answer most of your questions from experience. You will find a very supportive group of women and some men that are battling this disease. I was also diagnosed with invasive ductal carcinoma in June, 2007. My tumor was a Grade 3 which makes it very aggressive and luckily I had clean lymph nodes. I went through 8 rounds of adriamycin, cytoxan, 5FU and did not have to have radiation because I opted for a mastectomy. Keep us posted and know we are here to offer support and help. Hugs, Lili",
      "MessageIndex": 9,
      "PostDate": "19/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164740",
      "Title": "Just diagnosed, with tons of questions"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Heather: So glad to see you back posting. First let me state that your little girl looks beautiful and I can't believe how much she's grown. God Bless. I haven't had my ovaries or fallopian tubes removed but going through chemo made me go into menopause overnight. I am also on Tamoxifen for the next 5 years which causes other problems. I have experienced hot flashes sometimes a little on the extreme whereby I am drenched and the operative word here is DRENCHED in sweat. The symptoms were worse in the beginning and it happened more often and now I don't have flashes as often. I know it will be hard for you but you need to realize that if having the hysterectomy improves your chances of living longer than go for it. You have that precious little girl to live a long life for. When I did my reconstruction, I did the tram flap which means you are cut from hip to hip. I will not lie to you and say it was easy. The first 2 weeks were rough but it got easier after that. Did the ob say if you could qualify for a laproscopic procedure or do they have to cut you open? It's a hard decision, but it will improve your chances. Wishing you all the best, Hugs, Lili",
      "MessageIndex": 2,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163429",
      "Title": "I may have already posted this but 125ca #'s up!!!"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Heather, I am sooo glad you posted, you've been on my mind. Sometimes, there are things that are inevitable, but, you are giving yourself a chance to live longer for that beautiful little girl of yours. And, like you said, God will take care of him. You are beautiful Heather. Hugs, Lili",
      "MessageIndex": 6,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163429",
      "Title": "I may have already posted this but 125ca #'s up!!!"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Happy Birthday Shortcakes even if I'm a day late. Hugs, Lili",
      "MessageIndex": 24,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Happy Birthday Shortcakes even if I'm a day late. Hugs, Lili",
      "MessageIndex": 75,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "My dearest Joycelouise: You DID IT. I am so proud of you. I remember reading your first postings and feeling the fear in the words you typed but YOU DID IT. It's done and I couldn't be more proud. It's a rough road to have to go through but look at what you've accomplished. You learned to appreciate the little things in life and not the material. There is nothing more important than our health. A lesson we have all learned here on this board. Congratulations to you sweetie, for your insight, courage, and sense of humor that I've come to love reading your postings. Love you, Lili",
      "MessageIndex": 4,
      "PostDate": "26/05/2008",
      "ThreadURL": "https://csn.cancer.org/node/157920",
      "Title": "plastic beads"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Julia: Sorry you are having such a hard time but I do think you should get the mammo. I am surprised that they haven't ordered an ultrasound also considering that you do have dense breasts. Call the nurse and see what she suggests. Luck to you, Lili",
      "MessageIndex": 1,
      "PostDate": "10/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163423",
      "Title": "Do I HAVE to have a Mammogram?"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Doing the Happy Nekkid Dance. Yikes!!!! What a site. Hugs, Lili",
      "MessageIndex": 23,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173547",
      "Title": "Dancing with NED"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Dear base: I had 8 rounds of cytoxan/adriamycin. I had mine on Friday every 3 weeks. I was good to go back to work on Monday. My suggestion is keep your work area disinfected. If you do desk work buy a jug of lysol wipes and wipe every surface down everyday. Especially the telephone and keyboard if you use a computer. Your first week after treatment try not to get to close to outsiders and avoid crowded places such as movies and malls. I use to go very early to get my shopping done so that I wouldn't be exposed to many people. I didn't need to have radiation since I had a mastectomy but I was told you get very tired about half way through. Schedule the radiation for the end of the day and not in the morning, if you do get tired you are going straight home after that and into bed. Good luck to you and keep us posted as to your progress. Hugs, Lili",
      "MessageIndex": 1,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://csn.cancer.org/node/158219",
      "Title": "Chemo starts 6/26/08"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Thank you RE. You made us reflect on our actions. Wish you had a great Valentine's Day. Lili",
      "MessageIndex": 4,
      "PostDate": "15/02/2008",
      "ThreadURL": "https://csn.cancer.org/node/156933",
      "Title": "HAPPY VALENTINES DAY!"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Dear Dee: I am so sorry for you loss. Sometimes, our kids are so focused on a problem that they don't think to ask for help. To them their problems are insurmountable. Please don't feel that you weren't there for her. Stop and think and breathe a deep breath before you do anything. I hope you have someone near you that can help. Hugs, Lili",
      "MessageIndex": 3,
      "PostDate": "15/10/2008",
      "ThreadURL": "https://csn.cancer.org/node/162911",
      "Title": "plz help"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Wasn;t it wonderful? I walked my first relay on the 20th also. Words can't express how emotional I got walking the survivors lap. I cried the whole time. I met some really wonderful and inspiring men and women there and I too will be doing it again next year. Hugs, Lili",
      "MessageIndex": 1,
      "PostDate": "23/06/2008",
      "ThreadURL": "https://csn.cancer.org/node/158218",
      "Title": "Walked the Relay for Life"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Maureen: I remember having this about 8 years ago. And going back and trying to analyze all I did that day and what I ate after the hives came out, I realized it was tomatoes. I was allergic to tomatoes and that day I had eaten a caprese salad for lunch (tomatoes and fresh mozarella cheese) and pizza for dinner. I had to go to the allergist after that and went through much testing and they discovered my allergy to tomatoes. I am wondering, if you didn't have an allergic reaction to some sort of food? Can you remember what you ate that day that might give you hives? Hugs, Lili",
      "MessageIndex": 9,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166046",
      "Title": "hives"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hoping all goes well for you Austingirl and Kit. Good luck to both, wishing all is benign. Hugs, Lili",
      "MessageIndex": 20,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/169034",
      "Title": "Biopsy on Friday"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Maureen: Have you tried Benadryl? It might give you some relief. Hugs, Lili",
      "MessageIndex": 5,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166046",
      "Title": "hives"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Darn Zah, wish I could say differently.  I'm sure between your endocrinologist and your oncologist they will be able to keep your sugar levels as steady as possible.  Keep fighting my friend.",
      "MessageIndex": 9,
      "PostDate": "07/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288123",
      "Title": "Diabetes and Cancer too!"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "I haven't had experience with Puritan's pride Dee, but I do take a multi-vitamin, 1000 iu of Vit D, and 1200 mg calcium daily. Hugs, Lili",
      "MessageIndex": 1,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164685",
      "Title": "anyone know puritan's pride vits"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Rena: Mother Teresa was an awe inspiring woman. Thank you for posting the quote and how true it is. I love reading everyone's posting and though I may not answer all of them I do read them. There are times when I'm not inspired to write and yet others write so eloquently. Thank you all for being there for all of us. We are truly a great group of survivors. Hugs, Lili",
      "MessageIndex": 2,
      "PostDate": "09/09/2008",
      "ThreadURL": "https://csn.cancer.org/node/162185",
      "Title": "THANK YOU!"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Moopy go get those new shoes already. Too bad you don't live near me I would definitely accompany you since I'm a shoeholic. Love those shoes!!! Do something nice for your feetsies they will definitely appreciate it. LOL. Have fun shopping and squeeze in some lunch or maybe a light dinner. Hugs, Lili",
      "MessageIndex": 16,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hey Lisa, I think it's part of our new life. But, it's ok to cry every now and then as long as you can snap yourself out of it and not sit too long on the pitty potty. Hugs, Lili",
      "MessageIndex": 5,
      "PostDate": "05/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168226",
      "Title": "\"hormonal\"crying"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Cathy, I did my surgery this past February and was back at work 4 weeks later. I started power walking 8 weeks after my surgery. I also have to say I only did one side, so I still have muscle to compensate but my friend had both sides done and while she can't do sit ups she does exercise. If you need further info email here. Hugs, Lili",
      "MessageIndex": 3,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "I replied to you in your other post. Go through with it. and read my response in the other post. If you have more questions, email me here and I'll try my best to answer. Hugs, Lili",
      "MessageIndex": 5,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Thanks Cathy. I guess deep down I am trying to make it look like the other side but knowing full well it never will. It is a lot better than it was, so I will wait and see what happens. Thanks for sharing your experiences. Hugs, Lili",
      "MessageIndex": 16,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Cathy: I guess I'm learning to live with the limitations we have. The doctor suggested one more fat grafting and I'll see how I feel come February or March. I know he's done miracles because I was totally concave when we started out and that's why I went for the tram. The breast surgeon had removed way too much muscle and there was hardly any there to hold up an implant. I don't know yet if I will do it. I guess I just don't want to face more surgery unless absolutely necessary. There have been too many procedures since June 2007 when I was dx and had the mastectomy. I think that right now I'm asking for peace of mind and I think it will come soon. Thank you for your kind words. Wishing you a happy and peaceful new year also. Hugs, Lili PS> And yes each day that passes is better than the day before. Thank you Cathy.",
      "MessageIndex": 17,
      "PostDate": "31/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Cathy. I am glad everything has been going well for you. I'm happy with my results for the most part except for an indentation above the breast which the doctor has filled in with fat. This last procedure was the tattooing of the aerola and to fill in that indentation again. I like you was just a little disappointed that there is still an indentation there so when I went for the post op even the surgeon said we need to fill in again. I guess my disappointment was the fact that I wanted everything finished with since it's been 1 1/2 years already since I started this journey I never wanted to embark in and I didn't want to start off the New Year facing another surgery. But, it wasn't in the cards and I will once again have to go in for one more procedure. I am hoping to be done by March 2009. The important thing for me was getting some semblance of normalcy, which I have accomplished. I hope you are doing well also. May 2009 bring you health and peace. Hugs, Lili",
      "MessageIndex": 14,
      "PostDate": "29/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "I bought one from americanmedical-id.com. I picked up the pamphlet at the pharmacy. It looks like an ID bracelet and has a large red cross in the front. They have many styles and colors to chose from.",
      "MessageIndex": 17,
      "PostDate": "05/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/203106",
      "Title": "MEDICAL BRACELETS"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hope everything goes well Darlene. We are shining that light through the tunnel. You should be seeing it soon. Hugs, Lili",
      "MessageIndex": 3,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167045",
      "Title": "Special Thank you to All"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Everyone reacts differently, my personal expereince was that for me it got worse with every treatment. May have been the chemo meds I was on. I was given 8 rounds of cytoxan, adriamycin, and 5FU. Now, that I look back, I don't recall reading anyone being on these meds for so long, and maybe that's why I got so sick towards the end. Maybe 8 rounds was way too much. I don't know, all I can say is I'm glad it's over. Just ask your doctor for nausea meds before you start your treatment and take it before you go for your infusion. Better safe than sorry because if you do get sick, then it's hard to get a handle on it and no matter what you'll take you will be nauseas. Good luck and hugs, Lili",
      "MessageIndex": 16,
      "PostDate": "20/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164729",
      "Title": "Do Chemo treatments get worse each time?"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Catherine: Just wanted to comment that the Diep reconstruction absolutely does not use any muscle from the abdomen. They cut out a flap and then use microsurgery to reattach the flap. This procedure can take anywhere from 8 to 12 hours in the or. Tram uses the muscle and the flap is tunneled through inside your body up to the chest area. That's the surgery I had. I was in the or for 5 1/2 hours. I was very happy with the result. I then went back in August to do the nipple reconstruction, and I will now be going in on Dec 17th to tattoo the aureola and to do some fat injections in the upper chest area since it still is a little concave. Hugs, Lili",
      "MessageIndex": 7,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Cathy: My stomach is totally flat, as if I would have never had kids. LOL. It does really look beautiful. The incision goes from hip bone to hip bone but low right above the pelvic bone. I don't feel I have too much scar tissue because my surgeon had me massaging both my stomach and breast about 4 weeks after the surgery so that the scar tissue wouldn't form. My breast is as soft as my other one (I only had the right side) but honestly, I don't have much feeling there. When I was looking for a plastic surgeon, I actually went to 5 different doctors until I found this one. They all recommended the silicone gel, I just preferred to have the tram done instead. If you were to choose the silicone gel, how much would you have to pay out of pocket? It might be worth looking into. You have to do what will work best for you Cathy. Personally, I think either one would look good. Today the doctors are great at reconstruction. Hugs, Lili",
      "MessageIndex": 8,
      "PostDate": "10/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Hi Catherine, I didn't do the diep, I opted for the tram. I didn't want to be in surgery for that long and my doctor said there is a larger chance of rejection. I am very happy with the results of the tram. Hugs, Lili",
      "MessageIndex": 1,
      "PostDate": "03/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Good luck tomorrow Cathy, I wish you all the best. I will be going in tomorrow also to finish my reconstruction. Hugs, Lili",
      "MessageIndex": 12,
      "PostDate": "16/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163823",
      "Title": "DIEP reconstruction"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "I had a right mastectomy last June and stayed in the hosp for 2 days. Came home with 2 drainage tubes. The nurse at the hosp, taught me how to drain the tubes and luckily had them removed 1 week later. I went through 8 rounds of adriamycin/cytoxan and finished chemo in NOvember. They removed 7 lymph nodes and all were negative so I didn't need to have radiation. I didn't do my reconstruction right away. I waited until this past February to have it done and decided to do the tram flap. I am very happy with my decision and will be going back in August to finish the reconstruction. Talk to your doctor, some insurances are now allowing 48 hrs. Keep us posted. Hugs, Lili",
      "MessageIndex": 4,
      "PostDate": "11/06/2008",
      "ThreadURL": "https://csn.cancer.org/node/158096",
      "Title": "decision"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Thanks, Julia. Love ya, Lili",
      "MessageIndex": 1,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/165923",
      "Title": "Happy St. Davids' Day everyone!!!!!!!!!!!"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "So sorry for your loss Milly. Word's are not adequate sometimes to express our sympathy, but know you are in my prayers. I want you to know that you are not alone in the fight with the beast. We are here to help you navigate this road. Just keep posting and know we are with you 100%. Hugs, Lili",
      "MessageIndex": 4,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166401",
      "Title": "2 losses in 1 week"
    },
    {
      "AuthorID": "mmontero38",
      "AuthorURL": "https://csn.cancer.org/mmontero38",
      "Content": "Waiting for chapter 3.",
      "MessageIndex": 4,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169892",
      "Title": "Chapter 2...."
    }
  ]
}