{
  "AuthorID": "Moopy23",
  "AuthorURL": "https://csn.cancer.org/Moopy23",
  "Posts": [
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Help! Patty wants to give me lessons in resting. Lessons in anything is work! Anyway, O.D. Gee, aren't you supposed to be celebrating that clean mammo?? Maybe you should do that right now....",
      "MessageIndex": 54,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Patty, your husband flies jets?? How cool is that! I've always wanted to see an air show. We visited the Aviation Museum in Pensacola a few years ago. I didn't watch the IMAX movie because I knew I'd lose my cookies, with the view from the cockpit. (That's Navy, though, right? And your hubby is Air Force? Bet there's friendly competition? Lynn, you just described our house. Literally, I've tucked books under beds and living room furniture. When we first married, I thought we would one day have a house big enough for all of Joe's books. I came to realize that, however big a house we got, there'd be books all around. (I read, too--was a Literature major in college-- but tend to pass them on as there are few that I want to keep. Although I have read the HP books all at least twice, and the Tolkien books I'm keeping.) And thanks for the suggestion, Marcia. Sorry to force you to post. Very bad of me/us.) Now you're making me sorry that I gave up all of our Eeyores. We had all sizes, from the very largest to the smallest, about 36 or so, as I recall. We donated them, thinking some kids might enjoy them. All except for Eeyore Lucius, of course. And no, Joe isn't making that up. We traveled always with one or more of our Eeyores. And E. Lucius did wave at his fellow Eeyorian on the highway once. Hmm, gotta go rest--and avoid vacuuming. Moops",
      "MessageIndex": 71,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Dear Susan, I can only second Cat's comments. Your post is a gift to us all. Like Claudia, you beautifully and powerfully express why and how we all should live with hope and joy. There is no more that can be said than this.",
      "MessageIndex": 10,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168645",
      "Title": "Farah Fawcett"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "OK, Ok, I will stop fretting about stuff and follow everyone's excellent advice,er, instructions. (Pammy, have you thought about an instructional video?) I will watch dvds, read, and recline in my lounge and snooze.... And get a supply of ice cream and cookies, and maybe a bottle of local wine in honor of Chen. I need to catch up on everybody's Expressions pages, after all. I hear there are some great audio clips on a certain page.... Love, Moopy p.s. Thank you, Stef, for the vacuum tip. Will try that on Aortus. If I can keep him from checking your posts.",
      "MessageIndex": 8,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Thank you, Stef. I really, really should not vacuum ever again. It is bad for my health. We sisters in pink must avoid vacuums.",
      "MessageIndex": 76,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Flight Engineer is cool, Patty, I agree. No wonder you're very proud of your man, as you should be. By the way, those cargo planes are huge, aren't they?",
      "MessageIndex": 29,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Thank you, Stef. I really, really should not vacuum ever again. It is bad for my health. We sisters in pink must avoid vacuums.",
      "MessageIndex": 32,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "OK, Ok, I will stop fretting about stuff and follow everyone's excellent advice,er, instructions. (Pammy, have you thought about an instructional video?) I will watch dvds, read, and recline in my lounge and snooze.... And get a supply of ice cream and cookies, and maybe a bottle of local wine in honor of Chen. I need to catch up on everybody's Expressions pages, after all. I hear there are some great audio clips on a certain page.... Love, Moopy p.s. Thank you, Stef, for the vacuum tip. Will try that on Aortus. If I can keep him from checking your posts.",
      "MessageIndex": 52,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Flight Engineer is cool, Patty, I agree. No wonder you're very proud of your man, as you should be. By the way, those cargo planes are huge, aren't they?",
      "MessageIndex": 73,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Help! Patty wants to give me lessons in resting. Lessons in anything is work! Anyway, O.D. Gee, aren't you supposed to be celebrating that clean mammo?? Maybe you should do that right now....",
      "MessageIndex": 10,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Patty, your husband flies jets?? How cool is that! I've always wanted to see an air show. We visited the Aviation Museum in Pensacola a few years ago. I didn't watch the IMAX movie because I knew I'd lose my cookies, with the view from the cockpit. (That's Navy, though, right? And your hubby is Air Force? Bet there's friendly competition? Lynn, you just described our house. Literally, I've tucked books under beds and living room furniture. When we first married, I thought we would one day have a house big enough for all of Joe's books. I came to realize that, however big a house we got, there'd be books all around. (I read, too--was a Literature major in college-- but tend to pass them on as there are few that I want to keep. Although I have read the HP books all at least twice, and the Tolkien books I'm keeping.) And thanks for the suggestion, Marcia. Sorry to force you to post. Very bad of me/us.) Now you're making me sorry that I gave up all of our Eeyores. We had all sizes, from the very largest to the smallest, about 36 or so, as I recall. We donated them, thinking some kids might enjoy them. All except for Eeyore Lucius, of course. And no, Joe isn't making that up. We traveled always with one or more of our Eeyores. And E. Lucius did wave at his fellow Eeyorian on the highway once. Hmm, gotta go rest--and avoid vacuuming. Moops",
      "MessageIndex": 27,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "How wonderful, Maryann. And what a special surgeon you have, to call you at home this evening. I bet you will sleep better now! Thank you for sharing your good news and happiness with us.",
      "MessageIndex": 3,
      "PostDate": "26/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170702",
      "Title": "Surgeon Just Called With News!!!!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Susan, I hope the surgery went well and that you are resting tonight. That cold, nasty weather is just to encourage you to snuggle up and get lots of sleep.",
      "MessageIndex": 14,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178043",
      "Title": "Tomorrow's the \"Day\" (10--21-09)"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Re, I visited your page and saw Eva with already adoring big bro Ian. But also happy to see this pic of Landon, Ian, and Ava. Ava is really growing now, isn't she? Thanks for sharing your beautiful grandchildren with us, Moopy",
      "MessageIndex": 7,
      "PostDate": "08/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171076",
      "Title": "New pic of Ava! :)"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Cat, I'd have thought being the baby of the family, you got all the beatings you needed! Seriously, I'm glad you listened to our wise Christmas Girl, Susan, and that you are feeling better.",
      "MessageIndex": 5,
      "PostDate": "21/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186483",
      "Title": "surgery next wednesday"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "You two have a great time. And may any thunderstorm be brief and far out on the sea, so you can enjoy the scene. Looking forward to hearing details and maybe even seeing a pic or two when you get back. Wishing you smooth sailing, sunny and starry skies. Moopy",
      "MessageIndex": 7,
      "PostDate": "29/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180790",
      "Title": "Anchors aweigh!!!!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Jackie, are you having problems sleeping? I believe Lunesta is what my sister takes as needed.",
      "MessageIndex": 9,
      "PostDate": "17/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167422",
      "Title": "cancer survivor sleep problems"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Penny, I'm sending up prayers and good thoughts for you and will be especially thinking of you on Wednesday. Your sisters in pink will be with you in spirit and cheering you on.",
      "MessageIndex": 11,
      "PostDate": "21/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186483",
      "Title": "surgery next wednesday"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "So glad to hear from you and that you're improving well after last week's surgery. Thanks for letting us know. Sending you healing thoughts and best wishes.",
      "MessageIndex": 33,
      "PostDate": "28/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186483",
      "Title": "surgery next wednesday"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "For immediate relief, I can't add anything to what these ladies have said. Going forward, I can share the advice of my sister, an RN who works in a chemo clinic part-time. She told me to use stool softeners consistently. Apparently, constipation is a common problem with chemo patients; she said it is not unusual for patients to need enemas. You might ask your doctor about a product. Lorrie recommended Sennacote(generic is fine). Hope you are feeling better now.",
      "MessageIndex": 3,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175624",
      "Title": "Need help ..sensitive subject .. private area is raw and inflamed from constipation (5 days with movement) .. I need help"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Pammy, I can't say it any better than Lynn: you DO bring smiles and laughter to us all. I can only imagine how brightly you light up a room with your charm and humor. Lucky friends to see you in person. Have a wonderful trip. We will look forward to hearing from you when you get back and have had some rest from all the fun. Moops",
      "MessageIndex": 6,
      "PostDate": "20/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175960",
      "Title": "Change on weekend plans!!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "So proud of you Nancy. I will be thinking of you and be with you and your Mike in spirit tomorrow. Access to my port never hurts, which surprised me. I believe the nurses can use lidocaine or another cream if you were to need it.",
      "MessageIndex": 5,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165221",
      "Title": "Port and Chemo"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Your wardrobe sounds about right, but 3 tons of makeup? Go naked, I say, with SunBlock only. By the way, your new hair style looks great: the soft color and short style really suits you. And your hair looks nice and thick! I'm jealous. You and your friend enjoy the beach. Catch you when you get back.",
      "MessageIndex": 5,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172525",
      "Title": "I'm off.."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Lynn, Joe and I both will be thinking of you and praying for good test results.",
      "MessageIndex": 6,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168290",
      "Title": "Ultrasound tomorrow"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Kathi, I hope you are feeling stronger today. My mother and my family got the same kind of news you got, 28 years ago this month. Early one cold Sunday in January, a police car pulled up at our house. Two policemen came to the door. My brother Chuck, 2 years younger than me, had not come home the night before. My mom knew immediately. She had gone to bed while he was still out, which was not unusual. I am not a mother, was not blessed that way. But I witnessed my mother's agony, and her lasting grief. My own shock and grief and permanent sense of loss are not to be compared with a mother's pain. I can only tell you I am so sorry that you lost your Steph, your little girl. I will pray for her tonight and for you.",
      "MessageIndex": 20,
      "PostDate": "07/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183388",
      "Title": "Tomorrow (tonight) is a bit tough...."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, T, after my biopsy, I was told I'd be notified within 2-3 business days. I immediately called my PCP. She said she'd get the results sooner and would call me herself. And she did: she had the results and called me the day after, that is Tuesday, after my biopsy on Monday. So, you might check with your PCP. I do have to say my PCP is a wonderful physician and human being. Dr. Kim has been my doctor for almost 11 years now. I love her and do trust her with my life. Even if you are not that close to your PCP, you might ask if he/she will get the results first. And, you are cute, you know, though I can't see the twitch from your photo. You do look young to have that adorable grandchild. You must have been a childbride, like Cat.",
      "MessageIndex": 10,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173308",
      "Title": "Not wasting any time that"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "TJ, Trish remains in my prayers. I pray that the problems are treated quickly and well so she can beat the beast again. I send all the strength I can to help our Irish sister in this fight. I pray also for you and send you healing thoughts as you hurt for your friend.",
      "MessageIndex": 7,
      "PostDate": "05/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183337",
      "Title": "Regarding Irishwhispers"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Pammy, I'm glad that Joe's post at least made you laugh. A little humiliation is nothing compared to a friend's smile. As long as he doesn't start referring to me as \"Poopy,\" I'm good. (New Flower, you're forgiven, too--no way can I be mad at someone who could create such a beautiful, evocative User Name.) I'm still wondering, Pammy, if it is not a UTI, maybe it is stones like Steff described. (And Steff, I am sorry you went through that pain and sickness. I felt badly for you reading about that hospital visit.) Actually, kidney stones was the initial or expected diagnosis of the Urgent Care doc, when I made my memorable trip full of poop. If it is stones, it may be so early that you won't have to go through what Steff did. Then again, a kidney infection can't be ruled out, right, even if you don't have a fever. I do have an issue with you and Steff on the matter of ice cream. Before you two, I was not an ice cream-crazed person. Now, I am. I have been eating at least one ice cream or custard-based treat every day! I am even testing strawberry milkshakes, buying one at every placed in town to judge which is best. (So far, it's Culver's.) I am hugging you back, but you probably need to make more room if you want to hug me, given my ice cream calories. Kathy, I'm on to my e-mail. Sorry I missed you. Seriously, please keep in touch, Pammy. I'm sure it is nothing, but we will wait with you to confirm. Steff and Joe are right about no cancer, but your mind needs to be relieved of that fear, as well as the discomfort removed.",
      "MessageIndex": 11,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194229",
      "Title": "Flank pain...."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Re, it sounds like you are all ready for this surgery! So glad you had a relaxing evening with the hubby last night after accomplishing so much during the day. A wonderful example of using your energy well! Will be thinking and praying for you, and for a fine and most successful reconstuction. We will look forward to hearing from you when you can. In the meantime, wishing you rest and quick healing.",
      "MessageIndex": 2,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165854",
      "Title": "A Note From RE"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "I am looking forward to viewing all of the photos. Thank you for taking the time and effort to put them up for all of us. Wish we all could be California Girls!",
      "MessageIndex": 34,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Nice to meet, you, kitty and golden Kenny!",
      "MessageIndex": 8,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169596",
      "Title": "Pic of me......"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Diane, I bought the Nioxin scalp treatment kit when my hair first started growing again. (I was giddy with new-hair growth, and splurged.) Honestly, it smelled badly, and made my scalp itch. My hair stylist suggested I take Biotin supplements; she has been a hairdresser for many years and says it helps hair growth. I keep forgetting to ask my onc. about taking it.",
      "MessageIndex": 3,
      "PostDate": "14/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194267",
      "Title": "Has anyone tried Nioxin?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "I am looking forward to viewing all of the photos. Thank you for taking the time and effort to put them up for all of us. Wish we all could be California Girls!",
      "MessageIndex": 80,
      "PostDate": "01/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "I'm with Donna, Tasha. You were brave to go back. I'd have needed Ativan and a ride home. Funny thing, I was just intending to ask you what you have been up to at work...",
      "MessageIndex": 3,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "I just love that dog. She is a beauty.",
      "MessageIndex": 8,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171715",
      "Title": "Conference Call Questions - Do you have some ready?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "LOL, Tasha! That is so true about the Censor teaching us naughty words we never dreamed of. Wonder what the Censor's other job is....I mean, is monitoring us a full-time job? (Well, maybe monitoring you is!:)",
      "MessageIndex": 6,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171715",
      "Title": "Conference Call Questions - Do you have some ready?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Jeanne, I am hoping to \"attend\" the Friday AM call, but not sure since I have rads. Questions I have thought of are: can older threads be purged? When you do a Search, you get entries dating back to 2001. Cancer treatment has changed so much that much of that is obsolete and slows the search down. The feature is considerably less useful. I was thinking maybe having just the last five years or less. Also, have the Search engine display newest to oldest. That would help. Next, not to open a can of worms, but is there a possibility of restoring G-I-F functions? Maybe we could sign an online agreement, and be booted off if an image is deemed offensive. Or do something so that we can type words with those letters in them! Next, duplicate entries: can they be removed? Very frustrating and page-consuming. We all hate when that happens to one of our entries. Finally, when something is removed, it would be nice to have an explanation. Under the OHIOGIRL thread, my and other posts were deleted. I finally figured out it was for privacy's sake: Marie's address had been posted. Still, it would have been thoughtful to explain. Will let you know if I think of others. Joe said he will brainstorm, too.",
      "MessageIndex": 3,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171715",
      "Title": "Conference Call Questions - Do you have some ready?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Oh, Judy, I am so thrilled for you all! Brittany, Adrian, and Olivia are just beaming, and I can see Noah has quite a bit of dark hair. Thank you for sharing your wonderful news. I remember little Casey and Kelly and the trials your family has endured. Seeing baby Noah and the joy he has brought lifts my heart. I'll look forward to seeing the first photo of you with Casey and Olivia's little brother.",
      "MessageIndex": 28,
      "PostDate": "01/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/204431",
      "Title": "Sharing Good News - New Great Grandson (Non-breast cancer related)"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Thanks for the laugh, Tasha!",
      "MessageIndex": 5,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168292",
      "Title": "Great Joke......Had to Share"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Turquoise Girl imitating a snake. That is a funny thought! I so wish I had been there to appreciate your charade skills!",
      "MessageIndex": 16,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hello, faithhopelove1, it is odd that your oncologist did not know the hormone results. These are always on the path report. Also, Tamoxifen is given for cancers that tested hormone-positive. Possibly your onc. is assuming the cancer you had was hormone-positive, as 85% are. I would definitely pursue these questions with your oncologist; and, if you are not satisfied and she does not appear prepared, I would get a second opinion. Sorry I can't answer your other question about testosterone. My best to you.",
      "MessageIndex": 1,
      "PostDate": "05/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171168",
      "Title": "meeting with onocologist"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Pammy, I'm glad that you asked the doc about how you might sleep better. I know you've been up late posting in the early hours. As far as your research, you post much info that is helpful here,as Mimi does. Much appreciated! Thank you very much for the flu shot tips. I will get the reg. flu shot tomorrow at Walgreens and send Joe, too. Will ask my onc. about the swine flu shots. Wishing you better sleep, interrupted only by your libido.",
      "MessageIndex": 2,
      "PostDate": "17/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175843",
      "Title": "Got my Flu Shot today, did you get yours?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Another Christmas Eve birthday! Wishing you a wonderful day, Janice, and all the best in the new year.",
      "MessageIndex": 6,
      "PostDate": "22/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208276",
      "Title": "Friday is Jd1224's Birthday!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Jackie, sorry to interrupt snake dialogue, which is interesting and funny. But had to say I am so glad to see your new photo, with Bob and your kids. Wonderful to see you all.",
      "MessageIndex": 5,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Jackie, you will be taking Herceptin, right? The oncologist in St. Louis told me that my not being able to be helped by that drug was a loss for me. So that makes me think that being able to take Herceptin is a big plus. Maybe it makes clinical trials less significant as you already know Herceptin works.",
      "MessageIndex": 6,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166240",
      "Title": "+ on Lymph Nodes => Blood Vessel => PET scan"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Joy, I agree with Mimi about the unlikelihood of metastasis. I had 6 lymph nodes involved and the same agressive cancer that Mimi had--but I still had no metastasis (thank God). So, with your having only 2 nodes affected, and a slow-growing cancer, it is much less likely that there will have been any spread. I hope that is of some reassurance to you. I found also that Ativan or Zanax helped with anxiety and sleeping. You reallly need your rest to help prepare your body and mind for the treatment to come. If you don't want to get a prescription, Benadryl works for many people, or Tylenol PM.",
      "MessageIndex": 3,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166240",
      "Title": "+ on Lymph Nodes => Blood Vessel => PET scan"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "That was really nice of you to bring candy, Teena. I think I will do that next Wednesday. Thank you for sharing your last day with us. I had never heard of the Mardi Gras beads for showing your boobies. How appropriate and touching. You wear them proudly. And keep using the lotions, like they've all told us to do.",
      "MessageIndex": 19,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173315",
      "Title": "Thank you from Teena ... last day of RADS!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "It upsets me to think of your sisters' lack of understanding and compassion. You give so much of yourself, Jackie, that you deserve to be surrounded by the love and empathy you offer so selflessly. I think that your sisters got used to receiving, never giving back or thinking of their big sister. They think your job is to be there for them. Which you have been. But it is time for you to take care of you, and for those who love you to step up and be there. You're right: compassion and the capacity to think of others are qualities so many people lack, for whatever reasons. Like others have posted here, I have been stunned, sometimes, at people's comments/reactions after my own diagnosis. If you really want to communicate how you feel, I like Debi's idea of writing. Do you exchange e-mails with your sisters? That way you could edit, as Debi said. I don't think what you write or say will make your sister behave differently for any length of time. But, if she loves you at all, she should at least be sorry you are upset. And if it makes YOU feel better, it is worth considering. And what do you mean....\"make me look more like a ********?\" You look like what you are, a beautiful, strong, loving human being. A person with rare compassion and concern for others, whether you are related to them or not. Don't want to hear you put yourself down, girl? Ok?? Love, Moopy",
      "MessageIndex": 14,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168677",
      "Title": "I am so dissapointed in my family"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Kathy, my eyes would redden and burn due to dehydration. Whenever I had those eye symptoms, I guzzled more water. In addition, I experienced blurred vision after my first chemo. Thought it was chemo, but turned out to be low potassium. An emergency visit to the clinic for a 3-hour potassium infusion solved that problem, and I have been taking potassium tablets ever since. However, I have been having blurred vision again lately and am nervous about that. My potassium levels are being checked weekly, and I will see my onc. Friday. Hope drinking more water will help with your eye symptoms. If you weren't having chemo, I'd say it was allergies. The ragwood is just horrible here this summer.",
      "MessageIndex": 1,
      "PostDate": "02/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/174889",
      "Title": "Question about Eye"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Steff is right, Pammy. Even if you get bells and whistles on your last rad day, you still need to BUY something. Just get to thinking about what you want. I know you can come up with something....",
      "MessageIndex": 11,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173315",
      "Title": "Thank you from Teena ... last day of RADS!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Wonderful news, Patty! I'm not sure, but I think my pre-cancer letters were phrased something like no evidence of abnormality\" or something like that. Very happy for you, Outdoor Girl. You can get out there now and enjoy the weekend and celebrate.",
      "MessageIndex": 2,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173297",
      "Title": "I met with NED yesterday too!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Thank you, Julie. I also hope everyone has a good day: excellent test results, cheerful doctors with good news, and fast, mild rads.",
      "MessageIndex": 2,
      "PostDate": "10/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173435",
      "Title": "Good Luck"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Just bumping this up for Pammy. Hey, Pammy, hope you are snoozing away after a nice day back at work. p.s. Speaking of ice cream (aren't we always?), have you tried Chik-Fil-A's peppermint chocolate chip milkshake? With whipped cream and a cherry on top. Yum! A great pick-me-up after a long workday.",
      "MessageIndex": 3,
      "PostDate": "20/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184325",
      "Title": "Pammy How was returning to work"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "What TJ said, my friend.",
      "MessageIndex": 8,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173042",
      "Title": "To perhaps relieve some ambivalence..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Maureen, wonderful news! I am so happy for you. Dancing with NED! Keep those dancing shoes on forever.",
      "MessageIndex": 21,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173547",
      "Title": "Dancing with NED"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Heidi, you are in my thoughts and prayers. Joe and I \"introduced\" you to my sister Jackie last night, by showing her your FB page. Joe was telling her about his Polish sister and how you sent him links to Polish Christmas songs. We enjoyed seeing you grow, from your baby pic to school to your grown-up photo. You look strong and beautiful. I wish I could hug you in person, but I send gentle hugs to you now. Please check in when you can. I send you strength and hope, from the infinite store given us by our sisters (and brothers) here.",
      "MessageIndex": 15,
      "PostDate": "30/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208720",
      "Title": "I've been thinking about you Heidi - Please post when you can."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, the last I heard, PARPs are being used for stage 4 TN, and women who are BRCA+ benefit the most. As for me, drove less than 5 miles and more than 200, all treatments considered. Oh, I do like Nicholas Cage in some movies, same with Russell Crowe.",
      "MessageIndex": 2,
      "PostDate": "17/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196698",
      "Title": "PARP inhibitors and triple negative disease?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "I will be thinking of you both on Friday. Most lumps do turn out to be benign, and I pray for that outcome for each of you. By the way, Kit, I love your pup! Did you say her name is Daisy?",
      "MessageIndex": 16,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/169034",
      "Title": "Biopsy on Friday"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Kathy, I agree with what everyone has written. I also have crying jags. Right after my radiation treatments ended, I cried several times a day, every day, for about 2 weeks. With all that has gone on for me the last year, now that any time something else happens, I seem not to handle it as well emotionally. Whereas before bc I would have been calmer, now I cry more readily and am more likely to let things get me off-balance emotionally. Please do talk to your doctor. And be patient with yourself. You have been through--and are still going through--a terrible ordeal.",
      "MessageIndex": 9,
      "PostDate": "16/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184055",
      "Title": "Cry"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Re, delighted to hear that baby Ava is gaining weight and clearly feeling better all the time. We are looking forward to new photos! I hope Ava's mom and dad are good, too, after the unexpected difficulties. I can imagine the fear and stress they've experienced. By the way, from the photo on your Expressions page , big brother Landon seems very pleased to have a baby sister!",
      "MessageIndex": 9,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170867",
      "Title": "RE"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "My experience with under-medicating myself for nausea was at the first chemo. Also I was allergic to compazine. Not to mention fear of the unknown. So, all in all, my second treatment was notable easier: less frightening, less miserable and uncomfortable. I wish the same for you, Kiley.",
      "MessageIndex": 2,
      "PostDate": "22/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172277",
      "Title": "2nd chemo treatment, wish me luck"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Cindy, what great results, and truly a blessing. Enjoy celebrating this milestone!",
      "MessageIndex": 4,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175607",
      "Title": "Great 6 monthl check-up"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Well, even though the Moopinator wasn't mentioned, I am going to be vain and include myself in your list and chime in to say I miss you, too, Stef! I think of you often-- I just miss you. I remember this last summer, when you and Cat and Tasha and Claudia and Pammy and Christmas Girl and Jeanne and so many others had me literally laughing til it hurt and I had tears in my eyes. Will never forget the hedgehog recipe. Every one of you is in my heart. I may not have your address or have your name listed here, but I have you in my heart. And so does Aortus. As for my absence, I went back to a different position at work, no longer sitting at my desk and writing e-mails as I listen to NPR. I'm on the phone all day instead. Even at just 3 days, I am so tired. Plus, I am getting physical therapy on my left arm 2 or 3 times a week and trying to do all the typical daily chore things, and also get out and have some fun. I do visit FB, as some know, but lately I've been too tired of staring at a work computer screen to do more than pop in ever once in awhile, as here, to contribute what I can, and see that my dear friends are ok. Tasha e-mailed me awhile back on FB and reported computer problems, a hacker. She created a new profile and sent a new friend request. I thought I was having a chemo brain moment as I thought I'd added her already. Her artwork is getting recognition, and is being displayed at a local shop! I am so proud of her. If I hear from her myself, I will report in. I am hoping that it is just computer issues still and her art work and moving on with life that has kept our Turquoise Girl away. About Mimi, remember that she has always avoided posting on weekends and holidays and days at a time. She did express once that she needed to step back from online bc activities and sites as she felt she was not moving on but keeping-bc-on-her-mind. If she were fearful and experiencing any bc-related issues, I believe she would come to us. Or she would post her fears at youngsurvivors.org, which she has not as far as I have seen. If she needed us, she would let us know, I hope... As for me, I miss everyone, just like Stef. I'm hoping to get my energy back to be a more \"there\" friend. The plaque that Taleena sent and I have prominently displayed is true of our friendships: \"We'll be friends forever, won't we,Pooh,?\" asked Piglet. \"Even longer,\" Pooh answered.",
      "MessageIndex": 44,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185854",
      "Title": "I miss you guys"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Fun question, Penny! Thanks for starting this thread- I've enjoyed reading everyone's responses. My ringtone is \"California Dreamin'\" by the Mamas and the Papas. (We visited SF in 2008, and CA has been my magical place ever since!)",
      "MessageIndex": 14,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198944",
      "Title": "Whats your ringtone?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Kathi, my hair was dyed at 1/2 inch. My regular hair stylist did it as I don't trust myself. Even if you normally dye your own hair, my advice would be to have it done this first post-chemo time professionally by someone you know and trust. Just my opinion, of course. As for growth, I was worried, too, that I'd have to color my hair more. But that has not happpened. My hair is growing faster than most (this per my hair stylist, NOT my opinion!), but still I have not needed coloring more than the usual 6-8 weeks. Trims, however, I do need more often. My hair is growing back in such strange ways that it has to be shaped more often. Let us know what you decide. Love the photo of you, BTW.",
      "MessageIndex": 6,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/189018",
      "Title": "It's the Hair"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Well, even though the Moopinator wasn't mentioned, I am going to be vain and include myself in your list and chime in to say I miss you, too, Stef! I think of you often-- I just miss you. I remember this last summer, when you and Cat and Tasha and Claudia and Pammy and Christmas Girl and Jeanne and so many others had me literally laughing til it hurt and I had tears in my eyes. Will never forget the hedgehog recipe. Every one of you is in my heart. I may not have your address or have your name listed here, but I have you in my heart. And so does Aortus. As for my absence, I went back to a different position at work, no longer sitting at my desk and writing e-mails as I listen to NPR. I'm on the phone all day instead. Even at just 3 days, I am so tired. Plus, I am getting physical therapy on my left arm 2 or 3 times a week and trying to do all the typical daily chore things, and also get out and have some fun. I do visit FB, as some know, but lately I've been too tired of staring at a work computer screen to do more than pop in ever once in awhile, as here, to contribute what I can, and see that my dear friends are ok. Tasha e-mailed me awhile back on FB and reported computer problems, a hacker. She created a new profile and sent a new friend request. I thought I was having a chemo brain moment as I thought I'd added her already. Her artwork is getting recognition, and is being displayed at a local shop! I am so proud of her. If I hear from her myself, I will report in. I am hoping that it is just computer issues still and her art work and moving on with life that has kept our Turquoise Girl away. About Mimi, remember that she has always avoided posting on weekends and holidays and days at a time. She did express once that she needed to step back from online bc activities and sites as she felt she was not moving on but keeping-bc-on-her-mind. If she were fearful and experiencing any bc-related issues, I believe she would come to us. Or she would post her fears at youngsurvivors.org, which she has not as far as I have seen. If she needed us, she would let us know, I hope... As for me, I miss everyone, just like Stef. I'm hoping to get my energy back to be a more \"there\" friend. The plaque that Taleena sent and I have prominently displayed is true of our friendships: \"We'll be friends forever, won't we,Pooh,?\" asked Piglet. \"Even longer,\" Pooh answered.",
      "MessageIndex": 6,
      "PostDate": "12/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185854",
      "Title": "I miss you guys"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Yea, Linda!! Yes, you have long deserved some good news. And the clear bone scan is great news. You keep hanging in there, ok? Thinking of you as you get the port in--an important new step in getting the power of chemo on your side.",
      "MessageIndex": 35,
      "PostDate": "30/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182397",
      "Title": "If I didn't have kids . . ."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Surfermom, there is an older thread with makeup tips from Derbygirl and JoyceLouise especially, and lots of info from everyone. We had a lot of fun and learned what to expect as far as when and how hair comes and goes and comes back again. If you are interested, just do a search using \"Eyebrow\" or \"Eyebrow Regrowth.\" I was rejoicing because I am 3 weeks past my last chemo and still have some eyelashes and eyebrows. Am crushed again to hear that those hairs will be going. So, you will have plenty of company, and I am reviewing makeup tips myself. Good luck to you!",
      "MessageIndex": 7,
      "PostDate": "18/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168702",
      "Title": "Eyelashes"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Teri77, I don't have experience with either of these drugs, but I do want to welcome you to the board. Since you are in a trial, it may be that less information about side effects is known. You might call your clinical trial nurse or coordinator or doctor. They can tell you what other participants have or are experiencing. The informed consent material for the trial may also have some info that you can ask about. As far as my experience with TAC, fatigue increased, and loss of taste. Other side effects pretty much stayed constant or lessened through my 6 rounds of TAC. I hope the side effects do lessen for you.",
      "MessageIndex": 2,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173923",
      "Title": "ixempra and avastin side effects"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hmmmm, does this mean we will need to nag you about getting that mammo before Jan? I am good at the nagging thing (ask Aortus), and I bet I can get some of our sisters to join in. Aarf to Riva, and gulp? to the Aortian guppies. P.S. Dr. Charisma Bypass probably thinks there is enough charisma in the room with you there.",
      "MessageIndex": 2,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171789",
      "Title": "Dr Charisma-Bypass...."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Linda, everyone has given true and profound reasons for you to keep fighting. I don't have any new ones. I just wanted to say: your being tired and sad, and thinking \"why bother? I have felt the same. It feels, to me, like a crushing burden on my heart. I have not been diagnosed with mets, but I am at very high risk. Maybe it will help to know you are not alone in your feelings. I just hope I could find within myself a portion of the quiet courage and grace you have in abundance.",
      "MessageIndex": 15,
      "PostDate": "20/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182397",
      "Title": "If I didn't have kids . . ."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Linda, I hope your Christmas Day improved greatly from your post this morning. Scans and unfeeling nurses, socially inept scan techs...etc. are hard to deal with any day, and especially on a holiday. You do write that all you want to do is kill the cancer, and despite the change in plans for NYE, that is what you will be doing. Port this NYE; NC next NYE. What do you say? Actually, I am impressed that the steps needed for your treatment to start are moving along despite the holiday. This time last year, I was left to wait, despite a very fast-growing type of cancer. (As Claudia has written, cancer does not grow on weekends or holidays, apparently.) So, I hope at least you feel good that things are moving forward. Also, your onc's feeling that there may be no new liver mets is encouraging IMO. Oncs tend not to look on the bright side, in my experience, and twist themselves in knots to avoid giving anything that could be considered \"false\" hope. I would think, too, that a possible lung met would get the attention of even the most inexperienced or careless onc. So maybe his not seeing that a \"spot\" was noted on the report is a good sign...As for the cervix, even in the worst case scenario, your cervix can be removed. And, finally, the tech sounds as if he/she was making a clumsy attempt to be friendly. Averted eyes and a \"good luck\" have escorted me out when a tech thinks she/he has seen something. All this is my clumsy attempt to help you feel better, Linda. Things will get better for you. That I know. So, please hang in there, and keep posting.",
      "MessageIndex": 26,
      "PostDate": "25/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182397",
      "Title": "If I didn't have kids . . ."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Taleena, you did have a full day, didn't you? How kind of your OB/GYN to share her survivorship with you. And how smart of you to quit smoking, or to be on that road also. Maybe the fatigue from rads will kick in and checkmate the nervous energy from fewer cigarettes. All the best, Moopy",
      "MessageIndex": 3,
      "PostDate": "08/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175294",
      "Title": "First Day of Rads Today for T..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Thank you, my dear friends, I will get new shoes. Just tiring to try them on. Whereas, with furniture, all I have to do is sit! Wouldn't it be nice to have a personal shopper? Thanks, Marcia, for the Easy Spirit recommendation and info. JCP, here I come. Stef, your post reminds me of the Dick and Jane post you wrote a while back. I learned to read with Dick and Jane! I thought your post was fun, as they often are. Love you all, Moopy",
      "MessageIndex": 4,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Ah, you're playing hardball, Teena! I guess that spouse of mine does deserve not to fret. See, guilt works! I really, really like the sneaker couple, by the way. How can I resist?",
      "MessageIndex": 7,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Those are good ideas; we can take breaks, and the mall does have chairs. Joe had plantar fascitis, and I saw how painful it is. I hope that your feet are fine now, Re. Thank you both, and for your hugs, too. (Purple is my favorite color, by the way.)",
      "MessageIndex": 13,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Well, you did just schedule the big one--for your mammo. So, it would be easy to forget this one. So, how are you, dear daft sod?",
      "MessageIndex": 4,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181124",
      "Title": "TASHA ?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "How could I resist my retail therapy group, under the leadership of Ms. Susan out of Chicago???? In fact, I went all out and bought 2 pairs, Sketchers and Easy Spirit (thanks Marcia). Thanks for the suggestions, everyone. I will check New Balance and Nike for shoes as soon as I start exercising. Mimi, thanks for the link. I am afraid I am a dull shoe-person, though. The shoes that hurt are Bjorn and Clarks brands, very plain. Have to share this: before I started chemo, a neighbor who previously had treatment warned me of side effects. One of them was your feet growing 2 or 3 sizes. So, I was afraid I was going to look like Bozo. Bald head and huge feet. Am happy that I got only the bald part. Anyway, my husband will thank you because he was tired of my complaining about foot problems. I only wish we could have gone shopping together, my friends. Wouldn't it be great if we could have a gathering somewhere? A CSN convention. Retail Therapy would definitely be one of our activities.",
      "MessageIndex": 20,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Deb, chemo is often given before surgery to shrink tumors. It was offered to me, but the cancer I had was growing so fast that I did not want to wait. I have never heard of chemo beforehand not helping at all; usually, there is shrinkage of the tumor. Marcia and others here have had chemo first; you should hear from them soon. Again, it is unlikely that the chemo would not help at all, that the cancer would continue to grow. You might talk again with your oncologist. He or she should be able to explain to your satisfaction the benefits of getting chemo first. You need to feel more secure about what is being done, and it is his/her job to help you understand the proposed treatment plan. Good luck to you, and I hope that you start seeing the tumor shrinkage very soon. p.s. I also like your cute pup!",
      "MessageIndex": 4,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176057",
      "Title": "I got a question??"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Kat, you are doing great. You ARE moving forward, with the worst part almost past. Light is at the end of this tunnel you're travelling. We're all waving our flashlights on the other end, waiting for you to join us and to celebrate with you.",
      "MessageIndex": 3,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173115",
      "Title": "3 RD Treatment Tomorrow"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Thanks for starting this thread, Sgamtd. Tasha, I'm also hoping your dr. answered your questions and gave you helpful information on taking tamoxifen or not.",
      "MessageIndex": 1,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181124",
      "Title": "TASHA ?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hey, Jan, what RE wrote. Missing you but believing that you are thriving and out there enjoying your life.",
      "MessageIndex": 9,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177389",
      "Title": "phoenixrising--AKA Jan--where are you?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Kathi, thank you for your post. I actually have had some neuropathy in my legs/feet. Did not think about shoes. I guess it is definitely worth using what energy I have today to get some shoes. By the way, it is so nice to see you and Hans. You have been through so much, separately and together. It is good to see you smiling and happy and healthy.",
      "MessageIndex": 9,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Stubbrn, I like your name. Being stubborn is a good thing when it comes to being a survivor. Which you are. Her2/Neu positive does mean the cancer was aggressive; however, Herceptin is a very powerful drug. My tumor was large, and my oncologist counted my Her2/Neu negative status as not good because Herceptin wouldn't help me. So, while it would be best to have a non-aggressive cancer (well, best is none at all), it is good to have a type for which there is a \"targeted therapy\" in addition to chemo and rads. Many here are on or have had Herceptin. I am sure you will hear from them. You will find much support and understanding and encouragement here, whatever our individual diagnoses.",
      "MessageIndex": 4,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171837",
      "Title": "New to this"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Wishing you a day/evening filled with your favorite things and people.",
      "MessageIndex": 11,
      "PostDate": "25/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195161",
      "Title": "Today is Rague's birthday!"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Jan, thank you for writing us. I am sorry for the depression you're facing right now. A beautiful baby grandson is powerful medicine, though. You hang in there, ok? Joe and I both have missed you and will keep you in our prayers. Moopy",
      "MessageIndex": 17,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177389",
      "Title": "phoenixrising--AKA Jan--where are you?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "It's worth singing again: Happy, Happy Birthday! Thanks, Steff, for remembering another March baby. (Aortus says all the best babies are born in July....bah humbug, we say!)",
      "MessageIndex": 8,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/188845",
      "Title": "Thursday the 25th is Green Eyed Girls Birthday"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Please post and let us know you're ok. Hoping all is well with you. Moopy",
      "MessageIndex": 1,
      "PostDate": "12/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177389",
      "Title": "phoenixrising--AKA Jan--where are you?"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hi, Donna, if you will look under the thread \"On the Journey...\", there is a posting that includes a link to a stage 4 forum. It is under a post titled Cheesehead something or other. My husband, who is from WI, posted it for a sister here who is from WI and who also is dealing with stage 4. He is the computer expert in the family. Sorry I don't know how to create a link for you myself. It is breastcancer.org, I believe. I am sorry to hear of your diagnosis. It sounds as if you are dealing with it very bravely and straightforwardly.",
      "MessageIndex": 5,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167298",
      "Title": "New to board"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Jeanne said it already and better than I could. Thanks for letting us know how you're feeling. Very glad to hear our Drummer Extraordinaire is feeling less pain. After all, we are....RADS BC, featuring TJ TANTRUM. Wishing you a good, pain-free weekend, TJ.",
      "MessageIndex": 4,
      "PostDate": "24/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172404",
      "Title": "Doing Well"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "So glad you are doing well. I will be thinking of you on Monday as you have treatment number 2 and wishing you the best. You know we all have flashlights here to help our sisters coming along behind us!",
      "MessageIndex": 2,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167045",
      "Title": "Special Thank you to All"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Thanks for letting us know how you are doing, Barb. I hope you have been able to eat more. I am so sorry to hear about your friend and also the loss of a long-time survivor. It's always hard to lose someone to this disease, but we fight all the harder,for them and us. Wishing you a quick recovery from the gallstone surgery and a good meal soon.",
      "MessageIndex": 21,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209224",
      "Title": "update on BJMOM"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Claudia, thank you for your post. Joe and I were both thinking of your going through the tests yesterday. No need for further testing does sound like good news to me, as Lynn wrote. Just wish you weren't made to wait as you were yesterday, and until the 25th. At least you have your new Netbook to help entertain you while you wait. What a nice surprise it must have been, when Reggie presented you with a cool new computer. Those Netbooks are neat. As for insurance, I'm with you on that soapbox. Yongy and I supported Hilary, but Joe and I voted for Obama last November.) Thanks again for updating your kindred spirits. We all care about you and are thankful for no concerning test results.",
      "MessageIndex": 18,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173693",
      "Title": "((( CLAUDIA )))) AKA ((( CHENHEART))) Just following up.."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Laurissa, Derbygirl, who used to post here, was taking Arimidex with an ER-positive percentage of 5%. Her oncologist believes that hormonal treatment is beneficial with any percentage testing ER-positive. At least, this was the opinion the last time Derbygirl posted. You might inquire further with your onc. Hope this is of some help.",
      "MessageIndex": 6,
      "PostDate": "28/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/188961",
      "Title": "No tamoxifen for me"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Hello, Judy, just wanted to you to know Joe and I are praying for you and will be thinking of you tomorrow. Hoping that the bone spur is taken care of and no more pain. And no rotator cuff issues, either! Take care of yourself, ok? When you feel up to it, we will be glad to get an update. In the meantime, please rest and know that plenty of prayers are being sent up for you, and many positive thoughts sent your way.",
      "MessageIndex": 0,
      "PostDate": "03/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179054",
      "Title": "Prayers and Good Thoughts for your Surgery Tomorrow, Judy"
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Ah, Mimi, right now you are not seeing yourself as you are. Read the words written to you here and at other times. Read some of the messages YOU have written over the last 8 months. In them, you will see your true reflection. You are beautiful (and remember, we have seen you with and without hair, in pjs as well as elegant gowns) and intimidatingly bright and knowledgeable. More than that, you are a kind and loving soul. Hormones, sure, a drive for perfection, and the sheer wretchedness of having had cancer and the sometimes brutal treatment to beat it--all these and more are affecting your feelings and perceptions. Definitely, tell your doctor how you are feeling, and \"vent\" as much as you want and need. A spa day sounds good, always. But, if you start to look down on yourself again, look to us instead. We know you, dear friend, kindred spirit, sister, bright star.",
      "MessageIndex": 13,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174090",
      "Title": "I'm having a hard time..."
    },
    {
      "AuthorID": "Moopy23",
      "AuthorURL": "https://csn.cancer.org/Moopy23",
      "Content": "Chen, Joe and I will be thinking of you this afternoon and hoping for good test results-- and quick remedies for the pain and swelling you've been having way too long.",
      "MessageIndex": 5,
      "PostDate": "17/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173693",
      "Title": "((( CLAUDIA )))) AKA ((( CHENHEART))) Just following up.."
    }
  ]
}