{
  "AuthorID": "Mosis50",
  "AuthorURL": "https://csn.cancer.org/Mosis50",
  "Posts": [
    {
      "AuthorID": "Mosis50",
      "AuthorURL": "https://csn.cancer.org/Mosis50",
      "Content": "I haven't visited this site in a while. I am not sure why, but I read many of the messages today and felt so blessed by all the stories. You are all such wonderful people and helped me as I started this BC (breast cancer) journey. I am now over half done with my chemo therapy. I finished the AC portion and now am doing taxotere. I will be finished in September. God has truly blessed me with a wonderful support system of family and friends. NOW my question is: What happens after I finish my chemo? How will they (I) know that I am cancer free and the chemo worked? Is there a test they will do? I had a mastectomy in March and had no positive lymph nodes and that was my first answered prayer of many. Thanks for all your help and encouragement!!! Susan",
      "MessageIndex": 0,
      "PostDate": "02/08/2003",
      "ThreadURL": "https://csn.cancer.org/node/140879",
      "Title": "Over half-way done"
    },
    {
      "AuthorID": "Mosis50",
      "AuthorURL": "https://csn.cancer.org/Mosis50",
      "Content": "Toni, Congratulations on getting your first treatment behind you. Take advantage of every day you feel good. The third day was when I started feeling bad and it lasted about a week. Then started feeling better and was feeling good by the time the next treatment started. That was my rhythm and I was able to continue to work during most of the treatments. God Bless You!! Susan (a three-year survivor)",
      "MessageIndex": 2,
      "PostDate": "27/08/2006",
      "ThreadURL": "https://csn.cancer.org/node/151662",
      "Title": "WOW FIRST TREATMENT OVER"
    },
    {
      "AuthorID": "Mosis50",
      "AuthorURL": "https://csn.cancer.org/Mosis50",
      "Content": "My friend lost her battle with cancer today. She was one of the sweetest people I have ever known and didn't deserve all the pain she has had to withstand during her two year struggle. She was diagnosed with breast cancer just 6 weeks before I got my diagnosis so we did a lot of comparing notes. Her cancer metastisized and she continued to fight this terrible disease. She is now at peace and not in pain anymore. God received her into HIS loving arms today. I am not sure how I feel and I just wonder why her and not me. Guess that can't be answered.",
      "MessageIndex": 0,
      "PostDate": "19/09/2005",
      "ThreadURL": "https://csn.cancer.org/node/148355",
      "Title": "Battle Lost"
    },
    {
      "AuthorID": "Mosis50",
      "AuthorURL": "https://csn.cancer.org/Mosis50",
      "Content": "I just wanted to share my good news with the people who have prayed for me and supported me while I am fighting this battle. I had a mastectomy a week ago and today I went back to the dr. for followup and to find out about lymph node involvement. I have ZERO involvement in the lymph nodes and no more cancer was evident in the breast. PRAISE GOD!!! Thank you for all your prayers and genuine concern. You were here when I needed answers and I thank you for that. I will pray for others because I KNOW it works. I will be starting chemotherapy in another three weeks to kill in cancer cells that are floating around. The only bad thing that I had post surgery was an infection in the drainage tubes which they changed today and put me on an antibiotic due to a high fever. I thought it was just the flu. Good thing I called the doctor. I have been so lucky to have a great support system and I thank my friends, family and new friends at this site. Thank YOU and GOD bless you each and every one. Susan",
      "MessageIndex": 0,
      "PostDate": "09/04/2003",
      "ThreadURL": "https://csn.cancer.org/node/139929",
      "Title": "Good News today"
    }
  ]
}