{
  "AuthorID": "mwallace1325",
  "AuthorURL": "https://csn.cancer.org/mwallace1325",
  "Posts": [
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "during taxol, for almost the whole treatment time. Believe it our not, they're actually dry and eye drops will help. I had to see an opthamologist and after tests that was his determination and surprisingly it worked. Hope this helps. marge",
      "MessageIndex": 8,
      "PostDate": "22/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206046",
      "Title": "Wateru eyes"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I'm in Colorado Springs and while they've made some mistakes in legalizing it it is legal here. My primary tells me that you go to a physician and get a prescription. Here then all you have to do is pick the place you want to get it. Apparently in our town there are now 456 licensed facilities (one of the things they didn't plan for). I didn't use it, didn't need to, thank God, but would have if I needed to. If I were you, I'd speak to my onc and just ask. The worst he can say is no, and my doc said that the original intent was for HIV/AIDS and cancer patients. We have enough of a fight on our hands and should be able to explore options for things that may make us feel better and help fight the fight. Don't feel bad about asking. That's one of the things about this site, you can feel free to ask anything. Good luck and I hope if you can't get that you get something that works for you. marge",
      "MessageIndex": 8,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203123",
      "Title": "Medical MJ"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Happy Cancerversary to you. . . marge",
      "MessageIndex": 19,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214130",
      "Title": "3/15..."
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Last year during chemo my onc said the flu shot was OK, but not the swine flu shote. I guess the swine flue one contained live cultures or something and I didn't need at the time. I'd check to be sure because every year the shot is different for different strains. marge",
      "MessageIndex": 10,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200006",
      "Title": "To flu or not to flu"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Have a safe trip. We're all with you in spirit. marge",
      "MessageIndex": 4,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216793",
      "Title": "Thursday AM check-in"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Sorry you had to find us here, but glad you're here if you need us. It is a whirlwind, but since waiting is one of the tougher parts, whirlwind is good. When I was diagnosed in 4/09, my husband and I were raising our granddaughters then 16 and 13. I chose to not tell them anything until I knew biopsy results IDC, stage IIIa with 2/14 lymph nodes involved. That will hopefully will not make sense to you ever because you will be found to be cancer free. Anyway, I didn't tell the girls until I could tell them with certainty that it was b/c and what we were going to be doing about it. So in one conversation I told them the doc had found a lump it was b/c the doc was doing a lumpectomy, then chemo, then rads then I'd be fine, and yes that did me I was a survivor from that moment on (that impressed them) and yes I would be losing my hair (that didn't impress them, but they never made me feel bad when I was bald). You have to tell them in an age appropriate manner of course, but I think and the girls both told me that hearing everything made it easier. McKenzie (the younger) said after treatment that she wasn't scared because I told her what was going on, I told her what they were going to do, they did it and now you're fine. Hope this helps. Feel free to come here anytime. Keep us posted on your results. marge",
      "MessageIndex": 2,
      "PostDate": "19/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238981",
      "Title": "I am very scared!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "for taking the time to keep us posted. It's so great that your girls will have time to spend with their mom. Our thoughts and prayers are with you family always. marge",
      "MessageIndex": 21,
      "PostDate": "11/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202960",
      "Title": "Lesley is home"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Ladies, thank you for all your good wishes. I'm truly enjoying sitting in the back with a \"special brownie\" and a glass of wine. My MO has known me for two years, so noise and general insanity are expected when I'm there. He's even having them mark off space in the parking lot for the \"pink bus\". Emamei, hope you wake from surgery pain free, ready for a speedy recovery. Thanks again. Thoughts and prayers for you all. marge",
      "MessageIndex": 30,
      "PostDate": "01/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219583",
      "Title": "Two Kindred Spirits need the Magic Pink Bus and our Prayers for appointments on Wednesday and Thursday"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "This morning was my six month visit with my MO. I wasn't really nervous until this morning, when I couldn't stop crying. The route to the hospital kicks up my PTSD and that's after beginning to get nervous at home. Doc walked in told me I looked like a million bucks except for the tears. I've lost 33 pounds since he last saw me. Said everything was good and see me in six months. Best Christmas present I can imagine. Hope everyone's visit/mammo/test comes back great as well. marge",
      "MessageIndex": 0,
      "PostDate": "13/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232158",
      "Title": "Six month visit with Med Onc"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Great to hear when things aren't as bad as our fears. Hopefully this does what's needed to be done. marge",
      "MessageIndex": 1,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203542",
      "Title": "Cyberknife was a BREEZE!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I'm so sorry for your loss and Bear's too. Having 4 cats and 2 dogs I feel your pain. marge",
      "MessageIndex": 81,
      "PostDate": "22/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I'm so sorry for your loss and Bear's too. Having 4 cats and 2 dogs I feel your pain. marge",
      "MessageIndex": 30,
      "PostDate": "22/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "It's so normal to feel this way, especially towards the end of treatment. I didn't care that I knew my hair would grow back, being bald SUCKS. I knew I'd get strength back, but so what I was exhausted then. I knew the steriods were making me gain weight and that would stop when they stopped, but I wanted it all to go away. I wanted to be the old me who never in a million years thought she'd have bc. I wanted to go back to when I didn't know what chemo was or how it was administered. You're almost done and that means the effects are cumulative. Everything you feel is a result of the tremendous battle you've been waging (and winning). I'm seven months from finishing treatment - lumpectomy, chemo and rads. I've stopped the femera (my choice, doc won't agree) but I finally feel like the old me. It will be over, you will feel better and a new/old normal will come to you. Let us know any time we can be of help. marge",
      "MessageIndex": 20,
      "PostDate": "13/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200759",
      "Title": "Cried my eyes out tonight !!!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Thank you Jean for posting this. marge",
      "MessageIndex": 3,
      "PostDate": "27/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/227180",
      "Title": "Pinkflutterby's (Libby's) Obituary"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "except stay strong. Lots of prayers and hugs on their way to you. marge",
      "MessageIndex": 1,
      "PostDate": "21/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210344",
      "Title": "it's back again....... in my spinal fluid"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I'm so sorry to hear you have to go thru this on top of everything else. Please talk with a counselor about your sanity and emotional stability. I'm also thinking that if you've gotten emails or other evidence of what's going on, maybe you could gather that, copy it then stop looking for more. I'm afraid having to continue finding evidence will just be harder on you than you need. Prayers and angels surrounding you as you navigate this issue. marge",
      "MessageIndex": 64,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I'll be outside waiting sending prayers and angels. marge",
      "MessageIndex": 4,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/229504",
      "Title": "The Pink Bus Is Rolling For Sue Relays - Let's Show Our Support"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "What a great idea. Count me in. marge",
      "MessageIndex": 14,
      "PostDate": "29/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225318",
      "Title": "1 Week -- Prayer and Candle VIGIL -- starting 8/28/11 -- 8:00 EST // STRENGTH, COURAGE AND HOPE"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I'm so sorry to hear you have to go thru this on top of everything else. Please talk with a counselor about your sanity and emotional stability. I'm also thinking that if you've gotten emails or other evidence of what's going on, maybe you could gather that, copy it then stop looking for more. I'm afraid having to continue finding evidence will just be harder on you than you need. Prayers and angels surrounding you as you navigate this issue. marge",
      "MessageIndex": 14,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I'm so very sorry that you and your family are going through this. You certainly deserve to vent and I wish there was something I could do to help. How helpless you must feel and how scary for your kids and your wife. Hopefully you can find some comfort in knowing what a wonderful husband and father you are. Saying hang in there, this too shall pass sounds so ridiculous, but there are no words to comfort you right now. Please let us know what the tests show. Prayers and good thoughts are coming to all of you. marge",
      "MessageIndex": 16,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202578",
      "Title": "DOES IT EVER STOP????"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Poor thing, I'm sorry you seem to be having issues on so many different fronts. Praying that all your appts. go better than you could dream and all tests come back negative, or with things that are simple to fix. As for your 12 year old daughter, all I can say as a grandmother who's raising an 18 and 15 year old, just keep praying and hang on to the fact that soon she'll be 13, although that may not be any better, just closer to being an adult. marge",
      "MessageIndex": 6,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220199",
      "Title": "finding things a little difficult - acupuncture update"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Congrats on the good news. Isn't it wonderful to have something to focus on when you're in that place you don't want to be. We couldn't get thru all this without each other and the pink bus. Enjoy a long long dance with NED. marge",
      "MessageIndex": 2,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223231",
      "Title": "Make room for one more on the dance floor."
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Good news is always welcome. Keep up the good work and I'm sure you'll find a way to use that extra time. marge",
      "MessageIndex": 15,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223189",
      "Title": "126/84"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Eva, So sorry you're having to go through this. It's sometimes so hard to think there will ever be a time after cancer. You're entitled to cry, to ask God why (cause he can take our questioning), to feel like you'll never get through this, to wonder why you. We've all been there and done that. Chemo sucks, it's a thing you wouldn't wish on your worst enemy, but you will get through it. You will come out of this horrible time and you will find your new normal, which may be better than your old normal. You'll find you love those you love more, get less annoyed with things that are annoying, because it's not worth it. Please feel free to come and vent anytime. We're here for you. marge",
      "MessageIndex": 3,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224523",
      "Title": "life changing"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Isn't it wonderful to get a diagnosis that doesn't include the \"c\" word. I've had asthma for years; once they get you the right inhaler(s) you'll feel great. Have a super week end. marge",
      "MessageIndex": 2,
      "PostDate": "21/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228884",
      "Title": "YeAAAAH Asthma Babey!!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Nancy, Praying that this drug is as easy on you as it will toxic to the beast. So glad you got into the trial. The first dose will be the hardest only because of the unknown. Prayers and angels for you and your medical team. marge",
      "MessageIndex": 1,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/221108",
      "Title": "Wish me luck! Here I go with the new chemo drug!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I'm so sorry you've gotten this news. I know you want to keep him around as long as possible if he's not in pain. Just a thought for you to consider. We have a lab/husky mix and he's epileptic. He's had seizures since he was about a year old. He takes meds and that keeps them down to a minimum. Our vet has explained that when he has one it's the equivalent of running a full marathon, and the rise in temperature and brain activity can literally fry his brain if the seizure goes on too long, or if he has more than one at a time. They're doable (funny how that's a normal word on this site) but if he has one and doesn't stop seizing in 2 - 3 minutes or has several in a row -- GET HIM TO YOUR VET. That could kill him. They're so hard to watch, all you can do is keep him from falling and hurting himself on stairs, etc and talk to him. Bear usually takes about a 1/2 hour to \"come back\" and recognize us and know where he is. His favorite spot to hide is our shower (his idea of a crate). I'm sorry you're faced with all this. Hope this info helps. marge",
      "MessageIndex": 20,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214129",
      "Title": "my dog has cancer"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "It's purple and if I can't have that then orange. marge",
      "MessageIndex": 28,
      "PostDate": "30/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/231219",
      "Title": "I thought it would be great to see what your favorite color is, so, what is your favorite color?"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Green leaves on my butterfly tattoo. Happy St. Pat's everyone!!!!!! marge",
      "MessageIndex": 4,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214334",
      "Title": "green: Who is wearing GREEN today?"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Good to see you post again and glad you had a great trip to disney world with your son. So sorry to hear about your continued struggles. I'm praying for successful, easy, chemo and great results from that. marge",
      "MessageIndex": 7,
      "PostDate": "02/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219698",
      "Title": "Update on Bjmom1"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "So happy to hear your good news, Robert. We'll all be with you in spirit at the relay. May even show up in the pink bus. Don't worry it sure wasn't my shirt flying through the air. At this point that's a visual no one wants or needs. LOL Thanks for the happy news. marge",
      "MessageIndex": 10,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/239014",
      "Title": "More \"Positive News\" - Monthly onc visit & Zometa Infusetion"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Isn't that just one of the best sounds. Congrats.",
      "MessageIndex": 11,
      "PostDate": "21/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/201454",
      "Title": "Teacher says, \"Every time a bell rings..."
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "So happy to hear you're done with chemo. What a cute picture of you and Hestia. Rads will be a piece of cake compared to what you've just done. marge",
      "MessageIndex": 14,
      "PostDate": "02/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/204621",
      "Title": "Finished Chemo!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Nancy, so sorry for your loss. You're right though, it's ironic that returns to her family on St. Patricks Day. marge",
      "MessageIndex": 2,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214341",
      "Title": "With a heavy heart.."
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I went off femera for two months on my own because of side effects. I think you'll be fine since you've been on it for 4 years. marge",
      "MessageIndex": 2,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/207687",
      "Title": "missed doses of Femara"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "there was a post on here, I think last Friday. It listed a link to a site that was giving them free. I ordered one. Can't remember who originated the post (chemo brain) but pretty sure of the date. marge",
      "MessageIndex": 4,
      "PostDate": "12/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203106",
      "Title": "MEDICAL BRACELETS"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "my gyn recommended replens but i'm allergic. we're just using the old reliable k-y. marge",
      "MessageIndex": 6,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237801",
      "Title": "I need info on sex!!!!!!!!!!!!!!!!!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "my gyn recommended replens but i'm allergic. we're just using the old reliable k-y. marge",
      "MessageIndex": 8,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237801",
      "Title": "I need info on sex!!!!!!!!!!!!!!!!!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "my gyn recommended replens but i'm allergic. we're just using the old reliable k-y. marge",
      "MessageIndex": 5,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237801",
      "Title": "I need info on sex!!!!!!!!!!!!!!!!!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Janie, I sooooooo know the feeling. I'm on arimidex and between the dryness and negative sex drive I feel bad for my husband. marge",
      "MessageIndex": 11,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237801",
      "Title": "I need info on sex!!!!!!!!!!!!!!!!!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "my gyn recommended replens but i'm allergic. we're just using the old reliable k-y. marge",
      "MessageIndex": 7,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237801",
      "Title": "I need info on sex!!!!!!!!!!!!!!!!!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Janie, I sooooooo know the feeling. I'm on arimidex and between the dryness and negative sex drive I feel bad for my husband. marge",
      "MessageIndex": 10,
      "PostDate": "26/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237801",
      "Title": "I need info on sex!!!!!!!!!!!!!!!!!!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Praying for a good outcome for your mom and peace for all of you. marge",
      "MessageIndex": 5,
      "PostDate": "30/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/227376",
      "Title": "plz pray for my mother ,she is suffering from breast cancer and bone infection"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Not only your new hair but you look great. Enjoy the wash and wear. marge",
      "MessageIndex": 22,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198674",
      "Title": "This is me with 5 months of new hair."
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Sorry you're not feeling good. Hope you were OK for treatment and that both yours and your mom's went just fine. marge",
      "MessageIndex": 10,
      "PostDate": "30/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/202236",
      "Title": "ughh Chemo #5 and I'm sick!"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Suddenly there's a purpose for my kitchen, or at least my microwave (besides reheating take-out). Thanks, this sounds sooooo good. marge",
      "MessageIndex": 4,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217347",
      "Title": "off topic...The Most Dangerous Chocolate Cake in the World"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "Sorry you're in the position of needing re-porting. When my MO told me it was time to be de-ported I argued that I was very superstitious and content to keep it, just in case. He said he was also superstitious and if I ever needed it again it was no problem to re-port me. Not sure if it'll be in exactly the same spot, but he made it sound like if it were necessary it wouldn't be a big deal. Hoping the rest of your treatment is as easy as it can possibly be. marge",
      "MessageIndex": 1,
      "PostDate": "08/02/2012",
      "ThreadURL": "https://csn.cancer.org/node/235335",
      "Title": "Many of us have been \"deported\"-anyone been re-ported?"
    },
    {
      "AuthorID": "mwallace1325",
      "AuthorURL": "https://csn.cancer.org/mwallace1325",
      "Content": "I too had a lumpectomy but want you to know my prayers are with you that you'll be at peace, whatever you decide. marge",
      "MessageIndex": 6,
      "PostDate": "31/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/229501",
      "Title": "Would love support and words of encouragement....."
    }
  ]
}