{
  "AuthorID": "Nana C.",
  "AuthorURL": "https://csn.cancer.org/Nana C.",
  "Posts": [
    {
      "AuthorID": "Nana C.",
      "AuthorURL": "https://csn.cancer.org/Nana C.",
      "Content": "Thank you so much for your kind words! I have always been more of a listener than a talker , so what a nice surprize to share my feelings and get such lovely responses. I love you all. Hugs and Prayers, Nana",
      "MessageIndex": 10,
      "PostDate": "13/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230218",
      "Title": "I am wishing a Happy Veteran's Day to everyone and also sending a thank you to all of those that have served our country!"
    },
    {
      "AuthorID": "Nana C.",
      "AuthorURL": "https://csn.cancer.org/Nana C.",
      "Content": "Dear Sister, My youngest son is in the Marines, has been in for 12 years. He went in right after High school and has served 3 tours in Iraq and is now in the mountains of Afganistan. I am trying so hard to leave it in the hands of God, that is what my husband tells me everyday. It has never been easy when he is deployed, but his time I am having a horrible time with it. There are not communication in the area he is in, his wife gets few phone calls. I do have faith, but every minute of the day I think about him in the mountains of afganistan. He has a lovely wife and 3 children waiting for him to return. Please pray for him and you do all of our devoted military. Thank you so much. Hugs and Prayers Nana",
      "MessageIndex": 7,
      "PostDate": "12/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/230218",
      "Title": "I am wishing a Happy Veteran's Day to everyone and also sending a thank you to all of those that have served our country!"
    },
    {
      "AuthorID": "Nana C.",
      "AuthorURL": "https://csn.cancer.org/Nana C.",
      "Content": "Eva, I felt the same way, only my \"After Tomorrow My life will never be the same\" moment came the night before I was to get my results of biopsy. From the moment I felt the tumor I new what it was. You are so right Baby Steps, thats what it takes. After I accepted the fact that I would be having a new normal the days became easier. The wonderful women on this site taught me that having a new normal was ok. I haven't been to active on this site as far as posting, but have read post everyday. You have come to the right place! So much Love from people that have probably never meant each other! God Bless Eva",
      "MessageIndex": 8,
      "PostDate": "15/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224523",
      "Title": "life changing"
    },
    {
      "AuthorID": "Nana C.",
      "AuthorURL": "https://csn.cancer.org/Nana C.",
      "Content": "Oh Kat, I like everyone else on this board are truly amazed by all you do while going through all that you have. Your roommate has no idea what she has lost! Having a friend like you is hard to find! You certainly don't need her drama, invented drama. I pray everyday for you as everyone does, we all love you. Please keep in touch as you can. Good luck with that new relationship! Hugs Nana",
      "MessageIndex": 15,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://csn.cancer.org/node/235745",
      "Title": "Time for an update!"
    }
  ]
}