{
  "AuthorID": "new2me",
  "AuthorURL": "https://csn.cancer.org/new2me",
  "Posts": [
    {
      "AuthorID": "new2me",
      "AuthorURL": "https://csn.cancer.org/new2me",
      "Content": "Thank you Kickie Kelly",
      "MessageIndex": 1,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195011",
      "Title": "My Survivor's Poem Hope you enjoy Much Love"
    },
    {
      "AuthorID": "new2me",
      "AuthorURL": "https://csn.cancer.org/new2me",
      "Content": "So sorry to hear you have to go through all this. This is all new to me too. When I had my first appt with the Oncologist he already had all the information on me. We sat and talked and he explained what we have to do. Test etc.... he did axamin me. He was very kind and gently and very understanding. Make sure you have family members with you to take notes. My daughter took notes that I refer to today. Try to have questions ready for the Onc. My family even asked questions. You will receive alot of info. don't stress yourself over it -you can go back over the notes later. When were you diagnosed? I was diagnosed in April and had my first treatment Friday. Feel free to ask anything you want. :)",
      "MessageIndex": 3,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194881",
      "Title": "First Oncology appointment/ What to expect?"
    },
    {
      "AuthorID": "new2me",
      "AuthorURL": "https://csn.cancer.org/new2me",
      "Content": "Friday I had my 5th treatment (1 more to go) and usually I feel pretty good on the Saturday and Sunday that followed. But today - I just didn't feel myself. I felt very water logged, my stomach just wasn't itself and I didn't want to do much of anything. My husband is at a family party that I just didn't feel like attending and for some reason, tonight I just cried. I took the time to just talk to God and cry. I simply don't like how I look - I miss my hair. I had beautiful blonde hair ya know and I was fairly pretty. But lately i don't feel pretty. I've gained 15 lbs and I feel fat. Before I was diagnosed with BC - I very active and had lost 25 lbs and dropped to a size 10. Today I can't wear those clothes and it upsets me terribly. My breast are all scarred up with one barely there ( I had a lumpectomy) I use to feel good every day and had no health problems and now I don't feel too good on most days. Fighting these side effects can wear a person down. My head knows that my hair will grow and the weight gain is due to chemo and steriods. But my heart just wants me back the way i was. I was healthy, felt good all the time, and I looked pretty darn good for being 50. I am just not the Kelly I use to be. And I want her back. I know these feeling of pity will pass & I'm sorry to be such a downer tonight - I guess I just needed a Sympathetic ear. Am I the only one here that had gone through these emotions? Is it the poison running through my body causing me to be so emotional ? thank you for listening - everyone here has been such a blessing to me. Love you all. Kelly",
      "MessageIndex": 0,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200759",
      "Title": "Cried my eyes out tonight !!!!"
    },
    {
      "AuthorID": "new2me",
      "AuthorURL": "https://csn.cancer.org/new2me",
      "Content": "Love my port - treatments were a snap with it - blood draws are also simple. I barely know it's there. In my opinion - it's worth getting. :) Good luck to ya, Kelly",
      "MessageIndex": 2,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211318",
      "Title": "any thoughts on portacaths?"
    },
    {
      "AuthorID": "new2me",
      "AuthorURL": "https://csn.cancer.org/new2me",
      "Content": "I am 4 months out from chemo - still have numbness in my fingers but nothing like it was - It will get better in time - like the others have said - we are individuals with different side effects. I know how you feel, I felt the same way - I wnated my old life and the old me back in the worst way. but I have since found that I have evolved into a beautiful woman and I love the place where God has brought me. Yes, I am different but better different :) Everything is so much more meaninful to me now & I cherish everyday. Draw close to your faith - mine has got me through (along with my family) I turned 50 last year and then I was diagnosed with BC and I feel like i lost that whole year, but this year - turning 51 - is gonna be the best. Dear friend - if you can ... try try try to look at the positive, keep your eyes on tomorrow, & your attitude up and I promise... IT WILL GET BETTER. Love Always, Kelly",
      "MessageIndex": 5,
      "PostDate": "15/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212243",
      "Title": "Where do I go from here?"
    }
  ]
}