{
  "AuthorID": "pamcb3",
  "AuthorURL": "https://csn.cancer.org/pamcb3",
  "Posts": [
    {
      "AuthorID": "pamcb3",
      "AuthorURL": "https://csn.cancer.org/pamcb3",
      "Content": "Hi, I am out of treatment for two years now and I am a hairdresser so I have personal experience and professional.  i have everyone use nixing shampoo and conditioner. It comes in choices of 1,2,3,4 for various levels of thin hair. You shou pick two or three... buy it now and start using it. Also purchase Moroccan oil Now and start using it. Two to three pumps /drops massaged into your scalp  after shampooing and before you dry your hair. I had been using all of these products for a while and I never experienced any scalp sensitivity. A friend of mine had breast cancer the year before I did and when I shaved her head for her I gave her the products the Moroccan oil helped with the scalp sensitivity a lot! So the sooner you start using it the better your head will feel. I shaved my head the day after my second treatment. It will start to fall out about 10-14days after your  first treatment. It's best to shave it all at once. Continue to use the shampoo and conditioner as if you had hair and put the Moroccan oil on your head twice a day always cover your head when you go out. Avoid the sun. Good luck to you! You can do this!!!  ",
      "MessageIndex": 8,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://csn.cancer.org/node/268615",
      "Title": "What hair loss related products did you find most useful? Upcoming 1st chemo....."
    },
    {
      "AuthorID": "pamcb3",
      "AuthorURL": "https://csn.cancer.org/pamcb3",
      "Content": "Hi again,   I would also go for a wig before your hair falls out.  And ask about the look good feel better program in your area! I would also suggest going to that before you start. I never felt good enough to go. They seemed to always be at my low point. I purchased two hats that had 50spf in them. They were not cheap $40-50 each but I still use them because they are cute!:) if your insurance won't cover a wig there are many programs for free ones, the look good feel better program should be able to help with that! Everyone's journey is different so don't compare yourself to anyone else. Good luck! :)  ",
      "MessageIndex": 9,
      "PostDate": "28/03/2014",
      "ThreadURL": "https://csn.cancer.org/node/268615",
      "Title": "What hair loss related products did you find most useful? Upcoming 1st chemo....."
    }
  ]
}