{
  "AuthorID": "phoenixrising",
  "AuthorURL": "https://csn.cancer.org/phoenixrising",
  "Posts": [
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I never did like it. I figured I could be stupid and eat junk all by myself, I didn't need any help. But I did get it for my mother-in-law when she had b.c. mets and the morphine was making her too constipated. What I did was make a very, very strong tea and she took about a shot glass of it now and then. She didn't get high and it did help her pain very much. Legal?? I didn't care. If it was going to help her then it would be done. Not the same as the medical mj but some info for you all the same. Best of luck to you.",
      "MessageIndex": 12,
      "PostDate": "13/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203123",
      "Title": "Medical MJ"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Thank you for sharing that Joyce, I feel the same way. I too haven't always thought well of myself, more like self contempt, however one look at that cute little girl of long ago makes me want to hold her tight and give her all my love. Weird world isn't it. They should have given us a manual when we came on board :) A big happy valentine to you to. jan",
      "MessageIndex": 5,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://csn.cancer.org/node/156929",
      "Title": "self love"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Congratulations Kathi, it sounds like it's going to be a blast. Please get pictures. I know all of us will want to see them. jan",
      "MessageIndex": 6,
      "PostDate": "06/03/2008",
      "ThreadURL": "https://csn.cancer.org/node/157129",
      "Title": "Look for me on the catwalk!!!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "How heartwarming! Bless your sweet heart! Hope you have a great trip!",
      "MessageIndex": 6,
      "PostDate": "18/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224703",
      "Title": "Amtrak"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Tough call! However whenever I was in a dilemma in making a decision like yours I would project myself to the future and imagine how I would feel if it came back. Would I be OK with the decision I'm making today? Or would I say, geez, wish I had of done chemo, maybe I wouldn't have had a recurrence or mets today. Whatever decisions we make we need to be OK with them regardless of what may happen in the future. Hope this helps. love jan",
      "MessageIndex": 9,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166762",
      "Title": "my choice to do chemo????"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Eil, sleep is so critical to our well being. My husband is the same. If I could give him anything it would be a few nights of a really good sleep. If you choose to participate I'm sure you will learn a lot from the researchers even if you are in the placebo arm. Good Luck to you. love jan",
      "MessageIndex": 3,
      "PostDate": "16/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167422",
      "Title": "cancer survivor sleep problems"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Hi Nancy, I had Cytoxan as a cocktail with 5FU and Epirubicin. The taxotere was given last and on it's own. I didn't get any mouth sores until I had the taxotere and then I got them really bad. Don't know if everyone does though. There are mouth rinses that give almost immediate relief. Ask about using ice chips to help prevent them. They may not completely prevent them but they can make a real difference. This was suggested to my husband when he had 5FU for colorectal cancer and I used them also for 5FU. Don't know why they didn't suggest it for the taxotere though. Best of luck to you...hope it's a smooth ride :) jan",
      "MessageIndex": 1,
      "PostDate": "20/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216702",
      "Title": "Are mouth sores common with T/C?"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Joyce, I only get notification when someone replies to my post but I haven't edited anything either. Must be a glitch in the system and a job for Super Dana to look into. Chin up dear, I'm sure a lot of people are experiencing the same thing and it will be resolved shortly.",
      "MessageIndex": 2,
      "PostDate": "19/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163594",
      "Title": "Not the sharpest tool"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "So sad indeed. It's been observed by many people that our daughters are developing much earlier than before. The blame for this is often put on the hormones in our meat and dairy and the xenoestrogens that we wear or consume inadvertently. I don't know if any of this is conclusive though but I wish we were using our research $ to investigate this further. Even if they found a cure it's not enough. These girls shouldn't have to go through it in the first place. That's just my 2 cents. jan",
      "MessageIndex": 6,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168739",
      "Title": "10 year old girl with cancer"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "You're not alone Suzanne, there's an entire movement dedicated to eliminating the commercialization of breast cancer. \"Think before you Pink\" and \"Breast Cancer Action\", is another. They call it \"pink washing\" and find it offensive that the pink ribbon is used on products that are suggested to cause breast cancer, like the fat in Kentucky Fried Chicken or alcohol. They also feel that more attention should be given to metastatic bc. Perhaps we should have a glass of wine and ponder this some more... hugs jan",
      "MessageIndex": 7,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224234",
      "Title": "Wine Whine"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I put on 10-15 with Tamoxifen. I don't usually have to watch my weight but with that it didn't seem to matter how little I ate. I think water retention might play a part as well.",
      "MessageIndex": 10,
      "PostDate": "21/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208086",
      "Title": "Tamoxifen and weight gain"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Glad it's arrived and hopefully you'll get trained real soon and get some relief. I've never heard of them but glad you have and that you have one. Hope you don't have to wait too long.. jan",
      "MessageIndex": 3,
      "PostDate": "09/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209394",
      "Title": "My Flexi-Touch MLD is in - Get it Jan 19th"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Yes, definitely, I had it....just can't remember if I was on Tamoxifen or Aromasin at the time. I am positive it was related to the drugs. It was diagnosed as Plantar Fascititis and mollieb has written a great post on it. Stretching as she describes does help. I am convinced my meds had something to do with it.",
      "MessageIndex": 3,
      "PostDate": "22/09/2011",
      "ThreadURL": "https://csn.cancer.org/node/226813",
      "Title": "sore Heals"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "error",
      "MessageIndex": 3,
      "PostDate": "13/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167306",
      "Title": "Anyone else have itchy, red bumps during Radiation?"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Taxol made me feel horrible! I woke up hating the world and me too. Every negative thing was under the spotlight. And that was the chemo I thought would be easier. Part of what you're feeling is just the effects of the chemo so I'm glad you're holding off until you're at home. Therapy can be a wonderful mood lifter so I'm glad you're seeing someone who can put things in perspective for you even though this is certainly a tough road. Even Mother Theresa had problems with faith at times so don't be hard on yourself :) Hugs to you jan",
      "MessageIndex": 14,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224050",
      "Title": "I am so sorry I am I such a basketcase......"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "This must be very difficult. Working on your daughters case for so long and now it's over must leave an empty spot. My heart goes out to you. I'm sending you a big hug. love jan",
      "MessageIndex": 7,
      "PostDate": "12/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164595",
      "Title": "My daughter Stephanie's lawsuit settled..."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Debbie, I'm so sorry you're having to do battle again! As someone said, we have to be so proactive and follow our instincts. Unfortunately we aren't always feeling up to it. A sweet sister who used to post here (Joyce Louise)once said, they don't serve weak at this restaurant. I'm glad to hear you're moving over to the Mayo Clinic and hope your treatment is successful. hugs jan",
      "MessageIndex": 45,
      "PostDate": "12/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Debbie, I'm so sorry you're having to do battle again! As someone said, we have to be so proactive and follow our instincts. Unfortunately we aren't always feeling up to it. A sweet sister who used to post here (Joyce Louise)once said, they don't serve weak at this restaurant. I'm glad to hear you're moving over to the Mayo Clinic and hope your treatment is successful. hugs jan",
      "MessageIndex": 95,
      "PostDate": "12/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "That was great! I loved meeting all of you and hearing your voices. Sorry I wasn't too vocal but the aromasin is kicking my butt.",
      "MessageIndex": 5,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172708",
      "Title": "It Was A Great Conference Call Today! :)"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I really wish I could take this crap off your plate...I really do. Know that you are in my thoughts and prayers and I am wishing you the best outcome. Many hugs jan",
      "MessageIndex": 14,
      "PostDate": "09/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224064",
      "Title": "Treatment plans, Side Effects, you Kindreds know, the usual!!!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Hi Gail, my husband had nodes that kept showing up on the CT scan and it was thought it was just debris after his colorectal surgery. So this is entirely within reasonable thinking. I can understand your anxiety but your surgery wasn't that long ago, right? And so neither were your presurgery tests of your lungs and chest. We'll all keep our fingers crossed for you anyways ;) cheers jan",
      "MessageIndex": 2,
      "PostDate": "27/11/2007",
      "ThreadURL": "https://csn.cancer.org/node/156271",
      "Title": "oncotype"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "RE, sounds like you've got your priorities straight :) Hope to \"meet\" you next time.",
      "MessageIndex": 11,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172708",
      "Title": "It Was A Great Conference Call Today! :)"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Hi Mono, I read the article but can't remember too much about it except I think it was a strong argument FOR the oncotype dx testing. This certainly reduces the number of women having to endure chemo and it's se. We are all so different so the move to personalized medicine is good news to me. What did you think of the article? hugs jan",
      "MessageIndex": 1,
      "PostDate": "12/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171577",
      "Title": "Interesting cancer study... looking for feed back."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I don't think the weather has changed anything for me so far. I haven't had any reconstruction done yet, but my surgical site is often very sore and sometimes even the softest clothing can irritate it. We've had a lot of nerve damage done and that can take along time to heal. Here's hoping for a quick recovery for all of us. :) cheers jan",
      "MessageIndex": 4,
      "PostDate": "08/11/2007",
      "ThreadURL": "https://csn.cancer.org/node/156092",
      "Title": "Is it just me"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "",
      "MessageIndex": 34,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Hi Wibby, welcome to the club you never wanted to join. All microcalcifications aren't cancer. It depends on the formation. The radiologist can tell whether it's anything to be concerned about or not. I had microcalcifications that were in such a formation that he knew right away it was cancer. I have it in the breast I have left and it's not cancer. My doc also said she had it in her breasts, but it's not cancer. If it was they'd start talking to you about tx. So I wouldn't worry. Let us know if you need any help, there are tons of wise women ready to share their wisdom and experience. Good luck to you jan",
      "MessageIndex": 1,
      "PostDate": "07/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164468",
      "Title": "Microcalcifications?"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Congratulations!! The only thing better than being a grandmother is being a great grandmother. What a special time for you and your family. I'm so happy for you :) jan",
      "MessageIndex": 16,
      "PostDate": "30/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/204431",
      "Title": "Sharing Good News - New Great Grandson (Non-breast cancer related)"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I just keep it in the bra and put it aside till morning. Haven't used the form since I got it. Seems to be holding up pretty good.",
      "MessageIndex": 2,
      "PostDate": "26/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208522",
      "Title": "Bra"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "You're right. It sucks! But I would rather do surgery and rads than chemo again so perhaps the worst is over and each day/week you will feel better from the chemo. Your taste will come back, nausea will diminish and bits of energy will return. A great sister who doesn't post anymore once said, \" they don't serve weak at this restaurant\" and you will find out that you are stronger than you thought you were because you will see the other side to all this and look back and comment on what a crappy ride it was but at least it's done and you've done all you could. We will be here with you through all of it giving you tips and advice on how to make you more comfortable. Try to take a deep breath and know all the worry in the world will not change what's coming up except put you in a weakened condition when it arrives and destroy today. I honestly know how you feel. I tried getting out of my 3rd chemo and they had to cut it back to 75% because of se. I'm on the other side and I'm glad I did it. Hugs to you, hope you're feeling better soon. jan",
      "MessageIndex": 20,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208948",
      "Title": "Need to vent...I am so.."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I got a little confused when I read your post. I had an MRI done and at the bottom of the test results it stated that an MRI doesn't read microcalcifications. So I wondered if there was a different MRI than the one I had. I looked it up on: http://www.cancer.gov/cancertopics/factsheet/Detection/breast-cancer and they state: Like ultrasound, MRI cannot detect microcalcifications. Could you help me out cause I ran out and had a mammogram after reading that since my bc was determined through the microcalcifications and I need to monitor that. Thanks a mill jan",
      "MessageIndex": 5,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164468",
      "Title": "Microcalcifications?"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "That is so interesting, thanks for the info. I need to look into this more. jan",
      "MessageIndex": 8,
      "PostDate": "14/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164468",
      "Title": "Microcalcifications?"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Seriously, it's been ~2yrs since my last chemo tx and although I am back to work, I still can't do full time. I work Mon, Wed and Fri 'cause I need the break in between. For instance I was soooooooooo tired by the time I finished today I just sat in the truck and vegetated for awhile. Then I grabbed an iced cap at Timmy's and sat by the river. I think it has to do with the hormone blockers but it ticks me off that others are able to get back to normal (sort of) and I'm still floundering about. What's your secret??? Thanks for all your help. hugs jan",
      "MessageIndex": 0,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171101",
      "Title": "How long does fatigue last??"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I think they like you.",
      "MessageIndex": 33,
      "PostDate": "22/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I love the geese! Fall and spring Canada geese and trumpeter swans migrate through our area and stay for about 6 weeks or more. It's a real signal to the end of winter when I hear the first geese fly through. Hundreds and hundreds of swans and geese land here and it's so wonderfully noisy, it raises my spirits to see and hear them and I'm usually out with my camera trying to get good shots.",
      "MessageIndex": 7,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208963",
      "Title": "It's morning here, and the skies are filled with geese...."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Congratulations!! I don't know if there is a finer feeling than being done with that stuff. I still remember clearly the weekend of my last chemo and it was great! Good luck to you with your last shot and hope you feel good enough to celebrate. hugs jan",
      "MessageIndex": 8,
      "PostDate": "11/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169806",
      "Title": "3 Taxol down, 1 to go..."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Pear....I like your thinking!! :)",
      "MessageIndex": 3,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208948",
      "Title": "Need to vent...I am so.."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "How wonderful to hear your good news:) There had to be a break in the storm sooner or later. One note though. I don't know how long your husband has been on steroids or how long they will keep him on them, but check with your onc about supplementing with calcium as steroids prevent the absorption of this mineral. Some suggest taking Vit D3 as well. This is usually for long term steroid use. Hope you've had a wonderful day. jan",
      "MessageIndex": 5,
      "PostDate": "14/05/2007",
      "ThreadURL": "https://csn.cancer.org/node/154436",
      "Title": "A better day for Mother's Day"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "It is time they cared for you but old habits may be hard to break. If all they've ever had to think about is themselves then that's probably all they're going to think about. Some people are born considerate and some learn it along the way but a great majority of people are really quite self centered and unfortunately sometimes they are our family. I do know how it can hurt. What I've been trying to do is feed that which bears fruit. No more one way street when it comes to relationships. But I can tell you that is hard to do with family cause we love them still. I hope at least one of them does something special for you soon to turn this around. hugs jan",
      "MessageIndex": 4,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168677",
      "Title": "I am so dissapointed in my family"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Traci, thank you for your good news....and no \"good news\" is trivial...we need it :) Congratulations on your blood pressure and no SE is bonus!! I'm sure you can find something to do with your extra time...enjoy your life! hugs jan",
      "MessageIndex": 28,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223189",
      "Title": "126/84"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Love your cat, it looks like mine except for the ear. What happened? Mine has one blue eye and one yellow. Freaked us out the first time we saw him :)",
      "MessageIndex": 2,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206180",
      "Title": "It's in the mail!!!!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Heather, I'm sorry but I haven't experienced all that you're going through. It seems like you're in the middle of the perfect storm, but I have a feeling that beautiful little girl will help you get through it all. The sun is shining on the other side and you will get there and be better than ever. I send you lots of hugs and warm wishes jan",
      "MessageIndex": 7,
      "PostDate": "05/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/163429",
      "Title": "I may have already posted this but 125ca #'s up!!!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Linda Update by Lisa Martin Written 41 minutes ago Hi, this is Lisa Martin, logging in for Linda. She and I wanted to update you on what’s been going on. Yesterday she was admitted into the hospital after spending the night at emergency. For the past several weeks, since radiation, she has been having really bad headaches in addition to the ear infection, and has been sleeping for 20 hours a day. Her fever and chills seems to have finally subsided, but the headache and nausea is worse, and the skin blistering and swelling is also spreading over her head and face. She’s getting morphine every 2 hours to help with the pain, and they have her on iv’s and resting. The doctor said they think it’s a reaction to the brain radiation, but they don’t really know anything else. Her CAT scan showed no brain swelling and that everything seemed fine. Blood work was normal too. No MRI scheduled at this time, and the doctor feels she should be hospitalized until the severe pain is managed and the nausea is better, as there is a concern for dehydration. Karl is doing great at holding down the fort with the kids; Gabe’s football team won the game on Friday night, and even though Mom & Dad were at the hospital, they are very proud of him! Karl’s also been shuttling the kids around and managing everything between hospital visits, and I have a huge favor to ask. If anyone can help get a few meals over to their house to ease the pressure and make one less thing for them to worry about, that would be greatly appreciated! I’m trying to do the planner on this Caringbridge website, but still trying to figure it out. Please email me at lmartin1008@gmail.com if you can help and when. I’ll do a manual calendar until I can get it otherwise organized. Dinner this evening is already taken care of (Sunday night.) Thank you for your support and prayers. I am organizing another yard sale in the next couple weeks to raise some more money for her medical fund checking account to help defray the daily co-pay of the hospital and other things. If you can donate for this, please let us know; it will be at Linda’s house, so drop off can be there, coordinated with Karl’s and my schedule. If you need more information on the yard sale or the account, please email me as well. Lisa Martin",
      "MessageIndex": 0,
      "PostDate": "16/09/2012",
      "ThreadURL": "https://csn.cancer.org/node/246760",
      "Title": "Update on Linda Simmons from her Caringbridge blog.."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "That was beautiful and thank you. Happy Valentines Day to you too. jan",
      "MessageIndex": 3,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://csn.cancer.org/node/156933",
      "Title": "HAPPY VALENTINES DAY!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Totally understand! I've come and go a few times myself. It is difficult to get away from cancer. A friend of mine's sister just died of breast cancer after being in remission for 11 yrs and another friend has been dx with stage 4 colon ca. Add to that all that's taken place here and that my husband continues to suffer from the effects of his colorectal ca treatment and I continue to suffer from the effects of Aromasin. Not so easy to \"put it behind you\". So take all the time you need and hopefully you will have many days where you don't hear or think of the word cancer and find joy, peace and contentment. jan",
      "MessageIndex": 21,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208916",
      "Title": "I have to escape for a while"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Absolutely T, many many prayers as well as fingers and toes! Hugs to you! I hope this all resolves itself to a positive ending! hugs jan",
      "MessageIndex": 4,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Tasha, I love your place! How sweet! And congratulations on posting the pic, looking forward to seeing more of your garden. jan",
      "MessageIndex": 19,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I'm sorry I missed that post. I had no idea there was a problem with the little one but I'm happy to see that it is being resolved. And thanks Noel for bringing it up. She is adorable. Just want to cradle her and give her a zillion kisses :) jan",
      "MessageIndex": 7,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170867",
      "Title": "RE"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Oh Claudia, that is so sad. I'm sure in the future you or Reggie would love to have pictures of the both of you or even just you. REBEL against your ex-slog and stick your face in front of any and all cameras you can and leave your beautiful smiling face for posterity, Reggie and all those you know and love you. I get the shivers that this guy is a psychiatrist with the potential to do some real damage. Show him that he can't touch you! And puleaze give us a wedding, we would be sosoooooo happy to hear you and Reggie are getting married and that you have overcome this \"shyness\". jan",
      "MessageIndex": 29,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "You did it!! Congratulations!!",
      "MessageIndex": 54,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "There is something to be said for \"trusting your gut\" and I'm sure you will never take \"no\" for an answer again. Good luck to you I hope you hear the magic word, benign. Let us know how it goes. jan",
      "MessageIndex": 22,
      "PostDate": "28/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/169034",
      "Title": "Biopsy on Friday"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Absolutely T, many many prayers as well as fingers and toes! Hugs to you! I hope this all resolves itself to a positive ending! hugs jan",
      "MessageIndex": 55,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "You did it!! Congratulations!!",
      "MessageIndex": 17,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Tasha, I love your place! How sweet! And congratulations on posting the pic, looking forward to seeing more of your garden. jan",
      "MessageIndex": 56,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Oh Claudia, that is so sad. I'm sure in the future you or Reggie would love to have pictures of the both of you or even just you. REBEL against your ex-slog and stick your face in front of any and all cameras you can and leave your beautiful smiling face for posterity, Reggie and all those you know and love you. I get the shivers that this guy is a psychiatrist with the potential to do some real damage. Show him that he can't touch you! And puleaze give us a wedding, we would be sosoooooo happy to hear you and Reggie are getting married and that you have overcome this \"shyness\". jan",
      "MessageIndex": 66,
      "PostDate": "02/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I don't know if this topic has been covered yet, but I stumbled upon an article concerning the \"Cancer Personality\". Some Doctors are convinced that there IS a Cancer Personality but I think the last word in the medical journals is that there is not a Cancer Personality. I am always looking at ways cancer may be caused and find it interesting. Here are some personality traits suggested by Dr. Douglas Brodie MD on the subject. 1. Being highly conscientious, dutiful, responsible, caring, hardworking. 2. Carry burdens of others. Worry for and about others. 3. Deep seated need to make others happy. 4. History of lack of closeness with one or both parents. 5. Stuffing down toxic emotions, ie: anger, hostility, resentment and has difficulty expressing them. 6. React adversely to stress and usually experiences an especially damaging event approximately 2yrs before cancer detectable. 7. Unresolved deep seated emotional problems arising in childhood. I don't know about you gals, but I see me in a lot of this stuff I am sorry to say. And there have been quite a few damaging events in the past 10 yrs. I think I fit the profile and I believe my mother-in-law fit it too. She had breast cancer and was unable to fight it. Do you think there is something to this or is it just a bunch of hogwash. cheers jan",
      "MessageIndex": 0,
      "PostDate": "19/12/2007",
      "ThreadURL": "https://csn.cancer.org/node/156460",
      "Title": "Cancer Personality"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "There are so many \"supposed\" causes to cancer that it can drive one crazy. One thought I had while reading your post is while I boarded a plane recently there was a warning stating that the fuel exhaust was carcinogenic. This is good since it is at least recognized and once recognized then the battle can begin to do something about it. You can yourself have the soil analyzed. It would be interesting to know if you're on to something. Good luck on your research, jan",
      "MessageIndex": 1,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215975",
      "Title": "Demographics & Cancer?"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Too funny Margo, thanks for the chuckles :) jan",
      "MessageIndex": 19,
      "PostDate": "05/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/174977",
      "Title": "First Christmas Joke of the Season"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I am so sorry to hear about your recurrence and the complications of diabetes. I sincerely hope the Herceptin does it's job. From what I hear the side effects are manageable...a small blessing amidst the crap :) Will keep you in my thoughts and prayers that all goes well for you and that NED will be asking you for a dance in the near future... xoxoxo",
      "MessageIndex": 3,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288123",
      "Title": "Diabetes and Cancer too!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Do not let your heart break for me hon, I'm OK, I really am and I'm sure a lot of other women would say the same. I tell you this in my effort to release some of your pain. Sometimes when my head is full of problems present and foreseeable I take a few moments and give it all up. Hand it over to the gods and let them sort it out. Geeesh we're just human beings after all. And it seems sometimes that \"it's going to be what it's going to be\". I don't like giving up control but I think that might be one of my lessons to learn here. We are thinking of you and holding you in our prayers and who knows maybe this might turn out to being the most precious Christmas you've ever had. That's my wish for you :) hugs jan",
      "MessageIndex": 2,
      "PostDate": "18/12/2008",
      "ThreadURL": "https://csn.cancer.org/node/164040",
      "Title": "feeling bad"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I have a copy of a relatively new mag called \"beyond Breast Cancer\". In it are stories of women who have fought and beat (so far) breast cancer as well as practical information and advice. A couple of stories are wonderful but annoying. Did I mention I experience a cyclic mood disorder since taking docetaxal?? I only mention this in case you think I'm cranky:) Story #1 is called \"Create your own Destiny\" and is about a woman who 23yrs ago \"declared war on Breast Cancer\". As well as breast cancer she had 8 years of chemo for ovarian cancer, 12 different types of chemo and 16 operations. A woman who has certainly paid her dues. What bugs me is the phrase \"declare war on cancer\" because it insinuates there is something specific you can do to destroy it and there isn't. We can have our surgery, take our chemo, radiation and hormone pills and it's still a crap shoot although a better one than not doing them. And you never really know if you've gotten rid of it or not. I can declare war on high blood pressure because there are specific things I can do to lower it. We usually know the cause or contributing factors. I can declare war on a number of illnesses but not this. Because even if I do say the words and get pumped about it, I'm still just standing here wondering what exactly to do that I wasn't doing before. With no known risk factors to fall back on (and 80% don't) how do you choose your weapon? (I'm the only one on both sides of my family who has gotten any type of cancer) What about those who have given the battle cry and with steely determination have declared war on the beast. Did everything, food, exercise, positive attitude...etc and found the beast had won. How would she feel if someone told her to \"create her own destiny\" after all the work she had done and all she went through. Would she feel she failed or is less of a warrior? I would hope not. With all that fight not having worked what is there left to do? I guess this is where \"God\"s will\" and \"meant to be\" come into play. Then what happened to the \"create your own destiny\"? I think we are always creating our own destiny we just don't know exactly how we're doing it Story#2 is called \"Climbing through Breast Cancer\" where a woman who is a professional rock climber developed breast cancer at 33. An incredibly fit lady she chose to have a bilateral mastectomy with reconstruction. She regains her precancerous fitness level and continues to ice climb, ski, scuba dive,....etc. What puzzles me is at the end of the article she claims that beating cancer was her greatest accomplishment. Unless assuming that every day we are not diagnosed with it is a day we have beat it, I don't know how she conquered it. And since it can rear its ugly head at any point in time no one knows if it is truly conquered. It is just my take that while a lot of stories are meant to give hope and encouragement, it seems that depending on where you stand they can make you feel even more isolated and alone than you were before. Am I just being cranky or do I have a point? Thanks for listening jan",
      "MessageIndex": 0,
      "PostDate": "16/01/2008",
      "ThreadURL": "https://csn.cancer.org/node/156671",
      "Title": "false hope?"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Hi Dee Dee, no I've never heard of them, but I'm in Canada. I find it best to use a manufacturer that I trust. Even then you can't guarantee purity. You could try researching them on the internet. See if there are any complaints or recalls. Good luck jan",
      "MessageIndex": 2,
      "PostDate": "16/01/2009",
      "ThreadURL": "https://csn.cancer.org/node/164685",
      "Title": "anyone know puritan's pride vits"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Good. Glad you found some shoes you like. I was just going to give your cyber butt a cyber kick if you hadn't by now. Hope you enjoy.",
      "MessageIndex": 23,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Here are a couple of charts you may find useful: Tamoxifen Guide FlockhartChart Cheers jan",
      "MessageIndex": 4,
      "PostDate": "12/06/2012",
      "ThreadURL": "https://csn.cancer.org/node/241579",
      "Title": "Do not take benadryl if you are taking tamoxifen."
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "AC-T is pretty common in the U.S. In Canada they give us FEC-T which is pretty much the same except with the 5FU added. Are you sure you will have a 75% chance of it recurring?? I would think that your 75% is chance of it not recurring. Don't be scared. Each and everyone of us here has been through it and are standing on the other side. You will too.:) hugs jan",
      "MessageIndex": 1,
      "PostDate": "22/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174210",
      "Title": "found out what kind of chemo i will be doing"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Wow, isn't it amazing what they can do today??? Sure all sounds complicated to me but they do it all the time. My best to you RE, I hope it all goes without a hitch and you and your new girl will live happily ever after :) By the way, I can't take my eyes off that little granddaughter of yours, everytime I look, she makes me smile. She is TOOOOO sweet!! hugs jan",
      "MessageIndex": 22,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175035",
      "Title": "RECONSTUCTION RE IS HAVING HOPEFULLY ONE FINAL SURGERY"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Hey Sweet things :) so nice to hear from you. I'm doing OK. They put me on anti-depressants and guess what???? I got depressed!!! So I've been sleeping tons and haven't been on the computer very much at all. Now I've got a cold (from my beautiful grandson), so I've really been out of it. But I like the picture of a romantic cruise, I think I'll dream about that one tonight. You are all looking great and I hope to be back again soon. Thank you for your love, it warms my heart and I apologize for not being there for those in need. I'm feeling pretty screwed up right now. Many hugs to all jan",
      "MessageIndex": 12,
      "PostDate": "18/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177389",
      "Title": "phoenixrising--AKA Jan--where are you?"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Definitely I agree to change docs! But one thing I have found to be helpful is getting a copy of all my test results and reading them and learning about them. I never realized how hard it was going to be to advocate for myself when I was feeling physically and emotionally down and have as much told my docs that I needed them to advocate for me. But still there is no one like yourself. I hope things turn around for you and you get the tx you deserve. hugs jan",
      "MessageIndex": 20,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215436",
      "Title": "I'm another one that needs to vent"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Personally if I thought they were going to do a check I'd be proactive and tell them my circumstances and how it got that way. I think you have a better chance of them hiring you knowing the details rather than just looking at a report that says you have bad credit. Besides it will also put a more personal touch to your interview and who knows, they may just might admire your strength, dedication and perseverance and hire you because of that. Best wishes to you Cindy I really hope you get the lab job. jan",
      "MessageIndex": 7,
      "PostDate": "02/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171002",
      "Title": "Job Interview Questions"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "When my girl gets hers, which should be Monday, I hope she opens it. I didn't say \"not to\" so perhaps the little girl in her will rip it apart with enthusiasm and enjoy :)",
      "MessageIndex": 1,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/205961",
      "Title": "Thank you for the ornament!"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "Hi Jean, I don't know when you had your last taxotere but it might be an allergic rx to it. That's why they give you steroids with it. To prevent an allergic rx. Ask your onc or nurse about it. Just a thought....hope it clears up soon. jan",
      "MessageIndex": 6,
      "PostDate": "26/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206397",
      "Title": "Moisturizing eyedrops"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "I am so sorry for your friend. She has so much to deal with but a blessing is that she has you for a friend and that will help her. You don't need to worry about what to say, I'm sure she'll see it all in your eyes and feel it in your hug ~ blessings ~ jan",
      "MessageIndex": 8,
      "PostDate": "19/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228554",
      "Title": "BAD news"
    },
    {
      "AuthorID": "phoenixrising",
      "AuthorURL": "https://csn.cancer.org/phoenixrising",
      "Content": "You my dear sweet Mimi, hormones or no hormones..........you....... are delusional right now. You are not seeing yourself correctly nor giving yourself the love and compassion that you so often offer others. After what you've been through why should you have to live up to standards that you don't expect others to do?? Having said that I know what you mean cause I do the same, but it's wrong!!! Step outside yourself and look at yourself as you would anyone having gone through this experience and then tell us what you see. A beautiful, intelligent women who's just had her a*ss kicked by a life threatening disease who wonders why she can't be perfect when she's just barely out of tx. Going through chemopause (which is enough of a challenge for those of us who did it naturally). Hmmmmmmmmmm!!!! Lets think about this. I fully know what you're talking about but I'm NOT going to let you stay there :) Big Hugs jan",
      "MessageIndex": 26,
      "PostDate": "21/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174090",
      "Title": "I'm having a hard time..."
    }
  ]
}