{
  "AuthorID": "Pinkpower",
  "AuthorURL": "https://csn.cancer.org/Pinkpower",
  "Posts": [
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Thats a good question, Ive gotten 2 small colds in the pst 3wks, im def going to ask my onc if I should get a flu shot this year. Lupe",
      "MessageIndex": 6,
      "PostDate": "03/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200006",
      "Title": "To flu or not to flu"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "I stated the Effexor 75mg for my anxiety, but it did help with the hot flashes. I still get them cause I had my ovaries removed, so at 42 I am menapausal now, but they are so small that sometimes I dont even notice. I too take them at night, but I have notice Im still very tired and sleepy all day. Hope this helps. Lupe",
      "MessageIndex": 13,
      "PostDate": "13/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211901",
      "Title": "effexor for hot flashes"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Debbie, Im so sorry to hear these news. Hope you get better news at the Mayo Clinic. Praying for you my sister.",
      "MessageIndex": 39,
      "PostDate": "11/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Debbie, Im so sorry to hear these news. Hope you get better news at the Mayo Clinic. Praying for you my sister.",
      "MessageIndex": 89,
      "PostDate": "11/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Oh my gosh, all of these were great! I so needed to laugh today.",
      "MessageIndex": 18,
      "PostDate": "06/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211402",
      "Title": "the funny things kids say..."
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "So happy for you Vicki. sound like you are on your way of a quick recovery. Looking forward to hearing about the \"tatoo\" Lupe",
      "MessageIndex": 27,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197073",
      "Title": "Vicki Sam is home, resting and recovering -- Not too bad // Exchange went well this morning at 7:30, home by 1 p.m."
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "I finished my chemo of Taxotere and Carbo back in March. Still on Hercepting and started Tamoxifen over a month ago, and I just complained to my onco my bone pains, especially my right hip at night. He advise me to start taking a baby aspirin every day. Hum... I wonder how long will these pains last after chemo. Lupe",
      "MessageIndex": 9,
      "PostDate": "03/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/197709",
      "Title": "Painful hips and legs at night?"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Your are an amazing woman. Wonderful daughter of our Heavenly Father. My the Lord keep you in his arms. So sorry about your Dad. It sounds like he was amazing too. Stay strong, keep us posted. Huge Hug right back at you.",
      "MessageIndex": 34,
      "PostDate": "01/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195452",
      "Title": "Lost my Dad June 21st"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "In my case, being HER2, E&P positive, my doctor highly recommended starting Tamoxifen. Since chemo thru me into a early menapause, I was not concern with hotflashes side effect since Im already going thru them, but I was very worried about the cervicle cancer part. my onc said if this was happening to his wife, he would want her to do it. Since I still have both my breast I decided I have to try everything out there to help prevent bc from coming back. I've been on Tamoxifen for a month, so far have only notice still very tired all the time, maybe just havent recovered from chemo, plus Im still on herceptin till Oct. Still having the hotflashes especially at night, severe mood swings, most of the same symtems when I was on Taxatere and carbo. Only new thing I've notice is a very light liquity vaginal discharge. Especially when I 1st wake up in the morning. Sorry for being so graphic. Lupe",
      "MessageIndex": 16,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197011",
      "Title": "reoccurrences and tamoxifen?"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Hi Kay, I can only offer my experience with Rad... Lumpectomy, chemo then radiation. Im hispanic with tan skin and I was one of the unfortunate that did get burned, my treatments where everyday for 6wks. by the 5th week I was very dark around my breast area and the area under my arm was so burned, worst then a sunburn, I was in so much pain, they gave me pain medicine and I took a wk off to heal a little. The week off helped alot, then I did my last week. I have healed under my arm and the darknest is clearing up quit nicely, so would I do it again... Yes, if I have to though I hope I never have to go thru that again... Ever! Just remember, everyone is different so good luck and we will be here for you. Lupe",
      "MessageIndex": 20,
      "PostDate": "06/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195826",
      "Title": "Anyone opted out of Radiation"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Just posted some pics of my hobbies. Im hoping one day I will get good enough to be able to sell what I make.",
      "MessageIndex": 0,
      "PostDate": "11/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216102",
      "Title": "Pics of my hobbies now posted on my expressions- Enjoy"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Glad you got thru that 1st day. Adding to what everyone else said, keep your weekend clear, just in case, and drink plenty of water. Lupe",
      "MessageIndex": 7,
      "PostDate": "23/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197146",
      "Title": "first day in the chemo bay"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Meena, so nice to hear you doing ok and your daughter. Sending you love and prayers. Lupe",
      "MessageIndex": 30,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211820",
      "Title": "Meena .. How are you doing, our PINK WARRIOR .. We are thinking about you"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "So sorry to hear that, hope its not too bad and you get better really soon.",
      "MessageIndex": 4,
      "PostDate": "24/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199232",
      "Title": "infection from breast reconstruction"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Thanks for the tip. I will start my friends list now. Lupe",
      "MessageIndex": 8,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197088",
      "Title": "How do you make someone your \"friend\" in CSN?"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "I'm so on board with everyone here. some nights I'll be lucky to sleep 2-3 hours straight during the night, then thats it, either its the hot flashes, body pains or just cant sleep anymore. Worst when you know you have to get up soon to go to work! Silver lining for me, well soon I wont have a job, thought Im worried about my financial future, I will surely be glad to get those extra hours of sleep between 6-10am like on the weekends. Lupe",
      "MessageIndex": 18,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196302",
      "Title": "Sleep?"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Hello Eva, so sorry to hear of one so young having to go thru what the rest of us already have. I was stage 2, Estrogen & Progestrogen +, HER2. I was told a very aggressive cancer. I had a lumpectomy to my left breast, then chemo of Taxxotere, Carboplatin and Herceptin every 3wks for 6 months,except Herceptin, I did that one for 1yr. Also did Radiation. I had a port. I decided on the port thru my surgeon and oncologist advised. They said chemo was hard on the veins. Its been 1yr I finished with my chemo and 8 months frm the Herceptin. I you see my expressions, I have pics that you might find interesting and might help you thru this journey. If you have any questions, please feel free to ask. Sincerely Lupe",
      "MessageIndex": 2,
      "PostDate": "23/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217003",
      "Title": "Four rounds of chemo, will I need a VAP?"
    },
    {
      "AuthorID": "Pinkpower",
      "AuthorURL": "https://csn.cancer.org/Pinkpower",
      "Content": "Anyone else who had a lumpectomy, is your breast still very tender. Mine is, especially around the areola which is where the tumor was removed from. I had chemo and radiation. It got a lot more tender after radiation. Just wondering if this is normal and if anyone else has notice the swollen and tenderness still especially since its been a year since I had the tumor removed.",
      "MessageIndex": 0,
      "PostDate": "31/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208870",
      "Title": "Breast still tender 1yr later after lumpectomy"
    }
  ]
}