{
  "AuthorID": "pitt",
  "AuthorURL": "https://csn.cancer.org/pitt",
  "Posts": [
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Hey - I went to the fabric store and bought a yard of silk, on sale only 5.99. That will make two 36\" squares. Single stitch along the edges, and voila, you have two scarves for 5.99! I have been practicing with my scarves and really like them. I just fold into a triangle, place on head with point down the middle back, wrap ends over middle and tie, then knot. You have enough to pull over your shoulder, which is how i always wore my ponytail, and it looks really beautiful. I recommend materials with bright colors...and yes PINK...everyone looks good in it! ;-) Good luck and I hope this helps. I'm looking forward to seeing if we get any other suggestions. I'd love to get creative!",
      "MessageIndex": 1,
      "PostDate": "11/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177292",
      "Title": "clever ways to make scarves?"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "My hot flashes were so bad that I was waking up every hour or more! I take the low dose, 37.5, and have no side effects. I might have one or two hot flashes per week now. I take each night before bed. Good luck.",
      "MessageIndex": 8,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211901",
      "Title": "effexor for hot flashes"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "My hot flashes were so bad that I was waking up every hour or more! I take the low dose, 37.5, and have no side effects. I might have one or two hot flashes per week now. I take each night before bed. Good luck.",
      "MessageIndex": 9,
      "PostDate": "10/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211901",
      "Title": "effexor for hot flashes"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Hey - I start the same cocktail on Thursday! We can do this together!!! Wanna bet on when our hair starts to fall out? I started another post last night about different things we can do to make this easier. Some people have told me to use baby oil on our nails to keep them from becoming brittle. My dr. said to take Claritin to keep the Neulasta shot from causing too much pain. I am high risk for nausea so the dr told me one glass of wine at night will help alleviate that problem... I'll check that post now to see what the other girls tell us to do. Good luck!!!!",
      "MessageIndex": 1,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176428",
      "Title": "Chemo cocktail ,taxottere,cytoxan"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "I am so sorry that you are having to deal with these issues all over again. It's not fair! Having said that, I will tell you that chemo and radiation are completely manageable (as so many of us on this site will tell you) and you can fight this insidious beast. You can do it!!! I recently finished 3 months of chemo and 8 weeks of radiation. As you and your doctors determine your next course of action, please let us know. We can all guide you through the process with little tips to make the journey less frightening and more manageable. This is a great group of people, and we are all here to help each other. Welcome and know that you are not alone in this fight! Pitt",
      "MessageIndex": 14,
      "PostDate": "03/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187252",
      "Title": "BC reoccurence"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Hi everyone! I haven't been posting much lately because I've been so wiped out after finishing chemo and then starting rads. I'm in the middle of my radiation treatments 5th out of 8 weeks! I have read so many posts about fatigue, depression, anxiety, etc. and wanted to share some thoughts with you. I've been going through my own \"emotional roller-coaster\" these past few weeks for various reasons: my cancer, my mom's death, my husband's job change, possible move to Germany, my children's fears, to name a few. Plus THE WEATHER!!! UGH! I need sunshine if I'm going to BE \"sunshine!\" But the worst seemed to be whenever a friend would complement me: \"You look great!\" \"You're my inspiration!\" (You have all heard those phrases.) And it occurred to me that I was prickly over those comments because I didn't feel they were true. So, I decided to make them true. I went back to the gym a couple of weeks ago. I cried when I went home after my first workout because all I could manage was a 5 minute walk on the treadmill at a very slow pace and a few squats/lunges. (My typical workout pre-cancer was a 5-10 mile run or 4000m swim plus a 1 hour weight lifting session.) Needless to say i was very disheartened. Not to mention the comments about how great I look in my blue bandana head cover! Yeah right! But I went back a second time...and did a little more. Then a third, fourth, fifth time. Each time I tried just a wee bit more than the previous workout. Yesterday I ran 2 miles and lifted weights for 30 minutes!!! I left the gym feeling like I had just won the ironman! Am I anywhere near what I was doing before my diagnosis? NO!!! But do I feel awesome? YES!!! My point is...sometimes attitude is a choice. (Sometimes it's not!) But where we can help ourselves is to try and face forward and do something that helps us claim a piece of ourselves back...whether it's working out, cooking a favorite meal, painting a picture, reading a favorite novel, etc. Make a goal (however humble) and start there. It's up to us how we feel about ourselves. And as I was leaving the gym yesterday with a huge smile on my face, an 81-year-old man told me I was beautiful. And you know what? I felt it! :-) Good luck my sisters in pink! With love, Pitt",
      "MessageIndex": 0,
      "PostDate": "27/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184777",
      "Title": "Facing forward - exercising again!"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Good luck! Thinking of you. When this is done, let's do a South Florida meet up like the SoCal girls!!! Keep us posted. Pitt",
      "MessageIndex": 42,
      "PostDate": "22/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210344",
      "Title": "it's back again....... in my spinal fluid"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "I'm so happy for you Laurissa...and what a nice reminder to all those just starting out. Keep the goal in sight and you will get there. Stay strong, Pitt",
      "MessageIndex": 15,
      "PostDate": "07/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187444",
      "Title": "Glad to meet you, NED"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Hi. I'm in week 5 of rads and haven't felt any nausea but that doesn't mean it isn't possible. Call your radiation department and speak to one of the nurses or your doctor and ask if it could be a side effect. Good luck! I hope you feel better soon. Pitt",
      "MessageIndex": 1,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184861",
      "Title": "Nauseated with Rads ???"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Hi Helen. I just finished this at the end of August. Basically, they put your breast in the mammogram pincher and while you look away they will insert the wire to locate the chip. You won't feel a thing because the area will be numb from the lidocaine. After that, I had to lie down on the bed. They put a plastic cup over the insertion needle that remains outside your breast. (Think Madonna cup and you get the idea!) They discreetly covered me up with warm blankets so I could be wheeled to the surgical area without anyone noticing there was something sticking out of my breast. They also told me that I would be in a Twilight state but I never was awake for any of the surgery. I don't remember a thing. Good luck!",
      "MessageIndex": 14,
      "PostDate": "29/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176460",
      "Title": "question about a lumpectomy"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Fantastic news Traci! Enjoy the dance...!",
      "MessageIndex": 33,
      "PostDate": "07/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189598",
      "Title": "Hands off, girls -- NED is all mine today!"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Congratulations on finishing chemo! I'm so happy for you. I just finished chemo two weeks ago and I swear that I am starting to see hair growth...it may not be thick yet, but it is starting to come in. Hugs, Pitt",
      "MessageIndex": 7,
      "PostDate": "14/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181923",
      "Title": "Last Chemo on Monday"
    },
    {
      "AuthorID": "pitt",
      "AuthorURL": "https://csn.cancer.org/pitt",
      "Content": "Ditto - I must say that I don't feel \"blessed\" for having cancer. My mom's dying of uterine cancer right now. Don't think she feels blessed either. I appreciate my cancer center; they take good care of us. But I'd rather spend my day at the beach anytime. Pitt",
      "MessageIndex": 3,
      "PostDate": "20/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177996",
      "Title": "BC Commercials...Ranting!"
    }
  ]
}