{
  "AuthorID": "rainyday",
  "AuthorURL": "https://csn.cancer.org/rainyday",
  "Posts": [
    {
      "AuthorID": "rainyday",
      "AuthorURL": "https://csn.cancer.org/rainyday",
      "Content": "Well done Fawn.",
      "MessageIndex": 1,
      "PostDate": "21/05/2003",
      "ThreadURL": "https://csn.cancer.org/node/140373",
      "Title": "Newjersey25 deserves congratulations!!!"
    },
    {
      "AuthorID": "rainyday",
      "AuthorURL": "https://csn.cancer.org/rainyday",
      "Content": "Hi Chemoqueen - I think we could do our PHD dissertation on this HER2+, what do you think? I will look at this site. Met with the onocologist(s) for a long time yesterday and they finally convinced me that it was not in my best interest to participate in the trial. If all goes well the chemo will be over by the end of July and then I will do radiation and tamox for five years. If I am lucky that will be the end of it, if it does come back then that would be the time to look at herceptin, taxol etc. They made the good argument that given my lifestyle, I run a business, have 2 boys 12 and 7, and am very healthy except for the cancer and the prognosis is very good. Why take additional drugs particularly herceptin which can affect the heart just for the sake of the trial. I did agree to participate in a cognitive study which is looking at the impact on the brain from chemo. That study does not affect the treatment at all. I will continue to follow the HER2+ because I am hooked but at this point i am just looking forward to getting it over with. Sunshine and laughter (it has rained here for weeks on end)",
      "MessageIndex": 1,
      "PostDate": "13/05/2003",
      "ThreadURL": "https://csn.cancer.org/node/140312",
      "Title": "More infor for Her2+ breast cancer"
    },
    {
      "AuthorID": "rainyday",
      "AuthorURL": "https://csn.cancer.org/rainyday",
      "Content": "Hi Judy, it was a hard decision because I don't ever want to find myself saying I wish had done this or had done that. Good luck to you too!",
      "MessageIndex": 3,
      "PostDate": "13/05/2003",
      "ThreadURL": "https://csn.cancer.org/node/140312",
      "Title": "More infor for Her2+ breast cancer"
    }
  ]
}