{
  "AuthorID": "RE",
  "AuthorURL": "https://csn.cancer.org/RE",
  "Posts": [
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Ohilly, I can understand your emotions but please do not let her cancer become your stressor. It saddens us greatly to see anyone lose the battle with cancer, but to have it chronicled for us and see her struggle so personally portrayed is heart wrenching. That said Ohilly, her battle is not you path. Like you said you are a stage 1 and there is great success for survival for you. I say this to you from personal experience, you see I lost my mom to cancer (she fought it for 26 years) and my sister (8 year battle). It was my sister's death that struck me in a way that surprised me. I had just finished treatment and was just getting my hair back so I was super sensitive at the time. I saw my onco a few weeks after she passed and he knew immediately that for the first time since my cancer battles had begun some ten years previous I was down trodden. My onco knew why and before I could express my feelings he strongly told me that my sister's cancer was not my cancer and what happened to her was not necessarily going to happen to me. He then went on to remind me that I have beaten cancer three times and I am doing well. Ohilly, you too have beaten cancer, you too are doing well, you too are a survivor, you too have a future to live and enjoy please do not let cancer have that too. Enjoy and revel in your current healthier state, in your new hair, and the fact that you are getting stronger each and everyday. I agree cancer is a horrible illness, but it can be beat and you are on that path my friend, keep your chin up and know we are here for you! RE",
      "MessageIndex": 2,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168645",
      "Title": "Farah Fawcett"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Wonderful idea and great title, let us know about your progress. *´¨) ¸.•´¸.•*´¨) ¸.•*¨) (¸.•´ (¸.•` ¤ RE",
      "MessageIndex": 1,
      "PostDate": "23/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199132",
      "Title": "On a positive note...."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Congrats on your survivorship, just look at that smiling face of yours it speaks volumes! RE",
      "MessageIndex": 31,
      "PostDate": "16/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214130",
      "Title": "3/15..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Suzanne I too am joining the praying for alive follicles brigade! I agree it is better to get the answer out in the open rather than waiting and wondering. Hope you get the news you want next week! Hugs~Hugs~Hugs~ RE",
      "MessageIndex": 4,
      "PostDate": "25/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240715",
      "Title": "Finally saw dermatologist today about the hair thing"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I saw this late so i posted after you were all done, silly me! I am so glad you are doing so well and its wonderful the sun has come out to cheer you. Keep that positive attitude it will carry you far! RE",
      "MessageIndex": 22,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178043",
      "Title": "Tomorrow's the \"Day\" (10--21-09)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I would call your doctor first thing in the morning and express the pain you are in and that you need immediate relief! In the mean time vagisil has wipes that are medicated and will allow you a bit of relief till the doctor can give you something better. I am so sorry you are in such pain and hope you get this resolved soon. Hugs, RE",
      "MessageIndex": 2,
      "PostDate": "13/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175624",
      "Title": "Need help ..sensitive subject .. private area is raw and inflamed from constipation (5 days with movement) .. I need help"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Thank you, I truly appreciate that you all allow me to dote on my grand kids in here, I sometimes think I might be driving you nuts! :-D Thank you all again! RE",
      "MessageIndex": 5,
      "PostDate": "06/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171076",
      "Title": "New pic of Ava! :)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I feel so blessed to have you as my friend...for the long haul!   RE",
      "MessageIndex": 9,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://csn.cancer.org/node/291373",
      "Title": "The Long Haul"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "What a sneaky bunch we Kindred Spirits are! With your words I can envision you opening each item. Now I agree, time to fight, fight, fight! BIG GIANT HUGS, RE",
      "MessageIndex": 2,
      "PostDate": "20/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/210287",
      "Title": "A big Thank You!!!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Traci I thought the same thing!!! I too was not that \"racy\" during my treatment either. :-) I do recall a racing heart beat and they just monitored me and did the ekg periodically. Thanks for making me grin with the unintended \"racy\" thoughts! LOL Hugs, RE",
      "MessageIndex": 3,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174082",
      "Title": "Anybody else get racy after a/c treatments"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Chen, Chen, Chen, thanks for spelling it out for me I am as daft as tasha I could not figure it out! I am gonna pretend it is because of the meds from my surgery and not the fact that i just was clueless in Lodi. Now that I get it I too am laughing! Thanks again, RE",
      "MessageIndex": 11,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/165927",
      "Title": "Too funny"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Susan there are no bad omens, you are gonna be fine. I will be praying for a quick recovery, let us know how you are doing once you are up to it. Hugs, RE",
      "MessageIndex": 23,
      "PostDate": "23/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178043",
      "Title": "Tomorrow's the \"Day\" (10--21-09)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Maryann I am soooooo happy for you, that is excellent news! Now relax and enjoy your weekend! Hugs, RE",
      "MessageIndex": 4,
      "PostDate": "26/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170702",
      "Title": "Surgeon Just Called With News!!!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "So glad you enjoyed the photo of little Ava with her oldest brother Ian. I love how she is gazing up at him and he is all smiles! Have a safe and happy fourth! Love, RE",
      "MessageIndex": 2,
      "PostDate": "03/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171076",
      "Title": "New pic of Ava! :)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Ladies and Gents, Well let me tell you that I have been a bit distressed over a recent weight gain that just keeps inching its way up the scale and I cannot figure out what I have done to gain this extra 4 lbs. (now I am betting a few of you are snickering because you know where the extra pounds have come from) I realize that 4 lbs. does not sound like much but I struggle to keep each pound off. Well today the light went on.....I have an expander in me and more than 400 cc's of extra fluid plus I still have quite a bit of fluid retention and swelling. I must admit I was surprised it took me this long to figure it out.......duh! Just wanted to share my goofiness with you all. Hope you all have a great day!!!! RE",
      "MessageIndex": 0,
      "PostDate": "19/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166475",
      "Title": "CONFESSIONS OF A GOOF"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "So very happy to see your smiling face and to hear that things are going well. THank you for popping in and letting us know how you are doing! RE",
      "MessageIndex": 6,
      "PostDate": "24/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228990",
      "Title": "saying hello"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "This is a wonderful quote, thank you for sharing it! *´¨) ¸.•´¸.•*´¨) ¸.•*¨) (¸.•´ (¸.•` ¤ RE",
      "MessageIndex": 3,
      "PostDate": "22/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199077",
      "Title": "A quote I thought I would share"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Yeah for NED!!!!! Very, very happy for you! Wishing you the best on your new meds. Hugs, RE",
      "MessageIndex": 9,
      "PostDate": "30/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/245558",
      "Title": "Dancing with NED, except for having osteoporosis..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "My daughter took a few photo's of her little one's that were so good I just had to share them. Okay, now I promise not to bombard you with any for while!~LOL~ If you'd like to see them they are on the expressions page. Hugs, RE",
      "MessageIndex": 0,
      "PostDate": "12/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171561",
      "Title": "OK LAST ONES FOR AWHILE I PROMISE!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Love the name of your walking group, how sweet of you! High School reunion woooohooo now get out there and strut your stuff girly!!! My guy and I have not gone to any of our reunions, lets see it has been 35 years for us. Okay now the rads, did you have rads previously? Be sure to take super good care of your skin, pat dry never rub after a shower, another thing that you can do while having radiation is to lightly dust the radiated area with corn starch (yes the stuff in your kitchen.) I was instructed to made a corn starch dust ball of sorts using cheese cloth or a stocking (sock) tying off the end. This really worked well as it made it easy to apply lightly. The cornstarch helps to keep the radiated area from chafing. Aloe Vera Gel is very soothing as well, chin up it will be over in no time! Gentle Hugs, RE",
      "MessageIndex": 2,
      "PostDate": "11/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/228179",
      "Title": "Last Week & This Week & Next Week"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Feb. 22 will be my 3rd year cancerversary as Mimi so aptly put it. Tonight as I sat on one couch with my laptop and my husband was on the other with his laptop he asked me to come sit next to him he wanted my opinion. He was ordering tickets for us to attend the Farewell Tour of Topol in Fiddler on the Roof in San Francisco at the Golden Gate theatre on Feb. 20....I am so stoked!!! It is my favorite (movie) play and what a surprise, I can hardly wait ladies I am bursting with excitement and had to share with all my bc buddies. ♥ RE ♥",
      "MessageIndex": 0,
      "PostDate": "21/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180277",
      "Title": "Surprise Plans for my upcoming cancerversary"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Dear Elizarose I so understand how you are feeling and what you have stated, I have walked in similar shoes. I am not alone but since no one can truly understand how and what we as cancer survivors deal with I have often felt alone. I see by the biblical notation that you are a woman of faith so I know you know that even in those most lonely moments you are never truly alone. I will be honored to lift you in prayer, I truly hope thing get brighter for you very soon! NUMBERS 6:24-26 RE",
      "MessageIndex": 8,
      "PostDate": "02/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202376",
      "Title": "Because some things aren't suitable for Facebook..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Tasha stay out of the water with all that bling on you may be mistaken for a cute lure and you know how fish like lures!!! Hugs, RE",
      "MessageIndex": 3,
      "PostDate": "26/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172525",
      "Title": "I'm off.."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hi Jean nice to meet you even though I wish you did not have a reason to have to have found us. In regards to the taste bud problem, it you are referring to having a metal type of taste in your mouth I found it helpful to use sturdy plastic forks in lieu of metal ones to help relieve some of that nasty taste and allow a bit of food flavor in. I know it is not what you are asking but when I read your title I felt compelled to tell you that once treatment is over you can expect to gradually get back to living life and enjoying it as you seem to be doing in your picture. Cancer has been a part of my life since I was 17 when my mom got it (I got it at 40) but I learned from her and others that even though we are changed by cancer we can still be happy, loved and active people after wards. I wish you all the best and am glad you found us, the folks here are amazing. ♥ RE ♥",
      "MessageIndex": 12,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195382",
      "Title": "What do I expect after next treatments?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Just a quick note to say I did not think your post was \"out of the gate\" rather more on the informative caring side. The world is filled with all sorts as is this site, some are more timid and some wear their heart on their sleeve and somehow we all manage to help each other because we have all been down a similar road. Welcome to CSN and thanks for jumping right it, I find it refreshing! My Best To You, RE",
      "MessageIndex": 7,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231522",
      "Title": "Scheduled First Chemo Appt. Today"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Thank you TJ for the update on our Trish, she is indeed a special lady and my prayers continue for her. Trish if you are reading this I most certainly love you more than my luggage! You keep fighting gal and know that you do not fight alone, we are standing with you each step of the way! ♥ RE ♥",
      "MessageIndex": 14,
      "PostDate": "06/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183337",
      "Title": "Regarding Irishwhispers"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Zah my friend you are most certainly an amazing woman! I did not know about the 96 dx. and am so glad you are here to show us just how much life can be lived and lived well after one has battled and re-battled cancer. I myself see it as a chronic illness I must keep close tabs on to keep it in check! Glad you are here and glad you are my friend! A ton of hugs and then some, RE",
      "MessageIndex": 5,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176097",
      "Title": "FOR ZAHALENE! You made my day!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "First let me say that I am sorry you have a need to be here but I am glad you found us, Oh and cute photo of the doggies! :-) You have already received a ton of great tips, truly is doable, very scary I know but doable and you will get through this and we will be here to listen to your woes, vents and triumphs! I don't have my med papers with me but i am pretty sure I had both of those (along with a few others LOL!) You are going to be scared and that is perfectly normal, please pray or meditate a few moments before going in to relax yourself. Some people like to visit with other patients for me I preferred to listen to music and go to sleep during the treatment. Bring a good book, favorite blanket, crossword book whatever helps to ease your mind and gives you comfort. Be sure to be aware of how you are feeling and if something seems odd to you ask the nurses so they can explain things to you, DO NOT HESITATE TO ASK QUESTIONS! They are usually great at helping you relax a bit. Drink a lot of fluids the day of treatment and rest up. I agree you will most likely not feel ill the first day but by the end of the second day or the start of the third you may feel like you have a bad flu. I do not know how many treatments you are scheduled for, I had 6 the first time and had a bit more difficult time rebounding after each treatment. Please be kind to yourself and rest as often as needed, eat when you are feeling hungry and get out in the sunshine from time to time as it is good for the mind. I would also suggest keeping a note pad nearby to jot down any concerns you have that you may want to ask your doctor because you are most likely going to get chemo brain during treatment which causes us to be quite forgetful so a note pad is a lifesaver. Be sure to take it with you to your appointments so you do not forget to get answers to your concerns. Also do not hesitate to call your doctor once you are home if you star to feel poorly as there are things they can do to help ease your discomfort. Take care and let us know how you are doing, RE",
      "MessageIndex": 13,
      "PostDate": "03/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231522",
      "Title": "Scheduled First Chemo Appt. Today"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Nancy, I have never had a port or pic line, however I have had my fair share of chemo. I will be thinking and praying for you tomorrow. Please be kind to yourself and get lots of rest. My best to you, RE",
      "MessageIndex": 9,
      "PostDate": "05/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165221",
      "Title": "Port and Chemo"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "We need Zah to chime in for some reason I thought it was only 86 and 88. I have had it three times once in 97, 98 and 07. Okay Zah set us straight gal, when was the last time you kicked cancer to the curb??? Hugs, RE",
      "MessageIndex": 2,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176097",
      "Title": "FOR ZAHALENE! You made my day!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Jenny I am so very sorry to hear this, I will be praying for them both. I cannot imagine life with out My Guy! Hugs, RE",
      "MessageIndex": 6,
      "PostDate": "19/02/2012",
      "ThreadURL": "https://csn.cancer.org/node/235897",
      "Title": "My Chemo buddy lost ..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Karie so sorry for you loss, our little furry family is family all the same. I know my furry friends have always kept me warm and loved during my \"down\" times. Big hugs to you and yours. RE",
      "MessageIndex": 95,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Karie so sorry for you loss, our little furry family is family all the same. I know my furry friends have always kept me warm and loved during my \"down\" times. Big hugs to you and yours. RE",
      "MessageIndex": 96,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Karie so sorry for you loss, our little furry family is family all the same. I know my furry friends have always kept me warm and loved during my \"down\" times. Big hugs to you and yours. RE",
      "MessageIndex": 45,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "The two year stint I did with chemo and the steroids it comes with put on a whopping 70 lbs. I was only able to shed 30 of it until recently (12 years later). It is okay though JoJo because you are still here and there is just more of you to adore! Keep working on beating the beast you can work on the battle of the bulge once you are over this battle, like I said it took me 12 years but I have finally shed most of those pounds and even if I had never done so the fact that I am still here is worth 70 lbs. Hugs, RE",
      "MessageIndex": 16,
      "PostDate": "01/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/208086",
      "Title": "Tamoxifen and weight gain"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "And I just live up the road so I'll be on time! I can carry a tune, sang in choir Elementary thru high school and in church choir. My grands love for me to sing to them when I tuck them in, silly ones! I have chosen \"Lean on Me\" by Bill Withers as my song for you! Gigantic Hugs coming your way so BRACE YOURSELF!!! RE",
      "MessageIndex": 18,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224726",
      "Title": "Requesting the Pink Bus for tomorrow"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Karie so sorry for you loss, our little furry family is family all the same. I know my furry friends have always kept me warm and loved during my \"down\" times. Big hugs to you and yours. RE",
      "MessageIndex": 44,
      "PostDate": "23/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212706",
      "Title": "My Beautiful Angel died"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "First let me welcome you to this board even though of course we all wish none of us had to find this site. I have had 2 recurrances, the first was just 8 months out of treatment geez...I went from a stage 2a to a stage 4 in less than a year, that was back in 1998. In 2007 it came back and I was borderline 1 or 2a so we did more chemo along with a mastectomy this time (first time had lumpectomy). I am doing well all things considered. We are here for you come in when you have a question, perhaps want to update us or even just to rant and rave on days you need to vent. As Lynn said we are legion she is right and we all care about each other. Hugs, RE",
      "MessageIndex": 6,
      "PostDate": "02/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187252",
      "Title": "BC reoccurence"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "TJ I myself have done the same thing, nice hair my friend! RE",
      "MessageIndex": 9,
      "PostDate": "19/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172022",
      "Title": "GRRRRRR updating my pic"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I am so sorry to hear that you have to fight this again! I wish there was something more I could do, know that you will be in my prayers. Hugs RE",
      "MessageIndex": 21,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "You go girl, you're gonna send those mets packing!  You have my love and my prayers!   RE",
      "MessageIndex": 4,
      "PostDate": "08/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288527",
      "Title": "Done and Done"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I am so sorry to hear that you have to fight this again! I wish there was something more I could do, know that you will be in my prayers. Hugs RE",
      "MessageIndex": 71,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I texted her on the 7th and she responded that she had been in the er for 6 hours the night before due to difficult pain issues.  THey were looking for blood clots, happily they did not find any, but they also were not able to determine the reason for her pain.  They gave her stronger pain meds and sent her home, she was resting cmfortably.  I sent her a photo of a past luncheon and it made her smile!  If I get an update I'll let you all know!  Hugs!!!    RE",
      "MessageIndex": 3,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://csn.cancer.org/node/261005",
      "Title": "Chenheart -- Any word, or updates?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Thank you Leeza, I truly enjoy sharing the photo's I take I just wish I had taken more on Saturday. (¯`v´¯) .`•.¸.•´ ¸.•´¸.•´¨) ¸.•*¨) (¸.•´ (¸.•´ .•´ ¸¸.•¨¯`•.•..•¨*RE",
      "MessageIndex": 19,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Of course I remember you! Sorry to hear you have had such a rough battle with the recon process but glad to hear you are in good hands now! Please let us know how things go, I finally finished my recon last April! Hugs, RE",
      "MessageIndex": 2,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://csn.cancer.org/node/235785",
      "Title": "Remember ME?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I posted a few more pictures tonight, just click on my name and go to my expressions page if you wish to see them. RE",
      "MessageIndex": 26,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "You are so silly, I just saw the photo's and you two both look great with beautiful smiles too boot! So happy you were able to spend time together! Hugs, RE",
      "MessageIndex": 1,
      "PostDate": "21/06/2012",
      "ThreadURL": "https://csn.cancer.org/node/242101",
      "Title": "Now for the photos"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "It was my pleasure, I am a shutter bug so it comes naturally for me to be taking pics. However, I usually take a lot more I was just so excited to see everyone that I neglected to snap more pics. Glad you all enjoyed the ones I did take. Hugs to all, RE",
      "MessageIndex": 55,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Everyone, Well I am seven hours from going to the hospital for reconstruction. All of your posts have meant so much and been so helpful to me. I am not nervous right now, just want to get the show on the road. I spent much of today cleaning the house, ironing my husbands work clothes for the upcoming week and going out and buying a few sports bras since it was suggested here that I may need a few. Oh yes, I also pampered myself with a new haircut which is always nice. My husband took me out to dinner and the rest of the night was spent just relaxing. Anyway, I wanted to let you all know that I appreciate the time and kind words you have sent my way. I will post an update regarding my recon. as soon as I am able. My very best to each of you! RE",
      "MessageIndex": 0,
      "PostDate": "27/02/2009",
      "ThreadURL": "https://csn.cancer.org/node/165854",
      "Title": "A Note From RE"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "It was my pleasure, I am a shutter bug so it comes naturally for me to be taking pics. However, I usually take a lot more I was just so excited to see everyone that I neglected to snap more pics. Glad you all enjoyed the ones I did take. Hugs to all, RE",
      "MessageIndex": 9,
      "PostDate": "30/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I felt that massive and wonderful hug and it was wonderful, thank you Ritzy and all you other gals who are such a great source of love and support! RE",
      "MessageIndex": 16,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I felt that massive and wonderful hug and it was wonderful, thank you Ritzy and all you other gals who are such a great source of love and support! RE",
      "MessageIndex": 64,
      "PostDate": "15/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "How wonderful that you all were able to attend the call, thank you for doing so! I was busy watching my grandkids while their mom took Ian to kindergarden to help ease him into it. Hopefully I will be able to attend the next one. Hugs, RE",
      "MessageIndex": 10,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172708",
      "Title": "It Was A Great Conference Call Today! :)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I posted a few more pictures tonight, just click on my name and go to my expressions page if you wish to see them. RE",
      "MessageIndex": 72,
      "PostDate": "31/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I would have done the same thing Trish, I do not like those things! Thanks for sharing, you had me laughing at the visual your words portrayed. BIG HUGS, RE",
      "MessageIndex": 15,
      "PostDate": "17/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168633",
      "Title": "O.M.G.!!!!!!!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Thank you Leeza, I truly enjoy sharing the photo's I take I just wish I had taken more on Saturday. (¯`v´¯) .`•.¸.•´ ¸.•´¸.•´¨) ¸.•*¨) (¸.•´ (¸.•´ .•´ ¸¸.•¨¯`•.•..•¨*RE",
      "MessageIndex": 65,
      "PostDate": "02/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/199681",
      "Title": "Thanks RE, Cats Toy & Bella Luna for the photos of the CSN REunion!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hi Pammy, Sometimes when I change my photo I have to restart my laptop for it to show up, I also have to sometimes do it more than once before it actually changes. Hope you to see you new photo soon, by the way I love the kitty photo. RE",
      "MessageIndex": 7,
      "PostDate": "08/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169596",
      "Title": "Pic of me......"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Back in Nov. of this year I asked my oncologist this very question and wrote his answer down, this is what he said. \"5 years got ingrained because it is a National Statistical reporting point for cancer: For breast cancer the main risk is about a 10 year risk period beyond which there is a 1 to 2 percent risk of recurrence. Different cancers have different times to them based on their behavior. With breast cancer you can never really say a woman is cured no matter how long It has been so it is important to be diligent you keep on top of things.\" I hope this was helpful, it cleared things up for me as I have never felt like after 5 years I was good to go. I see cancer as a type of chronic illness we have to always be watching for so we can find it early and squash it because it gets a hold on us. RE",
      "MessageIndex": 1,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/239031",
      "Title": "5yr question??"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "My secret is I quit working....sorry but that is the truth. I went back to work 5 hours a day 5 days a week (could not do full time). I was laid off along with 450 others when the company I had worked with for 26 years restructured. I attempted to get work but no one would have me, one look at my arm with the pressure sleeve and that was that. I did have a recurance and am currently on disability due to my arm. I wish I had better things to tell you, actually its okay I get to enjoy my grandchildren. We simply had to revisit our priorities and restructure ourselves. ;-) Hugs, RE",
      "MessageIndex": 1,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171101",
      "Title": "How long does fatigue last??"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Pat, I am so sorry you are having to deal with this I know how scary (as we all do) it can be. I will be praying for you and sending cyber hugs your way. Should it turn out to be a recureance you can do this too, I know as I had to. It is doable and you we are here for you! Wishing there was more I could do for you! <<<<<<<<<>>>>>>>>> RE",
      "MessageIndex": 7,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176273",
      "Title": "Definitely NOT Dancing With Ned"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Your Daddy sounds like he was a wonderful man, I love your name story thank you for sharing it with us. RE",
      "MessageIndex": 104,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Judy thank you for this most uplifting family update, I most certainly do remember little Casey Alexander what a joy he was as well. HUGS, RE",
      "MessageIndex": 18,
      "PostDate": "31/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/204431",
      "Title": "Sharing Good News - New Great Grandson (Non-breast cancer related)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Well mine is rather simple it is the first two letter's of my actual name \"RE\" is short for \"RENA\" which means to be reborn. When one has cancer you are in a sense \"reborn\" because we are never quite the person we were before, it enlightens you to just how valuable and fleeting life can be, it makes you aware of how important every moment is. It is also really easy to remember! ;-) ♥ RE ♥",
      "MessageIndex": 6,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Well mine is rather simple it is the first two letter's of my actual name \"RE\" is short for \"RENA\" which means to be reborn. When one has cancer you are in a sense \"reborn\" because we are never quite the person we were before, it enlightens you to just how valuable and fleeting life can be, it makes you aware of how important every moment is. It is also really easy to remember! ;-) ♥ RE ♥",
      "MessageIndex": 106,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Well mine is rather simple it is the first two letter's of my actual name \"RE\" is short for \"RENA\" which means to be reborn. When one has cancer you are in a sense \"reborn\" because we are never quite the person we were before, it enlightens you to just how valuable and fleeting life can be, it makes you aware of how important every moment is. It is also really easy to remember! ;-) ♥ RE ♥",
      "MessageIndex": 56,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Vicki how did I miss this post! I am late but you know you always have my greatest thoughts and prayers! I am glad it seems all is going to be okay! Hope you feel the tremendous HUG I am shooting your way from my side of the state! HHHHHHHHHHHHUUUUUUUUUUUUUUUUGGGGGGGGGGGGGGGGGSSSSSSSSSSSSSSSSSSSSSSSS!!!!!!!!!!!!!!!!!! RE",
      "MessageIndex": 26,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233694",
      "Title": "Some 'HAPPY' news -- Just want to share with all of you -- thru the good times, and bad"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Your Daddy sounds like he was a wonderful man, I love your name story thank you for sharing it with us. RE",
      "MessageIndex": 4,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Your Daddy sounds like he was a wonderful man, I love your name story thank you for sharing it with us. RE",
      "MessageIndex": 54,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Okay ladies I sent my ornament out just about an hour ago so those who are still waiting keep your eyes on your mail box. Oh yeah I put up recent pics of Ava yesterday for those who are interested. RE",
      "MessageIndex": 0,
      "PostDate": "23/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180431",
      "Title": "Ornament mailed (sorry it took so long!)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Thanks for all the great information, my husband had shingles on his face and eyelid last year it was quite painful.  I did not realize you could get it more than once.  Again thank you! RE",
      "MessageIndex": 4,
      "PostDate": "31/12/2012",
      "ThreadURL": "https://csn.cancer.org/node/252210",
      "Title": "Little bit of info about the Shingles Vaccine I found"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "She is always on my heart, always in my prayers and always on my mind.  I love her a ton and I will lift her in prayer of course asking that this be removed from her in the fashion we all desire but if that is not to be what is to come than I ask that she be given comfort, peace and the knowledge that she is GREATLY LOVED!!!!   RE",
      "MessageIndex": 33,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Your Daddy sounds like he was a wonderful man, I love your name story thank you for sharing it with us. RE",
      "MessageIndex": 154,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Well mine is rather simple it is the first two letter's of my actual name \"RE\" is short for \"RENA\" which means to be reborn. When one has cancer you are in a sense \"reborn\" because we are never quite the person we were before, it enlightens you to just how valuable and fleeting life can be, it makes you aware of how important every moment is. It is also really easy to remember! ;-) ♥ RE ♥",
      "MessageIndex": 156,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I had 28 chemos all together, 6 the first time, 18 the second time and 9 years later 4 more. RE",
      "MessageIndex": 6,
      "PostDate": "02/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/195664",
      "Title": "May I ask you, how many chemo treatments did you have altogether?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "So EXTREMELY happy for you Laurissa, NED is someone we all want to have and hold on to good for you! Hope your weekend is one of celebration. RE",
      "MessageIndex": 1,
      "PostDate": "05/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187444",
      "Title": "Glad to meet you, NED"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Vicki I too am at a loss for words that kind of betrayal would be quite painful. I agree that counseling at least for you to help you find a way to constructively deal with this is a good idea. I am sending virtual cyber hugs and as you can see we are circling the wagons of support around you, hope you feel the love! BIG GIGANTIC LOVING HUGS, RE",
      "MessageIndex": 63,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "She is always on my heart, always in my prayers and always on my mind.  I love her a ton and I will lift her in prayer of course asking that this be removed from her in the fashion we all desire but if that is not to be what is to come than I ask that she be given comfort, peace and the knowledge that she is GREATLY LOVED!!!!   RE",
      "MessageIndex": 80,
      "PostDate": "25/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I spent my Saturday and Sunday camping in the hills of California with my daughter, her husband, my two grandsons and my best friend and her family. I rode my quad lame arm and nerve damaged hand and all. To heck with the pain I am having as a result, it was so worth it to be out in the sunshine with my family and friends enjoying life. We have all worked so hard to still be here and we soooo deserve to enjoy each and every moment we are blessed with. My Best to Each of You, RE",
      "MessageIndex": 19,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167771",
      "Title": "Moopy and Aortus are ALIVE!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Yes this is indeed a great idea! I will be lighting candles and saying extra prayers daily. Thank you for this. RE",
      "MessageIndex": 8,
      "PostDate": "28/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225318",
      "Title": "1 Week -- Prayer and Candle VIGIL -- starting 8/28/11 -- 8:00 EST // STRENGTH, COURAGE AND HOPE"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hi Melissa, no need to ever be sorry for bringing your Mom to our attention we loved her dearly! Thank you for your kindness in sharing her with us! Truly am sorry for your loss, your Mom was a very sweet lady. Hugs, RE",
      "MessageIndex": 9,
      "PostDate": "16/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240292",
      "Title": "Laurissa"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Claudia when I read this last night on FB I felt as if someone had sucker punched me! I hate the word hate but I do hate cancer. It is such a sneaky nasty little beast. I want you to know you are of great value not just to Reggie but quite obviously to all us warrior women on this board. I truly wish none of us had a cause to be here but since we do I am grateful for each of you especially you Claudia who so freely gives of yourself to aide others. Yes you have a battle ahead of you, go into it knowing we are all surrounding you with our love virtually, envision the positive thoughts, prayers, hugs and such that are being lifted for our 50 foot woman. There is no shame in momentary break downs as you adjust to such unforeseen news, cry all you need to it helps to cleanse the soul and renew your strength. I am so glad you have Reggie, I believe he will be your strong hold in this upcoming storm please thank him for us. Thank you Chen~Heart for letting us help you through this, now relax as much as possible, take some deep breaths and try to find something to distract you for a bit, something that will lift your spirit. Love to my friend, RE",
      "MessageIndex": 35,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Vicki I too am at a loss for words that kind of betrayal would be quite painful. I agree that counseling at least for you to help you find a way to constructively deal with this is a good idea. I am sending virtual cyber hugs and as you can see we are circling the wagons of support around you, hope you feel the love! BIG GIGANTIC LOVING HUGS, RE",
      "MessageIndex": 13,
      "PostDate": "17/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220777",
      "Title": "husband signed up to online dating"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I have been waiting to see a post from you, happy~happy~joy~joy! That most certainly if fantastic news, thanks for updating us~ BIG HUGS, RE",
      "MessageIndex": 4,
      "PostDate": "05/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/215717",
      "Title": "No Colon Cancer,Thank you Jesus"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I am deeply sorry for your loss, he will always be with you in memories of all the time spent together and in your daily walk as he surely had an impact on you. You will be in my thoughts and prayers. RE",
      "MessageIndex": 15,
      "PostDate": "29/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195452",
      "Title": "Lost my Dad June 21st"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Claudia when I read this last night on FB I felt as if someone had sucker punched me! I hate the word hate but I do hate cancer. It is such a sneaky nasty little beast. I want you to know you are of great value not just to Reggie but quite obviously to all us warrior women on this board. I truly wish none of us had a cause to be here but since we do I am grateful for each of you especially you Claudia who so freely gives of yourself to aide others. Yes you have a battle ahead of you, go into it knowing we are all surrounding you with our love virtually, envision the positive thoughts, prayers, hugs and such that are being lifted for our 50 foot woman. There is no shame in momentary break downs as you adjust to such unforeseen news, cry all you need to it helps to cleanse the soul and renew your strength. I am so glad you have Reggie, I believe he will be your strong hold in this upcoming storm please thank him for us. Thank you Chen~Heart for letting us help you through this, now relax as much as possible, take some deep breaths and try to find something to distract you for a bit, something that will lift your spirit. Love to my friend, RE",
      "MessageIndex": 129,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Claudia when I read this last night on FB I felt as if someone had sucker punched me! I hate the word hate but I do hate cancer. It is such a sneaky nasty little beast. I want you to know you are of great value not just to Reggie but quite obviously to all us warrior women on this board. I truly wish none of us had a cause to be here but since we do I am grateful for each of you especially you Claudia who so freely gives of yourself to aide others. Yes you have a battle ahead of you, go into it knowing we are all surrounding you with our love virtually, envision the positive thoughts, prayers, hugs and such that are being lifted for our 50 foot woman. There is no shame in momentary break downs as you adjust to such unforeseen news, cry all you need to it helps to cleanse the soul and renew your strength. I am so glad you have Reggie, I believe he will be your strong hold in this upcoming storm please thank him for us. Thank you Chen~Heart for letting us help you through this, now relax as much as possible, take some deep breaths and try to find something to distract you for a bit, something that will lift your spirit. Love to my friend, RE",
      "MessageIndex": 82,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "There are just no words for how special this was! I just read the article and it really touched my heart! Your little guy has a heart filled with love for his mommy. Thank you so much for sharing such an uplifting moment in your life with us. HUGS to you any your little guy, RE",
      "MessageIndex": 6,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166704",
      "Title": "Son supported MOM today"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Now that is some good news, so glad the meds are working well for you and that you are getting some of your time freed up! Hugs, RE",
      "MessageIndex": 4,
      "PostDate": "27/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/223189",
      "Title": "126/84"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "MAY 16",
      "MessageIndex": 77,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Skipper I am deeply sorry to hear of the loss of your wonderful sister. I too have lost a sister to the beast almost 3 years to this date, we do miss them but as time goes on we begin to recall the good times and the treasured memories. She is in Heaven and she is free of all pain, I am sure she will be watching over you all until you see her again. I will be sending prayer for you and all of your family, my deepest condolences! RE",
      "MessageIndex": 14,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208154",
      "Title": "I Lost My Sister Today"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "MAY 16",
      "MessageIndex": 26,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Heather, Oh my what a beautiful little girl you have, you must be so proud! In response to your concerns let me say that it is scary ground, but I am so glad I had it done. I put it off for 4 years, then I lost my mom to ovarian cancer after she had fought breast cancer twice. That was enough for me. I was obviously quite sore for several weeks, the menopause problems were much less than I had anticipated! At first I cried easily, I would even cry at emotional commericals. The emotions settled down after about 3 months, I also had the problems with hot flashes so I had a lot of fans going and I would apply ice packs to cool me down. Since I too have had breast cancer hormones are not an option for me. As far as your femininity goes that did not change for me either. I am still just as girlish as I ever was and have truly not felt any change to who I truly am. Wishing you well, RE",
      "MessageIndex": 4,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163429",
      "Title": "I may have already posted this but 125ca #'s up!!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "FANTASTIC! I am so happy for you, now a deep breath and a sigh of relief go enjoy your weekend! RE",
      "MessageIndex": 6,
      "PostDate": "21/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/234365",
      "Title": "Update on mammo freak out!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Thank you for participating Traci, now you are indeed famous!    Love your photo, you look radiant!",
      "MessageIndex": 10,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288074",
      "Title": "I'm in The New England Journal of Medicine!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Now isn't that just the most spectacular thing ever!!! So very happy for you, yes get out and celebrate you deserve some fun!!! RE",
      "MessageIndex": 8,
      "PostDate": "18/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/234177",
      "Title": "Rad Grad!!!!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Barbara I am sorry to hear that you are in such pain, I hope the radiation surgery is a success and will ease some of your pain! Will be keeping you in my prayers. ❤ RE ❤",
      "MessageIndex": 1,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198623",
      "Title": "Update BJmom"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Skipper I am deeply sorry to hear of the loss of your wonderful sister. I too have lost a sister to the beast almost 3 years to this date, we do miss them but as time goes on we begin to recall the good times and the treasured memories. She is in Heaven and she is free of all pain, I am sure she will be watching over you all until you see her again. I will be sending prayer for you and all of your family, my deepest condolences! RE",
      "MessageIndex": 64,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208154",
      "Title": "I Lost My Sister Today"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Okay here's the deal, lets all share a Thanksgiving memory that we hold dear. I posted this last year, however since there are many new folks here I shall repeat it...here goes. A couple of years back we all decided to gather in the desert for Thanksgiving at my sister in-laws house in honor of her (she had passed several weeks earlier). We decided none of us wanted to cook so we pre ordered our dinner from Safeway, sounds easy right? Well, we weren't in a hurry to eat so we put off picking it up until 3:00 Thanksgiving day just before they closed (I know I can hear you shouting \"Are You Nuts\", perhaps . Any who, we picked up our meal hungry and excited to get home and eat it. When we walked in the house the guys had lovingly set the table (or perhaps they did it because they wanted to eat right away) seeing this we decided to serve it up. We figured we would have to reheat a few things so we got right to it, ha guess what.....EVERYTHING was frozen! Yup, you read right FROZEN SOLID! Oh my we now had to figure out what was the fastest way to thaw mashed potatoes, stuffing, pumpkin pie, an entire turkey and green bean salad with just one medium microwave. I boiled water and we had dishes of hot water with floating potatoes, pies, stuffing etc inside. Now, let me defer from that for a moment because the Thanksgiving fun did not end there. My sister in-law raised miniature pinchers and had a kennel in the back yard. Well, it was time to feed the little guys and to our horror one of them shot out of the kennel like a rocket. Suddenly every adult was in the yard cooing and calling this tiny dog and he was having none of it, off he ran through the fence. To explain the difficulty here she lives in the desert with wide open spaces filled with tumble weeds and coyotes beyond her gates. My niece is out the gate in her stocking feet keeping an eye on where he goes and the guys are on quads trying to herd him back home, trust me these are not cowboys! Finally the little guy returns to the confines of the property and once again they are perplexed on how to get him back in his cage. My husband and his brother go back to their kid rabbit catching days and put some meat in his cage and attach a string to the cage door, once he went for the meat WHAM they yanked on a fishing pole they had attached to the gate handle, the door was shut and he was safe once again. Poor little thing was exhausted, he got a bit more treats that night and a pedicure to ensure he had not hurt his paws. Okay, back to the frozen meal. As I read the instructions on how to prepare this meal I discovered although it was cooked it still required an hour in the oven to complete the process AHHHHH! Mind you this all started at 3:00, we finally sat down to dinner at 8:00. Don't worry we didn't miss our dessert; we just ate it first and had the main course last. All this said I am thankful for my faith, family (extra thankful for the 3 grand children) and friends. I am thankful for my health, a roof over my head, I am thankful for all of you here who so freely show how much you care. And of course I am tremendously thankful for my husband who has never wavered in his love and support of his rather goofy wife. HAPPY THANKSGIVING TO EACH OF YOU! HOPE YOU HAVE A GREAT ONE! ♥ RE ♥",
      "MessageIndex": 0,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180361",
      "Title": "THANKSGIVING MEMORIES: LET'S SHARE!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Totally understandable, you too will be in my prayers. RE",
      "MessageIndex": 22,
      "PostDate": "03/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208916",
      "Title": "I have to escape for a while"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Chen you suckered me in on this one....I was truly wondering what scam was out there that you were going to use your great wisdom to warn us of. Then you clobbered me with a host of laughter, thank you my friend! RE",
      "MessageIndex": 9,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186526",
      "Title": "This could be a scam....or not!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Kathi I wish I could wave a magic wand and get you to the point in your future where this has all been ironed out. You truly are one very remarkable woman who has many strengths, being such I know you will come out of this better for taking the journey. I wish you both happy day's ahead, know that you are loved and supported. You most certainly will be in thoughts and prayers. Hugs, RE",
      "MessageIndex": 9,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214141",
      "Title": "Off topic....may be my last dutch treat....sigh...."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Linda I am so sorry to hear of this. I have had to have several cats and dogs put down over the years due to poor health and it is never easy but as loving friends we do find ourselves having to make this decision. I had a black lab that had stomach cancer, we had the tumor on his tummy removed and he lived comfortably for several more years. I know you will know in your heart when the comes to say good bye to your dear friend. My heart does go out to you and your family, love him, pet him and play with him while he is here, he knows your heart and knows you love him deeply. RE",
      "MessageIndex": 11,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214129",
      "Title": "my dog has cancer"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Congrats on the six years, I for one am quite happy you found us! Enjoy your day! RE",
      "MessageIndex": 9,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173042",
      "Title": "To perhaps relieve some ambivalence..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Love Is... Love is patient; love is kind; love is not envious or boastful or arrogant or rude. It does not insist on its own way; it is not irritable or resentful; it does not rejoice in wrongdoing, but rejoices in the truth. It bears all things, believes all things, hopes all things, endures all things. - Corinthians 13:4-7 Wishing you all a very Happy Valentines day.",
      "MessageIndex": 0,
      "PostDate": "14/02/2008",
      "ThreadURL": "https://csn.cancer.org/node/156933",
      "Title": "HAPPY VALENTINES DAY!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Julia, I am so sorry you have to go through this but the mammogram is very important to your well being. I have mine yearly (or more often is there appears to be a problem) and it is painful because the one breast is dense and tight from the surgery and the radiation. I realize this is difficult for you however, it is necessary for the doctors to be able to find any future cancers as early as possible. Perhaps you could express your feelings to your doctor or the nurse, they may be able to give you meds that will take the edge off when you go in for your mamogram. I agree that Ultrasounds may be another option for you that you should discuss with your doctor. My best to you, I wish you well! RE",
      "MessageIndex": 5,
      "PostDate": "11/11/2008",
      "ThreadURL": "https://csn.cancer.org/node/163423",
      "Title": "Do I HAVE to have a Mammogram?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh HAPPY DAY!!!! Congratulations Maureen, now get out there and celebrate!!!! RE",
      "MessageIndex": 7,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173547",
      "Title": "Dancing with NED"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Tasha, this is lovely and the sign on the gate is sooooo you!!! Thanks for sharing! RE",
      "MessageIndex": 44,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Wanda, I was on Tamoxifen for 6 months prior to the cancer returning. Once it returned I did not go back on it since it did not work for me the first time. On the other hand my sister was put on it after her second bout with cancer and it kept it at bay for 5 years with little side effects. ♡♡ RE ♡♡",
      "MessageIndex": 5,
      "PostDate": "15/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198598",
      "Title": "reoccurance question"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "You have my prayer for peace and patients as well as healing and comfort! You will continue to be in my prayers as always! ♥ RE",
      "MessageIndex": 13,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "MiMi I scanned over 1000 old photos last year and put them on discs. At Christmas I gave one to each of my sibling and my daddy. It was so much fun to watch with them and we all now have copies we can print from if we want to. RE",
      "MessageIndex": 26,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Thank you for sharing your hobby with us, what beautiful cakes you create. I did this for my children years ago and loved it, you surely have a gift. RE",
      "MessageIndex": 6,
      "PostDate": "11/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216102",
      "Title": "Pics of my hobbies now posted on my expressions- Enjoy"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "She is doing so well that she has gained a few ounces and is much more active. She was really very quiet and sleepy the first week, now that she is better her eyes are open all the time. It is such an amazing difference, she obviously feels a lot better. She goes back to the doctor next week. I can't thank you all enough for your prayers! RE",
      "MessageIndex": 1,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170867",
      "Title": "RE"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "You have my prayer for peace and patients as well as healing and comfort! You will continue to be in my prayers as always! ♥ RE",
      "MessageIndex": 64,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hi Moopy I just posted a photo with her other brother Ian who is the oldest and loves to hold her. Everyone thank you again for your thoughtfulness regarding Ava and her well being, it is truly heart warming to the support you have all shown. Little Ava's parents are doing well and seem to have adjusted well to the new family member. Hugs to all, RE",
      "MessageIndex": 11,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170867",
      "Title": "RE"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "MiMi I scanned over 1000 old photos last year and put them on discs. At Christmas I gave one to each of my sibling and my daddy. It was so much fun to watch with them and we all now have copies we can print from if we want to. RE",
      "MessageIndex": 63,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Tasha, this is lovely and the sign on the gate is sooooo you!!! Thanks for sharing! RE",
      "MessageIndex": 7,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/169266",
      "Title": "How do I show a picture"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Can't miss me I just won't go away! I too have been missing phoenixrising, bfbear, joycelouise amongst others. Hugs to all and sweet wishes of GREAT HEALTH going out to all. RE",
      "MessageIndex": 10,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185854",
      "Title": "I miss you guys"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Robert, you know us Pinks like to be noticed and we do all we can to make sure the Pink in need knows we are nearby no matter how much the nurses and docs wish we would tone it down! Extremely glad to hear you got such a glowing medical report! I love that you were so attentive to your wife (so was my husband all three times~what a guy!) I assure you your wife deeply appreciates it! Now on to the design of your T-shirt and hat, they sound awesome, I hope you will post pictures when you get them. My best to you and your wifey, RE",
      "MessageIndex": 7,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/239014",
      "Title": "More \"Positive News\" - Monthly onc visit & Zometa Infusetion"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I came here in 2004 (5 years after treatment) when it came back in 07 I stayed away (go figure!) I come here to help those who may need the knowledge I have acquired along the way, I come to encourage and to lift up those in need. I also come here to cry, vent and listen. Sometimes I stay away for a bit, but then I return because I feel bound to many of you and bound to give back whatever I can in return for all I have received. It is personal for each of us, I cannot put a time limit on when one should exit. Love to each of you, RE",
      "MessageIndex": 10,
      "PostDate": "08/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175285",
      "Title": "☺When Is It Time?☻"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Three cheers for Linda....hip hip hooray~ hip hip hooray~ hip hip hooray no more active treatment after today!!! So happy for you! RE",
      "MessageIndex": 5,
      "PostDate": "24/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214794",
      "Title": "I am a rad grad! Yipee!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Some of you know we have been working like mad on our home for the past two months or so and some have asked that I post a photo when done. Well we are nearly done so I posted a picture of some of it in the expressions gallery, enjoy. RE",
      "MessageIndex": 0,
      "PostDate": "15/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/182022",
      "Title": "FYI on our home improvement"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Can't miss me I just won't go away! I too have been missing phoenixrising, bfbear, joycelouise amongst others. Hugs to all and sweet wishes of GREAT HEALTH going out to all. RE",
      "MessageIndex": 48,
      "PostDate": "13/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185854",
      "Title": "I miss you guys"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Joyce, I have been dealing with breast cancer for 11 years as a survivor and about 33 as a caregiver. I never came to this site because I did not know it was here. I would not go to a face to face place cause my daddy always said \"do not air your dirty laundry and keep private things private\". Now that said the 6 weeks I have been coming here have been great and I will keep coming. Let me see what kind of gal am I. I am a Christian first, wife, mother, grandmother, sister and friend. I love animals and have four myself, I love to make folks laugh, I enjoy singing, photography, camping, riding my quad and going out with friends. I have been told I am analytical, I see myself as a kind person, I adore children as they seem to refresh the soul with their antics. I love to write letters and have several pen pals. Okay that is all I can come up with. This was refreshing Joyce, thanks for the post and have a wonderful day. Rena",
      "MessageIndex": 1,
      "PostDate": "21/03/2008",
      "ThreadURL": "https://csn.cancer.org/node/157299",
      "Title": "What kind of person are we?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ CONGRATULATIONS ON YOUR BIG DAY!!! ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥ ♥ ♥ ♥ ♥♥ ♥ ♥ ♥",
      "MessageIndex": 5,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180063",
      "Title": "Our 35th anniversary"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Margo I am glad you checked in I have been checking today to see if there was a note from you. Glad it went well, please rest now and be kind to yourself and of course drink plenty of fluids. We are here for you. Hugs, RE",
      "MessageIndex": 6,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184877",
      "Title": "My first treatment"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I have been here since 2004, I became active in chat near the end of 2007 and will surely be popping in here for many hears to come. RE",
      "MessageIndex": 11,
      "PostDate": "09/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196053",
      "Title": "How long have you been on this board?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Sending out prayers for her, no fun at all but keeping positive and fighting will make it easier. Hugs! RE",
      "MessageIndex": 68,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/244419",
      "Title": "smalldoggroomer Update (Another update 8/12/12 & 8/13/12)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "You are the best Zah, I used to love all those chats we all had....those were some good times..we carried each other far in this virtual world!   Love ya! RE",
      "MessageIndex": 5,
      "PostDate": "04/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288123",
      "Title": "Diabetes and Cancer too!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Sending out prayers for her, no fun at all but keeping positive and fighting will make it easier. Hugs! RE",
      "MessageIndex": 21,
      "PostDate": "07/08/2012",
      "ThreadURL": "https://csn.cancer.org/node/244419",
      "Title": "smalldoggroomer Update (Another update 8/12/12 & 8/13/12)"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Ahhh Zah, sorry to hear of this recurrance!  You have always been one heck of a gal and I have missed you, although I'd be fine with continuing to miss you if it meant no recurrance!  Know that I will be lifting you in prayer my friend!!!  Sending loving supportive hugs your way!!!  HUGS HUGS HUGS!!!!!",
      "MessageIndex": 4,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288123",
      "Title": "Diabetes and Cancer too!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Ahhhh, now that was very heart warming!  I am so glad you have been enjoying them year after year in honor of the Pink Kindreds!  <3 <3 <3   RE",
      "MessageIndex": 6,
      "PostDate": "06/10/2014",
      "ThreadURL": "https://csn.cancer.org/node/288123",
      "Title": "Diabetes and Cancer too!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh dear Lisa if you think your crying jags are over, sorry but they are not. I still have weepy days for little or no reason at all, just cause I am a girl. I think no matter what it is in our chemical make up, we are a sensitive group. Let the tears fall when you feel like it, it can be cleansing. Hugs, RE",
      "MessageIndex": 4,
      "PostDate": "05/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168226",
      "Title": "\"hormonal\"crying"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "YIPPEE, HALLELUJAH, AND WHOOPEE!!! So very happy for your wonderful news! RE",
      "MessageIndex": 27,
      "PostDate": "19/10/2012",
      "ThreadURL": "https://csn.cancer.org/node/248525",
      "Title": "BENIGN!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Nancy I am so sorry for the loss of your friend, her family will be in my prayers. RE",
      "MessageIndex": 33,
      "PostDate": "18/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214341",
      "Title": "With a heavy heart.."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "It all depends on size of mass, location of mass and if the onco wants to use the mass to determine if the chemo he is giving you is strong enough to destroy the mass. All of my tumors have been under 3 cm and two were located on the outer region of the breast so they were easy to remove. The second one however was my second cancer when it mast. to the chest wall and sentinel node and it was quite visible. It was not removed it was left there to see if the chemo would shrink it which it did. Had it not shrunk it they would have gone to a diff. chemo to see which would work better. Hope this has helped a bit. Hugs, RE",
      "MessageIndex": 1,
      "PostDate": "22/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176057",
      "Title": "I got a question??"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Moopy, hurry and get those shoes. I concur I had problems with my feet during and after chemo, ended up with planters flacitis which is rather painful. Take your time shopping for them and enjoy it, perhaps you two could shop for shoes, take a break for lunch then shop for shoes again. Take care Moopy! RE",
      "MessageIndex": 12,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I was browsing the internet and ran across this quote: Kind words can be short and easy to speak, but their echoes are truly endless. Mother Teresa I Immediately thought of all of you and the kind words you pen here daily and how they are so helpful and full of hope. There have been many times when I have read someones post and thought wow, I could have written that; then I read the responses which are so heartfelt and full of caring. I just wanted to say Thanks and share this quote. This is truly a phenomenal group of survivors. RE",
      "MessageIndex": 0,
      "PostDate": "08/09/2008",
      "ThreadURL": "https://csn.cancer.org/node/162185",
      "Title": "THANK YOU!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Kat you keep up that positive pushing forward attitude and do all that you can do to beat this thing. You are right to not burden yourself with people who cannot see beyond their own selves. I too had my cancer return after completing my chemo (6 rounds) and my odds were 35 percent, I had to do more chemo (a rougher regime of 18 more rounds) but it has been 12 years and I am still here you can beat this. I like that you have a good guy in your life that is lifting your spirits, that is truly a blessing! You continue in my prayers, update when you can and above all take care of yourself!!! Hugs, RE",
      "MessageIndex": 12,
      "PostDate": "17/02/2012",
      "ThreadURL": "https://csn.cancer.org/node/235745",
      "Title": "Time for an update!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Wow aren't you the lucky lady the first one of us to get double the attention Nert and Ned, you go girl! CONGRATULATIONS! Hugs, RE",
      "MessageIndex": 10,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189598",
      "Title": "Hands off, girls -- NED is all mine today!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Happy Birthday Green Eyed Girl, hope your day is Fantastic! RE",
      "MessageIndex": 1,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/188845",
      "Title": "Thursday the 25th is Green Eyed Girls Birthday"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Jenny what you express it normal, time will help it to ease a bit. Trust that you are in my prayers, keep that fighting spirit going it can take you far!",
      "MessageIndex": 9,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186718",
      "Title": "Say a prayer for me please..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Forgot to mention how cute the doggy is!",
      "MessageIndex": 3,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176057",
      "Title": "I got a question??"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I too have been missing you, I hope all is well and I hope to hear from you soon. In the meantime I will choose to believe you are doing great and are out and about enjoying your life. Hugs, RE",
      "MessageIndex": 8,
      "PostDate": "16/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177389",
      "Title": "phoenixrising--AKA Jan--where are you?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hey there Jan, happy to hear from you but sorry to hear about the depression. I hope it passes soon as you deserve lots of happy times! You get to dreaming about that cruise then perhaps you can start planning one! Sending my love and more importantly my prayers. Love ya! RE",
      "MessageIndex": 18,
      "PostDate": "19/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177389",
      "Title": "phoenixrising--AKA Jan--where are you?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Nothing like the comfort of ones own home, glad you two and your pooches are back home where you belong. Elated to hear we are stuck with you!!! Hugs, RE",
      "MessageIndex": 4,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173685",
      "Title": "Home from St. Louis... at last!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Today I went to see my reconstruction surgeon so we could evaluate how things are coming along (notice I said “WE”). Well if you have followed my other reconstruction posts you will recall he and I had discussed some sanding (remember the car ref) to smooth a few rough edges out. Now in addition to that I wanted to know what is needed to reconstruct a nipple and areola for my new breast. He said it is a pretty simple thing to do, but it does involve grafting from the lower area of my belly (don’t worry I have enough to spare). This skin is circular and it is grafted around the nipple and skin and bandages will be sutured into me around the new nipple he will create for me. I was told that sometimes this type of graft will darken on its own and look quite natural so tattooing will not be needed, we shall see. In addition to that I have noticed that when I lay down the new breast tends to slide a bit to the side (how odd is that). He stated that that sometimes occurs with big breasted women (trust me I was not that big breasted) so he is going to go in while he is doing all this other stuff and resucture that side to reinforce it to better stay where it is supposed to be which will help it to better stay where it is supposed to be. The whole thing should take a little over two hours. I do not have a date yet but it will be soon, I’ll keep you all updated. Hugs to all, RE",
      "MessageIndex": 0,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175035",
      "Title": "RECONSTUCTION RE IS HAVING HOPEFULLY ONE FINAL SURGERY"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Darlene, it is a pleasure to meet you. I will certainly be thinking of you on Monday and sending cyber hugs your way as you go for treatment! Many Hugs, RE",
      "MessageIndex": 1,
      "PostDate": "05/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167045",
      "Title": "Special Thank you to All"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh Barb sorry to hear about the gallbladder issues, I certainly hope you get to feeling better soon. Happy to hear from you, so sorry for you losses. Hugs, RE",
      "MessageIndex": 17,
      "PostDate": "06/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209224",
      "Title": "update on BJMOM"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I am so sorry you have had such a loss, my deepest sympathies and prayers go out to you and yours! I know how you feel as I lost my sister to pancreatic cancer while in treatment for breast cancer, it certainly can rock one to ones core! On the up side how wonderful that you have a beautiful new grand daughter to shower with love! Hugs, RE",
      "MessageIndex": 5,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://csn.cancer.org/node/250119",
      "Title": "Trying to stay positive"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "CUTE~CUTE~CUTE!",
      "MessageIndex": 1,
      "PostDate": "04/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171103",
      "Title": "4th of July joke"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh my you look lovely, your hair looks full and beautiful! It's a two thumbs up for sure! ❤ RE ❤",
      "MessageIndex": 16,
      "PostDate": "16/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198674",
      "Title": "This is me with 5 months of new hair."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh JoJo I am so very, very sorry for the loss of your dearest Stacy I wish there was something I could say to make this better but there is not. Please know that I will be praying for you, Stacy's children and her loved ones, this is such a tragedy. It sounds like you were blessed with a truly wonderful cousin who cherished you as much as you cherish her. Hang in there JoJo, I wish you comfort and strength in the coming days. (¯`v´¯) .`*.¸.*RE´",
      "MessageIndex": 63,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Millie, No words I can say will be enough to comfort you for the loss of your mom, my father in-law had Alzheimers and I recall had difficult it can be. In regards to your hair, trust me it comes back in time. Check out the American Cancer Society in your area and ask them about their \"Look Good Feel Better\" program. It is a program that as stated in brochure \"teaches women beauty techniques to woman cancer patients in active treatment to help them combat the appearance related side effects of cancer treatment.\" Here is a link to the web page www.lookgoodfeelbetter.org Wishing you all the best, RE",
      "MessageIndex": 2,
      "PostDate": "16/03/2009",
      "ThreadURL": "https://csn.cancer.org/node/166401",
      "Title": "2 losses in 1 week"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Oh JoJo I am so very, very sorry for the loss of your dearest Stacy I wish there was something I could say to make this better but there is not. Please know that I will be praying for you, Stacy's children and her loved ones, this is such a tragedy. It sounds like you were blessed with a truly wonderful cousin who cherished you as much as you cherish her. Hang in there JoJo, I wish you comfort and strength in the coming days. (¯`v´¯) .`*.¸.*RE´",
      "MessageIndex": 13,
      "PostDate": "11/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200661",
      "Title": "Im devastated....need prayers!!!!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Happy belated birthday DOT hope it was one filled with joy and the love of those surrounding you! RE",
      "MessageIndex": 9,
      "PostDate": "18/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218669",
      "Title": "Today is Dot53's Birthday!"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "A failure is something you most certainly are not! You Mimi are a bright, beautiful young woman who like the rest of us has had her world thrown askew, you my dear are as normal as any of your friends you think are having pity for you. When you get these thoughts remember how hard you have fought to get where you are and know that this battle has made you a stronger, more sensitive soul. I in no way intend to imply that cancer is good for us because we come out of it with a greater sense of the value of our lives, but somehow we do see things much more clearly. Give it time Mimi you are all you were before and more, do not let cancer steal your happiness it does not deserve it. You are not the poor pathetic sick one, no one knows what secrets we each hold they have their problems as well so hold your head high in the knowledge that you are the strong, intelligent young woman who battled cancer and came out the other side with a host of pink pals who will rally at her side at any given moment you only need to only ask! Now all that said I totally agree with Judy, tell your doctor they may certainly be able to help you and of course who doesn't love a spa treatment! Hugs, RE",
      "MessageIndex": 12,
      "PostDate": "20/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/174090",
      "Title": "I'm having a hard time..."
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "I wish you did not have a need to find us but since you do I am glad you found your way here as this board is filled with many insightful, strong, caring souls. Cancer is indeed a challenge but certainly not one you cannot rise to. It seems when one hears one has cancer there is a re-evaluation of what is important, one does not usually set out to make a list of the important things they just seem to come more into focus. In regards to the mastectomy I think we all react differently, you may find that you are not disturbed by it and you may find that seeing yourself looking so different from what you are used to is a bit dis-concerning either way we will be here for you. I have had a lumpectomy on one side and a mastectomy on the other, I recently completed the reconstruction after more than three years and find that for me it was important. Body image is different for each person. Do you know if you will be having chemo or radiation treatments? If you do there are a lot of tips that can be shared with you . One important tip I will mention is that if at all possible you may want to have someone go to your doctor appointments with you to help you remember it all as there is a lot of information being given and many times it can become a tad over whelming so a second set of ears does help. I truly wish you all the best, RE",
      "MessageIndex": 1,
      "PostDate": "06/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/219970",
      "Title": "Are there any other nuns out there?"
    },
    {
      "AuthorID": "RE",
      "AuthorURL": "https://csn.cancer.org/RE",
      "Content": "Hello Live, There are a lot of types out there to choose from, I have a Jodee Light weight form which I have found is much more comfortable than the \"Myself Ultralite I had been using. Check online so you can see what is out there too, that helped me to know more about them. It is best if you can try them on so you know what works well for you. I called the American Cancer Society and they gave me a list of people in the area that work with breast cancer patients. The form I wear is so natural people don't realize it isn't my natural breast. I hope this has been somewhat helpful. My best to you! RE",
      "MessageIndex": 1,
      "PostDate": "10/09/2008",
      "ThreadURL": "https://csn.cancer.org/node/162246",
      "Title": "mastectomy forms"
    }
  ]
}