{
  "AuthorID": "Rhonda Mohr",
  "AuthorURL": "https://csn.cancer.org/Rhonda Mohr",
  "Posts": [
    {
      "AuthorID": "Rhonda Mohr",
      "AuthorURL": "https://csn.cancer.org/Rhonda Mohr",
      "Content": "Hello. I had a bilateral mastectomy on April 3rd. Stage 0 DCIS, no chemo, rads or hormones so I am very lucky! For several weeks after my drains were removed I had to have my right side aspirated because of fluid build-up. However, no fluid buildup the past month so on Tuesday of last week my doctor \"released\" me. I woke up Friday with a large (size of my palm) lump on the right side right under my incision. It is not sloshy like my other fluid build-ups. It hurts and feels a little warm to the touch but it isn't red. Anyone else had anything like this before? I have an appt later this week to have it looked at but I find that the doctors don't always like to give a name to things like this. I want a diagnosis and it would help to know what it could be before I go in.",
      "MessageIndex": 0,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://csn.cancer.org/node/243028",
      "Title": "Large Hard Lump after Mastectomy"
    },
    {
      "AuthorID": "Rhonda Mohr",
      "AuthorURL": "https://csn.cancer.org/Rhonda Mohr",
      "Content": "Hello. I am a new member recently diagnosed with DCIS in the right breast. It is in more than one location so I have to have a mastectomy. I just saw the plastic surgeon and we discussed reconstruction. I am not eligible to have reconstruction because I am very overweight. I will need to lose at least 70 pounds to be eligible for the surgery. If I can lose the weight it will take me at least a year and then I have to go through more surgery for the reconstruction. I have VERY large breasts. If I have one mastectomy the breast form I will need will be heavy, sweaty and uncomfortable. I think. Plus I'm not sure how happy I am going to be with one huge saggy breast and one total flat side of my chest. Now I am thinking of having both breasts removed so I can wear smaller (D cup) breast forms. I will me much more comfortable as I try to lose weight and hope for reconstruction. I am 56 years old, am not vain, but I am human. Any advice or comments for me?",
      "MessageIndex": 0,
      "PostDate": "14/03/2012",
      "ThreadURL": "https://csn.cancer.org/node/237239",
      "Title": "Single or Double Mastectomy"
    }
  ]
}