{
  "AuthorID": "Sally5",
  "AuthorURL": "https://csn.cancer.org/Sally5",
  "Posts": [
    {
      "AuthorID": "Sally5",
      "AuthorURL": "https://csn.cancer.org/Sally5",
      "Content": "Wow. I can't believe you all felt an earthquake. I thought they were only in California.",
      "MessageIndex": 5,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194993",
      "Title": "Anyone else feel the earthquake a little while ago??"
    },
    {
      "AuthorID": "Sally5",
      "AuthorURL": "https://csn.cancer.org/Sally5",
      "Content": "Not to discount that earthquakes could be bad..... It is so nice to all chat about something else. (Not the C - word). You have all helped restore my sanity. Only found this (CSN) site 5 days ago. I live in California and earthquakes are almost normal for us. *Mimi: Hope your mom is okay (in Michigan).",
      "MessageIndex": 9,
      "PostDate": "23/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194993",
      "Title": "Anyone else feel the earthquake a little while ago??"
    },
    {
      "AuthorID": "Sally5",
      "AuthorURL": "https://csn.cancer.org/Sally5",
      "Content": "Hi, I was under the impression that the oncotype test does two things. It tests whether you need chemo as well as whether the chemo will work for you. It is about weighing the known side effects with the possible positive effects. I have an oncotype score of 4. I was told I did not need chemo. Although I was happy, I was also concerned whether or not I am doing enough..... (I am estro + progest + her 2 -) I did wait for my surgeon (who specializes in cancer) and my oncologist to agree with the results. It is helpful (at least to me) to talk about this. Thanks for the topic. Take care, Merry (Sally5)",
      "MessageIndex": 11,
      "PostDate": "09/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198139",
      "Title": "oncotyping"
    },
    {
      "AuthorID": "Sally5",
      "AuthorURL": "https://csn.cancer.org/Sally5",
      "Content": "Vicki, I am so glad it went well. That was fast. I am about two months behind you. Just had my last fill today.... How does it feel without those \"rocks\"? Anything has to be better. Take care, Merry (Sally5)",
      "MessageIndex": 19,
      "PostDate": "22/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197073",
      "Title": "Vicki Sam is home, resting and recovering -- Not too bad // Exchange went well this morning at 7:30, home by 1 p.m."
    }
  ]
}