{
  "AuthorID": "Scotch Freckles",
  "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
  "Posts": [
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Calabria I had to laugh to myself over your question. My chemo nurse guaranteed me my hair would begin to fall out exactly 10 days from my first chemo. I was prepared. When the first clump came out in my hand I picked the clippers I bought a few days before and cut it all off. What the heck. Everyone I knew, knew about my cancer so the bald head was expected. My husband really loved it. He said I looked good with a bald head since my head was/is so well rounded. I wore bandana's and hats. Wigs were really out for me, the bald head was only temp. But hey wait till the hair comes back. That is really exciting. First it is soft and curely like a new baby's hair. Then it changes, and changes, and changes. Eight years later and I get up every morning with a Rod Stewart hair do. Life is an experience and the hair keeps on growing. Hang in there and keep laughing, laughter is the best medicine.",
      "MessageIndex": 27,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Hey Emily, Since no one seems to be able to cut hair worth a darn I bought one of those suckie machines and cut my own since it just wants to stand up straight any way. 2\" all over, easy as can be. I just purchased some Aveeva hair products to help and it really is helping to settle the hair down some so the mornings aren't so freekie. I love your look and smile. Only way to go. Keep smiling. Scotch Freckles",
      "MessageIndex": 29,
      "PostDate": "27/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Hi Patty, I never lost any weight while on chemo, etc. I told my oncologist I had expected to lose at least 10 pounds but nothing. What a let down. Anyway, I too need someone besides my husband, who just quites eating for a couple of days and has lost what he wants. I need to lose at least 40 also. I too am out 3 years (4/1). Scotch Freckles",
      "MessageIndex": 1,
      "PostDate": "12/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192053",
      "Title": "I need to lose weight and need a support group"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Hi Pat, I ran my hand just behind my ear on the 10th day, my oc nurse reassured me of the 10th day, and several strands came out between my fingers. That was enough for me. I had a pair of clippers, since I had been a barber in one of my life times, and just cut it all off. I didn't want to wake up and find a mess on my pillow. It's OK. Hey if you were close enough I still have my clippers and would do the favor.",
      "MessageIndex": 3,
      "PostDate": "13/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192180",
      "Title": "Hair Loss Symptoms"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "That's a good looking question mark left on your head even if it is the handy work of your surgeon. Maybe a tattoo to highlight your experience? NOT.... Scotch Freckles",
      "MessageIndex": 1,
      "PostDate": "29/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206578",
      "Title": "New expressions"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Whorah. We all wait in anxious anticipation of each other's latest ordeals! Great to hear your's was not too awfully stressful after all. KAH",
      "MessageIndex": 19,
      "PostDate": "18/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203542",
      "Title": "Cyberknife was a BREEZE!!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Kelly dear, You are going down an new path in life which has a lot of unknowns. It is one day at a time. Getting through the chemo is the greatest physical battle because it messes so with your head and your body. I was really upset when I thought I would loose weight while on chemo due to all the stomach problems but never lost a pound. The doc reassured me I was better off for it, shows your healthy. Now I know he was really telling me a fib. The hair thing as you know is only temporary. Just think, you don't have to deal with it while you don't feel like dealing with much else. Oh, your still pretty, inside and out, don't drag yourself down. Your feeling ugly is just the chemo dragging you down. I have been \"cancer free\" since 2007 and tonight I almost lost it over my own breasts. The lumpectomy side is just right, though has a big ol' dent in it. Now I just would like the other breast to be just as small, one hangs low. We all deal any way we are capable of, knowning sympathetic ears are hear for us all really helps. I feel your pain and understand so well. Your story sounds so much like mine. Hang in there, keep laughing, dancing in the rain, it does get better. Best to you during your battle, Kathryn",
      "MessageIndex": 3,
      "PostDate": "12/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/200759",
      "Title": "Cried my eyes out tonight !!!!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I used Scotch because my mother was first generation American, and I love Scotch. Her parents and siblings were all born in Scotland and I hope to one day visit. Freckles was a nick name a neighbor gave me. He asked me where my freckles came from and I didn't know so he told me, \"Your got your freckles from looking through the screen door after it rained and the rust stuck to your face\". His daughter and I met when we were 4 so I guess I looked through their screen door alot. My name is Kathryn.",
      "MessageIndex": 36,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I used Scotch because my mother was first generation American, and I love Scotch. Her parents and siblings were all born in Scotland and I hope to one day visit. Freckles was a nick name a neighbor gave me. He asked me where my freckles came from and I didn't know so he told me, \"Your got your freckles from looking through the screen door after it rained and the rust stuck to your face\". His daughter and I met when we were 4 so I guess I looked through their screen door alot. My name is Kathryn.",
      "MessageIndex": 86,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I used Scotch because my mother was first generation American, and I love Scotch. Her parents and siblings were all born in Scotland and I hope to one day visit. Freckles was a nick name a neighbor gave me. He asked me where my freckles came from and I didn't know so he told me, \"Your got your freckles from looking through the screen door after it rained and the rust stuck to your face\". His daughter and I met when we were 4 so I guess I looked through their screen door alot. My name is Kathryn.",
      "MessageIndex": 136,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I used Scotch because my mother was first generation American, and I love Scotch. Her parents and siblings were all born in Scotland and I hope to one day visit. Freckles was a nick name a neighbor gave me. He asked me where my freckles came from and I didn't know so he told me, \"Your got your freckles from looking through the screen door after it rained and the rust stuck to your face\". His daughter and I met when we were 4 so I guess I looked through their screen door alot. My name is Kathryn.",
      "MessageIndex": 186,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Oops double post.",
      "MessageIndex": 5,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/206775",
      "Title": "Scotch Freckles, thank you, thank you, thank you!!!!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "SemperFi Marine, Just when you think it can't get any worse, only better, the bottom falls out again. To some there is only an obis with no answers. Bells Palsy is related to shingles, as we have been told. My Marine came down with it a couple of months ago, which scared the begebes out of us too. Not a stroke on top of all his other ills, I did't think he could take more. He is working through the Bells Palsy slowly. Meds have worked, plasy is slowly going away. He keeps exercising his face muscles by blowing up his cheeks. My Marine got me through the rough and tough times of bc, but is sure wasn't like your Omaha Beach. Were you given ointment to keep her eye moist until it is able to close by it's self again. We were given a type of goggle for showering to keep water and shampoo out of eye also. As always, we are all here for support to one another, even on bad days. With children to also get through this life test your strength will be tested more than you ever thought. With this I leave you with my heart felt thoughts and prayers.",
      "MessageIndex": 20,
      "PostDate": "05/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202578",
      "Title": "DOES IT EVER STOP????"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I send you all the blessings and prayers from my heart and those of my galic ancestors.",
      "MessageIndex": 73,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I send you all the blessings and prayers from my heart and those of my galic ancestors.",
      "MessageIndex": 120,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Justine it is wonderful to hear you received your ornament so quickely. I figured through snail mail you would have it by Christmas. I just couldn't resist the heart. I have a pewter angel that has been in my wallet since 2002, goes everywhere I go. Keep your heart warm it is full of good thoughts. Merry Christmas. Kathryn",
      "MessageIndex": 4,
      "PostDate": "02/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/206775",
      "Title": "Scotch Freckles, thank you, thank you, thank you!!!!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I send you all the blessings and prayers from my heart and those of my galic ancestors.",
      "MessageIndex": 26,
      "PostDate": "13/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I think I have you beat. I haven't been out to shop yet. There is a Christmas Bazar here over Thanksgiving weekend. Thought I would look there first for something homie and maybe a bit meaningful for my secret receiptent. Have a good and pleasant Thanksgiving. I am just hoping the pumpkin pie I baked yesterday make it to Thursday. One is already gone, I love pumpkin pie.",
      "MessageIndex": 1,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206180",
      "Title": "It's in the mail!!!!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "You missed all the weather action in your old home. Deluge with 70mps gusts. It has been just a ducky season already. And to top it off Stephens Pass got over an 1\" of snow last night. Burrrrrrr. KAH",
      "MessageIndex": 4,
      "PostDate": "27/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/204214",
      "Title": "hey rague! i hear snow is heading your way!!!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "The loss of Heidie so quickely along with my husband a couple of weeks ago has left me empty. I need time to put it all together again. I didn't get to say good-bye or I love you to either. I don't know if I will be back. Scotch Freckles",
      "MessageIndex": 14,
      "PostDate": "01/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/208916",
      "Title": "I have to escape for a while"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Duncan was a Scotish Fold, both ears folder over. He passed away a week ago in my arms. We rescued him from a puppy and kitty mill 14 years ago. He was never sick so we figure he had a heart attack. We also had a big white farrow like Phoneixrsing's kitty. Albert weight in at 19lbs. unfortunately he happened on to an open gate compliments to a realtor showing our house just before we moved the the beach. He never came back and new home owners have never seen him. We still miss Albert. We are down to 2 wire hair fox terriors, yes, terriors.",
      "MessageIndex": 4,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206180",
      "Title": "It's in the mail!!!!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Oops double post.",
      "MessageIndex": 5,
      "PostDate": "24/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206180",
      "Title": "It's in the mail!!!!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I have the same problem. I spoke with my insurance carrier and here was the help desks recommendation. Go ahead see a surgeon. Should surgeon recommend corrective surgery for BC mess and there is considerable problems with DDD (Not Diners, Driving, & Dives either), pain in shoulders, back, etc. and he can medically justify reduction, go for it. I am still considering just the look see appointment. Not sure I can go through the reduction process.",
      "MessageIndex": 5,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203689",
      "Title": "Reduction surgery denied"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Dee, how invasive was your first diagnosis if I may ask? Where you identified as having a potential recurrance? If so, did the doc say anything like [you have a 20% change of recurrance!]? I have been out of care since 07, which really isn't long, but diagnoised in 02. I don't let recurrance control my life but as for probably all, always concerned about it. Would appreciate your input. Scotch Freckles (aka:Kathryn)",
      "MessageIndex": 0,
      "PostDate": "15/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203303",
      "Title": "Dee1962 I have a Question for you"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Feels good doesn't it? Just take care of you new found freedom as if is baby skin though. If your out and about and not wearing any type of head cover be sure to put sun screen on. Nothing worse than a red hot head. Just wash you head as you would wash your face. Not much different. Remember, there is no where for the sweat to go but down, that is the only thing that got to me during the summer and being bald. Enjoy. Kathryn",
      "MessageIndex": 4,
      "PostDate": "30/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/197700",
      "Title": "I am BALD BABY!?!"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Haven't been here long enough. I wish I had found you all a few years ago. Going through all the mental issues alone has been a test of anti-insanity. After reading all the entries, especially those of you who have lost your breasts and still fighting I really feel guilty for having escaped with a lumpectomy, 4 chemos, and 30 rads. I really feel all are reaching out as best as we all can.",
      "MessageIndex": 8,
      "PostDate": "08/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196053",
      "Title": "How long have you been on this board?"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I use Sleepy Time Tea. Camamil(sp) helps a lot, for me. At least you can get it over the counter. You can sweaten it with a bit of Brandy, for those of you who can tip the bottle, that helps too. Waffle's let us know if you should try the Sleepy Time Tea and if it helps. KAH",
      "MessageIndex": 20,
      "PostDate": "13/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196302",
      "Title": "Sleep?"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "Well I finally motivated enough to go out and look for something special for my recipient. Now all I have to do is get it in the mail. It wasn't too difficult once I got out. I found what I was looking for right away in a local art studio here at the beach. And I do hope my recipent likes it too. Scotch Freckles",
      "MessageIndex": 2,
      "PostDate": "27/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/206429",
      "Title": "I sent the ornament."
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I really hate computer problems...",
      "MessageIndex": 8,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202776",
      "Title": "radiation and taste"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I did have changes in taste through out the whole ordeal. To this day I am unable to get past the smell and taste of Angus beef. Even eating out I don't order beef since no one knows whether the beef served is Angus or White Face. I can't stand the smell of fish cooking either. Spinach even is not on my plate though I cook a lot of fresh spinach for hubby. Some tastes and smells get better with time or not. KAH",
      "MessageIndex": 7,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202776",
      "Title": "radiation and taste"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I did have changes in taste through out the whole ordeal. To this day I am unable to get past the smell and taste of Angus beef. Even eating out I don't order beef since no one knows whether the beef served is Angus or White Face. I can't stand the smell of fish cooking either. Spinach even is not on my plate though I cook a lot of fresh spinach for hubby. Some tastes and smells get better with time or not. KAH",
      "MessageIndex": 5,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202776",
      "Title": "radiation and taste"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "I did have changes in taste through out the whole ordeal. To this day I am unable to get past the smell and taste of Angus beef. Even eating out I don't order beef since no one knows whether the beef served is Angus or White Face. I can't stand the smell of fish cooking either. Spinach even is not on my plate though I cook a lot of fresh spinach for hubby. Some tastes and smells get better with time or not. KAH",
      "MessageIndex": 6,
      "PostDate": "07/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/202776",
      "Title": "radiation and taste"
    },
    {
      "AuthorID": "Scotch Freckles",
      "AuthorURL": "https://csn.cancer.org/Scotch Freckles",
      "Content": "There will be slight bruising since this is an anti-coaugulint(sp)and yes it did burn a bit. I am famous for blood clots so don't miss shot. Take care, stay healthy.",
      "MessageIndex": 4,
      "PostDate": "18/07/2010",
      "ThreadURL": "https://csn.cancer.org/node/196751",
      "Title": "Has anyone had the 7 day take home shots \"lovenox\" after surgery for blood clots?"
    }
  ]
}