{
  "AuthorID": "scout5000",
  "AuthorURL": "https://csn.cancer.org/scout5000",
  "Posts": [
    {
      "AuthorID": "scout5000",
      "AuthorURL": "https://csn.cancer.org/scout5000",
      "Content": "Taxol made my face pink and hot for at least a week after each treatment, also not considered an allergic reaction. I never found anything to help but it went away as soon as I finished with chemo. People thought I looked healthier with this \"glow\", ha.",
      "MessageIndex": 4,
      "PostDate": "13/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183897",
      "Title": "ITCHY RED FACE"
    },
    {
      "AuthorID": "scout5000",
      "AuthorURL": "https://csn.cancer.org/scout5000",
      "Content": "I also had 4 rounds of AC and then I made it through 3 rounds of Taxol. The Taxol was different from AC (less nausea) but also challenging. I didn't take Decadron in pill form but they gave me mega steroids in my IV during chemo. They also gave me lots of Benedryl in my IV which knocked me out. I took Lunesta (prescription sleeping pills) every night during chemo so I had no problem sleeping. I had to stop Taxol after 3 rounds due to numb fingers and feet (still have it 16 months later) and hearing loss (regained hearing). You could request Lunesta from your onco or primary care doc. I hope you breeze through your Taxol treatments. Sending positive energy your way. Scout",
      "MessageIndex": 4,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208110",
      "Title": "Finished 4 rds AC Starting 4 rds Taxol Worried about mega dose of Decadron"
    },
    {
      "AuthorID": "scout5000",
      "AuthorURL": "https://csn.cancer.org/scout5000",
      "Content": "I am so sorry that your sister has been diagnosed. It sounds like she has a good support group to help her through. If she has to have chemo (which she will find out after surgery), that will be a toughest time for her, although surgery is awful, too. My husband was here to take care of me but the rest of my family live far away. My sisters and children took turns coming to help throughout chemo, even though they all work. They spread out their visits and stayed for 3-5 days. This helped my husband get some down time and helped me take my mind off the side effects. One of my sisters, who I'm very close to, called and continues to call me every day. If I was too sick, we would just talk for a minute or so, it helped so much to be able to complain to someone other than my husband. My kids also called everyday during surgeries and chemo. It made a huge difference in my recovery. Just try to be brave and stick with her. You sound like you are there for her already.",
      "MessageIndex": 2,
      "PostDate": "17/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184141",
      "Title": "My Sister"
    },
    {
      "AuthorID": "scout5000",
      "AuthorURL": "https://csn.cancer.org/scout5000",
      "Content": "Xanax got me through the days prior to my surgeries. I simply called my primary care doc's office, told them I was having panic attacks thinking about the surgery and requested they call in a presciption for me. I had a single mastectomy with immediate reconstruction almost a year ago. I did have pain at first (the pain meds helped) and continued to have some short (a few seconds) of shooting pain. The lymph node removal was the longest lasting pain. But I do have to tell you that I completely forgot about all of the pain until I read your posting. Our brains have an incredible trick of helping us to forget pain. I wish you well.",
      "MessageIndex": 21,
      "PostDate": "10/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183522",
      "Title": "Mastectomy in 5 Days - Having a Hard Time Coming to Terms/Accepting it Emotionally"
    },
    {
      "AuthorID": "scout5000",
      "AuthorURL": "https://csn.cancer.org/scout5000",
      "Content": "Adriamycin caused me to have migraines. I have had them my whole life but the chemo increased the frequency. Migraines cause severe nausea for me. I take Fiorinal (prescription) for mine and this dramatically cuts the pain and gets rid of nausea. I hope you feel better soon.",
      "MessageIndex": 2,
      "PostDate": "15/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183934",
      "Title": "Stage 4 chemo side effects"
    }
  ]
}