{
  "AuthorID": "sgamtd",
  "AuthorURL": "https://csn.cancer.org/sgamtd",
  "Posts": [
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "crselby I agree, we all want to be safe, and these invasive searches apparently have not led to any discoveries of explosives, at least I would assume it would be plastered all over the news if something was found, and I have not read of any such discoveries. I recently got an e-mail with the usual fwd: \"joke\" we all seem to send to each other for a laught or two. However this one really shows potential to me regarding safety and flying. It's a scanning type booth, built to withstand any kind of explosive, each person quickly enters one of the booths, no profiling, no x-rays, no touching by anyone, it is however able to detect explosives of any kind within that both and will detonate the explosive with harm done only to the person wearing the explosive, there could even be a sign on the both with a warning of what could happen if entering with explosives; Then no one can sue TSA later for blowing up the terrorist. I think this is a brilliant idea, don't know if it could is possible to make such a booth. Hey, we can fly to into space and back, we should be able to make such a booth. An added bonus to people on stand-by for a flight, there is now one seat available on a certain flight. I know it was sent as a \"joke\", and airport security is not a funny subject, but I nevertheless thought I'd share, and hope I did not upset or offend anyone, as this was not my intention.",
      "MessageIndex": 7,
      "PostDate": "20/11/2010",
      "ThreadURL": "https://csn.cancer.org/node/205940",
      "Title": "TSA: \"Let me see the prosthesis.\""
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "I was 68 when I was diagnosed with bc (June of 2009) sgamtd",
      "MessageIndex": 93,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "I was 68 when I was diagnosed with bc (June of 2009) sgamtd",
      "MessageIndex": 43,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "I was 68 when I was diagnosed with bc (June of 2009) sgamtd",
      "MessageIndex": 143,
      "PostDate": "17/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186189",
      "Title": "age when diagnosed?"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "I am taking a chance here repsonding to your post as I know my avatar \"scares\" you, lol, but insomnia hit me tonite again, so here goes. BTW I had my last rad treatment today. YEAH, YEAH First remember all rad teams, docs are diff. in what they allow you to use, and also how many hours before the appointment of the day you can apply lotions. I could apply 3 to 4 hrs before the treament. I was only allowed pure aloe vera, and was told I could apply it as often as needed, of course, being a bit of an overachiever patient myself I asked 2 times 3 times 4 or what ? We settled on 3 times a day. Usually in the am after my shower, then after radiation and before bedtime worked for me. I have a small fan in the bathroom and it worked great to dry my skin thoroughly without touching or rubbing it, and as time goes by you want to touch your radiated skin as little as possible. Now if I was allowed cornstarch and that seems like a good idea as I bet it removes any moisture especially under the breast,I would apply that, then wait a few minutes, brush your teeth, hair whatever to pass the wait, then I would get a dry soft wash cloth and gentle touch the cornstarched area to remove any residue of cornstarch until it feels real smooth. The I would apply the lotion, \"udder\"ly smooth is quite a cool name I think. Sounds soothing. I am not familiar with either of those products, and wouldnt know if you use them both at the same time, I would think not, but someone else can maybe help here who used those 2 brands, I would think one or the other depending on their specific purpose, maybe one is for cooling the area and the other for soothing effect. Good luck to you traci, I got thru 33 treatments without any major skin breakdown as of yet, was told I would be \"cooking\" for another 2 weeks though. Skin feels like leather, not smoothe as of yet, I was told I could use whatever lotions, potions I liked now that I was done with rads, and if it stung, don't use it again, heehee. I am looking for some udderly smooth tomorrow, just besause the name cracks me up and I gotta try it. Best of luck traci, sgamtd",
      "MessageIndex": 1,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179799",
      "Title": "Overachieving Rad Girl -- would appreciate advice from Rad Graduates!"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "That was what cracked me up when I read the word udderly smooth, I thought of cows and udders right away, lol, I have milked a few cows in my time. Now I read it is actually for cows how funny is that ?? ROFL sgamtd",
      "MessageIndex": 12,
      "PostDate": "14/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179799",
      "Title": "Overachieving Rad Girl -- would appreciate advice from Rad Graduates!"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "Hi Tasha, Did you find out anything at wednesday's appointment regarding stopping the tamoxifen last week? Hope you got some good answers and can share them with us. I for one have been sitting on the fence still reading and reading up on the pros and cons of taking any hormome type pill while I am taking an anxiety medication. Have prescription for it, but have not filled it yet. Hope you are doing well irregardless of what doc told you on wednesday. sgamtd",
      "MessageIndex": 0,
      "PostDate": "03/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181124",
      "Title": "TASHA ?"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "Hi Traci- so happy for you, as you may remember mine was named NSF, No Suspicious Findings. You forgot to mention how it went, did you have to tranq. yourself? I remember us both being so apprehensive about that FIRST mammo coming up, hardly able to function thinking about it, of course that is all in the past, and mine really was a breeze, have been able to sleep nights since mammo without any \"helper meds\". BTW today I had my annual physical with my primary doc, and all labs etc were excellent (she said), so if possible I am flying even higher now. Again CONGRATULATIONS TRACI sgamtd",
      "MessageIndex": 15,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189598",
      "Title": "Hands off, girls -- NED is all mine today!"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "Hi Laurissa, I am just the opposite, my tumor was 85% estrogen positive, and being post-menopausal my Onc. recommended I take an ALS, Femara. Hope you will hear from someone that has a low %, and see what her Onc. recommended. sgamtd",
      "MessageIndex": 2,
      "PostDate": "27/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/188961",
      "Title": "No tamoxifen for me"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "Hi Joyyee1 I have had both scans done, and as you mentioned these are very different. I had a bone scan looking for cancer before my surgery last year, and I have yearly dexa scans because I have Osteoporosis (diagnosed early nineties) take meds to help increase bone mass as well as meds to prevent cancer. The Aromasin reduces bone density. Have you been diagnosed with Osteoporosis ? I never had herceptin, wonder if it reduces bone density ? Hopefully someone will answer your question soon, much better than I can, why don't you call and ask the Onc nurse, and let us know what was said. Best wishes sgamtd",
      "MessageIndex": 3,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/206673",
      "Title": "Bone Scan vs Bone Density test"
    },
    {
      "AuthorID": "sgamtd",
      "AuthorURL": "https://csn.cancer.org/sgamtd",
      "Content": "Roseann and Surf Congratualtions on 5 years, I also will hit that milestone soon, I think May or June, forgot the actual date and month, remember surgery date  July 29th, 2009 though.  I also am so very grateful for the support received on this site during that scary time, diagnosis, surgery, rads, I come here ever so often to read, however hardly ever post, as I have no news to add or any special ideas or help to add, my bc was fairly ordinary. Hope and pray we are coming back in 10 years to say Yeah, we made 10. Best wishes to everyone sgamtd",
      "MessageIndex": 11,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://csn.cancer.org/node/266661",
      "Title": "Five years ago today!"
    }
  ]
}