{
  "AuthorID": "sherria49",
  "AuthorURL": "https://csn.cancer.org/sherria49",
  "Posts": [
    {
      "AuthorID": "sherria49",
      "AuthorURL": "https://csn.cancer.org/sherria49",
      "Content": "I am following in your footsteps. I have my 1st appt with onc on Monday!! I will be learning of my 'cocktails' & schedule then. I have never been a 'hat' person either. But, gotta keep the ol noggin warm some how, right?? I'm also not a 'scarf' person either, and I absolutely do not want to wear a wig. Not sure how I'm gonna handle it, but like everything on this journey, we get through it. Good luck & prayers that your 1st tx is easy for you! Hugzzzzzzz",
      "MessageIndex": 3,
      "PostDate": "11/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179555",
      "Title": "Starting Taxol"
    },
    {
      "AuthorID": "sherria49",
      "AuthorURL": "https://csn.cancer.org/sherria49",
      "Content": "Hi Chen! I received a beautiful holiday card today!! WOW! I sure wasn't expecting it! It was so nice of you but, you cheated!! lol It really cheered up my day! Tomorrow is my first chemo, and I'm a bit nervous about it. So this was just what I needed. Thank you, thank you, thank you!!! Sending big warm fuzzy(((((Hugz)))))",
      "MessageIndex": 0,
      "PostDate": "30/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180902",
      "Title": "Chen~You Cheated!!"
    },
    {
      "AuthorID": "sherria49",
      "AuthorURL": "https://csn.cancer.org/sherria49",
      "Content": "Hi Mesa! I have a very similiar dx as you. Although, no lymph node involvement. My onc was explaining the oncotype dx test to me and said it may or may not help in my decision. I told him, \"No need for the test, I'm having chemo!!\" My decision was based on, even a 1% chance of reoccurence was too high for me. I had my port placed at the time of reconstruction, and never even considered NOT having chemo. I have my first chemo (Taxotere/Cytoxan) 4 cycles over 12 weeks tomorrow. I will be starting Tamoxafin after chemo is done. This is a very personal decision for each of us. Please seek the experience of others here, and remember this is YOUR decision. Have you already had surgery?? ((((((Hugz))))))",
      "MessageIndex": 2,
      "PostDate": "30/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180867",
      "Title": "Finding someone with similar dx"
    },
    {
      "AuthorID": "sherria49",
      "AuthorURL": "https://csn.cancer.org/sherria49",
      "Content": "I'm just a few weeks ahead of you, I had bilateral mastectomy w/reconstruction 10/30, sent home 10/31. I had a drain on each side. Everyone's pain tolerance is different. My chest felt like a set of encylcopedias on them. The drains were the pain. My daughter, 19 (not a nurse), became my nurse. Here I am not even 2 weeks after, 1 drain removed, other one coming out tomorrow!! Woo Hoo!! I would suggest, like everyone else here, that you allow someone else to take over the Thanksgiving activities and be the princess. I am not even considering doing Thanksgiving myself. Please, clear with you Dr before traveling. I also agree to find someone to be the middleman for you. Come back and post, read, vent as much as you need or want. The veterans here are the best. My thoughts and prayers are with you. Hugzzzzzzzzzzzzz",
      "MessageIndex": 13,
      "PostDate": "09/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179329",
      "Title": "Rookie could use some advice"
    },
    {
      "AuthorID": "sherria49",
      "AuthorURL": "https://csn.cancer.org/sherria49",
      "Content": "& great idea!!! Mine is April 22",
      "MessageIndex": 53,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "sherria49",
      "AuthorURL": "https://csn.cancer.org/sherria49",
      "Content": "& great idea!!! Mine is April 22",
      "MessageIndex": 2,
      "PostDate": "18/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    }
  ]
}