{
  "AuthorID": "Snookums",
  "AuthorURL": "https://csn.cancer.org/Snookums",
  "Posts": [
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "Have to agree with DeeNY about asking for a masectomy specialist. I would imagine your local cancer society could offer advice on where to go. I went to our small shop here in Baton Rouge and bought a bra that had the special pockets in it and my prothesis \"rode\" much better in that. I also, went to the local cancer society to try different kinds of prothesis types to see what fit and sat better. I love the idea of the cami and want to check that out myself. Good Luck to you and your mom. P.S. Your Mom is lucky to have you helping her thru this!",
      "MessageIndex": 2,
      "PostDate": "21/08/2003",
      "ThreadURL": "https://csn.cancer.org/node/140975",
      "Title": "Prosthesis that works"
    },
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "I am on 12 weekly doses of it and well, on week 6 I started to get the \"hammer\"thing. The next week was a rash/burn looking stuff on my inside thumb/palm and pointer finger. Sore and very purplish red. I now have some blisters forming near my moon areas but hopefully I can make it thru my next 4 treatments without losing my nails.",
      "MessageIndex": 4,
      "PostDate": "13/04/2003",
      "ThreadURL": "https://csn.cancer.org/node/139941",
      "Title": "Taxotere & fingernails"
    },
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "I kept vitamin e oil on my hands and feet- if it helps great if not ask your chemo nurse. Good Luck- C",
      "MessageIndex": 3,
      "PostDate": "11/02/2004",
      "ThreadURL": "https://csn.cancer.org/node/142139",
      "Title": "Chemotherapy itching"
    },
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "Well here I sit in a full pressure sleeve of a lovely peach hand and separate arm section. I did NOTHING to bring on the my welling in my left hand. My left was my cancerous breast and I had 27 nodes removed. (all clear! woohoo!)One day I called my onc about some swelling on the top of my left hand and woosh- I was in OT and working on reducing very minimal swelling. It was good I guess looking back now that I learned about it early. I now know there is no magic; a mosquito bite, or any small activity could have caused it. Honestly, I was not doing any extra lifting (5lbs) or such but it got me. I am not glad I have it but now I am not so afraid of it. It is manageable and I don't have to wear my sleeve all the time. If I want I can remove it for a special occassion or whenever I feel like it. I wear it to exercise and use no weights on that side but I live a normal life with it. So, what is my bottom line- don't worry about how to keep away from it to any extreme. Live your life and be smart about lifting heavy items but know if you do get it you'll be able to handle it and move forward. I pray for God's strength in my life and other than that what else do we need.Hope I helped- Candy",
      "MessageIndex": 5,
      "PostDate": "23/07/2003",
      "ThreadURL": "https://csn.cancer.org/node/140806",
      "Title": "lymphedema concerns"
    },
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "Amen! Happy Birthday and Thanks- Blessings , Candy",
      "MessageIndex": 2,
      "PostDate": "18/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142650",
      "Title": "surviving"
    },
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "Well, mine has been growing back in since August and I had wavy, curly at the ends hair that was blonde. Now, I have CURLY, tight spiral curls and my hair is brownish. I wish I could blame the gray at my temples on chemo but that came from 20 years of teaching and especially the last 10 which were in Junior High! So, I agree that I am happy to have hair and I think I would be safe to Hi-Light it in Jan or Feb which is 6 months after chemo so the gray will go away. I need, as my neighbor said, to get it back to it's original color! HaHA- Happy Holidays to all of you and may God bless you and your families this year and next! Candy",
      "MessageIndex": 4,
      "PostDate": "09/12/2003",
      "ThreadURL": "https://csn.cancer.org/node/141575",
      "Title": "Hair Help..."
    },
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "Excellent news and a big CONGRATULATIONS is in order for you! You never gave up and kept working toward a positive solution- you are an inspiration to us- thank you - C",
      "MessageIndex": 1,
      "PostDate": "21/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142747",
      "Title": "Great News from Maryland"
    },
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "Good Luck with your ultra sound and I will keep you in my prayers. I know Chemo can cause some heart damage but I am not familiar with radiation issues. Let go as much as you can and Let God. He will bring you thru this. P.S. And BEST of all you have a lot of new friends here now. keep us posted- Candy",
      "MessageIndex": 3,
      "PostDate": "15/01/2004",
      "ThreadURL": "https://csn.cancer.org/node/141823",
      "Title": "carotid artery"
    },
    {
      "AuthorID": "Snookums",
      "AuthorURL": "https://csn.cancer.org/Snookums",
      "Content": "I had mine out and it was wonderful! barely any scar and yes- it felt as if construction was beginning instead of destruction of my body. I am still tired and I had Jan surgery and finished chemo in May/June so- I feel your frustration. When I get really tired my eyes really water just like when i was on chemo. SO, I guess I will just hang on til I get back to as normal as normal is post cancer. I do try to remember all the people that would love to only have to worry about being tired and that helps. I agree it's a valid feeling and we do get to \"own\" it but until it gets better I just keep going as I always do- one day at a time. So, good luck on your journey thru cancer and God's Blessings- Candy",
      "MessageIndex": 8,
      "PostDate": "31/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142947",
      "Title": "has any one had their portacatheter taken out"
    }
  ]
}