{
  "AuthorID": "Sunrae",
  "AuthorURL": "https://csn.cancer.org/Sunrae",
  "Posts": [
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "I've had 4 treatments on Cytoxan/Taxotere and my hands started burning, blistering, cracking and look like I've doused them in acid. My onc took me off chemo for a couple of weeks now, put me on prednisone and vit. B. They're getting better but still peeling, red and raw looking. My onc is changing me to Taxol but after what you posted about it I'm not sure I can handle it. Hope your condition clears up.",
      "MessageIndex": 3,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193638",
      "Title": "hands are driving me crazy"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Sorry that you're having to go thru all this when you did everything right at the first occurrence. I think you are one of the bravest survivors I've heard of. With all that's going on you still have heart and soul and you will survive this too. I'm not in the same situation as you, being diagnosed in Sept.09 and have been on hormone theraphy for 4 months to reduce my tumors,then surgery in Feb and radiation, and possbily chemo. I am Stage 2A, Her +, 3 tumors and lymph node involvement. I'm not havin too many side effects from the drug, Femara, just lots of night sweats. There are so many loving supportive people here on this site and I've learned so much for their experiences. Even tho we can't be with you physically, please know that we're here for you and are sending you lots of hugs. Keep posting and stay in touch.",
      "MessageIndex": 10,
      "PostDate": "25/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184457",
      "Title": "Recurrence Very Rare for Initial Cancer 0 Stage DCIS"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Dear Sweet Susan, We were hoping for a different result and are sorry that you have to do battle again. Praying that your treatment plan will be the one that will kick bc's butt once and for all for you. Keep posting whenever you get the time and let us know how its going.",
      "MessageIndex": 33,
      "PostDate": "25/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/225100",
      "Title": "Monday's Biopsy Results"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "tj, another good idea that will send me looking thru another album for that elusive pic. I really have enjoyed all the baby photos. Jeanne, I love your a baby pic, so adorable. Chen, no photo would ever do you justice. I think you're my \"Hero\". I know one thing, you're bigger than life. Wish I had longer legs. Actually I could be a little taller too. LOL",
      "MessageIndex": 12,
      "PostDate": "01/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/180949",
      "Title": "New Challenge for you"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Penny, Wishing and praying the best for you as you go thru 2 more surgeries. You must be one tough gal. Get those expanders out and get your bum fixed so you can get back to celebrating. We'll be there with you and holding your hands. Let us know how it goes. Hugs coming your way.",
      "MessageIndex": 24,
      "PostDate": "23/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186483",
      "Title": "surgery next wednesday"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Masectomy may be your only option to rid yourself of bc, but it doesn't have to end there. As you can see from this board, many women have reconstruction and do fine. I had a single masectomy and decided not to do reconstruction. Been fitted for prosthesis and bras for the masectomy side and am also fine. When I wear the prosthesis it looks so natural and matches the other breast, no one can tell which one is for real, and it feels like I still have my breast. I also have bc and ovarian cancer run in the family, but when I was tested, I found out my bc was not genetic. My mother died from bc but I didn't have the same cancer she had. Hoping for the best for all of you facing this decision.",
      "MessageIndex": 20,
      "PostDate": "14/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203151",
      "Title": "Mastectomy is my only option"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "I was surprised to see that you're celebrating your 3rd cancerversary. But congratulations are in order. What a great loving gesture your husband has made. Enjoy every minute of the play, its wonderful. C'mon, CELEBRATE! (Chen you cracked me up with your sister story.LOL)",
      "MessageIndex": 9,
      "PostDate": "22/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180277",
      "Title": "Surprise Plans for my upcoming cancerversary"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Don't have the answers for you Vicki, but someone will be able to let you know from their experience. All I know is that when you have a lumpectomy you will probably have to have radiation. Sometimes you don't after a masectomy but again there are many ways to conquer the beast. Hope you get your answer soon. Love, Sunrae",
      "MessageIndex": 1,
      "PostDate": "20/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180267",
      "Title": "Triple negative and radiation treatment"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Hi Mama G, Glad to hear this went well for you. You are one inspiring gal and you always bounce back a little higher each time something like this comes along. Keep on keeping on.",
      "MessageIndex": 35,
      "PostDate": "20/10/2010",
      "ThreadURL": "https://csn.cancer.org/node/203542",
      "Title": "Cyberknife was a BREEZE!!"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "I missed the bus too but maybe it's a good thing. I sing off key. My Dad always said I couldn't carry a tune in a bucket. Imagine growing up knowing that I would never be a singer, didn't stop me from trying. Does it count if I can sing joyfully? Keeping you in my thoughts and prayers for a good result and hoping for good news.",
      "MessageIndex": 21,
      "PostDate": "19/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224726",
      "Title": "Requesting the Pink Bus for tomorrow"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "I would also like to join in and wish everyone a happy and healthy new year. May you all be blessed with all your needs this coming year. Best wishes to everyone.",
      "MessageIndex": 7,
      "PostDate": "27/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208462",
      "Title": "\"Every time you hear a bell ring, an angel gets it's wings\""
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Chen, its so good to see your post even tho you're having some terrible side effects. Looks like you still have your great sense of humor what with softball or elephant knees. Just remember frozen peas work for a lot of things, not that you will ever need them again. And you may never eat them again either. I keep them in the freezer just for such emergencies but I don't eat them either. You know how much you're loved and missed here so post when you can but take care of yourself now. Focus on what you need to do to get thru this and come here when you can. Sending you lots of love.",
      "MessageIndex": 11,
      "PostDate": "08/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224064",
      "Title": "Treatment plans, Side Effects, you Kindreds know, the usual!!!"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Ritzy, Just when I was wondering if I ever wanted to get back on the board because of all the latest devasting news about Moopy and Heidi, I came on this morning and read your beautiful comforting words and felt your hug. That hug is going around this board and is pulling us all together with its love. Everyone is so appreciated and there is so much support. Thank you so much for posting your thoughts here and expressing what we all feel. And I'm still messmerized by your tail!",
      "MessageIndex": 94,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Dear sisters, today is not a good day for me. My health has deteroriated since I had the stress test last week, feeling more exhausted, tightness in chest and short of breath. My sinuses are draining, having headaches and a slight cough. My fibro is giving me a fit and my neck and shoulders are hurting so much I didn't sleep well. Probably won't sleep well tonight either. Just feel like there's something wrong and hope they can fix it tomorrow. Not depressed, just wanted to complain to others who understand. Don't want to burden my husband all the time with my grumblings. So I'm loading on you and asking you for your support and prayers that this heart problem can be easily resolved and quickly. Want to be able to reschedule my masectomy asap. Thanks again for being there for me. Sunrae",
      "MessageIndex": 0,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186727",
      "Title": "Feeling Bad but Looking forward to Heart Cath Tomorrow"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Ritzy, Just when I was wondering if I ever wanted to get back on the board because of all the latest devasting news about Moopy and Heidi, I came on this morning and read your beautiful comforting words and felt your hug. That hug is going around this board and is pulling us all together with its love. Everyone is so appreciated and there is so much support. Thank you so much for posting your thoughts here and expressing what we all feel. And I'm still messmerized by your tail!",
      "MessageIndex": 46,
      "PostDate": "16/01/2011",
      "ThreadURL": "https://csn.cancer.org/node/209888",
      "Title": "Do you want to know something sisters in pink?"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "When I came on this site I wanted to use my nickname that I used in highschool which was Mickey. Happened to be too many already, then I went thru several more, also already in use. I wanted Sunny or something like that to reflect my usual positive attitude. Somehow Sunrae popped into my mind and that's my story. My real name is a southern name made popular now by Julia Roberts in \"Steel Magnolia\", (Shelby). I'm enjoying reading all of your stories too.",
      "MessageIndex": 124,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Thanks for letting us know the latest news about beloved Chenheart. She is never far from our hearts  and in our prayers. Our love to her and her family. She is such a brave and courageous, lovely and compasionate woman. She is really a \"Braveheart\".",
      "MessageIndex": 87,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "When I came on this site I wanted to use my nickname that I used in highschool which was Mickey. Happened to be too many already, then I went thru several more, also already in use. I wanted Sunny or something like that to reflect my usual positive attitude. Somehow Sunrae popped into my mind and that's my story. My real name is a southern name made popular now by Julia Roberts in \"Steel Magnolia\", (Shelby). I'm enjoying reading all of your stories too.",
      "MessageIndex": 24,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "When I came on this site I wanted to use my nickname that I used in highschool which was Mickey. Happened to be too many already, then I went thru several more, also already in use. I wanted Sunny or something like that to reflect my usual positive attitude. Somehow Sunrae popped into my mind and that's my story. My real name is a southern name made popular now by Julia Roberts in \"Steel Magnolia\", (Shelby). I'm enjoying reading all of your stories too.",
      "MessageIndex": 74,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Thanks for letting us know the latest news about beloved Chenheart. She is never far from our hearts  and in our prayers. Our love to her and her family. She is such a brave and courageous, lovely and compasionate woman. She is really a \"Braveheart\".",
      "MessageIndex": 40,
      "PostDate": "28/02/2013",
      "ThreadURL": "https://csn.cancer.org/node/254551",
      "Title": "ChenHeart update March 8, February 24 & 28"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "When I came on this site I wanted to use my nickname that I used in highschool which was Mickey. Happened to be too many already, then I went thru several more, also already in use. I wanted Sunny or something like that to reflect my usual positive attitude. Somehow Sunrae popped into my mind and that's my story. My real name is a southern name made popular now by Julia Roberts in \"Steel Magnolia\", (Shelby). I'm enjoying reading all of your stories too.",
      "MessageIndex": 174,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "You made my day Laurissa. Seems like you speeding along this recovery path and you sound so happy. Glad you're feeling so much better and what kind of shoes are you wearing for your dance with NED? I'm going to have to put my fast sneakers on but I'll not be able to catch up with you. You lead the way, we'll be right behind you. Almost time to celebrate!",
      "MessageIndex": 8,
      "PostDate": "05/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/187444",
      "Title": "Glad to meet you, NED"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Happy Birthday, you young thing. Hope you do something special and enjoy your day. Celebrate!",
      "MessageIndex": 8,
      "PostDate": "12/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181843",
      "Title": "45"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "A big thank you to everyone. I just posted about my first chemo tomorrow, which is \"D\" day, for dreading it. I thought I had gave an update recently but I might have chemo brain before treatment even starts. I'm still in the healing stage from the masectomy, and trying to get my arm back in motion. I also have an ugly armpit (like someone else here complained about). Just want to get the chemo over with and on to radiation. Can't wait to join the chemo and rads grads. Love you all and hope you can feel it.",
      "MessageIndex": 10,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191455",
      "Title": "Shout out to SUNRAE! How are you?????"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Really sorry to hear about your sister. She battled the beast for 17 years and now she has peace and can rest. She really was a true warrior and I'm sure she was an inspiration to so many. Our hearts go out to you and her family, may you be comforted at this deeply sad time.",
      "MessageIndex": 2,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208154",
      "Title": "I Lost My Sister Today"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Dear Rrogers, My deepest sympathy for the loss of your father. May God comfort you and your family during this sad time. Its obvious that you are a faithful and strong woman and your burden will get lighter as time goes on. I'm so sorry that your marriage isn't working very well right now and sorry that your husband is causing you more stress and disappointment along with the feeling of betrayal, just when you don't need anymore of any of it. Our thoughts and prayers are with you at this difficult time and may you feel our love enfolding you and holding you close.",
      "MessageIndex": 31,
      "PostDate": "30/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/195452",
      "Title": "Lost my Dad June 21st"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Count me as one of the August babies, 8th day. And Happy BD to everyone already this year.",
      "MessageIndex": 47,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Really sorry to hear about your sister. She battled the beast for 17 years and now she has peace and can rest. She really was a true warrior and I'm sure she was an inspiration to so many. Our hearts go out to you and her family, may you be comforted at this deeply sad time.",
      "MessageIndex": 52,
      "PostDate": "20/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/208154",
      "Title": "I Lost My Sister Today"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Count me as one of the August babies, 8th day. And Happy BD to everyone already this year.",
      "MessageIndex": 98,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "My surgery date is getting close, Feb. 25th. I have been reading all your posts and gathering as much info as I can. I finally decided that I will just have the modified radical masectomy on my right breast with at least 10 lymph nodes removed as recommended by my surgeon and onc. I was told that I could have bilateral and the insurance would pay but I don't have a high rate of reoccurrence. And I've opted to not have reconstruction, mainly because of all the risk of longer surgery time, risk of more infection, longer recovery time. Since I already have a lot of health problems inc. diabetes, asthma, high BP, fibromyalgia, gaucoma, I felt like I would be asking for more problems. The simpler the better is my thinking. Surgery is not stressing me out as I've had at least 3 other surgeries inc. hysterectomy. What is stressing me out is that I have to undergo the heart stress test this coming Thursday because I have a \"nasty EKG\" and the anethesiologist(?) will not clear me. I can't do the treadmill so its the one where you lie on a table and a drug is injected to chemically exercise your heart. Since I have asthma they are using a special drug but I've had this done before and said I'd never do it again. I know its not a big thing but I'm concerned that I can't get thru it, something might show up to keep me from getting my surgery. I just want to get thru this and get it over with. I will need radiation afterwards. Please keep me in your thoughts and prayers. I love you all.",
      "MessageIndex": 0,
      "PostDate": "14/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185944",
      "Title": "Finally Made My Decision Re Surgery"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Margo, hope you continue to do well. Thanks for letting us know how it went. Rest, relax and take good care of yourself.",
      "MessageIndex": 1,
      "PostDate": "28/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/184877",
      "Title": "My first treatment"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Happy 35th and may God grant you and your husband many, many more. Enjoy all you can and have a great time. It's a great milestone these days.",
      "MessageIndex": 3,
      "PostDate": "17/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180063",
      "Title": "Our 35th anniversary"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Hi Donna, So happy to hear your good news. Celebrate, celebrate, celebrate! Enjoy every bit of life. Wishing you much happiness, you deserve it.",
      "MessageIndex": 28,
      "PostDate": "05/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/199976",
      "Title": "And the News Just Gets Better"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "All I want to know is when the pink bus unloads everyone is happy and well and there have been a busload of miracles. I missed the bus, just got out of the hospital myself again, had a heart problem show up. Hope we don't have to keep getting on the pink bus too much and can just keep using the pink dumpster getting rid of all our problems.",
      "MessageIndex": 20,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/223475",
      "Title": "Gas up the bus, girls!"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Jenny, sending you hugs and prayers and wishing you the best outcome. Then we party.",
      "MessageIndex": 6,
      "PostDate": "24/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/186718",
      "Title": "Say a prayer for me please..."
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Christine, I kind of know how you feel. I've known since Sept. that I would have to have a masectomy, but my surgeon wanted to shrink my tumors a little first so I've been on Femara for all these months and now my surgery is scheduled for Feb. I hate to have this surgery but I hate cancer more. The first thing I thought after being dxed was get this breast off asap. When it didn't happen I sort of started feeling like I wanted to save it and got hopeful that I might only need a lumpectomy. No way my surgeon says since my tumors are scattered around and have lymph node involvement. So now I'm mentally and emotionally trying to say goodbye to a part of my body that I love. I know that I'll do what I have to do when the time comes. And so will you tomorrow. I think you'll be stronger than you realize and then you can help the rest of us as we face the same test. I really appreciate Wolfi's comments and she has been a big help for me too. My prayers will be going up for you as you go thru all this. Please know that we're here for you and hope to see you post soon. Much love to you. Sunrae",
      "MessageIndex": 22,
      "PostDate": "11/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183522",
      "Title": "Mastectomy in 5 Days - Having a Hard Time Coming to Terms/Accepting it Emotionally"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Great to hear your good news. Cake, ice cream, and all the trimmings. Best wishes to you and continue to let us know how you're doing.",
      "MessageIndex": 11,
      "PostDate": "14/12/2009",
      "ThreadURL": "https://csn.cancer.org/node/181923",
      "Title": "Last Chemo on Monday"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Traci, I'm so happy for you and just a little jealous. I want to be in your shoes, dancing the night away, doesn't matter if its Ned or Nert. As you dance just whisper the rest of our names to Ned, tell him there's a bunch of other gals just waiting for their turn. And even if you dance for a week he won't get tired so go for it and enjoy. This calls for another celebration too. Congratulations you funny girl! We love you.",
      "MessageIndex": 31,
      "PostDate": "06/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189598",
      "Title": "Hands off, girls -- NED is all mine today!"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Hi Christine, Thanks for letting us know that you're doing well after your surgery. Now we will pray for a complete and speedy recovery for you. Take it easy and eat ice cream. You deserve it all.",
      "MessageIndex": 33,
      "PostDate": "22/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183522",
      "Title": "Mastectomy in 5 Days - Having a Hard Time Coming to Terms/Accepting it Emotionally"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Glad to hear you're doing so well and that the path report came back good. Hope chemo goes as well for you.",
      "MessageIndex": 3,
      "PostDate": "04/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193633",
      "Title": "Drain tubes are out!"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "I have asthma and got an infection while going thru chemo, took prednisone and a prescription cough med, got worse, wound up in ER and found out I had bronchitis. Hoping the drs find out whats going on and take care of it. Keeping you in my prayers and praying for a good result quickly.",
      "MessageIndex": 6,
      "PostDate": "11/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224250",
      "Title": "I think I may be in trouble"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Wanted to welcome you too, Pink. I haven't went thru much yet but these ladies here are the best and will share their experiences and info. Everyone says its \"doable\" and thats what I keep in my mind. Take care of yourself and let your family and friends help out. I'm sure it helps them to know they're helping you and God blesses the giver and the receiver, so let them help you. Your faith and courage will get you thru this, and we're all here for you too. Keep posting and let us know how you're taking that one step at a time, heading toward the finish line. Lots of prayers and hugs from all of us here.",
      "MessageIndex": 13,
      "PostDate": "16/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/188146",
      "Title": "New to discussions and have questions"
    },
    {
      "AuthorID": "Sunrae",
      "AuthorURL": "https://csn.cancer.org/Sunrae",
      "Content": "Myshell is right, most of us here have cancer. You don't hear much from those who are benign. Just a little note tho. I had micro calcifications show up for years but no one suggested that I should have more tests like ultrasounds, etc. My tumors were hidden because of the calcifications and should have been caught a year or two ago. I wish someone had told me to have more tests to clarify my situation. Wishing you good news and glad for those who are benign like Myshell. Please let us know how it goes.",
      "MessageIndex": 9,
      "PostDate": "15/02/2010",
      "ThreadURL": "https://csn.cancer.org/node/185866",
      "Title": "Cluster Calcifications"
    }
  ]
}