{
  "AuthorID": "sunshine0406",
  "AuthorURL": "https://csn.cancer.org/sunshine0406",
  "Posts": [
    {
      "AuthorID": "sunshine0406",
      "AuthorURL": "https://csn.cancer.org/sunshine0406",
      "Content": "I cried over my loss of hair too. I got three wigs from my local hospitals cancer center. So if you check around you may not have to spend a lot of money if any at all. I hope you find one that is just right for you. It made all the difference for me. :)",
      "MessageIndex": 6,
      "PostDate": "21/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/216750",
      "Title": "I'm going wig shopping!"
    },
    {
      "AuthorID": "sunshine0406",
      "AuthorURL": "https://csn.cancer.org/sunshine0406",
      "Content": "I think that people don't know what to say and just want to relate to you in some way. I know that before I had kids I said some dumb things like I would never let my kids do____, or My kids would never act like that! Then I had kids and I see that I was so wrong about what kids do and how I would handle things. I also had a lot of pre-conceived notions about cancer...like I thought if it happened to me I would never do chemo or do rads, etc. But I did those things and more. I think if they have never gone through it they just don't know. I think they are just trying to be kind. I try to put myself in there shoes (pre cancer) and wonder what I might have said not knowing how hard it is to face this trial in my life. Also if they are just being mean you can't let it get to you, it just gets you down at a time when you need positive thoughts. I try to focus on the good people and things in my life and feel bad that they have to put me down to feel good about themselves. Remember you are strong and have people on here and (I am sure) in your life that care about you and can relate to how you are feeling! Have a happy positive day!",
      "MessageIndex": 5,
      "PostDate": "06/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/217943",
      "Title": "comments"
    },
    {
      "AuthorID": "sunshine0406",
      "AuthorURL": "https://csn.cancer.org/sunshine0406",
      "Content": "just a little e-mail my mom sent me that made me smile. hope it makes you smile too: Attitude There once was a woman who woke up one morning, looked in the mirror, And noticed she had only three hairs on her head. 'Well,' she said, 'I think I'll braid my hair today.' So she did and she had a wonderful day. The next day she woke up, looked in the mirror And saw that she had only two hairs on her head. 'H-M-M,' she said, 'I think I'll part my hair down the middle today.' So she did and she had a grand day. The next day she woke up, looked in the mirror and noticed That she had only one hair on her head. 'Well,' she said, 'today I'm going to wear my hair in a pony tail.' So she did, and she had a fun, fun day. The next day she woke up, looked in the mirror and Noticed that there wasn't a single hair on her head. 'YAY!' she exclaimed. 'I don't have to fix my hair today!' Attitude is everything. Be kinder than necessary, For everyone you meet is fighting some kind of battle. Live simply, Love generously, Care deeply, Speak kindly, And pray continually. Life isn't about waiting for the storm to pass... It's about learning to dance in the rain.",
      "MessageIndex": 0,
      "PostDate": "28/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217357",
      "Title": "Attitude (e-mail from my mom)"
    },
    {
      "AuthorID": "sunshine0406",
      "AuthorURL": "https://csn.cancer.org/sunshine0406",
      "Content": "I have heard the problem with antiperspirant is the aluminum that is in it. That is am interesting thought ender I will try the coconut oil, where do you buy it? I love the smell of coconuts and I drink a lot of coconut water.",
      "MessageIndex": 5,
      "PostDate": "08/05/2011",
      "ThreadURL": "https://csn.cancer.org/node/218066",
      "Title": "Deodorant vs. No Deodorant - Relationship to BC?"
    }
  ]
}