{
  "AuthorID": "TawnyS",
  "AuthorURL": "https://csn.cancer.org/TawnyS",
  "Posts": [
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "I agree to shave it. I was so nervous for peeple to see me in a scarf (I never bought a wig). So, the best thing happened. Two weeks after my first round of AC was the Making Strides walk. I thought, what a great time to fit in. If I could go anywhere and be accepted without hair it would be that walk! The night before my husband and daughter shaved it off! I went to the walk the next morning and rocked it out! As time goes on and you need to get that old stubble out use masking tape. I've noticed some posts on other threads where women used a lint roller. Wish I would have known about that one! Good luck on the decision! We are with you! :0)",
      "MessageIndex": 9,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "Thanks for sharing that!",
      "MessageIndex": 15,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190417",
      "Title": "should I go ahead and shave my head"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "Oh shortscakes..I am so sorry to hear of all the sadness that is going on with you. I do hope things start looking up for you and I will be sending good vibes your way and some for your dad! Please talk with your doctor and get something to take the edge off. You have a lot on your plate right now. I'm sure they will be more than happy to prescribe something for you. Big hugs! Tawny",
      "MessageIndex": 7,
      "PostDate": "08/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191789",
      "Title": "back to chemo on Monday 5/10/10"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "Mine is just my name. Kinda boring. :)",
      "MessageIndex": 20,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "Mine is just my name. Kinda boring. :)",
      "MessageIndex": 70,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "I lost 36 lbs on AC. I don't know if that was all due to the AC or the Crohn's, too. I couldn't eat what I needed to eat to get my counts up because the crohn's didn't like it. Anyway, when when I got on the taxol it was like, \"food....where have you been my whole life!\" I think I just didn't eat for so long on the AC that with the taxol I got my appetite back and ate everything. But what is so funny is I couldn't taste a thing. I should have been eating hummus and carrots or something healthy. Instead I ate a Big Mac....couldn't taste it, but I knew it was good! : )",
      "MessageIndex": 2,
      "PostDate": "11/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189961",
      "Title": "Can't stop eating!"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "Mine is just my name. Kinda boring. :)",
      "MessageIndex": 120,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "I was gassy and had bouts of constipation....never diarihhia (spelling? sorry) That supposedly is the main symptom. When I had my PET scan the doctor told me I had to get a colonoscopy right away...before my bilateral. Two days before to be exact....which was not what I really wanted to do....cleanse a few days before a huge surgery! So, they saw that my ulium was \"thickened\". My GI doc kinda wanted me to put that on the front burner after it was indeed found to be crohn's. So sorry GI guy....beat down with breast cancer comes before crohn's! So, now that I am finished with chemo I will pursue to crohn's thing. I was on meds throughout chemo for crohn's. He had (has) me on Lialda and wanted me to take 4 a day....I took 2. Also Endocorte...I think....a steroid...I never took it. I needed to deal with the breast cancer first. I will meet with a new GI guy in June and see what we need to do. I ditched the other guy. How can I possibly put crohn's before breast cancer?!?",
      "MessageIndex": 3,
      "PostDate": "11/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/189961",
      "Title": "Can't stop eating!"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "Mine is just my name. Kinda boring. :)",
      "MessageIndex": 170,
      "PostDate": "02/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193462",
      "Title": "What's in your name?"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "I've been thinking about you so much! I have the ugly armpit, too! Maybe to ps can fix it on monday when I get expanders. Please know that I wish you the very best tomorrow! Just count it down sister! It is so much easier to take this in baby steps and little goals and celebrate them. Before you know it you'll be done and thinking what the heck just happened!?! I am also thinking of all the ladies out there that are having \"something\" done tomorrow and sending good vibes and big prayers and hugs all around! Stay strong survivor sisters! :)",
      "MessageIndex": 12,
      "PostDate": "05/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/191455",
      "Title": "Shout out to SUNRAE! How are you?????"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "I am just so sick and saddened to hear this. This is news that no one wants to hear. I just hate it for you. You are, as so many others posted before, such an amazing woman full of such grace and courage. I know you will fight this beast again and you will come out victorious again! Please know we are all here for you! Big hugs! Tawny",
      "MessageIndex": 23,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "I am just so sick and saddened to hear this. This is news that no one wants to hear. I just hate it for you. You are, as so many others posted before, such an amazing woman full of such grace and courage. I know you will fight this beast again and you will come out victorious again! Please know we are all here for you! Big hugs! Tawny",
      "MessageIndex": 117,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "I am just so sick and saddened to hear this. This is news that no one wants to hear. I just hate it for you. You are, as so many others posted before, such an amazing woman full of such grace and courage. I know you will fight this beast again and you will come out victorious again! Please know we are all here for you! Big hugs! Tawny",
      "MessageIndex": 70,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "Oh my goodness girls! I have expanders right now. I knew about the possibility of nipples, but haven't spoke about them to the ps or even really researched it. I swear, some of this stuff we talk about just seems so torturous....and it is! I always joke with my friends that if the government ever wants a terrorist to talk all they have to do is send them up to the clinic I go to and have them fitted with some drain tubes and stitches and sutures and then have them come back in about 3 weeks and yank them off and out when their not looking! That'll get 'em talkin'! Am I right ladies? That torture would make 'em sing like a canary! That's the way my doctors roll. They just are casually talking to you then reach up there and pull the H E double hockey sticks out of whatever it is they want out and it's done! They don't know it, but I'm on to 'em! :) Luckily our government doesn't torture, so that was all just a joke. Anyway, purse string me a new nipple?!? I'm in! :)",
      "MessageIndex": 10,
      "PostDate": "10/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193982",
      "Title": "Nipple Reconstruction Poll"
    },
    {
      "AuthorID": "TawnyS",
      "AuthorURL": "https://csn.cancer.org/TawnyS",
      "Content": "Very interesting! You are a wealth of information and you are so awesome to share your experiences with us. I have trouble ALL THE TIME with the stupid lymphedema! I had all nodes removed from my right and 16 from my left. My right arm is a mess! I haven't watched the video yet but I will. I am very interested in the outcome. Please keep me posted.",
      "MessageIndex": 2,
      "PostDate": "06/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/193737",
      "Title": "I am taking part in a Lymphedema research study"
    }
  ]
}