{
  "AuthorID": "Texasgirl10",
  "AuthorURL": "https://csn.cancer.org/Texasgirl10",
  "Posts": [
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Today was the first of 30 rad treatments. I was beginning to wonder if I would ever begin - it seems like it has taken forever since my surgery was 6 weeks ago. I've got my aquaphor and tshirts so I'm ready to get this part of the journey going and over with. I'm hoping I don't burn, but I'm pretty white so I won't be surprised if I wind up with a nice burn. I'll keep ya'll posted. I hope everyone is having a good day and feeling good. Hugs, Dawne",
      "MessageIndex": 0,
      "PostDate": "08/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220212",
      "Title": "Finally started rads today"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I will be praying for alive hair follicles. I know this has bothered you for a while now and i wish i could somehow make those follicles wake up. please let us know as soon as you get the results. Hugs, Dawne",
      "MessageIndex": 1,
      "PostDate": "24/05/2012",
      "ThreadURL": "https://csn.cancer.org/node/240715",
      "Title": "Finally saw dermatologist today about the hair thing"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Violet New word : tired",
      "MessageIndex": 24,
      "PostDate": "14/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238042",
      "Title": "Rhyming game"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Dream Next word motion",
      "MessageIndex": 8,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238042",
      "Title": "Rhyming game"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Train Next word Ring",
      "MessageIndex": 5,
      "PostDate": "01/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238042",
      "Title": "Rhyming game"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Brain New word: food",
      "MessageIndex": 34,
      "PostDate": "21/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238042",
      "Title": "Rhyming game"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Im so sorry that you have had to find this site, but you've come to an amazing place. I'm praying for negative biopsy results. How are you feeling today? I remember after my biopsies I was in so much pain. I hope your not and I hope you can relax. Please let us know when you get the results. Hugs and God Bless, Dawne",
      "MessageIndex": 18,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238981",
      "Title": "I am very scared!"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I totally understand your fear about the first chemo. Mine was Dec 9, 2010. I was so scared that I actually ran away from the nurse screaming that the Dr had made a mistake. But once the nurse caught me & calmed me down I was fine. I have a port so everything just went right into the port. My husband always took me & we took a \" chemo \" bag that had a blanket ( they did have blankets there but I wanted my own) snacks, LOTS of bottled water, my nook ( which I never read b/c I couldn't concentrate) and my iPhone :) Please be sure to drink LOTS of water to flush out all of the toxins. The only thing I could drink during my chemo was super super cold bottled water. Biotin toothpaste & mouth wash is a wonderful thing while your going through chemo. Plastic wear helps with the rusted metal taste when your eating. And try to get as much rest as possible. Please stay strong & know that you can do this & we are all here with you cheering you on & helping you fight & win. Congratulations on your upcoming wedding. Hugs & God Bless, Dawne",
      "MessageIndex": 4,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231522",
      "Title": "Scheduled First Chemo Appt. Today"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Awesome news!!! I see my onc on the 23rd for my 3 month check up & I'm very nervous. Have a very Merry Christmas Hugs, Dawne",
      "MessageIndex": 21,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232158",
      "Title": "Six month visit with Med Onc"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Im coming too as soon as I drop my granddaughter off at school. I'll be ready to go at 7:45 am. Hugs, Dawne",
      "MessageIndex": 6,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233588",
      "Title": "Pink Bus Requested for KathiM's Sister-Monday"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I am truly sorry to hear your news. I am glad you are getting a second opinion. Your news is a reminder to all of us to be active in our care and to know our bodies and I am so glad that you listened to yours. Please stay strong. We are all here with you while you battle this ugly beast again. I will keep you in my prayers. Hugs, Dawne",
      "MessageIndex": 66,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I am truly sorry to hear your news. I am glad you are getting a second opinion. Your news is a reminder to all of us to be active in our care and to know our bodies and I am so glad that you listened to yours. Please stay strong. We are all here with you while you battle this ugly beast again. I will keep you in my prayers. Hugs, Dawne",
      "MessageIndex": 16,
      "PostDate": "09/06/2011",
      "ThreadURL": "https://csn.cancer.org/node/220269",
      "Title": "Pink Gloves On - Back in the ring for Round 3!!"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "My onc prescribed lidocaine swish & it worked great. Also as suggested, chew ice chips during the infusion. Dawne",
      "MessageIndex": 7,
      "PostDate": "08/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233655",
      "Title": "Any advice for mouth sores during chemo?"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I have a port right now. For the first couple of days it was sore and very tender. But now, I don't really have any trouble with it. On chemo days or blood draw days, the nurse just gives me an ice pack to put on it to numb it and I really don't feel the stick. Good luck with yours. Dawne",
      "MessageIndex": 17,
      "PostDate": "02/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/211318",
      "Title": "any thoughts on portacaths?"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "What a wonderful birthday present. Happy Birthday",
      "MessageIndex": 6,
      "PostDate": "14/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/207710",
      "Title": "Best Birthday Surprise!!"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Thanks for the update. I am so glad to hear that she's doing better. Hugs, Dawne",
      "MessageIndex": 1,
      "PostDate": "17/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232373",
      "Title": "Update on friend"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I am newly diagnosed with IBC. I read that the 5 year survival rate is 49%. I'm not going to pay attention to that because it just scares me senseless & I plan on living a very long time.",
      "MessageIndex": 8,
      "PostDate": "01/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/206631",
      "Title": "Survivors of IBS"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Hi, thanks for checking on me. I'm doing ok. Waiting to hear from disability & raising my 6 year old granddaughter. That's another story in itself. I've been pretty bummed out because I just knew that when I was told that I was in remission that I would automatically feel like the old Dawne again... But that didn't happen & I'm just not able to go back to work yet. IBC, chemo, surgery, & radiation has messed me up pretty good. I've had to realize that the old Dawne is gone & this is the new me. I wonder if the Charlie horses, body aches, neuralgia, chemo brain, mouth sores ( yep, I still get them bad 6 months after chemo) will ever go away. I'm just exhausted all of the time. And I'm very afraid of a recurrence. I try very hard not to complain & I try hard to act like I feel great so that my family won't worry or think I'm a hypochondriac. Anyway, I hope your doing well & staying strong. Hugs & God Bless, Dawne",
      "MessageIndex": 12,
      "PostDate": "05/10/2011",
      "ThreadURL": "https://csn.cancer.org/node/224950",
      "Title": "How is TexasGirl? Anyone knows?"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I'm doing ok. Radiation was very hard on me, but my burns have pretty much healed now. I had a PET scan this morning & will find out next Monday if I'm cancer free. I soooo long to hear those precious words \"NED\". I check the boards often, but I just haven't had the energy to post. I hope your doing well. I promise I'll start posting again :) Hugs & God Bless, Dawne",
      "MessageIndex": 2,
      "PostDate": "22/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/224950",
      "Title": "How is TexasGirl? Anyone knows?"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Who I love",
      "MessageIndex": 18,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232199",
      "Title": "NEW YEars 3 word game (love other one-can we start new one)????"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I'm on board the pink bus too with lots of prayers for a safe surgery & speedy recovery, lots of hugs & positive thoughts. Hugs & God Bless, Dawne",
      "MessageIndex": 18,
      "PostDate": "01/11/2011",
      "ThreadURL": "https://csn.cancer.org/node/229504",
      "Title": "The Pink Bus Is Rolling For Sue Relays - Let's Show Our Support"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "All of those",
      "MessageIndex": 15,
      "PostDate": "16/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232199",
      "Title": "NEW YEars 3 word game (love other one-can we start new one)????"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I am so sorry to hear about Bodhi. Our pets become part of our family and it's so hard when they become ill. I know this doesn't make you feel better, but I am sending you a big hug right now. Hugs, Dawne",
      "MessageIndex": 1,
      "PostDate": "14/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214129",
      "Title": "my dog has cancer"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I'm sorry to hear about your MIL passing and that you have to go through this again so soon. I will keep you and your family in my prayers. Hugs and God Bless, Dawne",
      "MessageIndex": 10,
      "PostDate": "05/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/238274",
      "Title": "MIL Passed Away"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Pink has always been my favorite color. John Deere green is a second favorite. Hugs, Dawne",
      "MessageIndex": 38,
      "PostDate": "02/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231219",
      "Title": "I thought it would be great to see what your favorite color is, so, what is your favorite color?"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Robert, first let me give you a big ole cyber high 5 for good results.. Yaaaaayyyy. You are such a fun person with a great attitude and I bet your wife never has a dull moment with you & I think that's awesome. Good luck with the walk. I really like the way your designing it. You should post a picture when it's done so we can see it. Hugs and God Bless, Dawne PS: how's Lucas and Mommy doing?",
      "MessageIndex": 14,
      "PostDate": "20/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/239014",
      "Title": "More \"Positive News\" - Monthly onc visit & Zometa Infusetion"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Hi Katie, I just wanted to say hi and welcome to the board. I'm sorry but I don't have any words of wisdom regarding your upcoming surgery as I have inflammatory breast cancer and had a bilateral mastectomy and reconstruction was not an option. But I will be praying for a successful surgery for you. Hugs & God Bless, Dawne",
      "MessageIndex": 4,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://csn.cancer.org/node/239345",
      "Title": "Need to make a decision on recconstruction"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "YOU GO GIRL!!!! I am so very proud of you, you did it!!!!! What an awesome day filled with celebrations for you and you got flowers too :) Hugs, Dawne",
      "MessageIndex": 1,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214794",
      "Title": "I am a rad grad! Yipee!!"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Hi everyone, it has been way too long since I've posted. I want to give Janice a Huge thank you for keeping y'all updated and a big thank you to all of you for your prayers, hugs, and positive energy. I have missed you all bunches.  I am so sad to learn of the sisters that we have lost and the new pink sisters that have had to join our pink sisterhood. My heart is very heavy to know that some of you have had recurrences and someone very dear to my heart has been placed on hospice. I pray for all of you daily.  As you all know, I have had a rough time. This tumor just keeps growing but the good news is that it hasn't spread to any other part of my body. It seems as though no chemo is strong enough to kill this Triple negative IBC! I'm now on gemzar and let me tell you that is one horrible chemo drug. It makes me sick for days, but if it kills the beast then it will be worth it. I have 4 more treatments then I'll have another PET scan. I will try not to wait so long to post again. Im sending all of you big hugs.  Dawne",
      "MessageIndex": 0,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://csn.cancer.org/node/261329",
      "Title": "Hi, it's me Texasgirl10"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "I'm so glad that your surgery went well and that you are doing good. Get lots of rest and take good care of yourself. Please know that I am still praying for you and that speedy recovery with NO pain :) Keep us posted on how your doing. Hugs and God Bless, Dawne",
      "MessageIndex": 7,
      "PostDate": "25/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214825",
      "Title": "Thank you for Prayers from Ticky"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "Well it's here, the day I've been dreading.. my first treatment day. I can no longer deny it, I am a cancer patient. I'm scared and I'm sad. I want to run away as far as I can, but I know this crap will only go with me. I want to go back to my normal life, but I guess this will be my \"normal\" life now. I know ya'll understand and even know how I'm feeling and what I'm going through unfortunately. I'm so glad that I found this board with all of you. I'm taking ya'lls advice and I'm already drinking my water this morning, which by the way is no easy task for me. I will let you know how it goes this evening. Dawne",
      "MessageIndex": 0,
      "PostDate": "07/12/2010",
      "ThreadURL": "https://csn.cancer.org/node/207085",
      "Title": "First Chemo today"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "It looks like you've already received great advice, but I would like to add that if you have a port either request an ice pack for your port site for about 10 minutes prior to the stick or about 45 minutes prior to the stick put some preparation H on a gauze pad & place it on the port site. This really does help minimize the pain of the stick. I am so sorry that you have to go through this. You can do this & when you feel like you just can't, come to the board to get refueled. Get plenty of rest and know that we are all with you. Hugs & God Bless, Dawne",
      "MessageIndex": 9,
      "PostDate": "07/01/2012",
      "ThreadURL": "https://csn.cancer.org/node/233561",
      "Title": "Here's the plan---What advice or experiences can you share?"
    },
    {
      "AuthorID": "Texasgirl10",
      "AuthorURL": "https://csn.cancer.org/Texasgirl10",
      "Content": "This sounds awesome and I can't wait to try it. Thanks for posting the recipe. Hugs, Dawne",
      "MessageIndex": 14,
      "PostDate": "30/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217347",
      "Title": "off topic...The Most Dangerous Chocolate Cake in the World"
    }
  ]
}