{
  "AuthorID": "tgf",
  "AuthorURL": "https://csn.cancer.org/tgf",
  "Posts": [
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Within a few days of my first taxol infusion ... my back broke out in hives and they itched like crazy. Then a few days later the tops of my hands got all red and itched and burned. I wanted to just scratch the skin off the tops of my hands. My oncologist sent me to a dermatologist and she gave me stuff for all the skin problems (by then my hair was gone and I had little red itchy bumps on my head too) ... so ... anyway ... she fixed me up with a bunch of tubes of different stuff ... and it wasn't long before the itching and burning and redness went away. Thank goodness! hugs. teena",
      "MessageIndex": 5,
      "PostDate": "14/01/2010",
      "ThreadURL": "https://csn.cancer.org/node/183897",
      "Title": "ITCHY RED FACE"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Moopy ... this is a weekend where you need to hold off on the retail therapy etc ... and just totally take it easy. As Stef said ... just read, watch TV etc. and let Joe wait on you. We can tell that he will do anything in the world for you ... so ... this is a weekend to let him do just that. Rest Moopy ... and take care of yourself. big hugs. teena",
      "MessageIndex": 2,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I was never a hat person either ... but after the hair started coming out and I had a friend shave me head I learned to LOVE my little denim bucket hat from tlc catalog. It was perfect. It was \"deep\" enough that it covered my whole head and I wore it low enough on my forhead that when my eyebrows and eyelashes came out ... no one really noticed. I also had a very soft cotton night cap thing I wore when I went to bed. I couldn't believe how cold the pillowcase felt if forgot to put my nightcap on ... :-) hugs. teena",
      "MessageIndex": 6,
      "PostDate": "12/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179555",
      "Title": "Starting Taxol"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Moopy ... this is a weekend where you need to hold off on the retail therapy etc ... and just totally take it easy. As Stef said ... just read, watch TV etc. and let Joe wait on you. We can tell that he will do anything in the world for you ... so ... this is a weekend to let him do just that. Rest Moopy ... and take care of yourself. big hugs. teena",
      "MessageIndex": 46,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173280",
      "Title": "Postponed again - oh well..."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Funny you should mention an I-Pod. My son sent me one for Mother's Day ... and I don't have a clue what to do with the thing. I guess he got tired of me telling him I was going to chemo and \"putting on my earphones and playing my relaxation CD.\" He ought to be thankful I wasn't draggig in an 8-track player ... or a 45-record player. Anyway ... my only solution was to bring the I-Pod into work and have one of the college students help me. We're still in the \"training stage\" so I can honestly say I still don't know what I'm doing ... but hopefully I'll figure it out and be able to use it Friday at chemo. Of course I'm not so sure I'll be able to stand those little ear-plug thingies. And ... as far as all the computer stuff ... even though I work full time ... and use a computer ALL day ... I still don't have a clue about all the terminology and how to do some of that fancy stuff. Yesterday I asked my \"I-Pod trainer\" if she could show me how to put pictures into my messages on this site ... and it took her about 1 minute to figure it out ... but about an hour to show me how to do it. I am 65 and as far as all this new-fangled electronic stuff ... I am a doofus! Heck ... I can remember days before microwave ovens ... and color TV. Anyway ... I do understand your frustration Claudia ... hugs. teena",
      "MessageIndex": 4,
      "PostDate": "12/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168442",
      "Title": "Posting Pix and Tutorials, etc etc"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Susan ... I'm also sending positive thoughts your way. And ... as soon as you are up to it ... let us know how things are going. Take care. hugs. teena",
      "MessageIndex": 8,
      "PostDate": "21/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178043",
      "Title": "Tomorrow's the \"Day\" (10--21-09)"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "You don't say how old the kids are ... so if they are teenagers ... then they just might not be mature enough to know how to behave. If they are older than teenagers ... then maybe you do need to talk to them. Maybe ask them to come visit so you can catch up on things ... in their lives ... and YOUR'S. Often we think that people just automatically know how to act ...but that isn't the case. Most people are not mind-readers and instead they need to be told. Just let them know you miss them ... and miss hearing from them ... and that they shouldn't be \"afraid\" to visit you (cancer is not contagious). If that's all too much and you don't want them to visit ... maybe you could just write them a letter and tell them how much you miss them. Good luck. hugs. teena",
      "MessageIndex": 5,
      "PostDate": "25/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170588",
      "Title": "Pity Party"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "After my lumpectomy my surgeon told me I would just need radiation. When I went to the oncologist he looked at all the pathology reports etc ... and told me I needed chemo. So I ended up with taxol for 12 weeks ... and herceptin for a year because I was HER2+. I also wondered why they had such different opinions ... but then just came to terms that my surgeon is a SURGEON ... and his job was to get the bad stuff out. The ONCOLOGIST is more of a scientist/chemist ... and his speciality is looking at each case individually and determining the best treatment for each person. I trust my surgeon ... and oncologist because they are both experts ... just in different fields of medicine. And ... if you end up needing radiation ... that's another SPECIALIST who knows his job ... and that's radiation. Yes ... it's all very specialized ... and thank goodness for all of them. Back when my mother had cancer there was her \"family doctor\" ... and a surgeon. Times have changed ... thank goodness. hugs. teena",
      "MessageIndex": 9,
      "PostDate": "15/07/2011",
      "ThreadURL": "https://csn.cancer.org/node/222439",
      "Title": "My Chemo Drugs??"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "During chemo (taxol/herceptin) my eyes started itching and watering like crazy ... and that continued for a month or so after I finished chemo. Stupid me ... finally looked at my eyes in one of those magnifying mirrors and realized what was going on. My eyelashes were coming out. I hadn't been wearing makeup ... so I didn't have a clue. I just carried kleenex around with me ... and used eyedrops for the itching. As far as the nose thing goes ... my nose didn't run ... but the chemo must have screwed up the membranes in my nose or something because my nose would stop up ... but when I'd blow it ... it would be bloody globs. I've heard of others who have had bloody noses during chemo. I don't consider what I had to be a bloody nose ... but whenever I blew my nose there was blood. Sorry to be so graphic. But ... it is amazing what chemo does. Oh ... and the fingernails and toenails ... YUK! That didn't start until chemo was almost over then my nails started looking real funky ... like I'd smashed them and they were bruised under the nail. They were lovely! I ended up losing several toenails ... and my thumbnails got pretty but I didn't lose them. I finished chemo the end of May and my nails are just now trying to get back to \"normal.\" Never a dull moment with cancer treatments. It's just one big \"adventure.\" hugs. teena",
      "MessageIndex": 3,
      "PostDate": "10/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/179511",
      "Title": "Chemo Chicks"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "As Taleena said ... fill the rest of us in ... what did y'all talk about? teena",
      "MessageIndex": 3,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172708",
      "Title": "It Was A Great Conference Call Today! :)"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Going for my flu shot in about an hour. My oncologist recommends the \"regular\" flu shot and when the swine flu one comes out he wants me to get that too. So ... I will. He's such a cutie ... I'd do almost anything he told me to do .... :-) hugs. teena",
      "MessageIndex": 12,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175843",
      "Title": "Got my Flu Shot today, did you get yours?"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Your note from Greta was the first I heard of the conference call \"invitation.\" I've read posts asking for input and questions to be brought up in the calls ... and I wondered who was involved or who got the \"invitations.\" thanks for the info. hugs. teena",
      "MessageIndex": 16,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171715",
      "Title": "Conference Call Questions - Do you have some ready?"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Sorry to hear that you have to go through all the tests etc. again. I'll be thinking of you and hope the news is good news. hugs. teena",
      "MessageIndex": 6,
      "PostDate": "25/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176273",
      "Title": "Definitely NOT Dancing With Ned"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "How tasteless ... I love it!!! hugs. teena",
      "MessageIndex": 2,
      "PostDate": "07/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168292",
      "Title": "Great Joke......Had to Share"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Maybe this isn't possible ... or maybe it isn't a big deal to anyone ... but I would LOVE it if the word \"new\" could be in RED (or something other than black or blue) so it would really stand out when searching through the threads for posts. They would stand out so much more. Just a suggestion ...and it may not even be possible. hugs. teena",
      "MessageIndex": 4,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171715",
      "Title": "Conference Call Questions - Do you have some ready?"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I just can't quite part with my port yet. It's never given me problems and I guess it's turned into some sort of \"security blanket.\" I've been trying to tell myself that after my next dianostic mammo ... assuming it comes out OK ... then I'll start making plans to be deported. But ... good for you ... and I'm sure the port site will start feeling better soon. hugs. teena",
      "MessageIndex": 2,
      "PostDate": "25/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212900",
      "Title": "I have been deported!"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Hang in there Linda ... I'm sure your counselor will be able to help you through this. Just know that you are not alone. Many (most?) of us out here have either lost our hair in the past or are currently bald ... like me. I know what you mean about looking in the mirror and seeing cancer ... but I've trained myself to look at it with humor. Every time I look in the mirror now ... I don't see cancer ... I see my bald grandfather and that makes me laugh. I finished taxol and herceptin the end of May and my hair seems to be coming back very, very, slowly ... and not all over my head. It is also coming back thin ... but I don't really care. I'm just thankful to be here. Many people don't make it far enough to lose their hair ... but I'm grateful I was diagnosed and treated ... and I'm HERE! I guess I sort of look at my bald head as a badge of courage and a bit of proof that I'm a lot stronger than I thought I was. You are also a lot stronger than you think .... hugs. teena",
      "MessageIndex": 1,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172107",
      "Title": "Hair loss is getting me down"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Things will get better ... it just takes some of us longer than others. And we all have to travel the \"journey\" at our own speed. Just try not to look too far down the road and just take it one little step at a time. It isn't easy ... but you can do it. We're all here for you ... 24/7. You'd be amazed at how many night-owls are out here posting at the strangest hours ... and we're not all in the United States ... so we've got a lot of time-zones covered too. Hang in there ... just try your best not to look too far ahead as far as treatment goes or it will seem overwhelming. Baby steps will work just fine. hugs. teena P.S. Like Mimi ... I am also posting from work ... and I'm sitting here with my little denim hat covering my bald head. See ... we're all hanging in here ... and you can too!",
      "MessageIndex": 4,
      "PostDate": "20/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/172107",
      "Title": "Hair loss is getting me down"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "with hopes of ... hugs, teena",
      "MessageIndex": 1,
      "PostDate": "14/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/232199",
      "Title": "NEW YEars 3 word game (love other one-can we start new one)????"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I don't want this to sound like an advertisement ... but ... since my lumpectomy my bra strap on one side was always sliding down and I'd have to do the reach inside my top to keep pulling it up. A friend I know said she used tape to keep her straps up ... but then another friend showed me what she uses. It's the greatest invention ever and I wish I'd thought of it! http://www.sears.com/shc/s/p_10153_12605_SPM5864652501P?sid=IDx20101019x00001a&ci_src=14110944&ci_sku=SPM5864652501 I just googled \"bra strap holder\" and several kinds came up. I didn't order the one above ... because mine is clear/white ... but at least you get the idea. This is great for us lop-sided girls. hugs. teena",
      "MessageIndex": 0,
      "PostDate": "08/12/2011",
      "ThreadURL": "https://csn.cancer.org/node/231875",
      "Title": "OT bra strap slippage :-)"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I too was diagnosed HER2+ ... had lumpectomy, chemo (taxol and herceptin) then 7 weeks of radiation ... now tamoxifen. Doing great. As others have said ... herceptin is a \"miracle drug\" ... hugs. teena",
      "MessageIndex": 8,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/223449",
      "Title": "her2neu breast cancer positive"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "sorry",
      "MessageIndex": 9,
      "PostDate": "01/08/2011",
      "ThreadURL": "https://csn.cancer.org/node/223449",
      "Title": "her2neu breast cancer positive"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Hi everyone. I just got home from my LAST radiation treatment and logged into this terrific site to tell you ... my family ... how it went ... when I saw the \"Congratulations\" thread. I can't tell you how great that makes me feel. You are all sooooo wonderful!!!! Thank you. And ... I do have to tell you how my last day went. (and I apologize because I will probably ramble on and on and on .. ) Anyway ... my radiation center always has jars and dishes of candy around ... so I took several bags of candy for all of those wonderful people who have treated me for 6 weeks as though I was their only patient. It put a smile on their faces. Then after my treatment and after I sat up on the table the nurse asked me if I was familiar with the Mardi Gras custom ... when people yell at women to \"show me your t_ts\" and then throw the girls Mardi Gras beads. I told her I was familiar with the custom because I lived outside of New Orleans for 15 years and miss it and Mardi Gras ... very much. The nurse then put 3 strings of Mardi Gras bead around my neck. They'd been looking at my t_ts for 6 weeks ... so I guess I really earned those beads! I almost cried. My last treatment ... and Mardi Gras beads as a \"graduation present.\" Perfect! So ... with my lovely hospital gown on ... and my beautiful Mardi Gras beads I walked down the hall with the nurse and \"rang the bell.\" Don't know if this is a custom a other centers ... but everyone gets to ring the bell after their final treatment. I knew the \"bell\" was going indicate I had graduated ... but I almost cried when I got the Mardi Gras beads. Well ... I just had to share that with all of you ... and now I think I'll go put some more aloe on my boobs and hope they start healing up soon. As far as steaks and boobs go ... I am well done! Thanks again for remembering me on my big day! There's several others right behind me ... all ready to graduate ... and my congratulations go out to all of them! big hugs, teena",
      "MessageIndex": 0,
      "PostDate": "07/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173315",
      "Title": "Thank you from Teena ... last day of RADS!"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I agree with \"MyTurnNow\" when she said DAMN IT! It just isn't fair. None of it is. I'm sure you know we are all here for you and when you want to talk ... vent .. whatever ... we're here with our cyber hugs for you and your wonderful Reggie. love, Teena",
      "MessageIndex": 18,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "In my case ... I'm the one who sort of shut my sister out. She calls and wants very much to be here for me and help me out ... but honestly ... my sister is so \"high maintenance\" and needy ... that I just don't have the energy for her. My sister's emotions can go from giggling to crying like a baby in 2 seconds. (I honestly wonder if she's bi-polar ... but I really think it's all the medication she's on for umpteen things she's self-diagnosed herself with). Anyway ... I don't have the energy to handle HER issues ... so I've chosen to keep my distance. When she comes to town to visit ... she stays with her daughter ... instead of me. I don't need the stress. On the other hand I have a very dear friend I've known since we were in kindergarten (we're now 65) ... and we are actually more like sisters than friends. We've been through a lot and we can be totally honest with each other. She can tell me to \"straighten up\" and I can tell her to \"shut up.\" We care about each other and can be totally honest with each other ... without being concerned about hurting each other's feelings. It's a wonderful relationship and I am blessed. So ... it doesn't always have to be \"family\" ... as long as there's someone out there for us ... we are are very lucky. There's also 6 of us \"girls\" who graduated from high school together ... and we've started getting together for breakfasts and dinners ... and we are a great support group as we all go through our various trials and tribulations along the way. Then ... there's always this wonderful group on the discussion board ... love you all ... hugs. teena",
      "MessageIndex": 30,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168677",
      "Title": "I am so dissapointed in my family"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Sounds like Moopy and Joe are off to a great weekend. It also sounds like they have a ton of energy ... so if they want to head up to beautiful/sunny Indiana I have some yard work that needs to be done ... not to mention this house. YIKES! This house is a disaster. Thank goodness I live alone ... because my housecleaning seems to have taken a back-seat to taking naps. Have a great day everyone. hugs. teena",
      "MessageIndex": 2,
      "PostDate": "25/04/2009",
      "ThreadURL": "https://csn.cancer.org/node/167771",
      "Title": "Moopy and Aortus are ALIVE!"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I love pictures of everyong as children. I'm going to try to remember to go through some of my old stuff this weekend and see what I can find (and for those of you who know how old I am ... 65 ... YES ... they did have cameras back then!) hugs. teena",
      "MessageIndex": 37,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I agree with \"MyTurnNow\" when she said DAMN IT! It just isn't fair. None of it is. I'm sure you know we are all here for you and when you want to talk ... vent .. whatever ... we're here with our cyber hugs for you and your wonderful Reggie. love, Teena",
      "MessageIndex": 65,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I agree with \"MyTurnNow\" when she said DAMN IT! It just isn't fair. None of it is. I'm sure you know we are all here for you and when you want to talk ... vent .. whatever ... we're here with our cyber hugs for you and your wonderful Reggie. love, Teena",
      "MessageIndex": 112,
      "PostDate": "11/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194086",
      "Title": "Just when I thought it was safe to go back in the water, I was bitten by Jaws! So to speak..."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I was diagnosed with stage one ... had a lumpectomy and thought all I'd need after that was radiation ... but it turned out that I DID need chemo. I couldn't believe what the oncologist was telling me because I am the biggest chicken on the planet when it comes to needles. I told him I just didn't think I could \"do\" it ... but he stressed that it was what I needed and that I COULD do it. He talked about having a port installed making it much easier for the infusions. For the next few days I tried to process what he had told me ... and accept the fact that I DID need chemo ... and I started talking to people about the port ... and the more I talked and listened ... I realized I COULD do it. And I DID do it! The port is the greatest invention EVER!!! Whatever you need to do ... DO IT! You'll be amazed at how much inner strength you have. hugs. teena",
      "MessageIndex": 1,
      "PostDate": "30/09/2010",
      "ThreadURL": "https://csn.cancer.org/node/202256",
      "Title": "BC"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I love pictures of everyong as children. I'm going to try to remember to go through some of my old stuff this weekend and see what I can find (and for those of you who know how old I am ... 65 ... YES ... they did have cameras back then!) hugs. teena",
      "MessageIndex": 88,
      "PostDate": "19/11/2009",
      "ThreadURL": "https://csn.cancer.org/node/180140",
      "Title": "When is Your Birthday?"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I had short hair and while watching TV on day 15 I ran my fingers through my hair and ended up with a fist full of hair. I called a friend and told her to get her clippers/razor out that I was on my way over and she was going to shave my head. Before I started chemo I'd ordered and adorable denim bucket hat from TLC catalog ... so I took that with me to my friend's house. I felt like I was \"in charge\" of the situation so it wasn't at all traumatic (until I looked in the mirror and I swear I looked exactly like my grandfather ... LOL. But ... I put my ear rings back on ... and put my hat on my head ... and then I looked more like \"me.\" So ... we went out to dinner ... with my new bald head. I actually found the whole experience quite \"freeing.\" I took control. And the whole time I was bald it was also \"freeing\" not to have to fuss doing my hair. I didn't bother with a wig ... and was never able to tie those scarves to look at pretty as they do in the picture. It was just me ... and my denim hat. Very low maintenance. You'll do fine. hugs. teena",
      "MessageIndex": 12,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/213733",
      "Title": "need advice on hair loss preparation"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I completed 12 weeks of taxol/herceptin ... and am now having herceptin every 3 weeks until the end of March. The only side-effect I've heard of from herceptin is that they have to keep an eye out for any heart problems. Other than that ... nothing as far as I know ... at least I haven't had any side-effects. hugs. teena",
      "MessageIndex": 10,
      "PostDate": "21/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175994",
      "Title": "Herceptin anyone?"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Hi ... I just read your post about food for the homeless and thought I'd add a bit ... I work at a Food Pantry every Wednesday afternoon and we distribute groceries to those who need it. We always have canned goods (green beans, corn etc) and protein such as hamburger etc. ... as well as enough other groceries that they all end up leaving with a full grocery bag. We noticed several people bypassing the canned goods and the protein. Eventually we realized they either ... didn't have can openers or didn't have kitchens and were unable to cook anything. We now have a section in our storage area where we keep can openers, plastic eating utensils ... and pop-top cans of food. It's amazing how many people coming to the Food Pantry did not tell us they were homeless ... but now we know what to look for and if they pass by the canned goods or items needing to be cooked ... we just descretely ask them if they need pop-top cans. It's amazing what a can of vienna sausages, or spam ... will do. And there's so many other items with pop-top cans that actually make a meal ... Spaghetti-Os, canned soups that don't need to be deluted etc. And ... crackers ... and peanut butter etc are all great. Just thought I'd share my experiences ... hugs to everyone... teena",
      "MessageIndex": 0,
      "PostDate": "14/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/177561",
      "Title": "Mimi and Chen ... and food"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I don't know what to say except that I do know how much Hans has been there for you ... and how you've always been there for him. It's been a rough few years for both of you and maybe the relationship has just run its course. I'm so sorry ... but I do know that you understand cancer more than many of us and you have learned how much we need to treasure each day ... with no regrets. You will do the right thing ... and as we all know ... nothing lasts forever ... no matter how hard we try. Take care ... and as you and I always say ... it is what it is. big hugs. Teena",
      "MessageIndex": 4,
      "PostDate": "15/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214141",
      "Title": "Off topic....may be my last dutch treat....sigh...."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "The flaming flamingoes are flapping their feathers doing their happy dance ... just for you! hugs. teena",
      "MessageIndex": 19,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173547",
      "Title": "Dancing with NED"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Thanks for the update RE. I've been wondering how the little cutie was doing and I'm so glad she's home and doing well. hugs. teena",
      "MessageIndex": 2,
      "PostDate": "30/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170867",
      "Title": "RE"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Tasha ... I just read your latest post on the \"WOW\" thread and I am so glad the blob will be moving out. It will be such a relief for you ... and your son ... to be able to enjoy each others company and not worry about upsetting \"old-what's-his-name.\" As others have said ... when one door closes another opens ... so now you are free to enjoy all of the open doors that come your way ... and you don't need to be afraid to walk in the front door after work ... to hear \"him\" complaining about everything. I am amazed that you put up with him for so long ... but I do understand not wanting to be alone. But ... just know that it's better to be alone than to be in an abusive relationship ... and that's what you have been living in. You deserve so much better. I know I speak for all of us ... that we will be here with all the support we can give you ... because we know you are a strong woman ... and you CAN do this ... and things WILL be better ... without \"him.\" Enjoy your new peace and quiet at home. hugs. teena",
      "MessageIndex": 0,
      "PostDate": "10/07/2009",
      "ThreadURL": "https://csn.cancer.org/node/171501",
      "Title": "Way to go Tasha!"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Everything's crossed ... and thinking good thoughts. hugs. teena",
      "MessageIndex": 74,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Hi Mike ... I agree with Jadie that perhaps you should have a diagnosis before you start focusing on treatments (surgeons). You seem to have diagnosed yourself and that is not a good idea. Doctors are a LOT more knowledgeable. You may have symptoms of \"something\" ... but it will take a doctor to determine what that is. Your symptoms could be many things ... and may NOT be cancer ... so you really should see a doctor and let him/her make the diagnosis and help determine the treatment.",
      "MessageIndex": 4,
      "PostDate": "24/06/2009",
      "ThreadURL": "https://csn.cancer.org/node/170507",
      "Title": "outside the VA - where do I go from here?"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Everything's crossed ... and thinking good thoughts. hugs. teena",
      "MessageIndex": 23,
      "PostDate": "14/02/2011",
      "ThreadURL": "https://csn.cancer.org/node/212150",
      "Title": "Please just say a little prayer...."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I agree with what others have said. You should really talk to you doctor and I'm sure he/she will be able to prescribe something for your depression/anxiety. As for the breathing ... have you ever taken a yoga class? I did years ago and to this day I pull from things I learned in those sessions. I learned how to really take those \"cleansing\" breaths ... and relax my body. I admit that I don't always practice what I preach and I am only human and I still do get anxious and depressed. But... I am on medication ... and use my deep breathing techniques. As for the chemo treatments ... some people like people around during the chemo ... and like to be entertained and distracted. I wanted to be alone. I took my xanax before I went for my appointment, then when I got there I put on my relaxtion CD ... and the first thing they gave was benadryl ... so I'd pull the blanket up all cozy ... take my slow deep breaths ... and I actually slept through most of my treatments. You'll do just fine ... but do talk to your doctor about prescribing something to help you relax ... hugs. teena",
      "MessageIndex": 16,
      "PostDate": "03/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/172974",
      "Title": "So scared, alone and need to RELAX....HELP"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Before my lumpectomy injected radioactive dye (without numbing the area) which I believe gives them information about the lymph nodes ... and I will admit it hurt.Then they did an ultra-sound to locate the area to be removed ... then numbed the area and inserted the wire ... which is what the surgeon uses to get to the right place. Then they did a VERY GENTLE mammogram to be sure everything showed up for the surgeon. I had all of this done at one location ... so after the mammogram I'm in the hospital gown ... and THEN have to go to the hospital for the actual surgery. I looked real cute parading around the waiting room :-) But ... my lumpectomy was done using general anesthetic. hugs. teena",
      "MessageIndex": 2,
      "PostDate": "28/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/176460",
      "Title": "question about a lumpectomy"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Just tooooooo funny !!!!! hugs. teena",
      "MessageIndex": 12,
      "PostDate": "03/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/174977",
      "Title": "First Christmas Joke of the Season"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I'm not sure I could have done it without a port ... emotionally. I'm terrified of needles and the thought of being poked and prodded ... looking for a vein ... scared me to the point that I think I would have said \"NO!\" to chemo. The port made it soooooo easy. One tiny little prick ... and I was plugged in and ready for the treatment. A breeze! hugs. teena",
      "MessageIndex": 21,
      "PostDate": "26/04/2011",
      "ThreadURL": "https://csn.cancer.org/node/217003",
      "Title": "Four rounds of chemo, will I need a VAP?"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "As Marcia said ... hang in there. What you are feeling is totally normal for everything going on in your body. Try not to stress about it... and if your body says it needs a rest ... do it. Sit and watch TV, or read ... or take a nap. And don't feel guilty about not being able to be \"superwoman.\" You ARE a SUPERWOMAN. Just look at what you have done so far to take care of yourself as far as treatments go etc. It's amazing how strong we can be when the time comes for that inner strength ... it's there. Just listen to your body ... and take it easy ... big hugs. teena",
      "MessageIndex": 2,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://csn.cancer.org/node/178595",
      "Title": "Feeling Down"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I'm so sorry Nancy ... about the loss of your friend ... but as you said ... it is truly ironic that her fight ended on St. Patrick's Day. I'm sure she's enjoying being pain free and having one big party with her Irish relatives. hugs. teena",
      "MessageIndex": 1,
      "PostDate": "17/03/2011",
      "ThreadURL": "https://csn.cancer.org/node/214341",
      "Title": "With a heavy heart.."
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Moopy ... repeat after me ... I WILL get new shoes, I WILL get new shoes, I WILL get new shoes! If your feet and your little toes are hurting ... and your shoes are falling apart ... GET NEW SHOES !! If your feet/toes hurt your entire body hurts. Treat yourself. While it is summer (sort of) and you can go barefoot a lot ... cooler/wetter weather will be in the forcast and you need SHOES! Like Jackie ... I live in Crocs ... but I'm sure you can find something you will like and that will feel comfy on your feet. So ... go shopping! Now ... for the real PUSH in the shoe saga ...Moopy ... you already know how lucky you are to have Joe ... and you know how wonderful he's been through all of this with you ... and he would do anything in the world for you ... right? So ...now it's time for you to do something for HIM. GO GET SOME NEW SHOES! It will make him very happy. hugs. teena",
      "MessageIndex": 6,
      "PostDate": "13/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168483",
      "Title": "Request for a VIRTUAL INTERVENTION with my wife Moopy"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "hugs. teena",
      "MessageIndex": 1,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://csn.cancer.org/node/168817",
      "Title": "communication"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "Sounds like a lot of fun. I can't imagine a hole-in-one prize being a set of dentures :-) That's a riot... although I guess if someone needed new teeth it would be a great prize. Personally I would rather have won your free pizza. hugs. teena",
      "MessageIndex": 1,
      "PostDate": "11/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173494",
      "Title": "Teeing it up for Ta Ta's Golf Tournament"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "So glad you are back home and hope you had a good nights sleep. You both deserve some time to kick back and do absolutely NOTHING (except for the occasional retail therapy). RELAX! We're thrilled that you will still be part of the family here ... because as others have said ... you two are our heroes. Your strength and \"togetherness\" is wonderful and we all draw strength from you. Rest. Rest. Rest. Then go celebrate!!! The RAD B's don't have to hit the road for awhile ... so there's for you two to relax ... before our rehearsals start. big hugs. teena",
      "MessageIndex": 8,
      "PostDate": "14/08/2009",
      "ThreadURL": "https://csn.cancer.org/node/173685",
      "Title": "Home from St. Louis... at last!"
    },
    {
      "AuthorID": "tgf",
      "AuthorURL": "https://csn.cancer.org/tgf",
      "Content": "I've never understood that \"friend\" thing. Since we all have the ability to send each other PMs (personal messages) by clicking on their \"username\" thing under their picture dealy at the left of the post ... I've never seen the point of the \"friends\" list. Can someone explain? I hope I haven't offended anyone by NOT adding them to my \"friend\" list ... hugs. teena",
      "MessageIndex": 7,
      "PostDate": "08/09/2009",
      "ThreadURL": "https://csn.cancer.org/node/175277",
      "Title": "Plus or Minus?"
    }
  ]
}