{
  "AuthorID": "tiger",
  "AuthorURL": "https://csn.cancer.org/tiger",
  "Posts": [
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "Hi, I am Tiger,I am new to this site but by the looks of it you are a very supportive and communicative group of people.I have stage 4 met breast in the liver, I had a mastectomy in Jan 00,and have been doing chemo since then, at first it was working,but after seven doses of the same chemo the two tumours on my liver have increased considerably in size.I am currently doing a weekly infusion of Herceptin and once every three weeks dose of Taxol, I have heard great things about this stuff,if any of you have had it or know of a story of someone else I would love to hear from you. I am strong and healthy and stubborn as a mule, my friends and family forget about the cancer because I am constantly on the go and so healthy, the only way anyone knows there is something different about me is because I am bald.I am comfortable now going out in public without my prosthesis, I find it a pain in the behind,or arse as we Maritimers would say.I am mailing from Canada,any other Canadians out there?eh? I am also interested in any input anyone has on reconstruction, I have a \"mommy tummy\" from two c sections and I would love to use that and have the Diep flap done.My husband says he does not care if I have any breasts at all as long as he has me, but I am a size 42 d and it is very noticeable when I go without my boob.I wish you all well in your fight and I look forward to hearing from you.Stay strong and stay positive,we will win!!!love from Tiger.",
      "MessageIndex": 0,
      "PostDate": "14/10/2000",
      "ThreadURL": "https://csn.cancer.org/node/135313",
      "Title": "anyone else with Mets?"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "Hi Sue, I hope you get somewhere with your Dr. You know, that kind of Hmmm attitude really pisses me off. I went to my family Dr last week with swelling in my mastectomy arm, and hand and lots of pain. He sat there and looked at me and said\"hmmm\" Then looked at me like he was waiting for ME to give him the answer!! Finally I just said \"well, what!!?\" I have been with him since he first started practicing, 10 years ago. But Duh!! if you dont know, send me to someone who does!!! I finally convinced him to send me for tests. Jackass!! Turns out to be nothing, but that is not the point. Now if I were a man, I would have been in the hospital with tubes down my throat and having every test possible, but being a woman, they just say Hmm!!Ah well, my bitching is not going to make your aches go away. Nag your Dr. Or punch him in the nuts and say Hmm. I dont know what is causing your pain. Take two ibuprofen and call me in two months!!!!! Love and hugs from Tiger",
      "MessageIndex": 2,
      "PostDate": "20/04/2001",
      "ThreadURL": "https://csn.cancer.org/node/136004",
      "Title": "aching arms and legs"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "HI Nancy,Tiger here, thank you so much for sharing your story, i really needed to smile today, i had my ct scan and now have to wait eight days for the results ,so of course i am on edge, your story made me smile and lightened my shoulders. You will do wonderfully because you are such a sweet woman. Love from Tigerxoxo",
      "MessageIndex": 2,
      "PostDate": "31/10/2000",
      "ThreadURL": "https://csn.cancer.org/node/135350",
      "Title": "A Happy Sunday Story To Share"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "Hi there, Tiger here, I have a young son who is 3 1/2 and a nine year old son, my youngest is at home with me all the time, We live on an airbase in Canada and so far the only people who have offered help in the way of childcare are my close friends, even the resource center on the base has not called to offer respite care. If needed my husband can come home from work or take a day off to stay home, his bosses are fantastic. I am on homecare,i see my nurse once a month or when i need her, and she says they offer respite care for the little ones, if i need a nap or have to go to the Dr. I think the community in which we live should have sort of a welcome wagon type of thing for people with medical problems. I imagine there would be people out there, retired,etc,who would love to volunteer.",
      "MessageIndex": 2,
      "PostDate": "26/11/2000",
      "ThreadURL": "https://csn.cancer.org/node/135437",
      "Title": "child care"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "I got chills,they're electrifying!!! Sorry, Grease is my favorite movie. Anyone taking Herceptin? If so, about the second day after I get chills,and the runs, and really,really, run and hide,smelly gas!!! My onco nurse says this is normal, and I am starting to find that my emotions are running hot and cold in a matter of seconds!! I thought it was menopause setting in, but she says Herceptin really plays with your hormones. The other day, I woke up feeling playful, then all of a sudden I was pissed off at the world, then I got horny, then I was laying on the bed bawling my eyes out, that is really strange for me. My poor husband does not know what to do with me!! I am interested to hear if anyone has any similar problems? Have a good weekend, Love and hugs from Tiger xox",
      "MessageIndex": 0,
      "PostDate": "24/11/2000",
      "ThreadURL": "https://csn.cancer.org/node/135435",
      "Title": "I got chills!!"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "Hi Nancy, Rosa here, do you want to try the chat function tonight? It is 11:00 am my time, i am in Ontario,Canada,I will get online at 5:00pm, my time tonight, and invite you in. lets give it a go!! Love Tiger",
      "MessageIndex": 0,
      "PostDate": "10/12/2000",
      "ThreadURL": "https://csn.cancer.org/node/135482",
      "Title": "lets try tonight"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "Well, it is nice to see the new web format, but honestly, I dont like it. I think I would rather go through all the messages to get the current ones. This is really kind of feeling unfinished? I really suck on the computer, so maybe that is my problem!! Well, I will check in tomorrow and try and figure this all out! Take care all. Hugs and love from Tiger",
      "MessageIndex": 0,
      "PostDate": "21/02/2001",
      "ThreadURL": "https://csn.cancer.org/node/135679",
      "Title": "huh?"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "Hi Mark, well I willjust agree with what the other ladies said, it is probably scar tissue, I have the same problem, and actually have a knot under my good arm that is just tendons. Still good to get it checked out. Let us know how she makes out and give her a big hug. Tiger",
      "MessageIndex": 3,
      "PostDate": "03/05/2001",
      "ThreadURL": "https://csn.cancer.org/node/136072",
      "Title": "a new problem"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "Hi, I think it is great what you are going to do. My suggestions would be to do stories from different standpoints. Such as recurrent breast cancer,symptoms,treatments, emotions. Patients with metastatic cancer,outlooks,emotions, ages etc. There is such a wide range of breast cancer,treatments and prognosis.The most important thing is to reach out to the public, and educate them that this is really not the death sentence that everyone thinks it is, even for someone in my shoes, you can read my story on my web page. Maybe get a local salon to do makeovers on patients undergoing chemo. My home email is davem@efni.com if you would like to chat personally, I am full of suggestions, and hope!! Tiger.",
      "MessageIndex": 1,
      "PostDate": "10/04/2001",
      "ThreadURL": "https://csn.cancer.org/node/135948",
      "Title": "Story"
    },
    {
      "AuthorID": "tiger",
      "AuthorURL": "https://csn.cancer.org/tiger",
      "Content": "Hi all. Wendy, girlfriend, I know how you feel. But let me tell you there is something to be said for spunk in a teenage girl!! I was the same way when I was a teen, only I did not start spouting off until I turned about 16.I was a painfully shy child, but when I turned 16 something inside me snapped and I started to stand up for myself. (As a result of being beaten all the time by my dad) I started voicing my opinion and not letting anybody pick on me. In high school I was teased alot and one day the captain of the football team tripped me in the hall way, I was so furious, I jumped up, grabbed him and put him in a locker. I mean Inside a locker!! Of course i got called to the principals office, she was a bleached blond with long red nails who wore a fur coat all year round. Well, I let her have it too!! Needless to say, my reputation preceded me and I could not get a boyfriend, all the guys were scared of me!! But i also believe that my \"Take no ****\" attitude has helped me in my fight against this cancer. So what may seem offensive now and annoying, may be a huge asset in the future. I am a kind and considerate person, but I refuse to let anyone take advantage of me, or walk on me. This fight is definately long and sometimes tedious, but in the end, it really is not that bad, the fight for life is definately the hardest fight of our lives, but what the hell?!! I wasn't doing anything anyway!!! My hair is falling out again. This will be the fourth time in the past year. I was at the mall with my friend and I got really itchy \"down there\", because my pubic hair is falling out like crazy and itching like you would not believe!!Well, she thought it was hilarious to see me dancing around trying to inconspicuously scratch!! Oh, the joys of cancer! Two more Taxol to go and hopefully that will be it. That will bring me to a grand total of 7 a/c, 9 Taxol, and 26 Herceptin since January 2000. I would love to have some hair in the near future, but it will probably be Christmas before i have enough to do something with. I live in sweat pants and sweattops or fleece tops, it is kind of hard to dress up , a ball cap just does not go with dress pants and blazer!! Pam, I am always a redhead , when I have hair! I am naturally dark brown, but I always dye my hair mahogany, it sets off my green eyes. Now, my blue ball cap sets off my green eyes!! When my husband and I were first going out together, he used to say \"you have beautiful eyes\", well come to find out a few years later, that was male code for \"nice boobs\", so now I lift my shirt and say\" like my eye??!\" We joke alot and it really helps. All our friends are used to my bald head and lopsided chest, it is ironic that his friends used to comment about my boobs, and now I only have one!! But they are also used to the fact that I will do and say anything, so watch out!! Nancy, I hope you send a baldie photo!!! My friend that I hang out with is black, and up here there are next to no black people, so of course when we are out together, we get some looks, a short tubby black woman and a tubby bald white woman!! We have fun. Her husband is white, and you should hear them!! Anyone who did not know them would think they are predjudiced, but my Lord we have fun!!Well, I dont know if I have helped you at all Wendy in making you feel less bummed out, I start rambling and cant seem to stop!! Oh yeah, what I wanted to say in the first place is; have you ever tried Bovine Colostrum? It is all natural and boosts your immune system, i used it and it really works, and I know Pam will vouch for it too. Ok, well, time to put the brats to bed, and have a little peace. Hubby is out with a friend in his new truck, men and their toys!! Have yourselves a great evening and chat at ya later. love and millions of hugs to you all. xo Tiger",
      "MessageIndex": 0,
      "PostDate": "27/03/2001",
      "ThreadURL": "https://csn.cancer.org/node/135864",
      "Title": "something to be said for spunk!"
    }
  ]
}