{
  "AuthorID": "tlmac",
  "AuthorURL": "https://csn.cancer.org/tlmac",
  "Posts": [
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "Not going because you simply aren't feeling up to it or because your medical team advises against it is a valid reason for postponing. Discuss your concerns with the people who will be taking the trip with you. Vegas is a 24-hour town so a little nap here and there shouldn't ruin anyone's good time. I've always found that getting away invigorates me and prepares me for the next battle. Your family's trip may be ruined if you don't go. I say if you have medical clearance, talk to your family about scheduling around your strength limitations. Take care!! terri",
      "MessageIndex": 1,
      "PostDate": "09/09/2004",
      "ThreadURL": "https://csn.cancer.org/node/144657",
      "Title": "worring"
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "Hi E, Yahoo health has had several interesting articles this last week on exemestane (aromasin) and early reports all indicate a significant benefit to switching from tamoxifen after the first 2 years or after a reoccurance while on tamoxifen. New drugs such as aromasin and femara have come on the scene just in the last 10 months since I chose to take arimidex instead of the current gold standard. Research I did convinced me it was the better choice even though my oncologist would have put me on tamoxifen if I'd let him.",
      "MessageIndex": 1,
      "PostDate": "19/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142712",
      "Title": "Aromasin (exemestane)"
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "It's so disheartening to take a drug you trust will protect you from cancer only to find it didn't work. Despite advances in the development of drugs like Raloxifene, Tamoxifen, Arimidex and Femara, none of them work 100% of the time for everyone. A good friend, taking Tamoxifen for the past 2 years, was just told her cancer has now spread to abdominal lymph nodes and liver. Evista was originally developed as a treatment for osteoporosis. It was found to lower the risk of breast cancer in post-menopausal women with osteoporosis but I'm surprised, with much better drugs available, that it was prescribed to you for that reason. All of us taking drugs to prevent recurrance pray they work but live with the reality that they might not. I'm so sorry you have to face this diagnosis a second time but pray that everything goes well with your surgery. terri",
      "MessageIndex": 1,
      "PostDate": "09/08/2004",
      "ThreadURL": "https://csn.cancer.org/node/144274",
      "Title": "Is Evista the answer?"
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "Hi Trixielee, Hard as it is to believe, your HER2 status may end up being a blessing. We now have a monoclonal antibody, Herceptin, that's having amazing results. It's availability has reduced recurrences and metastasis by upwards of 50%, pushing disease free survival for many into the 80+%. That's as good a prognosis as I got at stage II, ER+ but HER2-. We all felt that first panic at a breast cancer diagnosis. It would be a lie to imply that the surgery and followup treatment will be easy. It will, however, be do-able. So many of us are still here as proof of that. I'll keep you in my prayers. terri",
      "MessageIndex": 1,
      "PostDate": "17/11/2005",
      "ThreadURL": "https://csn.cancer.org/node/148865",
      "Title": "StageIII Her2+++ /Est-/Pr-"
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "I got a Neulasta shot with each of my 4 AC chemos in 2003. My hips would ache a little but nothing like you describe. Then again, we're all different in our reaction to the chemicals they pump into our bodies. At the very least, ask your doctor to switch you to Neulasta to see if you tolerate it better. Good luck. terri",
      "MessageIndex": 3,
      "PostDate": "01/08/2005",
      "ThreadURL": "https://csn.cancer.org/node/147859",
      "Title": "Neupogen"
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "What wonderful news! I was stage II, grade III with clear lymph nodes and will celebrate my first year being treatment free on May 8th. Postings like yours always give me hope that more and more of us will have similar outcomes. Congratulations on your continued good health and many blessings.",
      "MessageIndex": 4,
      "PostDate": "17/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142650",
      "Title": "surviving"
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "Kathy, One of my best friends is just 47 and battling stage IV. She moves from one chemo to another each time her current regimen stops working for her. Cancer is currently in her right arm, causing a break, throughout her abdomen and in her liver. If you don't mind sharing, where did your cancer spread and what treatment(s) have you had, or are having, to be so successful 7 years later? terri",
      "MessageIndex": 2,
      "PostDate": "28/07/2005",
      "ThreadURL": "https://csn.cancer.org/node/147815",
      "Title": "Need to make a decision"
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "Hi, I had a bilateral mastectomy performed February 6, 2003. Having no desire for additional surgery or a prolonged recovery, I was fitted locally at a prosthetics shop for the bras and prostheses I now wear. They're comfortable and look very natural so I have no complaints. My chest wall is now perfectly flat. I can understand for women who have had lumpectomies without reconstruction or for those with unique surgical situations that a custom cast prosthesis would be the best fit. The company you mentioned can be located at www.radiantimpressions.com. They answer many questions and offer photos of their products. Although I didn't buy from them, I researched and found an article that described how the bare chest wall is cast for a mold. Another cast is made with the client wearing a bra and prosthesis. Each cast takes about 30 minutes to complete. Along with pictures taken for the manufacturer and the careful fittings, the entire process takes about 90 minutes. There's a section of their web site that allows you to find shops in your home state or local area where this can be done. I would have had to drive about 2 hours to the closest. Cost was also a factor. Radiant Impressions breast prostheses cost about $2,800 compared with $350 for the traditional breast form. (Some insurance providers pay for the new forms.) I've also read that the difference in cost is worth it for those who have used both types of prostheses. If I weren't comfortable with my current fitting, it's definitely something I'd look into more closely. Good luck.",
      "MessageIndex": 1,
      "PostDate": "06/03/2004",
      "ThreadURL": "https://csn.cancer.org/node/142534",
      "Title": "Custom Breast Prosthesis"
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "Hi ClaudiaAnn, I also studied a copy of my path report to learn everything about my cancer. The CEP17 term refers specifically to chromosome 17 centromere. A centromere is the specialized condensed region of a chromosome where spindle fibers attach (the Her2 protein in this case) during cell division. We've learned that this protein has a significant effect on about 20% of all diagnosed breast cancers. The testing they do calculates the ratio of Her2 to chromosome 17. This ratio determines if your Her2 score is 0 or +1 (considered negative) or +2, +3 (considered positive). SadieSis has already explained the affect the monoclonal antibody, Herceptin, has on the Her2 protein. Along with aromatase inhibitors like Arimidex and Femara, Herceptin is a monumental advancement in the treatment of certain breast cancers. Good luck with your research and your recovery. terri",
      "MessageIndex": 5,
      "PostDate": "16/12/2005",
      "ThreadURL": "https://csn.cancer.org/node/149114",
      "Title": "HER+/Neu..."
    },
    {
      "AuthorID": "tlmac",
      "AuthorURL": "https://csn.cancer.org/tlmac",
      "Content": "My breasts were dense and had considerable weight but when I was first fitted they gave me lightweight forms, the ones most women love. I found my bras were forever riding up and it wasn't a natural feeling. I switched to Amoena Tresia 760 and they're perfect for me. Set up an appointment for a fitting and try different designs and weights. They even have forms that naturally attach to your chest wall on contact, move with you and allow you to wear regular bras. This year (5 and counting for me), I ordered \"swimmers\" so I could enjoy a dip in the pool or ocean while on vacation (Amoena Tria Swimsuit Form). They're specially designed to tolerate both chlorine and salt water. Good luck with your search. terri",
      "MessageIndex": 3,
      "PostDate": "12/09/2008",
      "ThreadURL": "https://csn.cancer.org/node/162246",
      "Title": "mastectomy forms"
    }
  ]
}