{
  "AuthorID": "TulsaMomof3",
  "AuthorURL": "https://csn.cancer.org/TulsaMomof3",
  "Posts": [
    {
      "AuthorID": "TulsaMomof3",
      "AuthorURL": "https://csn.cancer.org/TulsaMomof3",
      "Content": "Is it like an exam? Or do you just sit and talk? Do they do any blood work, weigh in type stuff? He will have all my pathology reports, Oncotest, ect.. Will we make a decision on Chemo during that visit? Will he ask me my opinion first or show me all the date and tell me his first? If Chemo is chosen, is the oncologist the one that puts in the port or do they send you to a general surgeon? Just curious",
      "MessageIndex": 0,
      "PostDate": "21/06/2010",
      "ThreadURL": "https://csn.cancer.org/node/194881",
      "Title": "First Oncology appointment/ What to expect?"
    },
    {
      "AuthorID": "TulsaMomof3",
      "AuthorURL": "https://csn.cancer.org/TulsaMomof3",
      "Content": "I scored a 12, My onco said he didn't think Chemo was neccesary but I just didn't feel good about it. I signed up for the Tailor X Trial and was randomly selected for Chemo + Tamoxifen. I just had my 3rd one today. Its not as bad as I thought however I do have side effects. I felt like with the clinical trial I would sorta have an outside vote. I feel very good about my decision to go forward with the Chemo. I am doing 4 treatments once every 3 weeks of T/C. I think the most important thing is that YOU feel good about your decision, peace of mine is priceless in this journey",
      "MessageIndex": 14,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198139",
      "Title": "oncotyping"
    },
    {
      "AuthorID": "TulsaMomof3",
      "AuthorURL": "https://csn.cancer.org/TulsaMomof3",
      "Content": "I took my 3rd Chemo today doc added a new drug. Gave me perscription for Decadron. I am to take it the day before chemo, the day of, and the day after. Any idea if this has side effects and what its actually for?",
      "MessageIndex": 0,
      "PostDate": "10/08/2010",
      "ThreadURL": "https://csn.cancer.org/node/198341",
      "Title": "Decadron"
    },
    {
      "AuthorID": "TulsaMomof3",
      "AuthorURL": "https://csn.cancer.org/TulsaMomof3",
      "Content": "I totally understand. My husband is like \"Do you have to always talk about it\" or \" You are a littel obsessed- you need to chill\". Then last night we were at dinner and I said something about only having one more weekend to enjoy myself - I was just refering to my upcoming BLM w Diep and he was like \"Give me a break your not going to die\" and I said no but things will be different for a long while and then there is treatment still to come... I wonder if he actually thinks I am going to have this surgery and then a few weeks later things will just go back to normal. Things will never be the same. We own a commercial construction bussiness and I do all the payrol and accounting. He was like \" take 2 weeks to get better because I need you at the shop even if its just a few hours a night on the computer\" REALLY! Does he really think I am going to be able to do that!!! Its like he thinks I can take 2 weeks off and then be back to normal. I have IDC with 3 tumors one being 3.5 cm and not sure of the node status. I have a feeling its going to be more like months not weeks...",
      "MessageIndex": 7,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190389",
      "Title": "My husband is my best friend....but since this IDC stage i grade III cancer he seems weird at times"
    },
    {
      "AuthorID": "TulsaMomof3",
      "AuthorURL": "https://csn.cancer.org/TulsaMomof3",
      "Content": "I think thats it, I think he is in denial. Since currently I look the same, and don't feel sick. I don't think he has grasped the severity of the situation.He hasn't been able to go to many of my appointemtns due to work. We have been married for 19 years and I think he just thinks this will be like anything elae. \"Mom never gets sick and when she does- she just manages to keep going about the regular routine.\" This Tuesday I have the final appointment with the surgeon and plasic surgeon before surgery. I have insisted he go - maybe then he will get it",
      "MessageIndex": 9,
      "PostDate": "18/04/2010",
      "ThreadURL": "https://csn.cancer.org/node/190389",
      "Title": "My husband is my best friend....but since this IDC stage i grade III cancer he seems weird at times"
    }
  ]
}