{
  "AuthorID": "webaur",
  "AuthorURL": "https://csn.cancer.org/webaur",
  "Posts": [
    {
      "AuthorID": "webaur",
      "AuthorURL": "https://csn.cancer.org/webaur",
      "Content": "Hi ladies!!! I read a response to a post today asking about Chemo Angels. Well, as it happened, I was just looking at another Discussion Board and found a post from the lady who started Chemo Angels. Soooooo, here is the place to e-mail/write for more information Larua Armstrong Founder and Director Chemo Angels springlap@yahoo.com chemoangels@yahoo.com Hope this helps!!! Blessings to all......Wendy",
      "MessageIndex": 0,
      "PostDate": "02/04/2001",
      "ThreadURL": "https://csn.cancer.org/node/135901",
      "Title": "Chemo Angels"
    },
    {
      "AuthorID": "webaur",
      "AuthorURL": "https://csn.cancer.org/webaur",
      "Content": "Hi! My name is Wendy. I was diagnosed just 4 weeks ago and had a modified radical mastectomy a few days later. My cancer is a Stage 3A, and I have just had one A/C (I, too, am new so I think that \"A/C\" means Adraimycin and Cytoxin). I had my hair cut real short just before I started chemo in \"preparation\"--I say its a nice transition between hair and no hair!! :-) I am not looking forward to losing my hair, either. It seems like it is just adding insult to injury!! I got a couple of wigs from our local Cancer Society office and some hats, too. (no charge) They are really great people!! My hairdresser styled the wigs for me (also no charge) so I am ready. My oncologist said that my hair would start to fall out about 2 weeks after the first treatment and be gone within a month. I can't wait!! :-( Anyway, how often do you go for your chemo? Mine is every three weeks. (You can check out my story a few entries down if you like. I won't bore you with it here!!) Life and Normal. I often wonder that myself. Except for being a little more tired than normal and when I go to change my clothes, I feel like life is pretty much normal. Although the definition of normal has changed. I haven't changed my diet much, either, except that I find I need to eat more to keep from having a pit in my stomach!! I am trying to eat correctly for the first time in many, many years. It is difficult. I have tried to stay off of caffeine, though, and to eat more fruit and vegetables. It is so hard! Anyway, you should find lots of support here. Just being a part of this for a couple of days, I have found lots of encouragement. Hang in there. Do you have the support of your family and friends? THAT really helps. You have mine...as well as my prayers. Take care and you can e-amil me anytime. Wendy in California.",
      "MessageIndex": 1,
      "PostDate": "22/02/2001",
      "ThreadURL": "https://csn.cancer.org/node/135682",
      "Title": "New to group"
    },
    {
      "AuthorID": "webaur",
      "AuthorURL": "https://csn.cancer.org/webaur",
      "Content": "Good Morning!!! I thought I would take a few minutes to let you all know exactly what is going on....or at least as much as I know. We met with the neurosurgeon last Thursday (3/7) and decided (of course) that we would have him remove this little tennent in my brain......I mean I don't want in there any longer than it needs to be!!!! :-) The surgery was schedule for yesterday (3/12) at Loma Linda University. We were there, did all of the pre-op stuff on Monday and then showed up for the final stages yesterday only to have them postpone the surgery because they did not have any ICU rooms that would be available for me after the recovery time. DARN!!! (and they had just hooked up the IV, too!!!) Anyway, I am now scheduled to have this \"Left Frontal Craniotomy\" on Friday (3/15) at Loma Linda. I will try to have my husband post a status on how things went, but don't hold your breath!!! My goal is to be able to do it myself early next week as soon as I am home. Guess that is it. I just have lots to do and need to get to it. So........until I am able to post again, just know that you all continue to be in my thoughts and prayers. I have learned through this latest ordeal, that God is ALWAYS there to hold our hands and lead us through whatever comes. As my pastor said on Sunday, sometimes we have to step out alone......but we are never alone for God is always there to hold us up. And He certainly does!!!! Keep the faith and hang in there. You can all do it-----its a piece of cake!!! (Yum.....cake!! Maybe I'll go and have some!!) Also.......a B-I-G THANK YOU",
      "MessageIndex": 0,
      "PostDate": "13/03/2002",
      "ThreadURL": "https://csn.cancer.org/node/137170",
      "Title": "Quick Update"
    },
    {
      "AuthorID": "webaur",
      "AuthorURL": "https://csn.cancer.org/webaur",
      "Content": "Hi, Jean!! I an just beginning journey through this maze of treatments, so I do not know any thing about Taxol and Taxotere. I do know about the feeling like you are getting a cold of something. I felt that way between my first and second treatments of A/C and also between the second and third treatments. My onc. nurse told me today, that if I had no fever, it wasn't too big of a deal. A fever would indicate a bacterial infection and THAT would cause the chemo to be delayed. She said that if I had just a viral kind of thing it shouldn't interfer with the chemo. Do hope that you don't have to put your treatment off because of sickness. Also hope that this has helped a little. Good luck to you and you will be in my prayers. Praying that the Lord with give you His comfort and strength to fight this. Let u know how things go on Thursday!! Blessings.....Wendy",
      "MessageIndex": 2,
      "PostDate": "27/03/2001",
      "ThreadURL": "https://csn.cancer.org/node/135856",
      "Title": "information about taxotere"
    }
  ]
}