{
  "AuthorID": "Youcandothis",
  "AuthorURL": "https://csn.cancer.org/Youcandothis",
  "Posts": [
    {
      "AuthorID": "Youcandothis",
      "AuthorURL": "https://csn.cancer.org/Youcandothis",
      "Content": "Terry, I've watched 3 close family members fight lung cancer and lose. Please think carefully about the effect on your children and grandchildren before you make a decision that might needlessly expose them and you to that kind of pain. Chemo is no joke, but it is soon over. It's a decision you will ultimately make on your own, but I'm glad you're talking to your family about it.",
      "MessageIndex": 6,
      "PostDate": "16/05/2010",
      "ThreadURL": "https://csn.cancer.org/node/192300",
      "Title": "Just Joined today, May 15,2010 :)"
    },
    {
      "AuthorID": "Youcandothis",
      "AuthorURL": "https://csn.cancer.org/Youcandothis",
      "Content": "I'm just about a year post completion of all treatment except the daily arimidex. I've noticed my husband turning more and more negative and unpleasant, but he was losing his memory too and I thought that would be enough to make anyone negative. He just got dx with frontal lobe dementia; turns out it's alzheimers evil twin. Families call it their worst nightmare, and spouses, even those of sweet caring men, come in for vicious emotional abuse. The condition is bad enough, and my children are wonderful and supportive, but only you my sisters in pink will know my special fear. This dx and his behavior are generating enough stress to feed a hundred tumors. I've tried yoga, it stresses me because it's so boring. What can I do to counteract the stress and keep the beast at bay. I'm really scared of opening up that door..",
      "MessageIndex": 0,
      "PostDate": "31/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/189222",
      "Title": "Anyone had a spouse diagnosed with temporal lobe dementia"
    },
    {
      "AuthorID": "Youcandothis",
      "AuthorURL": "https://csn.cancer.org/Youcandothis",
      "Content": "I can't add to all the worthwhile things people have said, but I want to tell you how right-on these posts are. You are in the arms of an awesome legion of warriors and survivors. Among us you will find wisdom, strength, examples, and experience. You will add your own input and we will lean on one another.",
      "MessageIndex": 14,
      "PostDate": "17/03/2010",
      "ThreadURL": "https://csn.cancer.org/node/188146",
      "Title": "New to discussions and have questions"
    }
  ]
}