{
  "AuthorID": "ArleneLD",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/ArleneLD/",
  "Posts": [
    {
      "AuthorID": "ArleneLD",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/ArleneLD/",
      "Content": "The loss of my family physician after 38 years has set me back on my heels. I agree, his retirement felt like I was going to have to spend the next thirty years, if I have them developing the same trusting, confidential and informative relationship with someone new. We are not just are diagnosis', we are people who like someone mention will grieve when we face loss. If you have spent a lot of time with a doctor and been compromised with poor health and needed the straight up help of your doctor, then of course you will grieve those who leave your life. Grief for me came in the form of not wanting to go meet my new doctor, feeling pressed to bring the new one up to speed quickly and resenting that I had to tell my story all over and health history all over again. I cried on my first visit with my new doctor and was taken aback by my reaction. I was totally embarrassed and couldn't find the words to tell the new dr, what I was really feeling. It's been 6 months and I am still grieving my old doctor and often find myself being mad and sad. Sounds selfish, but a family doctor like I had will be missed and it will take some time for his shoes to be filled. This could impact my health and how often and to what extent I will be open with my new family doctor. My grief may very well be unfair to my new doctor. He shouldn't have to fill anyone shoes. Just keeping it real! Thanks for the topic.",
      "MessageIndex": 5,
      "PostDate": "06/04/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-grieving-the-loss-of-your-physician/?group_id=200055",
      "Title": "New column: \"Grieving the Loss of Your Physician\""
    },
    {
      "AuthorID": "ArleneLD",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/ArleneLD/",
      "Content": "I thought doctors take an oath \"to do no harm.\" Neglecting to support you or call it quits with you is a problem. Not wanting to fill out disability forms is a part of their job, advocacy is part of their job. I believe if a doctor feels they can no longer help you, they need to at minimum redirect, moreover facilitate care elsewhere. It is unethical, unsafe and terrible to leave someone so ill and not create a viable plan for ongoing care whether it be them or someone else. I don't care how thick your file is or how complex your care might be. They are doctors who have extensive training and resources to treat almost anyone and any diagnosis because they have access to other specialists and doctors to consult. No one expects a family doctor or primary care physician to be all things to all people, but we can expect them to stand by their oath and competently see that care is provided by either themselves or someone else.",
      "MessageIndex": 14,
      "PostDate": "07/04/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-grieving-the-loss-of-your-physician/?group_id=200055",
      "Title": "New column: \"Grieving the Loss of Your Physician\""
    }
  ]
}