{
  "AuthorID": "Bestbird",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Bestbird/",
  "Posts": [{
    "AuthorID": "Bestbird",
    "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Bestbird/",
    "Content": "First, I'd like to thank Dr. Krumholz for reaching out to patients regarding their firsthand experience with hospitals. The points raised herein are insightful, and I just have a few things to add. 1. Keep patients advised about wait times to see the medical practitioner, and if they are running very late, contact the patient at home to advise them about the delay. 2. For those who are in-patients, improve the quality of food by adding a variety of healthier offerings including freshly-cut fruits, steamed fresh vegetables, and whole grains. Also offer soy and almond milks so that those who are lactose intolerant can have viable alternatives. And of course provide gluten-free options. 3. Although my local hospitals do a great job of this, others may not: Keep family members apprised during surgery as to how things are going. This should be done at least once if the surgery is 1.5 hours or more, and more often if longer. 4. Inform the patient and family regarding what to expect next. Who will see them, when will they be seen, and for what purpose? What symptoms and/or side effects might they have? What follow up will be undertaken and by whom? 5. I know this may sound trivial, but it would be nice to have magazines and books available while waiting. And not just \"Golf Digest!\" 6. Let the patient know what their out-of-pocket costs will be. Too often we receive a complex bill or statement of expenses and don't know what needs to be paid vs. what was covered by insurance. 7. Ensure that every patient leaving the hospital, along with their caregiver(s), has the contact number of a professional in the event of an emergency. This should not merely be the hospital's main number. 8. Whenever a patient is discharged after undergoing a procedure, follow up by phone the next day and possibly thereafter to ascertain the patient's status and answer questions (my hospitals do this, but I'm not sure if others receive this valuable service). 9. After a procedure, discharge instructions should be provided in the language the patient speaks. 10. Whenever a patient visits the hospital, they should be asked about their level of pain and about what other symptoms they maybe having. If the patient is in pain or experiencing other issues, a palliative care team should be assembled to ensure that their condition improves. I believe that this is vital for all patients. Thank you.",
    "MessageIndex": 15,
    "PostDate": "13/03/2019",
    "ThreadURL": "https://www.inspire.com/m/Brian/journal/how-should-we-improve-hospitals/?group_id=200055",
    "Title": "How should we improve hospitals?"
  }]
}