{
  "AuthorID": "Brian",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Brian/",
  "Posts": [
    {
      "AuthorID": "Brian",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Brian/",
      "Content": "Dear members, I’m pleased to share with you “Experts by Experience: Patient stories that teach,” a compilation of columns we created in collaboration with Mayo Clinic. In the foreword, which I co-authored with Lee Aase, Director of Mayo Clinic Social Media Network, we noted that it is our hope that \"these stories will become a powerful tool for patients, to give voice to their experiences, and a resource for healthcare providers, to turn knowledge into action.\" We invite you to read and share this compilation, which you can download here. We call the compilation \"stories that teach\" because patients and caregivers are educators. Every day on Inspire, we learn how patients and caregivers are teaching one another, and sharing how they educate others around them, including medical professionals. We invite you to comment here on the compilation, and we thank you for being Inspire members. Together we’re better, Brian Loew Founder, Inspire Edited April 24, 2019 at 10:02 am",
      "MessageIndex": 0,
      "PostDate": "24/04/2019",
      "ThreadURL": "https://www.inspire.com/m/Brian/journal/experts-by-experience-2018-patient-stories-that-teach/?group_id=200055",
      "Title": "Experts by Experience 2018: Patient stories that teach"
    },
    {
      "AuthorID": "Brian",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Brian/",
      "Content": "Dear members, As patients and caregivers, we have more sources of medical information available to us than ever before to help us make the best decisions possible for our health. Advice from our doctors is sometimes not the same as the information we learn from the experiences of our peers, and there are often other sources of information available as well. Some of our decisions feel like big or serious decisions, while others do not. And sometimes, medical decisions have to be made quickly or under pressure. When the stakes are high – life and death, even – it could be scary to think you might make the wrong decision even if there is no clear ‘right’ one. We’d like to hear how you made medical decisions in your life. Did some sources of information or advice figure more prominently in the process than others? Were some decisions easy, and others hard? How do you know who or what to trust? In retrospect, did you feel you made the right choice, or would you have chosen differently? Could you have chosen differently? Making medical decisions is a unique and individual process, and sharing your story could help others who are trying to decide what to do. Together we’re better, Brian Inspire",
      "MessageIndex": 0,
      "PostDate": "23/11/2016",
      "ThreadURL": "https://www.inspire.com/m/Brian/journal/how-do-you-make-medical-decisions/?group_id=200055",
      "Title": "How do you make medical decisions?"
    },
    {
      "AuthorID": "Fallguy007-Brian",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Fallguy007-Brian/",
      "Content": "Radha , Cool thanks for the work! may at some point want to add OS Overall Survival. A stat used in which all forms of death are included, car accident, heart attack, cancer etc. DSS Disease Specific Survival. A stat in which survival is only calculated with those whose specific disease was the specific cause leading to death.",
      "MessageIndex": 5,
      "PostDate": "23/03/2018",
      "ThreadURL": "https://www.inspire.com/m/Radha_Inspire/journal/you-made-an-inspire-glossary/?group_id=200055",
      "Title": "YOU made an Inspire glossary!"
    },
    {
      "AuthorID": "Brian",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Brian/",
      "Content": "Dear members, How should we be thinking about our genetic information when it comes to disease? It’s a question many of us are asking here on Inspire, sometimes very intensely, depending on the nature of the disease. The information we get from our genome can have a direct impact on so much, including how, or if, we can be treated for certain types of disease -- that is the nature of precision (or personalized) medicine. Precision medicine’s appeal is reflected in the way many drugs are developed and which ones work well enough for government approval. In May, the FDA made its first drug approval based on how well the drug targeted a tumor’s genetic features (one kind of “biomarker”) rather than the type of organ tissue the tumor came from. Last year, over a quarter of all the drugs approved by the FDA included biomarker information. Inspire’s 2016 Annual Survey of members revealed how much genetic testing and precision medicine are on our minds. Of 10,000 respondents, 18% already had their genes tested, 29% had heard of precision medicine, and 58% were interested in finding out more about their genetic makeup. What is more, many respondents expressed enthusiasm to share their genetic data to help scientific research. Almost 70% said they would share this information and/or their health records for a clinical research project. We expect that figure will climb in the 2017 Inspire Annual Survey, which we plan to publish soon. Patients’ genetic information could also help answer the question of when we might benefit from advances in precision medicine. Could a breakthrough treatment help someone now? Their children? Many of us want to be involved in medical innovation and drive decisions that will affect us. Offering access to the intricacies of our genomes is a powerful way to be involved. I feel strongly that if any of us do contribute in this way, researchers must respect our wishes about the ways in which our personal information is used. But even if sharing genetic information doesn’t appeal to you, sharing your experience with a treatment, asking for more information about a condition, or supporting one another as caregivers helps us learn more about what our genes can tell us. Each of us can help move medicine forward. I would love to know your thoughts about gene testing, precision medicine, and what it means to share this type of information. Has genetic information factored into your or someone you know’s care in some way? If you’d like, please share your experiences in the comments section below. Together, we’re better. Brian Loew Founder & CEO",
      "MessageIndex": 0,
      "PostDate": "06/07/2017",
      "ThreadURL": "https://www.inspire.com/m/Brian/journal/gene-testing-precision-medicine-and-shared-information/?group_id=200055",
      "Title": "Gene testing, precision medicine, and shared information"
    },
    {
      "AuthorID": "Brian",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Brian/",
      "Content": "Dear members, Many of us, including myself, have spent a good bit of time in hospitals, as a patient or a caregiver or both, and have ideas about how hospitals can improve. Dr. Harlan Krumholz, a cardiologist, healthcare scientist, and health care improvement expert at Yale University, recently asked the following questions on Twitter: “I am curious to know from patients, especially those recently in the hospital: What do you wish we did better? What were the most obvious ways that quality could be improved throughout hospitalization and in the transition to home? We should all really want to know. What should we improve?” Harlan’s tweet generated many good replies, and several days ago I asked Harlan what he would think about me posing this question on his behalf here in Inspire. As Harlan is, I’m proud to say, a fan of Inspire, he readily agreed. I invite you to reply to this discussion with answers to the questions he posed, so that we can help to drive positive change in hospitals. We would like to create a summary from your answers and share them, in an anonymous fashion (no Inspire username), as an essay in a publication, or present the combined insights at a conference. We will let you know of any publication or presentation of this information. Your perspectives matter, and together we can make an impact. I look forward to reading your thoughts and ideas, and if for any reason you would prefer that we not include your answer in our summary, just write, “Don’t share” in your reply. Together we're better, Brian Loew Founder, Inspire",
      "MessageIndex": 0,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://www.inspire.com/m/Brian/journal/how-should-we-improve-hospitals/?group_id=200055",
      "Title": "How should we improve hospitals?"
    },
    {
      "AuthorID": "Fallguy007-Brian",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Fallguy007-Brian/",
      "Content": "Chemo was not the preconceived horror show I thought it might be going in (cisplatin, carboplatin, taxol). Slight nausea here an there but easily controlled, some constipation, lost taste buds but they are back, lost hair, now back. Have had colds an flues that would have left chemo in the dust. Others mileage may vary, maybe depends on age and general health going in ? While not typically a complete remedy by itself (although that is advancing with immunotherapy) I feel it is always good to additionally treat the whole body systemically as well ( scans can only see down to approx 4mm and much can go undetected ).",
      "MessageIndex": 8,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/unintended-consequences-of-our-decisions-food-for-thought/?group_id=200055",
      "Title": "Unintended consequences of our decisions (food for thought)"
    },
    {
      "AuthorID": "Fallguy007-Brian",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Fallguy007-Brian/",
      "Content": "\" no one has really explained WHY I’m not eligible for bladder sparring \" Did you ever ask to directly speak with a Radiation Oncologist. Radiation supplants surgery if you will, you would be advised to consult with a Radiation Oncologist and not rely solely on others to tell you what is and is not possible with radiation.advise you only (hear it from a Radiation Oncologist directly, why not). I would never tell any one not to have RC (you surest bet), just make your decisions form the best informed position possible without any lingering question. https://www.inspire.com/groups/bladder-cancer-advocacy-network/d... Do not confuse Radiation Oncologist for Radiologist (radiologist just take-read xrays and scans). Radiation Oncologists are a completely different group",
      "MessageIndex": 12,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/unintended-consequences-of-our-decisions-food-for-thought/?group_id=200055",
      "Title": "Unintended consequences of our decisions (food for thought)"
    }
  ]
}