{
  "AuthorID": "bz121516",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/bz121516/",
  "Posts": [{
    "AuthorID": "bz121516",
    "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/bz121516/",
    "Content": "I've thought a lot about this question. I do a lot of research on the internet. That can only take you so far, but occasionally there is an article exactly on point. I only rely on primary articles like scholarly abstracts and articles written by professionals summarizing scholarly research. I use this information to provide context for understanding what the doctor is telling me as well as to prepare my own list of questions for my doctor. I have sought out a good primary care doctor who has a membership practice which facilitates my learning process. I also have a cousin, a medical professional who provides excellent advice on cancer as well as several others with professional medical knowledge who are resources. I seek out doctors at the best institutions which is a great aid in guaranteeing a minimum level of competency and often leads to dealing with the most knowledgeable people in a field. I sometimes get recommendations for doctors from other doctors, but often times that is not fruitful. I think its also important what you don't do. I don't take recommendations from friends. I try to completely remove a doctor's social skills from influencing me. The more social skills the doctor has the more difficult it is to evaluate them. I not only look at a doctors knowledge , but also their desire to benefit their patient. I have gotten second opinions which are very valuable tools. I chase down all ideas that may be relevant. I am constantly testing all information I receive from all sources against what I think I know from all sources. I am willing to escalate from my primary care doctor to specialists quickly and to quickly escalate to the top doctors in each specialty.",
    "MessageIndex": 6,
    "PostDate": "24/11/2016",
    "ThreadURL": "https://www.inspire.com/m/Brian/journal/how-do-you-make-medical-decisions/?group_id=200055",
    "Title": "How do you make medical decisions?"
  }]
}