{
  "AuthorID": "CCT67",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/CCT67/",
  "Posts": [
    {
      "AuthorID": "CCT67",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/CCT67/",
      "Content": "The answer to the question of whether high fluid intake = increased swelling/lymph congestion in a lymphoedenomous limb is, no. It may seem counter intuitive. However the superficial lymphatics generally swell more, not less when there is too little water/fluid consumption. This is why Lymphies are encouraged to drink liberal amounts of pure water ie insufficient hydration increases Lymph-edema. I know if I haven’t drunk my daily 10-12 cups of water I swell up much more and my overall LE symptoms become worse. As for asking an MD, so many MDs know little to nothing about the lymphatic system (as they do not receive informative training on the lymphatics and lymphatic diseases in medical school) it’s unlikely they would know the answer. They would probably give a guessed answer so as not to appear uninformed as MDs are ‘supposed to’ know everything. Only a very enlightened MD who has sought out training and education on the lymphatic system understands its function and role it plays would give accurate info. Countless Lymphies are improperly informed and/or incorrectly diagnosed by well-meaning but insufficiently uneducated MDs. This is due to medical schools ignoring the lymphatic system. This is slowly changing in light of what recent research has prooved about the critical role the Lymphatics play in all areas of human functioning from the brain, to the gut, to the skin and our major organs etc. Certified Lymphedema Therapists are the most knowledgeable medics, apart from the growing handful of lymphatic specialist clinicians and researchers dotted around the world. Also important when considering increasing limb volume over time are the molecular and cellular changes in the skin and tissue that occur as someone progresses through the LE Stages 0-3 (International Lymphologicsl Society staging). The skin and tissue becomes fibrotic and hardens, becomes wood-like, over time in an untreated limb. That is why compliance with daily treatment is so important, it can slow (and if caught early enough halt) disease progression. How I wish Lymphedema was purely an issue of reducing fluid take and it would go away, it’s not that simple",
      "MessageIndex": 5,
      "PostDate": "14/03/2019",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/lymph-node-transplantation-microsurgery-for-lymphodema/?group_id=200055",
      "Title": "Lymph node transplantation microsurgery for lymphodema"
    },
    {
      "AuthorID": "CCT67",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/CCT67/",
      "Content": "The surgeries are not cures for LE. Even if they are ‘successful’ conpiance with compression therapy and other daily treatment is usually required. Success usually translates into reduced intensity of symptoms which is a very good outcome for anyone with severe symptoms/pain. Many lymphies who have had LVA and VLNT surgeries are pleased with their outcomes. However there many lynphies who’ve had them with no change in symptoms. I personally know 5 lymphies who have upper and lower extremity LE who’ve had VLNT/LNT and/or LVA. (Primary and Secondary LE). I’ve spoken to them at length when I was considering surgical intervention and in the years since. Two are pleased with their limbs and improved quality of life. However three have no change or worsened symptoms and no change/worse quality of life. One these finds her QOL worse because she had such high hopes and was led to believe LVA would be successful because her LE was in the early stage. It’s been the opposite which has been upsetting for her. She had the op in 2017. One of my friends who has had LNT and SAPL who is very pleased highly recommends her surgeon Dr Jay Granzow in Southern California. He has a very good reputation within the LE surgical community in the US He performs LVA, LNT and SAPL. He’s not the only surgeon but was one of the first in the US to train with the surgeons who invented each type of surgery in their counties of origin. Be cautious and thorghly research any surgeon you are considering using - Good luck!",
      "MessageIndex": 3,
      "PostDate": "13/03/2019",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/lymph-node-transplantation-microsurgery-for-lymphodema/?group_id=200055",
      "Title": "Lymph node transplantation microsurgery for lymphodema"
    }
  ]
}