{
  "AuthorID": "doggiedoos",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/doggiedoos/",
  "Posts": [{
    "AuthorID": "doggiedoos",
    "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/doggiedoos/",
    "Content": "Great subject line... In 2015 I shared this story... A Tale of Two Cancers ~ A Caregivers Perspective In 1992 my 2 month old son was diagnosed with a rare type of Autoimmune disease Stage IV. Langerhans Histiocytosis X. All the symptoms were there but doctors never saw it. I was labelled a \"difficult parent\" that questioned the care they were giving him. I saw it everyday; in my sons labored breathing, in the \"suspicious spots that appeared on his skin not to mention the less than aromatic perfume radiating from his skin. My Maternal instinct was in overdrive. Doctor's thought I was crazy, assuring me my son was \"fine\"' I decided to show them crazy! I knew he wasn't fine and I dug my heels in assuring them I wasn't leaving until they found out what's wrong with him. A few chest x-rays later they found it. Who's Crazy now!? The mass covered his trachea, heart, lungs, he had spots on his liver, bones around his eyes and skin lesions. One moment being told my son was fine to the next hearing he was dying was surreal to me. As a Parental Caregiver of a sick child, I did what every parent faced with this does, I loved him and supported him unconditionally. My role was clearly defined, help my son travel the most difficult journey on Earth he would face. I did it whole heartedly and willingly. To this day there is no regret for that time in my life. I felt and still feel it is a privilege to be his mother and share that journey with him. When the door of HOPE would slam in my child face I'd find a new door, crawl through a window or bust out the jackhammer. My son never disappointed, he was a Fighter. It was my job to be the encourager. I held the spit bucket for my young champion pushing him back into the ring to go another round. After 6 years of battle he knocked Cancer out! Fast Forward to 2014...The same enemy with a different name takes aim a my husband,. There was no warning. The Mack truck of \"Bladder Cancer\" ploughed right into the both of us. Apparently, I lack the wifey instinct of \"knowing\"! Now I'm pissed. I'm mad, angry, frustrated and all the emotional vomit relating to the unfairness of life has befouled our life. My role this time is clearly defined. Love unconditionally. I wasn't ready for that, I'm still angry. My husband did not want to fight. He threw in the towel before entering the ring. As a Caregiver of a sick husband, I did what every wife faced with this does, I kicked the spit bucket across the floor! There was no way I was going to love him and support him unconditionally. My role was clearly defined, help my husband travel the most difficult journey on Earth he would face. Looked like he was going solo! An unconscionable rage takes over. When the door of HOPE would slam in his face I didn't look for a new door or crawl through a window, the jackhammer covered in dust sat in the corner. I have no control over his decision and utilizing all my powers of manipulation have failed. Except one. I plead with him, please try as tears rain down my face. He tries and faces a future neither of us thought possible. He finds out his life is worth living. I let a little love show. Not too much, I'm still mad. He has no idea why. I've given myself permission to feel the way I do. We have good days, and great days. We have mad days and sad days. Cancer is a thief. She impacts not only the patient but everyone around the patient. Some to a greater degree of difficulty. I've often compared my two roles as a caregiver. Honestly the journey was easier with my son. One, he was in diapers so I controlled his entire world. I found the loving was easier. More easily given and received. I was his whole world. My love for my husband is as profound but I find I've been guilty of adding condition's to my love for him. If he does this or he does that.... So here I am in the middle of the night having another revelation about this journey. Love should just be love. Without conditions and limits. I've given myself permission to experience to my feelings. I'm allowed to having bad days just like he does. But I'm also allowed to have good days. I'll never be perfect and neither will he. That's what makes it work. For the moment. Regardless of how many doors slam in our faces. I am my husbands whole world and he is mine. I will try again today to love him unconditionally. Now where did I leave that Jackhammer? ~D.M. Eich",
    "MessageIndex": 3,
    "PostDate": "08/06/2018",
    "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/the-choice-and-challenge-of-being-good-enough-a-caregiving-story/?group_id=200055",
    "Title": "\"The Choice and Challenge of Being 'Good Enough'- A Caregiving Story\""
  }]
}