{
  "AuthorID": "Janacoco",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Janacoco/",
  "Posts": [{
    "AuthorID": "Janacoco",
    "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Janacoco/",
    "Content": "Hello John, The whole topic of caregiving as it relates to brain cancer is one that I feel quite passionate about. At the risk of providing a comment that isn't quite what you were looking for (and I apologize in advance for that), I feel the need to say something about the current state of support we give to brain cancer caregivers, particularly those facing high grade brain cancer. In my opinion (for whatever that may be worth), the current support for brain cancer caregivers is unconscionably insufficient. Not only do brain cancer caregivers face the unique challenges inherent in caring for a loved one with a life-threatening disease, but they face massive challenges due to the often-experienced progressive mental and physical declines associated with the disease. The brain is the residence of our personalities, how we think, how we respond, how we move, how we speak; it controls virtually every function of our bodies. When the brain-organ is compromised by brain cancer, caregivers who are not armed with a manual and who rarely have a medical background are thrust into dealing with all the effects of the disease from head to toe. Plus, they must deal with the side effects of the treatments, which can be as taxing as the disease itself. Plus, the disease often sidelines the affected person’s job and income, which can throw the family into precarious financial positions that the caregiver often has to handle. Plus, there could be children who have their own set of anxieties about the disease that must be handled. Little wonder that many, many brain cancer caregivers must come onto the Inspire ABTA site and “vent” – often describing their sense of extreme exhaustion that is not just physical, but leaves them depressed and questioning their ability to effectively help their loved one in their hour of greatest need. Neuro-oncologists, burdened as they are with extreme case loads and administrative requirements, cannot spend the time with the caregivers to help explain and guide them through the brutal labyrinth before them. In short, once a diagnosis of brain cancer is made, a person is promptly ushered into requirements for skills and stamina likely beyond anything they have experienced before in their lives, and just as promptly, they are orphaned by a shocking lack of structured support and so are overwhelmingly busy and naturally feel abandoned and very isolated. I believe that every neuro-oncologist should have a case manager or lay health worker assigned to the patient's primary caregiver who can provide crucial practical, non-medical support for such things as: a) advance care planning, both physical (e.g., accessibility) and administrative (e.g., powers of attorney, etc.) b) physical symptom management (e.g., surgery and radiation aftercare, hair loss, insomnia, seizures, dealing with incontinence, etc.) c) psychological symptom management (e.g., depression, fears, aggressiveness and psychotic reactions to medications, etc.) c) guidance on wide array of “logistical” topics from advantages of comprehensive genomic evaluations to getting second opinions to traveling with a patient d) nutritional guidance e) late stage management (e.g., choosing a hospice). (This list is solely indicative; it is not intended to be comprehensive, but it is certainly long enough.) Nowhere at present, except on Inspire’s ABTA site and a few other forums, do I find the kind of human to human support that brain cancer caregivers really and truly need to deal with the enormous scope of this disease without suffering from physical ailments, spiritual breakdowns and borderline PTSD ...but the caregivers need more than these online forums can routinely provide. Decades ago, we did not have nursing homes. Now it is accepted that nursing homes are an essential – actually a standard - resource. Similarly, I am hoping that we quickly recognize a serious gap in the resources available to brain cancer caregivers and will give them the much needed support they need. Without the structured support addressing the considerable challenges they bear, we really cannot content ourselves with the notion that we are providing humane and compassionate support to brain cancer caregivers. Thanks, John, for the opportunity to do a little venting of my own on this vital topic. Jana",
    "MessageIndex": 6,
    "PostDate": "09/06/2018",
    "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/the-choice-and-challenge-of-being-good-enough-a-caregiving-story/?group_id=200055",
    "Title": "\"The Choice and Challenge of Being 'Good Enough'- A Caregiving Story\""
  }]
}