{
  "AuthorID": "JohnNovack",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JohnNovack/",
  "Posts": [
    {
      "AuthorID": "JohnNovack",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JohnNovack/",
      "Content": "7/6/18 Dear members, I'm writing to share with you the latest in the twice-monthly series of “Experts by Experience” columns, as part of a collaboration between Inspire and Mayo Clinic. We invite you to read and share, \"The Little Voice in my Head – Escaping My Biggest Enemy,\" by advocate Alisha Bridges, who lives with psoriasis . In struggling to manage the stigma of psoriasis, Bridges, noted, \"I know the hurtful, negative things I hear are not true, but come out of internal insecurity—it’s what anxiety feeds on.\" Also, please see a new caregiving self-care column as part of the Mayo/Inspire series, \"A Nothing Day: Self-Care for Caregivers,\" by Harriet Hodgson. \"You may wish to make a sign that says Nothing Day, with the day of the week, and date on it; circle the day on a calendar as well,\" Hodgson wrote. \"Allow enough lead time to give your loved one opportunity to process the thought. Most importantly, assure your loved one that her or his basic health needs will be met.\" Last but not least, we invite you to read an opinion piece, \"Opioid stigma is keeping many cancer patients from getting the pain control they need,\" published just today on the Boston Globe's STAT healthcare news site, and written by two Inspire colleagues here, Sara Ray and Kathleen Hoffman. We invite you to comment on all the columns, and share them as you see fit. Thanks for being Inspire members. Together we're better, John Novack Communications Director Inspire john@inspire.com",
      "MessageIndex": 0,
      "PostDate": "06/07/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-the-little-voice-in-my-head-escaping-my-biggest-enemy/?group_id=200055",
      "Title": "New column: \"The Little Voice in my Head – Escaping My Biggest Enemy\""
    },
    {
      "AuthorID": "JohnNovack",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JohnNovack/",
      "Content": "Dear members, I'm writing to share with you a new column, \"Chronic Disease Management And The Need For Control,\" written by patient advocate Kristina Figueroa as part of Inspire's collaboration with the magazine Life Science Leader. Kristina, who lives with Type 1 Diabetes, wrote, \"What if we changed the way we delivered our diabetes education? What if we used an existing mobile app to develop new habits over time? Or better yet, what if we started asking more specific questions in the review of systems during medical exams? This could allow for us to track thought patterns and identify risks for greater outcomes and comorbidities.\" Also, please see another new column, \"Straight from the Doctor’s Mouth – My Cancer Diagnosis,\" by testicular cancer survivor Justin Birckbichler. Lastly, we invite you to read \"Stories Matter: Why You Should Embed Patient Stories at the Heart of What You Do,\" (https://socialmedia.mayoclinic.org/2018/11/02/stories-matter-why...) by breast cancer survivor and communications consultant Marie Ennis O'Connor. These are part of the twice-monthly series of “Experts by Experience” columns, as part of a collaboration between Inspire and Mayo Clinic. We invite you to comment on these three columns, and share them widely as you see fit. Together we're better, John Novack Communications Director Inspire Edited November 12, 2018 at 9:19 am",
      "MessageIndex": 0,
      "PostDate": "09/11/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-chronic-disease-management-and-the-need-for-control/?group_id=200055",
      "Title": "New column: \"Chronic Disease Management And The Need For Control\""
    },
    {
      "AuthorID": "JohnNovack",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/JohnNovack/",
      "Content": "From: John Novack, Inspire Dear members, We're excited to let you know that we just began a partnership, \"Patient Perspectives,\" with the industry magazine Life Science Leader. A goal of the collaboration is help life science executives understand better the journeys of patients and caregivers facing significant illnesses. We invite you to read and share the new guest column, \"Making No Cents: The Hidden Cost Of American Illness,\" by Lilly Stairs, a patient advocate who lives with multiple autoimmune disorders. Ms. Stairs' column is the first in a series of bi-monthly columns that will appear in Life Science Leader as part of the \"Patient Perspectives\" collaboration. Together we're better, John Novack Communications Director Inspire john@inspire.com",
      "MessageIndex": 0,
      "PostDate": "10/04/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/a-new-collaboration-patient-perspectives-to-amplify-patients-voices/?group_id=200055",
      "Title": "A new collaboration, \"Patient Perspectives,\" to amplify patients' voices"
    }
  ]
}