{
  "AuthorID": "Meltan",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Meltan/",
  "Posts": [
    {
      "AuthorID": "Meltan",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Meltan/",
      "Content": "My sister in law had brain cancer. When removing it, she had a stroke.she has had so many problems since. She is now on a wheel chair. One side is paralyzed. She has problems with her bladder. Her husband works so hard to pay medical bills. Her 18 and 20 year old soms hell her a lot. I feel they should be allowed to live as they should. She will not let any help come in and stays by herself a lot. She has been td that she needs surgery or she will die from meningitis. She stings put in so has to wait for surgery. My 71 year mother in law takes her to her doctors appointments often. There is no way she can lift her. It is a hot mess. I want to say that I pray that my daughter has no regrets when I die. She is my caregiver. I tell her all the time that. I know that I drive her crazy and I try not to. I have told her that if she ever whats to quit, I will jire a sitter. She wants to take care of me. I feel so guilty that she does this but I also feel blessed. Just a few thoughts about caregivers from the other side. Have a great day! Melissa",
      "MessageIndex": 9,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/the-choice-and-challenge-of-being-good-enough-a-caregiving-story/?group_id=200055",
      "Title": "\"The Choice and Challenge of Being 'Good Enough'- A Caregiving Story\""
    },
    {
      "AuthorID": "Meltan",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Meltan/",
      "Content": "Thank you so much for the article on caregivers. Ihave had cancer twice,, have neuropathy and can't drive, had seizures, and bipolar. My in my side is extremely painful. My daughter, 29, is my caregiver. She is here almost 24 hrs. A day. Her sister lives in North Carolina. Sh'_ only com9once a year. She does't help at all. I can't travel because I am in stage 3 kidney failure which I forgot to mention. Caregivers have a difficult job.and in Georgia there is no compensation. I often feel guilty that she has to all that she does. This seams to be a common feeling among people witb caregivers. Caregiver are true angels. This article made me decide to write my congressman about compensation for caregivers. Many can not work. Melissa",
      "MessageIndex": 7,
      "PostDate": "09/06/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/the-choice-and-challenge-of-being-good-enough-a-caregiving-story/?group_id=200055",
      "Title": "\"The Choice and Challenge of Being 'Good Enough'- A Caregiving Story\""
    }
  ]
}