{
  "AuthorID": "scgal92",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/scgal92/",
  "Posts": [
    {
      "AuthorID": "scgal92",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/scgal92/",
      "Content": "Absolutely amazing! I needed to see this today. After not being able to get my second dose of chemo due to kidney numbers being off and wanting to give up...this is what I needed to see. Bravo!",
      "MessageIndex": 13,
      "PostDate": "31/07/2018",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/bucket-list-item-done-twin-peak-south-challis-idaho/?group_id=200055",
      "Title": "Bucket list item done, Twin Peak South, Challis Idaho"
    },
    {
      "AuthorID": "scgal92",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/scgal92/",
      "Content": "Thank you Cup of Tea! So glad to hear that you’re still here 2 1/2 years after surgery. I know that Dr. Donat and her team are somemof the best so I just have to put my trust in them. It is hard to give up the bladder. Although I know that if it was a breast, I would have no hesitation. Wish we didn’t need a bladder! :-)",
      "MessageIndex": 17,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/unintended-consequences-of-our-decisions-food-for-thought/?group_id=200055",
      "Title": "Unintended consequences of our decisions (food for thought)"
    },
    {
      "AuthorID": "scgal92",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/scgal92/",
      "Content": "Kelwala, Thank you! It’s what I needed to hear. I’m planning on having open surgery. I was leaning towards an IC because I had heard it has less complications. I’m not sure if I’m eligible for the neo but I will ask again. Thanks again.",
      "MessageIndex": 18,
      "PostDate": "20/07/2018",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/unintended-consequences-of-our-decisions-food-for-thought/?group_id=200055",
      "Title": "Unintended consequences of our decisions (food for thought)"
    },
    {
      "AuthorID": "scgal92",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/scgal92/",
      "Content": "I think I’m tired, because I’m having trouble making sense of the article. I’m going for my first chemo infusion next Tuesday, gem/cis for T2. Should I not get chemo? Go straight to RC. I met with my local doctors, who gave me the original diagnosis. My second opinion was Dr. Donat and Dr. Teo at MSKCC. My husband is wondering if we should go to Columbia? I have kids so temporary moving to Johns Hopkins or Cleveland Clinic would be too much. I have a consultation at MKS with a radiologist to discuss bladder preservation. Problem is the consult is 3 weeks away. I was diagnosed on July 12 so I’d rather not wait another 3+ weeks. Why don’t they try to save our bladders? I know it’s not the “gold standard”, but why can’t it be?",
      "MessageIndex": 7,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/unintended-consequences-of-our-decisions-food-for-thought/?group_id=200055",
      "Title": "Unintended consequences of our decisions (food for thought)"
    },
    {
      "AuthorID": "scgal92",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/scgal92/",
      "Content": "Jzpage, Thank you! As always, you give a clear reply that I can understand. I want to live! While I’m not thrilled with the options of urinary divergent, I need to adapt to what will be my new normal. My husband has a hard time with the fact that no one has really explained WHY I’m not eligible for bladder sparring. You have and I have read the Mass General study. He is afraid that I will sink into a depression and not want to leave the house. I’ve told him that it will be a period of adjustment but I’ll be alive! My one concern is that I had the TUR with the local urologist when I was first diagnosed. The doc said he got about 90-95% of the tumor. Dr. Donat never did her own cystoscopy. My CT scan with contrast of the abdomen and chest area are almost 7 weeks old. I asked to have another before the start of chemo next week but Dr. Teo said anything within 8 weeks is okay and he didn’t want me to have the contrast again so close to chemo. IF the chemo doesn’t work, it will be 3 more months that this tumor could grow. I know I will get a CT and PET scan at the end of chemo and before surgery...what if it shows another huge tumor? Thank you again for taking the time to answer. I really appreciate your knowledge. Kathy",
      "MessageIndex": 11,
      "PostDate": "19/07/2018",
      "ThreadURL": "https://www.inspire.com/m/jzpage/journal/unintended-consequences-of-our-decisions-food-for-thought/?group_id=200055",
      "Title": "Unintended consequences of our decisions (food for thought)"
    }
  ]
}