{
  "AuthorID": "Sharon2843",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Sharon2843/",
  "Posts": [
    {
      "AuthorID": "Sharon2843",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Sharon2843/",
      "Content": "Hi Vicki, Me again. Have you considered using an alternative protocol for your cancer. There are many of them out there. I have been looking into several of them. One of the main things you can do is change your diet. Juicing is good as it lets your body get the nutrients without working for it. Eliminate all sugars and anything with sugar in it. Also no carbs. These feed the cancer. I know your DR. has not told you this. They have no training in this and are not allowed to tell you if they do. They risk losing their license . Check out Gerson on utube. and also go to cancertutor.com They have a lot of information on there. You have been through so much, I know you are weary. I get down sometimes myself, but I do have someone who is depending on me, so I keep going. I don't know if you are able or not but you may want to consider volunteering If you love animals, the pet rescue places are always needing someone to love on the animals. It will give you a sense of being needed Blessings, Sharon",
      "MessageIndex": 4,
      "PostDate": "06/11/2018",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/hope-living-with-breast-cancer/",
      "Title": "Hope living with Breast Cancer"
    },
    {
      "AuthorID": "Sharon2843",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Sharon2843/",
      "Content": "Hi Vicki, I don't know your age, but you can try the senior center near you. Some of them have a lot of activities going on, including health and well being classes. Just meeting new people and being involved in some kind of group will help a lot. Do you have any hobbies that you enjoy? Search In your local papers community page for classes or groups and when and where they are meeting. They are always glad to have new members. If there is something you would like to learn , classes are usually listed in the paper or on local bulletin boards. I do crochet and it is very relaxing to me, I understand that painting is very therapeutic also. May you have a blessed day. Sharon",
      "MessageIndex": 3,
      "PostDate": "06/11/2018",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/hope-living-with-breast-cancer/",
      "Title": "Hope living with Breast Cancer"
    },
    {
      "AuthorID": "Sharon2843",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Sharon2843/",
      "Content": "Has anyone used the BX Protocol?",
      "MessageIndex": 0,
      "PostDate": "06/11/2018",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/breast-cancer-alternative-options/",
      "Title": "Breast cancer alternative options"
    }
  ]
}