{
  "AuthorID": "Spitfire32",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Spitfire32/",
  "Posts": [
    {
      "AuthorID": "Spitfire32",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Spitfire32/",
      "Content": "Thomas I could not have said it better. No one could. And if you have people close to you saying how proud they are of you, I’m sure you want to tell them exactly how you feel but our mothers taught us better. In a parallel scenario, I am here six years post pneumonectomy. Nerve damage in my back requires me to take opioids. My GP is wonderful and she will do everything in her power to see that my pain is kept to a minimum. One of these days the hammer is going to come down on her. I decided to pursue medical marijuana and she’s on board but not licensed to prescribe it. She referred me to pain management. Long story short: $500 cash out of my pocket on top of the NJ MM card $100 fee. This just pissed me off to no end, especially after our fine governor signed everything in the books to make it easier and more affordable for NJ residents to go legal. The doctors are the ones now making it impossible for most. I can’t afford 500! And on top of that, the dispensaries don’t provide anything but bud. I can’t inhale, smoke, vape. Fat lot of good that does some of us. I don’t know your stance on marijuana, if you don’t believe, I respect that. The point is the docs monopolized. I hope you find a way to work through your pain and discomfort. I think I might write to our governor now. Joanie",
      "MessageIndex": 3,
      "PostDate": "05/08/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-the-little-voice-in-my-head-escaping-my-biggest-enemy/?group_id=200055",
      "Title": "New column: \"The Little Voice in my Head – Escaping My Biggest Enemy\""
    },
    {
      "AuthorID": "Spitfire32",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Spitfire32/",
      "Content": "You are so right! The doctors are afraid of the government! I do believe that.",
      "MessageIndex": 13,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-the-little-voice-in-my-head-escaping-my-biggest-enemy/?group_id=200055",
      "Title": "New column: \"The Little Voice in my Head – Escaping My Biggest Enemy\""
    }
  ]
}