{
  "AuthorID": "TammyL67",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TammyL67/",
  "Posts": [
    {
      "AuthorID": "TammyL67",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TammyL67/",
      "Content": "Tomorrow (04/25/19) I am going for the removal of the lobular breast cancer on the right along with some lymph nodes and the papaloma they found on the left. I met with a thoracic surgeon today concerning the lung cancer. He wants a lung function test, an EBUS (to get a biopsy of trachea tissue) and an MRI of the brain to check for mets. He said once he has these, he can form a plan of attack. He has mentioned surgery, radiation and possibly chemo or immunotherapy. I asked if he had a stage yet. He said 2A or 2B (the tumor is in the left lower lung and there are some lymph nodes on the left side of the lung that are involved) . I asked the prognosis. He said 50-60% have a 5 year survival rate. Tough news! Still keeping a positive attitude though! I am still feeling fine. No symptoms of lung cancer and, other than feeling the lump, no signs of breast cancer. I read a cancer forum room that was more humor oriented that people were naming their cancers. So, Molly is my Lobular Cancer, Polly is the Papaloma and Felicia is the Lung Cancer. (This is so when it is gone, we can say Bye Felicia!) So, tomorrow I say good bye to Molly and Polly! I hope I never see you again!",
      "MessageIndex": 0,
      "PostDate": "24/04/2019",
      "ThreadURL": "https://www.inspire.com/m/TammyL67/journal/the-journey-continues-ky8hx7/?group_id=200055",
      "Title": "The Journey Continues ..."
    },
    {
      "AuthorID": "TammyL67",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TammyL67/",
      "Content": "Molly and Polly are gone. The breast cancer surgery was a success! When the biopsy on the Lobular breast cancer came back, it was HER2-. After the surgery the tumor was sent away for testing. It came back as Equivocal. This means they aren't sure. They had to send the specimen off to California for a FISH test. This would be definitive. About a week later, it came back as HER2-! Yay! I was prescribed Norco (Vicodin) for pain after the surgery. I did not need to take any., They gave me exercises to do to help with range of motion. (Walking fingers up the wall and making circular motions with my arms by my sides.) I didn't do these because I was not having any trouble with motion. My surgery was on a Thursday. Saturday I was driven 2 hours to and 2 hours from my daughter's college graduation. It was not too bad. I was expecting the recovery to be a lot worse than it was. Maybe it was the places of the incisions??? I do actually have a pretty high pain tolerance. No chemo needed. Recommended 6 weeks of radiation. July I am supposed to start Arimidex, an anti-cancer hormone therapy. Tomorrow I meet with the radiation oncologist right before the thoracic surgeon. The Adenosquamous Lung Cancer: I had the lung function test. This was basically breathing into a tube with and without resistance with a clip to close my nose. No meds or IV's needed! They said my lung function was very good! Yay! I had the brain MRI with and without contrast. This is not for the claustrophobic! They do give you headphones and you can chose a genre of music to listen to. I just kept my eyes closed. For the contrast, I did have to get an IV to administer the contrast. Tests came back ... there is a brain, but no visible lesions! Yay! The last test I had was the EBUS (brochoscopy). This was treated as a surgery. I was put to sleep. They went in through my mouth and took 5 or 6 specimens checking for cancer. They were checking the trachea and lymph nodes near the trachea for cancer. I was able to eat soft foods later that day. I had a bit of a cough for a day or 2. I just used throat lozenges to help with a sore throat. It wasn't horrible. Just like a strep throat feeling. I just got the results back ... no cancer found in any of the samples they took! Yay! I go to the thoracic surgeon tomorrow to find out the plan of attack for the lung cancer (Felicia!).",
      "MessageIndex": 0,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://www.inspire.com/m/TammyL67/journal/still-rolling-96ekh7/?group_id=200055",
      "Title": "...still rolling!"
    },
    {
      "AuthorID": "TammyL67",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TammyL67/",
      "Content": "Re-entered as a new journal entry rather than a reply Edited May 15, 2019 at 10:20 pm",
      "MessageIndex": 1,
      "PostDate": "16/05/2019",
      "ThreadURL": "https://www.inspire.com/m/TammyL67/journal/the-journey-continues-ky8hx7/?group_id=200055",
      "Title": "The Journey Continues ..."
    },
    {
      "AuthorID": "TammyL67",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TammyL67/",
      "Content": "My journey started at the beginning of March 2019. I had a mammogram because I found a lump in my right breast. There was a smaller lump in my left found in the mammogram, but they said it was of no concern, but said they needed to biopsy the right because of it's suspicious appearance. That came back as Lobular breast cancer. Now, because that was cancer, they decided they needed to biopsy the left breast lesion. That came back as not cancer, but could turn into cancer, so to be safe, they said they'd remove that too. Surgery was scheduled for partial mastectomy on the right along with taking some sentinel lymph nodes for testing and partial mastectomy on the left with no lymph nodes to be taken. Then 6 weeks of radiation. Hormone pill. No chemo. Prior to the breast surgery, they wanted to get an MRI for a better picture of everything. On the MRI, they could see my lungs and said there appeared to be a nodule in the left lung. Off I go for a lung CT with contrast. 2.8cm nodule in left lower lobe. Lymph nodes along hilum are enlarged. Then off for a lung biopsy. Just got a call yesterday from the doctor that it is non-small cell lung cancer, specifically adenosquamous carcinoma. She is keeping the breast surgery on the schedule until I am seen by the lung cancer doctor. She said the breast cancer is not aggressive, so she will let the lung cancer doctor make the call on which cancer to treat first. I am hoping to get a call tomorrow of when that appointment will be. She says these are 2 separate cancers and not related. Lucky me! Most of what I have read on adenosquamous carcinoma of the lung is not very promising. But...a lot of these studies were published several years ago. Many of the trials have 3 year and 5 year statistics...so even newer studies were ones that were started several years ago, and huge advancements have taken place in recent years. Trying to stay optimistic! For anyone wondering how bad the testing for everything was: *Mammogram - nothing out of the ordinary testing. Quick and easy! No needles. *Ultrasound - no worries! Quick and easy! No needles! *CBC blood test - Standard needle withdraw of blood. *CT scan with contrast - Need IV to inject the contrast, no lasting affects. Fine the rest of the day. *PET scan -- Need IV to inject contrast, plus they give you a 'water' to drink. Slightly bitter, but not unbearable. The prep for this test is probably the worst! Low carb, high protein, no caffeine and no strenuous activity 24 hours prior. I LOVE CARBS and sugary stuff and caffeine! LOL ...I had a major 'caffeine headache' that morning. After the test, I was fine to drive. No surprises found on the PET. Just the breast and the lung with lymph node enlargement. *Right breast biopsy- not too bad. The site was off to the side a bit. A little ouchy. I took the next day off work, but I could have gone if I needed to. (I have a desk job) *Left breast biopsy was worse - This was closer to the nipple. That was tender for a couple of days. That has been about 3 weeks ago and I still have some bruising. I probably could have gone to work the next day if I wanted to, but I would have been really uncomfortable. *Lung biopsy - Needle biopsy of lower left lung. Doctor came in and told me that because the lesion is touching the wall of my lung, I would most likely have a lung collapse or plural effusion. They would have to insert a chest tube and I would have to stay over night. I told her if she could prevent that from happening, I would give her $5.00. I owe her $5.00! They used conscious sedation (versed and fentanyl) ...no memory of the procedure! When the doctor called me yesterday with the result, she asked how the lung biopsy was. I said honestly, the breast biopsies were much worse! She was surprised at this. I had no pain. The next day, after sitting for a while, my back felt 'tired'. It didn't hurt though. Well, this is my story so far! I will try to keep posting the good, the bad and the ugly! Edited April 14, 2019 at 2:55 pm",
      "MessageIndex": 0,
      "PostDate": "14/04/2019",
      "ThreadURL": "https://www.inspire.com/m/TammyL67/journal/lobular-breast-cancer-and-adenosquamous-lung-cancer/?group_id=200055",
      "Title": "Lobular Breast Cancer and Adenosquamous Lung Cancer"
    }
  ]
}