{
  "AuthorID": "TeamInspire",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
  "Posts": [
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello SisofMBC, Welcome to Inspire! If you do not receive more replies, you may also want to ask your questions in our Advanced Breast Cancer community. You can read more by clicking the link below. Precision medicine We hope this helps and wish you and your sister the very best. -TeamInspire",
      "MessageIndex": 1,
      "PostDate": "20/09/2018",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/molecular-profiling-for-mbc-her2/",
      "Title": "Molecular Profiling for MBC HER2+"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello Joyce, While there is plenty of information to be found in the Experts by Experience pdf, you may want to ask your question in the TMJ Cafe community, where you can find more specific information about TMJ. You can get started using the link below: https://www.inspire.com/groups/tmjcafe/discussion/create/ Alternatively, you can see other posts in the TMJ Cafe community about OMFS: Search: OMFS Hope this helps! TeamInspire",
      "MessageIndex": 5,
      "PostDate": "25/04/2019",
      "ThreadURL": "https://www.inspire.com/m/Brian/journal/experts-by-experience-2018-patient-stories-that-teach/?group_id=200055",
      "Title": "Experts by Experience 2018: Patient stories that teach"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Judy, You can read the compilation in its entirety here: https://corp.inspire.com/resource/experts-by-experience-patient-stories-tha t-teach We hope this helps! TeamInspire",
      "MessageIndex": 2,
      "PostDate": "24/04/2019",
      "ThreadURL": "https://www.inspire.com/m/Brian/journal/experts-by-experience-2018-patient-stories-that-teach/?group_id=200055",
      "Title": "Experts by Experience 2018: Patient stories that teach"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Greetings! We want to share how much everyone at Inspire appreciates the wisdom, warmth, and generosity that you bring as a member of this community. We've put together a short video featuring some of us to show our thanks to you all. Please check it out! Wishing you a joyous holiday season and a happy New Year! Together we're better, -TeamInspire",
      "MessageIndex": 0,
      "PostDate": "20/12/2018",
      "ThreadURL": "https://www.inspire.com/m/TeamInspire/journal/happy-holidays-and-thank-you-from-inspire-qsonuq/?group_id=200055",
      "Title": "Happy Holidays and thank you, from Inspire!"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello, thisishard, This post was shared in 177 different health communities on Inspire, including the National Osteoporosis Foundation community. Therefore, there may be members from all or some of those communities replying to this discussion. If you need further information in regards to this, please let us know via email at team@inspire.com, via private message or by using the Help link. We hope this helps! TeamInspire",
      "MessageIndex": 19,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-the-little-voice-in-my-head-escaping-my-biggest-enemy/?group_id=200055",
      "Title": "New column: \"The Little Voice in my Head – Escaping My Biggest Enemy\""
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello bmcgurr, Welcome to Inspire! We encourage you to check other discussions on Inspire about malignant ascites from MBC and malignant ascites from metastatic breast cancer. You can start by typing your search terms in the box near the magnifying glass at the top-right side of the page or by clicking the link below. Search: Malignant Ascites from MBC Search: Malignant Ascites from Metastatic Breast Cancer You may also want to ask your question in our Advanced Breast Cancer community. It is specifically for breast cancer and has over 28,813 members. You can read more by clicking the link below. Advanced Breast Cancer Community We hope this helps! -TeamInspire",
      "MessageIndex": 1,
      "PostDate": "28/09/2018",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/malignant-ascites-from-mbc/",
      "Title": "Malignant ascites from MBC"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Givemejoy, You may need to wait a few seconds for the page to load. If you wait longer than, say, 15 seconds, please let us know along with what type of device you are using to access the page and what browser as well. Thank you! TeamInspire",
      "MessageIndex": 7,
      "PostDate": "23/03/2018",
      "ThreadURL": "https://www.inspire.com/m/Radha_Inspire/journal/you-made-an-inspire-glossary/?group_id=200055",
      "Title": "YOU made an Inspire glossary!"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello msp7777, Welcome to Inspire! We understand how hard this can be and we thank you for reaching out! We encourage you to also explore other discussions about leptomeningeal carcinoma and methotrexate cancer fatigue, both in this community and from members across all Inspire communities. You can start by typing your search terms in the box near the magnifying glass at the top, right-side of the page, then select \"All Communities\" from the drop-down on the following page. You can also click the links below. Search Inspire: Leptomeningeal Carcinoma Search Inspire: Methotrexate Cancer Fatigue You may also be interested in checking out and asking your question in our Advanced Breast Cancer community. This community is also for support of those whose lives have been affected by advanced or progressive breast cancer, with over 29,000 members discussing breast cancer with leptomeningeal involvement. You can read more at the link below. Inspire Community: Advanced Breast Cancer We hope this helps and we wish you and your mom the very best! - TeamInspire",
      "MessageIndex": 1,
      "PostDate": "12/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/tnbc-to-lepto/",
      "Title": "Tnbc to lepto"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello Ljones-1, Thank you for reaching out! We encourage you to check other discussions on Inspire about Herceptin and Itching. You can start by typing your search terms in the box near the magnifying glass at the top-right side of the page or by clicking the link below. Search: Herceptin and Itching You may also want to ask your question in our Advanced Breast Cancer community. It is also for breast cancer support with over 28,500 members discussing issues such as medication side effects. You can read more at the link below. https://www.inspire.com/groups/advanced-breast-cancer/ We hope this helps! -TeamInspire",
      "MessageIndex": 1,
      "PostDate": "08/08/2018",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/herceptin-and-itching/",
      "Title": "Herceptin and itching"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello Hunt007, Welcome to Inspire! If you do not receive more replies, please check other discussions about exploring treatment options and patient education in this community. You can see more discussions by typing your search terms in the box near the magnifying glass at the top-right side of the page or by clicking the links below. https://www.inspire.com/search/?group_id=200055&sec=all&query=tr... https://www.inspire.com/search/?group_id=200055&sec=all&query=pa... We hope this helps! -TeamInspire",
      "MessageIndex": 1,
      "PostDate": "04/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/help-i-need-feedback/",
      "Title": "Help I need Feedback!"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello Allison, Welcome to Inspire and thank you for reaching out! We also encourage you to explore other discussions both in this community, and from members across all Inspire communities, sharing their experiences with CMF Chemo therapy. You can start by typing your search terms in the box near the magnifying glass at the top, right-side of the page, then select \"All Communities\" from the drop-down on the following page. You can also click the links below. Search Breast Cancer: CMF Chemo Search Inspire: CMF Chemo We hope this helps and hope that you continue to share your findings and progress. We wish you the very best! -TeamInspire",
      "MessageIndex": 1,
      "PostDate": "30/03/2019",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/cmf-chemo-experiences/",
      "Title": "CMF Chemo Experiences"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello Gardenmint, Welcome to Inspire! We encourage you to check other discussions in this community about back spasms. You can start by typing your search terms in the box near the magnifying glass at the top-right side of the page or by clicking the link below. Search: Back Spasms We hope this helps! -TeamInspire",
      "MessageIndex": 1,
      "PostDate": "19/05/2019",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/lower-back-spasms/",
      "Title": "Lower back spasms"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Greetings! Inspire’s Research Team recently completed a project exploring diversity in clinical trials. Research Manager Marina Shayevich presented the results during a webinar and the team would like to share more details about the research with the community! You may listen to a recording of the presentation here: Inspire members who indicated an interest in breast cancer were invited to participate in this project and lend their insights about clinical trial perceptions, understanding, and decision-making. The research team interviewed thirty people by phone - 15 patients and 15 caregivers. Among the key findings: Patients and caregivers who identify as non-Caucasian struggle to trust medical care teams. Care coordination and support services were an unmet need for all participants. Transparency from physicians is critical for fostering trust. Patients said they would appreciate advice on how diet and exercise can support a healthy lifestyle as part of a holistic treatment plan. Patients and caregivers said they would like more information about clinical trial options sooner in the treatment journey. These findings may be used to help design clinical trials in the future. The Research Team collaborated with a sponsoring partner for this project and, per the contract, both the partner and the participants remain anonymous from each other. Many thanks to the participants for their insights and to those who expressed interest in participating. If you have further questions, feedback, or would like to know more about being involved in research projects, please send a message to team@inspire.com. Sincerely, TeamInspire and the Research Team This content is for general informational purposes only and does not necessarily reflect the views and opinions of any organization or individual. The content should not be used as a substitute for professional medical advice, diagnoses, or treatment. Please consult your healthcare provider about any questions you may have regarding a medical condition.",
      "MessageIndex": 0,
      "PostDate": "05/03/2019",
      "ThreadURL": "https://www.inspire.com/m/TeamInspire/journal/webinar-inspire-member-perspectives-on-diversity-in-clinical-trials/?group_id=200055",
      "Title": "Webinar: Inspire member perspectives on diversity in clinical trials"
    },
    {
      "AuthorID": "TeamInspire",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/TeamInspire/",
      "Content": "Hello Meena, Welcome to Inspire! We understand how hard this is and we thank you for reaching out. You may also want to ask your question in our advanced breast cancer community. It is also for the support of breast cancer patients, with over 29,000 members discussing treatment options, resistance, and more. You can explore this community at the link below. Inspire Community: Advanced Breast Cancer We hope this helps and we wish you and your sister the very best! -TeamInspire",
      "MessageIndex": 1,
      "PostDate": "27/12/2018",
      "ThreadURL": "https://www.inspire.com/groups/breast-cancer/discussion/recurrence-on-chemo-mbc-how-to-manage-stage-4-for-maximum-survival/",
      "Title": "Recurrence on chemo mbc how to manage stage 4 for maximum survival"
    }
  ]
}