{
  "AuthorID": "Tony121",
  "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Tony121/",
  "Posts": [
    {
      "AuthorID": "Tony121",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Tony121/",
      "Content": "Very kind of you to offer answered questions for caregivers on dementia. I'm sure many have many questions that need answers as it is a complicated disease and very difficult burden for family members to bear. Blessings!",
      "MessageIndex": 15,
      "PostDate": "07/08/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-the-little-voice-in-my-head-escaping-my-biggest-enemy/?group_id=200055",
      "Title": "New column: \"The Little Voice in my Head – Escaping My Biggest Enemy\""
    },
    {
      "AuthorID": "Tony121",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Tony121/",
      "Content": "I commend Alisha Bridges on her article on psoriasis and often feel that way about my bipolar II myself. Your illness does not define you. Your strength and courage does. Thank God for the strength and courage she has found to face her struggles with psoriasis, as I have with bipolar II, and be an advocate for it! You go girl!",
      "MessageIndex": 11,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-the-little-voice-in-my-head-escaping-my-biggest-enemy/?group_id=200055",
      "Title": "New column: \"The Little Voice in my Head – Escaping My Biggest Enemy\""
    },
    {
      "AuthorID": "Tony121",
      "AuthorURL": "https://www.inspire.comhttps://www.inspire.com/m/Tony121/",
      "Content": "I commend Harriet Hodgson for her article on \"Nothing Days\" for caregivers. They need a day \"off\" from care-giving on a regular basis to do whatever makes them happy and to rejuvinate themselves. Of course, she says she still provides the basic care for her loved one, but takes some time for herself on that day. That is well-deserved and needed. Self-care is very important for caregivers if they are to survive in the long-haul mentally, emotionally, spiritually and physically. So, caregivers put a \"Nothing Day\" on the calendar, at least once a month and don't feel gui;ty about it. You've earned it! Take a little time out for yourself! and enjoy doing something just for YOU on that day!",
      "MessageIndex": 12,
      "PostDate": "06/08/2018",
      "ThreadURL": "https://www.inspire.com/m/JohnNovack/journal/new-column-the-little-voice-in-my-head-escaping-my-biggest-enemy/?group_id=200055",
      "Title": "New column: \"The Little Voice in my Head – Escaping My Biggest Enemy\""
    }
  ]
}