{
  "AuthorID": "06elise",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227650/profile",
  "Posts": [
    {
      "AuthorID": "06elise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227650/profile",
      "Content": "Jun 14, 2018 04:20AM 06elise wrote: Hi CLmommy. Just thought I'd chime in, since I also ran into shoulder issues after a BMX. Mine turned out to be a little bit of everything (a little arthritis, a little bursitis, a little tendonitis) combined with a lot of ligament damage. I was just glad it wasn't a metastasis!! The end result was what they called a frozen shoulder: fused ligaments in my left shoulder. They claim it occurs when you have an injury and then baby the muscles (favor the shoulder) until it \"heals\" into a fixed position... but I know that wasn't my case, since I was still doing post-surgical exercises 2-3 times weekly when it started. In either case, you're definitely on the right track! Exercise is the key! Just be aware which pains are the kind you should \"push through\" and the kind you should avoid",
      "MessageIndex": 5,
      "PostDate": "14/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/865082",
      "Title": "Shoulder problems post BMX? CLmommy CLmommy"
    },
    {
      "AuthorID": "06elise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227650/profile",
      "Content": "Feb 9, 2016 09:00AM 06elise wrote: I was just in the same boat as you and all the other wonderful ladies on this forum! My first chemo dose was yesterday, and I have to say that a certain level of calm took over as soon as I decided on an approach; In the mean time, the things that got me through that waiting period - and are still helping me deal with anxiety - were (1) the sheer number of people who approached me to say they were also survivors; some for 9-11 years! (2) hilarious and fanciful movies, and above all (3) faith. My doctors have treated hundreds of people in the same boat as mine, and there is something so *stable* about the thought of lashing my tippy canoe onto this",
      "MessageIndex": 16,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841145",
      "Title": "I am so scared please lift my spirits rosierosie Danni1016"
    },
    {
      "AuthorID": "06elise",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/227650/profile",
      "Content": "Feb 9, 2016 09:25AM 06elise wrote: Oh, how I can relate! I was just in the same boat as you and many of the other wonderful ladies on this forum! My first chemo dose was yesterday, and I have to say that a certain level of calm took over as soon as I decided upon an approach. (Neoadjuvant AC-THP, BMX with reconstruction, Herceptin for a full year; most of which I had never heard of before last month!) In the mean time, the things that have helped me deal with this anxiety the most are (1) the sheer number of people who have approached me to say they are also survivors; some for 9 years and longer! (2) hilarious and fanciful movies, and jokes and silliness, and above all (3) faith. My doctors have treated hundreds of people in the same boat as mine, and there is something so *stable* about the thought of securing my tippy canoe onto this huge flotilla... knowing they have all weathered this same storm... knowing the experience is not a new one for any of them...! Regarding expenses, I encourage you to speak with the financial resources at your hospital. They are quite possibly the only ones in the entire scheme of things who are more motivated than you(!) to find some form of insurance that will pay the full 100%. It's their livelihood after all. Mine found a cancer-specific form of Medicaid, for which I've just applied. (Medicaid can back-date coverage for up to 90 days. Cross fingers. Say a prayer.)",
      "MessageIndex": 18,
      "PostDate": "09/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/841145",
      "Title": "I am so scared please lift my spirits rosierosie Danni1016"
    }
  ]
}