{
  "AuthorID": "07rescue",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
  "Posts": [
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Feb 12, 2009 06:39AM 07rescue wrote: I get UTI's from chemo also. I cannot drink cranberry juice because it is extremely acidic and aggravates the heartburn from the chemo. Blueberry juice is almost as good at preventing UTI's as cranberry juice, and it is not acidic,so it is an excellent alternative. Drinking large amounts of water is essential, along with voiding urine early and often, so bacteria cannot build up in the bladder very long... ",
      "MessageIndex": 5,
      "PostDate": "12/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/728929",
      "Title": "UTI's ? MissyBraddy shelloz1"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Sep 26, 2009 12:14AM 07rescue wrote: I also had it last for about 2 months after Taxotere. It gradually became less severe as time wore on, then suddenly disappeared, thank goodness. My oncology nurse told me she had a patient who also had it as severe as I did, he had to have shunts put in because his eyes were so swollen the ducts became shut. There was nothing they could do to help him. I'm glad I survived it intact, and hope your's goes away very soon.",
      "MessageIndex": 2,
      "PostDate": "26/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/740970",
      "Title": "Eye watering from Taxotere trishK_ cowgill"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Jan 11, 2009 07:54AM 07rescue wrote: I believe there is a tremendous amount of judgement heaped on the word \"sickness\" in our society. It is as though if you are \"sick\" you are automatically considered a loser, or \"less than\" others, and you lose power and social stature because of it. I wonder whether there isn't still some significant puritanical blame ascribed to the ill, as though they somehow deserved their fate, and it was God's punishment. I wonder whether people in general don't have an almost instinctual fear and loathing for illness, especially illness which is ugly, or involves bad smells and body fluids, given that for hundreds of thousands of years infectious illness was the main cause of death in humans, and people survived longer if they shunned the sick, punishing them so that they left the community. I'm not sure it is that way in other cultures. Admittedly when people become ill they may become burdens to those around them, which can create some antipathy, but I feel the degree to which any form of neediness or dependency is looked down upon in western culture can be almost pathological in itself. It is certainly counterproductive. People shouldn't have to hide their medical conditions because they will lose their jobs or social standing if others find out. Yet that is how it is in many situations. I have worked in health care myself and it is essential for me to keep on top of all my attitudes, conscious and unconscious, toward the great diversity of people I encounter, all of whom I meet when they are \"sick\". Many feel terribly ashamed of being sick and needing care, and the last thing they need is a health care provider heaping more negativity on them. For everyone who needs care I want to be there for them, whether they regard themselves as \"sick\" and have internalized shame about it, or not. As a patient myself, I try to be very gentle about having illness and needing care, the same way I would treat a newly diagnosed cancer patient. I have always held those going through the challenge of illness in high regard, many are my greatest heros for how they have dealt, fought, and managed to live deeply satisfying and meaningful lives, whether they lived or eventually died. When I worked in hospice care we saw constantly how illness in people generated great hostility in many of those around them, especially when they were dying. It is very threatening and frightening for people to feel out of control, and one way to maintain a sense of control and personal safety is to lay blame and responsibility on the sick person. \"That won't happen to me because I do XYZ, and he or she did not...\" It can become very destructive to everyone involved. That is why I am very careful about not denigrating sick people in any way, and try my best to maintain compassion even in the face of a total loss of control.  Usually when I find myself feeling ashamed or guilty, if I look more deeply I find I am trying to control something that is beyond my ability to control, trying to feel more powerful than I actually am, and I need to let go. For me that now includes breast cancer. Those are just some of my thoughts after reading this thread. I know that many people find it empowering to feel they have \"cured\" their cancer, and see themselves as well. That is certainly a state of being that helps the immune system and spirit survive, no doubt. It can be very powerful to imagine ourselves healthy and well. But it isn't failure to get sick, or have a recurrence, either. Eventually we all die of something, and it behooves us to make peace with that somehow. For myself I like to focus on my inner wellness, the spiritual wholeness and growth, that lives on in defiance of any external illness, or outer circumstance, and makes me \"well\" in the largest sense of the word. That will be my measure of health even when my body turns to ashes.",
      "MessageIndex": 77,
      "PostDate": "11/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/725761",
      "Title": "Do you consider yourself sick? shockedat39 kmccraw423"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Feb 11, 2009 08:03PM 07rescue wrote: Hi Everyone Thanks for your kind comments! I'm afraid there are so many people participating in this thread that with my chemobrain I am failing to keep everyone's story straight enough to thank everyone individually. I'm still doing poorly with the kidney failure. It recovers a bit after going to get extra IV fluids at the cancer center, but afterward it keeps recurring and my digestive tract has been hit hard enough that I have not been able to keep enough fluid intake to get through without the IV fluid support. I was too weak and wobbly to get out of the house to a doctor appointment today, not a good sign. I might be able to manage a little better with changing my diet more, but need to find something besides baked potatoes to sustain me. I'm losing too much weight. This all goes to show that everyone is an individual when it comes to trying to predict how we will fare during chemotherapy. I wouldn't be doing this unless I genuinely believed it was necessary, so I am going to fight to stay with it. My oncologist is only a fellow, so he does not have the power to make the final decisions regarding my care, and has been doing his utmost to fight for my case with the attending doctors, so he is not to blame for this development. His recommendations are overruled by the doctors in charge. He respects my intellectual contributions to the management of my case. Sometimes doctors have to actually see the bad results before they can be persuaded that a departure from rigid protocol is required. In many ways, doctors are trained to act like sheep. They don't want their decisions to stand out in a crowd, they see safety from liability in rigidly adhering to what everyone else does, right or wrong in the individual case. We pay the price for that. I'm in for another round of invasive diagnostics, because my CEA (tumor marker) came back elevated, and we have to look for mets, or other cancer, now. I'm not looking forward to invasive procedures like the colonoscopy they want me to get within the next two weeks, especially while immune suppressed on chemo.  The last colonoscopy I had was excruciating, and there is always a risk of perforation, especially when your digestive tract is inflamed and fragile from the chemo. I need to think about this all very carefully. ",
      "MessageIndex": 1120,
      "PostDate": "11/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Jan 26, 2009 03:46AM 07rescue wrote: Hi everyone I started TCH (taxotere, carboplatin, Herceptin) x6 with Herceptin for a year. It's been 10 days since my first treatment. I think I'm kind of average in that the first week I felt pretty crummy, then started feeling human again around day 7. I can see I don't have my usual stamina. When I try to do my normal exercise routine I poop out very quickly, I've never pooped out quite so easily, even though I have been far sicker in my life with other chronic illness (endometriosis and rheumatoid arthritis). I would have to say that I have been much sicker and in much more pain before in my life, so chemo doesn't really frighten me in terms of the ill feelings it creates. I am worried about my marginal kidney and liver function from my other long term diseases making the chemo side effects worse, because my body won't be able to clear the toxic drugs as quickly as a healthy person's. I've been following everyone's advice and drinking a great deal of water to help my body flush them out. I think it's helping, although my nausea lasted for a good 7 days following the treatment. Patti, Alo, and Bev, I will be joining you on the shaving! ",
      "MessageIndex": 759,
      "PostDate": "26/01/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/725803",
      "Title": "Starting chemo January 2009? lisalisa ktym"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Feb 13, 2009 10:00PM 07rescue wrote: I did not go to MSK for two reasons:  Women in my support group who go there have been very unhappy with being treated like cattle, made to wait, and feeling like a number. Especially the women who have been going there for many years, and say it didn't used to be that way. When I called for a consultation I couldn't even get an appointment for over two months, as a Medicaid patient, an extraordinarily long wait time for a newly diagnosed breast cancer patient. Others with private insurance that pays better did not have that long wait for an initial consult.  Of course I cannot determine for a fact that the long wait I would have been subjected to was directly related to my insurance status, or was a misfortune of timing. It did have to effect of discouraging me from pursuing treatment there. Many institutions have a selection of ways to discourage low reimbursement patients from attending their services. I hope you will send them feedback about how you were treated. They need to hear how their reputation on the ground is being affected. ",
      "MessageIndex": 5,
      "PostDate": "13/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/729028",
      "Title": "Sloan-Kettering KATIEKAY Hortense"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Nov 28, 2008 06:35AM 07rescue wrote: I was a licensed massage therapist and instructor at a famous massage school for over 25 years, and took a long, intense, and expensive course to learn the proper techniques for lymphatic drainage for many types of pathology, including cancer and HIV/AIDS. It is a very gentle, subtle therapy, because lymphatic vessels are small, fragile, and easily overwhelmed with fluid burden if not approached with the correct technique. I use this technique on my own arm, chest, etc, and I find it gently coaxes fluid to move, and is very relieving. I am not sure how much I would trust someone new to work on me, but I would trust someone I already had a relationship with. I think it may be difficult to trust someone new with newly traumatized tissue. The one most important idea I can offer you is that you are completely in charge of your massage treatment, and at every moment can expect the therapist to completely respect your concerns and apply any treatment you give permission for with sensitivity. All massage students are trained to completely respect their clients boundaries. In fact that empowerment of the client is seen as one of the essential healing therapeutics, especially with abused and traumatized patients. You are completely in charge, and we strive to make your treatment one place where you can feel completely safe and nurtured. As in any other field, there are better and worse massage therapists, so your best bet is to get recommendations from others you respect, and make certain your therapist is trained and licensed at an accredited school. Intuition and talent go far, but do not substitute for real knowledge, supervised and mastered skill, and the cumulative clinical wisdom that is now available in the massage therapy field. Avoid those who have not been trained and do not appreciate how much important information on contraindications and special therapeutics they do not know. A good therapist can make an important difference in quality of life.",
      "MessageIndex": 2,
      "PostDate": "28/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/725094",
      "Title": "Can massage CAUSE LE? kerry_lamb 07rescue"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Mar 10, 2009 12:32PM 07rescue wrote: Ginseng doesn't contain estrogens, but it does have some estrogenic activity associated with the ginsenosides it contains, which bind competitively with estradiol at the estrogen receptor. Some of the ginsenosides may have anticancer effects, which have been observed in \"test tube\" studies. No studies have been done in mammals or people yet, so the jury is still very much out, as it is with soy products. It may retard or prevent cancer, or it may stimulate it's growth, we don't know yet.",
      "MessageIndex": 4,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730439",
      "Title": "Ginseng for fatigue gracem 07rescue"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Mar 12, 2009 12:27AM 07rescue wrote: My breast cancer was completely covered in dense fibrous tissue, which is very common, because dense breast tissue confers a much higher risk of breast cancer than normal tissue. Doctors are right to view it with more suspicion. Initially mine was pronounced \"benign\" after palpation by the first breast surgeon I saw, who said it was a fibroadenoma. I insisted on a biopsy, and it came back positive for a highly aggressive, necrotic, HER2 +++ cancer. A mammogram earlier this year didn't pick it up at all, so there was no warning. Perhaps your surgeon was using an abundance of caution when removing your lesion, but it might have looked very suspicious to him. Too often it is just impossible to tell until the doctor is actually inside the breast, when they have to use their best judgement as to what to remove. I hope you can receive some excellent plastic surgery to repair your surgical wound, but I am very glad your lesion was benign. When I went for my mastectomies I specifically instructed my surgeon that I wanted wide margins, to cut deeply, and not be afraid to take too much. In fact, I told her to \"Please err on the side of taking too much, rather than too little\" because I know they have to make an educated guess once they have you open on the table, when you are not available to ask.  It can be really terrifying to undergo these procedures on such a personal part of your body, and to find out later that the lesion was benign must be a very painful process for you. I hope you can find some peace around this painful event. I would like to offer that the doctor may have been acting from the best of intentions on your behalf. I don't know whether that helps, or just seems horribly undermining for your perfectly justified anger and upset at this outcome. Many doctors see young people die from unstoppable cancer, and that makes a deep impression on them. It may make them less sensitive to the emotional losses that disfigurement can create, especially for younger people, while they have more life saving issues at the forefront of their concerns. When they take too much tissue and it turns out to be benign, they do need to be made aware of what a huge impact this can make on someone's life, this awareness can help make them a better doctor. Again, I hope you will find real peace over time, and I hope the discussion with your surgeon goes well. ",
      "MessageIndex": 7,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/730559",
      "Title": "Did my doctor butcher me/screw up? FREAKING OUT! sueelizabeth676 sueelizabeth676"
    },
    {
      "AuthorID": "07rescue",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/73491/profile",
      "Content": "Nov 23, 2008 10:13PM 07rescue wrote: Hi Wbts, I'm so sorry you are going through this pain and fear. I hope you don't have anything serious going on, but of course no one can say for sure until you have it checked out. There are benign causes for your symptoms, to be sure. Have you ever had am inflamed or infected cyst before? Those are common and can be very troublesome, and would cause your lymph nodes to react on only that one affected side. Please let us know what your doctor finds out tomorrow, and try not to make yourself too miserable with anxiety until then. I've been through many cancer scares in the past, and know how awful it is to wait for answers. You are not alone.",
      "MessageIndex": 5,
      "PostDate": "23/11/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/724901",
      "Title": "lymph node enlargement on left side with pain in left breast wbts crasylaidy"
    }
  ]
}