{
  "AuthorID": "12paws",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252853/profile",
  "Posts": [
    {
      "AuthorID": "12paws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252853/profile",
      "Content": "Jun 2, 2017 01:11AM 12paws wrote: I went through US security the other week with a close fitting thin beanie on and did not have to take it off, nor have any trouble re looking different to my passport photo. I told the security person I had no hair and asked if I could not remove my hat and they were fine with it. You are not being whiny at all. It's bloody awful this hair business. I totally understand. I'm consumed by my lack of hair and it's ruining my days. I just want it to be over too.",
      "MessageIndex": 25398,
      "PostDate": "02/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "12paws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252853/profile",
      "Content": "Jun 19, 2017 02:11AM 12paws wrote: I'm posting this update as information for those that will come after me. I had AC then weekly taxol. My hair started growing back so well on taxol I thought I'd be wig free soon after finishing it. When my hair started coming out about two weeks after I finished, and kept thinning for about three weeks I was devastated, and left looking like a man with a very receding hairline. I am now about 6 and 1/2 weeks post taxol and I can see lots of tiny fine micro hairs starting to come through on my head. I also have the beginnings of eyebrows after pretty much losing them all about 4 weeks after taxol ended. So despite my terror it looks like it is coming back (fingers crossed) and all that talk about 'it takes time' and 'everyone is different' ( which is the last thing I want to hear!) seems to be true for me at least. Mind you it still can't grow quick enough. Best wishes to you all out there",
      "MessageIndex": 25448,
      "PostDate": "19/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "12paws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252853/profile",
      "Content": "Jun 5, 2017 11:40PM 12paws wrote: Cancer is a blessing seq24? OMG I would have exploded",
      "MessageIndex": 25413,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "12paws",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/252853/profile",
      "Content": "Jun 5, 2017 03:41AM - edited Jun 5, 2017 03:43AM by 12paws Drained I feel exactly like you do. I am only 4 weeks after my last taxol, however my hair started coming through early on with the Taxol. It's pretty thick everywhere except the front and top of my head. I look like I have a badly receding hairline. I so thought I'd be wig free by now and I'm devastated I am not. It is worse than the surgery and all the chemo. Medication helps all the physical side effects of chemo but nothing can help this. I'm sorry I am not offering words of wisdom or encouragement but at least know you are not alone. My Physio who specialises in lymphodema and so sees lots of ladies like us tells me she sees this pattern of regrowth all the time and it always comes back, eventually.",
      "MessageIndex": 25409,
      "PostDate": "05/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    }
  ]
}