{
  "AuthorID": "19501952",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
  "Posts": [
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "May 30, 2018 09:11AM - edited May 30, 2018 09:13AM by 19501952 Hi Everybody. I started radiation on5/7 and I've had 16 of 21treatments. Has anyone had nausea? My RO says radiation doesn't cause nausea and so did his nurse. I've had it since Friday. On and off but different than chemo nausea. Just curious if anyone else has this. Thanks, Kate  ",
      "MessageIndex": 309,
      "PostDate": "30/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863514",
      "Title": "April 2018- Starting Radiation LiMa66 PrincessButtercup"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Mar 30, 2018 07:56PM 19501952 wrote: Hi Everyone, I have my 8th and final CMF infusion on April 9 th and I’m seeing my RO on April 12th. I’m told I will begin radiation at the end of April, beginning of May. I’m going to have 16 treatments. I don’t have much detail about what exactly will happen. I’m going to be happy to leave the chemo pods and I’m looking forward to getting radiation done and over. When I was first diagnosed way back in September the plan was lumpectomy and radiation but my oncotype score of 26 changed that plan. I’m glad I found this group. Good luck to all of us. Kate",
      "MessageIndex": 24,
      "PostDate": "30/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/863514",
      "Title": "April 2018- Starting Radiation LiMa66 PrincessButtercup"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 5, 2017 06:49PM 19501952 wrote: Hi MeMyself17 chemo went fine. I feel a little light headed or just weird headed but otherwise fine. Actually I think I do have a headache now. I’ve been drinking water, milk, juice,flavored water. I have had more water than I’ve ever had. I’m thinking right now that I’ll go to work tomorrow but I’ll see how I feel. Did you have radiation after chemo? I’ll be getting 16 treatments after chemo. Kate ",
      "MessageIndex": 5,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 8, 2017 05:41AM 19501952 wrote: hi AnotherNYCG, Side effects have not been too bad. I stayed home day after treatment and went to work yesterday. Constipation seems to be my biggest problem right now. I took a ducolax last night and this morning and so far no result. I’ll be staying home this morning until something happens! I really appreciate you sharing your experience with CMF. The first day I was foggy headed and felt congested. My oncologist said I didn’t need nuelasta yet and that we would see how my blood work looks on 12/15. Hope you are well and your day is a good one. Kat",
      "MessageIndex": 8,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 23, 2018 03:31PM 19501952 wrote: Thanks Windward, I really appreciate the hints. I couldn’t have my 3rd infusion on 1/9 because my wbc was 1.79. My oncologist ordered a nuelasta injection and I spent most of the week feeling like I had the flu or a cold but no bone pain. Yesterday, 1/22 my wbc was 5.7 so I received the infusion and other than a headache and hoarseness I’m feeling ok. Just a little jumpy stomach. I got a nuelasta on pro placed and it should go off at 5:40 today. I’m trying to drink as much as I can and sometimes I just hate the thought but know I have to do it. I’m 65, and the other board I follow is starting chemo Nov 2017. Many of the gals are young, none are on CMF. But many are taking the same meds I have for nausea and reflux. I used senekot S and that has really helped. When chemo is over I’ll have 16 radiation treatments. I guess the question I’d really like to ask is how are you doing now? Any lasting side effects, chemo brain, or any of the other awful things we worry about. I’m worried about the chemo brain combined with my 65 year old brain. And, of course, does CMF really work. My oncotype score was 26, which even surprised my oncologist and she felt with CMF I had the best chance for a cure. I never hesitated with the decision. Thanks again, Kate     ",
      "MessageIndex": 14,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Apr 1, 2018 03:19PM 19501952 wrote: Hi Maggie2, After 7 CMF infusions I have only had slight thinning of my hair. No one has noticed. I have lost hair on my legs, and that’s about it. When I started CMF my oncologist said she doubted I would lose my hair and she was right. She did warn me not to color my hair until I’m passed chemo because it would stress my hair. I have not done cold capping. My oncologist also told me CMF is known to cause people to gain weight. I’ve gained weight since December. The combination of chemo, steroids and sitting around. My closest friends, co- workers, family all know I’m receiving treatment for breast cancer but many, many people I have daily contact with don’t know. I don’t think I really look much different and I guess no one else thinks I look different either. If you read back through posts no one has mentioned a lot of hair loss with CMF. Happy East! Our snow is almost gone but it was too wet for the Easter bunny to hide eggs in the yard so we had an indoor Easter egg hunt. It was fun. Good luck to you and everyone else. Keep posting your experiences. We all learn from each other. Kate",
      "MessageIndex": 42,
      "PostDate": "01/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Apr 11, 2018 04:39AM 19501952 wrote: Hi Everyone, I hope all of you are getting through treatment with minimal side effects. I had my eighth and final treatment on Monday, 4/9. I’m happy to be done. It felt like forever. My stomach is jumpy and reflux is the worst ever but I know I can get through these next days knowing I won’t be facing chemo in 2 weeks. I see my RO tomorrow for mapping, etc. in three weeks I see my oncologist who will clear me for radiation. My oncologist told me to stay out of the sun this summer. My eyebrows seem to be thinning and my arms and legs have no hair but I’ve only had minimal hair thinning. I definitely have some chemo brain and blurry vision which my oncologist said would diminish over the next few months. Good luck to everyone. I’ll keep you posted on radiation experience. Kate",
      "MessageIndex": 46,
      "PostDate": "11/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jun 10, 2018 06:34PM 19501952 wrote: Hi RiRi11, I had my first CMF infusion on 12/5. I had a sinus pressure feeling and felt fuzzy headed. I probably could have driven myself home but I’m happy I didn’t have to drive. The infusion took about an hour and a half. Some of the earlier posts on this page will give you more information. I kept a log of how I felt, what I did and drank, etc. Everyone experiences chemo a little differently. My main complaint was constipation, solved by miralax and senakot, and a jumpy burping feeling in my stomach solved by nothing. I kept my hair, gained about 15 lbs.(thank you steroids) and never had diarrhea. So all and all not bad but when you are going through treatment it’s all a little scary. I wish I could have read everything written on this thread before and during chemo. There was no CMF thread so I started this one. There are lots of good people here all at different stages of chemo and treatment so ask any questions you think of. Good luck tomorrow. Kate",
      "MessageIndex": 77,
      "PostDate": "10/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 93,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 124,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Aug 18, 2018 09:55AM 19501952 wrote: Hi Nocyart, That’s great! So far so good. Not everyone has all the side effects we r warned of. Sounds like you are doing the right things to ward them off. If you start to experience any signs of constipation try the miralax and Senakot S. Once I discovered this regime I took them regularly for the days after chemo and that issue completely resolved. When the nuelasta does inject you will feel nothing and only hear a faint clicking. Good luck! Kate",
      "MessageIndex": 154,
      "PostDate": "18/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Nov 27, 2018 01:16PM 19501952 wrote: Hi All, I’m so happy all of you have found this group and you are getting support and information from each other. When I started CMF last fall I found so little information and I was still in shock. Little by little others joined this group and although I haven’t posted in a long time I still follow everyone. My 8 CMF treatments ended on April 8, 2018 and I finished radiation June 5th. I had the nuelasta onpro and regained my white blood cells by the next chemo. In July I developed a seroma after radiation. A seroma is a pocket of fluid that can develop and often resolves on its own. Mine needed to be drained a few times and finally surgically drained and debrided. I’m told I had a 1 1/2 -2 inch open area that required twice daily packing. I say I’m told because I never looked at it and once I could shower I showered with my eyes closed. My best friend who did the packing and the dressing kindly provided no description but she faithfully took a daily picture to track my progress and determine day to day if it was really getting better. Finally by mid September it began to rapidly heal and by mid October had resolved. At this point I feel great and go for my first ultrasound and mammogram in Mid December. At my oncologists urging I had genetic testing due to my dad having stomach cancer and all 9..of his sibblings as well. My testing came back showing the ATM gene which is linked to pancreatic cancer so in January I will have an endoscopy and alternate with MRI every other year. I hope your take away after reading this will be that in spite of the seroma and the concern over the genetic test I feel great and I survived my first year after diagnosis feeling like I am back to normal. We will all keep worrying when treatment is over but at least I’ve got a target to keep checking. I’ll report back regarding the endoscopy and the mammogram, and I’ll let you know if I ever get brave enough to look at those pictures of my seroma Best to all, Kate",
      "MessageIndex": 233,
      "PostDate": "27/11/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "May 8, 2019 05:16AM 19501952 wrote: Hi Joyce65, I ended 8 rounds of CMF last April. I think knowing chemo was over gave me such peace my overall recovery from chemo to a state of feeling well and optimistic was around 3-4 weeks later. Unlike lots of you I am not particularly into exercise routines or supplements, acupuncture or message. Maybe that stuff will help you feel better sooner than me. I can tell you this though, at the one year mark of the completion of chemo I’m back to mowing our very large complicated lawn by hand, carrying 40 lb salt bags, and I’m the one that carries the heavy groceries from the car into the house. If you told me a year ago that I would be doing the stuff I’m doing now I’m not sure I would have believed it. So......hang in there, look forward to your life after chemo and stay positive. Best to all Kate",
      "MessageIndex": 317,
      "PostDate": "08/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 27, 2018 09:40AM 19501952 wrote: Hi Windward. I agree this is the best way to communicate. I hope my response wasn’t lost. I don’t see it here. If it doesn’t show up I’ll do a rewrite later today. Kate",
      "MessageIndex": 16,
      "PostDate": "27/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 13, 2018 06:13PM 19501952 wrote: Hi Dagny, Welcome to this (small) group. I’m 65, my oncotype score was 26; and Istarted my Chemo 12/5/17. I don’t have any underlying conditions, but I did have a couple vices. Drinking a beer or two a day, and smoking. My oncologist made it very clear that I needed to limit myself to 1 drink per week which we negotiated to a few a week and to stop smoking. I don’t smoke much. Less than a pack a week. Initially I started on an every 3 week schedule without nuelasta. Then when my white blood count got critically low my oncologist gave me a nuelasta injection and set a new infusion #3 date of 1/22/18. By 1/22 my counts were great and I received a nuelasta pod after that infusion. A little heads up about that. It worked flawlessly and after it was placed I never felt a thing, but that happy lady in the commercials obviously wasn’t filmed when it was placed. Two minutes after it’s placed you’ll feel a BIG prick and I wasn’t prepared for that. It subsides immediately but it was quite startling. Here is what I learned. Take Claritin a couple days before nuelasta pod and a few days after. People have felt bone pain but I have not had that problem. Claritin is an antihistamine and some magic happens and it helps curb bone pain. The drugs are constipating. It took me a few treatments to realize I needed a better bowel management routine. I take a dose of miralax morning and nite and two senakot S at night. I started 2 days before chemo #3 and #4 and it kept constipation to a minimum. The anti nausea drugs and steroids are also constipating but absolutely take them as instructed and hopefully a bowel management protocol (mine or something your oncologist recommends) will prevent constipation. Get a variety of your favorite drinks, juice, water, flavored water, ice tea, lemonade and some popsicles. You need to drink about 2 quarts of water, etc each day starting a few days before your first infusion. I say get a variety of stuff to drink because even if you love ice tea you will get tired of the same drink. I’m much happier alternating what I drink. I have never been a big water drinker and there are days where I look at a glass of lemonade and want to throw it across the room. Once this is over I plan on consuming less fluid but you want to stay hydrated and my oncologist said make half of your fluid water and half other stuff. The popsicles come in handy when no other drinks sound good. If you are hydrated your veins are plumper and easier to start the infusion. Bring a little blanket or sweatshirt or sweater in case you are cold and ask for a heated blanket. It’s comforting to be warm. If something doesn’t feel right once the infusion starts make sure you tell the nurse. The first infusion you have they will probably tell you exactly what they are doing and how it will feel. It shouldn’t hurt, it shouldn’t burn or sting, and if you start to get a slight headache tell the nurse. Sometimes they have to slow the infusion. My total infusion time is about 1 1/4 hours. It’s pretty quick compared to other chemo. The drugs that are in a syringe and go in via your IV are timed and injected slowly. By that I mean 5-7 minutes each. Bring some water to drink, a snack, gum or hard candy. It will give you something to do. Lots of people bring their iPads, books, or magazines. When the infusion is over it will beep and you’ll be unhooked. I probably could drive to and from chemo but I have a friend who comes with me and does the driving. Usually the day of chemo I feel pretty good and the day after but about day 3-6 I am tired but able to work. If your blood count is low you will feel extremely tired and you need to rest and stay away from people or wear a mask. If you can plan chemo on a Thursday you will have the weekend to relax. Sometimes that’s not possible. My major complaints (aboutCMF) are all the people who will tell you how easy it is because sometimes it isn’t easy. The constipation was concerning until I got on the right pre chemo and post chemo routine of miralax and Senakot S. I hate all the fluid but that’s just me. I have had an ongoing jumpy feeling in my stomach causing me to burp often. It’s annoying. I never had reflux but I do now and I’m taking ranitidine for it 2xs a day. I have not lost my appetite, I have not been nauseas to the point of vomiting, and I have not had diarrhea. I do have general fatigue and by the end of the work day I’m ready to put on my pjs. I’m sorry you are doing this alone and I would be happy to support you any way I can. I’d also suggest you do some shopping and get things in your house that are easy to prepare and handy. I have not lost my appetite no matter how jumpy my stomach has felt. In fact my oncologist said CMF actually can increase your weight. I’m living proof, but it might be the cookies and root beer floats. Good luck to you. Let me know if you have any questions about anything. I have found the groups here to be very supportive and the search feature will point you to lots of information. Best to you, Kate      ",
      "MessageIndex": 18,
      "PostDate": "13/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 26, 2018 07:16AM 19501952 wrote: Hi Shell07, I haven’t had any diarrhea, but like you, I’m prepared for that. I’ve never had any issues with vomiting, just a nauseas feeling from the reflux, burping, and all of the water drinking. The first two chemos I had were spaced 3 weeks apart with the plan to go e/o week depending on my response. My white blood count has dropped by the 7-8th day after chemo and I got a shot of nuelasta 8 days after my blood work showed the low wbc. My oncologist scheduled chemo #3 for a week later and my counts were great. I had the nuelasta onpro placed after chemo #3 and I also had it after chemo #4 and #5. Getting it after each chemo should keep your counts from going low and staying low. Now my chemos will continue every two weeks until I complete chemo #8. Following chemo and about 30 days in between I will begin 16 radiation treatments. A lot of people have had bone pain from the nuelasta and suggest taking Claritin a few days before chemo and a few days after. I’ve done that and I haven’t had any bone pain. The nuelasta stimulates your immune system which creates histamines. The Claritin is an antihistamine and will prevent bone pain. Don’t take the Claritin D. Just take the regular Claritin. One more thing about the nuelasta. If you’ve seen the commercials of the lady and her husband so happy she has the onpro I think they should show you the look on her face when the onpro sticks her in the arm 2-3 minutes after its put in place. I think knowing I will be stuck by a tiny tiny needle in 3 minutes makes me overly sensitive and each time the shock of it has almost made me jump out of the chair. It really doesn’t hurt but it does startle you. That’s the only prick you will feel. When it starts injecting the nuelasta 27 hours later you don’t feel a thing. Drink, drink, drink as much as you can. Best of luck. You will be fine. Ask any questions you think of. One last thing. Start a daily log book and write down what meds you take,what you drink, and if you poop and how you feel. I look back on it all the time and it helps me to know if I felt well enough to go to work, or if I spent the day on the couch. Good luck, Kate ",
      "MessageIndex": 22,
      "PostDate": "26/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Mar 28, 2018 04:55PM 19501952 wrote: Hi 2002chickadee, Welcome to this group. I started CMF on 12/5/17. I had 2 infusions 3 weeks apart then I began getting an infusion every 2 weeks with nuelasta. I had chemo #7 yesterday! Chemo #8 is scheduled for April 9th then I will have 16 radiation treatments. A couple times I’ve had to have 3 weeks between treatments after starting the every two week schedule. Once, because my white blood count was too low and once because I caught a 24 hour bug and got dehydrated the day before treatment. When I started treatment I was really worried about everything. Would I get sick, would I lose my hair, would I be too sick to work, would I get constipated. But my major issue in the beginning was constipation which was solved with miralax am/pm the day of treatment and for about 3 days after and 2 senakot S every morning. I didn’t come up with this strategy right away. It took a couple treatments for me to realize I needed to start taking something before treatment and a few days after. My stomach has been upset and jumpy since I started treatment. Not real nausea tho. My hair might be slightly thinner. I have kept a daily log of how I’ve felt each day and it helps to look back and see how each treatment has effected me and there is nothing really predictable about treatment in terms of when fatigue will strike which is often out of nowhere with a two week schedule I am barely recovered from treatment if I had it to do over I think I’d go with the every three weeks By the time you get to your third treatment I think u will feel more in control of what’s happening and what to expect. I have not experienced much dizziness. I would call it unsteadiness if I move too quickly. Having a variety of favorite drinks is helpful for me. I hate drinking water but I have gotten better at it. I have some sort of drink in front of me every waking hour. If you get a chance read back on this thread and there may be something helpful there. My oncologist has ordered something new to try and combat my jumpy stomach. She thinks a liter of fluid the day after treatment will help. I had my first one today. We will see because nothing I’ve taken has helped with that. I’m wishing you the best. You might also want to look and see if anyone started a group of people starting chemo in March or April 2018. They might not be on CMF but the day to day thoughts, experiences, etc I have found helpful. On the days I feel pretty awful and sick of this whole thing I can always find someone who feels the same way or worse. Somehow that’s helped me. Ask any question you have. Good luck, Kate     ",
      "MessageIndex": 37,
      "PostDate": "28/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Apr 18, 2018 03:58PM 19501952 wrote: Good luck Maggie2 ",
      "MessageIndex": 50,
      "PostDate": "18/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jul 16, 2018 07:24PM 19501952 wrote: Hi All, Hang in there everybody. This will end and you’ll be on the other side of it. I know it doesn’t seem like it. I sure didn’t feel it and by my last treatments I just felt so tired and like my stomach would never be the same, but you really will start to feel better about 2-3 weeks after your last treatment. Kat",
      "MessageIndex": 121,
      "PostDate": "16/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jul 24, 2018 10:01PM 19501952 wrote: Thanks for posting Goodwit. Good luck with surgery. It’s very encouraging to hear that CMF was so effective in 1998 until now. Please keep us up to date on how your surgery goes and how you do with treatment. Wishing you the best results, Kate",
      "MessageIndex": 132,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 279,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 5, 2018 07:59PM 19501952 wrote: hi all, Pictures of my Snowflake in her new coat, red rubber booties and purple gators.  January 9th is a popular date for 3rd rounds. If my blood work is ok on January 8th and my oncologist gives me the go ahead I will have my third round of CMF and go to an every other week schedule. I’ll have 8 treatments and the 16 radiation treatments. I’m a little worried about going e/o week but it will really cut down the time. Hopefully my body will tolerate it well. Does anyone take miralax prior to chemo? The ducolox works eventually and someone mentioned gas ex which really helped. Constipation and reflux have been my biggest problems and just generally feeling tired and unwell. So I’ll be unwell and constipated one week, better the next week and unwell and constipated and on and on.",
      "MessageIndex": 935,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 8, 2018 07:12PM 19501952 wrote: Hi All, I had blood work today and my WBC was 1.79 so I won’t be having my third chemo tomorrow. My oncologist called this dangerously low and said I should be very careful. I got my first shot of neulasta and I’m wondering how quickly it works. I’m taking tomorrow off but I hate missing work. I know the flu is rampant throughout the country. My boss said we have no known flu cases at school but I’m still worried. Any info on how quickly neulasta works would be appreciated. My next chemo is scheduled for Jan. 22 and it will be chemo # 3 then I will go to an every other week schedule after that. Fingers crossed. Good luck to everyone having chemo #3 this week. And of course everyone else! Kate",
      "MessageIndex": 974,
      "PostDate": "08/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 23, 2018 04:07PM 19501952 wrote: Hi gals, sorry I haven’t been writing much but I have been reading everyone’s posts. Sorry to hear about your mom, klvans. No matter the circumstances, whether it’s expected or not it is extremely hard and sad to lose a parent. Congratulations to everyone that’s done! I know we all can’t wait to be done. My wbc was too low to get my 3rd infusion. The nuelasta brought my wbc up to 5.7 yesterday so. I got my 3rd infusion and as I sit here writing this my nuelasta on pro. Is clicking away. That’s quite a startling stick when the pod is applied. Now I’ll be prepared. I wonder if the nurses bet on who will come out of the chair when it sticks you. For a week after the nuelasta injection I felt fluish and since it is pretty widespread here in upstate New York, I have been worried about going anywhere. I really wanted to participate in the Woman’s March but decided I’d better sit this one out. I discovered Senakot S and I have to say it’s been very effective. Still have a jumpy stomach and reflux. I took a Claritin and I’ll take them for the next couple of days and cross my Fingers. Good luck to everyone. Kate ",
      "MessageIndex": 1158,
      "PostDate": "23/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 29, 2018 01:16PM 19501952 wrote: Thanks Klvans, I get the most reassurance from all of you that are going through this. You know when I first got diagnosed the surgeon, oncologist and radiologist were so positive I’d sail right through this. After the first lumpectomy I didn’t have clear margins and had to have a rexcision that produced clear results. All my doctors thought I’d have radiation then be fine. When my oncotype score turned out to be 26 they were all surprised. I wish they had been less positive from the beginning. Then setbacks and test results might be easier to take. Now I want to say, really, you’re sure about that? So I’ll try not to worry but that whole trust thing has been eroded. Kate                  Core ",
      "MessageIndex": 1218,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Nov 28, 2017 07:40AM 19501952 wrote: Thank you, MeMyself17. What you experienced is reassuring. I am hoping for the best and will have to ask about the Claritin. Thank you, thank you!",
      "MessageIndex": 3,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 8, 2017 05:48AM 19501952 wrote: Hi MeMyself17, I’m 65. My oncologist told me I’m a young 65 and she wants me to live to be 90. I’m not sure that’s my goal as all my friends/family are older than me but her comments were encouraging. My only issue right now is constipation and I’m home from work today hoping something will happen. It means a lot to me that I can connect with other people that have gone thru this treatment and I thank you for sharing your experience. Kate",
      "MessageIndex": 9,
      "PostDate": "08/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 2, 2018 07:05PM 19501952 wrote: Hi Lauralou102, I started my first treatment 12/5 and the 2nd on 12/27. I will have blood work 1/8 and possibly treatment # 3 on 1/9. I’m a little worried about going to an every other week schedule vs every 3 weeks since it has taken a little over a week to feel almost normal. The infusion has been the easy part but the constipation and jumpy stomach and reflux have been hard to handle. Yesterday I felt like my hair/head hurt and today it’s a little worse. I haven’t notice much thinning and according to my oncologist I shouldn’t lose all of it but who knows. After chemo I will have 16 radiation treatments and then some type of hormone. Would you mind sharing your experience on CMF? I’m from upstate New York. I hope you are doing well and I appreciate you taking the time to respond. Kate ",
      "MessageIndex": 12,
      "PostDate": "02/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 28, 2018 12:52PM 19501952 wrote: Hi Ml143333, How are you doing now? Any lingering side effects? Any regrets about CMF? Did you have radiation? Are you taking any hormones or after chemo meds? My constant companions have been a jumpy stomach, heartburn/reflux, and constapation. I’m still challenged by the stomach issues but I think for now I’ve conquered the constipation. I’ll have chemo 6 on 3/6 and 2 more infusions after that. Thanks for any info you can give me/us. Kate",
      "MessageIndex": 27,
      "PostDate": "28/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Mar 13, 2018 06:38PM 19501952 wrote: Hi May07, I’ll be getting chemo #6 tomorrow. So far my hair has thinned slightly but not really noticeable to anyone but me and my hairbrush. I’ve had nuelasta for the last 3 treatments. I take Claritin and so far have had no bone pain. My biggest complaint is acid reflux and jumpy stomach. So far nothing has worked to resolve or even make this problem better. If you read previous posts constipation was an initial problem but miralax and senakot S have kept that problem under control. Drinking water and extra fluids is challenging. I had some type of stomach upset about 8 days ago and with that one day of vomiting I couldn’t have my 6 th infusion because I became dehydrated and had to get a liter of fluid IV. I have never had any vomiting or diarrhea except for this one time. I’m 65 and I have not bounced back as quickly as some others. I’m still working but I usually need 3 or more days of recovery and I find the treatments cause me extreme fatigue. As I begin to recover I have about 4 days of feeling pretty good and then it’s time for another treatment. CMF is definitely doable. As you go through treatment keep us posted and ask any questions you have. Kate",
      "MessageIndex": 30,
      "PostDate": "13/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 62,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "May 28, 2018 08:56AM 19501952 wrote: Hi everyone, Just wanted to post an update and provide support and encouragement. I finished my last chemo on 4/9 and by the end I was so happy to be finished. My jumpy stomach and fatigue continued for about 3 weeks and everyday I kept wondering if I’d ever feel better again. By the time I started radiation I have to say I felt almost normal. I’ve had 15 radiation treatments and I’ve got 6 more to go. Other than fatigue I feel pretty darn good. I have kept most of my hair, just a little thinning, and some foods taste weird, but I really feel better than I thought I would. During the chemo if someone told me I’d feel good again I wouldn’t have believed them but I’m here to tell you that you really will feel better. It was good to have a month to recover from chemo and once radiation started I felt like I could finally see the end of treatment. I’ve had 15 of 21 treatments and they are quick, easy, and painless. I have a little redness but nothing terrible and aloevera and aquaphor help. That combination is a bit greasy but I picked up a package of men’s white tee shirts and they are comfortable to sleep in and I don’t have to worry my pjs will suffer. My fatigue is still present but it seems to show up after I’ve been busy mowing or going up and down the stairs doing laundry. The chemo does make you photosensitive so my oncologist really stressed staying covered up, wearing 100 SPF sunscreen and staying hydrated. I’ve been walking everyday and that has been nice. We have a rail trail nearby so I don’t have to go far to find a nice safe walking place. I do lose my balance so I carry a walking stick which really helps. Hope this helps to know what I’ve experienced. Everyone is different and your experience may be better and hopefully no worse. I hope everyone keeps writing to let us all know how you’re doing. When I started CMF I couldn’t find a group on this site so I started this one and I hope any new people that enter this group can gain something from all of us. Good luck to all, Kate  ",
      "MessageIndex": 65,
      "PostDate": "28/05/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jul 24, 2018 09:28PM 19501952 wrote: Hi Everybody, Here is my update from after my vacation in Raquette Lake. First I’ll say that everyday I was gone I had drainage and dressing changes and my doctor called in an extension of the Bactrum for another 10 days. I saw my oncologist who took one look at my vacation weary breast and after squeezing more fluid out she called my surgeon and told her I needed to have the area looked at immediately. Saw the surgeon and she said the plan will be to schedule surgery to open up the area, debrid it and pack it so it could heal from the inside out. I was so discouraged at this point I wanted this over now. Had the surgery two days later and came home with a packed and draining incision. Still dont know what the cultures showed this time. My surgeon is currently on vacation and my follow up with my surgeons partner is 7/30. The PA at my oncologist looked at the area today and reassured my friend that the dressing looked good and that was a big relief I write this saga so anyone that has an infected seroma can read the process of getting rid of it and I’ll keep you all updated. The last 5 radiation boosts I blame for this but who knows why it happened. Kate",
      "MessageIndex": 130,
      "PostDate": "24/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Aug 13, 2018 11:28AM 19501952 wrote: Hi Nocyart, Welcome to this group. Best of luck to you. Lots of good information here about what to expect and what others have experienced. This is a great group. Any questions you have I’m sure someone here can answer. I agree about having a choice, making it and not being able to even consider the risk of not doing chemo. When I was presented with information related to my breast cancer it was clear to me chemo was the route to take. Though it wasn’t always easy many of us have gotten thru it with minimal side effects that were controlled through trying things people in this group experienced and tried. Everyone experiences chemo differently but here is hoping you sail through it. Kate",
      "MessageIndex": 147,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 155,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 13, 2017 09:29PM 19501952 wrote: Thanks for connecting me to this group. I really appreciate hearing from others that have had CMF. I’m doing ok. Some constipation and tired, and nausea that seems to be reflux. The reflux seems a bit worse each day. I’m planning on calling oncologist tomorrow to see if there is anything I can take. Kat",
      "MessageIndex": 10,
      "PostDate": "13/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Mar 19, 2018 07:59PM 19501952 wrote: Hi Marie, I know my CMF therapy was determined after my oncotype score came back at a surprising 26 putting me in the intermediate risk of recurrence. Originally the plan was lumpectomy and radiation. When I started the CMF I was scheduled every 3 weeks and after treatment 2 the schedule was excellerated to every two weeks. I’m 65 and in fairly good shape with no serious health concerns but I had to delay my chemo 6 for an extra week due to a 24 hour bug that left me dehydrated. I really wished I had just done every 3 weeks because every two weeks makes me feel like I’ve barely recovered. So for me if I had to do it over I would say just give me chemo every 3 weeks. But, keep in mind that everyone responds differently and age, oncotype score, grade of cancer, and your oncologist all factor in regarding your course of treatment. My biggest complaint has been a reflux stomach upset issue that nothing seems to help. I had constipation early on but if you read back I came up with a routine to combat that problem. I have kept my hair, the treatment time is about 1 1/2 to 2 hours so all and all not a bad chemo relative to what others have undergone. If I had a bit more information about your previous treatment I might have a different opinion. Ask any questions you have and I’ll try to answer them. I check this forum every day. Best of luck, Kate",
      "MessageIndex": 33,
      "PostDate": "19/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Mar 28, 2018 05:21PM 19501952 wrote: Hi Maggie, When my cancer was first discovered my oncologist and surgeon thought I would just need the lumpectomy and maybe radiation. The first lumpectomy did not have clear margins so I had another 2 weeks later. My tumor/ tissue samples were sent to California and my oncotype score came back at 26 placing me in the intermediate risk for recurrence and CMF was the recommended treatment. I think that everyone I’ve been in contact with has given me choices about treatment I really don’t feel qualified to decide. Do you want a mastectomy, do you want to do chemo and radiation. More than once I’ve wanted to say, why are you asking me what I want, how should I know. I’m 65, in good health and my tumor was small with no node involvement so CMF has less side effects, is tried and true and been around for a long time so there’s lots of research about the treatment and I’m confident that CMF is right for me. I’ve done some of my own research and it’s helped me feel comfortable with the plan. Do you know your oncotype score? If my score had been lower I would probably just do radiation but with a score of 26 I can’t take a chance. Good luck to you, Kate",
      "MessageIndex": 38,
      "PostDate": "28/03/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jun 5, 2018 07:29AM - edited Jun 5, 2018 07:30AM by 19501952 Hi Robyn1231, I completed my CMF and initially I was really worried about the whole process. The infusion is relativequick compared to other types of chemo. It usually took 1.5 hours. Two drugs are slowly injected into your IV and the Cytoxin is a drip. Constipation was my main issue and as time went on just fatigue. I took miralax and senakot S for constipation and tried to pace myself. I have kept almost all of my hair and never had any diarrhea and only 1-2 mild issues with vomiting. The whole thing was scary and I kept waiting for awful things to happen. My white blood count did drop really low and the nuelasta pod helped with that. I needed a couple IV infusions of fluid because I was dehydrated in spite of drinking more water and other stuff than I ever had in my life. I am hoping you get through this with no weird issues. I hope you will let us know how you do today. I'll check this site regularly to be available if you have any. Questions I can answer. Good luck today. I'll be thinking of you. I finish my last of 21 radiation treatments today. Radiation has been a breeze. Kate",
      "MessageIndex": 70,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jun 5, 2018 06:23PM 19501952 wrote: Hi Inthegrey, My worst days were always the day after treatment. I was just wiped out. After a day or two I felt ok but I always had a jumpy feeling in my stomach and reflux. Midway I started feeling like I couldn’t face another treatment because I was so tired of feeling unwell. When I got to treatment number 8 if they said I needed a ninth treatment I would have said Hell No!!! Fatigue in between treatments would come on suddenly and sometimes it was unpredictable. Other times I was wiped out after doing laundry or snow shoveling. Once I finished chemo I rarely had fatigue. Now that I’m past chemo that ended 4/8 and past radiation that ended today I have to say I feel much less fatigue and I’m back to doing almost everything I did before. Now my only issue is occasional nausea every few days. I’m not sure how common that feeling is. I do think we will all have different responses and it has all been very scary and unnerving to go through. Knowing there are other people that have gone thru CMF and radiation and reading about their experiences has been so helpful and encouraging. I will keep checking in if you have any other questions or just want to vent. Good luck to you. This is truly a club no one wants to belong to, but thank god it’s full of helpful, kind people. You’ll get through this. Take care. Sending positive thoughts. Kate",
      "MessageIndex": 73,
      "PostDate": "05/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jul 4, 2018 06:01AM 19501952 wrote: Hi Riri11, Two or three times the day of chemo I had hoarseness and throat irritation. It went away in a day or so. The first time I thought I was getting a cold and by the second and third time I went back to my handy notebook and read what I wrote about that feeling. I hope you don’t have a cold. I know we all get worried about becoming ill. I’ve written before about chemo and about radiation and I was feeling pretty darn good, and suddenlywithin a couple days after oncology appointment my breast became very hard, very painful and I started to run a fever. This fell in to the “ no one told me about this” category. Thank god for this forum. I was able to look up stuff and made an appointment with my oncologist who immediately fit me in once she heard my symptoms. I had a crazy day from oncology to hospital for a CT scan then to another hospital to be admitted and put on IV antibiotics. Everyone kept saying what I had was an an abscess, but what I looked up pointed to a seroma. Which is a void from surgery that can fill with blood, pus or fluid. I had 80 ccs of fluid drained and I was sent home with doxycycline and oxycodone. 3 days later the void filled again and I went back to my surgeon who was the admitting doctor and she drained another 40 ccs. It felt good after that but by my follow up appointment yesterday she wanted to drain it again and got another 7 ccs. She said the culture from the hospital showed staph and she changed my antibiodic from doxycycline to Bactrum. She said I should go buy a lotto ticket because I was a rare case. I would prefer being a someone who presented with a very common easily solved issue that the doctor had seen a million times, but she said I was the first. So today I have not decided how I feel yet. I’m still sore but who knows. I. Write this so somewhere at sometime if a person developed this they can find this post. I’ll continue to update over the course of this. Cross your fingers and say a prayer this gets better. We are headed to Raquette Lake in the Adirondacks for our yearly week of family and fun and the closest hospitals are a good distance away. I’ll be armed with my cold packs, six packs and thermometer. The upside of Bactrum is that moderate drinking is allowed! Good luck to all and hang in there. Cancer opens your eyes to the good things and people in your life and has given me a very deep appreciation for both, but it does scare the crap out of you with every bump in the road. Kate   ",
      "MessageIndex": 108,
      "PostDate": "04/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Aug 3, 2018 02:31PM 19501952 wrote: yeah my oncologist said you can go ahead and color your hair if you want it all to fall out. She said it stress your hair. I’ll be curious to know what u find out.",
      "MessageIndex": 143,
      "PostDate": "03/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Aug 13, 2018 09:50PM 19501952 wrote: Hi Lynne, Count on about 2 hours plus or minus 15 minutes. I felt headachy, full headed and some coughing the first treatment. Nothing too serious. Tylenol took care of it. The chemo /steroids can be constipating so you might want to have some miralax or senakot available. They don’t work suddenly so you won’t be caught off guard. I’m not sure I could have driven 2 hours after the first treatment but I could have been a passenger. I think you’ll be fine. Have a good time! Kate",
      "MessageIndex": 151,
      "PostDate": "13/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 186,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 24, 2019 05:31PM 19501952 wrote: Hi Rbxx0520, When I started CMF in Dec of 2017 there was next to nothing about what to expect. I’m so glad so many people have shared their experiences. My chemo ended in April of 2018 after 8 treatments and then I had radiation which ended in June 2018. Today, I feel fantastic! It took a few weeks to feel better after chemo (just in time to start radiation) but the relief of finishing chemo was an immediate emotional sense of calm and I knew I could start to get back to normal. There might be days you think the final treatment will never come, but trust me, it does and you really will be back to normal. Keep a positive attitude, ask for help if you need it,and take care of you as much as you can. You can do this and you will get to the other side of treatment and get back to everything you enjoyed before. In my case, I enjoy everything more than ever. Good luck, and I’ll be checking here to hear how you are doing, 19501952, Kate",
      "MessageIndex": 244,
      "PostDate": "24/02/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 248,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Nov 23, 2017 06:25PM 19501952 wrote: I will start CMF on 12/5/17. I will have chemo every 3 weeks and do 8 sessions. I’m 65, work full time, and am blessed with kind and supportive friends and family. After chemo ends in May, I’ll start radiation. My oncologist says if I do well and my counts are good she might escalate the treatment to every 2 weeks. I haven’t seen anyone here on CMF and of course I’m interested to hear if anyone will have a similar course of treatment. I’m worried about the side effects. Sometimes reading everything you can get your hands on gives you too much information. I keep hoping my reading and research will lead me to someone who has had a positive experience with CMF tho I know we all respond differently. Good luck to all",
      "MessageIndex": 230,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Nov 26, 2017 07:44PM 19501952 wrote: Tomorrow is chemo class. I’m still searching for someone who has had or will have CMF. Im a little concerned that I seem to be by myself with this chemo. I’m hoping I get a clear idea of what I might expect in terms of side effects. The lists of supplies I might need have been both helpful and scary. My boss will be setting me up with remote access so if need be I can work from home. Wishing everyone the very best and a very good week ahead.",
      "MessageIndex": 266,
      "PostDate": "26/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 14, 2017 06:04PM 19501952 wrote: Hi Everybody, Thanks so much for all the information about reflux. It's so great to have a fear and then hear other people have and are experiencing the same thing. I called my oncologist and got a script for Rinitidine (zantac). I'm picking it up on my way home. My very big family and extended family are coming to celebrate Christmas this weekend. We have hosted dinner for the past 20 Year's but this year we made reservations to eat out. My niece lives right down the road from us and she has jumped right in to handle all the arrangements and she will host our gift exchange and do the planning for the weekend. We decided to celebrate before the holiday this year and made some plans prior to my diagnosis. Who knew we would be getting ready for my second round of chemo on the 27th instead of doing something fun. My heart goes out to all of you as you talk about your children and your family and your lives. The dog pictures are great! We have a 14 year old white schnauzer, Snow Flake, and an 8 year old white schnoodle (Schnauzer poodle ) named Casper. I’ll post a picture at some point. All the best to everyone and thanks again for alleviating my reflux fears. Kate.   ",
      "MessageIndex": 636,
      "PostDate": "14/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 9, 2018 09:57AM 19501952 wrote: Thanks LizabethM, I am working from home today and thinking about working from home tomorrow. So far I feel fine. No pain but I am wondering if I should take Claritin to ward off any bone pain issues that might arise. My oncologist and her nurse did not seem concerned about warding off pain. I do take Zyrtec every day so I’ll have to look that up. I’m not sure if they are the same. Kate    ",
      "MessageIndex": 978,
      "PostDate": "09/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Nov 28, 2017 09:37AM 19501952 wrote: Thanks Blair2. The information was helpful. Chemo class answered a lot of questions. Claritin wasn’t mentioned with the nulasta but it’s something I’ll have on hand. Thanks and best of luck to you",
      "MessageIndex": 282,
      "PostDate": "28/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 4, 2017 07:47PM 19501952 wrote: Thanks Rljes and LizabethM. The information about the neulasta made me feel better. My first chemo session is tomorrow. I’m bringing my best friend and my iPad, and snacks and water. Hopefully they offer ice. I wonder if ice cream would be a good alternative. Now that would be nice! I’m feeling pretty positive about it. I think I’m just relieved to finally be starting treatment. I’ll have 8 chemo sessions 3 weeks apart then after the CMF I’ll have 16 radiation treatments. Picked up my dexamethasone and ondansetron scripts the other day and Claritin and immodian and lots of stuff to drink. The chemo teacher said using my sonicare tooth brush was ok but to be gentle. I picked up plain ole Colgate and alcohol free mouth wash. I’ve only heard from one other person who had CMF so I’m going to be posting about this treatment and how it goes. Good luck to everyone.",
      "MessageIndex": 401,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 13, 2017 11:06PM - edited Dec 13, 2017 11:08PM by 19501952 Hi all, I haven't posted in a few days but I've been reading all the posts. I started chemo Tuesday, 12/5. Stayed home next day, went to work Thursday didn't feel Good Friday and stayed home. Had some constipation issues and took Colace and ducalx which helped. My anti nausea med wasn't working well and my doctor called in a script for compazin. My main problem isnt really nausea it's reflux. At least I think its reflux. Has anyone else had that issue. I'm going to call the oncologist tomorrow and talk to someone but I just wondered if anyone had the problem and what they did about it. Other than being tired and still being in shock that I even need chemo I feel pretty good. No mouth sores but obviously somethings causing this reflux. Thanks for any advise and god bless everyone of you. Kate",
      "MessageIndex": 623,
      "PostDate": "13/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 26, 2017 02:35PM 19501952 wrote: Hi All, love reading these posts and hearing how everyone is getting along and how everyone copes with side effects. Reading about other people’s fears makes me feel less alone. I go for chemo #2 tomorrow. I’m off thru 1/2 so hopefully I’ll return to work on schedule. A friend I bumped into at the market told me she is starting her new job at the infusion center where I receive treatment. Maybe that will be a good thing. Time will tell. Still not hearing from many people currently or ever on CMF. cyclophosphamide, methatrexate and fluorouracil. I’m just this past week feeling back to normal and we will see how this round goes. Happy Holidays to everyone. Kate",
      "MessageIndex": 784,
      "PostDate": "26/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 27, 2017 08:22AM - edited Dec 27, 2017 08:23AM by 19501952 rljes, see if your vet, a groomer, or pet store have Pawz. They are rubber balloon looking things that fit over paws. Our dogs use them and they can go out in our -3 weather no problem! Kate",
      "MessageIndex": 799,
      "PostDate": "27/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 5, 2018 07:42PM 19501952 wrote: hi klvans, My understanding of the tatttoo is for the radiologist to target the spot that needs radiation. It helps line up the radiation fields so that your treatment is the same way every time. Ink was used in the past but it faded or bled and the treatment could not be exact. The tattoo itself will be the size of a pinhead. Kate.",
      "MessageIndex": 934,
      "PostDate": "05/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 9, 2018 03:35PM - edited Jan 9, 2018 03:36PM by 19501952 thanks SDK8, I started to experience hip lower back pain. It's a weird kind of pain. I took Claritin. I feel like all I do is take one drug after the other as I'm sure everyone here does too. I think if it doesn't feel a little better soon I'll take an Aleve or Motrin. The pain may also be a result of leaning over my computer as I sit on my couch working from home. I keep thinking I will wake up and all of this is a very bad dream. So many of you seem to handle everything that is thrown your way. I hope I can be as brave. Kate",
      "MessageIndex": 982,
      "PostDate": "09/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 12, 2018 05:02PM - edited Jan 14, 2018 06:41PM by 19501952 SDK8, You look beautiful with and without the wig! I just hope taking the Tylenol is the right thing to do. I hate this worrying about myself. I'd rather worry about other people. I've felt like crap since Tuesday morning and I just keep waiting to feel better. My last treatment was 12/27 then the neaulasta on 1/8. Can neaulasta make a person feel sick or am I really sick with something due to my 1.7 wbc and my low ANC. I guess time will tell. Thanks, Kate",
      "MessageIndex": 1024,
      "PostDate": "12/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 29, 2018 11:18AM 19501952 wrote: hi everybody, Has anyone had abnormal liver enzymes? My ALT/SGPT IS 70 and I got a call to come in for blood work tomorrow. Two weeks ago it was 32. Constipation seems to be my constant companion. Oncology nurse told me to take 8 senakot about 30 minutes ago. So far nothing. All these meds to counteract each other is driving me crazy. Kate",
      "MessageIndex": 1213,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 8, 2018 07:30PM 19501952 wrote: Congratulations to all of you that are done with treatments and going on to your next phase. Blair, good decision. Don’t look back. You struggled enough. Tina, thanks for that “twitchy” stomach comment. I guess that is a better way to explain what I call my “jumpy” stomach. That is my worst ongoing problem. My constipation issue was finally releived by 8 senakot S and now I’m taking miralax 2times a day and 2 senakot s every day. So far so good. I had infusion # 4 on 2/6 and nuelasta pod. My wbc was 1.76 and with the nuelasta back up to 7. Like everyone some days I want to forget this whole thing. I’m tired and can’t do all the things I like. Call me crazy but I love to do the laundry and the thought of lugging it up and down the stairs makes me wish I had a laundry Shute. The flu is bad everywhere and going out is scary. I usually go for the ride and let my friends run into stores while I watch the car. At least I’m out. I’ve been reading everyone’s posts and I’ll try to post more consistently. Sometimes I think we all feel like whining. We ought to all pick a date, like Sunday, February 11th at 12 noon and all whine, yell, curse, pray all together. I’m doing it! Kate",
      "MessageIndex": 1296,
      "PostDate": "08/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 4, 2017 06:17PM - edited Dec 4, 2017 06:38PM by 19501952 Hi MeMyself17, wish me luck. Tomorrow is the big day. I'm sure I'll have a few questions for you. One right now is why CMF? But from what I have read and after your post it does seem we are in the minority. My oncotype dx score was 26 and I'm 65. Maybe that's it? I'm trying not to overthink this. I feel relieved treatment is finally starting. All the best to you. Kate",
      "MessageIndex": 4,
      "PostDate": "04/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 25, 2018 10:34AM 19501952 wrote: Welcome Shell07, Constipation and reflux have been my biggest problem. I just had chemo #5 on 2/19. My new routine to ward off constipation has been miralax morning and night and 2 senakot S at night. I started a couple days before treatment and continued for 3 days after and I’m happy to say I didn’t have any constipation with this round of chemo. If I could solve the reflux, burping, jumpy stomach I would be very happy. Today I’m trying Prilosec instead of ranitidine. Everyone experiences chemo a little differently. I’m sure age has something to do with it. I’m 65. My oncotype score was 26. Good luck to you. Keep us updated and feel free to ask any question. Kate",
      "MessageIndex": 20,
      "PostDate": "25/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 28, 2018 09:43AM 19501952 wrote: Hi Shell07, Glad your first infusion went well. Don’t wait for any side effect to get severe. If you have meds take them, and if meds don’t work ask for different ones. Good for you to let the nurse know about sinus pressure. I’ve found the infusion nurses to be great and they want you to be comfortable. Good luck tomorrow Dagny. I’ll be thinking of you. Kate",
      "MessageIndex": 25,
      "PostDate": "28/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Apr 26, 2018 05:18PM 19501952 wrote: 2002chickadee, Sounds like you’ve got a good handle on everything and you are realistic and prepared. I finished my 8th of 8 on 4/9 and I will be seeing my RO tomorrow. So far I have kept my hair, my stomach jumpy feeling continues and I am trying to walk every day. The fatigue is cumulative and comes on unexpectedly. I’ve develpoed a cough and who knows what that’s about. I’ll ask my oncologist on 4/30 when she sees me one more time before I start radiation. I’ll be getting 21 treatments. The fatigue is depressing but I’ve got a great friend who doesn’t let me dwell on it. I’ve been working but needed to come home an hour and a half early yesterday because I couldn’t concentrate and I felt like I was moving through molasses. It’s an effort to think straight to write this but I wanted to acknowledge your post and wish you good luck as you move forward. Kate",
      "MessageIndex": 55,
      "PostDate": "26/04/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jun 21, 2018 08:45PM 19501952 wrote: Hi Everyone, It sounds like most of you are all handling chemo well. I’m so happy to hear this. Just an interesting tidbit. My oncologist here in Albany New York came from MSK and she and my oncotype score determined CMF would be my chemo. I finished my chemo on April 9 th, 8 rounds of CMF every two weeks with a couple delays due to low WBC, and I finished my 21 radiation treatments on June 4th. During chemo I never thought I’d feel good again and even after chemo was over my stomach still bothered me. Radiation was easy. Now and for the past week I have to say I almost feel as well as I did before my diagnosis last September. Good luck to all. Kate",
      "MessageIndex": 90,
      "PostDate": "21/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jul 5, 2018 12:16PM 19501952 wrote: Hi RiRi11, On No! I’m so sorry. Hopefully you caught it early. Sometimes I just wish we could all wear a space suit and take it off when we finish treatment. I don’t even tell my oncologist about how often I take my temperature because I’m afraid of catching something. We are going away for a week and I’ve got a list of urgent cares and closest hospitals. Crazy! But, we will get to the other side of this. I’m hoping you feel better already. Kate",
      "MessageIndex": 113,
      "PostDate": "05/07/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Aug 3, 2018 06:54AM 19501952 wrote: Hi MILO2018, My hair did thin a bit and after chemo it started to return to normal. I don’t think anyone but me really noticed. Now, almost 3 months post chemo my hair is back to normal and I’m told the back of my hair actually looks thicker. My oncologist told me not to color my hair during chemo. I see her next and I’ll be asking her if she thinks I’m safe to do it now. I haven’t colored it in a year!!! Best of luck to you, Kate ",
      "MessageIndex": 141,
      "PostDate": "03/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 217,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "19501952 wrote: I’m starting CMF on 12/5/17. I’m 65 years old. I haven’t been able to find many/any people with a similar course of treatment. Mine will be 8 sessions spaced 3 weeks apart. If you have any information about this treatment I would love to hear your thoughts. Dx 9/8/2017, IDC, Right, 1cm, Stage IA, Grade 3, 0/0 nodes, ER+/PR+, HER2- Hormonal Therapy Log in to post a reply",
      "MessageIndex": 310,
      "PostDate": "23/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/860351",
      "Title": "CMF treatment survivors and experiences 19501952 2002chickadee"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Nov 30, 2017 08:59AM 19501952 wrote: I had my chemo class on 11/27 and starting chemo on 12/5. Picked up scripts for Dexamethasone and Ondansetron yesterday. I'll be getting nulasta after chem on the 5th. It seems weird that this thing “goes off\" in 24 hours. What does it feel like? Finally steri strips are coming off from re-excision on 11/6. I've had some shooting pains in that breast which the nurse calls Zingers. Overall I feel fine except for nervousness about the first chemo treatment. I'll let you all know how my first CMF session goes. This is a great, supportive community. The oncology nurse said to stay off the internet and not look stuff up. I didn't tell her that everything she told me I had already read on the internet! Good luck to everyone. Kate ",
      "MessageIndex": 316,
      "PostDate": "30/11/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 18, 2017 08:54PM 19501952 wrote: frozentoes, that’s great advise for all of us and so well said. Thanks! My first chemo was on 12/5 and my next is 12/27 I am finally feeling better with less reflux. I would say that constipation, indigestion, reflux and tiredness have been my main side effects. Hopefully my second round of CMF will go as well or better. I’m trying to stay well hydrated which is my challenge but I’m getting better at it. Good luck to all. Kate",
      "MessageIndex": 687,
      "PostDate": "18/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 28, 2017 07:11PM 19501952 wrote: hi Rljes, the booties look great. I hope they do the trick. If only our own problems could be fixed by 2 pairs of red rubber booties. They are comical though so I guess in a way they do solve some problems. The sound they make on the kitchen floor just cracks us up. Had the 2nd chemo yesterday. Felt tired after and headachy. For the 2nd time since I’ve been going to treatment an ambulance, fire truck and EMS were there. I don’t even want to know why. During the infusion my hand suddenly got really cold and my arm hurt so the-infusion nurse put a hot pack on my arm and that helped. Today I’m still a little groggy and have some reflux but was able to get out to the market. My WBC was 2.8 10 days after my first treatment and yesterday it was 5.7. I’m going to have blood work on 1/8 and see the oncologist 1/9 and maybe start on a two week schedule. I’m glad I’ve got this Christmas break to rest and not miss work. I go back on 1/2. Hopefully the students don’t come back sick. I don’t have a lot of direct contact but still worry. If we have any big flu issue I can work from home Happy New Year to all!",
      "MessageIndex": 832,
      "PostDate": "28/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 12, 2018 01:33PM 19501952 wrote: Congratulations Orangedaisey!! I know if I have a fever of 100.4 I need to call oncology but here is my question. If my temperature is 99.1 do I take Tylenol or just let my temperature raise if it’s going to go up? I keep feeling worse and worse after the neaulasta shot I got on Monday. Last night dry heaves; palms tingling super tired. Today I have zero appetite and I’m still totally wiped out. Is this normal? It’s scary. I’m never sick and this just seems crazy to feel worse and worse. I called oncology yesterday to let them know I have a cold. At least I think that’s what it is but I keep feeling worse not better no matter how much I rest or what I do. If this is all normal to feel like this I sure would be relieved. Thanks for any thoughts you gals might have. Kate",
      "MessageIndex": 1019,
      "PostDate": "12/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 29, 2018 01:16PM 19501952 wrote: Thanks Klvans, I get the most reassurance from all of you that are going through this. You know when I first got diagnosed the surgeon, oncologist and radiologist were so positive I'd sail right through this. After the first lumpectomy I didn't have clear margins and had to have a rexcision that produced clear results. All my doctors thought I'd have radiation then be fine. When my oncotype score turned out to be 26 they were all surprised. I wish they had been less positive from the beginning. Then setbacks and test results might be easier to take. Now I want to say, really, you're sure about that? So I'll try not to worry but that whole trust thing has been eroded. Kate                  Core ",
      "MessageIndex": 1217,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 25, 2018 10:58AM 19501952 wrote: Hi everyone, I haven’t posted for a while but I’ve been reading everyone’s posts. Rljes, I had chemo #5 on the 19th and I feel like this is the worst so far as well. I almost didn’t make it walking around the market today and just walking a short distance down the road last week I was short of breath. First time in my life for that. I’m happy to report I’ve finally come up with a good routine for constipation. 2 days before chemo and 3 days after I’ve taken a dose of miralax in the morning and night and 2 SenakotS at night and I’ve had no problems! My stomach continues to feel jumpy and I burp all day which makes me a little nauseas and probably makes anyone that hears me feel sick as well. I’ve been taking ranitidine 2 times a day but today I got so Prilosec and I’m hoping that it works better. I also had a little issue with my oncologist who ordered cipro the last time my wbc dropped and her PA ordered it a second time when my counts were low again. She literally jumped out of her chair saying Cipro and methatrexate are very dangerous to take and who ordered that. Telling her she did seemed to make her more agitated and she blamed the PA. So, I wrote down my chemo drugs for my pharmacist so they can flag any drugs that interact. I wished I had thought of that before. Now my oncologist has cancelled all my blood work in between treatments because she said we know it will show very low wbc. I still feel awful with my stomach issues and tiredness. Hopefully I can make it to work tomorrow. I had the whole week of chemo 5 off for winter break. Good thing. Kate",
      "MessageIndex": 1399,
      "PostDate": "25/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 5, 2017 04:22PM 19501952 wrote: I had my first infusion of CMF today and it went better than I thought it would. Had some pressure/congested feeling and the nurse said to take a clariton before next infusion and that they would do the infusion slower next time. I’m drinking more water than I ever did before but the nurse told me to drink more so my veins would stand out more. So far so good. I keep waiting for something to not feel right. Crazy, huh",
      "MessageIndex": 419,
      "PostDate": "05/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Dec 27, 2017 08:48AM 19501952 wrote: our dogs Casper and Snowflake with their Pawz on.",
      "MessageIndex": 800,
      "PostDate": "27/12/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Jan 29, 2018 12:02PM - edited Jan 29, 2018 12:02PM by 19501952 Thanks Hope, your experience is reassuring. I think every time something is a little out of whack it turns into a battle between thinking, oh, no problem. It will be fine. And, Omg it's got to mean something awful. I wonder if any of us will return to a more carefree state of mind. Kate",
      "MessageIndex": 1215,
      "PostDate": "29/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    },
    {
      "AuthorID": "19501952",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/263761/profile",
      "Content": "Feb 26, 2018 07:29AM 19501952 wrote: Hi Nonohope, The Cipro is a very strong broad spectrum antibiodic. With low white blood counts you are very susceptible to everything. So in theory it made sense to me. The oncologists reaction to me saying I was on cipro again for a second time and telling me to stop immediately made me look up the interaction with methatrexate. What I read was scary. Not only does it interact, but it could cause your body not to show the typical signs of infection like runny nose, headache, temperature and it can cause antibiodic resistant issues. I think my pharmacist would have flagged this if she knew I was taking the CMF drugs so I dropped off a list so they would be in my record. I think it’s one thing to trust your doctor, but they make mistakes and this was a serious one so I am always going to do my own research every time there are changes in my treatment. Lesson learned! I’m hoping the Prilosec works. I’m headed to work now still feeling crappy. Have a great day everybody. Kate",
      "MessageIndex": 1403,
      "PostDate": "26/02/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/859650",
      "Title": "Starting Chemo in November 2017 Aymerz33 star2017"
    }
  ]
}