{
  "AuthorID": "1flowergirl1",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133399/profile",
  "Posts": [
    {
      "AuthorID": "1flowergirl1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133399/profile",
      "Content": "1flowergirl1 wrote: My mammogram showed calcifications. I have an appointment tomorrow with a general surgeon to discuss a stereotactic biopsy. My question is, who usually does the biopsies, a general surgeon or breast surgeon? I was given the referral by my primary doctor. Any help would be so appreciated. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/774373",
      "Title": "general or breast surgeon for biopsy 1flowergirl1 Gottobme"
    },
    {
      "AuthorID": "1flowergirl1",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/133399/profile",
      "Content": "1flowergirl1 wrote: My mom was diagnosed with stage 1V bc in January. I can't even begin to imagine how many hours upon hours I have spent reading these forums. They have provided much comfort to me . When I thought there was no hope, I found it here. My mom is in her 70's and isn't comfortable on the computer. However, she is always glad to hear what new information what I have learned. Well, it has been one terrible roller coaster ride since January. I did not think it could get worse until my most recent mammogram. It showed a cluster of micro calcifications. I then had a diagnostic mammogram and now need a breast MRI. I just don't have time to be sick right now. I have to take care of my mom. I could never let her know if I also have breast cancer, that would be way too much for her to handle.  My sister is there on a daily basis and I go home for 6 days a month. When I go home I do all the difficult or heavy house hold chores (cleaning gutters, shopping, shoveling snow, weeding, etc). I have to be healthy to do all those things and don't have time for any treatments. All my FMLA is used to take care of my mom. I don't have a single sick or vacation day left to go for tests or treatments. I have not been able to find a way to tell my sister either. She really is at the end of her rope with worrying about and caring for my mom and raising twins with autism. I just can't put this on her. So, the two people who you would naturally turn to when worried about a possible breast cancer diagnosis, mom and sister, I need to protect. I'm a tad stressed out right now and just needed to vent. I can't imagine how much more stressed I would feel without this forum. Thank you from the bottom of my heart. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/772690",
      "Title": "Mom's stage 1V and now my micro calcifications 1flowergirl1 SarahsMom"
    }
  ]
}