{
  "AuthorID": "1Miclon",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118567/profile",
  "Posts": [
    {
      "AuthorID": "1Miclon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118567/profile",
      "Content": "Feb 9, 2011 09:24AM 1Miclon wrote: I also get the Red Devil and It is pushed through a syringe. I have only had one treatment so far. The day of my 1st treatment I started my period so I couldn't tell the difference in my pee. LOL But I am told to drink LOTS AND LOTS AND LOTS (you get the picture) of water.",
      "MessageIndex": 13,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/764483",
      "Title": "Is all chemo red? pejkug3 charlottesmama"
    },
    {
      "AuthorID": "1Miclon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118567/profile",
      "Content": "Feb 8, 2011 08:37PM 1Miclon wrote: Hi,  Like all of you I started chemo In Jan(the 10). Hope you don't mind me joining in late. I am on TAC treatment every three weeks . My first round went very well. No real SE. My hair started falling out last tuesday, my aunt came and gave me a very short hair cut and now it's almost all gone now.   A little about me. I am 41 years old.  I have three kids (your,mine and ours), thier ages are 19,14,6. In Aug of 08 We found out that my husband had a brain Tumor. He went through surgery, chemo and Rad. but it didn't do him any good, He died in Nov of 08. So to tell you that I was scared when I found out that I had BC is an understatement. I was so worried who would take care of my 6 yr old.  But my dr. all of them kept telling me that this is different. That this is cureable and what he had was not.  So im going to fight with all I have. I just want to know if any of you are wearing a wig. I have wore one the past two days and My head is very ichy, does any one have any ideas to keep it from iching. Also my head is very tender in spots.  Micki",
      "MessageIndex": 718,
      "PostDate": "08/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "1Miclon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118567/profile",
      "Content": "Feb 12, 2011 06:53PM 1Miclon wrote: TAC x6 every 3weeks just had rd2 on thr. It seems I'm the only one on this treament plan. I think we all have the same meds but in different plans. Mine is texotere, adriamycin and cytoxan. I'm not really having any SE which is good. I usually have to take a nap on sat. I also have the neulasta shot the next day. Am I the only one who thinks that shot hurts. Its funny I always tell my kids oh it want hurt but I will not say that any more. My hair started coming out Feb 1 and by sunday I had to cut it. My aunt came to shave me but she said it would be easier if I just she just buzzed it. I blow dry my hair after I wash it to get the lose hairs off and that helps with the ichy head. Also for dry skin I found that Oil of  Olay body wash the 4 in 1 kind. I wear my wig out I just can't go out without it ( not ready). I do go commando in the house even when i sleep. Thank for all the welcome comments and the sympathy for my DH.",
      "MessageIndex": 769,
      "PostDate": "12/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    },
    {
      "AuthorID": "1Miclon",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/118567/profile",
      "Content": "Feb 9, 2011 08:55AM 1Miclon wrote: Thanks Amelia2. I tried something different today and it wasn't as ichy. I blowdried my hair to get off any lose ones, It steemed to be better.",
      "MessageIndex": 722,
      "PostDate": "09/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/762127",
      "Title": "Starting Chemo in January '11 JulieH leftfootforward"
    }
  ]
}