{
  "AuthorID": "1stick",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79425/profile",
  "Posts": [
    {
      "AuthorID": "1stick",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79425/profile",
      "Content": "Mar 25, 2010 08:24AM 1stick wrote: Hi tamgam - I'm so glad to find someone else with a tubular cancer!  I was diagnosed in January 2009 and had a similar sized growth to you.  I was recommended lumpectomy with radiation to follow then tamoxifen for 5 years (I was 43 at diagnosis).  Like you, I was told that this is a good, slow growing cancer, but the diagnosis came like a bolt from the blue.  I couldn't wait to have surgery and get rid of it.  Slow growing it might be, but I did not want it in there.  Incidentally I also had about 5 cysts in the other breast and had worries about follow up and what might happen to that breast over time - I don't like going to the doctors and felt that anxieties about the other breast would be difficult.  I eventually requested a bilateral mastectomy and after a series of visits with the breast surgeon, plastic surgeon, oncologist and radiologist, eventually had bilateral mastectomy and tissue expanders in Feb 09 with exchange surgery to silicone implants in October 2009.  The surgery went well and I'm doing great.  I take the tamoxifen and get the odd side effect but nothing much.  I don't worry about recurrence or more cancer although sometimes I worry that I should be worried.  Human nature is a funny thing! I haven't been on this site for a while so have just come across your post - you should have had surgery by now?  I do hope you're well and doing OK.  It's a funny cancer to have really - I sometimes feel quite isolated as it's difficult to find much information out there about tubular Ca.  I have to keep reminding myself though that if I have to have cancer, it's a good one to have. Do let me know how you are.  My thoughts are with you.x",
      "MessageIndex": 1,
      "PostDate": "25/03/2010",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/747907",
      "Title": "tubular carcinomas tamgam Brightsocks"
    },
    {
      "AuthorID": "1stick",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/79425/profile",
      "Content": "Feb 16, 2009 06:56PM 1stick wrote: I live in the UK and under the National Health Service which provides our healthcare was not eligible for screening which usually starts at the age of 50 (I'm 43).  I went along for a mammo on a hunch - slightly itchy left breast, and came away with a diagnosis of BC on the right.  I was recommended lumpectomy + sentinel node biopsy and probably radiotherapy.  Very quickly I knew that I would feel more comfortable with bilateral mastectomy.  My surgeon (male) felt that this was more than was necessary but interestingly my oncologist (female) was very understanding.   For me it was all about the future and needing to be able to move on.  I really did not want to feel on a high for a couple of weeks after a check up then be anxious again for the next 3 or 5 months until the next check up.  I feel extremely lucky that this has been detected and hope very much that I am cured.  The uncertainly of what might happen in the \"good\" breast seemed too much to bear.  I also felt very strongly that I'm not defined by my breasts and that I didn't need them to feel happy and secure in my future.  I really don't want to have radiotherapy either, if I can possibly avoid it.  Interestingly my onc is about to right a paper on her experiences which suggest that about 5% of her patients request bilateral mastectomy when it may not be necessary and almost all of these have been female doctors - kind of says something although I'm not sure what. Absolutely, I agree that this is something that you need to give careful thought to, but I also think that your gut instinct is really important. I nearly kissed my breast surgeon when he gave me a leaflet on \"Breast Cancer and the Younger Woman\" at 43, but gosh my thoughts and prayers go out to you at 24.  Please take care and get well. Cathy",
      "MessageIndex": 15,
      "PostDate": "16/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/728992",
      "Title": "Bilateral Mastectomy DiamondGurl Superwoman808"
    }
  ]
}