{
  "AuthorID": "20130502",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180494/profile",
  "Posts": [
    {
      "AuthorID": "20130502",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180494/profile",
      "Content": "May 20, 2015 03:02AM 20130502 wrote: I just started on the phase2 part of trial. I do have the ESR mutation so I get the extra biopsies. SE for me have been a little more than expected, heartburn like symptoms. We are working on figuring out how to manage. I am on 600 mg and at Dana Farber. Would love to stay in contact with all you others in phase one or two on this med.",
      "MessageIndex": 21,
      "PostDate": "20/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/807851",
      "Title": "Clinical Trial for ER+ Receptor Degradation Bestbird 20130502"
    },
    {
      "AuthorID": "20130502",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180494/profile",
      "Content": "Jan 11, 2014 11:50AM 20130502 wrote: sending you a big ol hug and lots of crossed fingers that those pesky markers come flying down.",
      "MessageIndex": 21,
      "PostDate": "11/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/816655",
      "Title": "marker results today ..having a hard time chris1959 naturelover"
    },
    {
      "AuthorID": "20130502",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180494/profile",
      "Content": "Jun 29, 2013 03:34PM 20130502 wrote: I also was stage IV at diagnosis (bone met only) and am on Femara + Xgeva only.  I am only 5 weeks into treatment however, so I don't know if it is working. Like you - sometimes I read about how many other things some people are getting and wonder if I am doing enough - but this treatment has pretty low side effects - so it is a good place to start.....",
      "MessageIndex": 13,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/805909",
      "Title": "Anyone out there with stage four treatment with femora only Donna7 curveball"
    },
    {
      "AuthorID": "20130502",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180494/profile",
      "Content": "Apr 5, 2014 08:21AM 20130502 wrote: PS. There is a similar trial to Paloma called Monaleesa with the Novartis version of the drug",
      "MessageIndex": 12,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819867",
      "Title": "From a lump to stage 4 within a month! What now ....... curleygirly Mompsych"
    },
    {
      "AuthorID": "20130502",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/180494/profile",
      "Content": "Apr 5, 2014 08:17AM 20130502 wrote: hello Curly, I am another. Like you I felt a lump and went from plans for a lumpectomy to stage iv diagnosis in less than three weeks.  Femara worked for me for the first 7 months and then I had \"progression\" in my markers so I had to switch treatment.  I found that the initial period and the switching treatment were very similar...scary and overwhelming.  But now that I am on a new \"plan\" my life has settled down sgain.  I try not to think too far out about the cancer.  I focus instead on today.  The one thing I can say well two....since you are newly diagnosed see if you can get into the Paloma trial with Femara and palbociclib. The results have been astounding and only newly diagnosed can get into it.  Two, my diagnosis did significantly change how I think about my job.  I am no longer willing to put up with things in the interests of \"getting ahead\". I insist on having my job tasks be the best they can be right now and have let my boss know this.  If I do live another thirty years I do not think I will regret having given up my \"career\" and might even have more chance for advancement this way anyway. Janet",
      "MessageIndex": 11,
      "PostDate": "05/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/819867",
      "Title": "From a lump to stage 4 within a month! What now ....... curleygirly Mompsych"
    }
  ]
}