{
  "AuthorID": "2angels",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9909/profile",
  "Posts": [
    {
      "AuthorID": "2angels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9909/profile",
      "Content": "Oct 7, 2008 03:47PM 2angels wrote: I am glad I found this thread. I have just made it to 5 years and I am still tired. I think this is a real long term side effect from treatment. I was treated for Hodgkins Disease in 1993. The radiation from that damaged my thyroid and I have been on synthroid ever since.  I was diagnosed and treated for breast cancer 10 years later and the side effects from the treatment this time have never fully gone away. I am always tired and feel drained. I just don't have the energy I used to. I know my husband thinks I am just lazy and use it as an excuse. I just know having poison pumped inside me has done something to my body. I feel like it is all in my head sometimes and then sometimes I know my body has taken a beating. The medical community needs to acknowledge this as a possible long term side effect. It is not our fault that our bodies no longer feel like they once did.",
      "MessageIndex": 91,
      "PostDate": "07/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/719657",
      "Title": "Still have the fatigue after 2 years. Mary-Lou Molly2013"
    },
    {
      "AuthorID": "2angels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9909/profile",
      "Content": "Jun 17, 2008 03:26PM 2angels wrote: Hi Grandma 1940, I am so sorry to hear about your daughter's breast cancer. I know my mom was so upset to see me have to suffer again when I too was diagnosed with breast cancer 10 years after being treated for Hodkins Disease. I finished treatment for stage 3 bc almost 5yrs. ago. It was scary when the whole process started because I had to get adriamycin again. My onc was afraid my cancer was so advanced that I needed to take the chance and have it again. When I was diagnosed with the bc my boys were 3 & 5. It was a scary time. I know this is difficult for both of you. I will keep you in prayers. Ann",
      "MessageIndex": 1,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707372",
      "Title": "breast cancer after hodgkins disease Grandma1940 Grandma1940"
    },
    {
      "AuthorID": "2angels",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/9909/profile",
      "Content": "Oct 8, 2008 03:10PM 2angels wrote: Congrats!!! It does feel good to have made it to the 5 year mark!! My boys were only 3 & 6 when I was diagnosed and I wanted so badly to be around to raise them. I have many long term side effects that cause me to think of my diagnosis every day,  BUT, I am living my life and watching my now 8 & 11 year olds get bigger and smarter. When you first hear those words \"you have breast cancer\" and then the whole process that follows to get you to NED, it is really hard work. It is hard on you and your loved ones. It sure is great to have reached this mile stone. Here's to another 5  years and then another 5 years, and then another....... Ann",
      "MessageIndex": 33,
      "PostDate": "08/10/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/721296",
      "Title": "5 years - NED Trish03 2angels"
    }
  ]
}