{
  "AuthorID": "2bubbas",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54826/profile",
  "Posts": [
    {
      "AuthorID": "2bubbas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54826/profile",
      "Content": "Apr 7, 2008 04:59PM 2bubbas wrote: Every time is slightly different.  But it's always,\" hey, it's over already?, I don't even remember falling asleep.\"  Usually I wake up hungry and thirsty.  For some bizarre reason I feel the need to fight to stay awake, I don't know why I don't just allow myself to drowse back off to sleep.  I like to know what's going on.  And also, after my first biopsy, the nurses were very chipper and talkative and commented about how happy I was.  So I also bizzarely have this need to be happy when I wake up.  The last surgery I was asking the guy, \"does it look okay?\" and he was like \"I don't know, I wasn't there\".  LOL!  Poor guy.  He's just there to push the bed... I've only been sick a couple of times after surgery and realize that every time I do a pre-op I need to tell them about it so that gets taken care of.  They have drugs, you know.  You don't have to suffer.  Just speak up. Right when you wake up, you are still pretty heavily drugged, so the pain won't come until later. Good luck on your surgery.",
      "MessageIndex": 18,
      "PostDate": "07/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703502",
      "Title": "Waking up after Surgery maryjaneFL SandyinSoCal"
    },
    {
      "AuthorID": "2bubbas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54826/profile",
      "Content": "May 1, 2008 02:04AM 2bubbas wrote: Jacqui - ouch!  That's a painful, and vivid imagination you have there!!  In reality, they give you some good drugs, you are asleep while it happens, and the scars fade and can be mostly concealed by a reconstructed nipple when all is said and done (if you go the recon route). Here's another thought to replace your medieval one... that large, beautiful boob is trying to kill you!!  Your more homely replacement (be it prosthesis or recon) will have a \"nice personality\" and let you live a nice, full life. You are not your boobs.  All that said, great big hugs out to you!  You've come to the right place to vent.  We get it.",
      "MessageIndex": 12,
      "PostDate": "01/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/704730",
      "Title": "Medieval imagery pre masectomy ! jacquibutterfly 2bubbas"
    },
    {
      "AuthorID": "2bubbas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54826/profile",
      "Content": "Feb 17, 2008 02:15AM 2bubbas wrote: Sandilee, I get terrible redness from an allergy to the adhesive they use for steri-strips.  It appears about 24 hours after surgery and lasts a long time.  I have pictures of it up on the picture site.  But I don't get bumps from it.  Blisters and peeling, but not bumps. However, from my last 3 surgeries, I have also gotten a different rash that usually is along my bra band and spreads down.  It's little red dots and bumps.  There is itching, but I don't know if it's from the allergy or the rash.  I even find that the rash will recur throughout the year, from heat and moisture.  (I live in a tropical climate)  The doctor has given me a cream to put on it which works.  It's an antifungal cream. Sometimes the itching you get from healing makes you scratch, which makes things look extra awful. I'm sure it's one of those things that she needs to see to diagnose.  My doc has also told me that I can take Benedryl to help with the itching.  Needless to say, it doesn't work.  Well, it does if you consider that it puts me to sleep, and I don't itch when I sleep! Let us know what she says on Monday!  Take care!  Sending soothing thoughts your way.",
      "MessageIndex": 5,
      "PostDate": "17/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/700447",
      "Title": "weird rash along incision site sandilee NST40"
    },
    {
      "AuthorID": "2bubbas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54826/profile",
      "Content": "Mar 24, 2008 06:11PM 2bubbas wrote: Hey Sandy, I had the single eye dialation happen to me once too.  I was on my way home from a long trip and had worn the patch the whole trip.  We were delayed in Dallas and had to sleep at the airport and I must've rubbed my eyes after taking the patch off.  I discovered the dilated pupil. The nurse traveling with us brought it to the attention of the airlines and our whole group got on the first available flight home.   We raced to the emergency room where they eventually determined it was the patch. Freaky, but it happens!",
      "MessageIndex": 3,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/702680",
      "Title": "Accidental Pupil Dilation SandyinSoCal 2bubbas"
    },
    {
      "AuthorID": "2bubbas",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/54826/profile",
      "Content": "Jan 9, 2008 10:29PM 2bubbas wrote: hi surgery buddy!  Same day, but much different procedures.  My mast. was Oct. '06.  My advice is to get a cheap one dollar back scratcher.  More than pays for itself.  A hand held shower head is wonderful for cleaning the lower half of your body.  A little pillow to prop your drain side arm up.  I walked around for ages with my arm at an angle, and had to make myself stop after the drain came out.  I slept for a while in a recliner.  At least until I got the drain out. Your good side arm will get more than it's fair share of work.  yes, you can use it freely.  Do your exercises and stretches on the recon side.  And walk, gently at first, as soon as you can.  It helps in healing.  And keep it up and build up as you heal, and as the doctor says is okay. I found the pushing down motion difficult for a while.  Like pushing down on an apple slicer/corer.  And cutting a pineapple in half.  Needed help for those things. Good luck to you tomorrow!",
      "MessageIndex": 5,
      "PostDate": "09/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/698176",
      "Title": "surgery Jan10/tomorrow-any advice? Jump07 lvtwoqlt"
    }
  ]
}