{
  "AuthorID": "2miraclesmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156300/profile",
  "Posts": [
    {
      "AuthorID": "2miraclesmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156300/profile",
      "Content": "2miraclesmom wrote: For years my friends and I have joked there had to be a way to squish our fat from one spot to another. lol Mainly our breasts! Well my new PS is going to do the second part of my DIEP surgery in two stages. She originally was just going to add the implants and the fat transplant at the same time (no TE's). Now, if my insurance approves it, she is going to take all the fat she can safely get and put it in my breasts. She says we should get at least another cup size. I really do not have that much fat, so I am OK with that. Then, in May of next year, she will put in the implants and use a little more fat to fill in and perfect the surgery. This way, we are hoping she can use smaller implants and we will get the same final size result and reduce the chance of capsular contraction by a little. Now if only my insurance company will cooperate. They haven't really been paying for anything. They approve everything, they just do not pay. Or at least they are taking their own sweet precious time!  Dx 8/18/2011, IDC, Left, 2cm, Stage IIIA, Grade 2, 5/22 nodes, ER-/PR-, HER2+ Surgery 9/20/2011 Mastectomy: Left, Right Chemotherapy 10/14/2011 AT Targeted Therapy 12/17/2011 Herceptin (trastuzumab) Radiation Therapy 4/30/2012 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "15/08/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/792076",
      "Title": "Fat transplant! 2miraclesmom 2miraclesmom"
    },
    {
      "AuthorID": "2miraclesmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156300/profile",
      "Content": "2miraclesmom wrote: I am a year out from chemo and had my last herceptin treatment on Dec. 12, 2012. My question is, why does my scalp hurt everyonce in a while? It is a weird kind of itchy pain. Does that make sense? It is not a sharp pain or even a dull pain. It is kind of like something has been sitting on my head or rubbing on it for to long and it is only on the top of my scalp. My hair is growing great. It actually came in thicker that it was before, which is nice.  Dx 8/18/2011, IDC, Left, 2cm, Stage IIIA, Grade 2, 5/22 nodes, ER-/PR-, HER2+ Surgery 9/20/2011 Mastectomy: Left, Right Chemotherapy 10/14/2011 AT Targeted Therapy 12/17/2011 Herceptin (trastuzumab) Radiation Therapy 4/30/2012 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/803531",
      "Title": "Scalp pain. 2miraclesmom 2miraclesmom"
    },
    {
      "AuthorID": "2miraclesmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/156300/profile",
      "Content": "2miraclesmom wrote: I really wasnt sure where to put this but I wanted to ask others about their monthly cycles and when they returned. Mine started back during radiation and have been regular for the past 4 months, but this month I am late. Just a few days, but there is no sign of it coming. No cramps, no chocolate craving. Nothing. The only reason I ask is because I do want more kids. I was told I was in permenant menopause and then bam, a cycle. Then my blood work showed everything was normal. I know I am probably worried for nothing, but how long did it take for others to get regular? Dx 8/18/2011, IDC, Left, 2cm, Stage IIIA, Grade 2, 5/22 nodes, ER-/PR-, HER2+ Surgery 9/20/2011 Mastectomy: Left, Right Chemotherapy 10/14/2011 AT Targeted Therapy 12/17/2011 Herceptin (trastuzumab) Radiation Therapy 4/30/2012 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "07/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/793146",
      "Title": "Monthly cycles. The womanly kind. 2miraclesmom 2miraclesmom"
    }
  ]
}