{
  "AuthorID": "2mnykds",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226059/profile",
  "Posts": [
    {
      "AuthorID": "2mnykds",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226059/profile",
      "Content": "Feb 11, 2016 02:00PM 2mnykds wrote: Finished treatment on Monday. They had a bell to ring and after that I went out just hugged my hubby and cried. Didn't realized it was going to be so emotional at the end. I'm still having skin issues but since my last 4 treatments were boosts I'm hoping they clear up quickly. Thank you to everyone on this board it's been a blessing to read these comments and help me throught this bump in my life. To those still in treatment there is a light at the end. Hugs to all of you ",
      "MessageIndex": 1220,
      "PostDate": "11/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "2mnykds",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226059/profile",
      "Content": "Dec 24, 2015 09:13PM 2mnykds wrote: This is my first post on here. I am starting Rads around the 11th of Jan. My RO recommended the Canadian Protocol so I've been trying to research that versus the \"American Protocol\". I met with the RO on Monday and that was the first time someone went over my entire pathology report. It was a lot of information and quite intimidating for my husband and I. I am scheduled for what I guess is my SIM on Jan 4th. Not sure what to expect so nervous about all of it. This is the first time I've had to deal with any surgeries, doctors, etc except for having my kids. Hoping this blog will help with this next process",
      "MessageIndex": 278,
      "PostDate": "24/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "2mnykds",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226059/profile",
      "Content": "Dec 25, 2015 05:40PM 2mnykds wrote: StefLove - thank you for the welcome. I think I found more information here than I did trying to google the treatment. And right now my treatment is set for 20 treatments over 4 weeks. He mentioned 15 minutes and I am not sure if that's 15 min of radiation or the entire appointment time. octogirl - my treatments are currently set for 20 treatments over 4 weeks. I am very lucky that the oncology center is less than 5 miles from my house Suz-Q - thank you thank you thank you for all the details. It helps me to have some image in my head of what will be happening. Another question for everyone - are you working while undergoing radiation or taking time off work? Thank you to everyone for answering questions and offering advice. It's greatly appreciated",
      "MessageIndex": 285,
      "PostDate": "25/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "2mnykds",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226059/profile",
      "Content": "Jan 23, 2016 04:15PM 2mnykds wrote: I haven't been on for a while and want to say congrats to those finishing. 😄 I'm almost halfway there at #9 of 20 completed. One of the things I love about reading these posts is realizing that I'm not going crazy. I didn't have chemo but radiation has made me so emotional. Anything anyone said to me I burst into tears. My Dr said it's because it's finally calmed down in my life and I'm finally processing everything. Since my dx my life has been busy between appointments surgery and holidays. It's just nice that it's a normal reaction. Just wanted to say thank you to all of you that post. When I find the time to read it can bring a smile to my face with all the support I see. Hope everyone enjoys their weekend and the two days off",
      "MessageIndex": 833,
      "PostDate": "23/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    },
    {
      "AuthorID": "2mnykds",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/226059/profile",
      "Content": "Jan 12, 2016 12:42PM - edited Jan 13, 2016 07:14AM by 2mnykds Started treatment #1 today with the Canadian treatment with 20 scheduled. Tonight I noticed the my breastfeeding is swollen. Is this common? This whole adventure is a little freaky for me and reading all your posts really help. I'm glad I found this site. Just sharing in your daily struggles and successes gives me hope. My diagnosis is not as severe as others so no chemotherapy for me and this being my first ever medical issue besides childbirth has thrown me into a situation I'm so lost in. Thanks to everyone who shares I truly appreciate you!",
      "MessageIndex": 541,
      "PostDate": "12/01/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/836649",
      "Title": "Winter 2015-16 RADS mdoc524 kbutler"
    }
  ]
}