{
  "AuthorID": "2Tabbies",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
  "Posts": [
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 5, 2014 12:53AM 2Tabbies wrote: hopefour, my MO also told me that hormone therapy is more effective on my type of cancer than chemo. I think it was more that it was invasive lobular rather than the grade. He didn't mention the grade. I did have chemo because the oncotype test showed just enough likelihood of recurrence that he thought it was worth it. But he said it was Tamoxifen and AIs that are more effective so they're going to be my best friends for 10 years. I'm on Tamoxifen now for 2-3 years then he'll switch me to something else.",
      "MessageIndex": 540,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 6, 2014 04:39PM 2Tabbies wrote: dancingdiva, I know what you mean about being worse off than others at a support group. In my case, it wasn't actually at a support group, but just various women at my church who had had breast cancer. People were constantly introducing me to someone else who'd had breast cancer and is fine now years later. Come to find out most of them were stage I. I didn't find it helpful since their situation doesn't apply to me. I did go to another group where I wasn't the worst. It was one of those \"Look Good, Feel Better\" sessions put on by the American Cancer Society. There were two women in there with stage IV cancer. One of them had been given a pretty dire prognosis, and was weepy. I felt so bad for her. In a way, I was glad not to be the worst off for once, but then I felt guilty even think that in the face of where these other women were.  Regarding whether the chemo is working, I had the same question and got the same answer. They don't know. They just hit me with shotgun approach of treatment - surgery, chemo, radiation, and Tamoxifen and hope it does the job. I thought they'd do some scans to check for a recurrence at least, but they don't. Apparently, studies have shown finding a recurrence on a scan doesn't buy you a longer life over finding it when symptoms occur. Also, the scans produce a lot of false positives causing women to go through biopsies and a lot of stress for no reason. Frankly, even though I understand they're logic for not doing scans, I still wish I could have one maybe once a year. I'd gladly put up with the stress of waiting for results or having to undergo a biopsy only to find it negative. I'd prefer that to the stress of constantly living in limbo. But that's just me. A lot of people really hate waiting for the test results. If I was super rich, I might figure out a way to get one and pay for it myself. I guess we should both start buying lottery tickets! You might not get bone pain from the Neulasta. I didn't. Fingers crossed for you. I hope you can keep the nausea under control. Eat whatever sounds good and doesn't upset your stomach. I ate a lot of mashed potatoes and ice cream. Comfort food. ",
      "MessageIndex": 548,
      "PostDate": "06/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 8, 2014 09:07PM 2Tabbies wrote: sbelizabeth, I guess he meant it's too late to catch the cancer early overall since we didn't catch it until it was stage III. (That's what I get for having the stealth breast cancer - doesn't show on mammograms and doesn't feel like a lump on palpation.) He also said finding the mets on a scan would only mean I'd know I was stage IV a few months earlier than I would have without the scan (i.e. when symptoms appeared). I told him that despite the fact that it might not extend my life, I'd want to know those few months early. I'd quit my job since it would no longer be necessary to save for a lengthy retirement. Then I'd enjoy those few symptom-free months. He admitted I had a point, but said that he couldn't practice medicine based on that. However, he'd be happy to \"work me up\" if I came in complaining of symptoms. Hmmm...what symptoms should I have?",
      "MessageIndex": 563,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 10, 2014 09:24AM 2Tabbies wrote: kathec, sorry if I misinterpreted your question about mammograms.  It must be frustrating to have had such different results on the PET scans. My MO said their are a lot of false positives. Maybe some of what was seen on the first one was that or the chemo/hormonals knocked it on it's butt. Does you doc have any explanation? I can understand your frustration. I hate being in the dark.",
      "MessageIndex": 568,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Nov 22, 2014 08:42PM 2Tabbies wrote: Welcome, Nursie, Laura, and Lolis. I'm sorry you have to be here with us, but glad you found us. I hope we can provide some comfort and support. So ask questions, vent, rant, whatever helps. We'll listen. Holeinone, I agree with you on the \"just stay positive\" comments. That crap starts to become magical thinking where those with a positive attitude survive and those with a negative attitude don't. It's blaming the patient. My MO said the survival rate was around 70%. He also said that I should \"consider myself cured\" when I was finished with active treatments. I think that would somewhat be like ignoring reality especially since I've had ovarian cancer and also have a form of non-Hodgkins lymphoma. I think it's more realistic to consider myself as having a decent chance at being cured. I'm not sure the statistics on survival mean much since they seem to vary so much. Lolis, I had the same experience as you when treatment was done. That's when the emotional birds came home to roost. That nurse practitioner Holeinone saw sounds awesome. I think I'd have handled the transition back to \"normal\" better if I'd had someone like that to talk to. I almost felt abandoned when my active treatment was over since they don't do much in the way of follow up.",
      "MessageIndex": 639,
      "PostDate": "22/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jan 9, 2015 08:01PM 2Tabbies wrote: dstar, good to hear from you. I agree that the port is totally worth it. I hope that thing on your rib is an old injury. These scares get tiresome, don't they.",
      "MessageIndex": 680,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jan 19, 2015 05:39PM 2Tabbies wrote: Wrmbrownie, sorry you needed to join us here, but welcome. I had a large tumor. I'm not sure why nobody suggested doing chemo first to shrink it. I think because from what the MO told me, chemo doesn't work very well on this type of cancer. He wasn't even sure he was going to do chemo until he got the results of the oncotype test back, and that test was done with tissue from the mastectomy. Hang in there. We're here to offer support so feel free to ask questions, rant, whatever you need to do. madalene, burn them? :-) I am having recon, but the one upside of all of this is that I won't have to wear a bra.",
      "MessageIndex": 694,
      "PostDate": "19/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jan 21, 2015 08:23AM 2Tabbies wrote: magdalene, the problem I had wearing bras when I was flat was that they rode up. I was always tugging them down. The mastectomy bras with silicone prosthetics even did it some although not as bad as when I used lighter weight prosthetics. I can see where you wouldn't want to just throw away that expensive bra though.",
      "MessageIndex": 696,
      "PostDate": "21/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Mar 20, 2015 11:06PM 2Tabbies wrote: Welcome, Nancy and LadyB! I hope you both start feeling better soon.",
      "MessageIndex": 807,
      "PostDate": "20/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Mar 22, 2015 08:09PM 2Tabbies wrote: Tuff, I can't believe that clinic still says they haven't gotten your records. Unbelievable. Of course, I had a PS who swears he doesn't have the photos I distinctly remember him taking. So sorry to hear you're in such pain and other discomfort. Maybe your new MO can at least switch you to a different AI to see if it helps with the side effects. I've not had too bad a time (it's all relative) with Tamoxifen and am dreading switching to an AI a couple years down the road.",
      "MessageIndex": 809,
      "PostDate": "22/03/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Apr 26, 2015 07:19PM 2Tabbies wrote: Eaglemom, I'm glad you have some appointments scheduled and a general plan in place. I had my hair cut short before chemo also. I couldn't find anyplace to donate it though. It had too much gray for the places who make wigs for kids. I would have thought somebody might want gray hair for older women going through chemo, but apparently not. Too bad. I had nice hair. I definitely think you made the right choice by going with a BMX. I agree with you on just doing it all in one shot too. A port is also way less trouble than a PICC line. Lots of us who have had them were very glad we did. I don't know what chemo you're getting. I had cytoxan and taxotere. It really wasn't that bad. I felt like I had the flu for a few days each cycle. Muscle aches and fatigue mostly. I worked part-time through it. I had my treatment on Thursday, and didn't feel bad until about Sunday. So I'd take most of the following week off then go back to work until the next treatment. I am fortunate that I could work from home if I needed to. I didn't find radiation all that bad either. I think radiation for ovarian cancer would be worse since it's likely to affect the other nearby organs. I didn't even have the bad fatigue from radiation that you hear about. I worked the whole time. You live in a beautiful part of the world. I have fond memories of a Vancouver Island vacation a few years ago. I hope you can get the genetic testing done. I had it done just because I had ovarian cancer and had an aunt who had some kind of gynecological cancer. It was the 50s when people didn't talk about such things so we aren't sure what she had. Anyway, my GYN ordered the BRCA testing for me before I was even diagnosed with BC. I turned out I don't have the genes. I wish I had because I'd have had a prophylactic mastectomy and spared myself stage III breast cancer. I'll be thinking of you and DayLily, and Tanyah and anybody else still going through treatment. Hang in there, everybody! It doesn't last forever. I don't know if you've ever wished for curly hair, but you might get it from chemo. I did. It's a small silver lining.",
      "MessageIndex": 850,
      "PostDate": "26/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Apr 28, 2015 09:30PM 2Tabbies wrote: LHF, welcome to our group. Sorry your qualify to be here, but I hope we can offer some support. FWIW, here's my advice. Take one day at a time. Be kind to yourself, and ask for help when you need it. Ask all your questions. People here are happy to help you from their experience, but also ask you docs. Make a list of questions for your appointments. Feel free to rant here anytime you need to. All of us need a rant now and then.",
      "MessageIndex": 855,
      "PostDate": "28/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Aug 20, 2015 12:35PM 2Tabbies wrote: Gaia, how did the scan go?",
      "MessageIndex": 999,
      "PostDate": "20/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 14, 2015 11:48PM 2Tabbies wrote: Tall, I'm sorry you got to join this select group. you've gotten lots of input, but I thought I'd tell you my perspective. I didn't know what I was going to want to do regarding recon at the time of my mastectomy. I thought I might not mind being flat, and the PS I consulted said I could have \"any procedure I wanted at any time.\" Since he said that, I decided to postpone the decision. Only later did I find out that radiation has a big impact on recon. As it turned out, I detested, being flat. I gave it about 10 months to see if I'd get used to it, but I just couldn't. I figured I'd just get implants, but both PS's I consulted at that time said the failure rate after rads is too high and recommended a flap procedure. In fact, the PS I chose, flat out won't do implants after radiation without a flap. Radiation thins and weakens the skin and muscle and reduces its blood flow so it doesn't hold up well to implants. It also has a higher chance of capsular contraction. I was pretty pissed that I'd been misled. The only flap procedure I qualified for was the latissimus dorsi flap so that's what I got. I'm happy with how I look in clothes. Without clothes, well, it could be worse. The scars and flap of skin from my back are pretty obvious but should improve some with time. Bottom line is that I wish I'd come to this PS for a second opinion before my mastectomy. I thought of it, but because of what the first PS had said, I opted to wait. Lesson learned .",
      "MessageIndex": 1019,
      "PostDate": "14/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 5, 2014 08:43PM 2Tabbies wrote: genny, that is awesome news! And how wonderful your doc called you tonight instead of making you wait all weekend.",
      "MessageIndex": 545,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 7, 2014 08:08PM 2Tabbies wrote: Dancingdiva, I ask my MO the same question about finding a recurrence earlier rather than later. He said that even by the time it shows up on a scan, it's spread everywhere. I know I should believe him and just let it go, but it's hard. I want to feel like somebody has my back, in the military parlance of the day, but I'm not really feeling like that. Maybe with time. I think that new law requiring them to offer an MRI if you have dense breasts might have just gone into effect in January. Too late for me if that's the case. The radiologists who read my mammograms over the years always said that the tissue was so dense that it was hard to see anything. I always wondered why the hell they didn't do an ultrasound or an MRI. Other than cost. I guess an ultrasound is useless if you don't have a particular spot to focus on like something suspicious they found on a mammogram or a lump. One of my docs told me that you can see all sorts of shadows and things on ultrasounds that may or may not be anything, so they really need to have a localized area to look at.  Sorry to hear you got your period. That was the one silver lining for me when I had ovarian cancer. No more uterus. No more periods to deal with. Sleep tight!",
      "MessageIndex": 552,
      "PostDate": "07/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 8, 2014 05:49PM 2Tabbies wrote: Kathec, in my case I have not nothing left to mammogram. But in any case, finding it in a breast is different from finding mets in another part of the body.  A tumor in the breast would either be a local recurrence or perhaps even a new occurrence of a different breast cancer.  Like you, I'm still all for catching any mets when they're too small to cause symptoms.  But when I asked my MO if as scan would catch it \"early,\" he literally said it's too late for that. That made me feel awful like I hadn't been as vigilant as I should have been even though I did all the things they tell us to do. I'm still frustrated and don't want to accept that there isn't some sort of monitoring that would be useful.  I guess it's like Lolis said.  The treatment will either work or not.  But damn, that make me feel helpless and angry especially since the type of bc that I have doesn't respond well to chemo. I hate this.",
      "MessageIndex": 561,
      "PostDate": "08/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 13, 2015 12:34PM 2Tabbies wrote: Holeinone, I hate that \"just stay positive\" crap. There's a book called \"Bright-Sided\" by Barbara Ehrenreic that gives a different view of the whole positive thinking phenomenon. She's not advocating going around having a constant pity party, but being constantly told to \"stay positive\" denies our feelings and our reality.",
      "MessageIndex": 723,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 16, 2015 07:15PM 2Tabbies wrote: Robin, I so agree on not sugar coating things.",
      "MessageIndex": 738,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Apr 10, 2015 09:44AM - edited Apr 10, 2015 09:48AM by 2Tabbies Hi Katey, I'm sorry you've had to join this club. Yes, it's all about cancer for a while. As Jen said, it does get better. You'll get through these rough days. Take them one at a time. One minute at a time if you need to. I found it helpful to \"take a break\" from cancer with a good book or movie or a short day trip someplace relaxing if you're up to it. A walk in nature worked for me. I hope you have people to support you. Sending virtual {{{hugs}}}. Amy",
      "MessageIndex": 812,
      "PostDate": "10/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "May 5, 2015 10:34PM 2Tabbies wrote: Gator, I didn't have neoadjuvant therapy, but sometimes I wish I had. I had a big tumor. I wish we could have shrunk it. It would also have been nice to know if the chemo was effective. I had chemo after surgery so there's no way to know if it helped. Hang in there. I'm sorry you had to join this \"club.\" I hope you can find some comfort knowing that others have gotten through treatment before you. Just take one day at a time. Trite advice, I know, but it does help.",
      "MessageIndex": 879,
      "PostDate": "05/05/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jun 5, 2015 09:43AM 2Tabbies wrote: Glad you're feeling better, cchix49. You can get through this. It's a cliche, but one day at a time is the way to do it.",
      "MessageIndex": 920,
      "PostDate": "05/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jun 20, 2015 10:52AM 2Tabbies wrote: live, I love wine too. Not giving it up.",
      "MessageIndex": 946,
      "PostDate": "20/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Apr 6, 2016 03:49PM 2Tabbies wrote: Hello, Artista and El_Tigre, and all the others who have joined recently. I haven't checked in here in a while. I'm sorry you all have reason to be here, but glad you found this forum. I think you'll find lots of support here. For those just starting or in the midst of treatment, hang in there. It does end.",
      "MessageIndex": 1146,
      "PostDate": "06/04/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Aug 30, 2014 09:54PM 2Tabbies wrote: I'm glad you had a better day, dancingdiva. I didn't get a Neulasta injection after my first chemo (due to a screw up), and my WBCs tanked like yours did. After that, I did get Neulasta, and they were fine. Incidentally, I didn't experience bone pain with it. Not everyone does, but the Claritin is a good idea just in case.",
      "MessageIndex": 536,
      "PostDate": "30/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 10, 2014 04:09PM 2Tabbies wrote: kathec, that sucks that your doc doesn't know why you different results on your scans. I think you said you've found a different oncologist, right? I hope that person is a better fit and can give you some answers. I'm sure my docs think I'm a royal pita also. I ask tons of questions. I went for second consult with the PS who's scheduled to do my LD flap because after reading the book he recommended I had a lot more questions. I got the impression that it was a bit unusual for somebody to research it as much as I had. I'm sure he thinks I'm a neurotic worrier, but tough. I don't like surprises and feel better when I have all the information - the good, the bad, the likely and the unlikely. I don't know how tough I am. The ovarian cancer was relatively easy. It was stage 1a so I \"only\" had 2 surgeries - the hysterectom/oophorectomy then an abdominal exploratory to look for mets and biopsy lymph nodes. My lymphoma (Waldenstrom's macroglobulinemia) has mostly been a non-issue so far. They don't treat it until you have symptoms that warrant treatment, and so far I haven't. I just get blood tests to monitor it a couple times a year. Breast cancer has been worse than the other 2 put together. I am starting to wonder why my body seems to be such a good incubator for cancer cells. Nobody has an answer to that question.",
      "MessageIndex": 570,
      "PostDate": "10/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 14, 2014 12:07AM 2Tabbies wrote: Natural, sorry you're on this cancer train ride with the rest of us here. It sucks. I'm glad you have decided to go ahead with chemo though. I think we all would have avoided it hadn't been our best bet for beating this thing. I've known a few people who went with natural treatments only for cancer or other serious diseases. It didn't work out so well for them. Hang in there. You'll get through the chemo. I'm betting you have healthier habits than the average person so might bounce back faster.",
      "MessageIndex": 578,
      "PostDate": "14/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 14, 2014 12:12AM 2Tabbies wrote: Lolis, I've been a pescatarian (vegetarian except I eat fish) for years. Sadly, it hasn't kept me from getting cancer 3 times, but maybe I'd be even worse off it I'd been eating an unhealthy diet. Who knows. I find it a bit frustrating that I've always had healthy habits yet keep getting cancer. Anyway, as far as diet goes, I'm just still trying to stick with mostly whole foods, lots of fruits and veggies, beans, whole grains, etc. While I certainly eat some raw foods, I haven't seen anything to convince me that a completely raw diet is advantageous. Some nutrients in foods aren't available to the body unless it's cooked. I hope you settle on something that works for you.",
      "MessageIndex": 579,
      "PostDate": "14/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 15, 2014 09:29AM 2Tabbies wrote: Lolis, I thought I replied to you last night, but I don't see that post.  Did I hallucinate it??? Do you think coffee makes your hot flashes worse? I haven't noticed a difference on days that I drink it versus days that I don't.  The hot weather this summer sure made them worse though. I was worried my hair would thin because of the Tamoxifen also, but it hasn't.  It's not silly.  All these changes are an assault on us. We just want something to be normal. ",
      "MessageIndex": 588,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 23, 2014 07:41PM 2Tabbies wrote: Dancingdiva, mostly I buy online at the sites I listed in my post above.",
      "MessageIndex": 606,
      "PostDate": "23/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 28, 2014 05:34AM 2Tabbies wrote: Hi, bride, I think Teavana's tea is OK, but overpriced. I tried them once. The teas are good, but no better than the other places I mentioned and more expensive.",
      "MessageIndex": 621,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 22, 2014 12:50AM 2Tabbies wrote: dstar, I don't mind the questions at all. That's what the forum is for. I did have genetic testing a number of years ago. My doctor thought it was a good idea because I'd had ovarian cancer and lymphoma and had an aunt who had probably had ovarian cancer. We aren't positive, because that was back in the 50s, and people didn't talk openly about cancer. As it turned out, I don't have the BRCA genes. I wish had tested positive for them. I would have had a prophylactic mastectomy and avoided the entire breast cancer trip. The reason I had the prophylactic mastectomy on my right breast was that the MRI found some suspicious areas that needed to be watched in that breast. After years of mammograms that couldn't see through my dense tissue, ultrasounds, MRIs, and biopsies, I'd had enough. I'd also been told ILC was more likely to recur in the opposite breast than other breast cancers. I just wanted to be done with it. Given my history, the hospital tumor board felt that was a reasonable course of action. As it turned out, there was no cancer in that breast, but who knows if it might have shown up later. My tumor was 5 x 8 cm. I couldn't believe it when they told me that. How could it have been that big and not have felt like anything except the dense, thick tissue I'd always had? But there it was. I'm feeling ok, physically. I'm still feeling kind of tired and beat up emotionally and mentally. Some of that is mood swings that are a side effect of the Tamoxifen I'm taking. I'm also in the middle of reconstruction now which of course has been physically tiring. It's been a bit of a psychological boost though. After I had the first fill of my tissue expanders and looked relatively normal in a shirt for the first time in 16 months, I was practically giddy. I admire the women who can embrace being flat, but it just isn't me. That was kind of a surprise to me. This whole adventure has been full of surprises. Mostly bad, but I did get curly hair after it grew back. When people ask me if I've had a perm, I say yeah, at Salon Chemo. ;-) Good luck with your chemo. I think what you're having a pretty common protocol. It's nice that you found someone else having it at the same time so you can cheer each other on. I had cytoxan and taxotere, but not adriamycin. I'm not sure why. I think because my oncotype was just barely high enough to make chemo worthwhile so my MO said he was giving me \"chemo lite.\" I guess the benefits of the extra drug in my case weren't worth the side effects in his view. In a way I wish I'd had it. I wanted to go at this thing with all guns blazing. I'm glad this experience has helped you heal from an earlier trauma. That's a bright spot. I'm glad you found my tea tutorial useful too! I'll raise my morning cuppa to you!",
      "MessageIndex": 662,
      "PostDate": "22/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jan 21, 2015 05:03PM 2Tabbies wrote: Madalene, I see what you mean. I had an empty flap of skin like that on the side that didn't get radiation, but it had shrunk up on the radiated side. What I had left wasn't enough to keep a bra down where it belonged.",
      "MessageIndex": 698,
      "PostDate": "21/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jan 23, 2015 07:18PM 2Tabbies wrote: \"I am going to make it through TX because there is no other viable option.\" Exactly, JustKeepSwimming. There is no viable option. You'll make it.",
      "MessageIndex": 701,
      "PostDate": "23/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 13, 2015 12:21AM 2Tabbies wrote: Welcome, Anna. I'm so sorry for all you've been through. You really had a double blow. I found that radiation was a lot easier than chemo. Fatigue can be the worst part, but I didn't really find I got any more fatigued than I had been after chemo. Maybe you'll be lucky in the regard as well. One thing that I wasn't warned about was that some of us experience depression after treatment is over. We concentrate on getting through each day during treatment and don't think too far ahead. Then treatment is over, and we're no longer seeing doctors and getting treatments frequently. We're just supposed to get back to \"normal\" life, but our life has changed. It can be hard. Not everyone goes through this, but if you do, you're not alone. Best of luck with the radiation. I hope it's a piece of cake for you. Do check in and tell us how you're doing or if you have questions or just need to rant.",
      "MessageIndex": 721,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Apr 25, 2015 01:46AM 2Tabbies wrote: Tectonic, nice that you get scans so you know your NED. My MO says the standard is not to do scans anymore because finding mets on a scan doesn't prolong life versus finding them when symptoms occur. So, he doesn't do them. I'd love to know I was NED. So far, I don't have any symptoms of a recurrence as far as I can tell so fingers crossed.",
      "MessageIndex": 843,
      "PostDate": "25/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jun 10, 2015 02:26PM 2Tabbies wrote: live, rads are definitely easier than chemo when you're going through them. The can have some long lasting side effects but hopefully nothing severe. I was kind of sorry when I was done with rads because the techs were so nice.",
      "MessageIndex": 927,
      "PostDate": "10/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jun 17, 2015 05:59PM 2Tabbies wrote: gaia, glad to hear you had a successful and relatively easy surgery. I also feel that my healthy lifestyle failed me. Or maybe I'd be dead by now if I hadn't lived that way. I can't offer any insight on doing \"hormonal onky\" treatment since I got the whole smorgasbord - BMX, chemo, rads, Good luck with whatever you choose.",
      "MessageIndex": 934,
      "PostDate": "17/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 19, 2015 06:17PM 2Tabbies wrote: TallnTerrific, I've never heard of that either. I hope you get more information soon. Hang in there.",
      "MessageIndex": 1028,
      "PostDate": "19/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 4, 2015 04:19PM 2Tabbies wrote: Running, you definitely aren't alone.",
      "MessageIndex": 1060,
      "PostDate": "04/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Aug 15, 2014 03:12PM 2Tabbies wrote: Hi all. I'm not new to being a stage III since I was diagnosed in July 2013, but I'm new to this web site so thought I'd say hello in this thread.  Genny, my story is similar to yours. I saw a bit of nipple retraction 1 day but didn't think too much of it because it was right where I had a scar from a surgical biopsy. Besides, it was gone the next day, I couldn't feel a lump, I'd had a clear mammogram a couple months before, and my GYN hadn't felt anything on a manual exam a couple months before. A little bit of denial goes a long way. I admit it. I finally went to the doctor a couple months after I saw the retraction because the \"normal\" dense area in my left breast had started to feel larger than the similar area in my right breast. It was ILC like you have. The tumor was 5x8cm so it was a big sucker. Nobody tells you there's a type of BC that doesn't show up on mammograms and doesn't feel like a lump. My docs assure me that coming in a few months earlier wouldn't have made any difference.  At the moment my quandary is reconstruction. I had wanted just implants, but found out that those have a high rate of failure after radiation. I sure wish the PS I saw last year before my mastectomy would have mentioned that. I'd have started the expansion process then. So now I'm stuck with one of the flap procedures which I really didn't want. I'm not a candidate for the abdominal ones because of my ovarian cancer surgery. The PS I saw in June (different guy from last year) is recommending a lat flap with an implant on the irradiated side, and just an implant on the \"good\" side. I have another appointment with him next week to discuss other possible options since I'm not thrilled about removing my lat muscle from performing its normal duties. I'll go with it if nothing else sounds better though.",
      "MessageIndex": 512,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Aug 29, 2014 09:49PM 2Tabbies wrote: Dancingdiva, maybe the chemo is hitting the cancer cells as hard as it's hitting your WBCs. Take a breather and get some rest if you can. Cancer treatment is an emotional roller-coaster and unfortunately, a rather long ride.   Hang in there.",
      "MessageIndex": 523,
      "PostDate": "29/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 5, 2014 12:12PM 2Tabbies wrote: genny, I'm hoping for good results from your PET scan.  When do you expect to hear? ",
      "MessageIndex": 543,
      "PostDate": "05/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 15, 2014 09:21AM 2Tabbies wrote: genny, I'm so sorry you're having to deal with insurance crap. That's the last thing any of us needs when we're going through cancer treatment.  I'm 57 and post-menopausal also, but I'm on Tamoxifen which I started after I was done with rads. I thought the only reason to wait was to keep me from having to deal with too many side effects at once.  My MO said I'd be on it for a couple years then switch to \"something else. \" I assume he meant an AI.  I'll have to ask him why he put me on Tamoxifen since I am post-menopausal.   Good luck with your insurance issue.  I hope UH gets your insurance company to relent.  They are being unreasonable. ",
      "MessageIndex": 587,
      "PostDate": "15/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 18, 2014 09:37AM 2Tabbies wrote: sbelizabeth, I will do all that when I'm at my computer where it's easier to type.  It may be a long post! ",
      "MessageIndex": 594,
      "PostDate": "18/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 17, 2014 09:52PM 2Tabbies wrote: dancingdiva, when you're ready to start green tea, let me know. I am a tea fanatic and happy to make suggestions if you want them. Btw, loose leaf tea is way better than anything you'll get in a tea bag. It's usually better quality and fresher. I didn't like green tea until I tried good loose leaf.",
      "MessageIndex": 592,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 20, 2014 09:53PM - edited Sep 20, 2014 09:55PM by 2Tabbies You are all quite welcome on the tea info. Let me know if you have any questions. dancingdiva, I can't help you on the androgen receptors. I didn't get tested for that unless they called it something else.",
      "MessageIndex": 601,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 20, 2014 03:37PM - edited Sep 20, 2014 03:38PM by 2Tabbies For all who are interested in green tea, here's my spiel. You may be sorry you asked! First a little tea primer. All true tea comes from the same plant Camellia sinensis. Anything else that's steeped in hot water to produce a beverage is more properly called a tisane not tea. The difference between green, oolong, and black teas is in the processing. Green tea is minimally processed. The leaves are not allowed to oxidize after picking. (You'll often hear the term ferment rather than oxidize, but technically it's oxidation not fermentation.) Black tea is fully oxidized. Oolong is somewhere in between anywhere from nearly green to nearly black. White tea is a green tea, but just the buds are used instead of more mature leaves.  As I mentioned, I prefer loose leaf tea. It's usually fresher and of higher quality that tea bags. The leaves in tea bags are also usually chopped up into little pieces. This increases their surface area and allows them to go stale faster. You can find some tea bags with whole leaf tea. The Two Leaves and a Bud that kathec mentioned looks like it might be whole leaf tea. These tend to be more expensive than just buying it loose though. Speaking of price, a lot of people balk at the price of higher quality teas which can ranger from $3 an ounce on up. It might sound like a lot, but tea doesn't weigh much, and you don't need much to brew a cup. The actual cost usually works out to way less than a dollar a cup often around 25 cents. Compare that to the $3 and $4 lattes we buy without even blinking. Regarding flavors, I tend to go for unflavored tea, but will occasionally drink some of the more traditional flavored (or scented) teas. I love jasmine scented tea. The Japanese to a cherry scented tea that's lovely. Occasionally, I'll get one of the fruit flavored ones for iced tea.  Equipment: You can go fancy or basic. Beware though! Teaware is as addicting as tea! Do NOT use a tea ball.  They don't have enough room in them to allow the water to circulate around the leaves. I commonly use a basket style infuser like this. It's a simple way of brewing one cup at a time. You can also get fillable tea bags. You can steep it loose in a teapot. Some teapots have a strainer built into the spout so you don't need a separate strainer. Otherwise, use a small strainer to filter out the leaves as you pour. Here are a couple of styles of pots that I like: Chinese Yixing teapot Beehouse teapot - comes with a basket infuser If you want to go really basic, steep the the tea in a pyrex measuring cup and pour into your cup or mug through a strainer. Preparation:  Green tea wants a lower water temperature than oolong or black. Around 160-190 degrees F is good. If you don't have a thermometer, look for tiny bubbles starting to form in the water. Place about a teaspoon of  the leaves into your pot or infuser for each 5-6 ounce cup of tea. If the leaves are really fluffy use more. You might have to experiment with the amount. The package may give you guidelines. The best way to do it is to weigh it. I have a little tea scale that can be set to ounces, grams or \"cup weight.\" I use that with a new tea until I know how leaf much to use. Rinse the leaves and cup/pot with some of the hot water. This warms everything up and rinses away any dust, etc. on the leaves. After draining off the rinse water, fill your cup or pot with the hot water and let steep for 2-3 minutes. Again, you may have to experiment, and the package may give you guidelines. With a good quality green tea, you can steep the leaves a second and possibly even a third time. I told you it was a bargain! Which teas to choose? I prefer Chinese green teas, but there are also some great ones from Japan. I haven't found many Indian green teas that I like, but I love some of their black teas. You might also check out a \"green\" or \"jade\" oolong. These are oolongs that are only slightly oxidized so are almost green. Some of them smell and taste like flowers even though they have not been scented. If you're lucky, you might have a tea shop near you that sells good quality loose leaf tea. Some better grocery stores have it. If you happen to have a Wegman's supermarket near you, they have a great bulk tea section. Here are some of my favorite web sites to buy tea.  Silk Road Teas - I love their Green Mist. Many others to choose from also. Sensational Teas - Very pearl jasmine and Pi Lo Chun. Tell Mary that Amy sent you! Upton Tea - huge selection Finger Lakes Tea Company - found this place this summer. Go for a visit and tasting if you're in upstate NY. Tea From Taiwan - excellent oolongs Den's Tea - Excellent Japanese teas. I love their green kukicha. It's made from the twigs rather than leaves of the tea bush. It's supposed to be lower in caffeine. There's also a roasted version, but I like the green. Enjoy!",
      "MessageIndex": 597,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 23, 2014 03:54AM 2Tabbies wrote: Glad to be of service, holeinone and sbelizabeth!",
      "MessageIndex": 604,
      "PostDate": "23/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 21, 2014 09:13PM 2Tabbies wrote: Hi,  Janiner, I can't answer your question on the PET scan because I didn't have one, but I remember sweating through a CT and a bone scan. I hope you don't get any more bad news and that you find this board helpful.",
      "MessageIndex": 612,
      "PostDate": "21/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Nov 10, 2014 07:08PM 2Tabbies wrote: Bamemory, this must be really tough to deal with since your mom has Alzheimers. Did the oncologist do an oncotype test to determine the risk of recurrence. ILC has a higher chance of recurrence in the other breast, which is one reason I opted for a bilateral mastectomy, but the oncotype would determine the particular risk of recurrence for your mom. If I were you, I'd get tested for the BRCA genes, but that's definitely something to ask the oncologist.",
      "MessageIndex": 623,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Nov 24, 2014 11:31PM 2Tabbies wrote: I agree with Hopefour's advice on walking and staying hydrated. Also, get as much rest as you can. Let other people help you. It does suck that several of you got this blasted disease at a young age. It's sucks at any age, but at least some of the rest of us had a few more healthy years before getting it.",
      "MessageIndex": 643,
      "PostDate": "24/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 17, 2014 08:56PM 2Tabbies wrote: dstar, I also took the steroids for 2 days prior to each chemo. Can I ask why you're concerned about them? In addition to helping prevent nausea, they also help prevent an allergic reaction to the other drugs. I had no ill effects from them. I didn't even get the stimulant effect that some people do. There will also probably be some steroids given IV with your chemo drugs. I didn't have the same protocol as you, but chemo was nowhere near as bad as I pictured. The treatments themselves were a piece of cake. The after effects were unpleasant, but not horrid. I never had any nausea. They have great meds to control that now. Good luck and hang in there! You can get through it. The rest of us are proof of that.",
      "MessageIndex": 649,
      "PostDate": "17/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 18, 2014 12:54PM 2Tabbies wrote: Oh, dstar, I'm so sorry about how your mother suffered and that you had to witness that. And to be diagnosed with cancer at the same age that she was when she died must be awfully hard. I think you must get some special award for having to go through your worst nightmare.Turning into a butterfly would be good! My mother-in-law died from breast cancer in the 80s. She also suffered. Things are definitely much better now. There are much better drugs to control side effects of chemo. Sending lots of virtual hugs!",
      "MessageIndex": 656,
      "PostDate": "18/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 23, 2014 10:25PM 2Tabbies wrote: shelly, my MO said the tumor was probably there for 5-7 years. Amazing, eh? I did get an onco score. I can't remember the exact number and am too lazy to look it up. I think it was 24 which my onc said was a good score as far as meaning a relatively low chance of recurrence. However, the chance was just high enough that he thought I'd benefit from chemo. So as I said above, he gave me what he called \"chemo lite.\" Only 4 treatments of taxotere and cytoxan.",
      "MessageIndex": 664,
      "PostDate": "23/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 26, 2014 02:36AM 2Tabbies wrote: dstar, I hope the port placement went smoothly. You'll be glad you have it. It makes chemo so much easier. It makes blood draws a piece of cake for that matter too. I hope you were able to enjoy Christmas without being too stressed. Keep us up to date on how you're doing!",
      "MessageIndex": 666,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 26, 2014 08:00PM 2Tabbies wrote: MinusTwo, I don't have any \"good\" arms for blood draws either since I had nodes removed on both sides. I've had one flare up of LE in my right arm. Since my port was removed, I just cross my fingers, let them take blood out of an arm, and hope for the best. Apparently, there really isn't any good evidence that routine blood draws actually cause LE according the latest pamphlet on the subject from my hospital. Yes, they've been telling women that blood draws, blood pressure measurement, etc. cause LE for years. But when they looked at the data, they found nothing to say that's true. Do I still worry about it a bit? Yup.",
      "MessageIndex": 668,
      "PostDate": "26/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 27, 2014 01:12AM 2Tabbies wrote: magdalene, I thought about keeping mine, but it was in a spot that was annoying - right under my bra strap. I imagine the surgeon did that on purpose so the strap would hide the scar, but it rubbed on the port. There's also a risk of infection if it's ever contaminated while it's being accessed. It's probably rare, but if you do get bacteria in the port, it's hidden from your immune system, so you can get a very dangerous infection in a dangerous place - near your heart. My MO advised me to have it removed, so I did. I do miss it when I need a blood draw though.",
      "MessageIndex": 670,
      "PostDate": "27/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jan 14, 2015 07:10PM 2Tabbies wrote: It's great to hear you're doing well, Orlandpark. Gee, my oncologist has only had me come in every 6 months starting 3 months after I finished active treatment. Maybe he doesn't love me! ",
      "MessageIndex": 685,
      "PostDate": "14/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jan 9, 2015 07:26PM 2Tabbies wrote: JustKeepSwimming, all I can say is that I agree that it sucks. I'm still pissed that I've led a very healthy lifestyle and still got cancer, and that it didn't show up on all those damn mammograms that I had. I love your username, and that says it all - just keep swimming. That's all we can do. Good luck with your chemo. May the side effects be few. I had a slightly different chemo regimen than you since I have ILC rather than IDC, but otherwise our treatments are the same. Hang in there!",
      "MessageIndex": 677,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jan 16, 2015 03:03PM 2Tabbies wrote: Congratulations to all of you who have reached an anniversary!",
      "MessageIndex": 689,
      "PostDate": "16/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 16, 2015 01:06AM 2Tabbies wrote: Momine, I agree with you. It IS an amputation. What's the point of not calling it that? Mastectomy has always sounded like an ugly word to me. Amputation isn't any worse. I do miss having breasts as an erogenous zone. Cancer treatment has just about deep sixed that part of my life. Lolis, I hope you don't have anything lurking in your remaining breast.",
      "MessageIndex": 735,
      "PostDate": "16/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 13, 2015 10:48PM 2Tabbies wrote: Dancingdiva, exactly. I felt abandoned after I finished active treatment. I wanted to say, \"Now what?\" I just didn't know how to proceed with life.",
      "MessageIndex": 726,
      "PostDate": "13/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 18, 2015 09:30PM 2Tabbies wrote: 1TuffMama, what you're saying about feeling at loose ends after active treatment ends makes total sense. When we're in treatment, we're just focused on getting through it. Once we have gotten through it, some of us have a feeling like, \"Now what?\" I literally felt abandoned by my medical team. So, I think what you're feeling is normal. I'm not sure I have any advice on how to work through that. There's a thread called Why was I stronger during treatment than I am now if you want to go check it out. Regarding your question on remission and tests for a recurrence, I don't think they use the word remission for us. At least my MO didn't. It's kind of like consider yourself cured until if comes back if it ever does. My MO does no follow up testing. He said the tumor marker blood tests are unreliable, and the scans find too many false positives. He also said that finding a recurrence on a scan adds nothing to your lifespan as opposed to finding it a few months later when symptoms occur. He said what's the point of knowing you're stage IV a few months sooner? I told him lifespan isn't the only thing to consider. If I found out I was stage IV, I'd quit my job and do a few things on my bucket list BEFORE I started having symptoms and needed chemo. He agreed I had a point, but it's still not standard of care to do scans. I see him every 6 months, but that's mostly because I also have a form of lymphoma, and he does blood tests to monitor that. (It's a race to the finish! Which kind of cancer will get me first?!) He also asks if I'm experiencing any symptoms of breast cancer metastasis like bone pain, abdominal pain, headaches, shortness of breath. In addition to that, I see my RO once a year. She asks me the same questions and does a \"breast\" exam. She wants me to have that exam every 6 months so I see my GYN 6 months after the RO. That's it. I don't really like this, but short of lying and saying I have some symptom, there's nothing I can do about it. I think this lack of monitoring is one reason I feel a bit at loose ends like you. I suppose I'll get used to it. I hope you can get your medical records. That's got to be frustrating. Are you going to get reconstruction? It's not for everybody, but I'm in the middle of the process now, and it's helping me feel a bit more normal. Good luck! Please ask all your questions, have a good rant if needed, whatever helps. ",
      "MessageIndex": 754,
      "PostDate": "18/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 15, 2015 12:57AM 2Tabbies wrote: Lolis, I also had a prophy at the time of my mastectomy. I was just tired of having mammograms, USs, MRIs, and biopsies. Then there was the fact that none of the tests found my cancer. I found it, and by that time it was stage III. The MRI I had when I was diagnosed also showed some areas in my \"good\" breast that \"needed to be monitored.\" I was so done with that. With of history of 2 other cancers, I decided enough was enough. The hospital tumor board thought a prophy on the good side was a reasonable course of action.",
      "MessageIndex": 729,
      "PostDate": "15/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 22, 2015 08:01PM 2Tabbies wrote: TuffMama, that was a good question about when the clock starts on survival. I didn't know that either. From what my MO told me, it doesn't matter that much in my case though. There is no magic date like 5 years out when I can call myself cured virtually for sure. Apparently, with hormone positive bc, there's always a chance of recurrence even though it decreases with time. With hormone negative bc, a recurrence is much more likely to occur in the first 5 years. After that, it's unlikely. So I guess I wasn't all that concerned with exactly when the clock starts. Curiously, this is the same MO who said that I should \"consider myself cured\" when I had finished active treatment because \"most women\" don't have a recurrence. I suppose that's one way of looking at it. Consider yourself cured until there's evidence you're not because it's true for the majority. I guess I've landed in the minority so many times that I feel like that would be hiding my head in the sand though. There are things on my bucket list that I'm trying to do a lot sooner than I would if I knew I was cured. Magdelene, you said it right. I'll always be looking over my shoulder too, and not only for bc. I also have a form of non-Hodgkins lymphoma that isn't curable. It may never cause me any trouble. But then again it might. I have a friend who is now terminal with it. MinusTwo, I'd like a scan about now - 1 year after the end of active treatment - just to see if at this point I'm NED. We don't even know if the chemo did any good since my type of bc doesn't respond very well to it. Of course, surgery removed what they could locate, and we assume that radiation killed anything left in the local area. Beyond that? Crap shoot! Jenwith4, I'm glad you had a better day. It's a roller coaster. That's for sure. I still fall into a pit of blackness now and then. ",
      "MessageIndex": 785,
      "PostDate": "22/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 20, 2015 08:45PM 2Tabbies wrote: MinusTwo, nobody has ever told me that I'm \"NED.\" But why would they since they aren't looking for any evidence of disease beyond asking me how I feel? In fact, if any of my docs ever do tell me I'm in the NED category, I'm going to ask them how they know that. It's like closing your eyes and plugging your ears when the roof is leaking then saying that there's no evidence of a problem. Momine, you are lucky to have gotten so much follow up monitoring. TuffMama, I'm glad my post helped. It's nice to know my experience can be helpful to someone else. Jenwith4, I have most of the problems you posted about - exhausted, could sleep all day but I don't go to bed early, neuropathy in my fingers, etc. I don't have arm lymphedema, but I do have leg lymphedema from having lost pelvic lymph nodes to ovarian cancer. I'm a year post-treatment and somehow not \"over it\" yet. I wish we could all get together for lunch and a group hug. I'm glad you came back and reposted when you didn't get responses before. Yes, we all understand!",
      "MessageIndex": 776,
      "PostDate": "20/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 23, 2015 09:32PM 2Tabbies wrote: Momine, that's quite interesting. I'd like to believe the chemo killed every single cancer cell. I know about complete versus partial response, but I have to believe what my MO told me. (If I didn't, I'd be going elsewhere.) He's supposed to be the best, and I've had more than one other doc tell me he was brilliant. He's real big on getting the most up to date data also. He told me that chemo would only increase survival by a small percentage so if the likelihood of recurrence (based on oncotype) was low enough, it wasn't worth the risks of chemo. My oncotype score was just high enough that he thought it was worth it. In a way, I was glad to get a systemic treatment and hopefully kill any stray cells floating around. I had a gigundo tumor too. If it would have shrunk significantly from neo-adjuvant chemo, I'd have hoped I'd been offered that option so that the surgery might have been easier. I'll have to ask him about that the next time I see him.",
      "MessageIndex": 787,
      "PostDate": "23/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 26, 2015 10:59PM - edited Feb 26, 2015 11:01PM by 2Tabbies Momine, I'm confused. To me making a general statement that the type of cancer I have \"doesn't respond well to chemo\" is quite different from what you said about a complete response being rare but the survival benefits clear. That's not at all what he said to me so unless the situation has changed since Sept. 2013, I don't think that's what he meant. Maybe it's because I'm stage III and ER+. (I don't remember how ER+. I'd have to dig out the records.) But he specifically said there was only a small survival benefit from chemo, and that Tamoxifen and the AIs were what would benefit me the most. He almost didn't give me chemo at all, and he only gave me what he termed \"chemo-lite\" - 4 rounds of taxotere and cytoxan. If the benefits are so clear, maybe I should go back and ask him for a do-over with the heavy duty stuff. I'd do it if I thought it would get this monkey off my back. Only one of the 3 abstracts you linked mentioned what type of chemo was used, and that one used different drugs from what I got. None of it probably matters anyway. I'm afraid I've gotten pretty cynical about my odds after having twice ended up with cancers that the statistics said I was unlikely to get. I mean, nobody's even heard of Waldenstrom's macroglobulinemia. Somebody ends up at the tail end of the bell curve, and that seems to be where I find myself a lot. Thanks for the info though. Adding my ditto to hating having bc.",
      "MessageIndex": 792,
      "PostDate": "26/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Feb 27, 2015 09:23AM 2Tabbies wrote: Momine, I will report back after I see my MO. That reminds me that I need to call and schedule an appointment. Somehow that seems to have not happened when I was there in November. That's interesting about the cancermath not including radiation.",
      "MessageIndex": 797,
      "PostDate": "27/02/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Apr 22, 2015 09:36AM 2Tabbies wrote: Eaglemom, you've come to the right place. You aren't alone. The waiting is the worst. I hope you get that path report and a plan of action soon.",
      "MessageIndex": 832,
      "PostDate": "22/04/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jun 1, 2015 05:46PM 2Tabbies wrote: Welcome, swissrn and lulu. I'm sorry you both have reason to be here, but glad you found us.",
      "MessageIndex": 905,
      "PostDate": "01/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jun 9, 2015 09:34PM 2Tabbies wrote: Jenga, good luck tomorrow. I agree with jenni that you should ask about different nausea medication of what you had didn't work.",
      "MessageIndex": 925,
      "PostDate": "09/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jun 18, 2015 07:23PM 2Tabbies wrote: MinusTwo, I figured bc was my punishment for not having kids. Except, a lot, probably most, women who get it do have kids. I agree. We aren't to blame.",
      "MessageIndex": 936,
      "PostDate": "18/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jun 19, 2015 06:38PM 2Tabbies wrote: sbelizabeth, I took estrogen for 10 years after my hysterectomy for ovarian cancer. I didn't have a lot of choice. Without it, I was pretty much non-functional due to awful mood swings. I'd have either committed suicide or homicide, and I'm not exaggerating. If bc was the price, so be it. I refuse to dwell on it. Since I've had 2 other cancers, I tend to think my body just likes making cancer cells.",
      "MessageIndex": 944,
      "PostDate": "19/06/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jul 31, 2015 12:02PM - edited Jul 31, 2015 12:05PM by 2Tabbies December, I've had the same experience of walking into the doctor's office seemingly healthy and walking out sick. Several times. The first was when I had ovarian cancer. I walked in to the GYN's office after being referred by my PCP and waiting 5 weeks for an appointment. Give that nobody seemed in a rush, I figured the \"thing\" that was seen on the ultrasound was probably no big deal and she'd just say it needed to be watched. No. The word was I might have cancer and needed surgery. I also only had thickening not a lump with my ILC. I always had thickening in that area so thought nothing of it, and neither did my GYN, until it felt different from the other breast. So the call saying I had ILC did seem like a bad dream. How could it be? The mammogram a few months earlier was negative! Hah. I also agree that early PT is a good thing. I was never sent for PT. I guess that's because I had normal range of motion without it almost right after surgery. However, I did have some lymphedema (on the prophylactic side for heaven's sake!) and insisted on going to an LE therapist. I already knew her because I have LE in a leg thanks to the ovarian cancer surgery. She helped a lot. But why wait until things have been stiff for months before getting PT? Win, have you asked your doctor about this new symptom? I had peripheral neuropathy show up in my fingers months after chemo ended. I have no idea if this might be what you have, but I'd ask the doc. I have the lovely hot flashes and sweating too especially at night. We're in the midst of a heat wave which makes it even more fun. ",
      "MessageIndex": 993,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Aug 4, 2015 08:05PM 2Tabbies wrote: December, thanks for the compliment, but I'm not sure how much grace I've exhibited. I'm still kickin' but not very gracefully. Just my usual cranky self. I hope your appointment went well. Aliali, I agree about the meds and platitudes.",
      "MessageIndex": 996,
      "PostDate": "04/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jul 10, 2015 11:06PM 2Tabbies wrote: Regarding recurrence rate, my MO told me 30%. So it either varies a lot depending on the specifics of our situation, or they don't really know. Lulu, I got that same \"no scans\" spiel. I don't even get tumor marker tests. My MO said that finding mets on a scan versus when symptoms appear doesn't make a difference as far as how long you survive. Also, the scans cause anxiety, and there are false positives which cause unnecessary biopsies. I understand this, but it still pisses me off. I told him, it might not make me live longer to find out I'm stage IV on a scan versus a few months later when I get symptoms, but I'd want to know anyway. For one thing, I'd quit my stupid job. No need to save for a long retirement which is basically why I'm still working. Besides, as with all statistics, I bet there were some outliers in those studies where finding the mets on a scan did buy them some extra time. I'd like to have the chance to be one of those outliers. He also said that tumor marker tests aren't accurate enough to be of use. I'm kind of with Magdelene and more or less expect it to show up some day. If not breast cancer, some other cancer because this is my 3rd cancer diagnosis. My body seems to like making cancer cells. My second cancer was/is a rare form of lymphoma that's not curable. It's not doing much now, but could rise up and bite me in the butt at any time. So, it might be a race to the finish as to which type of cancer will finally do me in. Sorry to sound so negative. I don't think about it most days, but that \"no scans\" business really makes me angry especially when I hear that some people do get scans.",
      "MessageIndex": 968,
      "PostDate": "10/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Jul 29, 2015 08:22AM 2Tabbies wrote: Win, hang in there. Yes, it's a tough road. take one day at a time. One minute at a time if you have too. December, I hope you can get the right therapy and regain arm function. The things this disease does to us makes me so angry.",
      "MessageIndex": 987,
      "PostDate": "29/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 15, 2015 07:21AM 2Tabbies wrote: JenPam, I wish I could have felt the same as you about being flat. I know quite a few women are fine with being flat. Unfortunately, I hated having to figure out every morning how to dress to look decent. Which type of prosthesis to wear or whether to drape a scarf around my neck. It was a constant reminder of breast cancer. I tried all the different prostheses from silicon to microbeads and found them all uncomfortable. They tended to ride up. I felt like my boobs were climbing up to my collar bones and was constantly readjusting them. How do you get them to stay put? With my implants , I don't need a bra at all. I don't have to think about anything when I get dressed, and they definitely don't shift around on me. I'm glad you found your comfort zone. It took me a bit longer to find mine.",
      "MessageIndex": 1021,
      "PostDate": "15/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 28, 2015 04:18PM 2Tabbies wrote: homeschool, I just wanted to say that I think any and all feelings you might be having would be considered normal. Hang in there.",
      "MessageIndex": 1050,
      "PostDate": "28/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 16, 2015 11:02AM 2Tabbies wrote: JenPam, maybe your rib cage is a different shape than mine and that holds the bra in place better. I was constantly tugging on the thing. In certain bras, they prostheses shifted to the center also and made a uni-boob. In the winter, I went flat since I wore bulky enough clothes that it didn't matter. I was never big busted so in winter clothes, you couldn't see the difference. Summer was a problem though. I wouldn't have minded walking around bald in the summer heat, but I was bald during the winter so wore hats.",
      "MessageIndex": 1024,
      "PostDate": "16/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 23, 2015 04:35PM 2Tabbies wrote: Welcome to all the new people. I hope you find comfort and strength here. Fightergirl, good news about your scans. I'm also stage III, and getting the negative results of the CT and bone scans was the biggest feeling of relief.",
      "MessageIndex": 1077,
      "PostDate": "23/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Aug 17, 2014 10:52PM 2Tabbies wrote: Diane, thanks for the information. I'll have to ask my MO about tumor marker tests. I'm also going to pin him down on these amorphous symptoms I'm supposed to look for. Sure in some cases of very fast moving cancer, I bet you can have a clear scan then symptoms show up in a few months. But I bet a scan would buy some of us time.",
      "MessageIndex": 15,
      "PostDate": "17/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/823082",
      "Title": "Frustrated....How do we know if the cancer is NED/remission tangandchris pip57"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Aug 17, 2014 07:30PM 2Tabbies wrote: Can anyone tell me more about the tumor marker tests some of you have mentioned? My MO gave me the song and dance about scans not buying me any additional time versus when symptoms appear, but he's never mentioned tumor marker tests. Are they only for specific types of BC? I have ILC.  Also, what are the symptoms I'm supposed to be watching for? Nobody has mentioned anything except bone pain. Is there anything else besides that? A woman in another forum I frequent had been stage III, and was just diagnosed as stage IV. She's been given only 6 months to live, and she had no symptoms even though the cancer is everywhere. You can't tell me a scan a few months ago wouldn't have found some of the mets and maybe given her a shot at a bit more time than 6 months. I have to say that this whole issue really frustrates me. Even if a scan would only mean that I'd know a few months earlier that I'm stage IV (which is what my MO said), I'd want to know that few months earlier. I'd quit my job for one thing. No point saving for a long retirement if I'm not going to have one, and that's the only reason I'm still working. I'll stop ranting now.",
      "MessageIndex": 13,
      "PostDate": "17/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/823082",
      "Title": "Frustrated....How do we know if the cancer is NED/remission tangandchris pip57"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Aug 19, 2014 12:43AM 2Tabbies wrote: kathec, I've never even heard of Li-Fraumani syndrome, but from what I just read about it, I don't think I have it. None of my cancers started at a particularly young age. I was 45 when I was diagnosed with my first one - ovarian. Also, of the 3 I've had/have, only breast cancer is commonly caused by Li-Fraumani. I don't have a family history of early cancer either. It was an interesting suggestion though. I agree with you on \"cured.\" My MO said I should consider myself cured. Snort! Yeah, I'm cured until it comes back. Lily55, I'll have to ask my MO about the stem cell tumor marker tests. I doubt he'd go for anything controversial though.  Wintersocks, I know what you mean about one pain melting into another. Something almost always hurts. So what's significant? I don't know either. RaiderGirl, the tumor marker tests sound like what I had before my ovarian cancer surgery. That was Ca-125. My results were low enough that the docs were sure I didn't have cancer. But I did have cancer. Interesting, that your doc says getting diagnosed earlier or later won't make a \"long term\" difference. Frankly, I'd take even a short term difference. It's also interesting that they say the stress of going through the scans, biopsies, etc. will make a difference, they don't think the stress of living in constant limbo does? I find that very odd. I don't really want testing every 3 months or even 6 months either. But once a year like you're doing sounds reasonable to me. Otherwise, I feel like I'm burying my head in the sand. I also feel like I'm being treated like a statistic. I'm sure there are people for whom the tests and earlier detection did prolong their life just not enough of them to be statistically significant. But somebody was at the \"good\" end of that bell curve. I'd like to have the chance of being one of those people. After having twice been told by doctors that they were \"sure I didn't have cancer\" because it was statistically very unlikely and both times finding out that I did indeed have that \"statistically unlikely\" cancer, I've lost a lot of faith in statistics at least as they apply to me. Basia, I hope you get that cure. Good luck with treatment.",
      "MessageIndex": 27,
      "PostDate": "19/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/823082",
      "Title": "Frustrated....How do we know if the cancer is NED/remission tangandchris pip57"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Dec 12, 2014 10:51PM 2Tabbies wrote: If anyone used LympheDivas, Brightlife is having a sale this weekend. 3 pattern sleeves for $169 3 pattern sleeves and matching gauntlets for $335 ",
      "MessageIndex": 1413,
      "PostDate": "12/12/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 2, 2014 07:28PM 2Tabbies wrote: Julie, don't be sorry you posted this information. I, for one, appreciate getting it.  All our situations are different as has been mentioned, but it's still good to know the big picture.  I won't spend my days obsessing about a quote from a journal, but it might motivate me to reassess my priorities. That's not a bad thing. ",
      "MessageIndex": 113,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 20, 2014 09:55PM 2Tabbies wrote: The only thing I've seen is a delivery truck for bottled water. Don't remember what brand. That's got a lot to do with bc, eh? I'll probably be your cellmate if anybody pushes the issue with me.",
      "MessageIndex": 36,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 20, 2014 11:45PM 2Tabbies wrote: Firekracker, as long as somebody is making a buck off of it, it will continue.",
      "MessageIndex": 38,
      "PostDate": "20/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 26, 2014 12:11AM 2Tabbies wrote: Jillian777, thanks for the laugh! Wiping for the cure?! I love it. I'm also stage III ILC just since July 2013. I hope I'm still here in 10 years.",
      "MessageIndex": 58,
      "PostDate": "26/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 17, 2014 01:18AM 2Tabbies wrote: Arrrrgh!",
      "MessageIndex": 27,
      "PostDate": "17/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 18, 2014 12:49AM 2Tabbies wrote: Blessings, good post. FireKracker, I hope they catch that guy too. I heard about that on the news. Keep safe.",
      "MessageIndex": 30,
      "PostDate": "18/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 26, 2014 02:27AM 2Tabbies wrote: Monis, I don't blame the neighbors for complaining. Let's hope he at least donates some money for research because this is a pretty empty gesture. Well meant, I'm sure, but what good does it do anyone?",
      "MessageIndex": 61,
      "PostDate": "26/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 27, 2014 01:25AM 2Tabbies wrote: sbelizabeth, I would come back and haunt anybody who put my ashes in an urn with a pink ribbon on it. Alloway, tickled pink?! I'm speechless. Utterly speechless.",
      "MessageIndex": 70,
      "PostDate": "27/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 1, 2014 06:00PM 2Tabbies wrote: Sadly, I think they should make the lettering pink to make the point.",
      "MessageIndex": 92,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 2, 2014 04:08PM 2Tabbies wrote: Julie, being stage III and node positive, I'm praying it's inaccurate! But your source is certainly a reputable journal.  The next time one of my docs gives me a \"don't worry, be happy\" speech, I'll show them those stats.",
      "MessageIndex": 102,
      "PostDate": "02/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 4, 2014 08:51PM 2Tabbies wrote: I agree. That's a great slogan. We ALL need a cure. FireKracker, what does it say on the t-shirt you're wearing in your avatar?",
      "MessageIndex": 125,
      "PostDate": "04/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 5, 2014 12:25AM 2Tabbies wrote: Thanks for the photo, Firekracker. That's perfect.",
      "MessageIndex": 128,
      "PostDate": "05/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 1, 2014 02:40PM 2Tabbies wrote: tangandchris, what an awkward position that puts you in especially the email from your department head. Are the walking groups raising money to donate to a BC charity? Or is the point to encourage exercise to prevent BC? (It didn't help me!) Ugh. I'm glad my workplace isn't doing anything like this. So far, anyway.",
      "MessageIndex": 87,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Oct 1, 2014 04:22PM 2Tabbies wrote: I want one of those shirts. I NEED one of those shirts! That says it perfectly. I wonder if the \"cure\" logo is enough for most people to realize what it's referring to though.",
      "MessageIndex": 89,
      "PostDate": "01/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    },
    {
      "AuthorID": "2Tabbies",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203330/profile",
      "Content": "Sep 16, 2014 03:34PM 2Tabbies wrote: Peacestrength, what you said.  Exactly.  I, too, had mammograms faithfully starting at age 30 due to lumpy, dense breasts only to be diagnosed with stage III ILC at age 56. They don't tell anyone that mammograms suck if you have dense breasts. They also don't tell you some types of breast cancer don't even show up on mammograms and don't feel like a lump (ILC). I had a clear mammogram and manual exam by my doc 5 months before I was diagnosed.  The tumor was 5 x 8 cm. She didn't feel it.  I didn't feel it. I only got suspicious when the dense area in my left breast felt definitely different from the dense area my right breast.  We need MRIs. Well, I don't anymore because I no longer have breasts.   I hate pinktober, and I especially hate the \"ta-tas\" and \"boobies\" crap. We're talking about saving women, you know, actual PEOPLE  not \"ta-tas.\" I also agree on the ice bucket challenge.  Just donate for crying out loud.  ",
      "MessageIndex": 24,
      "PostDate": "16/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/824448",
      "Title": "Brace yourself, September is slipping, inexorably, to Foctober weesa Blessings2011"
    }
  ]
}