{
  "AuthorID": "35_smiling",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167215/profile",
  "Posts": [
    {
      "AuthorID": "35_smiling",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167215/profile",
      "Content": "May 12, 2013 07:27AM 35_smiling wrote: Hello everyone! “HAPPY MOTHER’S DAY” and for those who loss their mother “May God continue to bless you and your family with wonderful memories of the times you had together”. As for me… I just returned from Boston last night and met with the plastic surgeon on May 8, 2013 regarding my reconstruction surgery when I receive my mastectomy on May 24, 2013.  I am still very nervous as this was not an easy decision to make.  I was given a choice to either go for another re incision with radiation (6-7.5weeks) or a mastectomy with no radiation.  After thinking about it long a hard with my husband I chose the mastectomy with reconstruction.  I just want this cancer fight to end fast.  I have been through so much since diagnosed last July 31/August 1, 2012.  The cancer spread from my breast to my spine which has left me with a rod replacing half my spine.    We decided to go with the flap reconstruction (where they use my fat tissues from my belly and move it to the breast) then they will lift my left breast to try to match it with the new right breast.  Not only am I going to have a scar on my back from my first of many surgeries but now on my belly but when I look back I will still be living and that is what’s more important in my book.  Once this surgery is completed I can now say “I am cancer free”! Those four words I long to say.  I pray to God that this will be the end.  I know my walk will never really be over as I now need to eat, exercise and make better healthy choices in hope there is no reoccurrence with this cancer or another other form of cancer.",
      "MessageIndex": 320,
      "PostDate": "12/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "35_smiling",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167215/profile",
      "Content": "May 12, 2013 09:07AM 35_smiling wrote: Cindy (RMlulu): Thank you so much for all your kind words! Yes I am all of us are \"Brave Warriors\"!  I am looking forward to May 24 more then ever!",
      "MessageIndex": 322,
      "PostDate": "12/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "35_smiling",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167215/profile",
      "Content": "Mar 26, 2013 01:03AM - edited Mar 26, 2013 01:12AM by 35_smiling Hello everyone.   I want to say thank you to spinnerpon for posting the comment and link for this discussion. I am soon to have radiation in a few weeks time and I am so glad and again thankful the ladies who have post their experiences. Thanks to everyone I have my long list of questions for my doctor to make sure I am not in he dark for anything. Good luck to those ladies who have started your radiation and all the best and congrats to those who have finished.",
      "MessageIndex": 250,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "35_smiling",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167215/profile",
      "Content": "Apr 30, 2013 07:26PM 35_smiling wrote: MsW2012: I am sorry this had to happen at a time when there isn’t an on-call radiologist after hours.  Glad you manage to speak with someone and they advised there is no risk of infection.  Thank goodness for that!  Do you think you still have to go in to have someone to look at it?  I hope it’s not too bad.  Good luck and praying for a speedy recovery (I guess this is what I have to look forward to as well…)! RMlulu: Congratulations on for having your last radiation yesterday! Jumping for joy over here! So now that your radiation is finished what is next for you? Tammy_M42 Thanks, looking forward to start my radiation; as it will be one step closer to the end of my road. Laurascott1016: Congratulations to you too for finishing up with your radiation!  You are absolutely right about how everyone’s radiation side effect is different.  I start mine shortly and at first I was afraid because reading everyone’s experience scared the ja-bee-bers but then had to take a step back and tell myself that this may not happen to me so I need to take my experience day-by day, hour-by-hour and minute-by-minute and walk over the bridge when it comes.  So now your radiation is finished what is next for you?",
      "MessageIndex": 303,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "35_smiling",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167215/profile",
      "Content": "Mar 30, 2013 05:44AM 35_smiling wrote: Thank you Cindy!",
      "MessageIndex": 262,
      "PostDate": "30/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "35_smiling",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167215/profile",
      "Content": "May 30, 2013 01:11AM 35_smiling wrote: Hello Rmlulu thank you so much. i pretty much posted my results on other forums you and I share on so I am going to repost it here too. I hope you dont mind... repost I had my mastectomy with immediate reconstruction surgery (by using my belly fat to create my new right breast) was last week on Friday May 24, 2013. I was scheduled to be at Beth Israel Hospital by 9:30am. Got there on time and they gave me a buzzer and when it goes off that was time for prep. We (my hubby and I) sat in the waiting area until this thing buzzed...then I started crying and they told my husband they will let him in later. They got me all ready for surgery and my husband was allowed to come in. We said some prayers and I made him do a before photo with all the marker markings made from the plastic surgeon. I was still very scared and nervous. The doctor came in again and spoke to my husband and answered all his last minute questions. I was glad for that. We kissed and I was wheeled into surgery which six hours later it turned out. I woke up and my husband was the first I saw. I was super happy and very scared to look under the covers now. I have a follow up appointment with the plastic surgeon tomorrow so, I hope me and hubby are doing things okay. The drainage's are a bit discomforting to do but we get it done. I am still very sore but once things heal it would look better....I hope anyway. I find it hard to look at myself right now.  its really not a pretty sight to see...I thought looking at other women will help me but seeing it first hand on my own body is just a shock for me. I am super excited that my insurance paid 100% and I am doing good and coming along well.",
      "MessageIndex": 324,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "35_smiling",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/167215/profile",
      "Content": "Apr 30, 2013 06:15PM - edited Apr 30, 2013 06:24PM by 35_smiling I am not sure what number I become. I have bc and mets to my spine. I lurk around too.",
      "MessageIndex": 345,
      "PostDate": "30/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/802966",
      "Title": "How Many Are We? DivineMrsM kt1966"
    }
  ]
}