{
  "AuthorID": "39andhip",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
  "Posts": [
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Jul 31, 2015 02:32PM 39andhip wrote: My Oncotype DX was a 13 and my Ki67 was 11% - so 'intermediate' but on the low side of intermediate. I know that an Oncotype DX of 20 puts you in that dreaded gray area. For me, there seemed to be a strong case to not do chemo, but all the oncologists I saw agreed that younger age automatically puts you at higher risk in a way that really isn't captured in the stats. My MO told me that cancer at 40 is different than at 60 - as in, it actually behaves differently, and you sort of need to add in one degree of severity for younger age. One confounding factor that I discussed with two different oncologists is the fact that there aren't many data for people my age. The data tend to come from significantly older or significantly younger populations. You are probably in that younger category. OTOH, I think you also want to have kids (?) so fertility is an issue. Again, just things to discuss with your MO. I hope you find your consult at MD Anderson to be extremely helpful in coming to a decision. It is certainly a tough one.",
      "MessageIndex": 3,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Aug 6, 2015 08:57AM - edited Aug 6, 2015 11:37AM by 39andhip Tiffany: I guess if there is any silver lining in this, it is that you do meet some awesome people and make some some great friendships along the way. :) Huge hugs to you! SummerAngel: There are definitely data to back up the fact that younger women have a higher chance of recurrence. I just don't think there are stats that are set in stone and there is no set definition of 'younger.' But here's an example: http://www.webmd.com/breast-cancer/news/20101104/b... BTW, I am also in CO. Where did you go for your treatment? P.S. I just went onto PubMed and did a search for 'breast cancer recurrence in young women' and now I feel super depressed. I'm beginning to understand the full weight of what my MOs have told me.",
      "MessageIndex": 27,
      "PostDate": "06/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Aug 5, 2015 04:12PM 39andhip wrote: SummerAngel - I was also told that my age changes the risk of recurrence. I wasn't told double, but to add 'one degree of severity' (I'm 40). I don't think there are really true numbers based on data that you can attach to this, but all the MOs I saw (three total) said pre-menopausal cancer is different than post-menopausal cancer. And it's not just because you are younger, it's also because the cancer itself behaves differently. Tiffany - Thanks for the update. You do not sound vain at all! Wanting to look and feel beautiful on your wedding day is completely normal. There are programs to help cancer patients with hair, make-up, etc. to look and feel their best. Perhaps someone here can chime in. (I've never used one, but know they exist.) This cancer stuff is hard enough to deal with without a wedding and fertility preservation to take into consideration. I am so sorry. Prayers for you.",
      "MessageIndex": 22,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Aug 6, 2015 02:31PM 39andhip wrote: SummerAngel - I also did the tumor board consult up at Anschutz and am having my mastectomy + reconstruction there. But I am in Colorado Springs, just like Englishmummy! Englishmummy - I am a scientist, so my life revolves around data, and I cannot help myself. LOL. I know everyone is different (I had a professor who used to call it the 'n of 1') but OTOH medical/scientific studies and data sets are what have given us life-saving treatments. I think for me personally, reading recent studies on age as a predictor of recurrence (with all other factors, such as tumor size, stage, grade, etc., being held equal) helps me to understand why three MOs have suggested a slightly more aggressive route for me despite having early stage, medium-aggressiveness cancer, and why an MO might recommend chemo for Tiffany (which was the original question). One can certainly choose not to believe data, or look for other data, but so far in all of my searches I have not found any data that say there is a 100% cure rate, which would be the answer I'm looking for. I guess I'll have to keep looking. :) And Tiffany, I second the apology for the hijack. I was just very interested in the idea of doubling all of the probabilities based on age so of course I had to look into it. :)",
      "MessageIndex": 30,
      "PostDate": "06/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Aug 5, 2015 06:53AM - edited Aug 5, 2015 01:49PM by 39andhip Tiffany, I discussed the SOFT and TAILORx with my MOs also and summarized our discussion here, if it helps you: http://39andhip.blogspot.com/2015/06/consultation-.... I also want to add that I do not feel not doing a treatment means you are person who is not going to fight the cancer and just roll over and die. There are other important quality of life and health issues that weigh into each person's decision, and sometimes a more conservative route is what is the best for an individual. Ovarian suppression + AI vs. tamoxifen has been semi-recommended to me, but I'm not sure if I will opt to do that. I don't want my cancer to recur any more than the next person, but at the same time, I already have severe joint pain and it is quite possible the former will really exacerbate that. I am not sure the tradeoff of being in a wheelchair vs. a 1-2% additional benefit is worth it for me. That doesn't mean I'm not a fighter, just taking into account multiple factors.",
      "MessageIndex": 18,
      "PostDate": "05/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Jul 31, 2015 09:02AM 39andhip wrote: Hi Tiffany, I have/had a somewhat similar situation to you - though I didn't get clean margins after my re-excision. I had a slightly lower oncotype and Ki67 than you, and opted not to do chemo (with input from two MOs). Obviously only you can make the decision for yourself, with input from your doctors. But one thing I do want to say that was helpful to me in weighing the risks vs. benefits of chemo is to really pay attention to how the stats are presented to you. Like... what exactly does the 4% mean? Would chemo reduce your risk of recurrence from 13% to 9% or would it reduce it just 4% of 13% (down to 12.5ish %)? Another thing you might want to consider being that you are 31 is the possible effects of chemo on your ovaries and future fertility. I'm not trying to persuade you one way or another, just sharing some of the things I thought about as I made my decision. Best wishes to you.",
      "MessageIndex": 1,
      "PostDate": "31/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Aug 7, 2015 06:13AM 39andhip wrote: I was going to send you a private message, but apparently I cannot attach articles through this site. I can e-mail some articles to you if you want to give me an e-mail address - otherwise I can just send you the article information and you can look them up if you have access to a database (e.g., PubMed, ScienceDirect, etc.). But the good news is that I did some more in-depth reading and age as a prognostic factor alone is apparently controversial. :) I totally hear you on the challenges with parents... My parents are very anti-medicine and my mom was completely against radiation. It definitely makes choosing a treatment path with a clear mind more difficult.",
      "MessageIndex": 34,
      "PostDate": "07/08/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/833824",
      "Title": "Young, Stage 1A, Grade 1- chemo? tshire Ygammyyet"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Jul 29, 2015 03:53PM - edited Jul 29, 2015 05:10PM by 39andhip Hi Carol, Sorry about your diagnosis. As others have said, the chemo and radiation really depends on your particular case. Radiation is fairly standard with breast-conserving surgery (i.e., a lumpectomy) and less common with a mastectomy. Chemo often depends on the tumor characteristics and stage - and waiting for test results can be torture... My initial plan was lumpectomy + radiation with no chemo, but after two surgeries, I do not have clean margins (meaning there is still cancer), so now the plan is mastectomy with no radiation and no chemo. It really gets easier once you have a plan in place, although as I've learned, that plan might change. I hope you can get a lot of good information from your doctor to help put your mind at ease. The not knowing phases are what have been the toughest part for me. Best wishes!",
      "MessageIndex": 7,
      "PostDate": "29/07/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/833742",
      "Title": "Just diagnosed - is radiation and or chemo going to happen? Keyla Keyla"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "39andhip wrote: Did anyone have trouble with their nipple(s) after a nipple-sparing mastectomy. I had a NS MX on 9/1, with DIEP recon on 9/8, and my nipple has been threatening to die for several weeks now. It looks like she is going to pull through, but has gone through various phases of disgustingness - hard and scabby, followed by all sorts of gooey grossness. Has anyone else experienced this? How did you care for your nipple? I have an e-mail out to my PS, but I thought I'd give this a stab, too. This is seriously worse than the drains as far as the ick factor. Thanks! Despite my name, I am actually 40 years old. I started blogging my way through severe hip pain about a year ago, and apparently the only way to get me to stop whining about my hips was to give me cancer. So here I am. :) Dx 5/1/2015, IDC, Left, 1cm, Stage IA, Grade 2, 0/7 nodes, ER+/PR+, HER2- (FISH) Surgery 5/18/2015 Lumpectomy: Left; Lymph node removal: Sentinel Dx 5/22/2015, DCIS, Left, 6cm+, Stage 0, Grade 2 Surgery 6/16/2015 Lumpectomy: Left Surgery 9/1/2015 Mastectomy: Left; Reconstruction (left): Tissue expander placement Surgery 9/8/2015 Reconstruction (left): Stacked DIEP flap Hormonal Therapy 10/11/2015 Tamoxifen pills (Nolvadex, Apo-Tamox, Tamofen, Tamone) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835241",
      "Title": "Help! Sad nipple after NS MX! 39andhip 39andhip"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Sep 20, 2015 03:06AM 39andhip wrote: vettegirl - there are definitely plastic surgeons who specialize in 'scar reduction.' I just know because my PS told me he spends a lot of time fixing scars left by other PSs. There is such a huge range of skill among surgeons, plus some people just scar more than others. I have an insane scar that zig-zags across my breast, but that's because I originally had two lumpectomies, then when I had the mastectomy, my BS went in through the same incision. When my PS did reconstruction, he really had to use that original site. I'm an 'orderly' kind of gal and didn't want a Harry Potter lightning scar, but my PS insisted it was better because this way because at least the scar would be hidden if I were wearing a bikini. He also insisted on putting the incision in my abdomen below my 'bikini line,' even though I assured him I do not wear bikinis. But now that I think about it, I'm glad he did it his way.",
      "MessageIndex": 10,
      "PostDate": "20/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/835030",
      "Title": "Do mastectomy scars need to be so ugly? Gina4h Meow13"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Dec 2, 2015 10:21AM 39andhip wrote: I have a question for those with brain mets. What were your first symptoms? Thank you.",
      "MessageIndex": 3220,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Sep 17, 2015 05:16PM 39andhip wrote: Thank you all for sharing your thoughts here. I just recently had a UMX and after much inner turmoil, ended up having reconstruction with a DIEP flap. For a long time, I didn't think the flap reconstruction would be possible (long story), but was dead set against having an implant. Ultimately, I wasn't sure how I would feel long-term without reconstruction, especially being just 40, and since the flap reconstruction turned out to be an option, I went with it. Now I get way ahead of myself and wonder what I will do if I have a recurrence or develop cancer in my other breast, and I am pretty sure I won't do reconstruction again. I don't regret my decision, but the way I see it, it is a once in a lifetime thing. I have a scar from hip to hip and a ridiculous, Harry Potter zig-zag scar all way across my reconstructed breast, and sometimes I'm filled with a really weird feeling boarding on self-loathing that I did all of this self-mutilation just for a feelingless lump of tissue on my chest?! Even with recon, I'm not sure how I'll feel about getting into a swimsuit or being intimate. As someone else said, I don't think there is a way to escape all the body image issues that come with a mastectomy. My best to all of you.",
      "MessageIndex": 42,
      "PostDate": "17/09/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/82/topics/826432",
      "Title": "Body image concerns 5 years post bmx - feeling vulnerable beacon800 tsoebbin"
    },
    {
      "AuthorID": "39andhip",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/216469/profile",
      "Content": "Dec 2, 2015 10:50PM 39andhip wrote: Thanks for the response, Chrissy. It's sort of what I suspected.",
      "MessageIndex": 3228,
      "PostDate": "02/12/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783594",
      "Title": "If you are not Stage IV but have questions, you may post here chrissyb Olma61"
    }
  ]
}