{
  "AuthorID": "3dayorbust",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50494/profile",
  "Posts": [
    {
      "AuthorID": "3dayorbust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50494/profile",
      "Content": "May 4, 2007 05:53PM 3dayorbust wrote: I know that men do get bc, but I am sure your son is fine. Take him to a DR to put your mind at ease. I will pray that it is nothing more than a case of hormonal changes!!!",
      "MessageIndex": 5,
      "PostDate": "04/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602318",
      "Title": "son annie43 Kat63"
    },
    {
      "AuthorID": "3dayorbust",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/50494/profile",
      "Content": "3dayorbust wrote: Breast Cancer has been weighing on my mind lately. First of all, I am 35. No kids. Need to lose 80 lbs. All factors which add to my risk. Grandma's sister died of the disease ages ago...not sure if that will add to my risk or not. I've been experiencing some breast pain that just doesn't seem to go away. My drs all think that it is a fibroid cyst (which runs in the family)which, when combined with the weight gain, would make for an uncomfortable sensation. It doesn't stop me from worrying about breast cancer. I recently registered to participate in the Breast Cancer 3 Day Walk here in Philly (this October) and the more stories I hear, there more sensitive I become to my pain. When is is advisable to get a mammogram? Is breast pain a common thing for overweight people (I've been overweight for 5 yrs but the pain is only about 6 months old). Is there any way of removing or treating a cyst, or do I just have to grin and bear it? Heather www.3dayorbust.blogspot.com www.the3day.org/philadelphia07/heatherlee my3day@yahoo.com Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/05/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/602424",
      "Title": "Nerves 3dayorbust l82jem"
    }
  ]
}