{
  "AuthorID": "3girls4me",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53610/profile",
  "Posts": [
    {
      "AuthorID": "3girls4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53610/profile",
      "Content": "Feb 4, 2008 08:39PM 3girls4me wrote: Hi Neecie, OH MY GOSH!  My jaw dropped when I read your post!   I could have written it myself!   My situation is practically identical!  Let me briefly recap...  3/07 (at age 36!) I found a lump, had mammogram.  They said it was benign fibroadenoma and not to worry ( had another fibroadenoma 2 years prior), so I wasn't concerned.  But they said they'd biopsy just to be sure.  So I had biopsy, and biopsy showed that lump was indeed benign, but with ADH -atypical ductal hyperplasia around the lump.   Surgeon said they'd have to do another excisional biopsy to make sure nothing else was going on.  In the meantime, knowing nothing about breast cancer, I did some research and learned that ADH is often mistaken for DCIS.   Now I was scared!   I had the excisional biopsy, and BAM!  They found DCIS!  No clear margins, so I had another lumpectomy, AGAIN, with no clear margins.  I could have opted for a 3rd lumpectomy, but at that point I had had it, and opted for bilateral mastectomy with reconstruction which I had in September.   What kind of cancer is yours?  How were the margins?  What grade?  What type are the cells?  Are they sure they can 'get it all' with another surgery?   Fortunately for me, mine was stage 0, non-comedo and low grade.  I did not need to have nodes taken, and I didn't need radiation or chemo.  I had such a large area, that I was pretty much left with the only option being mastectomy.  I have no regrets.  And in my \"good breast\", there was an area of ADH that was approaching DCIS!  None of this showed on my mammogram, so I'm very thankful.   AND YES!   I feel like God put the lump there so I would find this and get it taken care of!   The DCIS was only in the area of my breast that had the lump!   AMAZING! Wow, we have a lot in common!  Same age and everything!   I know first had what you are going thru, it's all very scary.  And truthfully, the part that you're in right now with all the questions and information to process and what-ifs is the worst!   Have faith and trust God to guide you with a path, and just take it one step at a time! Let me know how you are! Leslie",
      "MessageIndex": 2,
      "PostDate": "04/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/699763",
      "Title": "removal of benign mass leads to dx neecie iodine"
    },
    {
      "AuthorID": "3girls4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53610/profile",
      "Content": "Jan 28, 2008 07:54PM 3girls4me wrote: Count me in too, I had the same! As I understand it, margins for DCIS and IDC and very different.  During a mastectomy, the surgeon scrapes all the tissue he/she can, and virtually eliminates all the ducts.   It'd be very unlikely that any ducts would remain, thus radiation is not prescribed after mastectomy for DCIS.  Unlike IDC, where there 'could' be some cancerous tissue left.",
      "MessageIndex": 7,
      "PostDate": "28/01/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/699262",
      "Title": "Close \"DEEP\" Posterior Margin (near Chest Wall) koshka1 hi5"
    },
    {
      "AuthorID": "3girls4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53610/profile",
      "Content": "Oct 28, 2007 08:56PM 3girls4me wrote: Hi Steph, This is a highly personal decision that you're making, and my advice is to go with your gut feeling.   Don't let anyone influence you.  You've been through a lot of treatment already, congrats for finishing all of that! I had a bilateral w/expanders 6 1/2 weeks ago.   My diagnosis was DCIS stage 0.  I had it in the right breast and had two lumpectomies trying to get it all, but no luck.   Imaging didn't not show any of this, mammogram or ultrasound, so I didn't feel confident having a 3rd lumpectomy, and opted for mastectomy.   And choosing the bilateral was an easy decision for me.  I couldn't take the constant worry, and perhaps future anxiety of tests and mammograms that may or may not show cancer.    I am 36 years old and no family history or any other risk factors. I don't have any pictures of me, but there's a great website www.breastreconstruction.org that has some good pictures of people who are done with their reconstruction.    Find a PS that you're comfortable with and comes highly recommended.   I think you'll \"Just Know\" what is the right decision for you.   It is definitely not an easy one though! Take care! Leslie",
      "MessageIndex": 1,
      "PostDate": "28/10/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/694589",
      "Title": "Debating a Bilat! Need Advice/Recommendations! tampachick Beesie"
    },
    {
      "AuthorID": "3girls4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53610/profile",
      "Content": "Apr 9, 2008 12:53PM 3girls4me wrote: A mastectomy for DCIS does seem like a MAJOR surgery for a \"little\" cancer.   Unfortunately, that's the quandry us DCIS girls are put into!   Little is known on what DCIS will do if left alone, that would be considered \"bad medicine\".   If they cannot tell how much of the breast is affected, then yes, mastectomy is usually recommended. In my case, I had some DCIS found \"accidentally\" during a biopsy of a benign lump.   I had 2 excisional biopsies, both without clear margins.  At that point, surgeon offered to try a 3rd lumpectomy, but at that point, if it wasn't clear, my only choice would be mastectomy.  I opted not to try a 3rd time, and had a bilateral mastectomy last September.  Turns out the \"good\" breast had ADH approaching DCIS as well.  None of my DCIS showed on the mammogram.  I was 36 at diagnosis. No one knows if DCIS will turn into invasive cancers.  I've read statistics of 30-50% will eventually.   Those are pretty high odds in my book.   Losing your breasts is hard to deal with.  But I am very comfortable with my decision and would rather mourn my breasts than worry about them taking my life.   It's a very personal decision, and my best advice is that you do all the research you can, but ultimately go with your gut instinct.",
      "MessageIndex": 10,
      "PostDate": "09/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/703581",
      "Title": "MASTECTOMY FOR DCIS thetrumumshow Noni"
    },
    {
      "AuthorID": "3girls4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53610/profile",
      "Content": "3girls4me wrote: Hi all, so glad I found these boards...I've been reading intently and decided to post! I'm 36, (no family history or any other risk factors) diagnosed with Stage 0 DCIS low grade about 1 month ago. Still reeling from shock as to where this came from, but all the while thankful it's early. This was after mammogram found fibroadenoma, core biopsy found ADH, then excisional biopsy revealed DCIS. No clear margins, so on Friday I had the 2nd re-excision, waiting on results. I'm trying to take in one step at a time, but all the while wondering what treatment I'll be recommended (mastectomy, rads, tamoxifen) and trying to prepare myself. And I've got 2 second opinions set up for the week of the 16th. I couldn't find any threads about Stage 0, and was just wondering if anyone has had this experience. I'm thankful that it is only stage 0, but then I fear what if they find more advanced in this 2nd re-excision. Sorry for the vague post........I'm just thinking out loud! DX 6/12/07 Stage 0, Grade 1 & 2, 0/0 nodes, Bilat Mast w/recon 9/12/07, Exch Surg 3/21/08, Nipple Recon 7/29/08, Tattoos 10/1/10--finally DONE! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/649984",
      "Title": "I'm a newbie............Stage 0 3girls4me Shirlann"
    },
    {
      "AuthorID": "3girls4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53610/profile",
      "Content": "Sep 27, 2008 10:17PM 3girls4me wrote: Hi! As my surgeon explained it, and Dr. Susan Love says in her book, for areas of DCIS that are less than 5cm and non-comedo, nodes are left alone.   If you have comedo type DCIS, or a large area, they usually check them.  I asked this question repeatedly to my doctor (I had bilateral).   He said he does not check nodes for low grade DCIS, but he would have had I decided I wanted them checked.   Ultimately, I felt ok not having them checked.  A lot of doctors are checking them routinely now as part of a mastectomy.   My doc was on conservative side, telling me that its' better to leave them alone if no invasion is suspected.  Thankfully, I had no invasive disease.",
      "MessageIndex": 5,
      "PostDate": "27/09/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/721903",
      "Title": "not checking nodes sunflower45 Jo_Ann_K"
    },
    {
      "AuthorID": "3girls4me",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/53610/profile",
      "Content": "Jun 8, 2008 06:36PM 3girls4me wrote: Hi there, My situation is somewhat similar, somewhat different.   I was diagnosed with DCIS, which was found \"accidentally\" when I had a benign lump biopsied just to be sure.   The DCIS just happened to be in the same spot where the lump was.   The DCIS did NOT show on my mammogram because my breasts were EXTREMELY dense.  After two lumpectomies, dr. still didn't get it all, and ultimately I made the decision to have the mastectomy.   Good thing, because it was multi-focal.   Additionally, I decided to have bilateral mastectomy, and in my \"good\" breast, there was also atypical cells that were borderline DCIS.   Again, none of this showed on the mammogram! Having dense breasts doesn't CAUSE cancer or give you a higher risk.  It simply makes it harder for them to find things. My advice is to do all the research you can, but ultimately go with whatever your gut tells you.  That's what I did, and I don't regret it one bit!",
      "MessageIndex": 10,
      "PostDate": "08/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/706946",
      "Title": "Anyone? Lumpectomy vs. Mastectomy w/No Re-occurance???"
    }
  ]
}