{
  "AuthorID": "3littlegirls",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
  "Posts": [
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Oncolytics just posted this to their news release. Thought it sounded promising and wanted to share.  Hope everyone can turn their cancer voice down real low for the day after reading this. I know I could use the break. Cheers, Michelle  CALGARY, AB, --- August 2, 2011 - Oncolytics Biotech Inc. (“Oncolytics”) (TSX:ONC, NASDAQ:ONCY) announced today that an international team of researchers has reported on a study in the online version of Molecular Therapy, a publication of The American Society of Gene and Cell Therapy, investigating the timing of chemotherapy delivery that optimizes the efficacy of systemic REOLYSIN®. The paper is entitled “Precise Scheduling of Chemotherapy Primes VEGF-producing Tumors for Successful Systemic Oncolytic Virotherapy,” authored by Kottke et al. The report describes when best to administer taxanes with reovirus to optimize viral delivery to the tumor mass. The researchers demonstrated that this drug combination was superior to either treatment alone, and were able to reproducibly cure nearly half of the treated animals by employing this optimized schedule of paclitaxel/REOLYSIN.  “This research supports and further rationalizes the dose schedules currently employed in our ongoing clinical efforts in the phase II and phase III setting,” said Dr. Matt Coffey, Chief Operating Officer of Oncolytics. “These data will allow us to refine our planned studies for additional tumor indications.” About Oncolytics Biotech Inc. Oncolytics is a Calgary-based biotechnology company focused on the development of oncolytic viruses as potential cancer therapeutics. Oncolytics’ clinical program includes a variety of human trials including a Phase III trial in head and neck cancers using REOLYSIN, its proprietary formulation of the human reovirus. For further information about Oncolytics, please visit: www.oncolyticsbiotech.com. This press release contains forward-looking statements, within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. Forward-looking statements, including the implication of the materials presented in “Molecular Therapy” with respect to REOLYSIN, and the Company’s belief as to the potential of REOLYSIN as a cancer therapeutic, involve known and unknown risks and uncertainties, which could cause the Company’s actual results to differ materially from those in the forward-looking statements. Such risks and uncertainties include, among others, the availability of funds and resources to pursue research and development projects, the efficacy of REOLYSIN as a cancer treatment, the tolerability of REOLYSIN outside a controlled test, the success and timely completion of clinical studies and trials, the Company’s ability to successfully commercialize REOLYSIN, uncertainties related to the research and development of pharmaceuticals and uncertainties related to the regulatory process. Investors should consult the Company’s quarterly and annual filings with the Canadian and U.S. securities commissions for additional information on risks and uncertainties relating to the forward-looking statements. Investors are cautioned against placing undue reliance on forward-looking statements. The Company does not undertake to update these forward-looking statements, except as required by applicable laws. Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/08/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/772554",
      "Title": "Oncolytics Update 3littlegirls MCTHO"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Hi Ladies, I have tried going and finding the info on here but have not had much luck.  I just had my first progression since I started this journey.  I have been on Tamoxifen for almost 2 years.  My Old Onc's last appointment with me she stated that she thought I was repsonding well to hormonal therapy and that she thought I would be around for a long time (my old Onc was the head of BC Oncology and did not blow sunshine, but she left on an indefinate medical leave).  My new Onc is also new to his job.  It was only my second visit with him when he told me I had slight progression in one of my many tumours.  He then mentioned I was becoming hormon resisitant but that we would try Letrozole (Femera I think is the same)  and then it would be chemo.  He was hoping for a 6 month run on Letrozole.  I was shocked that he was only hoping for 6 months?  I want longer.  So my question to you guys is have you been on this drug and if so how long did it work for you.   So far the only SE for me is a couple of hot flases and one night I woke up super nauseous but as soon as I hit the bathroom running it went away.   Thanks!  I am just hoping to calm my nerves a bit.   Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/09/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/793293",
      "Title": "Looking for hope on Letrozole. 3littlegirls ibcmets"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: They use Ultrasound and an MRI machine to do surgery. If they can do this just think of the endless possiblities. It also works on bone mets. woo hoo Now if we could just get it approved here in North America.  http://www.tedmed.com/videos-info?name=Yoav_Medan_at_TEDMED_2011&q=updated&year=all Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/781046",
      "Title": "Surgery without cutting! 3littlegirls sandilee"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Well as some of you know I went down to Mexico and had a bunch of alternative treatments done.  I was so hoping that I would have some great shrinkage but it turns out I am still in a tied game with the beast.  Doesn't matter how much I seem to up my game I can't get these buggers to shrink.  I am relieved to have them stable. I know there could of been worse news but their was that tiny bit of hope for some shrinkage.   On a good note my Onc, (who never gives out any hopeful comments) said since I have been stable for this long on Tamoxifen, that I should have similar results with other hormonals, once I need to switch.  I figure that should keep me going long enough for those lab rats to find the cure.  I don't think I will be going back to Mexico for any follow ups but I am still glad I went.  It certainly gave me all my energy back.  Just a very expensive way of doing it.  And who knows maybe it has helped.   Anyone been on Tamoxifen for a really long time?   Just curious how long it can work for Stage IV.  I know it's 5 years for lower stages.    Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/09/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/775233",
      "Title": "Still Stable! :) 3littlegirls sincitydealer"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Well, I have been dreading turning the big 2 for a while. Guess because that was the number I was given in the beginning. I remember when I first started coming to the boards at BCO and feeling so bad for those a few years into their fight. Thinking at least I am not them. I still have my 2 years in front of me. Well in a blink of an eye, I am now one of those \"lucky\" women who has managed to survive the 2 year mark. And I didn't even remember it was the 19th until it had come and was well gone. :) Thanks to 3 kids, an old sick dog, a tired husband and the stomach flu.  My oldest made it to Provincials this year in gymnastics so we had to travel to Edmonton for the competition on Thursday. The day I decided it was my turn to get the stomach flu (now that the rest of the family had run it's course) My poor husband had to stay home get the kids to school, then go to work, come home early and pick the girls up from school. Drive my oldest to a town outside Calgary where she trains (another story) and then head to another town 20 mins away from the first one to get the dog's drugs (another story) and then pick oldest daughter up and bring her back so we could all pile in the car and drive another 4 hours (What a long drive with the stomach flu). Anyway made it to a dive of a hotel and crawled into bed while husband battled the girls to sleep. Up at 6 am to get ready for meet and so on. That crazy Thursday was my anniversary. I was too sick and distracted by that and packing. I hope I can forget all my anniversaries (hopefully I have loads to forget) because I am too busy living. Thanks for listening. Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/786439",
      "Title": "I forgot my 2 year anniversary! 3littlegirls steelrose"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: I just sent this to bruburn and thought why not share it with all you ladies.  We all need something to put a smile on our face.  It's been a very sad month. thebloggess.com/2011/06/and-th...  Hugs to everyone!!!!!  Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/770813",
      "Title": "Nothing to do with Breast Cancer! 3littlegirls Lynn1"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Hate sharing when we lose another sister.  She was too young, her kids were too young and her husband was too young to lose such a dear sweet lady.   I hope those that got to know her on here could visit her Obit and leave some nice messages.  I noticed there areonly two comments and I think her family would love to hear from more that knew her.  RIP sweet Lana.  Her Obit: http://www.snodgrassfuneralhomes.com/?action=1&value=12&obituaries_action=2&obituaryid=158967 Edited by Mods to make the link clickable Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/821057",
      "Title": "Svetik got her wings. 3littlegirls Kandy"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Just wanted to let you all know I got my results today. Still stable! I was so hoping Reggie would pick me up but I guess he knows the stableboy and I have been together for 2 years on the 19th. Look out Kathy I might be competing with you. Although you do have a 17 year head start. :j) I hope everyone getting scans has just as good news or even better! Love and hugs to you all! Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785198",
      "Title": "STABLEBOY has decided to stick around. 3littlegirls Naniam"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: She hasn't been on in a very long time. Hope she's ok.   Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/811357",
      "Title": "Anyone in touch with Thatslife from Australia? 3littlegirls steelrose"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: I haven't been coming on here much.  With summer here I have been going full tilt.  I had an old best friend from my days of living in Lesotho (Southern Africa) come visit me.  She is from Norway and we haven't seen each other since we were 15.  It was 6 days of crammed full fun.  I think I exhausted her. I took her camping in the mountains, rock climbing, shopping,museums and had a wonderful time.  She left today :( I have had a few of these visits, another couple of my besties come 2 years ago (while going through treatment) we hadn't been all together since 16.  They're Irish (Ones in Beirut and the other Kilkenny) and again we all lived in Lesotho.  Magical years for all of us (International high school with 47 different nationalities, such an amazing experience). Those friends I made back them all have a deep special place in my heart and I have been so touched that they have made the long treks to come see me.  It is sad that it's because I have cancer but so touching.  It is so hard to think I am dying but what a gift to be able to have those friends from my pass come to see me.  We always make plans to see each other again but who really knows if there will be a next time.  I have been feeling invincible hiking and climbing mountains lately.  I know the future is unsure but it has been 2 years and I have no symptoms.  I think, maybe I will be around for the cure.  But then I come on here and see how all you wonderful ladies are doing and I am devastated to see so many wonderful souls that have been struggling and have left us.  It is so hard to read these posts, I care for every one of you. It is a sad bond we share but one that is so strong.  The support and love on here cannot be matched.  I will be back but I am off to Vancouver and Oregon for the next 3 weeks.  I am looking forward to meeting you Kim!  Looking forward to a relaxing vacation with the family.  Once the 11 hours drive to Vancouver is over. I get to do that part on my own so hubby can save 4 days vacation for another time.  Sorry I am not as eloquent a writer as most of you ladies.  I was the kid cracking jokes and talking.  I should of payed more attention to grammer and all that noise. ;P I hope everyone can find some reprieve from this beast and enjoy your summer.  I intend to give cancer the finger every chance I can.    Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/791260",
      "Title": "Just checking in! 3littlegirls chele"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Hey ladies, I got a port in on the 18th Dec and was hoping to go Snowboarding tomorrow.  I wasn't planning on doing anything too crazy and staying on the groomer runs.  Does anyone know if this is ok?  I really would like to get out.  I could go cross country skiing but I was told no heavy lifting for 2 weeks.  Anyone have any idea if it is ok?  It will be 12 days after the implant.  I figured it was close enough.  I have had 3 weeks of kick my bum chemo.  On Paclitaxol and had major crashes after the steroids wore off. Fun while on them.... anyway starting Abraxane on Monday so I figure this weekend is my only window for the next 3 weeks.  This is why I am even contemplating going.  I just had a 2 week break from chemo so feel good. Hope you all had a Merry Christms and lets hope 2013 is a good year for a cure! Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/798167",
      "Title": "Snowboarding with a Port? 3littlegirls 3littlegirls"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Just wanted to let you all know I got my results today. Still stable! I was so hoping Reggie would pick me up but I guess he knows the stableboy and I have been together for 2 years on the 19th. Look out Kathy I might be competing with you. Although you do have a 17 year head start. :j) I hope everyone getting scans has just as good news or even better! Love and hugs to you all! Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/04/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/785198",
      "Title": "STABLEBOY has decided to stick around. 3littlegirls Naniam"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: It is with a heavy heart I'm letting you know Jen passed away in the early hours Wed am.  She was only 35 and had a three year old daughter. We met on here and soon discovered we had similar stories and the same Onc. We grew close texting and visiting. Our girls played together and we became quite close. I am going to miss her terribly. She really was a sweet angel. Always thinking of others right up until she took her last breath. She chose to suffer instead of bing drugged up so she could be alert and aware for her daughter and husband.  Anyway I just wanted those that had the privilege of knowing her to know she is now soaring with our other sisters.  Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817298",
      "Title": "Sweetangel/Jen is now a true angel. 3littlegirls Leah_S"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Although I didn't know her well it saddens me to share the news she has passed away.  She was so open and honest in all her posts.  I really admired her. Here is a copy of a post from her sister in law from another site Inspire. Hello Everyone, I am Jessica's \"Sissy\" (sister-in-law) and I came across this site when searching for any articles about her to print off and save for her 4 yr. old son. My heart hurts to say that Jessica lost her battle but gained her angel wings on June 26th surrounded and being held by her family. Here is a link to her obituary.  www.legacy.com/obituaries/desm... clem&pid=158267496&fhid=6945 Thank you for all the support you provided Jessica over the last 4.5 years. God Bless.  Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790317",
      "Title": "Cancerkicker Jessica is an angel. 3littlegirls meima-Bev"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: I just wanted to run this by you guys and see what you think.  I am struggling with having to put my dog down. I just found out last week her limp in her front leg is not a torn tendon but in fact cancer.  She has a large tumour on her shoulder.  I took her back to the vet and he basically said there is nothing he can do except amputate the whole leg and shoulder.  SHe is almost 13 and a large dog so that woud be out of the question. He said she is in pain and should be put down.  Yes she limps but she has never whimpered or shown signs of pain except the limp.  The vet gave us morphine and she seems happy. I guess I just have issues when I myself am doing everything I can to stay alive and then I just go off and put my dog down?  I don't want to be cruel and keep her hanging on if she really is in pain but I also don't just want to end her life.  I am so torn and sad.  I hate cancer!   Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783281",
      "Title": "My dog has cancer :( 3littlegirls bhd1"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: Although I didn't know her well it saddens me to share the news she has passed away.  She was so open and honest in all her posts.  I really admired her. Here is a copy of a post from her sister in law from another site Inspire. Hello Everyone, I am Jessica's \"Sissy\" (sister-in-law) and I came across this site when searching for any articles about her to print off and save for her 4 yr. old son. My heart hurts to say that Jessica lost her battle but gained her angel wings on June 26th surrounded and being held by her family. Here is a link to her obituary.  www.legacy.com/obituaries/desm... clem&pid=158267496&fhid=6945 Thank you for all the support you provided Jessica over the last 4.5 years. God Bless.  Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "09/07/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/790317",
      "Title": "Cancerkicker Jessica is an angel. 3littlegirls meima-Bev"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: This link will explain it all.  They are getting remissions in Stage 4 Breast Cancer patients.  Longest remission so far is 7 years and counting.  Patient had liver mets.  I am so excited I just have to get in this trial.  I hope we can all have a shot at it one day.  Hope this lifts you up. https://cancer-institute.com/index.php Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809298",
      "Title": "Side Effect Free Chemo. AMAZING RESULTS! This might be it. 3littlegirls Cooper97"
    },
    {
      "AuthorID": "3littlegirls",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/102585/profile",
      "Content": "3littlegirls wrote: I just wanted to run this by you guys and see what you think.  I am struggling with having to put my dog down. I just found out last week her limp in her front leg is not a torn tendon but in fact cancer.  She has a large tumour on her shoulder.  I took her back to the vet and he basically said there is nothing he can do except amputate the whole leg and shoulder.  SHe is almost 13 and a large dog so that woud be out of the question. He said she is in pain and should be put down.  Yes she limps but she has never whimpered or shown signs of pain except the limp.  The vet gave us morphine and she seems happy. I guess I just have issues when I myself am doing everything I can to stay alive and then I just go off and put my dog down?  I don't want to be cruel and keep her hanging on if she really is in pain but I also don't just want to end her life.  I am so torn and sad.  I hate cancer!   Michelle Dx 4/19/2010, IDC, 6cm+, Stage IV, Grade 3, 5/18 nodes, mets, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 31,
      "PostDate": "26/02/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/783281",
      "Title": "My dog has cancer :( 3littlegirls bhd1"
    }
  ]
}