{
  "AuthorID": "3teens",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81465/profile",
  "Posts": [
    {
      "AuthorID": "3teens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81465/profile",
      "Content": "Oct 9, 2009 01:19PM 3teens wrote: I was on Zometa for about 9 months when I started having kidney problems.  The kidney markers kept rising (not high, but steadily upward), and I had pitting edema in my feet and ankles that wouldn't go away, even when I elevated.  Onc took me completely off the zometa, so right now I don't have it to strengthen my bones.  I have kidney stones, also, so I am thinking maybe that has made me more susceptible to that particular zometa SE.  For you, my thought is that you might as well try it - your onc will probably be keeping a pretty good eye on the kidneys given your history.  Good luck and God bless you. Peggy",
      "MessageIndex": 2,
      "PostDate": "09/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741787",
      "Title": "Zometa & possible kidney problems? Chelee GretaB"
    },
    {
      "AuthorID": "3teens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81465/profile",
      "Content": "Feb 16, 2011 02:47AM 3teens wrote: I was on Zometa for over a year when I began to have kidney problems.  My onc moved frequency from monthly to every 3 months but the problems still continued.  He has since taken me off of Zometa alltogether, and my kidney function is returning, and my swelling issues that came with it are much better, although not perfect.  I will ask him about denosumab.  My bone mets are extensive, so it makes me nervous to not be on anything.  Best of luck with your kidney function Becky! Peggy",
      "MessageIndex": 5,
      "PostDate": "16/02/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/764902",
      "Title": "zometa - frequency and kidney issues rkt Alpal"
    },
    {
      "AuthorID": "3teens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81465/profile",
      "Content": "Jun 21, 2009 06:38PM 3teens wrote: Denise, Awesome news!  I am so glad you posted your success.  I have been in remission from Stage IV since April, after 9 months since initial dx.  I was wondering how long it would last - I am praying to follow in your footsteps!  I have hesitated posting since remission, feeling like it was like rubbing it in to others who weren't in remission, and a bit like an imposter.  I see now it is only encouraging, and hope-giving to others.  Thank you so much for your good news, and here's praying you have many more years to report! Peggy",
      "MessageIndex": 38,
      "PostDate": "21/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735777",
      "Title": "5 Years Remission of Stage 4!!! Denny123 dreamwriter"
    }
  ]
}