{
  "AuthorID": "4BoysMama",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233520/profile",
  "Posts": [
    {
      "AuthorID": "4BoysMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233520/profile",
      "Content": "4BoysMama wrote: Hi Everyone! I am trying to understand a little more clearly how all of this works. I was found to have clusters of microcalcifications at my last mammo, followed up with an MRI which then found two enhancements (one on each side)- during all of this my OB found a mass in my uterus (I had a hysteroscopy and biopsy last week, still waiting on the results). I had a follow up appointment for an MRI guided biopsy for the left side (the larger of the two enhancements) and at that appointment he decided it wasn't dangerous looking and so didn't biopsy. He sent me to genetics/oncology for a consult and testing. The only woman left alive in my family is my cousin (every other cousin, aunt, mother, grandmother, etc- passed away from breast cancer, all varying ages) and she tested BRCA 1&2+. My test came back, a full panel with no BRCA mutation. I had one mutation that was considered \"unclassified\" but is being watched. I do not know if my cousin has that variant. Anyhow- through all of this my oncologist is still recommending a prophylactic bilateral mastectomy. I thought I read that a negative result in a positive family means my risk is no greater than the general population? I am so overwhelmed and confused- I see articles and reports and so much seems contradictory, I just want to know if I am making the right choice and I'm afraid I won't know it's the \"right\" choice until it's too late. Thanks so much for reading this :) Surgery Prophylactic Bilateral Mastectomy with TEs placed 6/21/2016 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/844476",
      "Title": "Fam History, BRCA 1/2+, I'm - but DR still wants PBMastectomy?? 4BoysMama llmedeir"
    },
    {
      "AuthorID": "4BoysMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233520/profile",
      "Content": "May 23, 2016 07:43PM 4BoysMama wrote: Thank you so much both of you for your thoughtful words. I have written a list of questions out and I will take those to my next appointment. BarredOwl- I called the closest center to me (UCI, I'm in CA) and they're going to start the process of getting me in for a consult/2nd opinion. I have a follow up mammo soon for those calcifications so hopefully that can help buy me some time to think about things (assuming it still looks good!). Thank you both again for writing back",
      "MessageIndex": 3,
      "PostDate": "23/05/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/844476",
      "Title": "Fam History, BRCA 1/2+, I'm - but DR still wants PBMastectomy?? 4BoysMama llmedeir"
    },
    {
      "AuthorID": "4BoysMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233520/profile",
      "Content": "Jun 2, 2016 01:59PM 4BoysMama wrote: Momof6Littles: Okay, I am definitely ordering that book! Since I checked in last I spoke with my genetic counselor and I think I have a lot more of my questions answered. I am feeling pretty solid in my choice and I am thinking that moving forward is the best choice for me. I am so glad to see you back on the boards and I'm going to head over to your post and see how you're doing! Thinking about you and your recovery!!",
      "MessageIndex": 5,
      "PostDate": "02/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/844476",
      "Title": "Fam History, BRCA 1/2+, I'm - but DR still wants PBMastectomy?? 4BoysMama llmedeir"
    },
    {
      "AuthorID": "4BoysMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233520/profile",
      "Content": "Jul 25, 2016 02:07AM 4BoysMama wrote: Mom2fourplusmore- I hadn't posted on this board either but I read it as I am shocked still at both the level of pain I'm still in (6/21 BMX w TEs) and the complete dismissal of my PS for the most part. She's been discouraging my pain pill use since I was FIVE days out of surgery?!?! I am finally getting through to her that I didn't actually want to be reliant on pain pills but I just was not finding relief with \"deep breaths and patience\". I've tried muscle relaxers (somewhat useful with that tightness feeling across the sternum) and now I'm taking Xanax (anti anxiety) when I start to feel frantic from the nerve pain. My arm (my radial nerve specifically) was damaged during surgery and that pain has sort of started to make me a bit crazy. I am quite emotional and occasionally very discouraged and hopeless feeling because again, it took until just this week for my PS to agree to give me a referral to see someone about it. Pain is incredibly insidious the way that it wears us down and makes the world look sort of grey colored. I have found Advil to help more than Tylenol, warm heat compresses to help more than ice- but everyone's different so I would say try every single thing you can to get even a moments relief. I'm so sorry you're struggling, wish I could come hold your hand! It's so hard to know going into this surgery just how involved the recovery will really be. Gentle hugs to you! :",
      "MessageIndex": 1453,
      "PostDate": "25/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "4BoysMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233520/profile",
      "Content": "Jul 25, 2016 08:19PM 4BoysMama wrote: Mom2Four- a TENS unit is the little pads they use, sometimes at a chiropractor or a physical therapists office- they place the electrode pads on your skin and you feel a very mild tingling sensation that \"disrupts\" the nerve information being sent. It sort of blocks the pain signal. I used one for months after a car accident. They can make a huge difference. For everyone else- thank you so much for responding. It is SO hard to have this unexpected pain and it's so frustrating when everyone around you says \"oh, you're not better yet?!\" Goodness, I've had some dark moments feeling like I was doing recovery all wrong. It's so, so good to hear other people who've been there and understand. Thank you ladies so much.",
      "MessageIndex": 1459,
      "PostDate": "25/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/136/topics/747016",
      "Title": "Post Mastectomy Pain Syndrome (PMPS) Deeds Lezza13"
    },
    {
      "AuthorID": "4BoysMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233520/profile",
      "Content": "4BoysMama wrote: Hello ladies! Tonight when I was settling into bed, I felt a sharp pain in the lower, outer corner of my left TE. I'm 5 weeks out, no fills yet (except what was put in at surgery) and I feel a slight bulge there- like a corner is poking out? The pain is strong and sharp. Is this normal? Happened to anyone else? Of course it's 11:00pm here so can't call the Dr now. Any thoughts would be helpful! Thanks! Surgery Prophylactic Bilateral Mastectomy with TEs placed 6/21/2016 Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846366",
      "Title": "Sudden sharp pain at corner of TE 4BoysMama 4BoysMama"
    },
    {
      "AuthorID": "4BoysMama",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/233520/profile",
      "Content": "Jul 27, 2016 10:57AM 4BoysMama wrote: BethL- I do have 4 boys! And you were totally right- I took a muscle relaxer and slept in a funky pillow pile, by this morning it must've shifted or something because it's less dramatic and more of just a sore feeling. I'm so glad that's passed, that was intense pain and I do not want to deal with that again. I think I get my first fill this Friday- on the one hand I'm excited to be closer to exchange but on the other- I'm really nervous. I'm SO excited for your exchange surgery!! It's going to feel so good! I hope it goes perfectly :)",
      "MessageIndex": 2,
      "PostDate": "27/07/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/846366",
      "Title": "Sudden sharp pain at corner of TE 4BoysMama 4BoysMama"
    }
  ]
}