{
  "AuthorID": "4girlsmom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
  "Posts": [
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Aug 31, 2016 06:17AM 4girlsmom wrote: Beesie thank you so so much for this. I am now having only a unilateral and my surgeons are ok with it. So good to hear from someone who did do unilateral and who is happy about that choice over a decade later",
      "MessageIndex": 6,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Aug 31, 2016 08:28PM 4girlsmom wrote: Wow- thank you for this.",
      "MessageIndex": 9,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Sep 2, 2016 11:31AM - edited Sep 2, 2016 11:31AM by 4girlsmom Laura 666, I am so sorry you have been through so much. I also have had thyroid cancer- I had a total thyroidectomy in Nov. I also have chek2 and have been given differing opinions re radiation. I spoke with UCSF breast center and they said they were trying to do less radiation if someone had Chek2. I went to visit a Chek2 expert in Boston (Dr. Nadine Tung) who said that chek2 should not impact whether radiation is done. There is a paper on Chek2 which shows concern for doing radiation with it, but from my research there doesn't seem to be firm agreement either way.",
      "MessageIndex": 1,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/47/topics/847557",
      "Title": "Genes and radiation Laura666 gracie22"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Aug 29, 2016 05:56PM 4girlsmom wrote: Thank you so much for your feedback. I have pulled the trigger and downgraded to a unilateral MX. I feel so relieved. Deeply grateful to everyone who has posted their experience on this website- it helped! I know that one day I might have to go in and take off the healthy breast if it shows evidence of cancer but for now I feel much better keeping it and its sensation and living with that risk. Being less than symmetrical is ok with me if it means I can keep the feeling of my natural breast for longer. I know many women feel differently but I now realize that this is the right choice for me Now to redo the reconstruction plans- I was doing latissmus on both sides but perhaps now it will make more sense to do direct to implant. It is too late to do a diep- that would have been another surgeon.",
      "MessageIndex": 4,
      "PostDate": "29/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Sep 2, 2016 05:39AM 4girlsmom wrote: thank you Denise G. So sorry to hear about your mom and sister also having the BC and Chek2.. I have four daughters and am really so concerned about them. Thanks for that input re your doctors as well. This is all so confusing to navigate.",
      "MessageIndex": 16,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "4girlsmom wrote: I have DCIS and IDC in one breast and a chek 2 pathogenic mutation. I am scheduled to have bmx with latissmus recon and implant in less than 2 weeks but I am now thinking I should do a unilateral instead. I just don't want to lose the sensation if I don't have to. The Chek 2 expert I consulted with and two medical oncologists all think I can do unilateral, but I live in a city where nearly everyone does BMX and both my surgeon and PS want me to do the BMX so I \"won't worry.\" However, I have dear friends who did BMX and still had recurrance, so I think I will worry no matter what. Has anyone downgraded their surgery just before DDay? How do I access photos of unilateral recons? I have never seen anyone with unilateral recon; I know so many women who have had BMX recons but absolutely no one in my life did one. I am thinking I could do a simple direct to implant unilateral and then keep my options open to do the prophylactic mastectomy and recon later and make them match. Or to go back and do a DIEP if the implant looks awful (I have enough tummy for one DIEP but I was told I didn't have enough for 2, which was a big surprise) But am I thinking clearly? This is so hard. Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "28/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Aug 31, 2016 06:15AM 4girlsmom wrote: thank you so much for your post and advice! Hearing your first hand experience is so valuable",
      "MessageIndex": 5,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Sep 2, 2016 05:37AM 4girlsmom wrote: Thank you Molly 50 for this. I know there is a chance I will go your route and take off the other breast in the future. Right now I just feel more stress and anxiety from taking it off prophylactic ally than I do from fear around future screening. I may very well change my mind. How did the second surgery go for you?",
      "MessageIndex": 15,
      "PostDate": "02/09/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Aug 31, 2016 08:41PM 4girlsmom wrote: Thank you so much, BethL. It is interesting that you heard the chek2 contralateral risk is so high. I was given much lower odds- 25% without tamoxifen or the like and half that or less if I take tamoxifen (which I plan on doing after surgery, though I have heard the side effects can be very difficult). One medical oncologist told me my risk of contralateral bc was only .2% a year, but since they have so much to learn about chek2 I appreciate those predictions could change with further research. I completely understand why you did the bmx. I was about to, and I know there are reasons why it would be justified, but I just don't think I am ready yet. I feel content (with great sadness of course) that I must lose the breast with cancer; I just can't bring myself to lose the \"healthy\" one just yet.",
      "MessageIndex": 10,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    },
    {
      "AuthorID": "4girlsmom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/238108/profile",
      "Content": "Aug 31, 2016 08:42PM 4girlsmom wrote: Thank you so much, vettegirl. Hearing your story gives me a lot of comfort.",
      "MessageIndex": 11,
      "PostDate": "31/08/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/847450",
      "Title": "Changing surgery choice to unilateral 4girlsmom Denise-G"
    }
  ]
}