{
  "AuthorID": "4sewwhat",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
  "Posts": [
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Jan 12, 2015 05:14PM 4sewwhat wrote: Thanks Ladies!! I would not have know where to start if it had not been for Deborah when I was so upset after losing my implant! And I do LOVE my PS. See him Thursday so will give an update then. I need to get my pics posted too.",
      "MessageIndex": 143,
      "PostDate": "12/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Feb 23, 2014 11:11AM 4sewwhat wrote: Whippetmom! I have been in such a better mood since you pointed me in this direction!  I have been wearing out my printer and hi-lighter.  I have a thick file to take to my Doctor on Tuesday and he doesn't stand a chance!!!   I do have a couple of questions?  My infection seems pretty well cleared up and I am still taking my antiB's.  It itches like crazy!  I have also picked back up on my supplements.  I have felt so good I had slacked off on them. How long after the infection is cleared until I could have the first grafting procedure?  My doctor said to wait 4 months to let everything settle before moving on, but he was thinking DIEP when he said that.  I am wondering if I can do the fat transfer during that 4 months?  Also, he said my tissue was in really good shape except the small spot that popped open.  He didn't see any other thin spots.  Radiation really had minimal impact, all things considered. My other question would be if I had to have a second grafting, how far apart should they be?  Also, could a TE be placed in conjunction with a fat transfer as long as it was not too inflated when it was placed? Thanks again for all the help you provide to all of us.  You are a true Angel!!!",
      "MessageIndex": 115,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Jan 6, 2015 07:49AM 4sewwhat wrote: Hi Ladies!! I just had my 3rd grafting session. My thighs are not happy with me!!! After losing my implant on the radiated side to an infection in February my PS did a fat grafting in May. Then because the results were so positive, he did another fat grafting at the end of August and placed a TE at the same time but left it empty. We waited 6 weeks and then started small fills. It was up to 260cc and a couple weeks ago, 12/22 he did another round of fat grafting where he removed 50cc from the TE and then grafted fat into that space and more. He did the left side as well for upper pole and cleavage and altogether moved over 500cc. We are again waiting for the fat to settle in and then we will start the small fills again. Usually around 60 at a time until we match the other side that I replaced with a 600cc implant. Because of the fat grafting the right implant will be considerably smaller than that though! I can tell such a difference in the radiated tissue and my PS is really pleased. He was a little reserved and cautious at first, but he is really pleased and may offer a friend of mine fat grafting on her radiated MX site. She had no recon at the time of MX and he is willing to try implants for her to with fat grafting! Best wishes to all of you working through treatment, recon or getting back on your feet!",
      "MessageIndex": 138,
      "PostDate": "06/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Mar 1, 2014 09:30PM - edited Mar 10, 2014 05:27AM by 4sewwhat Yes you did, Thank You! I am researching too and will forward or post anything I come across!",
      "MessageIndex": 117,
      "PostDate": "01/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Mar 10, 2014 05:27AM 4sewwhat wrote: Bumping for the Exchange City Girls!!!",
      "MessageIndex": 118,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Feb 20, 2014 07:14PM 4sewwhat wrote: Thanks for the bump!  This gives me some hope!",
      "MessageIndex": 114,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/744891",
      "Title": "Fat Graft Transfer and the Radiated Breast whippetmom dancetrancer"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Oct 28, 2013 10:32AM 4sewwhat wrote: Hi there! I would definitely get another opinion. I still kick myself for not forcing the issue when I found my lump. Mammos and US don't show everything, Lobular carcinoma in particular. Even getting a MRI would give more accurate info. Like the others are saying trust that inner voice! But yes, get another opinion and more tests even if it just rules it out and eases your mind! Best of luck. I hope you get boring answers as to what is there!",
      "MessageIndex": 4,
      "PostDate": "28/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/813683",
      "Title": "Should I request a second opinion? Michaela1310 Michaela1310"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 25, 2013 07:09AM 4sewwhat wrote: My onc is planning yearly PET scans even if the tumor marker blood tests don't indicate a need. Personally I would like a scan twice a year after my cancer not showing up for years on regular imaging! If my onc had not agreed to yearly scans at least, I wold be looking for a new one! Good Luck Ladies. Happy Thanksgiving!",
      "MessageIndex": 5,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/814992",
      "Title": "Question about detecting mets when mammo didn't detect cancer RosesToeses Momine"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 2, 2013 03:32PM 4sewwhat wrote: I concur on the Kitchen Aid. I have been a cake decorator for 25+ years and a baker and have more than one Kitchen Aid. Have tried a few others, just not the same. I am still using the K A I got as a wedding gift 21 years ago and my mom has one older than that! Get the kind that raises the bowl up though, not the kind that the head tilts up. The one the bowl snaps on and raises are usually the 5 or 6 quart models. Costco sometimes has them on a \"coupon\" with extra stuff too. Good luck!!",
      "MessageIndex": 3,
      "PostDate": "02/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/813940",
      "Title": "Any serious bakers out there? Need help with mixer advice ktym hugz4u"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Oct 31, 2013 08:21AM 4sewwhat wrote: Hi Lisa! I know just how you felt. I knew I would be stage III and they said stage II. Then surgery, 22 nodes, and BAM I'm IIIc. Sounds like we have pretty similar diagnosis. Getting those drains out is awesome! I started chemo about 3 1/2 weeks after surgery and the time just goes by faster than you imagine. I have 10 rads left now. You will be on the other side of this in no time! Best of luck to you",
      "MessageIndex": 179,
      "PostDate": "31/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 18, 2013 10:24AM 4sewwhat wrote: Shary, Good Luck and safe travels for you. You are only a couple months behind me in treatment. It will be done soon. You are well on your way. Wishing you light SEs and happy days. Take care, Lynne",
      "MessageIndex": 237,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Mar 8, 2014 10:27AM 4sewwhat wrote: That sounds similar to the Layatril (sp) that people go to Mexico for???",
      "MessageIndex": 334,
      "PostDate": "08/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Mar 8, 2014 07:00PM 4sewwhat wrote: Art, I take my tamoxifen faithfully everyday and try to watch better what I eat.  I don't think anything can 100% prevent it from coming back.  I do take Chaga Mushrooms and some other stuff from the health food store.  I have tons of energy and feel good, so I'm sticking with it.  Would love to go organic, but I feed a family of 6 so who can afford it.  Vitamin D is very important, might want to get the levels checked too.  Mind set is really important too!  I personally don't think about it day to day.  Know that sounds crazy but I am not willing to let it have that much of me.  If it comes back I will deal with it then.  I did my treatments, had my surgeries and I am taking my pill and getting check-ups.  I put it at the curb and it better stay there!",
      "MessageIndex": 338,
      "PostDate": "08/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Mar 26, 2014 07:31PM 4sewwhat wrote: Yogamama!  We should do lunch!!",
      "MessageIndex": 355,
      "PostDate": "26/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Mar 27, 2014 04:15PM 4sewwhat wrote: I'm sure we can figure out something soon!  I will be gone 4/7-4/12 and then we can plan something!",
      "MessageIndex": 357,
      "PostDate": "27/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Sep 16, 2013 01:26PM 4sewwhat wrote: Hugs and prayers headed your ways Pam. I know waiting even a couple days is tough. Best of luck. Lynne",
      "MessageIndex": 142,
      "PostDate": "16/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Sep 18, 2013 08:44PM 4sewwhat wrote: Good luck Pam! Go kick butt and take names!",
      "MessageIndex": 146,
      "PostDate": "18/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Sep 19, 2013 05:07AM 4sewwhat wrote: Pam-- I have had those busy days with back to back appts! Wears you out! I asked my ultra sound tech if I got a cigarette when she was done with me! Felt good when I got to pee. They found a fibroid too Hope you get the most boring results ever!",
      "MessageIndex": 148,
      "PostDate": "19/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Sep 13, 2013 09:21PM 4sewwhat wrote: Hey Macy, Kaydee is on the cold cap thread too. I followed her here and that's how I ran across you on the other thread. Funny how we link from place to place and find each other! I hope she doesn't mind my passing that info along, but she could answer cold cap questions too. Take care, Lynne",
      "MessageIndex": 130,
      "PostDate": "13/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Mar 25, 2014 04:55PM - edited Mar 25, 2014 04:56PM by 4sewwhat Hi Fred!  Nice to see you.  Glad to hear things are going pretty good.  I remember seeing your posts when you wend from 3 to 4.  That was a scary time me for you so I'm glad things are good! Yogamama, you are in the scariest part right now.  Your head spins in the beginning.  So much, so fast it's hard to wrap our head around.  Do you have a treatment plan yet?  It's like I told my kids......I needed them to believe I was strong enough to fight this. That's what you need to believe too. You ARE strong enough to kick this before you let it kick you!  You can do it.  The journey might suck but you will get to the good side of this again.  You just have to believe you CAN do it! Lisa, I'm good for a laugh almost any time!!  You should check out the bonfire thread too. We have lots of laughs there.  Fun group of ladies! Hey, do I see you are headed for that final cocktail drip soon too?  Congrats!!",
      "MessageIndex": 352,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Sep 20, 2013 06:58AM 4sewwhat wrote: HVV -- that is such awesome news heading into the weekend. Congratulations!",
      "MessageIndex": 154,
      "PostDate": "20/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 22, 2013 09:52AM 4sewwhat wrote: There is a website www.areyoudense.org where there are too many similar stories. You can post your story there too and help get the word out. I fell victim too! \"it's just dense tissue, come back in a year.\". Still kicking my own butt for not being pushy, but time flies and life goes fast and before I knew it the year was almost up. And now.......here I am. Would have been here anyhow, but what to cancer gain and I lose in that year?",
      "MessageIndex": 258,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 22, 2013 08:15PM 4sewwhat wrote: Rock on ladies and keep spreading the word. When I dot diagnosed, finally, I told anyone that would listen! My goal is to save anyone I can from following down this road behind me. Lisa, good luck starting chemo. It is not as bad as your imagination tells you it is going to be! Best wishes to the rest of you as you continue with whatever area of the trenches you are in!",
      "MessageIndex": 266,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Mar 11, 2014 08:27PM 4sewwhat wrote: Debic! The day they told me I was 22 nodes positive was the only day I thought the effing BC would be what took me out.  Even with chemo, rads, surgery and 10 years hormone treatments they say I still have 50% chance of mets.  I say screw that. I'm done. It is NOT welcome back ever again!  I am coming up on the first anniversary of my diagnosis. I finished rads on 11/13 and I honestly don't think about it much. I did my time, served my sentence!   It's a crap shoot. Someone with tiny cancer and the most aggressive treatment can lose the fight. Someone with a huge tumor and a ton of nodes can do less aggressive treatment and never have another problem.  You just have to tell yourself that you did all you could and it worked.  Then comes the hard part. You have to believe it!  You can't dwell on it or you are letting it rob you.  If. Big if. It shows up again we will deal with it. Kick it in the ass again and put it right back at the curb where it belongs!  Look how many times Fred put Dino back outside!! Big hugs!  I know it's tough but where your head is plays a huge part in where your body follows. Remember, you had it, it does not have you!  Show it who is boss and move forward confident you did everything and beat it! No second guessing either. That was a tough one for me! Awesome you are done with AC!  That's a huge milestone!  Onward and only upward!",
      "MessageIndex": 348,
      "PostDate": "11/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Apr 30, 2014 06:48PM 4sewwhat wrote: Awesome News Fran!!!!!!! All Hail NED!!",
      "MessageIndex": 377,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/802340",
      "Title": "A place to greet and meet newbies to stage III hopefour Castigame"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 25, 2013 01:42PM 4sewwhat wrote: Hi there! It is sweet of you to be by your mom's side through this! I did TC chemo and found it very easy. I was encouraged to do AC-T chemo and after much research and discussion went with the TC. I was terrified to do chemo and of the SEs and losing my hair. I did not have any really bad days and the SEs were mild and pretty easy to manage. I also did not lose my hair because I cold capped. It takes work and is an expense, but it made a HUGE difference in my outlook and attitude ;0) Has your mom had an oncotype test run? It predicts the chance of recurrence. I wish you and your mom the best of luck moving forward, no matter which path she decides on!",
      "MessageIndex": 2,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815008",
      "Title": "Declining Chemo? shireenkassam 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 25, 2013 01:59PM 4sewwhat wrote: Hi Shireen, I am guessing they are going to stick with recommending chemo because of the grade 3 and the vascular invasion. I know how your mom feels. I would have done anything to get out of chemo. But when push came to shove, I had to do what gave me the best chance at coming out on too of this. Now that I am on the other side of chemo, it wasnt near as bad as the places my imagination took me. Give your mom some time to wrap her head around all of this! Make a list of questions for the doctors and go for there! Best of luck! Deciding on a game plan is one of the worst parts of all of this. Surgery is easy because we want it OUT. The other stuff is harder to figure out because you answer one question and it opens 3 more!",
      "MessageIndex": 4,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815008",
      "Title": "Declining Chemo? shireenkassam 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 25, 2013 02:41PM 4sewwhat wrote: I figured the hair might be a big thing for her and I have never heard of nose bleeds! Runny nose, yes! Many people think the hair is a vanity thing, but it is SO much more than that. Sorry about my blog it needs help! I put it out there really quick so a lady had access to the cap change vids before her chemo started. I really need to get back to work on it! I used ElastoGels. I rented them from a company that I will NOT recommend. You can buy the 6 you need on amazon for $510 with free shipping. Then you need to get dry ice for each treatment. I would be happy to help you with whatever info you need! The are also other companies that will provide the same caps and manage the ice and things for you. I think it is about $300 a treatment. It is pretty easy to do yourself and our mom already has a great helper! Here is a thread Cold Cap Users Past and Present I think is the title. It is in Getting Through Treatment. You can look in my posts and find it or it is usually near the top of the active threads. A lot of those ladies used Penguin Cold Caps. They rent for about $500 a month though and your mom would need 2-3 months depending on how her dates fell. My TC was 3 weeks apart so I had three months. Pm me if you would like and I will be happy to help with whatever I can! The hair was actually the scariest SE for me. I didn't care as much about feeling sick as I did about looking sick! I wanted to have some say/control in what was happening to me. I really think my outlook also helped with the lack of SEs. I just wasn't willing to let it take any more from me than it had to and only what I was willing to give. Your mom is going to get through this with flying colors and is lucky to have you by her side! My daughter is one of my biggest cheerleaders. She is 9 years old and puts up with 3 older brothers every day!M",
      "MessageIndex": 6,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/815008",
      "Title": "Declining Chemo? shireenkassam 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 20, 2013 09:15PM - edited Nov 20, 2013 10:16PM by 4sewwhat Hi kbdan, First step is to breath! Your imagination can take you some awful places. Far worse than reality most times. That is experience speaking by the way! Your general doctor or your GYN will how've to write orders for a mammo. I would suggest you call your doctor back and tell her that you want to be safe, not sorry, and would like some imaging to rule out anything. Because you have large breasts they might do an ultrasound too. Another option would be to go to a breast surgeon. Depending on your insurance, you might need a referral. They could check out the current problem and consult with you about the reduction too. My only other dime store advice is to go to an actual breast center for your imaging, where ALL they do is breasts. I had a lot of my early mammos done at facilities where they imaged everything so the radiologist was looking at boobs, gallbladders, and anything else that got scanned and xrayed that day. That didn't work out to well for me. When I went to the breast center this year the doc was right on top of things and knew exactly what he was looking at because he specialized in it. Best of luck to you. Let us know what happens but then we don't want you to ever have to come back here again! Hugs and prayers! Lynne",
      "MessageIndex": 2,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814795",
      "Title": "22 and scared. kbdan 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 18, 2013 09:43AM 4sewwhat wrote: You can do this ladies!!! The initial shock is by far the worst thing to deal with! You are all stronger than you know. You got this!!!!!",
      "MessageIndex": 8,
      "PostDate": "18/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/814656",
      "Title": "Monday club lol RedReading pipers_dream"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Oct 2, 2013 07:35PM 4sewwhat wrote: 47 stage IIIc. They say it's been there 8-10 years and I had mammos every year since 35 and a couple of US too",
      "MessageIndex": 956,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Dec 5, 2013 11:43AM 4sewwhat wrote: I still think you should request a diagnostic mammo and maybe an US. I am gun shy since they told me I was fine and obviously was not!",
      "MessageIndex": 28,
      "PostDate": "05/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814793",
      "Title": "24 y/o with hard lump. Please read :/ valerieelle 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 13, 2013 06:23PM 4sewwhat wrote: One day at a time and you will be through this in no time. Once you get your final pathology and have a treatment plan in place things let up in your head. Unfortunately right now is just so many questions and not enough concrete answers. You decide what is best for you with your doctors. Easier said than done, I know! We have all been there and it sucks! Deep Breath! You got this. Gonna kick its ass to the curb in no time!",
      "MessageIndex": 1,
      "PostDate": "13/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/814486",
      "Title": "Newbie Stage IIb-IIIa tangandchris Jodi040812"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 22, 2013 11:28AM - edited Nov 22, 2013 12:25PM by 4sewwhat Hi ladies, I have just come to this thread and have just had time to skim so far, so please forgive me for not having details! Just wanted to mention that my custom garments were billed at $450 for the sleeve and $480 for the glove. Ridiculous in my opinion! Pretty sure the brand is Jobst (you can see I am not wearing it!). They make horribly expensive compression hose too. Saw my LE PT lady yesterday and they are ordering me something for overnight. I don't have LE and don't want it! I am at great risk for it though because of all my nodes removed, even into tier 3. Also wanted to mention node transplants because I saw something about DIEP. They are starting to take abdominal nodes and transfer to underarms with good degrees of success. It's worth keeping an eye on! I think I saw the information on the website for the breast recon center in Charleston. Thanks for letting me pop in! Best wishes for all ;0)",
      "MessageIndex": 1111,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Dec 4, 2013 01:58PM 4sewwhat wrote: Hi Paddu, No it is not definately cancer, but does need to be checked quickly, which you are doing! Try to keep a positive thought and don't worry too much until you know what you are worrying about. If it does yeild that unwanted diagnosis, you will get through that too. Your mother is lucky to have you by her side no matter how this turns out! Let us know how everything turns out. Hugs and Prayers!",
      "MessageIndex": 26,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814793",
      "Title": "24 y/o with hard lump. Please read :/ valerieelle 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 20, 2013 08:58PM - edited Nov 20, 2013 09:01PM by 4sewwhat Hi Valerie, Nobody at your age should ever have to worry like this, hell, nobody at any age should! I am very sorry you are having to go through this. I had a US guided core biopsy. They scrub you down with the iodine stuff to sterilize the drape you so that only a small area shows. I had one lady doing the US wand and another nurse assisting the doctor. They use lidocaine and numb the area just like a dentist would. In my case I had a large mass so they took several samples. I was surprised when I only had 1 band aid at the end! They only used one point of entry but moved around and got the samples. It was a little uncomfortable but not what I would call painful. When the doc had the instrument in the position he wanted he would push a button and a small hollow cylinder would advance quickly into the tissue. Then he pulled the instrument back and removed the plug of tissue. That was the only part I found uncomfortable is when he had to detach, if you will, the little piece while they were pulling it back. The plugs were, I guess, 2-4 mm wide and maybe 6-8 mm long. They put them into a specimen cup with some fluid in it, labeled it all, then sent it for path. They also will probably place a tiny titanium marker chip at the biopsy site so it will show them the exact location for any future imaging. You won't even feel that go in. After they clean and bandage they will probably take you for a mammogram to record a baseline and the location of the chip. After that they put cold paks on and sent me home with instructions to rest the remainder of the day and ice. You could have significant ugly bruising, but not at the actual site, but below it thanks to gravity! I remember being a little tender, but not in pain from it. The bruises took a while to go away too. If you are really worried and anxious you could request some Valium to take beforehand and make sure someone else is driving. Best of luck. I wish you the most boring test results ever and many, many years worry free! Lynne",
      "MessageIndex": 6,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814793",
      "Title": "24 y/o with hard lump. Please read :/ valerieelle 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 27, 2013 12:50AM 4sewwhat wrote: Great news Valerieelle! Thankful indeed!",
      "MessageIndex": 13,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814793",
      "Title": "24 y/o with hard lump. Please read :/ valerieelle 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 20, 2013 10:25PM - edited Nov 20, 2013 10:26PM by 4sewwhat Sweetie, it's not a scalpel, just a needle. You know those things they have to inject marinade into turkeys this time of year? It isn't even that big but it does kind of look like that. Plus they numb you up first. The Valium, which I don't have much experience with, will just relax you a little. The time I took it I didn't really feel anything different, just didn't care as much that I was headed in for a mastectomy! You are SO lucky that your doc is being proactive. I had a golfball size lump and they said I was fine! Look where that got me! You will do great! Just don't look. Ask if you can wear earbuds if you want. There is an air gun kind of noise, but it's not loud, just a whoosh, but if you don't hear it that might help too! Sending hugs!",
      "MessageIndex": 10,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/814793",
      "Title": "24 y/o with hard lump. Please read :/ valerieelle 4sewwhat"
    },
    {
      "AuthorID": "4sewwhat",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/178380/profile",
      "Content": "Nov 24, 2013 04:41AM 4sewwhat wrote: Sorry ladies, I thought transplant info out there was a good thing. I don't have much info to offer on sleeves. Mine is the ugly beige color. They have a new cranberry color now too. Hate wearing the thing! Don't think I will ever get used to it.",
      "MessageIndex": 1120,
      "PostDate": "24/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/796470",
      "Title": "ALL THINGS Gloves and sleeves purple32 tsoebbin"
    }
  ]
}