{
  "AuthorID": "6cats",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
  "Posts": [
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 4, 2017 09:26PM 6cats wrote: I had mammosite brachytherapy for my first cancer. I would have done it again in a heartbeat this time, but I found out I have a clotting disorder and wasn't eligible. I did develop a large seroma, but we later found out it was due to my clotting issues and not a true seroma. I personally have found it harder to recover from whole breast radiation than from the mammosite. I've had greater fatigue and overall discomfort. I did not have any antibiotics while on the mammosite, and although it is a busy five days it was worth it.",
      "MessageIndex": 113,
      "PostDate": "04/06/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Apr 8, 2017 06:50AM 6cats wrote: Old-timer here... had Mammo-Site in 2013. One side-effect four years out is that I did develop a large seroma that did not absorb. It is now, four years later \"organized\" into very dense breast tissue. Due to its size (approx 6cm x 3cm) and surrounding scar tissue it, pulls and causes daily pain. The \"guess\" is that it filled with blood instead fluid. I cannot have it removed because that area of the breast was irradiated and won't heal well from a second surgery. Recommend that you ask early about managing seromas -- I've read that massaging the area will help. That option wasn't talked about four ears ago. Long term, aside from the seroma, I have visible redness on my skin, but not enuf that it is unappealing when with my honey. Have a new BC on other breast and this time am not eligible for brachytherapy due to a bleeding disorder. Bummer... it was an amazing choice... It only tied up one week of my life vs. six... and that is huge!; Good luck to everyone!",
      "MessageIndex": 107,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 1, 2017 04:32PM 6cats wrote: My Mammosite was in 2013 and I developed a large seroma that has become permanent. I talked with my BS and we have scheduled a date to have it removed. My oncologist isn't thrilled about having it taken out, since irradiated tissue apparently has a hard time healing, but my BS wasn't worried. Hope to keep myself healthy in the meantime... and waiting to have this painful lump (I measure 4x8cm) removed this month. I'm actually excited to have surgery! She thought they could use propoflo instead of a general anesthetic. Has anyone had surgery on irradiated tissue?",
      "MessageIndex": 141,
      "PostDate": "01/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 23, 2017 03:36PM 6cats wrote: So my Mammosite was in 2013. I ended up with a large lump where the site was. I had blood clotting issues and the area filled with blood. Fast forward four years. The site became a hard lump that pulled and was painful. RO didn't want to do anything about it. MO didn't want to do anything about it. BS was OK removing it. Had it removed Friday. 3\" incision. Yipes! Waiting for pathology. Don't expect any surprises. Praying the previously irradiated tissue heals well.",
      "MessageIndex": 152,
      "PostDate": "23/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/851631",
      "Title": "Post brachytherapy radiation and surgery effects Clangtl Irishgirl711"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 13, 2013 06:16AM 6cats wrote: Adrieann, You sound a lot like me wanting to get a lot of information RIGHT AWAY!  I'd recommend you slow down, and wait for your doctor's appointment. When there get a copy of your pathology report. If you get it early, if you're anything like me, you will spend your time looking up every word and examining every phrase for a diagnosis. There is time for that ... but when you go to the doc on Tuesday (make sure you set up an appointment today), take someone with you to take notes. and plan on just listening. It is easy to get worked up about small things. An example is that my sister-in-law had micro calcifications. The entire family was freaked out because she probably had cancer. Meanwhile I went in for a mammo due to a lump I found.... hers was absolutely nothing, mine was cancer. If you have cancer, you will need the support later... you don't need it as much now as you are waiting... take some deep breaths, and go one step at a time through this process. Good luck, and keep us posted....",
      "MessageIndex": 22,
      "PostDate": "13/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/804262",
      "Title": "does this seem malignant...Please help Adrieann AngelFaith"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jan 3, 2018 11:00PM 6cats wrote: Ladies with trunchal lymphedema, I'm trying to get a handle on my expectations, and how to handle this long term. My left breast is primarily affected. I'm finishing up with OT (lymphatic massage) and currently have a Swell Spot I wear in my bra. Having trouble finding the right undergarments to wear. The compression bra that was recommended is horribly uncomfortable. Am frustrated that no one told me this was a side effect of radiation. Basically looking for hints and tips, for the gift that keeps on giving!",
      "MessageIndex": 6659,
      "PostDate": "03/01/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/783789",
      "Title": "Kicking LE's butt!! Exercise & Self Care Log Tina337 Flynn"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 3, 2013 03:52PM 6cats wrote: PamelaKay, It looks like we both are on almost the same schedule.... does that make us boobie buddies?",
      "MessageIndex": 720,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 3, 2013 04:54PM 6cats wrote: MinusTwo,  I asked my MO yesterday about supplements. She said absolutely not, the only supplements she allows are calcium, vitamin D, and omegas. I pushed a little... Vitamin C and B Vitamins are the most innocuous vitamins I know... she said studies had been done on Vitamin C and that they decrease the effectiveness of chemo. That once I was done with Chemo (1 down, 15 to go), she didn't care what vitamins or herbs I took. Now all I have to do is find those studies...",
      "MessageIndex": 721,
      "PostDate": "03/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 22, 2013 03:33PM 6cats wrote: BeHereNow -- How my heart breaks for you... Although I have a much easier time than you (no BMX, no leukemia, etc), I understand those feelings of not feeling beautiful or sexual. My husband has a huge fear of being alone... I worry that all he sees is a walking time bomb when he looks at me. But, I've been through menopause -- The dryness is easily dealt with... our favorite is Astroglide (No I don't own stock in the company, but probably should!). I keep a bottle in my bathroom drawer because it helps me to not feel as \"scratchy\" down there. Make sure you are lubricating well on the inside near the urethra before sex, otherwise you can get irritated and feel like you have either a bladder or yeast infection. (It helps if I do this, cuz hubby can't lube the right spot) My biggest challenge in menopause is the change in desire. Although I love my husband deeply, and want to be with him, I just don't think about sex much. And when I do, my body doesn't prep itself very well. I've had to learn to \"schedule\" sex (in my head, not on a calendar, and definitely not telling DH!). I know that sounds wierd, but at least then my DH isn't waiting for me to be initiating/encouraging something that I don't think much about. The body image stuff I struggle with daily, I'm spending more time on make-up, accessories, etc than I ever did before. I'm so aware of the scars on my body (different from yours, but scars nonetheless). Although logically I know that beauty is definitely more than skin deep... emotionally I haven't caught up to that. I'm thinking about this weekend going to bed in a sexy nighty, that doesn't have to come off... maybe that will help sync up my brain and my emotions. Sorry, this may be TMI... but I want you to know you aren't alone in the struggle to be a sexy woman in the midst of all the changes in your life. Take it one step at a time. You are here, now... you don't know what the future holds, but you have a man who loves you.",
      "MessageIndex": 1026,
      "PostDate": "22/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 28, 2013 03:10AM 6cats wrote: Oh No Virginger.... Do they have you doing the salt and baking soda rinse/gargle? I get mouth sores, they have me use the salt/soda mixture first, then the magic mouthwash.",
      "MessageIndex": 1101,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 31, 2013 03:58PM 6cats wrote: Wow! the things you learn! I am so glad I'm on this board! Skin issues have started showing up after AC#3. It never dawned on me that the chemo could be attacking \"bad skin cells\"! But I've got a spot on my nose, one on my cheek, two on my arm, one on my thigh and another on my hand. Four of them were places where I had \"age spots\" -- Who'd of thought! OK, I get it!! Wear sunscreen!!",
      "MessageIndex": 1156,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 31, 2013 11:10PM 6cats wrote: Speaking of skin effects.... I've been curious if chemo will kill nail fungus? Now that I know psoriasis cleared up, maybe my toenail has a little hope! But I guess if it falls off later, that would also cure it!!",
      "MessageIndex": 1163,
      "PostDate": "31/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 6, 2013 03:35AM 6cats wrote: Tiring day today. I got a call this morning from my MO -- wanting me to come in a day early because of my odd bug bites. After looking at them (and getting approved for my next chemo on Monday), she sent me off to see a dermatologist. Of interest to all... I had several sun/age spots that have gotten red, scabbed over, etc. The dermatologist said that sometimes pre-cancerous cells become \"hot\" during chemo, killing the pre-cancerous cells. Sounds like what others have heard also. My bug bites are being treated with prednisone cream -- He said that because my immune system is all messed up due to chemo, that I'm having unusual reactions to insect bites. After all of that my vehicle broke down... of course when DH came to help, he was able to drive it home with NO problems... He said he didn't do it on purpose! Oh well... I'm ready for bed early... so tired....",
      "MessageIndex": 1218,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 18, 2013 12:47AM 6cats wrote: sarajaneevans -- I had friends and family bringing me pills, concoctions, recommending chinese medicine, etc... all with an air of authority. Some seemed very logical to me... but honestly, I would recommend you wait until you talk with your oncologist before taking anything. I've always been a vitamin popper, and I immediately thought that supplements would help. At my second visit, I talked with her about it... she said, take nothing but the calcium & vitamin D I was already taking, and if I couldn't stand it take standard multi-vitamin like Centrum Silver (not a multi-vitamin formulated for women or anything like that). When I asked the reason she said that there had been a study that showed that Vitamin C inhibited the effect of certain chemo drugs, and that there wasn't enough research to know what was safe and what wasn't. She said that the goal of chemo therapy was to kill cells -- and the drugs kill both the bad and the good. If I were taking a supplement, the goal of that would be to build up the body, the cells -- and that supplements potentially could feed both bad and good cells. I actually found the study she referred to and she was right (sorry I didn't save the link). I made the decision to use normal everyday food as my supplement -- but only foods I could buy easily at our small town grocer. I can't afford to feed our family organically, or I'd probably switch to that. Except for the fatigue, most of my side effects have been managed by changes in my diet. I've almost doubled my intake of fruits and veggies, had to add back bread and pasta to up the B-vitamins, had to cut back on milk shakes and the like. Now... if I'd eat liver I could probably get rid of some of the fatigue! You seem like someone who is frantically trying to gather as much information as possible to try to stay in control of an uncontrollable situation. Remember you can fight this best if you are mentally and physically healthy. I ran into an acquaintance recently who had mets to the bone... she said, that she had worked herself up so badly she was sick -- she finally decided that if her doctors were worried about something, then she would worry... but she wasn't willing to worry herself sick about something her doctors weren't worried about. It was refreshing to hear her calmness and acceptance of a stage 4 cancer. She actually gave me joy and strength when I thought I should be the one to give her comfort. I hope this helps....",
      "MessageIndex": 1331,
      "PostDate": "18/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 5, 2013 07:52PM 6cats wrote: PamelaKay -- I am so happy to have ChemoGate return to our board... Thank you! My argument with the chemo nurse on Wednesday was that the nausea I was experiencing during chemo could NOT have been caused by Herceptin or Taxol... She had no nausea meds on order, couldn't give me compazine since I was driving myself, etc. Besides these drugs don't cause nausea! I finally took one of my own nausea meds, they turned off the herceptin infusion until the nausea was under control... finally I got to go home. Geez... TMI alert, a week ago my DH was at the MO with me. She told us that chemo can affect all mucus membranes including tearing \"down there\". So... DH afraid to touch me for a week. I told him last night I'd let him know if the pain was bad... and darn it all... after a nice time together I was bleeding! Thank God it didn't last long, but was a bit disconcerting. Taxol #2 -- Day 3 -- missed the \"mac truck\" exhaustion... just started right in with the pain... today is pretty bad. No vicodin for me... they are keeping me on a lower class of drugs, but at least I have refills of it!",
      "MessageIndex": 1411,
      "PostDate": "05/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 10, 2013 04:46PM 6cats wrote: Amazing... Today I finally feel human! Taste is almost gone from mouth... mood is greatly improved... diarrhea is almost gone... upper lip and face numb, pain down to a dull roar. I'm so thankful SE's are at least manageable. Tomorrow is TH #3 (10 to go and counting)! Date night tonight.",
      "MessageIndex": 1430,
      "PostDate": "10/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 14, 2013 07:32PM 6cats wrote: PamelaKay -- As much as I love ChemoGate... I wish you didn't have to write it! Sounds so overwhelming... know you are in my thoughts and prayers... wish I could do more. Molinda -- if Texas weren't so far from Missouri, I'd come kick your DH's butt!!! But, thank God you have a great bff and also a wonderful SIL. I used to work for the Red Cross, Service for Military Families -- I am so thankful your son was able to come home -- that brings relief and joy to your spirit I'm sure.",
      "MessageIndex": 1442,
      "PostDate": "14/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 18, 2013 10:02PM 6cats wrote: shipsgirl -- I was writing another post to you because I noticed we had the exact same diagnosis, treatment, dates, etc... We were almost twins!!! Then I looked again... I was looking at my own post! Darn!",
      "MessageIndex": 1461,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 25, 2013 10:00PM 6cats wrote: Just finished Taxol #5. Any of you ladies have experience with Neurontin (gabapentin) for peripheral neuropathy. Did it help? SEs?",
      "MessageIndex": 1499,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 12, 2013 05:29PM 6cats wrote: Annie54 -- make sure you talk to your MO about shortness of breath -- the Herceptin you are on can cause cardiac effects and it may be time to insist you have an ECHO done to make sure everything is OK... Keep us posted.",
      "MessageIndex": 1549,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 27, 2013 03:48PM 6cats wrote: Been a quiet board here recently... I just completed TH#9 on Thursday. It knocked me out! I basically was down and on the sofa or in bed for three days. My dear son, decided Saturday that I must need more vitamin D -- so he put his hammock up under some trees in yard and I spent hours in it, just lounging and reading. I felt so blessed to have him here. I am almost back to normal, but today is Tuesday and chemo is Thursday... not much time to recover. I am definitely feeling the cumulative effects of Taxol these days! Last week I went for a followup echo, and then saw the cardiologist yesterday. Great news... my ejection fraction hasn't changed any since I started the herceptin! I will still be echo'd every three months while on it, but it looks like the 9% drop we saw was probably due to the adriamycin. The cardiologist assured me that I won't be \"dropping dead\" anytime soon! Although that may sound funny, I was really stressing out because I had a good friend die about a year ago of a massive heart attack. I'm curious how many here have regular echos or have had changes in their heart function since they started chemo?",
      "MessageIndex": 1570,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 27, 2013 03:55PM 6cats wrote: TMI alert!!! I finally have started growing hair -- first on my chin! now in my nether regions! Hubby calls it \"peach fuzz\" -- fine white hair. I am curious about what my head hair will look like... I'm still losing it, but it is also growing at the same time. So I have no idea what is happening! Thankfully don't have to shave pits or legs yet. Fashion alert -- I'd like to get one classy head scarf (hat, cozy shawl or something) that includes the pink ribbon to commemorate this ongoing journey. I've been looking for a sarong, but can't find one. Any links to recommend? Any favorites you have received?",
      "MessageIndex": 1571,
      "PostDate": "27/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Sep 20, 2013 04:07AM 6cats wrote: Since September 5th I have put on ten pounds! (was on weekly taxol) MO kept telling me to watch what I eat and exercise. Finally, my legs started swelling this week. When I saw my MO, she put me on a diuretic. Three days on and see what happens. Three days off and see what happens. I pray that a significant weight loss will occur. I see her again in three weeks. (Interestingly enough, my blood pressure was also going up.) Received my first Herceptin only infusion today. The MO said it would be like receiving an infusion of water... Hmmm... drugs in my body vs. water in my body... gotta think about that one.",
      "MessageIndex": 1615,
      "PostDate": "20/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Sep 22, 2013 03:29PM 6cats wrote: Can't tell yet if Herceptin is like water or not... Its only been a couple of days since infusion and I'm only 11 days pfc. But seriously folks, I go through 20 weeks of chemo, and now that I'm done... I catch a cold! I'm going to blame it on the fact that my church has quit praying for me! annie11595 -- I agree, it is so hard to pace yourself... but I try each day to do a little more. Yesterday, it was a little longer nap -- I napped three hours! Does that count for doing more? Have a good remainder of the weekend ladies!",
      "MessageIndex": 1618,
      "PostDate": "22/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Sep 24, 2013 06:13PM 6cats wrote: MinusTwo -- prayers... let us know how you are doing once you are able.",
      "MessageIndex": 1625,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Oct 17, 2013 11:24PM 6cats wrote: Yes, yes, yes, Daffyc..... I don't know what is worse, my brain fog, or my distractability! I start something, get distracted and move to something else, remember I should have been doing something, but for the life of me can't remember what, go back to whatever project is most visible and work on it till I get distracted again. It takes me forever to get anything done! I think the thing that really bugs me though, is that it seems like my brain moves in slow motion... everything I do takes longer than it used to. But, honestly I'm not a good judge of normal any more. Last April I had esophageal surgery. In October, I had cellulitis in my elbow (5 days in hospital, then home with twice daily antibiotics). Then in December I had bilateral total knee replacement. I completed my physical therapy in February and the same week was diagnosed with BC... so... what is normal? I'm just sure that the way my brain works now IS NOT normal! btw, I folded a load of clothes while writing this email and got myself a cup of coffee! But I did remember to come back and finish this!",
      "MessageIndex": 1638,
      "PostDate": "17/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Oct 23, 2013 07:37PM 6cats wrote: Is this the place I get to complain? Tomorrow I will be six weeks pfc. Today I'm still in my jammies.... body aches and fatigue! I am so tired of not feeling healthy. Can I just go back to bed?",
      "MessageIndex": 1644,
      "PostDate": "23/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Apr 28, 2013 09:30PM 6cats wrote: First dd AC on April 25 followed by a Newlasta shot on Day 1. So far, moderate nausea (no vomiting). My biggest issue is the killer headache I've had... waking me at 3am this morning. Any suggestions??",
      "MessageIndex": 640,
      "PostDate": "28/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 5, 2013 02:15PM 6cats wrote: Irene1975 -- I too am on preventative chemo. I have a son who, If I mention I have cancer, says \"no you don't\" (He's my 25yo who truely thinks he will live forever). But, in some ways that's correct... except for one thing... I am HER2+ which is an agressive cancer... that means I live with the \"what if they missed something?\" Also during my lumpectomy, they found a second 8mm tumor that didn't show up on ultrasound or mammogram... so \"what if they missed something?\" But my second biggest reason for continuing with the preventative is that on my one week exam (post first chemo), my MO found a lymph node swollen large enough for her to measure it (on my BC pit). My doc said this is probably nothing, just a cyst, or a side-effect from surgery. My logic says says that of course I have swollen lymph nodes, think of how my neck and tonsil area swell when I'm fighting infection. But my fear says what if... What if they missed that one cell that could be going bonkers in my body. So, I'm willing to add a little to the odds to stay healthy. My biggest reasons for continuing with preventative is a combination of my family and my dreams. I have things I still want to do -- and must be alive to do them. Also, I have a new (for me) husband of six years. He swears he can't do it without me. I happen to believe he could... but he doesn't. I don't know if this will help you make your decision about continuing preventative chemo... but I know I had to think about it. I can't imagine devoting 20 weeks to chemo and another 42 weeks to Herception (for HER2) -- that's sixty-two weeks of my life with someone poking my port -- very overwhelming... but I want to make sure I have the best chance possible of being here... maybe seeing grandchildren... hunting in the woods... finding morel mushrooms (or at least eating the ones my son finds) and doing everyday things like cooking dinner for those I love. Good luck on your decision....",
      "MessageIndex": 747,
      "PostDate": "05/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 6, 2013 04:09PM - edited May 6, 2013 04:47PM by 6cats Yippee! I survived the weekend... clipped my head down to stubble (itchy now). Went shopping for a cold weather hat since we are having a cold spell. Bought six pair of long dangly earrings (somehow having cancer gives me the permission to overspend). Went to church in my new hat with a matching shirt and got told how beautiful I was (over, and over, and over... then by text... then by email), yet no one \"liked\" the photos I posted on Facebook... hmmm... MinusTwo -- Yes, we really do have six cats -- I like to say we are a blended family!  So... for something totally unrelated to BC (except for the fact that I can't clean litter boxes while on chemo). How does this relate to Breast Cancer -- Remember, as long as you are on chemo, you can't clean the litter box!!! or in our case, the litter boxes!!",
      "MessageIndex": 773,
      "PostDate": "06/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 12, 2013 08:50PM 6cats wrote: What an odd Mother's Day... my sis came to visit and used duct tape to get hair off my head!  It worked, but stung. Then she gave me a ball cap that has blonde hair sticking up from the cap -- I look like one of the Muppets! Losing eyelashes today... yuck! Energy low... food tastes odd. My son fried Morel Mushrooms for Mother's Day for me, and I could only eat a few. Heading outside to soak up some sun... and maybe garden a little. And yes, Doctor H -- I'm putting on sunscreen (although I hate it!). Hope everyone is having a good day...",
      "MessageIndex": 893,
      "PostDate": "12/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 13, 2013 05:12AM 6cats wrote: Anyone else having trouble staying warm?  My hands and feet keep freezing, and the poor, almost-bald head is oh so cold! I'm wearing my nephew's Domo hat (Dōmo arigatō, Mr. Roboto-Styx). Not very styling, but keeping me warm up top!",
      "MessageIndex": 898,
      "PostDate": "13/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 21, 2013 01:53PM 6cats wrote: Last night I went to the ACS \"Look Good, Feel Good\" Program. I highly recommend it for those who haven't gone. I walked out looking amazing! It was such a boost to be there with other women with no hair, who looked beautiful. I even managed to put on eye makeup, even though I can't see very well without my glasses at all! (The eyebrows did look a little like Brook Shields though!). And for those who are considering a wig, the ACS offers one free wig to anyone... don't need to prove your financial status, etc. Although I think they are a bit hot, and usually wear a hat or scarf, I am so thankful to have one. My 16yo nephew, who lives with us, told my DH last night that he thought I shaved my head to get attention. I don't know if he resents the attention drawn away from himself, or just doesn't like to think of me as having a life-threatening illness. Depression... better this week (I know its only Tuesday), than last. AC #3 on Thursday... now if the constipation will go away, I may have a few good days!",
      "MessageIndex": 1003,
      "PostDate": "21/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 28, 2013 02:44AM 6cats wrote: rockermom66... yipes! what an ordeal! Glad you are feeling better now!",
      "MessageIndex": 1099,
      "PostDate": "28/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 29, 2013 05:24PM 6cats wrote: Yipes!  Don't do what I just did!! I read up on SE of my next chemo and biologic therapy scheduled for the end of June (Taxol & Herceptin). Don't know if it makes me want to exercise to get my heart in shape, or to rest more so it won't be taxed as much!!",
      "MessageIndex": 1125,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 4, 2013 02:59AM 6cats wrote: Hi All, Rough past few days... but mainly in the area of personal life rather than SEs. Still dog tired, cracks in corner of mouth and perpetually drippy nose, but otherwise OK. Had a car accident on Saturday... for a car accident it was rather gentle and I wasn't even sore the next day. On Sunday morning I woke up with bug bites. I had stayed all night at a friend's house to watch his mom who has dementia and slept under a strange quilt. The first thing I thought was \"brown recluse\"... One of the bites has now blistered and is nasty looking so today went and saw my MO's nurse. They ended up putting me on Keflex since it was on the Breast Cancer / Lymph Node arm. Apparently even though only one lymph node was removed, my lymph system is considered compromised so they wanted to head off any thought of an infection. Every day I learn of something new to worry about...",
      "MessageIndex": 1188,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 6, 2013 03:10AM 6cats wrote: hushcat -- My husband came with me to my first AC. My MO wanted him there in case I had an allergic reaction and I needed a ride home. I was able to drive myself (30 minutes) to and from each of my other AC treatments.",
      "MessageIndex": 1217,
      "PostDate": "06/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 11, 2013 01:51PM 6cats wrote: After completing 4 AC treatments    ... I thought it was time for a hair loss countdown! Especially after the nurse asked if my hair was growing in yet! Hair on the head -- bald patches, but mostly sparse. If I wanted to look like \"Kitten\" (one of our almost bald, inbred, street cats), or a Dr. Seuss character I might have gotten by without clipping it down... but it is NOT growing! Eyebrows & Lashes -- sparse, but hanging in there! Good cuz eyes are really dry and eye makeup really irritates them! Moustache -- All thick, dark hair gone... just fine longer hair Beard -- Gone except for about 5 hanger's on that are easily tweezed Pits -- clean as a whistle! Glad, cuz they told my no razors and my electric razor gives me razor burn there. Belly and nipple hair is gone -- Yippee! Nether regions -- very sparce, but no brazilian for me! Legs -- thighs are thinner, but still need (but don't get) a shave. I have one or two spots on my calfs that never lost their hair, so still have to shave every couple of weeks. Toe & finger hair -- finally fell out after 3rd AC! So that's my scoop -- somehow at the beginning, I thought hair loss meant total... everywhere... I guess I was wrong... Now, we'll see what 12 weeks of Taxol does... the nurse says it might all grow back... we'll see! Gee... I wonder if I'll lose any more after yesterdays, last AC treatment!",
      "MessageIndex": 1266,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 12, 2013 07:17PM 6cats wrote: Wow Ladies... when I signed on today, I never expected to find such beauty and depth. Thank you Katie for your moving article. I too, have a past riddled with pain, poor choices, sorrow, etc. You expressed it from your heart. And I am grateful you are part of this \"April\" journey. Indenial -- beautiful post My problems of today will pass... tomorrow is a new day...",
      "MessageIndex": 1288,
      "PostDate": "12/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 23, 2013 07:00PM 6cats wrote: One more exciting thing for the week... I had my follow-up echocardiogram this week... no results of course, but see the cardiologist on Monday. I had a slight decrease (9%) in my EF (ejection fraction, still don't understand what that is) after the A/C (7 weeks ago). They said that ejection fraction results can vary by as much as 10% each reading, so had the same technician perform the test this time.... so waiting, and every single twinge for the past seven weeks has been worrying me.... I hate waiting to see if anything is worse... And, I don't know what to worry about, so that makes the worrying worse. Having a rather negative emotional day... but I'm at home, not in the hospital... I'm able to drive if I want... I'm able to cook dinner if I want... and I can lay on the sofa and surf (and worry more) if I want... so I guess all is well with the world!! But, those darn peaches... the harvest on our ONE tree occurred this week. Last night after chemo I put up 11 1/2-pints of preserves (two canner's worth). Still have about half a bushel left-they are spoiling fast so, even though I can lay around all day if I want, I don't think it is going to happen! Day before yesterday, I made up four pies and froze them. I need to crash badly!",
      "MessageIndex": 1567,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Sep 15, 2013 07:02PM - edited Sep 16, 2013 04:52PM by 6cats Wow! It is amazing to see how far all the \"April Sisters\" have come! I had my last chemo on Thursday! The nurses blew horns and gave me a \"purple heart\" certificate of completion. I start Herceptin once every three weeks this Thursday. At my last appointment, my MO sat me down and cautioned me to not expect too much too soon... to remember that I've had 20 weeks of chemo... and that I need to remember that for some people it may take the same amount of time to get \"back to normal.\" That was real encouraging! NOT! Taxol has been rough on me! I'm one of those that definitely prefer A/C over the T/H. Nervous about the Herceptin alone. Praying no SE from it! I've heard it can cause muscle pain... I've experienced severe pain with Taxol/Herceptin and just pray that none of that pain was from the herceptin.",
      "MessageIndex": 1610,
      "PostDate": "15/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Feb 23, 2016 06:10PM 6cats wrote: I too check in periodically, but don't post... doing well except for ongoing fatigue... but I can't truly blame that on anything! I had fibromyalgia / chronic fatigue syndrome before this all started and apparently chemo didn't kill it permanently! Have all may 3-year checkups in April & May. Best of luck to everyone! Lynn",
      "MessageIndex": 1663,
      "PostDate": "23/02/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 21, 2017 10:27PM 6cats wrote: Thank you all for your well-wishes. I've survived the lumpectomy and 20 days of radiation. I am now on 5 years of Femara for it. I had another lumpectomy on Friday for a large seroma that was left over from my surgery/radiation in 2013. Feeling foggy still, but doing OK. Awaiting path results, but don't expect anything bad (fingers crossed).",
      "MessageIndex": 1668,
      "PostDate": "21/08/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 1, 2013 03:51PM 6cats wrote: Heather -- Thank God someone other than myself gets those headaches!!! If I mention it as a chemo/Newlasta side effect, people look at me like I'm crazy. I see my MO tomorrow for a one-week post chemo follow-up. Am going to discuss it... I can knock it with strong meds, but then I have to deal with the \"plugged up feeling\" -- so I can't win. I should start a new fun thread on this, but I told our 16yo that they gave me steroids before my first chemo... now, every other day it seems we have a discussion about me having \"roid-rage\" -- I just realized that some things he accused me of mis-behaving about were before my chemo and maybe even before my diagnosis! So... we will have a fun conversation tonight! Roid-rage.... geez! 16yo males.... geez!",
      "MessageIndex": 686,
      "PostDate": "01/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 26, 2013 12:22AM 6cats wrote: New side effect? I had my 3rd AC on Thursday, and Neulasta yesterday. This morning I woke up with my skin sensitive to the touch. My face hurt almost like I had sinus inflammation, and the back of my neck hurt. As the day progressed the pain is almost like an all-over sunburn, slowly progressing down my body. I have no redness, no spots, no fever... just sensitive, painful skin and a medium headache. Anyone else?",
      "MessageIndex": 1088,
      "PostDate": "26/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 29, 2013 03:44PM 6cats wrote: I've been reading with interest about everyone's eye issues. I just had #3 on Thursday. I've been having very dry eyes, and blurry vision. I mentioned to my MO that I felt like my eyes were changing... she told me not to get a new glasses prescription while on Chemo -- That during chemo, some people's eyes change, but then the prescription may not be valid after.... hmmmm. I'm excited... I get to delay my 4th AC for four days!! That hopefully means I'll have four days of feeling pretty good! I'm going to a church conference. I asked if I should take any special precautions... She said she didn't know how \"huggy\" my denomination is, but that I may want to make a big button that says... \"Hug me if you're healthy\".   So... taking ideas for the perfect button to wear in public. My other thought was \"Yes, I'm bald!\" Others?",
      "MessageIndex": 1122,
      "PostDate": "29/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 14, 2013 03:43PM 6cats wrote: OnaWing -- I agree that your problems might be related to the amount of fluids you got during infusion. However, I have worked fairly successfully in dealing with the mouth sores. My doc is anti-vitamin/supplement. I researched what vitamin deficiency can cause cracked corners of mouth, mouth sores, etc. What I found was that the B-vitamins seem to play a big role. I started eating pasta and/or bread (both are b-vitamin enriched) at each meal, ate other b-vitamin rich foods and it took care of almost all my problems (except I put on some weight). Additionally, I continued the doctor recommendations... salt+baking soda mouthwash/gargle up to 4 times daily, magic mouth wash (swish & swallow) up to 4x daily, spectazole 1% cream twice daily in corners of mouth (Rx, prescribed by dermatologist), and Aquaphor ointment in corners of mouth whenever I noticed they were dry. I also have dentures, and the doc said to go without them whenever I could -- so I look like granny part of the time! Hope this helps someone -- the spectazole cream really helped clear up the remaining cracks in the corners of my mouth!",
      "MessageIndex": 1307,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 14, 2013 11:51PM 6cats wrote: annie11595 -- so glad your viral meningitis is cleared up. Looks like we will be on close to the same schedule on Taxol+Herceptin (I'm one week behind you). So glad you are feeling better. indenial -- congrats on being finished! This is such an emotional journey -- no wonder you are wiped out! Feel better soon! shipsgirl -- 1% spectazole cream is prescription. I think it is used for thrush and similar types of yeast overgrowth. Got it from the dermatologist. Pattysmiles & PamelaKay -- exhaustion! That seems to be my word for the week -- and I'm only on day 5 post chemo. If I were creative, I'd write a song or poem about exhaustion... but I'm too tired.",
      "MessageIndex": 1315,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 8, 2013 04:31PM 6cats wrote: I've been reading since April about taste buds... bad taste in mouth, etc... made it through my AC with no noticable changes... Today, six days after my second TH woke up with that awful taste in my mouth... even coffee tastes bad! I hope this isn't semi-permanent!!",
      "MessageIndex": 1417,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 16, 2013 04:25PM 6cats wrote: I am so thankful for you \"laughing ladies\"... I take all of this way too seriously... having you here reminds me to lighten up.",
      "MessageIndex": 1448,
      "PostDate": "16/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 25, 2013 09:58PM 6cats wrote: Anne11595 -- I had cellulitis pre-BC. It is nothing to mess with. I'm thankful it was caught early enough for oral antibiotics! I ended up in the hospital for five days and then on IV antibiotics at home for another 5 weeks! Good luck and take very good care of yourself!",
      "MessageIndex": 1498,
      "PostDate": "25/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Sep 4, 2013 04:45PM 6cats wrote: Its official! Someone other than me says my hair is growing!",
      "MessageIndex": 1592,
      "PostDate": "04/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Sep 24, 2013 03:14AM 6cats wrote: For those that are HER2+, how often do they check your heart (ECHO, etc). I had a 9% drop in EF between beginning of A/C and start of Herceptin (I am now low normal). I started seeing a cardiologist and was ECHO'd again at 6 weeks into the Herceptin (no change), and now go to 12 weeks. I worry about the swelling, and worry about permanent heart issues. Pamela Kay, I'm not sure that your method of sleeping will work for me. I have acid reflux and have to sleep with my head elevated. That would mean I'd sleep in a \"V\" position... not very helpful in dealing with the mojo issues! But, thank you also for sharing that you had issues that went away. It helps ease my mind. I too had peeling feet... thought mine was from blistering as my toes and heels hurt really bad before the peeling. I then blamed it on neuropathy... but maybe it was just peeling! My eyebrows were the last to go... started losing them the third or fourth week of Taxol, lost them completely, didn't do anything special to stop them from shedding. Eyebrows were the last to go, but like PamelaKay still have a few stragglers left. Just finished my first three days of a diuretic. I lost 5 pounds! Now, I'm back off them for another three days to see what happens. I feel like I'm going from blimp to normal(ish), and maybe back to blimp!",
      "MessageIndex": 1623,
      "PostDate": "24/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Oct 15, 2013 09:58PM 6cats wrote: My 6-Month Mammo went well -- no evidence of any problem. I am just 4 weeks PFC so still am foggy, tired and plain old grumpy... did you know today is National Grouch Day?!? I don't know what you call it when you're still on Herceptin, but done with chemo. I'll be glad when that finishes next June!",
      "MessageIndex": 1633,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Apr 8, 2017 02:53PM 6cats wrote: My last check-in with this group -- have a new incidence of BC, ER+PR+, not HER2+ like before... that is good. I had a lumpectomy six days after my \"four-year\" cancer-versary The good news is no chemo this time. Good luck to all as you go through your annual scans and living life!",
      "MessageIndex": 1664,
      "PostDate": "08/04/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 8, 2013 05:19AM 6cats wrote: Shaved my head on Saturday... I was getting obsessed about \"when\" it was going to happen. Today hair started visibly falling out from everywhere... starting with my nether regions! Day 12 for me. ACS gave me some turbans, hats, etc... the one I wore today was hand-sewn and stuck up funny, so I turned it upside down, tied the bow on top of my head like \"I Love Lucy\". Surprise... my glasses don't fit right without my hair... went to Wally-World, plopped down on a chair at the vision center, whipped off my hat and told them my glasses needed adjusting... they guy didn't even blink! Told me to wear them a couple of days and come back and he'd work on them again if needed. Round 2 on Thursday for me....",
      "MessageIndex": 815,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 13, 2013 03:00PM 6cats wrote: goingforward99 -- how'd your chemo go last week?",
      "MessageIndex": 904,
      "PostDate": "13/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 15, 2013 01:20PM 6cats wrote: PamelaKay, I decided not to worry about hugs... I just try to remember to use hand sanitizer when possible. My biggest problem with hugs is breast pain... the left still hurts due to the port placement. The right began hurting because of chemo burns... so... as much as I need the healing touch, it is still painful. I think I'd prefer a hug to a handshake... they scare me! Me... I'm \"sanitizer challenged\", and also \"sunscreen challenged\" -- I've always avoided the use of sanitizer and antibacterial stuff (except for dish soap). So, stocked up, but still don't use it like I should. Sunscreen? I hate it, it makes me break out! I am making myself wear it now, but don't like it. I've always worn it for extended periods in the sun, but not for everyday. Maybe I should use sunscreen like hand lotion... chemo seems to play havoc on my skin!",
      "MessageIndex": 939,
      "PostDate": "15/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 18, 2013 07:56AM - edited May 18, 2013 07:57AM by 6cats Love waking up every morning and connecting with you ladies. I too am suffering from \"radiation recall\" -- called my MO nurse and called it \"chemo burn\"  -- she was quick to correct my language and referred me to my RO. They took a picture of it and gave me a cream/ointment called Silvadine. It is also used for burn patients. You goop it on (don't rub in) and cover with a non-stick pad to protect your clothing. I've been using it since Thursday -- my avocado sized burn has decreased in size to a little larger than a golf ball. Breast is still sore and red -- and hugs hurt. But it is getting better. @MinusTwo -- I too feel like a \"dried up Hazmat site (until yesterday). I bought a tub of Aquafor, then after my shower, razored off the remaining patchy leg hair, then used Aquafor on my entire body. My feet soaked in more than I thought imaginable. It was the longest post-shower primping I've had in ages, and Aquafor is a little like vaseline, but I could not believe how soft my legs were!!!  My morning beauty routine takes longer than it ever has in my life! First mouth care -- brush, rinse and gargle with salt/soda water and try not to gag! Finally swish and swallow what my MO calls \"Caragrape\" (I think it is the same stuff as \"magic mouth wash\" that koru_ mentioned). Then since I can't drink anything for at least 15 minutes its time for a shower. My post-shower routine is now ruled by ointments -- first scar cream on my knees (bilateral knee replacement in Dec), and all my tape scars from blistering after surgeries, then triple antibiotic ointment on any cat scratch, etc... followed by aquafor on corners of mouth, elbows and whatever part of my body is driest. Next comes my Silvadine on my radiation recall (don't get it on anything it turns it gray, like tarnish). Finally I add my facial moisturizer with sunscreen in it. By then I'm so slippery its time to get dressed! First lint-roll my stubble and let the cats play with the used sheets. Then accessorize! My hat has to match my clothes; I need long earrings now, so have to find something that doesn't clash; oh, and don't forget finding a bra that doesn't irritate whatever part of my breasts hurt that day. Finally clothes. Whew, exhausting isn't it!!! Then since I want everyone to tell me I look great, its back to the bathroom for a bit of blush and maybe undereye concealer... And my hubby, wonders why it takes an hour to get dressed each day!! Tonight hubby and I are going dancing for the first time since my knee replacement... so time to rest up. Question of the day... has anyone yet found an everyday hat/scarf that isn't too hot, goes with almost everything, doesn't require serious fiddling, etc?",
      "MessageIndex": 981,
      "PostDate": "18/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 30, 2013 02:33PM 6cats wrote: Heather214 -- So sorry to hear about your continuation of chemo -- sometimes this journey can be so disheartening. Keep us posted on how you're doing. PamelaKay -- thank you for the u-tube video... it gave me images of inspiration...",
      "MessageIndex": 1140,
      "PostDate": "30/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 4, 2013 04:46PM 6cats wrote: Congratulations to all those who are finishing up this month!! My last AC is on the 10th... then on to weekly Taxol+Herception for twelve weeks! I can't wait",
      "MessageIndex": 1196,
      "PostDate": "04/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 10, 2013 02:37PM 6cats wrote: Kobrien -- You sound a lot like me... heavy fatigue -- I finally felt normal about day 12. Each chemo the fatigue has been heavier, and started lifting about the time I was due for my next treatment (I do AC every 2 weeks). All I can recommend is pace yourself, drink LOTS of fluid, and only used tried and true recipes at home. (I did dinner in the crock pot daily). I also was one who even though I took claritan, needed stronger meds combined with aleve (naproxen sodium) for pain. Remember though that laying around can make you almost as sore as moving, so try to do what you can, even if it is in short spurts of energy. Today is my last AC with Day 2 Neulasta. Aside from the fatigue, things have been relatively easy (I have fibromyalgia, so the pain was like flares I've experienced before.). PamelaKay -- I'd be ticked too if my MO left at this time!!! I also am scared about weekly Taxol. Everyone on the weekly Taxol thread says it is easier than AC -- I don't quite believe them. How can weekly chemo be easier? For those suffering from cracks in the corner of their mouths, I had to go to a dermatologist for insect bites that went crazy while I was on chemo. While he was there he gave me a cream (Spectazole 1%) for the corners of my mouth. In four days the cracks are completely healed and closed! Worked amazingly well. That's all for now, I'm off to chemo soon. Here's hoping everyone has a SE free day!",
      "MessageIndex": 1250,
      "PostDate": "10/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 7, 2013 07:13PM 6cats wrote: indenial -- seems like your doc should have thrown you a party or something! What a let down!",
      "MessageIndex": 1414,
      "PostDate": "07/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 8, 2013 06:14PM 6cats wrote: Yes, I'm on weekly Taxol... so hope this isn't going to last... due to the holiday I have an extra day before my next infusion (Thursday). I'm ready to suck on mints, but also have a sore mouth, so can't handle mints, lemon drops, or anything with pepper in it! Joys!!!",
      "MessageIndex": 1421,
      "PostDate": "08/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 9, 2013 04:32PM 6cats wrote: Thank you Heather214 -- just signed up! MinusTwo -- I switch between brands of eyedrops... seems to work better than a single brand... Bad taste? Today is my second day... praying it will go away before chemo on Thursday.",
      "MessageIndex": 1424,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 12, 2013 05:26PM 6cats wrote: PamelaKay... I am so happy you are on this board! You voice things I'm too embarrassed to say... I too hate the loss of \"hair down below\" for the same reason... the other reason I hate it is that aside from the \"normal dryness\" that I experience, I get uncomfortable dryness because the hair is gone... Now the solution... from my straight-laced MO, who told me her favorite lubricant, I found that a very small amount applied down there keeps me from having the dry feeling. It is called Albolene Moisturizing Cleanser -- can buy it at Walgreens... originally developed to remove clown makeup (honest!). Works as a good lubricant on the rare times I feel amorous. But I put it on the inner labia lips (just a small amount), and it really helps me not feel so dry down there. Fingers are numb... so I can't type good. But thanks PamelaKay for bringing it up!!",
      "MessageIndex": 1548,
      "PostDate": "12/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 23, 2013 03:28PM 6cats wrote: Annie11595 and shipsgirl -- I've had eyesight changes from the beginning. My MO also said no eyeglass changes until I'm done with chemo (I haven't asked her how long I have to be done.). But the bluriness, bubble vision (I like that much better than dubble vision, don't you), floaters, etc all come and go. I get irritated... but get reminded regularly by my MO to wait. Taxol/Herception #9 completed yesterday. Uneventful overall, except I got a migraine during the infusion... They gave me a tylenol and slowed down the infusion, but I couldn't really take care of it until I got home. Nausea is worse this time also.. what gives?! I never shared about #8 -- THAT was an eventful MO visit/infusion... got told by my MO that I was sharing too freely in the chemo room about my side effects and to tone it down (the nurses asked her to tell me). I cried through almost my entire infusion last week. Told one nurse what was going on, but isolated myself so I wouldn't be encouraged to talk. So this week I tried to isolate myself again and two patients came and sat down to visit with me for over 20 minutes each. I am so thankful they came by... I was really concerned that I stuck my foot in my mouth! Wish PamelaKay was writing this... it would be a great chemogate... but that's my story for the past week! Hope everyone has a good weekend.",
      "MessageIndex": 1564,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 23, 2013 03:42PM 6cats wrote: TMI totally minustwo -- nose bleeding -- I too, suffered from regular nose bleeding, but worse in the morning. I also suffer from perpetual runny nose. My MO suggesting taking Claritin/Zertec, or something similar... that didn't seem to help much except on chemo days when they gave me a second claritin. But, I have found a couple of things that have helped some. Someone on the board mentioned slathering the inside of their knows with Eucerin.. a heavy duty lotion that looks like Vasoline... when I started doing that twice a day, I found that most of my bleeding was coming from the inside of my nose from a tiny scab that would get caked with \"buggers\", I'd clean out my nose by blowing or with a tissue and here would come the blood! Once I knew where the blood started from, I could apply pressure to that point, and a scab didn't build up that the snot would collect on.... reduced blood, and constant runny nose... progress. The second thing that has helped is a Z-Pack -- Zithromycin. I had to go on it because of a cat bite, but once I started it, I started blowing yellow \"sheets\" out of my sinuses, and I'm down to having serious drips only two or three times a day. I think that even though everything was clear when my nose ran, I must have had a slight sinsus infection. I just finished my z-pack this morning... so we will see if the new \"non-runny\" continues once I stop. On a different note... I hate neuropathy with chemo brain.... it takes me twice as long to type anything!!",
      "MessageIndex": 1565,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Sep 9, 2013 05:25PM 6cats wrote: Official whine session coming up... I received a call from my primary care physician asking if I would call to set up an appointment. I assumed the reason was that my primary care doc and I decided not to have regular check-ups until after I finished chemo, and my last chemo is this coming Thursday... so I called and found out that my primary care doc has left this practice... that she is now with an urgent care group so can't be my primary care physician. And that I have to see a new doc. To make matters worse, in the clinic where I go, the two docs with the most experience, are docs I've had previous dealings with. One missed my late husband's brain tumors 20 years ago... and he died a year later in a lot of pain. The other was my primary care physician at the time, and I found a new doc cuz I couldn't walk into that office without getting angry. AAARG! (I know, International Talk Like a Pirate Day isn't until Sept. 10th!). But honestly, my other choices include a man with a foreign accent that I can't understand, and someone I've never heard of before... I'm officially angry at my doctor for walking away from ME... although I know it is unreasonable, and unrealistic... AAARG!",
      "MessageIndex": 1602,
      "PostDate": "09/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Oct 15, 2013 01:05AM 6cats wrote: OK, April Chemo Group! It is time for a role call! On September 29 it was six months since my lumpectomy... so, despite rads, despite chemo, despite ongoing herceptin, I am technically cancer free! I just celebrated my six month cancer-versary! (That means tomorrow I go for my first follow-up mammogram)",
      "MessageIndex": 1629,
      "PostDate": "15/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 4, 2013 01:36PM 6cats wrote: OMG !!! I was sooooo happy to sign on this morning and find you all were feeling as CRAPPY as I am.  I was smiling by the time I finished reading the new posts!!! One Week Post AC and Day 2 Newlasta... So thank you for making me feel not so alone.... I can face the day today! And... thank you for those who posted that #2 wasn't so bad.... sometimes I work myself into a frenzy because I don't know what is coming next. Can we all go on vacation together? Sometimes I think that would be so much more fun that sitting here fretting! So, thank you for feeling like CRAP and bring some joy to my worried/anxiety filled/lonely/depressive life!!! (And I say that with the greatest love!)",
      "MessageIndex": 738,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 7, 2013 03:25PM 6cats wrote: Thank you Pamela Kay -- I get stuck in myself and needed to go to the amusement park for a few moments!!!!",
      "MessageIndex": 796,
      "PostDate": "07/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 8, 2013 03:40PM 6cats wrote: MinusTwo -- the wig people told me to wear my glasses on the outside of the wig cap rather than under - it does feel much better. Who would have thought that hair loss could be so exciting...",
      "MessageIndex": 824,
      "PostDate": "08/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 16, 2013 01:44PM 6cats wrote: Ok... my topic for the day is Body Image (Yipes!) Last night as I was preparing to go to a meeting where it would be the first time meeting a bunch of people, I realized I felt like a teenager, unsure totally about my body, not feeling good at all about it. So let's talk... First the head, I know bald is beautiful (or patchy since some is still left). My sister told me I was lucky, I've got a beautifully shaped head, at least my mom turned me regularly when I was a baby! But, I look in the mirror and see bald, not beautiful. My only funny (not sexy) story is that I was at a meeting wearing a cap with long-tails (like a long-tailed scarf). Someone asked how it was made and I told them... the response was... \"Oh, you're wearing a fancy dew-rag\"! Now to my boobs... I still have both of mine, unlike some of you ladies, but we both have scars to deal with, and many of us have the lumps and bumps of port placement. Add to that (for those that had radiation first)... the chemo burns... once again, not sexy at all to me. Then comes the body functions... we won't go into detail, but either everything is stopped or running... I'm either bloated or not... bladder irritation makes my primary exercise running to the bathroom! Chemocoaster where are you? So after crying, trying to decide what to wear on my \"beautiful baldness\", I made it to my meeting and home. Hubby comes up and said it was time for \"body image sex\". I agreed, cuz I really couldn't wrap my head around myself as beautiful no matter what I told myself. Soo... dry as the Saraha Desert, I used Replens so things hopefully wouldn't hurt... Hubby used Astroglide... guess what ladies... don't do it!  The two don't mix and create little white gritty things when combined!!! So take it away ladies... am I the only one plagued with teen angst about my body?",
      "MessageIndex": 954,
      "PostDate": "16/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 17, 2013 04:45PM 6cats wrote: Oh ladies, I needed a laugh this morning... Thank you!!!",
      "MessageIndex": 974,
      "PostDate": "17/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 20, 2013 03:59PM 6cats wrote: CarolA5587 -- I too have had a much harder time emotionally since my second chemo. I can't tell you how many times in the past week I've thought about running to my regular doc for antidepressants. Virginger -- what a beautiful prayer, it speaks to my soul.",
      "MessageIndex": 993,
      "PostDate": "20/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 23, 2013 01:59PM 6cats wrote: PamelaKay, I couldn't have summed up the past posts any better.... ditto Today is Day 21, I'm off to #3 of four AC. Then on to weekly Taxol with Herceptin for 12 weeks (yipes!) I'm going to ask my MO about DD Taxol today. As far as SE go: AC#1 -- severe headache for days, mild nausea, cracks in both corners of mouth, mouth sores and daily, multiple diarrhea. Clipped my hair on Day 10 as I was loosing longer layers which was leaving me with short gray layers. Stubble started falling out on Day 13. AC#2 -- severe headache (but for a shorter period of time), constant fatigue, mild nausea, cracks in alternating corners of mouth (but no mouth sores) and constipation. Had more depression with this round. Also with the second dose I had severe radiation recall, with blistering and bleeding. Chin hair is gone, still have some moustache, lost most of the outer half of eyebrows, head has patches of totally bald (but hair isn't growing), still have to \"spot shave\" my legs, but pits are smooth. I changed my diet, reducing amount of milk products (or taking lactaid), and increasing carbs like pasta, so that may have affected my intestinal difficulties. I also have avoided salads, as they can cause diarrhea. The diet change may be the cause of the constipation. Thought I'd try to get this all in one place... I'll try to add to it before my 4th (and last) AC.",
      "MessageIndex": 1045,
      "PostDate": "23/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "May 26, 2013 04:09AM 6cats wrote: I don't think so, the skin isn't pink. Just tender to the touch. I have radiation recall on my breast -- bad redness with blisters (OUCH!). I'm watching my temp and hoping it goes away soon.",
      "MessageIndex": 1090,
      "PostDate": "26/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 11, 2013 01:31PM 6cats wrote: AllieM -- Congrats on finishing chemo!!!!! Heather214 -- I'll be starting Taxol + Herceptin weekly for twelve weeks soon (followed by herceptin every three weeks until a year is complete). My understanding is that the herceptin will continue a year, no matter whether you are taking it weekly or every three weeks). Do you know if your Taxol is Dose Dense? I believe the dose dense Taxol is spaced out a little longer with herceptin on the off weeks. I talked to the nurse yesterday, she said the herceptin alone is only about 30 minute to an hour (prep-time, etc), so many people come in at the beginning or end of their work day for it. Maybe your MO can make some adjustments for your work schedule.",
      "MessageIndex": 1265,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 11, 2013 07:31PM 6cats wrote: heather214 -- Yes, mine is Taxol + Herceptin, once a week for 12 weeks. Followed by Herceptin once every three weeks for the remainder of the year. I too have a lot of port pain, I hate getting poked and it hurts no matter how much spray they put on it! But considering I'll be receiving something via the port for over a year, I think I'm glad that I don't have to worry about vein issues. Are anyone else's finger nails growing very slowly?",
      "MessageIndex": 1268,
      "PostDate": "11/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 14, 2013 03:22PM 6cats wrote: kerri -- my 16yo reacted a lot like your daughter when I shaved my head. He was angry because I shaved it when I \"didn't need to\". I think part of it is that teens don't want to stick out -- they want their mom to look \"normal\". Anything that draws attention to a teen, can be uncomfortable. My guess she is worried that her pictures at graduation will look \"funny\". If you can hold out until graduation, that might be good... otherwise, ask her opinion and get her help in chosing how you will look... shop for a cool hat together, etc. Hopefully, if you get her involved in the process, it will help. (but maybe not, my 16yo is still ticked that I shaved my head! LOL)",
      "MessageIndex": 1305,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 14, 2013 03:54PM 6cats wrote: Aargh! Its sex again... it seems that about once a week it comes up on this board. My DH decideD that I'm \"not feeling well enough\" for sex and then refused me! The thing that gets me, is that when I feel good, I expect him to take advantage of it!! Just irritated today, he said, \"its not you, its me\" -- hard for it not to feel its about me. It seems since I was diagnosed, we take life so seriously... I'm ready for flirting and teasing... but instead am being constantly evaluated on whether I hurt too much, whether I have too many SE, whether I'm too tired... This too shall pass... just needed to vent for a minute. Thanks everyone for being here....",
      "MessageIndex": 1308,
      "PostDate": "14/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 26, 2013 04:59PM - edited Jun 26, 2013 05:14PM by 6cats Hi all... Finished my last round of AC on the 10th. Wouldn't you know it, on Day 13, my eyebrows started falling out, so now they are very thin and scraggly. I suffered minimal side effects from the AC, so thought I'd give an AC SE roundup. Treatment Plan, Dose Dense AC -- Adriamycin+Cytotoxan (Doxorubicin/Cyclophosphamide), 4 infusions via port followed by Day 2 Neulasta (took Zyrtec on Day 1-6). Treatment was every other week. -- Fatigue was the constant SE, lessening on Day 12 and worst on Days 2-5. Each treatment the fatigue was worse. I had no changes in the taste of food. Dry skin got worse throughout entire treatment cycle. Mild nausea first three days easily treated by prescription medication with a second round of nausea on around days 7-9 (also treated easily with medication). Throughout treatment was able to maintain outside meeting commitments, cook dinner daily, keep up with laundry, and keep the house basically clean. Due to change in diet, gained four pounds. Tx#1 -- Extreme headache for 5 days, relieved only by oxycodone; extreme GI issues, daily multiple diarrhea, sores in mouth, cracks in corner of mouth. Lost 5 pounds. Clipped head on Day 9, followed by major hair loss on Days 12-14. Went to patchy bald with very thin stubble. Slight radiation recall at site of radiation. Tx#2 -- MO slowed down administration of pre-meds (anti-nausea medication) due to previous headache. Doc also prescribed \"Magic Mouth Wash\". I increased whole grains to add B Vitamins into my diet and hopefully help with the GI issues (and gained weight). At doc's recommendation, I cut back on milk products, and used generic Lactaid before having milk products. Extreme headache for first 24 hours, followed by dull headache for three more days. Diarrhea taken care of... no sores in mouth, but had cracks in corner of mouth beginning on about Day 10. Radiation recall reached blistering stage by Day 8, requiring a visit to the RO who gave me Silvadine to put on the blistered/sore areas. TX#3 -- MO changed nausea pre-med due to headache issues. This time extreme headache on Day 1 for ~4 hours, followed by dull headache over next 12 hours. Only GI issue was cracks in corner of mouth. Received three insect bites on Day 3 which I thought were brown recluse due to the severity of swelling and redness; Day 5 my MO prescribed antibiotics. Day 15 my MO sent me to a dermatologist, was given a cream for the bites which resolved them within a week. Derm Doc also gave me a cream for the cracks in the corners of my mouth which helped after about five days. Also had inflamed \"age spots\" on my arm and chest. Dermatologist said that these were likely pre-cancerous cells that the chemo had attacked. Made plans to have a full-body check after chemo is complete. Very slight radiation recall this treatment. Depression was bad with this cycle. Also started to have bladder irritation. Tx#4 -- delayed four days due to conference so had a few extra days to gain energy and heal. Extreme headache for ~1 hour, followed by dull ache for another four (yippee). Cracks in corner of mouth started again on Day 5 -- this time nothing would touch them (I still have them). They are rather severe and painful. Bladder & urethra irritation continued despite increase in fluid. Rather uneventful treatment. I hope this helps someone -- I had imagined something far worse. Next step for me is twelve weekly treatments of Taxol (paclitaxel) + Herceptin (Trastuzumab). I start on Thursday. I have a hard time believing weekly chemo could be easier than what I just went through, but we shall see.",
      "MessageIndex": 1370,
      "PostDate": "26/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jun 28, 2013 10:28PM 6cats wrote: Annie11595 -- I had my first Taxol+Herceptin yesterday... don't know why, but I'm freaked out also... maybe it is the thought of weekly chemo for the next 12 weeks... but I feel your pain. I survived yesterday, panicked last night, and am exhausted today.",
      "MessageIndex": 1381,
      "PostDate": "28/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 3, 2013 01:56AM 6cats wrote: Tomorrow is my 2nd TH -- really dreading it. It wrung me out so bad the first time... and serious pain. I've also got cracks in the corner of my mouth and food hurts my tongue and roof of my mouth... I may lose that weight the MO wants off of me! I had a disconcerting message left on my phone by my MO's nurse yesterday. They did another baseline ECHO cardiogram and found that there were some changes... that things were still in the normal range but that I needed to see a cardiologist. Thankfully, I was able to get in today. We are going to do cardiac bloodwork each week to monitor things, and I'll have to have another echo in six weeks. Hopefully this won't change my treatment plan... I guess I'll find out tomorrow when I see the MO again. For those that remember Hee-Haw... Gloom, despair and agony on me... deep dark depression, excessive misery... if it weren't for bad luck, I'd have no luck at all... Gloom, despair and agony on me... (to be sung with a pronounced twang!) No, life isn't that bad, but the song popped in my head, and I just had to share!",
      "MessageIndex": 1399,
      "PostDate": "03/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Jul 18, 2013 09:47PM 6cats wrote: I'm so proud of you shipsgirl!!   At least you remembered to wear matching socks... your socks matched your shoes... And you wore closed toed shoes to protect them from accidental bumps... Good girl!!!",
      "MessageIndex": 1460,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 7, 2013 04:56PM 6cats wrote: Thank you kobrien for checking in... I realized the activity of this board has gone way down and I'm sure it is because everyone is finishing up, starting something new, waiting for something new, etc. So I'd like to recommend a check-in for all who started out on this board. Also if you've started on another therapy and have started frequenting another board, please point us in the right direction... sometimes it is hard to find the right board to be on... So... Here is my update... A/C with Day2 Neulasta is complete. Relatively speaking I breezed through the AC without too much trouble. I was able to continue my normal schedule. GI issues were probably my worst SE (cracked corners of mouth, sores in mouth, alternating diarrhea and constipation). And the benefit was that my fibromyalgia pain was almost non-existent during the entire eight weeks! At the end of my A/C I had an echocardiogram. The ECHO showed a 9% change in my ejection fraction, some changes in mitral valve function, and some enlargement in my right ventrical. I have a second ECHO on September 20th to see if the changes still show up or if they are worse. I am now receiving 12 weekly treatments of Taxol + Herceptin. I have just passed the half-way point and will have #7 on Thursday. This has been much harder on me. My energy levels have dropped to the point I am limiting my activity each day. Worse than that, my pain levels are through the roof, and don't ease up as the week progresses... just one long week of pain, then another treatment. Cracks in the corner of my mouth are really bad. Constant runny nose and sores in my nose. But my wierdest SE is flatulance! Who'd a thought?!?! Peripheral Neuropathy: Numb fingertips and toes (on occasion it becomes entire hand and feet). Upper lip, tip of tongue, and upper gums are numb. Taking Neurontin / Gabapentin for it. Am slowly increasing my dosage as my SE's get worse. Thankfully, I rarely have tingling, only numbness where I can still feel pressure. Hair Alert: Taxol has made it so I don't have to shave my pits or legs at all. The hair is falling out on my head again. My eyebrows and eyelashes are all but non-existent (no problem on A/C). \"Down Below\", I'm losing the last of the hair slowly. The biggest negative is that my chin hair and hair on my upper lip is growing back in... go figure. Helpful board -- Weekly Taxol group: http://community.breastcancer.org/forum/69/topic/788735?page=64#idx_1915 Hope to hear from others... I'll put together a list of all recommended boards as time goes on...",
      "MessageIndex": 1527,
      "PostDate": "07/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Aug 29, 2013 11:28PM 6cats wrote: I want to say thank you to this group... to those who have received bad news, my prayers are with you. To those who have completed treatment, I celebrate with you. To those awaiting surgery, my prayers for both you and the docs are with you. This forum gives me a place to share my journey. I am so thankful that I can talk about how I'm doing, good or bad. I am thankful that I can get perspective -- it could be worse... but also there are others that have had an easier time than I. This is a place where we can talk of intimate problems (mine are still ongoing), and laugh with others -- than you all for your humor. So thank you for being here... Today I survived weekly TH #10 -- only two more to go, then 14 Herceptin only (once every three weeks). And here you would laugh if you saw what I actually typed first... finger neuropathy is awful on a smaller keyboard! Thanks again!",
      "MessageIndex": 1577,
      "PostDate": "29/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Oct 16, 2013 08:00PM 6cats wrote: MinusTwo -- yes, clean ULS also... I made them do an ultrasound because of pain in the breast where I had the lumpectomy... all they saw was a seroma which eventually will be absorbed. So sorry to hear about your infection, how frustrating (probably a mild term). FWIW, I had a fairly easy time with A/C -- so praying it will be easy for you too.",
      "MessageIndex": 1636,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    },
    {
      "AuthorID": "6cats",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/177460/profile",
      "Content": "Oct 24, 2013 06:56PM 6cats wrote: Thank you Anne11595 for checking in on me. No, I didn't go back to bed... Tried to accomplish basics yesterday -- and I canned six pints of \"end of the year\" cucumbers. Was on my feet a lot yesterday Went to my new primary care physician Tuesday. She thinks the hip pain I've been having that prevents me from sleeping might be bursitis. What fun! NOT! I wonder if multiple joints with bursitis (shoulders, hips, heel) is related to treatment in any way?",
      "MessageIndex": 1646,
      "PostDate": "24/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/802112",
      "Title": "April 2013 Chemo Group BeHereNow 6cats"
    }
  ]
}