{
  "AuthorID": "A1shif",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275928/profile",
  "Posts": [
    {
      "AuthorID": "A1shif",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275928/profile",
      "Content": "Aug 3, 2018 10:27PM - edited Aug 3, 2018 10:29PM by A1shif I am in the same boat. Because of my family history and seeing what my aunt went through while they took her breasts lump by lump and having radiation and chemo (which obviously didn't do the trick), I opted to have bilateral mastectomy and no radiation, no anti-hormone therapy. I had very large breasts and wanted a reduction anyway, so now I have less of a recurrence problem because of almost zero breast tissue. My initial MO was rude, said I had decided to over treat my cancer and I should've kept my breasts and just been happy with radiation and tamoxifin. This is when I decided to fire him and find someone who will not degrade me but work with me. Before I left and fired him, he told me that I WAS going to take tamoxifin, even though I have a history of blood clots, and he sent in a prescription. Needless to say, I have an appointment in one week with my new, and friend-recommended, MO! What we decide is a personal choice. I was told tamoxifin would make a 1% difference in my recurrence rate. No thanks!",
      "MessageIndex": 53,
      "PostDate": "03/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/863281",
      "Title": "node negative stage I breast cancer question swimjames swimjames"
    },
    {
      "AuthorID": "A1shif",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275928/profile",
      "Content": "Aug 3, 2018 11:12PM A1shif wrote: It means there is nothing abnormal seen in that breast or the lymph nodes. That's good",
      "MessageIndex": 2,
      "PostDate": "03/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/866339",
      "Title": "What does No axillary or internal mammary adenopathy karebear_049 A1shif"
    },
    {
      "AuthorID": "A1shif",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275928/profile",
      "Content": "Aug 4, 2018 04:14AM A1shif wrote: 55. The oldest in my family. Most are diagnosed younger",
      "MessageIndex": 900,
      "PostDate": "04/08/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/814671",
      "Title": "Would you mind sharing your age at time of diagnosis? ByFaith Gussy"
    }
  ]
}