{
  "AuthorID": "A_FIGHTER",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
  "Posts": [
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 25, 2012 05:02PM A_FIGHTER wrote: Hi Everyone, I received my Onco score today 14 - Happy, but concerned... I have two Oncologists still...Prior to knowing my score One Oncologist has said if low, no chemo - but Tamoxifen and Ovarian Suppression...Other Oncologist is recommending Chemo and Tamoxifen even if low (due to my age 39 and Lymphovascular invasion)...14 is close to 18 as I told my Cancer Surgeon who was clear on saying no Chemo... Another thing which concerns me is the wording on the Onco Results...\"The findings summarized in the Clinical Experience sections of this report are applicable to the patient populations defined in each section. It is unknown whether the findings apply to patients outside these crtieria.\" Below the above statement I just typed it says...\"This study included post-menopausal female patients with Node Positive, Hormone Receptor (HR)-Positive Breast Cancer.\" I am NOT Post-menupausal - So, I called Genomic Health and the response to my question of whehter this test is now Null & Void for me was -  no it's not null and void and the results do apply Then WHY is the wording on such on the results... I questioned this test at the beginning to as it was originally intended for node-negative...My Cancer surgeon assured me it is now done for both... My results have two parts, one result w/ node negative and the other showing node-positvie   What to do to have piece of mind??? On the up side - I was cleared to go back to exercising. So, today, exactly one month after surgery I'm back running! Wahoo!!  Ran 2.05 miles today ",
      "MessageIndex": 38,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 27, 2012 04:46AM A_FIGHTER wrote: Happy Friday! bgirl - Thank you! I am going to keep on reading! I've been reading about Zometa (Zoledronic Acid) - I did see it works for women well into menopause though. It also mentions putting premenopausal women into treatment-induced menopause. It appears with this I would need Tamoxifen, ovarian suppressionn plus the Zometa...Anyone using Zometa?   One thing I've noticed, and I guess understandably so, is some friends/family are so ECSTATIC with my news! I say some because I stopped telling my score as to me it's NOT settled and I'm getting tired of explaining why I'm NOT as happy as them. I'm stuck between a rock and a hard place! It's totally bitter-sweet! momof3boys -  Thank you for sharing! The one Oncologist who has recommended Chemo with the low score is young too (35) - Brillant as well...The other Oncologist (in her 60's) is the FIRST go to Oncologist around here...Even more Brilliant! From the first one, she does want to go more aggressively - her words - \"You don't want to possibly be in your 50's and then wish you would have done the Chemo\" But again no guarantees either - I could also do Chemo and still perhaps end up with probelm in my 50's... Tomorrow is the BIG Day - Race for the Cure - We have raised $4,128 and we have 49 friends on our Team...Love it!!!  It's going to make for a very diffrent day as this year I'm on the other side as a Survivor!!! Enjoy the Weekend Everyone Hugs, Bonnie ",
      "MessageIndex": 43,
      "PostDate": "27/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/780827",
      "Title": "Oncotype DX testing bethhoul MimiNC"
    },
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 11, 2012 07:39AM A_FIGHTER wrote:  Good Morning   Blessing2011 Thank you for the welcome CookieMonster please add me to the list of December Surgeries. Thank you for asking. goldlining thanks for sharing what the Dr. said about running...I'm seeing the Dr. today (Cancer Surgeon) and I will mention the response you received as this wasn't what I was told...I was told 6 weeks...I will also ask Reconstruction surgeon as well...I'm sure this is who I actually need to ask...I'm VERY active - prior to surgery I was running 6 days aweek, boot camp 5 days a week, TRX/Kettlebells 2 days a week, Kangoo jumps 2 days a week, and Restorative Yoga 2 days a week... Bogie I am NOT a back sleeper either! I am now somehwhat on my side and more comfortable now...It's been 2 weeks since surgery.",
      "MessageIndex": 866,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 25, 2012 07:30AM A_FIGHTER wrote: Bogie - As far as second opinons on final pathology -  I've been seeing two Oncologist from the get go (before I had surgery). They both have recommended the same \"cocktail\" if Chemo is needed and five years Tamoxifen. However, one would also like to do Ovarian Suppression.  I will choose which one I will be in the care of once I receive Oncoyype DX results (today or tomorrow, thank goodness) and having one more appointment with each of them. They both know each other and are aware I am seeing the other. My \"Team\" of Dr.'s meet every Thurs. to discuss their patients. Yes, BOTH oncologists are at the meeting. I told my Cancer Surgeon it must make for an interesting meeting...LOL I already have an idea of who I will probably see...This is based on how I feel with the Dr.'s office themselves...One is a VERY busy office and the other has a more homey feeling (office is on a much smaller level). I will choose my treatment based on their recommendations. I will also see which takes the time to look over my supplements in whether I can continue them. This is VERY important. I do not want to hear them just say no. I need to know exactly why I wouldn't be able to take them. This will take some time on their part and I hope at least one of them will be willing.  Also another bit of importance to me, my Recontruction Surgeon and Cancer Surgeon were wonderful! I had their email adresses and would email them as need be. I ALWAYS received an email back the same day or a phone call! They offered their emails from the get go. Yesterday, I somewhat put the Oncologists to the test. I called and asked for their email adresses. I received both of them. Boy, are they in trouble now...LOL...I kept forgetting to ask them myself cause, as you can imagine, a gazillion other questions were coming out of my mouth at office visits. On another note, received some of the best news yesterday! I am able to go back to working out...Wahoo! One day shy of a complete month of healing...I'm back in the saddle! I also was told to start removing the glue they used on incisions and to start using scarring ointment...As of last night, ALL glue has been removed and everything looks EVEN better ",
      "MessageIndex": 1038,
      "PostDate": "25/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 20, 2012 12:34PM A_FIGHTER wrote: Hi Everyone, New to this blog as my Stage Changed...I found this out after seeing my second Oncologist...Originally told Stage IIa due to micrometastatic (N1mi .47mm) carcinoma. I was told by Cancer Surgeon and another Oncologist...I'm seeing two Oncologist (another story).  The stage has now changed to Stage Ib due to the micrometastatic finding... I asked why such sites such as breastcancer.org do not show this. I was told this is fairly new within the last two years. Of course, when I got home and started my research I found documentation. She did show me documentation in her office too. However, I needed to find it for myself as well.  One place was www.cancer.org - How is Breast Cancer Staged. So here I am  I'm waiting on OncoType DX to determine my treatment plan.",
      "MessageIndex": 11093,
      "PostDate": "20/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 10, 2012 01:55PM A_FIGHTER wrote: Hi Everyone! I had surgery Dec. 28th...Cancer was only found in left Breast...went w/ a BMX Subcutaneous (nipple/aerola sparing) w/ immediate Reconstruction...I thought I was going to have two drains...ended up with three...No biggie!...One drain was removed last week...yesterday other two removed...I feel somewhat FREE again! This was the first time EVER being admitted to the hopital and first EVER surgery...All went VERY well! Catheter was put in after I was already in Surgery Room and removed next day...I was worried about this whole process...no complaints I asked for a motion sickness patch before surgery during prep...I read about asking for this in a book...I did NOT want to get sick...All went well with this too...No sickness I came out with a Morphine drip which I barely used...it was taken away the next day...I can't say I had pain... just some minor discomfort and to me it wasn't enough to use the drugs...I dread taking ANY medications...I also didn't need my pain meds. at home First post-surgery appt. with Surgeon found out tested positive for one lymph node and there was lymphovascular invasion :( VERY surprised...went in thinking lypmh nodes were clear...PET Scan didn't pick it up...too small .47mm   Waiting on the OncoType Dx result...One Oncologist is suggesting Chemo (Taxotere/Cytoxan 1X Every 3 Weeks for 4 Doses) & Tamoxifen...I was upset and then thought don't worry about it just yet as it's NOT defintie...See other Oncologist on Monday For those who haven't had surgery yet - Believe it or not, I asked my Surgeon if they video tape and/or take pictures. He said video taping is not usually done. However, he could take some pictures. So, I do have pictures from Surgery...   So, back to the waitng process again...",
      "MessageIndex": 854,
      "PostDate": "10/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 11, 2012 03:03PM A_FIGHTER wrote: Hi Bogie... I have two Oncologists...I had them before surgery and still have them after surgery. I am still seeing both to see what my Adjuvant Therapy will be... I saw one Monday and I see the other one this coming Monday. One comes highly recommended from friends/Doctors and the one I'm seeing comes recommeneded from my Surgeon/friends as well...The one the surgeon recommended comes with mixed reviews from freinds who know her. She is part of my team known as \"Team Trio\" ...They are the \"Go To Team\" VERY highly recommended. My Surgical Team plus Oncologist meet every Thurs. about patients. So, when they discuss me they are both there...I'm assuming...The one I saw this past Monday informed me they were just discussing my case last week :)...I thought it was kind of funny knowing both Oncologist were probably there...It never really dawned on me Mind you, when I saw my surgeon post-op my husband chimmed in saying something about what the Oncologist mentioned...I just looked at him as this was the Oncologist he did not recommend...LOL...Later my husband said it's as though we are cheating on him, the Surgeon...LOL...I don't know why I was thinking it would be a hush, hush thing...It's not...all my Dr.'s know  Highlights for today - \"Today's Simple Pleasures\" - I am not wearing my special top today, I'm wearing a regular t-shirt...Temperatures are dropping and cold front coming through...No worries about nipples poking...LOL...Lastly, free as a bird - No bra   ",
      "MessageIndex": 870,
      "PostDate": "11/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 12, 2012 11:25PM A_FIGHTER wrote: Hi Bogie - As for more than one Oncologist: I saw one this past Monday and I see the other one this coming Monday...My Cancer Surgeon prepared me in a sense, I feel, that the oncologist this coming Monday is going to recommend something different from my other one. My husband and I knew this could be a possibiltiy...It will be interesting to see what she has to say...The Oncologist I see this coming Monday has been practicing for quite sometime - she graduated back in the 70's... The other one just completed schooling in the early 2000's and is 35...Both are HIGHLY recommended.  Obviously, one has more experience, but doesn't necessarily mean she's better than the other...My Dr. did tell me to understand they come from different teaching philosophies...understandably so...So, what will I do if she definitely gives me a different treatment plan?  I have a couple options -  1.) Figure out for myself what I want to do 2.) Ask a back up Oncologist (A dear friend's friend) - I will NOT tell him what other two have said and see what he says Please understand my results are definitely pending the Oncotype DX test...The more experienced Dr. has already told me if low, no chemo. However, this was also told before knowing I had lymph-node involvement (1/6) and LVI invasion. I will keep you posted and I hope this helps :) ",
      "MessageIndex": 876,
      "PostDate": "12/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    },
    {
      "AuthorID": "A_FIGHTER",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/139012/profile",
      "Content": "Jan 24, 2012 01:55AM A_FIGHTER wrote: Hi Bogie- I was told 2 weeks for results...However, it will be a month waiting for my OncoType Dx due to it not being sent out when requested...My surgery was Dec. 28th (when it was supposed to be sent out)...When I found out it wasn't sent they assured me it now has and the results would be in Wed. Well, I personally called Genomic Health today (866-662-6897). They recieved my specimen Jan. 17th and she said my results would be in on Thurs. She was pleasant and very helpful. I also questioned whether there would be a problem due to specimen beng held back for so long . She told me it makes no difference as they take speicmens up to 5 years old :) Hope this helps you! I would call :) I was aggravated with myself for NOT calling sooner! As I am usually good about things like this :)",
      "MessageIndex": 1034,
      "PostDate": "24/01/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/778002",
      "Title": "December 2011 Surgeries - want to wait together? CookieMonster Moonflwr912"
    }
  ]
}