{
  "AuthorID": "A_pallens",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
  "Posts": [
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "A_pallens wrote: I had skin sparing bilateral MX with immediate reconstruction (silicone implants) on 3/28 and while my incisions don't appear infected or overly red, the skin on both breasts has patches of VERY bright yellow, mixed with some purpley bruise coloring.  The bright yellow areas look like where they must have scraped the inside of the skin.  HELP!!!  What does this mean????  I am freaking out.  It's Sunday so I don't really want to page my surgeon and I do have a follow-up with the PS on Tuesday. BMX & SNB on 3/28/11. Original diagnosis was multifocal DCIS. MX showed IDC Grade 2, Stage T1aNOMX found in left breast pathology. Dx 2/3/2011, IDC, 1cm, Stage I, Grade 2, 0/1 nodes, ER+/PR-, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767017",
      "Title": "Help - Bright Yellow Skin!!!!! A_pallens barbe1958"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 3, 2011 03:33PM A_pallens wrote: barbe1958 - Thank you so much for responding!!  I am frightened - thinking that maybe the skin is dying??  It isn't a topical solution and has really only \"developed\" in the last day or so.  I looks much worse (brighter yellow) than it did yesterday when I was thinking normal bruising. ",
      "MessageIndex": 2,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767017",
      "Title": "Help - Bright Yellow Skin!!!!! A_pallens barbe1958"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 3, 2011 05:18PM A_pallens wrote: Thanks gals - I feel a little better.  I'll probably wait until tomorrow to call the Dr.  Everything else looks \"normal\" but that technicolor yellow is really freaky.",
      "MessageIndex": 5,
      "PostDate": "03/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767017",
      "Title": "Help - Bright Yellow Skin!!!!! A_pallens barbe1958"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 5, 2011 11:09PM A_pallens wrote: OK - stupid me in a freak-out for nothing - LOL!  I saw the PS today and she said I was healing great.  The bright yellow is just bruising.  Even though it was bright citrus yellow color!  What a relief and I'm feeling silly now but thanks for everyone who responded.  It did make me less worried.  :-)",
      "MessageIndex": 10,
      "PostDate": "05/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767017",
      "Title": "Help - Bright Yellow Skin!!!!! A_pallens barbe1958"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 4, 2011 01:48AM A_pallens wrote: Thanks for all the replies!  I feel better just knowing I'm not out on this limb alone.  The antiseptic they used was clear so I doubt it's a stain - it looks like fat right under the skin but it's so damn bright I've never seen anything like it.  I'm going to call the dr. in the am and will update...",
      "MessageIndex": 8,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767017",
      "Title": "Help - Bright Yellow Skin!!!!! A_pallens barbe1958"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 6, 2011 12:13AM A_pallens wrote: Thanks again ladies and many hugs to all!!!",
      "MessageIndex": 15,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767017",
      "Title": "Help - Bright Yellow Skin!!!!! A_pallens barbe1958"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Jun 22, 2011 12:42AM A_pallens wrote: @ Amyrich So glad this was helpful for you!  I'd forgotten about it but just received a notification that someone had posted so I checked.  I did heal up pretty well - and the freaky brilliant lemon yellow color faded to a more normal bruising before finally going away all together.  I'm sorry you had to go through this as so many of us have.  Heal well!!!",
      "MessageIndex": 18,
      "PostDate": "22/06/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/767017",
      "Title": "Help - Bright Yellow Skin!!!!! A_pallens barbe1958"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 6, 2011 07:58PM - edited Apr 6, 2011 08:03PM by A_pallens Babsling - Hillary here.  I am 9 days out from BMX and I almost cried when my PS told me yesterday that she wouldn't take my drains out yet.  I am still putting out more than 40 ml/day out of each drain.  That's down from nearly 200ml the first day home (next day after surgery.)  Don't worry - you're moving in the right direction.  I read one woman's story on this board who was still putting out around 75ml after 3 weeks and her surgeon finally pulled the drains more out of concern for infection.  She said she knows she will need needle aspiration.  3 WEEKS and 75 ML!!!  I was able to have reconstruction with small silicone implants during my BMX so aspiration is not a possibility for me.  I hate them more every day but my PS said I am healing well and the output is totally normal.  Don't worry!!  Call your DR if you are still nervous.  Just keep tracking your output though and thank heavens you're not at 75ml. Big (Gentle) Hug!!! Hillary",
      "MessageIndex": 304,
      "PostDate": "06/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 8, 2011 05:34AM A_pallens wrote: I'm 10 days out from BMX and left-side SNB and am doing OK.  I have a follow-up with the surgeon today and am HOPING to get these miserable drains pulled.  Beyond the physical discomfort, I am starting to view them as an overall impediment to continued healing.  I still have pretty significant pain - my skin is extremely sensitive and my pec muscles hurt with any movement.  I guess they really do a number on you in order to create a pocket under the muscle for the breast implant.  Ouch!! On a better note, I met with my oncologist and don't need chemo!!!!  Yay!!!!  I will start Tamoxifin next week and will be on it for 5 years.  Not too thrilled with the spectre of side effects but it's better than cancer!!! I hope everyone is doing well - I'm sending out the good juju!!!  :-)",
      "MessageIndex": 309,
      "PostDate": "08/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "May 25, 2011 06:47PM A_pallens wrote: Kezzie - I'm so sorry to hear this news.  It's what we all worry about.  Has your doctor seen any new trials or treatments on the horizon that look promising? I liked what mom2one had to say about her friend, and the \"don't give up!\"  There are a lot of survivor stories and you have many here pulling for you - stay strong.",
      "MessageIndex": 376,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Mar 10, 2011 07:14AM A_pallens wrote: Hi ladies - add me to the March list.  I just got my surgery date: March 28.  :-(",
      "MessageIndex": 102,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Mar 10, 2011 10:03AM A_pallens wrote: It's sad to see such a long list of us lined up to have our boobs cut off.  It's hard to believe that a better (medical) cure has not been found.  I am so glad to have found this web site - it's been a great resource for information, and for the practicalities and little things that the doctors don't seem to offer much on.  Thank you to everyone who contributes here - it makes me feel less alone and terrified.",
      "MessageIndex": 104,
      "PostDate": "10/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Mar 31, 2011 03:30PM A_pallens wrote: @ ForMyBoys  So glad you're home early too and wish you a smooth and speedy recovery!  I'm doing pretty well but my drains are also a major pain.  Yesterday I had 140 ml out of one side and 110 ml on the other.  My surgeon says she won't remove them until they're down to less than 20 ml a day.  Rrgg!!!",
      "MessageIndex": 271,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Mar 31, 2011 10:10PM A_pallens wrote: @ mebmarj So sorry you had to go through this again.  Sometimes it just sucks to be a woman!  Are you going to be OK with the hysterectomy?  It definitely sounds like the right choice.  I am having a gyn checkup at the end of April - my last pap was nearly 3 years ago (I hadn't even realized it had been so long and had made a cross-country move during that time.)  I'm really nervous about it and my oncologist is also insisting that I have a colonoscopy.  My father and paternal grandfather, and my maternal uncle all had colon cancer - my grandfather is the only survivor.  I am only 41 but I think I've been in denial about getting checked.  This breast cancer bout has lit a fire under me and now I want all the tests.  I'm just crossing my fingers that nothing else is wrong with me!  Good luck in your recovery!!!!",
      "MessageIndex": 275,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 4, 2011 07:02AM A_pallens wrote: @ForMyBoys,  I'm not having numbness or exceptional pain in my armit post-MX but I did have this after my second round of Ultrasound/Vaccuum biopsies.  It happeed about a week after the biobsy and was quite painful.  My surgeon told me not to worry as the lymph nodes under there are where all the extra fluids from swelling head from the breast before being absorbed by the body.  It makes sense - it is the lymph system after all.  I had a tough time with both biopsies - a lot of swelling, pain and bruising.  When that arm pain started, I was of course convinced in my mind that it was the cancer going crazy but my sentinel node biopsy came out clean.  Don't worry too much but definitely give your Dr. a call to make sure, and to keep them advised of this development in your recovery. Warmly, Hillary",
      "MessageIndex": 286,
      "PostDate": "04/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "May 25, 2011 06:42PM A_pallens wrote: Babsling - I have something that I call the \"sausage\" but it runs horizontally from under my right foob and around my side about 6 inches below the armpit.  It is very hard and somewhat painful.  I've had it since the surgery and it has gone down a LOT.  The physical therapist tells me it will eventually go away but I should also apply damp heat and massage.  My plastic surgeon sort of blows it off when I ask about it but I suspect it's the tissue material they tacked in there to hold the foob in place. I doubt this is the same for you but thought I'd toss it out there.  Do you get keloid scarring - could that be it?",
      "MessageIndex": 375,
      "PostDate": "25/05/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Mar 31, 2011 08:44AM A_pallens wrote: Hi all!  I've been pretty quiet since I joined the \"March Group\" but I'm so happy to say that I had my surgery (BMX with one node removed for testing) on the 28th and came home on the 29th.  I'm doing surprisingly well in as much as I am up and walking around, etc.  I HAD to get out of the hospital.  I had a really rough night there - I could not sleep at all and cried all night.  I had terrible headache and nausea.  The night nurse was very nasty and I can't tell you how helpless, vulnerable and scared I was.  I am going to write a letter of complaint in the hope that she will not be allowed to behave that way to other patients in my situation. On the bright side though - it's SOOOO good to be home!!!  My mother is here to take care of me thank God (husband is sweet but not too helpful - LOL!)  My lymph node looked clear but I am still waiting for final pathology.  The Plastic Surgeon was able to do the reconstruction right there during the surgery.  I feel lucky that I will not likely need to have a second surgery for TE exchange but I have to admit I cried again when I peeked.  I was a DD and am now something like a large A/small B.  I didn't think it would be that important to me and the big boobs were a hassle sometimes but I miss them - it's really weird to not have them.  I don't think I was really emotionally prepared for what it would look/feel like to have so little in terms of fat or tissue covering what seems like a tiny implant.  I feel ungrateful to feel like this but I can't help it.  So far, my skin is doing pretty good.  I was a pack-a-day smoker up until my diagnosis and have really struggled to avoid smoking, so I am worried about the viability of my tissue.  Lousy time to quit smoking!!!  My drains (2) are still putting out quite a bit of fluid and they are irritating but at least the sites look remarkably good so far.  I tried to pare down the Percocet yesterday evening but couldn't.  I know this is sort of gross to say but I hadn't been able to have a #2 for over 3 days and I was getting really uptight - not to mention uncomfortable with bloating, etc.  My tummy was so hard and distended - it stuck out way past my \"foobs\"!  After lots of Colace stool softener and a whole mini-bottle of sodium phosphate I finally went a little last night and a bit more this morning.  OMG what a relief!!!!  I have to say that throughout this whole sudden tornado of cancer, this is by far the best site I found for information on the reality and practicalities of what we're all going through.  Thank you - THANK YOU - from the bottom of my heart to all the women who have shared their experiences and ideas here.  It really did make me feel less alone, more prepared and more informed than any doctor or informational web site or brochure did.  Thank you!!!!!!  And my very best to all the other March ladies and everyone here!!!",
      "MessageIndex": 269,
      "PostDate": "31/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 2, 2011 05:45AM A_pallens wrote: Well, I got my pathology report yesterday and in addition to the expected areas of DCIS, a small area of invasive carcinoma was found.  The surgeon said that the margins are clean and that they got it all but there is a chance that I will need chemo and need to follow up next week with the oncologist.  I feel bummed out - deflated.  My spirits are still OK but the relief of being on the \"back side\" of this whole business sort of evaporated.  On the funnier side, I've decided my new \"foobs\" look like thawed out boneless, skinless chicken breasts were used as implants.  The skin covering them is all yellow and green and lilac-colored - just so attractive... :-)",
      "MessageIndex": 281,
      "PostDate": "02/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 12, 2011 08:12AM A_pallens wrote: I'm glad to hear I'm not alone in my pain, exhaustion and general misery (pity party here!)  I cried twice over the weekend out of sheer frustration and anger over how much I still hurt.  I was SOOO disappointed when the removal of the drains didn't bring much relief - if any - from the pain.  I ran out of Percocet on Friday night (I really had thought Friday's drain removal would change things so I didn't think to ask for a renewal of my prescription.)  I had to call the nurse over the weekend and my PS could only give me a Tylenol 3 presription by phone.  I have an appt. with the PS today so I'll ask for Percocet again but I'm starting to feel like some sort of drug-seeking weirdo.  I'm 15 days out and feel like I've had zero improvement in the pain department!!!!  I'm also incredibly depressed by what I see in the mirror.  My foobs bear no resemblance to my old breasts.  They're lumby and wide and more flat.  Not to mention the whole freakish lack of nipples.  I feel so ugly and can't imagine what things will be like if I ever have a sex life with my husband again.  I'm trying not to think about it.  I wish I could be more cheerful - not to mention grateful - but it seems like I'm getting more depressed by the day.",
      "MessageIndex": 318,
      "PostDate": "12/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 5, 2011 06:20AM A_pallens wrote: I have an appt. with my onc and my first follow-up with the PS today.  I am planning to BEG to get the drains out!  I am down to about 40-ish ml per side but I think I will cry if I have to wait any longer.  The drain site on one side started weeping a little bit.  Also, I had a little bit of dried blood on the gauze covering my incision on one side.  I've jumped right to the worst case scenario of the incision pulling apart a little and am hoping that's not the case.  I am 7 days out today and the pain has not abated much - not unmanageable - but I am not ready to wean myself off percocet yet.  Anybody have any thoughts on how long you should be on painkillers? @elmcity69:  I'll be curious to see how the diet works out.  My regular dr. asked me to become a vegetarian for three months when I was diagnosed.  I had been loosely sticking to an Atkins type diet, trying to lose about 25 pounds I picked up during 2 back-to-back home renovations over the last 2 years.  My bloodwork showed a jump in my triglicerides from 149 to 350!!!!  And I was eating \"healthy\" brown rice, veggies, whole grain breads, etc.  Unbelievable what a so-called healthy diet can do to you!  I am starting to ease back into more meat and fish and I'm going to go back to Atkins.",
      "MessageIndex": 297,
      "PostDate": "05/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    },
    {
      "AuthorID": "A_pallens",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/124880/profile",
      "Content": "Apr 9, 2011 10:38AM A_pallens wrote: I finally got my drains out yesterday!!!!  I'm thrilled not to be \"packing\" all that gear around on my body but I'm really feeling let down by the fact that my pain hasn't really subsided.  I think I had it in my head that removing the drains was going to be some sort of breakthrough into recovery, and that most of the pain would miraculously go away.  Reality check!!!  I'm really just as sore as I was.  I'm at 11 days and am just so surprised that this discomfort hasn't eased up at all.  Things are looking a little better as far as the bruising goes but my foobs still look sort of lumpy and mismatched.  They are my final implants so I hope things improve when more swelling goes down.  I'm just over this crap!!!!!!  (Venting a little...)",
      "MessageIndex": 313,
      "PostDate": "09/04/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/764341",
      "Title": "March 2011 Mastectomy elmcity69 Glo3mom"
    }
  ]
}