{
  "AuthorID": "ab0792",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163735/profile",
  "Posts": [
    {
      "AuthorID": "ab0792",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163735/profile",
      "Content": "Nov 4, 2012 01:28AM ab0792 wrote: I can relate the waiting makes keeping your cool and your sanity very hard. To go on trying to deal with life when it's in the back of your mind. I think it's amazing how positive you are being shows so much strength!! But I been saying for the last month this is one roller coaster I want to get off!! Just to close this scary chapter in life on a positive note of great health is all we can pray for! I really just wanted to say you have gave me inspiration to try to be as strong as you!",
      "MessageIndex": 4,
      "PostDate": "04/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/795871",
      "Title": "Biopsy scheduled for Tues...but EyesOpen38 EyesOpen38"
    },
    {
      "AuthorID": "ab0792",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163735/profile",
      "Content": "Nov 3, 2012 11:37PM ab0792 wrote: Sorry I wasn't so clear in my forum I went back already for an ultra sound and I got those results back and I haven't spoke to my doctor I finally just went to the radiology place and picked up my results and the results said some dense area cyst at 3 o'clock and mlo asymmetry appears to high for 3 o'clock position of the left breast ultrasonic cyst. I assumed cyst always ment non cancerous I'm but I believe I might have been wrong cause now after the mammogram and after the ultra sound I have to go back a third time for a spot compression",
      "MessageIndex": 3,
      "PostDate": "03/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/795880",
      "Title": "Left in the dark and scared ab0792 lago"
    },
    {
      "AuthorID": "ab0792",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163735/profile",
      "Content": "Nov 3, 2012 11:39PM ab0792 wrote: Thank you I am going to look for a doctor who cares it so hard to be worried when I am a mother of 3 and I know so many woman have been here before but when I think of my kids it makes it so hard not to break down in tears",
      "MessageIndex": 4,
      "PostDate": "03/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/795880",
      "Title": "Left in the dark and scared ab0792 lago"
    },
    {
      "AuthorID": "ab0792",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/163735/profile",
      "Content": "ab0792 wrote: I feel so lost and confused! My mother was diagnosed at 38 with breast cancer. She is a survivor thank GOD . I went in because I'm 28 and I knew I need to start getting checked and I went in for a mammogram and two weeks later got a letter saying to go back for an ultra sound after days of trying to get hold of my primary doctor his assistant said this was normal and was up to me if I would care to even go back for an ultra sound. Since that sounded odd I called the radiology place back they said no I needed to go back and I took there advice and did and a week and a half passed and again no contact about the ultra sound. So I went and picked up the results which says I need to go in for a spot comparison and since I have no doctor who cares enough to do his job I have no clue what the rest mean it states I have a cyst at 3oclock but asymmetry is too high for 3 o'clock position. I have a lot of words on a paper than mean nothing to me.... At what time do I get a biopsy cause I'm really tired of this scary roller coaster!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "03/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/795880",
      "Title": "Left in the dark and scared ab0792 lago"
    }
  ]
}