{
  "AuthorID": "abbyglp",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
  "Posts": [
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 17, 2009 02:13PM abbyglp wrote: Luhann, sorry to hear of the progression, but it does seem as though you have an early jump on it. I am not sure if u can have the node bx, but sounds like hormonals could be failing you, your stats could of changed it happened to me last year, I have been off hormonals  for a year due to I went from er+ to er-, I am sure you will have a good talk with your doctor monday and will go over all the options. Hugs",
      "MessageIndex": 19,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737534",
      "Title": "Progression on scans - need advice LuAnnH mom2acat"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: I went in today to get my herceptin and blood work drawn for chemo next week, well my nurse could not stand it and came in the room while I was getting my herceptin and she said my blood work was great and that my platletts were 120 YAHOOO!!!! I was doing the happy dance in my chair I wanted to hoot out load, that made my day, you see I have not had that many platletts in about 6 months,and the rest of my blood work has been low. well I read a post from someone I can not remember who, to eat beets to get your platletts up, well I ate beets every day for the last 2 weeks, not sure if that was what really got them up or not but I am so happy, so I will be hoping that they are even higher next week and that will spin my oncs head a little more, cause he gave me the I am doomed look last time I had chemo. I just have to pray that my ca27-29 went down to. Just wanted to share good news, while it lasts. HUGS Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "12/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738853",
      "Title": "only you guys would understand abbyglp pitanga"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Feb 29, 2008 04:57PM abbyglp wrote: I  am so sorry, I have been lurking on this sight over the last week or so because I am waiting to get an MRI march 10th to confirm bone mets that showed up on my bone scan. I was scared and cried the first day that I was told and over the past week, I have been reading the posts here and I have gained strength from them. You need to gather every bit of strength you can and believe that you can get through this and you need to think positive that you are going to live. I refuse to  let this cancer no that I am scared and its gonna no before I am done that I am stronger than this beast.  hugs abby ",
      "MessageIndex": 3,
      "PostDate": "29/02/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/701345",
      "Title": "I never wanted to post here, but what do I do now?? AlaskaDeb heatherpalmerton"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 20, 2009 04:37PM abbyglp wrote: The safest place for me to sleep has been the recliner and that gets old. I love to sleep on my stomach, 2 more days. I can not wait.",
      "MessageIndex": 3,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732791",
      "Title": "Port ? just wondering abbyglp virginiamom"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Did anyones surgeon access thier port when they put it in and leave it in? I had my port put back in on friday and I do not have chemo until wed. and I have had to walk around with the needle still in there. I was wondering how safe is this, can it get infected being in there for 5 days? Yes it is sore as hell. I was told not to take a shower, only bird baths. But still this is so uncomfy. He felt that the nurses would have a hard time accessing it with only being in a week. Just scared of infection so early in getting it. hugs gale Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "20/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732791",
      "Title": "Port ? just wondering abbyglp virginiamom"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 1, 2009 06:18AM abbyglp wrote: Great News! so happy for you. I am also on taxetere and I hear it is the cancer killer. I am hoping it is doing the same for me. Go Celebrate!!!",
      "MessageIndex": 5,
      "PostDate": "01/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736755",
      "Title": "MRI says clean breast! vivo virginiamom"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Feb 26, 2009 05:35PM abbyglp wrote: I take 1/2 of oxycodone every 4 hours on days that I no I am going to be busy. I take a whole one when I just can not bare the pain any longer and rest. At first the whole oxycodone made me a little loopy, but after you take them for a while you do not notice it anymore you just feel the relief. I use to be stubborn about taking pain meds because of the way they made me feel, but my doctor sat me down and told me that there was no reason for me to suffer. We are not taking the pain meds to get a high, we are taking them because we need them and there was no excuse for me to suffer. She made sense and now I take them when ever I need it. They make our quality of life a little better. hugs abby",
      "MessageIndex": 9,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729777",
      "Title": "Anyone taking Aredia? RobynK Stormy1"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Feb 26, 2009 01:32PM abbyglp wrote: I went up north for 6 weeks for the holidays and did not want to miss getting my zometa, So I saw a onc up there and because he did not do infusions in his office I had to go to the hospital and because of the cost they only do aredia. Other than having to sit there for 2 hours I had no side effects other than I slept longer the next morning. I usualy wake up at 7am no matter how late I go to bed and that morning I slept till 9am it threw my whole day off. I have not slept that late since I was a teenager.Do take your calcium, good luck hugs abby",
      "MessageIndex": 7,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729777",
      "Title": "Anyone taking Aredia? RobynK Stormy1"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "May 14, 2009 11:00PM abbyglp wrote: I was dx with scoliosis as a child, I wore a brace from the time I was 9 until 18 when my bones fused, I say it is form all the x-rays I had during the time I was developing. I hear now that they do not expose children to as many x-rays. Stress OH yes I had alot of that cheating husband, lost mom and dad, divorce, homeless, wanted to kill myself, bad relationship with boyfiend. husband tried to take kids. I could go on and on, I remarried and I am stuck in a state with out my family and I still have stress because if it was not for the health insurance I would take the clothes on my back and go back up north with my family in a minute, I am so lonley here. hugs",
      "MessageIndex": 36,
      "PostDate": "14/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734061",
      "Title": "Has cancer pshycological roots? vivo bygracealone"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Saw onc today and he said my case was getting complicated, and that he was starting to worrry about me. I will try and keep this short and explain what has been happening, I know you all will have some aswers because I know I am not the only one to have this problem. You all are so knowledgeable and I trust you to help me direct my onc in the right direction. He is scaring me as far as trust in him is going. This can not be this difficult to figure out. Well here has been the plan of action he has had me on.... tx 1- was 65mg of taxetere and 50mg of carbo platletts dropped 120 , TM's went to 165 tx2- was 65mg taxetere and 50mg of carbo and platletts dropped more to 59, TM's dropped to 135 skipped chemo for 3 weeks platletts came up to 90 tx 3= 65mg taxetere and 50mg of carbo and zometa and herceptin platletts dropped to 59 tx4- He went ahead with chemo but lowered the doses to 35mg taxetere and 25mg of carbo, weekly herceptin. TM's went back up to 135, platletts came up to 60 tx5- He wanted to drop the taxetere and just do carbo I refused and asked him to keep me on the taxetere and herceptin, TM's went up 145, platlets up to 80 and still amemic (SP) tx6- today and he is confused as to how to handle this, if he increases the mg back up to 65 for the taxetere he is afraid of my platlets bottoming out, but yet the low dose of taxetere he is afraid is not doing anything. He wants to see my TM's going down. and the more he changes like adding or taking away things we are not a decrease in TM's. Why is he so bent on the TM's when some onc's do not do them at all. I told him there are other reasons for them to go up but he insists that they have been accurate in my dx. so he is reading them like a bible, He said we will just see what they are in 21 days and if they go up again we will do another bone scan and see what my platletts are doing. Does anyone have any advice for  me to share with him.  At this point I am not feeling like I will be on any chemo break for a long time. Need help please. HUGS Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738120",
      "Title": "Hate to ask but need a couple prayers abbyglp pitanga"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 29, 2009 04:38PM abbyglp wrote: Susan I go to Morehead at the raab center, this onc is new, He came here i think from virginia last august. I was told that we are affiliated with chapil hill. If I do not like the answers he comes up with in 3 weeks  can you give me the name of the onc in jacksonville, I will find out if he or she is on my insurance plan. How are you doing? Is everything going well with you? hugs  Cheryl. I have a sixteen yr old son so I plan on fighting a long time. We already dropped the carbo and lowered the doses, He is afraid of going ahead with the taxetere at a higher dose because we can not get my platletts up over 90. That is the delema, he is afraid of them dropping to low and he is afraid that the low dose of taxetere is not doing anything. So all that I can hope for is that he finds the answer to all this and we continue to on. hugs Thank you all for the for responding and prayers. I already feel better, I was quite a little mess this afternoon when I got home. You all are always there and it is a great feeling. Again thank you.",
      "MessageIndex": 8,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738120",
      "Title": "Hate to ask but need a couple prayers abbyglp pitanga"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 29, 2009 05:23PM abbyglp wrote: Yes I agree renee, I think he is going by what my markers have been stabalizing at over the last 3 years, they always stayed in the 50 to 60 range and never went over 100 until april. You do not sound ignorant  that is why I asked him today why he is reading them like a bible because of all the b9 reasons that can make them go up. If you are talking about the procrit they banned that because they found that that shot the shot that they gave me for the first round of chemo, was helping the cancer cells grow. The only thing he could do is give me blood and he said it would be useless becasue the chemo would kill off the platletts in that blood. vicious circle I guess. I have a lot of fight left in me, if this cancer thinks its going to win well its not. Yes i am working on the yale thing, I just wish I could get stable long enough to go up there. In case it takes time to get a plan together with a new doctor. Its scary to make a move like that under these circumstances. I dream every night of being up there. HUGS",
      "MessageIndex": 11,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738120",
      "Title": "Hate to ask but need a couple prayers abbyglp pitanga"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jun 15, 2009 05:50PM abbyglp wrote: I thought you could go on medicare and use them as a secondary to your primary ins? am I thinking wrong? would I have to go off my husbands insurance if I qualified for medicare? I was just recently asked by my husbands ins. if I had medicare as a supplement, and I had to tell them that I was on disability but was not on it long enough to qualify for it.",
      "MessageIndex": 5,
      "PostDate": "15/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735919",
      "Title": "First SSDI, now MEDICARE questions Analemma Sue-61"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 15, 2009 04:59PM abbyglp wrote: Oh my goodness that is a beautiful baby. You are so lucky, I can not wait to be a grandma.Congratulations.",
      "MessageIndex": 22,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737440",
      "Title": "Heather Palmerton's new grand daughter pictures Fitztwins virginiamom"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 18, 2009 01:29PM abbyglp wrote: I would want the scans. like Heidi said even if it is to just show them off. Hugs",
      "MessageIndex": 12,
      "PostDate": "18/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737591",
      "Title": "Need Some Opinions AusAla LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 22, 2009 06:06PM abbyglp wrote: Don't you have a doctor on call. I thought all clinics had on call docs? I would call and see if there is an answering service.I no this might seem scary for your daughter but I would consider wearing a mask if you had one, just until you get a hold of your onc, to see what kind of effects it has on your chemo, you have been through so much and you sure don't want to undo anything you have done. Hugs and prayers that it is only if you never had them. gale",
      "MessageIndex": 2,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732945",
      "Title": "Chicken Pox and Chemo mason204 mason204"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 4, 2009 05:37PM abbyglp wrote: I did the xeloda and tykerb combo, I started with the xeloda first for about 3 months before they added the tykerb. So my experience with the xeloda was easy. I had to stay away from fried greasy foods while I was on it. I found that I felt nauseated after eating them, I did experience hand foot tingling and some diarahea. The diarahea increased alot after they added the tykerb in. But overall the xeloda was easy for me compared to the combo I am on now, taxetere and we stopped the carbo. I see that you are not her2 + so you will not need the tykerb. I do not know what the side effects of ixempra are. They usually start you off with the highest dose of xeloda and lower it to the point of the least SE. I am sure the tiredness is from the morphine, Have you tried to control the pain with anything less like percocet? I did the taxol the first time and I remember how much pain it can cause, Once we stopped the taxol it took about a month for the pain to decrease and about 2 months before I felt alot better. Someone will come along that has had ixempra and xeloda together and give you their thoughts and experiences, I wish the xeloda lasted longer for me It was so easy and no hair loss. hugs",
      "MessageIndex": 1,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738409",
      "Title": "Lxempra / Xeloda MissyBraddy jeanne46"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: I love this new port. I had it put in on friday and the surgeon left it accessed until wed, when I had chemo. Well I wanted to beat him to a pulp for 6 days it was sore as hell, Last night after having it taken out. I slept so good. I asked my nurse if this is what he always does and she said no. I told her that he told me he left it in incase there was any swelling, she laughed and said well he knows better than that if it was swollen I would of just used a 2 inch needle instead of a 1 inch needle. I cringed and said I think I will hug and kiss him next week when I see him. 2 inches is just 1 inch to long for me. Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "23/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733008",
      "Title": "Now that the needle is out ..... abbyglp lovinmomma"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 11, 2009 06:12PM abbyglp wrote: I had the regular port, HATED IT!!,  I am sure I will have to go that road again and I will definitley go for the power port it is so small. I had infections and pain with the first one. abby",
      "MessageIndex": 19,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730512",
      "Title": "Need some input on ports...please... pee wallflower"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "May 27, 2008 06:03PM abbyglp wrote: Dragonfly, I just have to tell you I love the name. I sit on our dock  with a cane pole and fish and I love it when dragonflys land on my cane pole, I find it relaxing watching the dragonflys and fishing. I forget about cancer for the short time I am out there. I am sorry you have to join us, I myself have just been dx with bone mets to spine. My bone scan came back as abnormal and my onc changed my hormonal from arimidex to aromisin, I had to wait for 3 weeks to get an MRI to confirm, then waited 3 weeks to be sent to rads onc. who then told me he was not convinced that it was bone mets, so then 2 weeks later they sent me for a biopsy, I waited a week for the results, the whole time I waited I prayed all was going to come back as negative but it didn't. The biopsy confirmed it was positive for spine mets. They told me I had to wait 2 weeks to go back to the rad onc to start radiation to my spine. So you no what i did, I bought a plane ticket home and spent the best 2 weeks of my life with my family and did not think about cancer. I came back and had my tumor markers drawn and they dropped 15 points. I just finished my 15th rads to my spine and I have had an infusion of zometa to strengthen my bones, I also have been taking 2 vitamin D3's a day with a calcium pill. I read all the posts from these wonderful caring women on this board and the more you come here the more strength you will draw from them. I have learned so much from reading there posts. Once you get a plan of tx in place you will start feeling better. Hugs abby",
      "MessageIndex": 7,
      "PostDate": "27/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706256",
      "Title": "FRom A 11 to Iv in 30 seconds Dragonfly-4 Gitane"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 14, 2009 01:41PM abbyglp wrote: GRRRRRREAT NEWS!!!!!!!! So glad to read good news this week!!!Great Job Janis keep on doing what your doing....BIG HUGS",
      "MessageIndex": 26,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737391",
      "Title": "STABLE!! Fitztwins MJLToday"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 15, 2009 04:54PM abbyglp wrote: I am sorry u have to come here to find info but it is the best place for answers. There are some very knowledgable women here and they will point you in the right direction. but like renee said more status is needed. hugs to you and your sister.",
      "MessageIndex": 3,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737461",
      "Title": "my sister has breast cancer justwanttoknow abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 3, 2009 02:58PM abbyglp wrote: Sorry for your dx. You are so young . I was dx a year ago last month with stage IV bone mets. I am doing well so far, exloda is working. Stick with us and you will learn so much from these ladys. They give me and everyone so much hope every day. I to would demand a Bx. When my bone mets were found I got the run around from radilogist reading bone scan and then saying not sure lets do a MRI, and still not sure. So after 3 months of unsureness, they finaly did a Bx, and it was finaly confirmed. But it showed much more than just a pictureI, they found out that I went from ER+ to ER- and that changed my whole TX plan. Hugs abby",
      "MessageIndex": 22,
      "PostDate": "03/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730041",
      "Title": "New here virginiamom Mazy1959"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jun 29, 2009 05:48PM abbyglp wrote: Sometimes it is to hard to think about what I want, I always worry to much about the other person (husband). I have spent about 19 years living away from my family and I crave being with them so much since I have been dx. I could go live with my sister, she lost her husband to cancer 1 1/2 yrs. ago. I could really enjoy a family picnic or just having sunday dinner with them. But I am here hundreds of miles away and very unhappy. My husband is good to me but very posessive. He will buy me things that I need but has never gone above and beyond anything like that. we do not sleep in the same room, we go nowhere he hates crowds. He has no freinds that come over he has no family gatherings, He does not feel that my freinds are good enough to talk to. I am lonely all the time and I keep asking myself if this is how I want to spend the rest of my life. Inside I know it is not, but I am afraid to change because of all the medical reasons. I am afraid of losing his insurance and afraid of new doctors. I talked to my doctor about how unhappy I was and she feels I should go, and live while I can. But she understands about losing my insurance and how important it is not to miss any tx right now and getting everything together with another doctor even before I left. I really think my husband knows how I feel and he is not saying anything. I can tell he is tired of cancer. Well so am I.",
      "MessageIndex": 14,
      "PostDate": "29/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736677",
      "Title": "should we be treated different because you are stage IV? Fitztwins Fitztwins"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 24, 2009 10:22PM abbyglp wrote: I was DX with mets to spine in FEB 08, I was on an AI and the onc just said this AI is not working anymore so switched me to another one, It was not until JUNE 08 that my onc decided to check the receptor status of my BX that was done in march of 08. I was taken off the AI's because I went from ER+ TO ER-. Needles to say I do not see that onc anymore.",
      "MessageIndex": 3,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731306",
      "Title": "Biopsy / Standard of Care? Reneepals LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: I have been not doing to well these past couple of months but my problems were petty compared to what was happening onthe boards with others. I am now at my witts end and do not no what to do. 4 months ago after having herceptin, zometa and taxtere and carbo all in one sitting. The next day I had such hip pain I could hardly walk. Oncs said well we can go for rads but our rads machine is torn apart right now. Any way with my hip hurting so bad I walked with limp and I could feel it take a toll on my ankle. Well lo and behold my ankle swelled up and became very pain full, I went to my GP and he said it was gout he put me on prednisone, It helped for about a week and the pain was back. I wrapped it and it continued to swell, so my onc gave me gout meds to take and they did nothing for it. So he sent me to an orthopedic doc and he did xrays and said he found no fracture so lets do an MRI. Well My tibia lit up on the MRI and he said that cancer was rarley found below the knee. Lets treat it like a stress fracture and now I wear a power ranger boot. It is still swollen. The thing is I had a bone scan a month ago and they said there was healing and my CT was clean. But my TM's are rising. I have been complaining that my ear and bottom jaw ached and my jaw and lower lip are tingling and numb, So he put me on 3 different antibiotics to try and clear that up and it is not working. I have such hip and leg pain I can hardly walk. I have no answers about what is going on. I have just been on herceptin and taxatere these last 2 tx. I just went this week because I was neutropenic no WBC. So he was afraid I would get another infection on top of what ever else I have going on. I know that infections can cause TM's to rise, but I found a lump under my arm and I was thinking that it was a lymph node, well my onc felt it and said it is definetley cancer. WTF, I have been on chemo for the last 6 months and I am getting worse and not better. non of this is making sence to me. I have an infection in my ear and jaw that we can not clear up and I have pain and swelling in my hip and ankle that they can not figure out what it is, and now a have a swollen lymph node full of cancer. I have to go wed for my next tx, and I am sure my TM's will have risen more. What do I do, ask him to change my tx or tell him just give me a break and see if I start feeling better. I am getting so depressed that I have only been able to work a day or two a week, and I can not get out of the chair once I am home. I am tired of being a couch potato. I try to push myself and all I do is cause more swelling in my ankle and pain in my leg. I am afraid I really do have the rare cancer that is in my tibia. But why would it not bother me until after I started chemo, why was it not this bad before chemo. I am so depressed... and I am losing faith in doctors. I want to just cry. I need any help I can get. please. Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741546",
      "Title": "3 doctors and still no dx for me abbyglp chainsawz"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Oct 6, 2009 05:03PM abbyglp wrote: Thank you all. I did go to the dentist, so I guess I should of said 4 docs and no dx. He took an xray to see if I had an absess and look at the bone all he found was a small filling that he filled that day. My onc is taking on to many pts for one person, I was thinking about the zometa being the cause, because it is coming and going. I am taking a oxycodone every 6 hours. I am really worried about the lump. How can I have healing on my bone scan and a clean CT scan and have a lump at the same time. I go for my tx tomorrow and I guess we will see what my TM's are doing now. Unfortunatley he drew my markers before I finished the antibiotic so if it is the infection causing them to rise it will not show tomorrow. I am also wondering if the infection was in my port. I continue to walk around in my boot, hoping that my ankle will heal. thank you all for your input. I will look into a 2nd opinion. I will keep you all updated.",
      "MessageIndex": 8,
      "PostDate": "06/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741546",
      "Title": "3 doctors and still no dx for me abbyglp chainsawz"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Oct 8, 2009 03:19PM abbyglp wrote: Well I saw the onc yesterday and we decided to put off tx for one week, I told him I felt like I was still recovering from the infection that I had and needed a week to feel a little better. Now he wants to add cytoxin to the taxetere, I am afraid he is guessing at this. Has anyone had this combo? and did it work? He did not mention my lump that I found. I am thinking about calling my surgeon and asking for his opinion about it being better left in or take it out. I have had the bone scans go down to my feet, My ankle lit up on the last one but that is when we thought it was gout, and the tech said it lit up because at the time it was very swollen, she said it was from the inflamation. I am really getting depressed he says that my TM.s are still going up. Should I let him add the cytoxin in to the mix, even though we have only done two full dose taxetere, or would any of you go for one more tax and see if the TM's go down after that? I hear that sometimes it takes 3 tx before the TM's respond. Thank you all for all your help. gale",
      "MessageIndex": 16,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741546",
      "Title": "3 doctors and still no dx for me abbyglp chainsawz"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Oct 8, 2009 03:42PM abbyglp wrote: Elizebeth thank you, I was just searching to for the combo. I did not think it was a normal combo but I guess it is used more than I thought. I really want to call my surgeon, but as you know a sugeons job is to cut things out so I am thinking I all ready no his answer. LOL. Hugs",
      "MessageIndex": 18,
      "PostDate": "08/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741546",
      "Title": "3 doctors and still no dx for me abbyglp chainsawz"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "May 19, 2009 03:13PM abbyglp wrote: Congratulations and hope all keeps improving, Please post good news. That is the first things I look for when I get on. It gives us hope, that we all can post a positive every now and then. hugs",
      "MessageIndex": 5,
      "PostDate": "19/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734458",
      "Title": "Do you ever feel guilty?? RobynK konakat"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jun 17, 2008 12:29PM abbyglp wrote: nancy, I had a sore area on my jaw bone and went to the dentists and i needed a root canal done on a molar. I had no other symptoms of a bad  tooth, until he took an x-ray.So yes I would start with the dentist first. hugs abby",
      "MessageIndex": 7,
      "PostDate": "17/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/707440",
      "Title": "Any one with bone mets that only hurt upon touch? NancyM Malinda"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 28, 2009 11:25AM abbyglp wrote: I had a bad one after my first taxetere. NOT FUN, I am so sorry you have one. I feel they get worse before getting better after starting the antibiotic. Or at least it did for me. Do you have a  walk in clinic near you? You need to get something today. hugs gale",
      "MessageIndex": 19,
      "PostDate": "28/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733216",
      "Title": "UTI? KellyC lillysmom"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Where any of you woking limited hours when you applied for disability? Or did you all not apply until you stopped working. Being stage 4 with bone mets qualifys me but I have not worked full time in 2 years, just reduced hours. I just do not know how to answer those questions, they ask you the date you were disabled and I do not no what to put. The social worker told me I was eligable. I have hard time standing for 6 hours at work with mets to spine and hips. But I can not afford to just quit and hope social security does not deny me or takes 6 months to pay me. So confused? I also have scoliosis so with that combined with the spine mets I have been struggling to keep this up. I am not on chemo yet hope the AI's keep working but I am doing rads right now and I wil be starting tykerb. any info would be appreciated. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705628",
      "Title": "social security abbyglp saluki"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "May 16, 2008 02:01AM abbyglp wrote: Yes I am stage 4, I am married, is ssdi if you are not married?",
      "MessageIndex": 2,
      "PostDate": "16/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705628",
      "Title": "social security abbyglp saluki"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 6, 2008 07:42PM abbyglp wrote: Janis, So glad you are doing well and that you have started your plan of action. Me on the other hand WANTS TO SCREAM!!, I got UTI from pelvic rads, diareha from tykerb and rads x 8days, fever, went to er for 2 bags of fluid. Went to onc yesterday and she held my zometa, told me stop tykerb for 2 weeks, put me on cipro for 3 days and thats all, and she wants me to have my TM's drawn next week, and see her the week after to see how everything is, then we will talk about chemo and what ever else, and I guess I will get zometa then. I know my TM's are going to go off the wall from stopping everything again. I only ended up getting 7 out of 10 rads, they said they were to hard on me.I do agree with that.But here I go again in limbo land. hugs abby",
      "MessageIndex": 4,
      "PostDate": "06/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/719171",
      "Title": "Good luck with your Zometa today Janis LuAnnH SandyAust"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 1, 2009 05:05PM abbyglp wrote: Janis, Thanks for the great info.Yipee!! Now I do not have to blame myself for being stage IV, cause I never could give up my reese cups, or pepperming pattys. I love sugar and even cancer was not going to keep me from it. thanks abby",
      "MessageIndex": 9,
      "PostDate": "01/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729968",
      "Title": "myths about cancer Fitztwins DaughterMom"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 22, 2009 04:11PM abbyglp wrote: I just love your attitude you are strong and a fighter. great news congrats!!!!!!!!! now celebrate! hugs gale",
      "MessageIndex": 17,
      "PostDate": "22/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732916",
      "Title": "Guess what?? I really do have a brain. heatherpalmerton whoopsiedoodles"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Hi, I have been going back and forth with these spine mets tx. Need to no your input. Original dx was triple positive. Did chemo, taxol, rads, herceptin for 1yr. and arimidex. Finished herceptin Oct.31, went back for 1st 3month followup feb. I complained to my onc that the arimidex was giving me severe joint pain, my tumor markers were at high end normal. She said to stop the arimidex for a month. OK, felt so much better, but tumor markers went up to 70. So she sent me for scans, since it had been a year. CT came back normal, Bone was suspicious for mets. Put me on aromasin, sent me to rad doc. He said I needed an MRI, had that done. He said not sure still, need a biopsy, So I went for a biopsy in march, it came back positive. Had tumor markers checked and Tumor markers dropped to 50, before I even had rads done. Had 15 rads and onc put me on tykerb, I finished rads June 3rd took 4 days worth of tykerb and had bad side effects and he said to stop them. Had zpmeta and tumor markers checked and they went back up to 80 to day, He said he sent my biopsy back out and it came back ER- now and to stop the aromasin. and go back on tykerb. Do you think he checked my tumor markers to early after rads and taking the tykerb for 4 days and stopping it. Do you think it caused a tumor flare? Why would my tumor markers drop 20 points after switching to aromasin only, and then have my tumor markers jump back up after rads and 4 days of tykerb? I am afraid to stop the aromasin and how do they check a specimen after 3 months. I am so confused, and scared that my onc does not no what he is doing at this point. He is leaving next month, I will be getting a new doc. That could be a good thing or a bad not sure at this point . Thanks abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "25/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708026",
      "Title": "went to onc for answers and came back more confused abbyglp LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jun 26, 2008 01:01AM abbyglp wrote: Jeanne, that is what I am worried about, that the specimen might not of been any good, cause my tumor markers dropped before rads and after I started the aromasin.They went back up after I finished rads. I feel like I left my best friend behind tonight cause I only took the tykerb and not the estrogen blocker. I have been taking one of those little white pills for so long, I felt that it was my life saver.I am worried and the only thing my husband can say is it will be alright, do what the doctor tells you. ugh!! thankyou jeanne and stephanie for responding. hugs abby",
      "MessageIndex": 3,
      "PostDate": "26/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708026",
      "Title": "went to onc for answers and came back more confused abbyglp LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 30, 2009 04:54PM abbyglp wrote: Great News, hope you find a new chemo with less SE's so that you can continue to dance with ned, hugs",
      "MessageIndex": 3,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738142",
      "Title": "A/A combo definitely works Marybe kenzie57"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 15, 2008 04:28PM abbyglp wrote: Stephanie, I am so sorry to hear of your dx. If it helps any I met a woman a couple of weeks ago in the waiting room and the oncs office and she was dx with brain mets 2years ago, I would not have even guessed, she was telling me about how people do not recognize her anymore because she looks so much better then she did a year ago and her hair is curly on the side that she received rads to that she has to get up in the morning and curl the other side to match. I will keep you in my prayers and thoughts, and pray that you get the relief that you need from the pain. hugs abby",
      "MessageIndex": 22,
      "PostDate": "15/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704020",
      "Title": "Dx with Brain Mets Today TripleNeg snowyday"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jun 27, 2008 10:29PM abbyglp wrote: LuAnnh and Diane, I went on line to ask an onc. and he agreed that it would not be a bad thing to continue my aromasin. He said it would not do any harm. So I have not stopped it. I will be getting a new onc. next month. He was transfered to another town and I think I understand why now. I hope the new one is better. As far as the herceptin, I think he put me on tykerb because I had to take blood pressure meds to keep from getting heart palpatations and my ejection fractoin dropped so I had to skip a couple of weeks from it. He also said tykerb was better because it protects from brain mets. He still wanted me to take 5 a day of tykerb but I am only able to handle 3 right now. It upsets my tummy and gives me cramps. I guess I have taken my own life in my own hands, We no our bodies better than any doctor. I just hope I am right.  I told my onc that I did not want my TM's drawn that day, I told him I have only been off of rads for a week. and I took those 5 tykerbs for 4 of those days before he told me to stop them, but he drew them anyway. He wants me to have them taken again in 3weeks, that would make it  about 6 weeks from rads. Do you think that would be long enough. The funny thing is  I still have on and off discomfort in the area that they did the rads. I read on here that ladies with mets to bones have relief from pain and it pretty much feels the same. When I finished taxol a year ago I felt so much pain in my bones, I fell and actually felt something pop in that exact area, and everyone told me you must of pulled a muscle, I told them it did not feel like a muscle, I am wondering if it has been a disc all this time.. My MRI came back as not sure what that is, that is why I had a bx done in feb. They said it could be a synovial cyst.that popped and I still feel like that is what all this is. not a doc so  just no my body. but have done everything else that they told me to do. What blood test is elevated when you have bone mets? is it checked with a CBC? I keep getting told I have great blood work when it is drawn exept for the TM's. Thank you  HUGS ABBY",
      "MessageIndex": 6,
      "PostDate": "27/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708026",
      "Title": "went to onc for answers and came back more confused abbyglp LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Sep 12, 2009 11:19AM abbyglp wrote: I am so sad to read this news. She and your family are in my thoughts.Hugs and prayers heading your way.",
      "MessageIndex": 325,
      "PostDate": "12/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 27, 2009 09:09AM abbyglp wrote: Susan, Big hugs and prayers for you tomorrow. abby",
      "MessageIndex": 22,
      "PostDate": "27/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739500",
      "Title": "Big day tomorrow : ( SunshineSmiles faithandfifty"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 29, 2009 09:22AM abbyglp wrote: Susan, Just thinking of you and hope you are resting, but we all hope to hear from you soon. Bigs Hugs and praying for you. abby",
      "MessageIndex": 27,
      "PostDate": "29/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739500",
      "Title": "Big day tomorrow : ( SunshineSmiles faithandfifty"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 1, 2008 06:30PM abbyglp wrote: Katie. Iam sorry you are going through this, I had my TM's climb slightly for about 6 months and I was also sent for scans in Feb. they found suspicious spots on my spine. I went for biopsy and it came back positiive. I was on arimidex they switched me to aromasin and just a couple of weeks ago they re checked my biopsy for ER status because my TM's continued to climb and found out that the aromasin was not going to work because I am now ER-. So PLEASE be sure you ask the onc to make sure that they take a large enough specimen to make sure you are still ER+. I have been floating along the last 6 months on something that was not doing anything at all. I go again at the end of the month for TM's and a NEW onc. I am now taking tykerb and zometa.I am still taking the aromasin until I talk to new onc. I was told when I went for rads. that the spots do not  show up un reg x-ray. funny how we all get different opinions with diff docs. hugs abby",
      "MessageIndex": 4,
      "PostDate": "01/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/708355",
      "Title": "CT, bone scan, xrays and progression... katie11 Tracy1964"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 12, 2009 06:32PM abbyglp wrote: My platletts have been running low I mean low and I have bruises everywhere. I also go scratched and it still has not healed, bug bites still there I think it can be platletts.",
      "MessageIndex": 10,
      "PostDate": "12/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735279",
      "Title": "Bruising CathleenP Kate2z80"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 9, 2009 01:11AM abbyglp wrote: I was on herceptin for a year and as soon as I finished I had mets to bone, so they put me on tykerb and took me off, when I started this chemo. I was very concerned about it and my onc just said not to take anymore until he tells me to. no actual reason wich bothered me. abby",
      "MessageIndex": 7,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732113",
      "Title": "tax and carbo kicked my but! abbyglp faithmena4"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 14, 2009 03:49PM abbyglp wrote: Are you sure it is not 1500 in am and 1500 in pm and a total of 3000mg a day? I would so check that I was on this last year and I kept up with the threads about it and never heard of anyone on 6000mg a day. I would talk to the pharmacist about it. Did you get them through the mail? they have a pharmacist that you can talk to on the phone. HUGS",
      "MessageIndex": 2,
      "PostDate": "14/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737393",
      "Title": "xeloda dosage cancerkicker bourscheid"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jun 13, 2009 06:04AM abbyglp wrote: Fantastic news, I agree with fitz we all want to be like you.",
      "MessageIndex": 6,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/735777",
      "Title": "5 Years Remission of Stage 4!!! Denny123 dreamwriter"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 17, 2009 05:15PM abbyglp wrote: Just turned 46, had progression to bone at 48",
      "MessageIndex": 273,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: I just got back from the oncs office it is confirmed that it is in my spine. Has anyone been on tykerb? for how long? and what are the side effects? I also will be having radiation. This stinks. I bought my plane ticket home this afternoon, I want to go home and see my family before I start all this. I am so depressed, I so wanted all this to be a mistake. I guess all those weeks on herceptin failed. So I hope this tykerb will do the job. Any info would be appreciated. I will not get back until may 2nd from up north so I will not be starting it until may 9th or so. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "16/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704099",
      "Title": "spine mets and tykerb abbyglp LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 8, 2009 08:02AM abbyglp wrote: Since I have had stage 4 dx, I just have to let people know when they have upset me, for some reason I can not bring it home anymore. Good luck and Hugs",
      "MessageIndex": 2,
      "PostDate": "08/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738566",
      "Title": "Disappointment in Coworkers - how to move past this rkt rkt"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 16, 2009 09:25AM abbyglp wrote: Denise, Hope you are doing better and will be back on the boards soon, sending healing prayers and hugs.",
      "MessageIndex": 15,
      "PostDate": "16/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737413",
      "Title": "We have another sister in the hospital kenzie57 heatherpalmerton"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 17, 2009 08:21PM abbyglp wrote: I had infected port, It was not red or swollen I did have a fever and felt crappy. they did a bunch of blood cultures from the port to find it. I was put on super antibiotics for 10 days.",
      "MessageIndex": 2,
      "PostDate": "17/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737588",
      "Title": "Infected Port Heidi_Ho konakat"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: HI, I was dx with bone mets to spine a coulple of weeks ago, I have to see the rads doc tomorrow, and I am scared. My onc changed my meds from arimidex to aromasin and she said I would see her when I finished the rads to spine. I have scoliosis and I have lived all my life with muscle pain, but not enough to take more than a tylenol once in a while. I have no bone pain with the mets to spine now, but will I have it after the rads? I like working and being active and I am afraid that this will change my quality of life. For any ladies that have gone through this are there any good questions I should ask the rad onc tomorrow. I am scared of him after he made me feel like a french fry a year ago. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703223",
      "Title": "bone mets no pain? abbyglp LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Hi, I had my 1st rad to spine today, it went well. I have been on aromisin for 2months, I have been getting short small sharp pains in the left side of my head for a couple of weeks. I do not see my onc again until next week. I am actually afraid to tell him. Has anyone experienced this when changing AI's? My bone scan and ct where clean in feb. exept for the spots on my spine that they are treating now with rads and aromisin and I will be getting my first dose of zometa next week. I had my blood work drawn today and I will get the results of my ca 27-29 next wed also. I am just hoping somebody tells me that the AI's could cause this symptom. I really do not want anymore bad news any time soon. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "06/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705142",
      "Title": "short pains on left side of head? abbyglp LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 28, 2009 12:27PM abbyglp wrote: I would hope that the god that I believe in would not wish this on me or any of these wonderful woman on here.",
      "MessageIndex": 15,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731491",
      "Title": "Lumpectomy+rads and Mastectomy: same outcome? havehope SunshineSmiles"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 30, 2009 09:12AM abbyglp wrote: Yes I have had them, they have been anywhere from low grade to 102, when on chemo. I have been on taxetere and carbo and recently went in for my weekly herceptin and nurse took my temp and it was 100.4 and I was feeling fine, I was not ill. So she thought it could be a tumor flare fever. let us no what you google. hugs",
      "MessageIndex": 1,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738127",
      "Title": "tumor fevers? roachrp roachrp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 25, 2009 10:11AM abbyglp wrote: Heidi, so glad to hear from you. I know the best medicine you got was to be with the kids. We are all thinking of you and sending best healing wishes possible. Big hugs abby",
      "MessageIndex": 177,
      "PostDate": "25/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 15, 2009 07:42AM abbyglp wrote: Heidi, So glad to see your post, I would of vomitted to and more. You are such a strong women and you will get through this, with all of us behind you praying and sending good vibes you have to. Plus you have those beautiful childrens faces looking at you to keep you going. I pray that the SE are easy on you and that the time goes by fast for a speedy recovery. BIG HUGS abby",
      "MessageIndex": 90,
      "PostDate": "15/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: I ended up in the ER sunday. Ended up with severe dehydration and UTI of all things, fever, all over pain I could go on and on. I have no taste buds can not eat, I have fever blisters on my lips so bad that everytime I open my mouth they crack oopen, I do not remember AC this bad for so long, It wil be a week tomorrow and I still can not do anything or eat, I have been drinking ensure and gatorade,I hope he lowers the dose, Do you think they do that? I went for echo today and I have been having heart palpatations. really I am usually good about just sucking it up and getting over it but this I really have to whine about, this stuff is hard.. I hate it , it could definetley alter how much I do of this and think about enjoying the time I have with my kids and take one day at a time with out chemo. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "08/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732113",
      "Title": "tax and carbo kicked my but! abbyglp faithmena4"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 9, 2009 12:58AM abbyglp wrote: Well today is a week, I am feeling a little better today, that is after drinking about 3 gallons of water and gatorade over the last couple of days. I am going to get dressed today and actually try and get out side and sit on the porch and try to enjoy the fresh air of course with my bottle of gatorade. Faithmena 4 I can not believe that you have endured 8 cycles of this, You give me hope. Fitz how many tx did you do of taxetere? I guess I am dreaming but I thought 4 would be a good number to try and get a chemo break, but maybe I am being unrealistic. I just have to keep my body healthy to get through the rest of these. I need to start eating today. It just sucks when everything tastes so bad. Did any of you find any good meals that over came the metal taste? that I might try. hugs abby",
      "MessageIndex": 5,
      "PostDate": "09/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732113",
      "Title": "tax and carbo kicked my but! abbyglp faithmena4"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 11, 2009 09:14PM abbyglp wrote: I am so sorry, I remember talking to you on the stage III board. We are here for you. abby",
      "MessageIndex": 24,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730557",
      "Title": "New stage 4 here"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 2, 2009 05:12PM abbyglp wrote: I have been on zometa for about 7 months I get bone pain from the zometa for about a week after I get it and then it starts to subside until the next month. The D3 and calcium help also. and it would probably help if you did not wrestle intruders in your sleep. LOL hope you are feeling less pain soon. hugs abby",
      "MessageIndex": 1,
      "PostDate": "02/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731821",
      "Title": "1st Zometa today Analemma AusAla"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Oct 29, 2009 05:35PM abbyglp wrote: I am so sorry to hear of another sister gone, but I am glad that she is out of pain. prayers go out to her and her family, god is able rest in peace. hugs gale",
      "MessageIndex": 60,
      "PostDate": "29/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742956",
      "Title": "Stephanie is an Angel 2timer Britt"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 2, 2008 03:38PM abbyglp wrote: After writing that post, I said to myself this is crazy. So I just called and talked to one of the nurses who is great and she is going to talk to onc, so I am awaiting for the call back as of now. thanks abby",
      "MessageIndex": 2,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703271",
      "Title": "Now I am confused? abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Oct 26, 2009 05:03PM abbyglp wrote: never had a flu shot. I broke out in hives once from handling a raw egg and all docs said that was enough for me to never get one. I am being very diligent about washing my hands if I go out, wich is not much these days. I am upset that my husband will not go and get one and he is not a great hand washer, so I have to be carefull touching things even around my house. If I could get it I think I would get it. Renee I am so sorry your son is ill with it, I hope he is better soon. hugs",
      "MessageIndex": 44,
      "PostDate": "26/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742599",
      "Title": "H1N1 Poll--ALL STAGES WELCOME! badboob67 wildgardener"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: I wrote and told you all a couple of weeks ago that I had a abnormal bone scan and they sent me for a follow up with an mri. My onc. said looked at the reports and said I have breast cancer in my spine, she changed my meds from arimidex to aromasin and made me an appointment with the rad onc and said I will see you when you finish rads. Well I went to the rad onc. today and he asked me if I had any pain in my back, I said not in those spots, I have always had lower back pain from the scoliosis. He read the reports and said yes there is something there but he read them as saying it could be metestatic disease OR one of the synovial cysts could have leaked fluid.I have multiple buldging discs on one side and multiple synovial cysts and arthritis due to the degree of my scoliosis. COULD THIS BE B9, my onc already declared me stage 4, and has me set up to start zometa at the end of the month. I have been stressed out since february and I now have a doctor telling me It might not be cancer in my spine. He said he was going to call her and talk to her, How long would you give her to call. what else could they do to me to figure out if this is metastisis? I am afraid to be happy, cause one of them is going to burst my bubble if I walk around and do the happy dance. abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703271",
      "Title": "Now I am confused? abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 3, 2008 06:46PM abbyglp wrote: Well I went to the office to pick up the paper work and I was set back a little that the secretary gave me the instructions for the multiple myeloma test, and the ct guided biopsy. I know that my onc is always busy but you would of thought that one of the nurses would have given me the instructions for all of this. I have to work sunday and I have to take a red bottle with me to pee in all day, I then have to take it to the hospital on monday morning and give them the bottle and have blood taken. I can not eat or drink anything after midnight and I have the biopsy on tues morning. Maybe it is just me but I have always had one of the nurses talk to me about stuff like that before. I wonder if they are afraid I am going to stay something if all this comes out all clear. I will be glad to get all this over with. They are doing another ca27-29 monday along with the other blood work, I know that that takes a week to come back, but I was not given an another appointment to go back and get the results, my next appointment is not until the last week of april. How long did it take to get the results of your biopsy? hugs abby",
      "MessageIndex": 13,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703271",
      "Title": "Now I am confused? abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 6, 2008 05:11PM abbyglp wrote: I go tomorrow morning for the biopsy, WISH ME LUCK GIRLS!, I want to prove the bone scan and the MRI WRONG, I am nervous yet ready to get this over with once and for all, It has been the worse two months in my life (exept being dx with bc). I want my doc to eat those mets words about now. Everyone keep there finger and toes and what ever else you can cross for me tomorrow. You all have been wonderful inspiring and thoughtful, I could not have made it this far with out you. I hope I will be coming on here in a few days with some great news. hugs abby",
      "MessageIndex": 17,
      "PostDate": "06/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703271",
      "Title": "Now I am confused? abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 13, 2009 08:04PM abbyglp wrote: Nicki, I hope you come here for support all the ladies here are wonderful and they are all willing to hellp a sister through what ever she is going through, it is a hard blow to hear those words that we all have dredded to hear, stage IV. It is as hard as hearing that you have cancer. I was looking forward to helping you through this I followed your posts and talked to you on the stage 3 thread, and I am currently on the xeloda and zometa and tykerb that you mentioned would be your TX plan. I have been on xeloda for the last 7 months now and I have not lost any hair, It seems that they start you off with the highest dose of this and decrease it until you get the least amount of SE. The worse SE is diarehea, and neuropathy in your feet. Well I hope you join us here when you need us, hugs abby",
      "MessageIndex": 56,
      "PostDate": "13/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730557",
      "Title": "New stage 4 here"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 1, 2008 01:52PM abbyglp wrote: Oh, good I was afraid I would loose sleep over this tonight. I have been so ready for a short vacation to see my family and all this has been such a waiting game of scans and mri's and the waiting for results that I have been afraid of buying my plane tickets. I so need a real big hug from all my faimily right now. I live so far from all of them and all this makes you want them more. So I will keep my fingers crossed that my rad onc will do the same. hugs abby",
      "MessageIndex": 2,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703223",
      "Title": "bone mets no pain? abbyglp LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Feb 19, 2009 04:46PM abbyglp wrote: LuAnn, Working brain is GOOD, wish mine worked. I will pray for you that the rads will kick all those cancer cells and stomp them out for good. Nice to know that the TM's worked and you caught it early. My TM's go up and down but stay in the same range so my onc is sure that if I have another recurance that it will show with the TM;s, Get lots of rest, I have had 3 different doses of rads to different areas and they can wipe you out. But they worked, so good luck. hugs abby",
      "MessageIndex": 1,
      "PostDate": "19/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729384",
      "Title": "Got Excellent News Today!!!! LuAnnH Calico"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 13, 2009 02:01AM abbyglp wrote: I agree you need to get on the zometa or aredia train with bone mets and take your calcium. I am sorry for your progression but once you get them zapped and under control you will be able to walk again. I had them in hip and thigh and I know what you are saying about the pain to walk.hugs",
      "MessageIndex": 4,
      "PostDate": "13/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738838",
      "Title": "Now bone mets, need encouragement wayover20 kbugmom"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 28, 2009 12:35PM abbyglp wrote: Yes good night to this, unless we devert the subject to earthshoes and candies again.LOL",
      "MessageIndex": 17,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731491",
      "Title": "Lumpectomy+rads and Mastectomy: same outcome? havehope SunshineSmiles"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 28, 2009 12:45PM abbyglp wrote: mmmmm my favorite, thanks",
      "MessageIndex": 19,
      "PostDate": "28/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731491",
      "Title": "Lumpectomy+rads and Mastectomy: same outcome? havehope SunshineSmiles"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Oct 27, 2009 06:19PM abbyglp wrote: When I was on xeloda I felt the same way and my onc tested my B12 level and found it to be low very low. So I was getting B12 shots while on xeloda, When xeloda failed me and I stopped taking it, my B12 levels went back to normal actually elevated. It is not normal for your onc to check your b12 level in normal blood work so you would have to ask. Hugs abby",
      "MessageIndex": 4,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742857",
      "Title": "Chemo exhaustion: any ideas? Lesley1 Lesley1"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 2, 2008 05:36PM abbyglp wrote: Onc called, pretty much avoided that she jumped the gun and we need to still identify these spots. she said that she talked to the rad onc who talked to the rads that read my mri, and they told him they are not able to confirm it is mets. They want me to do a blood test and a urine test to rule out multiple myeloma (looked it up this is fatal it is cancer in plasma, it scared me so I closed the page) then do a ct guided byopsy of one of the spots. I pick up the paper work tomorrow to find out when I do all this. anyone have a byopsy of spine ? I am sure it is painful, but how painful? another waiting game..ugh hugs abby",
      "MessageIndex": 4,
      "PostDate": "02/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703271",
      "Title": "Now I am confused? abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Feb 26, 2009 08:12PM abbyglp wrote: I was 46 original Dx was stage III, Dx stage IV at age 47. mets to spine.",
      "MessageIndex": 132,
      "PostDate": "26/02/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/729146",
      "Title": "Poll - How old were you when dx with BC Times3 Minetta57"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 10, 2009 09:55PM abbyglp wrote: Praying that your scans are as much good news as your TM's. So much to be excited about. Enjoy it. and think positive ITS GONE. hugs abby",
      "MessageIndex": 2,
      "PostDate": "10/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730498",
      "Title": "Good New about TM today Times3 LisaSDCA"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jun 23, 2009 07:30PM abbyglp wrote: It does not seem that long ago that I saw her on the boards. I remember her avatar. She will be missed.",
      "MessageIndex": 5,
      "PostDate": "23/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/736308",
      "Title": "Lilac Reneepals AnnNYC"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 27, 2009 01:00AM abbyglp wrote:",
      "MessageIndex": 36,
      "PostDate": "27/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731371",
      "Title": "I'm looking at brain mets, also... SunshineSmiles denise1962"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 4, 2009 08:34PM abbyglp wrote: Renee, It sounds more like you might have nerve damage or disc damage in your back, since it comes and goes and radiates to the front. Heidi, I will have to find the book, and yes I agree I am just getting old and falling apart. I walk like an old lady.LOL",
      "MessageIndex": 3,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738416",
      "Title": "Pulled muscles anyone? abbyglp neogirl"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 28, 2008 10:06PM abbyglp wrote: LuAnnh, Thank you for the link, I e-mailed it to my onc. Yes she did mention an ooph. We might talk about it more when I see her the first week of sept. I will also meet my new onc then to, so it will be interesting to see what his plan will be also. She is excited about him coming and feels that he will be a great asset to the practice. Did you have your ovarys out? hugs abby",
      "MessageIndex": 8,
      "PostDate": "28/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709462",
      "Title": "more bone mets found abbyglp lv2cmp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 30, 2009 09:28PM abbyglp wrote: Thank you renee for filling us in, Heather gives us all so much of advice and prayers and good wishes it would be no more than fair that we send her lots of them back. I will be thinking of her. I don't understand this disease, some of us hit rocks and some of us find the high road, it does't make sence sometimes. I wish her to be well soon and back to us. hugs",
      "MessageIndex": 4,
      "PostDate": "30/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738170",
      "Title": "HeatherP is not feeling well Reneepals heatherpalmerton"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 24, 2009 06:52PM abbyglp wrote: I was having a lot of heartburn and stomach issues on the xeloda and tykerb combo, come to find out that all that went away when I took the tykerb at leat 4 to 6 hrs before I took the last dose of xeloda, after telling my onc about it she then tells me Oh ya do not take the tykerb and the xeloda to close together. I do not no what your schedule is but if you are taking them to close together you could try the 4 to 6 hours apart.",
      "MessageIndex": 3,
      "PostDate": "24/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/731159",
      "Title": "Xeloda and Tykerb cathy50 cathy50"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 1, 2009 09:30AM abbyglp wrote: Wishing you the best with the MRI, great news that you have not had to do chemo and prayers that you can go many more years with out it. hugs abby.",
      "MessageIndex": 11,
      "PostDate": "01/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/731689",
      "Title": "Scans - a mixed bag Analemma Analemma"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: So strange I have had the weakest muscles since I have been back on chemo, I have pulled a muscle in my bum (hip) area, that took 6 weeks to go away and then I sprained my ankle just walking across the room, had xrays done on that and that still swells up if I am on it to much. This week I turned my body with out moving my legs and I pulled a muscle in my right side and it hurts like Heck. I am sure that is going to take 6 weeks to go away. I have never hurt myself this much in such a short period of time before. I work part time and take walks and try to stay as active as possible so its not like I am just laying around and letting my muscles atrophy. every time I see my onc I have to tell him I hurt myself again. I know that the chemo attacks our bodies but has anyone had a lot of pulled muscles on it, I am currently on taxetere, herceptin and zometa. I was also on carbo tax combo at first but just the taxetere now. I just might be getting old and falling apart. But I am hoping someone will tell me its from the chemo. LOL Hugs Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738416",
      "Title": "Pulled muscles anyone? abbyglp neogirl"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Sep 10, 2009 06:41AM abbyglp wrote: Heidi, Just letting you know I am thinking of you. Big Hugs",
      "MessageIndex": 278,
      "PostDate": "10/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jun 13, 2009 06:00AM abbyglp wrote: I was on tykerb xeloda for while I am glad she is doing well on it but it failed me. I found myself tired and could fall asleep as soon as I hit the pillow at night. I knew it was from that because when I was taken off it for about 6 weeks before I started a new chemo I had alot more energy. I think our bodies go through so many ups and downs with all this medicine I think when our bodies want to go into sleep mode it is telling us it wants and needs to heal. hugs",
      "MessageIndex": 3,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/733597",
      "Title": "Drowsiness while on Tykerb psc abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Oct 28, 2009 08:05PM abbyglp wrote: I went for blood work today and was going to get a massage to help back pain but she would not touch me. She was afraid that I broke a rib because of the shortness of breath that I was having, I told her it felt like I had a girdle on to tight and all I needed was to loosen up the muscle that I pulled, well she had the onc look at me and he sent me for xrays, They called back and I have pleural effusion (SP) what the heck does that come from? to much chemo? I have to have ct scan on monday. Just when I was raring up to tell him where to stick his next chemo.UGH !!! I am so nervous and sick again. How could anything be growing with all this dam chemo in me. I want to cry..The lump that I had found a month ago is still there also. I am going to demand it to be taken out and bx. I was taken off AI's 2 yrs ago because my bone bx came back changed from er+ to er-, So the chemo is working on the bones. What or can the lump that grew on my side be ER+ and that is why the chemo is not working on that?? I am going to jump him on wed. with that, as long as he does not floor me with some other overwhelming bad news. It is all I can think about now, I am afraid nothing is going to work for me anymore. Thank you all again for being here. Hugs gale",
      "MessageIndex": 10,
      "PostDate": "28/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742683",
      "Title": "Update/Abbyglp/Gale Reneepals abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Sep 30, 2009 02:45PM abbyglp wrote: Janice I wish you many more years with ned. Great News!! Hugs",
      "MessageIndex": 28,
      "PostDate": "30/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/741197",
      "Title": "Stable and some shrinkage.. Fitztwins sushanna1"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 3, 2008 01:01PM abbyglp wrote: Hi, Thank you all for your replies. I stayed home from work today, I think I have reached my stress point and just needed a rest day to take all this in. I just can not believe for the last 6weeks or so I was told I have matastatic disease to my spine, and that I would start tx for it this month, and now it is well we are still not sure, but lets test you for even a worse cancer multiple mylenoma, and then lets see what these spots really are. How can you put someone through this.... I am so frustrated and scared and angry all at the same time. I guess I was spoiled, cause when I was first dx, I was dx had surgery and given chemo all in about month, they gave me no time to sit and think about any of it. I have to go at 2pm today to pick up paper work to get blood and urne done and I guess they will set up the biopsy, all I know is it better be over with soon and I better not have to wait much longer for some answers. You all have been such a great help over the last 2 months, thank you for letting me vent hugs abby",
      "MessageIndex": 10,
      "PostDate": "03/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703271",
      "Title": "Now I am confused? abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 5, 2009 11:39AM abbyglp wrote: You have my thoughts and prayers, hugs abby",
      "MessageIndex": 8,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730173",
      "Title": "results in kbugmom gma5279"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Sep 24, 2009 08:46PM abbyglp wrote: Gentle Hugs and prayers for heidi and her family. This is so unfair. My heart breaks everytime I come here and read the posts from everyone and her family. Thinking of you",
      "MessageIndex": 590,
      "PostDate": "24/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738693",
      "Title": "Heidi Update-it isn't pretty Heidi_Ho zeeka71"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 18, 2009 08:22PM abbyglp wrote: I did chemo rads and herceptin for a year, got the all clear sign and boom 4 months later I was stage IV bony met to spine. Had more rads and went on arimidex and progressed from there with more bone mets, I just started herceptin again and hoping it will work again. My opinion is if you have a drug out there that is working for you then I would  stick with it. HUGS",
      "MessageIndex": 1,
      "PostDate": "18/08/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739154",
      "Title": "Am I crazy to want to stop Herceptin? ninismom DEAK95"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Hi, when I was dx the first time, I showed the onc my big toenails and she sent me to a foot doc after I finished chemo. The doctor put me on lamosil ($1200.00) for 90 days. well I finished it and my tonails started to look better. I should mention that I lost one of them twice during taxol and after. anyway they are all grown back but ugly as sin again. Has anyone never had normal toenails after chemo, or should I go back to the foot doc.? My big toes actually always feel tingly but the onc said it is from the taxol. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "21/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702663",
      "Title": "toenails abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Sep 8, 2009 06:43PM abbyglp wrote: Congratulations!!! Grandma, he is precious. I know how small he feels because my son was only 5pounds when he was born. I was so afraid of hurting him.Even premee clothes did not fit him. I am so happy for you, enjoy every minute, they grow so fast. HUGS gale",
      "MessageIndex": 27,
      "PostDate": "08/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/740082",
      "Title": "My First Grandchild Reneepals EGAL"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 1, 2008 03:19PM abbyglp wrote: luAnn, my onc took me off the arimidex because she said it was not working for me. My tx consisted of 2006 chemo, taxol, herceptin and rads, I have been on the arimidex for a year. So when I had the bone mets dx a couple of weeks ago she put me on aromisin. abby",
      "MessageIndex": 5,
      "PostDate": "01/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/703223",
      "Title": "bone mets no pain? abbyglp LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 11, 2009 05:11PM abbyglp wrote: Have you thought about going to the ER to just have an x-ray, What if you have a fracture? just a suggestion. hugs abby",
      "MessageIndex": 6,
      "PostDate": "11/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732296",
      "Title": "Painful hips and groin riverinerabbit virginiamom"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "May 27, 2009 12:37AM abbyglp wrote: Wonderful news and so glad you are feeling better.",
      "MessageIndex": 4,
      "PostDate": "27/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734823",
      "Title": "scan results kbugmom bourscheid"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 21, 2008 08:52PM abbyglp wrote: Hi, LuAnn I only have bone mets that I know of so far, spine. It is just strange how now I think everything wrong with my body might be cancer now.I am sure this will pass. I read your posts and I am sorry I wanted to answer them. I feel for you having lost your husband and how depressing it could get going it alone and staying strong for the children. My daughter is mentaly handicap and 19, she is in connecticut with my x husband and my son who will be 15 this month. They always spend the summers with me and last summer they did not because I did not want them to see me with out hair and just not looking like mommy, I know it would of been scary for them, but I had so many hopes that this year would be different I actually look so much better and now the next few months of the unknown is scary again. I know that ugly tonails is trivial compared to what other ladies are going through on this site, but I guess the worries will continue... I guess I should just get some pretty nail polish thanks hugs abby",
      "MessageIndex": 3,
      "PostDate": "21/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702663",
      "Title": "toenails abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 23, 2008 06:00PM abbyglp wrote: Well, before I left work today I picked up some vicks, I hope it works before summer, my toes want to go naked in the sun this year. thanks for all the replies hugs abby",
      "MessageIndex": 16,
      "PostDate": "23/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/702663",
      "Title": "toenails abbyglp abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 12, 2009 10:51PM abbyglp wrote: We have 4 chairs on one side and then a nurses station and then 4 chairs on the other side and I always seem to end up in the chair facing the nurses station and I think what I hate the most is the whispering that goes on between the nurses and the PA and doctors. You always imagine it must be me they are whispering about. Rant all you want that is why we are here, cause we are the only ones that no how you feel. hugs abby",
      "MessageIndex": 2,
      "PostDate": "12/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730626",
      "Title": "my onc's office needs a metster's club jeanne46 DianeE"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Hi, I got back from connecticut yesterday, It was so wonderful to have family around me for 13 days. I was spoiled, they could not have done enough for me while I was there. I felt as if I snuck away from the cancer and today it found me. I went for set up for rads today, they will start tomorrow. I also saw my onc today and I am waiting for the tykerb to come in the mail. Next week I go for my first infusion of zometa. I just hope I can get back up there before any thing else happens. I just want to get all this stable so that I can feel like I have a life back again. I will go read through the boards now to see what I have missed.hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "05/05/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/705070",
      "Title": "Vacation was wonderful abbyglp badboob67"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 29, 2009 10:54PM abbyglp wrote: You can say I also came to a cross road in tx today, So I know how you are feeling. If they are not giving you many options I think you came up with the best one, start the xeloda and tykerb and if it does not work demand that they take the ovaries out. It does not seem right that oncs get paid the big bucks and we have to come up with our own tx plans. It discourages me to no end. I am sending you hugs and prayers that all comes out well with what ever you and your onc choose.",
      "MessageIndex": 2,
      "PostDate": "29/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/738118",
      "Title": "At a crossroads again. Need treatment advice. mason204 konakat"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Hi, I was dx in may of 2006. I had all the breakdowns over it and then found that place in my head that says suck it up and get on with it. I was in my happy place and thats what got me through surgery, chemo and rads. I was good...... until Bone Mets. Feb. 08. I had my initial break down changed my meds, just finished rads to c-spine, and I just started tykerb 3 days ago. I already had my first zometa, and will be going for my next one next week. I should feel better.. I have a plan of action and I have gotten the worse part over with for me anyway. I hate rads!  I should of found my happy place by now.. I need my happy place. Am I crazy? I mean I am usually a very positive person and I think that is what helped me get this far, but latley I am just so..BLAH!! not myself. Do you think I just need some extra regrouping this time or is it the aromisin. I asked the rad onc. if any of those rads rickached (sp) and zapped my brain where my happpy place was. cause it is gone and I want it back. He assured me that he did not zap my happy place. I guess I just need to do a little extra meditation this week and hope it comes back. thanks for listening. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "04/06/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/706764",
      "Title": "o.k. I think I lost happy place abbyglp zschweeb"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Oct 27, 2009 08:57PM abbyglp wrote: Thank you all for your concerns, It means so much. I really hate to come on and whine about my pains. I have not been able to do anything and I really think depression is setting in along with al this because I just don't seem  to care so much anymore.I go to an ortho doc for my foot and he does xrays and an mri and because my tibia lit up he says I am not an onc. DAH I know that this is why I came here. He said it was very rare for the cancer to spread there, but I guess if I was not a cancer patient he would say it was osteoporsis. Well why can't I get that answer. I went to see another ortho for my back because of the scoliosis and he said well if you did not have cancer we would fix this before it got any worse. I go to GP he tells me you are really a sick person I usually just see patients that need antibiotics for sinus and shoo away the patients that want pain meds. Why do other docs not see anything past the cancer dx. I feel like I am limited to my onc for everything that goes wrong and I do not feel that he is able to tx or see anything beyond cancer. Does anyone run into this with other doctors.?I know my body is telling me it is ready for a chemo break, It has been 6 months and good scans and he wants to continue chemo aand even add another chemo because my TM's keep going up. Hell with the TM's I feel like I am only existing and not able to live. and that is not how I want to be. I am confused and hurting and depressed that he has not given me any hope, I am taking it upon myself to tell him that my body needs a break and I understand the consequenses. I have to no if I can have a better quality of life if I take a break from chemo. It might be a mistake but I have to know if I can have some relief from all this misery even if it is for a short time. living in my room on my bed is not what I can do anymore. there has to be more.Thank you all again. Hugs gale",
      "MessageIndex": 4,
      "PostDate": "27/10/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/742683",
      "Title": "Update/Abbyglp/Gale Reneepals abbyglp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: Well I am back to radiation, had my first tx today to right hip, right thigh and lower spine that attaches to pelvis. I can not believe this. I was dx in feb with c-spine mets and I started aromasin and zometa, tried tykerb but was taken off because of side effects. then put back on in july when my doctor decided to send my biopsy back to see if I was still er+, I wasn't so the aromasin was not working for the 5 months that i was on it, so I have been on tykerb for the last 3 weeks, they did not have enough of the specimen to no if the spots where still her2+ they are just assuming. I do not no how long they are going to wait and see if the tykerb is stopping the progression. would chemo be the next move? and if so what is anyone on for bone mets? I am so unsure of these doctors now, I feel like I need to no more before I see my onc again next monday. any help would be appreciatied . I am in so much pain, I had to stop working until this all gets under control. I also had my TM's drawn today, I am so scared to find out what they are. my doctor only ordered a bone scan last week to see why I was having pain. If I have had progression to bones who's to say it did not go to soft tissue in the last 5 months. scared. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709462",
      "Title": "more bone mets found abbyglp lv2cmp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 28, 2008 09:33PM abbyglp wrote: Hi, I just came back from oncs today and she feels that if she starts me on xeloda now I would probably end up in hospital. I am having bad side effefts from the rads.Bad, Bad, nausea and diareha. taking pepto and just got a script for anti nausea. So my plan of action will be zometa, tykerb and adding xeloda in september, she wants to give my body time to recover completely from rads since it has really only been 5 weeks earlier that i had 15 tx of rads to C-spine, and now having 10tx to pelvic, lumbar spine and right thigh. I asked her if I had progression then does that mean the aromasin is not doing anything, she felt that because I was ER+ 99% at dx. that I still should be on a hormonal, we will be either doing temoxofin, or the one that is a once a month shot, forgot the name. I am opting for the once a month shot one less pill a day would be nice. she told me the xeloda dosage is based on weight and size of person. she said they will start with the max dose for my size and then adjust it from there. At least no hair loss. gma5279 I would ask what your er status was at dx, I did not feel comftorable stopping it even when I found out that my mets are no longer er+. she told me it would not hurt to take it even if it was not curing my bone mets but it could be keeping something that might be lurking at bay. So If you were highly er+ at dx, I would continue taking something . hugs abby",
      "MessageIndex": 6,
      "PostDate": "28/07/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/709462",
      "Title": "more bone mets found abbyglp lv2cmp"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Sep 4, 2009 05:34PM abbyglp wrote: I have been on the once every 3 week schedule of taxetere and herceptin. It is doable, I think you will be surprised. I also think it is accumadable so I think the hardest part is keeping your blood counts up so that you do not get tired. It is a strong drug and it will kill what ever cells the xeloda left behind. Good Luck and I keep telling nyself that hair is a small price to pay for life. HUGS",
      "MessageIndex": 2,
      "PostDate": "04/09/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/739974",
      "Title": "I am to start Taxotere, any info or advice? KLee jadams1264"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 11, 2009 08:48PM abbyglp wrote: WOW, what a great job. You are a very lucky mom, and they are very lucky kids to have you. hugs abby",
      "MessageIndex": 15,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730539",
      "Title": "Some good news about my kids! LuAnnH ozzie2"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 22, 2009 05:39PM abbyglp wrote: I have been getting tummy cramps to these past few weeks, I have had loose bowels but not diahrea. I had a slight temp last week of 100.4, I would be standing at work and out of no where get hit with a little bout of nausea, I would tell the girls that I had to go sit down and it would go away. I chalked it up to something going around but it has stayed with me for about 2 weeks now. Are either of you getting herceptin? can herceptin give us nausea or bowel problems? hope you feel better soon, Hugs",
      "MessageIndex": 2,
      "PostDate": "22/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737750",
      "Title": "Stomach pains & Diarrhea Jaypee60 Heidi_Ho"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 5, 2009 04:45PM abbyglp wrote: I to have had it with this house. I went up north to see family for 6 weeks and laughed and had a great time, So when I came home it was good for a couple of weeks but now I am ready to bust out. I am on SS, but I told my onc that i was going crazy so she gave me a note to go back to work only 2 or 3 days a week 4 hours a day. It is enough by the end of the 4th hour I am ready to go home. It has helped my mental status. I have something to look forward to each week. You have a great attitude and a beautiful smile. hugs abby",
      "MessageIndex": 7,
      "PostDate": "05/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730207",
      "Title": "I want my social life back! marshakb LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Aug 26, 2008 03:59PM abbyglp wrote: Hi, I was on herceptin for a year. My TM's rose slightly a couple of points every time I had my blood checked. I finished a year in Oct 07, and my mets to bone were found in Feb 08. I was also told that Herceptin failed me, so they did a bone biopsy and it came back er pr neg, so I was taken off the aromasin and I was put on tykerb by one doctor and after the rads to spine the diarhea was so bad that they took me off again for the last 4 weeks I have been on nothing and my TM's dropped 20 points, My new onc says I do not do anything normal. He told me that tykerb works better with xeloda and so I am starting the xeloda first for 2 weeks and see how that goes and then he will decide if he wants to add the tykerb. I also get a zometa for bone strengthening every 28 days. Will you be getting zometa? So as far as herceptin they said tykerb was better and that it was not as heart damaging, I am waiting to recieve the xeloda in the mail, I have not started it yet. hugs abby",
      "MessageIndex": 4,
      "PostDate": "26/08/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/720141",
      "Title": "question before onc visit jerseymaria LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 3, 2007 02:09PM abbyglp wrote: Marrikay, Hi, I just had my check up and my ca27-ca29 was 38. My doctor told me that these markers fluctuate. Small increases at a time is not anything to worry about. I had a sinus and ear infection and my doctor told me that might be why it went up a couple of points. If you have it done and it shoots up 30 to 100 points, than they would do scans to rule out mets. But everyone is different and everyone levels out in different areas of the scale. She told me she has a patient that is cancer free and has leveled out at 63 cause that is what is normal for her. So do not worry. hugs abby",
      "MessageIndex": 8,
      "PostDate": "03/07/2007",
      "ThreadURL": "https://community.breastcancer.org/forum/67/topics/645783",
      "Title": "Follow up Dr Apt margie123 angeldawn"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "abbyglp wrote: I had a bone scan in feb. it showed spots on my spine, I was sent for an mri and confirmed till I went to the rads onc and he said not sure lets do a biopsy, I had biopsy and in the mean time my onc changed me from arimidex to aromisin, I saw a different rads onc today and he wants to do rads asap, well I already planned a trip back home and he was not to pleased about that. He gave all the if you feel this or that come back asap. My question is how many of you with spine mets went for rads before you even new if the AI's were working? from what i have read on these boards is that some of you are just taking an AI and zoledex for bone repair. He scheduled me for simulation and tx for the day I get back from my trip. Don't they save rads for when you are in pain? I called my onc but again I got no phone call back. they will call back tomorrow and I will be on a plane for connecticut. He scared apart of me today telling me all the things that could happen and the way my luck is I will be paralyzed by the time I get back from a 13 day trip. what a nice thing to have to think about while I am spending time with my family that I have not seen in 13 years. hugs abby Dx 5/5/2006, IDC, 5cm, Stage IV, Grade 2, 6/15 nodes, mets, ER+/PR+, HER2+ Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/04/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/704415",
      "Title": "bone mets and rads ? abbyglp badboob67"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Jul 15, 2009 06:50PM abbyglp wrote: I have been on them for back pain, and they did not bother me. How is the script wrote usualy it is something like 6 pills for 3 days and then 5 pills for 3 days and so on and so on until u are down to 1 pill for a couple days. I made sure I took them in the mornong and I made sure I took my sleeping pill at night.  hope they do not find anything on the CT, and the shortness of breath subsides. I had shortness of breath but it was from low blood counts and the herceptin, are you on herceptin? did u have a muga or echo? hugs",
      "MessageIndex": 1,
      "PostDate": "15/07/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/737482",
      "Title": "I need the scoop on Prednisone Cyberrand Cyberrand"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "May 21, 2009 11:12AM abbyglp wrote: I have been having the same problem. I had my third carbo and taxetere, and my platlets have been dropping. I was told that the normal range was 150 to 300 thousand. I just got a call from onc yesterday saying mine went down to 26000 befpre tx they were only 130. I guess all we can say is if the chemo is killing off the platlets then it must be killing off the cancer. Just be carefull, and rest. hugs",
      "MessageIndex": 4,
      "PostDate": "21/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/734549",
      "Title": "Question about Platelet count pattih roseg"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Mar 11, 2009 07:44PM abbyglp wrote: I am praying your counts stay up and the chemo beats the beast down. hugs abby",
      "MessageIndex": 4,
      "PostDate": "11/03/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/730573",
      "Title": "Progression on Abraxene - Moving Forward TripleNeg LuAnnH"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Sep 18, 2006 01:00PM abbyglp wrote:",
      "MessageIndex": 443,
      "PostDate": "18/09/2006",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/373995",
      "Title": "Is Anyone Starting Chemo In Aug 06 Mamasj cheryl66"
    },
    {
      "AuthorID": "abbyglp",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/34111/profile",
      "Content": "Apr 21, 2009 09:46AM abbyglp wrote: I only get them now bad for about a week after I get chemo, the rest of the month I only get 1 bad one during the day, and at night. I did notice a decrease in them now that it has been 3 years. I would consider myself lucky if you are done with them. hugs gale",
      "MessageIndex": 2,
      "PostDate": "21/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/732837",
      "Title": "Where did my hot flashes go? donnabee donnajm"
    }
  ]
}