{
  "AuthorID": "Abfmom77",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256492/profile",
  "Posts": [
    {
      "AuthorID": "Abfmom77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256492/profile",
      "Content": "Jul 24, 2017 07:44PM Abfmom77 wrote: I received my results and they are B9!! Thank you so much for your support. I will pray for all of you fighting this horrible disease. Thank you for letting me share a part of your lives. Xxo",
      "MessageIndex": 12,
      "PostDate": "24/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857022",
      "Title": "Nervous Dreamspirit Abfmom77"
    },
    {
      "AuthorID": "Abfmom77",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/256492/profile",
      "Content": "Jul 22, 2017 08:55PM Abfmom77 wrote: Hi everyone! I just joined today although I have been reading through threads for the past 3 days. I just turned 40, and as an RN understand the importance of routine screening exams. I had my very first mammogram 3 days after my birthday in June. I have no known family history although my dad was adopted so we are unsure about his family. I was called back and wasn't concerned because they warned me that a lot of initial mammogram patients get called back due to lack of previous images for comparisons. I was scheduled 3 wks later for my diagnostic mammogram on July 11. Again, I wasn't concerned, I had no symptoms either. The radiologist then starts using words like, \"Unfortunately \" and \"Sorry.\" I was a BIRADS 4 for a suspicious 1 cm lesion. I had the core biopsy on July 17 and am still waiting for results. The same radiologist did the biopsy and said she looked at the images again and thought it could be 2 fibroadenomas together. I am so scared. One minute I am confident that it is benign and the next I am certain it is cancer. Now I think my axillary area is tender but I keep telling myself it is either from razor burn or because I am imagining it.",
      "MessageIndex": 9,
      "PostDate": "22/07/2017",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/857022",
      "Title": "Nervous Dreamspirit Abfmom77"
    }
  ]
}