{
  "AuthorID": "abitmuch",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165520/profile",
  "Posts": [
    {
      "AuthorID": "abitmuch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165520/profile",
      "Content": "Jan 16, 2013 04:59AM abitmuch wrote: hi everyone I just found this thread so I thought I would share. I was diagnosed with DCIS in November. I am small breasted and the lump was rather large (10+ CM) so a mastectomy of the entire right breast was necessary. I am 34yo. I went in for my MX on Jan 10th. the actual procedure was less than 2 hours. I stayed in the hospital overnight and was sent home the next day. a homecare nurse was assigned to me and she's been checking my drain and bandage. At the time of the surgery, I was also 12 weeks pregnant. An OB was called to do an ultrasound for me in the recovery room and the baby still had a heartbeat. I was told that everything looked great. I was only given Tylenol 3 to control my pain, due to the pregnancy everything else was not recommended. I find that it only made me drowsy while the pain was still there. the most pain I feel is at the incision where the drain enters my side body. every once in a while I would feel my skin tucking at the staples too, which is very unsettling. the codeine makes me very constipated, and I'm worried about taking too much acetaminophen (Tylenol) so I've been trying to bare the pain, but it's very miserable. the drain may come off tomorrow and the staples will be out next Monday. my follow up for pathology report is next Tuesday, which will determine if I'll need to go back for node removals. at this point I can't bare the thought of one more surgery, but I guess we'll see. I send positive vibes for those who are going to the OR and wish everyone a good recovery process.",
      "MessageIndex": 504,
      "PostDate": "16/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "abitmuch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165520/profile",
      "Content": "Jan 23, 2013 04:03PM abitmuch wrote: Hi everyone Oh man, the rollercoaster! I was doing great yesterday after I went for my post-op appointment and an ultrasound for the baby.  It turned out that the pathology report was not yet ready as they were still looking for a 'focus of invasion' in my high-grade DCIS breast that was taken out.  I took it as a good sign.  The ultrasound then went OK - the baby seems to be doing fine (about 7cm long now at 13 weeks) and I could see the little legs and arms actually moving around!  It was kind of exciting. Even though the surgery wound was still bruised and sore, I felt much better having the staples removed.  So much so that I went back to my office today to do work!   Then as I was packing up, I received a call from my BS who said that he had heard back from the pathologist, who finally DID confirm a focus of invasion.  This means that we have to go to the next step, which is another surgery to remove my lymph nodes. *SIGH*  I am way more scared of the ALND than I was about the mastectomy, as I've read so much about lymphedema and lost of usage / nerves of the arm, etc.  I really really really don't want this surgery, but it seems like I don't have any choice now. It also happens that my BS will be on vacation starting next monday for two weeks. So he's trying to see if he could fit me in tomorrow (!!) otherwise, I'll have to procedure on Valentine's day.   Emotionally I'm more inclined to wait another two weeks, gain back my arm strength before going under again. But I don't know if it makes more sense to get it all done and over with right away so I don't have to stretch out recovery time.  ggggaaaaaaaahhhh  (also, thanks for all your support and encouragement, this discussion board is amazing)",
      "MessageIndex": 698,
      "PostDate": "23/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "abitmuch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165520/profile",
      "Content": "Jan 24, 2013 09:11AM abitmuch wrote: dnadebbs - thanks for your encouraging words my lymphedema/ALND worry.  I've decided to not do the surgery today and give myself some time to emotionally and physically prep for the second surgery, which is now scheduled for Valentine's day.  I'll also be in the middle of second trimester, so I feel better about that. keep on keepin on, I suppose. wirdgirl118 - I had my drain out for a week now and that tight-chest + sore feeling still lingers.  i have a big green bruise surrounding my mastectomy wound as well, some parts are sensitive while some parts are completely numb.  it is really weird sensation.",
      "MessageIndex": 710,
      "PostDate": "24/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "abitmuch",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/165520/profile",
      "Content": "Jan 22, 2013 10:04AM abitmuch wrote: Hi everyone.  I'm checking in after a week of posting here. Recap: I was diagnosed with high grade DCIS in November. I had a mastectomy (right breast) on Jan 10th, was in the hospital for a night and released the next day.  I'm 34 and was 11.5 weeks pregnant when the surgery happened.  The doctors couldn't give me any narcotics pain meds except for Tylenol 3, whose side effect was constipation (ugh!).  As a result, I was only on Tylenol extra strength for the days after surgery.  It's been 11 days since the surgery now, I'm feeling much much better.  My drain came out 5 days after the surgery, and I had my staples removed yesterday (Jan 20).  I saw my wound for the first time yesterday when the nurse was pulling the staples and I took my first shower this morning.   I was a wreck for the few days after surgery - it was really hard to sleep, the drain was a drag, and I mostly felt like I was hit by a truck.  But it got better everyday.  When the nurse pulled out the drain it hurt a bit, but the pain didn't stay.  The surgery staple removal procedure was completely painless - I must have had about 40-50 staples.  I didn't feel most of them, and the ones that I felt was just as painful as plugging armpit hair.  My chest muscle still hurts and I can't lift my right arm too much, but I'm slowly stretching it out. I did not have lymph nodes taken out. Due to the pregnancy, the procedure for sentinal lymph node was not available to me (they couldn't give me the injection). So my only options were either take out all the lymph node at the first surgery or wait until the pathology result come back to see if there was focus of invasion and go back for the lymph node surgery if so.  I chose the second option, since it seems too crazy to take out perfectly good lymph nodes if there was no invasion. Today was my post-op appointment, and it turns out that the pathologist is still not able to confirm if there was a point of invasion in my tumor.  I took it as a good sign, but still have to wait until the end of the week to get a confirmation for sure.  So, anxiety ensues... smethot - I hear you about being in PJs all day, I'm also in Ontario (Toronto) and so glad that I don't have to leave the house much in this weather!",
      "MessageIndex": 659,
      "PostDate": "22/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}