{
  "AuthorID": "abitjaded",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64764/profile",
  "Posts": [
    {
      "AuthorID": "abitjaded",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64764/profile",
      "Content": "Mar 25, 2008 09:26PM abitjaded wrote: Thanks all. I had tried to find someone in the Kaiser network in Denver on the lymphadema network, left a message for the one person in Denver, she was going to check if anyone is a specialist in Colorado Kaiser, no reply.  So frustrating.  I am going back to the original PT who saw me for all the scar tissue originally, but cannot get an appointment till April 9th.  Sheesh, love the Kaiser system. Any other comments on gabapentin or lyrica or the like?  I quit taking it  two days ago (gabapentin)since it seems to make me crazy, lousy memory and unable to remember one thing after another at home or work.  Better without the gabapentin.  But wow I hate this neuropathy.  Like LE, it is just a constant niggling irritation that makes it hard to function well. Or sleep.  My hand still looks like a bunch of hot dogs that have not been pricked in the microwave.",
      "MessageIndex": 3,
      "PostDate": "25/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/702784",
      "Title": "New here-lymphadema vs cts swelling abitjaded abitjaded"
    },
    {
      "AuthorID": "abitjaded",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/64764/profile",
      "Content": "abitjaded wrote: Hey all, just found this site, so pardon if my post looks yucky. I searched for info about carpal tunnel syndrome, which I had been creeping up since surgery, but it is now flaming CTS.  I do not have lymphadema, but the neurologist, thought that, yeah, some of the swelling might be lymphadema... so... now what.  I have peripheral neuropathy, too and am pretty miserable at the moment.  How can I tell one type of swelling from another, and, an aside-does gabapentin make any of you feel crazy?? Carla Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/03/2008",
      "ThreadURL": "https://community.breastcancer.org/forum/64/topics/702784",
      "Title": "New here-lymphadema vs cts swelling abitjaded abitjaded"
    }
  ]
}