{
  "AuthorID": "abs44",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194636/profile",
  "Posts": [
    {
      "AuthorID": "abs44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194636/profile",
      "Content": "Feb 9, 2014 10:15PM abs44 wrote: MaryAnn, You're not alone. I was diagnosed with PASH (and ductal hyperplasia) last month and the general surgeon I saw really didn't have much information for me. He suggested we do nothing for 6 months and re-do the imaging and biopsy and discuss then. I decided on my own that I would follow up with a breast specialist because this clearly wasn't in his wheelhouse. I'm planning to do that in 3 months rather than 6 since I really didn't get any information from my last doctor. I'm not sure how much of my 3cm mass is PASH and how much is the hyperplasia, so not sure how big it is. I feel your pain about not knowing what to do. I'm hoping to find out more when I see a specialist but I will say that if yours is fairly big, surgery is probably the answer. ",
      "MessageIndex": 74,
      "PostDate": "09/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797815",
      "Title": "PASH - Pseudoangiomatous stromal hyperplasia gillianinnh djmammo"
    },
    {
      "AuthorID": "abs44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194636/profile",
      "Content": "Feb 2, 2014 05:32PM abs44 wrote: Habibi, Re: your question about seeing a breast specialist - if you felt like your surgeon knew enough about the condition and got a good vibe from him, I think you would be fine with a general surgeon. However - you mentioned on my thread that you felt he was dismissive of you. I'll repeat the advice I got from the lovely ladies on this forum: if you don't like your doctor or feel he isn't fulfilling your needs as a patient, that is a good enough reason to switch/get a second opinion. So, if you don't trust him or are unhappy after your upcoming appt, by all means get the opinion of a specialist. My plan is to wait three months and see a specialist at that time (unless the mass gives me any trouble before then). ",
      "MessageIndex": 5,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817578",
      "Title": "confused about biopsy results habibi7 marie5890"
    },
    {
      "AuthorID": "abs44",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/194636/profile",
      "Content": "Feb 2, 2014 01:00PM abs44 wrote: Habibi, I just had a core needle biopsy that diagnosed PASH too. Being in a similar situation, here are my bits of info and recommendations: 1.) It is normal that the area feels different or more pronounced after the biopsy. Mine feels completely different now, which the surgeon confirmed is because it has been stabbed with a needle repeatedly and may now have some swelling/distortion from the healing process. 2.) I did not know the results when I went to see my surgeon and therefore did not know which questions to ask and left feeling like I wasn't given much information. Here are the questions I wish I would have asked (so hopefully you can ask your surgeon when you see him/her!): - Do I need to have the mass removed? If not now, will I need to down the road? (My surgeon said they wouldn't remove it but would re-evaluate in 6 months to see if I need surgery then). - What is the chance of recurrence if I have the mass removed (in other words, is the PASH all over or just in that one area)? - What are the advantages and disadvantages of doing follow-up instead of surgery? - What should I be looking for in my self-exams and how often should I be doing them? - What is your experience with PASH and should I see a breast specialist? (My surgeon clearly didn't know much about PASH - he is just a general surgeon - so I plan to see a specialist in 3 months). I hope this helps you prepare for your appt with your surgeon. There are lots of options to consider. For me, if I still have this thing in 6 months to a year from now I will probably elect to remove it simply because surgery will cost less than the frequent follow up ultrasounds and biopsies that the dr is recommending.  Good luck!",
      "MessageIndex": 3,
      "PostDate": "02/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/817578",
      "Title": "confused about biopsy results habibi7 marie5890"
    }
  ]
}