{
  "AuthorID": "Acee5",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157580/profile",
  "Posts": [{
    "AuthorID": "Acee5",
    "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/157580/profile",
    "Content": "Jul 30, 2012 01:20AM Acee5 wrote: Hi, I found a lump under my right nipple and went for a mammogram, ultrasound and biopsy on Thursday last. I have had this done before and both times turned out to be fibroadenomas which were removed on those occasions doctor who did ultrasound showed me \"lump\" etc. This time radiographer did lots of extra images on right breast including magnification, I didn't ask her any questions, same doctor who did previous ultrasound did this ultrasound, this time she didn't show me anything on monitor ( I don't know why I didn't ask, I was babbling on about unimportant things), she said to me seriously, \" now Ann we have to see what's going on in this breast\" she took Core biopsy from were I thought was lump but also surrounding tissues (3 samples) she also took FNA from under arm. Then I was sent down to consultant, I was convinced it was another Fibroadenoma. Breast nurse also came into the room. Consultant told me, it was very serious and they were very worried about me, she explained about calcification, what it was etc, she said a lot was found close to lump 9cm worth but lump only measuring 1.5cm. She didn't explain what type/rating of calcification and I didnt know about them didn't think to ask. She the did a physical exam, talked about breasts being asymetrical (but arent everyone's breasts different sizes?) she also spoke about right nipple pointing to floor, but because I'd had a Fibroadenoma taken from above left nipple, I just thought left breast had had a little lift from op. she the asked me environmental questions, then sat me down again, told me doctor (ultrasound) had seen one lymph node which was neither normal or abnormal but indeterminate hence anxilla biopsy. Then she re emphasised how worried and serious this was, that we wouldn't be talking lumpectomy but mastectomy, think she said then if it was breast cancer, or looks like breast cancer, everything a haze by then. She got my husband to come in from car park and told us both she had to be straight and no point in telling us not to worry and just wait for biopsy results. She said she would be meeting with the team this week to discuss me and make a plan, I have to go back at 9.30am this Friday for biopsy results and plan. I'm in shock and confused. I've never had a consultant be that worried before usually they just say \"no point in gettin too worried until results, we will cross that bridge etc\" so she must be fairly sure with what's she's seen. I didn't wear deodorant for mammogram, but if shower gel was perfumed could it have caused such a bad result? Could it have shown up worst calcification, shape clustering, lines etc I don't think it's true ie. results, I feel like she was looking at wrong image results, amd I don't know how she can be so sure without Biopsy results. This is the longest week ever, I'm so sorry for such a long post. Ann",
    "MessageIndex": 5,
    "PostDate": "30/07/2012",
    "ThreadURL": "https://community.breastcancer.org/forum/62/topics/791236",
    "Title": "Just got results.. Mary1NYS SelenaWolf"
  }]
}