{
  "AuthorID": "Acevedomom",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
  "Posts": [
    {
      "AuthorID": "Acevedomom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
      "Content": "Aug 10, 2014 03:18AM Acevedomom wrote: Any advise ladies????????? please",
      "MessageIndex": 1,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823505",
      "Title": "Worried mommy Acevedomom aunt_paula"
    },
    {
      "AuthorID": "Acevedomom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
      "Content": "Aug 10, 2014 08:09AM Acevedomom wrote: yea it is scary and a friend of mine had told me that she has heard of the clogged ducts turning to cancer, i have tried google but google always can convince you that something is really wrong. have you ever heard of anyone having a clogged duct that then getting a lump that was indeed cancer??? i really do appreciate the responses , thanks a bunch ladies",
      "MessageIndex": 6,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823505",
      "Title": "Worried mommy Acevedomom aunt_paula"
    },
    {
      "AuthorID": "Acevedomom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
      "Content": "Aug 10, 2014 08:53AM - edited Aug 10, 2014 10:49AM by Acevedomom also i forgot to add that the lump isdirectly under the nipple, really firm and it moves around kinda if i push beside it",
      "MessageIndex": 7,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823505",
      "Title": "Worried mommy Acevedomom aunt_paula"
    },
    {
      "AuthorID": "Acevedomom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
      "Content": "Aug 14, 2014 08:29PM Acevedomom wrote: I saw the doctor and recieved a referral to see a specialist,also they found another tumor on my cervix  so now im worried to death about both masses, could they somehow be connected? my doctor did say that neither lump felt(squishy) so she diddnt think that it was a cist( hope i spelled that correctly) so now its more waiting bc i still have no clue what it is and the crazy part is they saw my cervix was dialated to 2-1/2 and im not pregnant maybe the tumor on my cervix is causing the dialation???  but on the bright side at least im getting to see a specialist and getting this taken care of they are sending me to the breast and cervical cancer center here. around 3 weeks just to get an appointment but fingers crossed that both masses are ok..... and i hope all u ladies have positive thoughts and a wonderful day !!!   (smile ladies)",
      "MessageIndex": 8,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823505",
      "Title": "Worried mommy Acevedomom aunt_paula"
    },
    {
      "AuthorID": "Acevedomom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
      "Content": "Aug 10, 2014 03:38AM Acevedomom wrote: oh ok,! and aunt_paula thank you so much for the support. ",
      "MessageIndex": 3,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823505",
      "Title": "Worried mommy Acevedomom aunt_paula"
    },
    {
      "AuthorID": "Acevedomom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
      "Content": "Acevedomom wrote: hello im new on here and not really sure if im posting this in the correct place.  my name is Aubrey im a mother of a 2yr old little girl , i have had ongoing concerns about a lump in my right breast. when i gave birth to my daughter i discovered a knott in my right breast, about 5 months later i finally went to the breast center here in knoxville and they told me i had a blocked duct, the office set me an appointment for a ultrasound, at my ultrasound i was told i had a blocked duct and they numbed and drained the lump, it contained a large amount of fluid , the docter then told me my breast were as active as a mothers who is breast feeding. i have never breast fed my daughter so thought that was kinds strange. after my procedure the lump went away completely,all signs of the lump was gone, then around my daughters 1st birthday i discovered a lump once again and it is similiar to the 1st lump, same spot, but it is very large this time and can be seen very easily. my breast are draining a whitish yellow fluid and i have small bumps on the nipple, my daughter will be 3 in november and i have had this lump since around her first birthday it seems to be growing. I havent been able to have it checked out because of insurance reasons but i have an appointment for a physical in 3 days. I am really worried and was wondering if anyone has had any similiar problems???  im all open ears to any advise , responses or similiar problems. thankyou in advance for any responses and for reading... have a blessed day everyone...............                      Family.... my love, my life, my entire world the reason for existence!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "10/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823505",
      "Title": "Worried mommy Acevedomom aunt_paula"
    },
    {
      "AuthorID": "Acevedomom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
      "Content": "Aug 15, 2014 02:50AM Acevedomom wrote: yes me too,except the fact that ifound out i had a tumor on my cervix also, and im dialated  2 1/2 without being pregnant!!!!!!! i was  shocked when the doctor told me that i was dialated , i said IM NOT PREGNANT but she said me being dialated was because of me having the tumor on my cervix so now i have two , the one on my breast is a huge concern, im going insane on google trying  to find anything to explain the two masses being connected in some way but no luck. my fiance is great with support but im trying to just hold it in although i feel like breaking down. but got to be strong for my family ya know. im naturally a worrier. i could tell whatever the tumor is on my cervix that its not good because my doctor was really concerned, and that scared me as far as the  lump in my breast, she said (doctor)  the lump was hard it measured a 6    i have to wait 2weeks before i get to talk to someone to get answers an its driving me insane. i have a beautiful  two year old little girl that i need to enjoy but when im spending time with her i keep thinking WHATS WRONG WITH ME!!! im 29 i shouldnt have these things. ive always heard that people my age dont get these kinda things.... SORRY,  i know im writing a novel but i really dont have anyone that i can tell everything to, i have my fiance but the last thing i want to   do is get him more upset  so here i am blabbing to you all. thank you all so much for listening to me and letting me vent i am so happy i foung this place because this is my biggest support group right now. Sorry once again for the novel and all of my venting... i hope you all have a blessed day ladies  ",
      "MessageIndex": 10,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823505",
      "Title": "Worried mommy Acevedomom aunt_paula"
    },
    {
      "AuthorID": "Acevedomom",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/203721/profile",
      "Content": "Aug 15, 2014 03:01AM Acevedomom wrote: i was really emotional writing that last post sorry for all the blabbing,",
      "MessageIndex": 11,
      "PostDate": "15/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/823505",
      "Title": "Worried mommy Acevedomom aunt_paula"
    }
  ]
}