{
  "AuthorID": "achen2iron",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81558/profile",
  "Posts": [
    {
      "AuthorID": "achen2iron",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81558/profile",
      "Content": "Jun 1, 2009 09:01PM achen2iron wrote: Hi oldlady, I had a lumpectomy about 3 weeks before my bilat. The lumpectomy doesn't have any affect on the recon because all that tissue will be gone. They did do a skin sparing mast. but they just went through the old lumpectomy incision when they did the recon. As far as the SNB scar on the right it is still there, it's a separate incision further up in my arm pit, On the left side the SNB scar is just part of the recon scar line,   I had a TRAM which is similar to a DIEP only they take a tiny littlle bit of muscle with the TRAM, I am 6 weeks out and back to all my old activities except heavy lifting.    ",
      "MessageIndex": 2,
      "PostDate": "01/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735124",
      "Title": "Bilateral mast + DIEP after lumpectomy? oldlady achen2iron"
    },
    {
      "AuthorID": "achen2iron",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81558/profile",
      "Content": "Jun 13, 2009 10:30PM achen2iron wrote: I also had a skin sparing mastecomy and have feeling in the skin, Had imed, nipple recon, during the TRAM recon surgery, No feeling in the nipples though none, nada. ",
      "MessageIndex": 3,
      "PostDate": "13/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/735657",
      "Title": "Getting feeling back? pas BessB"
    },
    {
      "AuthorID": "achen2iron",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81558/profile",
      "Content": "Jun 10, 2009 11:11PM achen2iron wrote: ssimmons, I agree with everyone above in saying that you need to meet with the oncologist before your surgery. You should also ask about the oncotype dx testing, Unfortunately they need to have the tumor to do the test but if you are premenepausal ER/PR+ her2-/neu and node negative then you may not even need chemo. Just another thing to consider in this process.",
      "MessageIndex": 14,
      "PostDate": "10/06/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/735600",
      "Title": "Am I choosing the right treatment? ssimmons66 achen2iron"
    },
    {
      "AuthorID": "achen2iron",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81558/profile",
      "Content": "achen2iron wrote: Here's the story. Dx multi IDC 1.4, 1, .9. Before surgery was told by both bc and onc that if I had my ovaries out during recon. surg. would be able to avoid chemo. We already knew about the mult focal from my lumpectomy.  Imagine my suprise when I went to see my onc, last Thurs. thinking I was just going to decide between tamox and an AI and he said \"well we'll be starting chemo next week\" WHAT! he said because of my age and the multi focal I should have it. Anyway now I'm all muddled because when I balked he said if I didn't really want to to it, I didn't have to. Anyway have a call in to bc and am lined up to do onc DX but still wondering if I should just go ahead with the chemo. I'm also looking for another onc. because I think the current one and I have some sort of communication problem. Is there already a thread about this somewhere? Thoughts? Thanks IDC multi focalX3 R and LCIS multi focal L Bilat. mast. TRAM, ooph and hyster Oncotype 15 Started tamox 6/09 for 2 years then AI. Dx 3/12/2009, Stage I, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "26/05/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/734805",
      "Title": "Multifocal IDC and chemo achen2iron BrandonMom"
    },
    {
      "AuthorID": "achen2iron",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/81558/profile",
      "Content": "achen2iron wrote: Hi Ladies, I am 5 days post op from bilat mastectomies and tram and would be practically pain free if it wasn't for my swollen aching lower back and constant heart burn. None of the surgical sites hurt at all. How long does this last? I've been trying to stand/walk for 1 out of three hours am I doing too much or not enough? Thanks IDC multi focalX3 R and LCIS multi focal L Bilat. mast. TRAM, ooph and hyster Oncotype 15 Started tamox 6/09 for 2 years then AI. Dx 3/12/2009, Stage I, Grade 2, 0/3 nodes, ER+/PR+, HER2- Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "27/04/2009",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/733201",
      "Title": "Swollen back and heartburn achen2iron 2z54"
    }
  ]
}