{
  "AuthorID": "Acie",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
  "Posts": [
    {
      "AuthorID": "Acie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
      "Content": "Jun 20, 2016 07:51AM Acie wrote: I am getting my port today. Not thrilled about it, but my onc team acts like its the best thing since sliced bread. So yay me! Bone and CT scans tomorrow, echo Wednesday. The best part of this week is I am going to take off Thursday and Friday and go have a fun long weekend with friends. I am so looking forward to that. Then I start chemo. In the mean time I am trying to find a wig and figure out what kind of head coverings I will actually wear on a daily basis. Any advice in that department would be greatly appreciated. I work from home do I mostly need around the house stuff and things for social activities. To FeMichelle, I am glad to hear to have choices (I'm a little jealous!) and I am sure you will get great guidance and make the right decision. I was not given any choices really. I was told chemo is the only place to start for me. I assume its because if my aggressive triple negative cancer. Best of luck to you. Keep in touch.",
      "MessageIndex": 15,
      "PostDate": "20/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Acie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
      "Content": "Jun 20, 2016 10:50PM Acie wrote: happy (early) birthday sschreier! the port went fine... Very Long day and I'm in a little pain this evening but my team felt it was important and that I would in fact \"love\" it. Haha! No love yet. But I am willing to give it a chance. I need 4 treatments every 2 weeks then 12 weekly, so I may have more need of the port than you. I am very concerned about losing my hair but even more concerned about the time it takes to grow back. But I am getting used to the idea. I even tested one of my scarves already and thought I looked pretty good in it. To me its just something I have to accept. I plan to shave my head as soon as the hair starts falling out so probably between my first and second sessions. I am sure that will be a hard day. ",
      "MessageIndex": 24,
      "PostDate": "20/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Acie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
      "Content": "Jun 20, 2016 03:17PM Acie wrote: sschreier... I am so glad you posted. It is all so scary, but it's so nice to know we are not alone. Though I a, new I feel welcomed already. Don't feel like you have to be strong all the time. You will be stronger if you let your fear and weakness out from time to time. At least that's how it's working for me so far. I also used some anexity imedication for a few days. That really helped. But I am already reducing how much and when I take it. I am on my way into surgery to have my chemo port put in, so I have to go soon but let's all keep talking here. It makes me feel so better to know I am not alone.",
      "MessageIndex": 21,
      "PostDate": "20/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Acie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
      "Content": "Jun 21, 2016 06:00PM Acie wrote: FeMichelle, I hate to hear that you feel so clueless. I definitely feel that way at times because this is so new, but I am also working to stay informed. You can do the same. I started a notebook for all the contact info and notes. I jot down questions and make sure I get answers. I also keep track of dates, locations, and outcomes of every test and appointment. I take it with me to meetings and use it when on the phone. I also ask for copies of all my tests and take those with me to every meeting and appointment. I am finding that the lab reports in the on-line portals is incomplete so I get the full reports from the doctors. Don't be shy about asking questions and making sure you are comfortable with the doctors involved and their plan for you. Your best treatment plan could be a different order of events than mine or anyone else's (I won't see my surgeon for another 5 months because they want me to do chemo first). But I learned from my surgeon and my oncologist that they both agree with this protocol. Someone on your team should be able to explain your big-picture plan. Make sure you understand the benefits and disadvantages for each decision you make.  I hope this helps. You can do this.",
      "MessageIndex": 26,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Acie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
      "Content": "Acie wrote: I got my diagnosis Thursday (invasive ductal carcinoma 2.5cm). I had a 3rd biopsy this morning, on a lymph node. (First 2 were the cancer and a radial scar). Should know more on that lymph node soon. Waiting stinks. Seeing a surgeon on Wednesday. I'm a little lost to say the least. I am trying to work but doing a crappy job. I am trying to be strong but mucking that up, too. I know I will get through this, but have not found the path yet, and I am not used to needing help but know I need some. Dx 6/9/2016, IDC, Right, 2cm, Stage IIA, Grade 3, ER-/PR-, HER2- Chemotherapy 6/27/2016 AC + T (Taxol) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "13/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Acie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
      "Content": "Jun 15, 2016 11:55PM - edited Jun 15, 2016 11:56PM by Acie so I learned today I am triple negative, grade 3 and starting chemo in 2 weeks. I really thought I was going to get to start with surgery like my friend who had BC. Very disappointed this evening. Now I need to get ready for 5 months of chemo. Some wine helped my attitude but that's temporary.",
      "MessageIndex": 8,
      "PostDate": "15/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Acie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
      "Content": "Jun 13, 2016 06:21PM - edited Jun 13, 2016 06:34PM by Acie Thanks for the kind words. I really appreciate it. Thanks also for the tip about respiratory illness. I have been fighting a sinus infection for several weeks and been wondering if I should go to the doctor or not. Sounds like a trip to the doc is in order.",
      "MessageIndex": 4,
      "PostDate": "13/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/845144",
      "Title": "I'm new to this Acie sschreier"
    },
    {
      "AuthorID": "Acie",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/234547/profile",
      "Content": "Jun 21, 2016 03:14PM Acie wrote: I was diagnosed June 9, 2016. I saw my surgeon and my oncologist on the 15th. I had surgery to put my chemo port in on June 20. Bone and CT scans on June 21. I see the onc again tomorrow (June 22) and get an echo cardiogram too. The plan is to start chemo June 28th. Feels very fast, but all the doctors seem to agree on this protocol. I am also glad to not be sitting around waiting and worrying.",
      "MessageIndex": 29,
      "PostDate": "21/06/2016",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/844902",
      "Title": "How long after diagnosis did you have to wait for treatment? Blueorange nye1980"
    }
  ]
}