{
  "AuthorID": "adagio",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
  "Posts": [
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 8, 2012 09:47PM adagio wrote: mamabr - how has your chemo been for you. Did you have many SEs from the AC? I am curious since that is what I will be having starting November 20th.",
      "MessageIndex": 1357,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/788985",
      "Title": "Starting Chemo July 2012 teeballmom SusanHG123"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 26, 2013 12:22AM adagio wrote: I had my first radiation treatment this morning. It went OK. I don't have any cream yet, so I guess I should go out and buy some. I am apprehensive about the whole thing to be honest.",
      "MessageIndex": 249,
      "PostDate": "26/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 27, 2013 12:55AM adagio wrote: Tammy - did you not put the cream over the incision area? I put the cream all over the breast area and in the armpit. The incision feels so weird (bumpy, lumpy) that I hate touching it. It doesn't hurt though. I had my 2nd treatment today - still a long way to go.",
      "MessageIndex": 257,
      "PostDate": "27/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 2, 2013 04:27PM adagio wrote: RMLulu - I don't see my RO for 6 weeks after last rad. Oh well, if I  have a concern I know that I can phone them. My skin is so much better today - the redness is settling down. No peeling yet, but I am to expect that according to RO. So happy Cindy, that you have this behind you - your skin will be just fine. Thanks for all of your support and encouragement. Do take a 4 week break before starting Tamoxifem - you deserve a very good break. Take care.",
      "MessageIndex": 313,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 7, 2013 09:55AM adagio wrote: Cynthie - I am very interested in the German approach to radiation. I recall one woman on this bco site saying she was in a trial of using no creams or lotions during radiation. I start radiation in 3 weeks time and I am just starting to research what to do. My cancer agency said to use non alcohol cream and no oil whatsoever. I am not planning on showering at all during radiation - just a bath from the waist down. I would consider not using anything at all - do let us know how your radiation treatments go and if you use creams or not.",
      "MessageIndex": 220,
      "PostDate": "07/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 8, 2013 11:55AM adagio wrote: Cindy - we have a Horseshoe Bay here in Vancouver, British Columbia.  Thanks for all the feedback - I think I will head out for a few soft cotton tank tops. I don't plan on wearing a bra at all during radiation (small breasts) so no hassle in terms of needed support. One website that I googled gave a few suggestions from ROs - one suggested filling a thin sock with cornstarch (and tying the top) and putting it in your armpit during sleep and another one under the breast - the idea is to avoid skin on skin contact during the radiation - she believed that the skin on skin was in and of itself an irritation to the radiated tissues. Has anyone else read about this - it sort of makes sense to me.",
      "MessageIndex": 229,
      "PostDate": "08/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 9, 2013 11:32PM adagio wrote: Tammy43 - I was told not to use oil either, but if you read all the ingredients in the creams they recommend there is oil in one form or another in them plus a lot of other chemicals that I can barely read or pronounce! My technician said that the important thing is that the skin is moisturized and NOT GREASY during the actual treatment.  I stayed away from oils for the first week, but didn't feel good about the other \"junk\" in the creams, so I just wanted something pure with no additives. I guess I will take responsibility if things don't work out for me. Thanks for the heads up, though. I'd love to hear input from others about oils on the skin.",
      "MessageIndex": 289,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 9, 2013 10:00AM adagio wrote: Saw my RO today and she said to start expecting redness and tightness anytime after the halfway mark which for me is tomorrow. I tried kukui nut oil on my breast over the weekend and it soaked in nicely and isn't messy, so I am doing kukui oil at night, and lubriderm after the radiation treatment. Last week I had itching, but no itching the past few days. I am 9/20 - last 4 will be boosts.  Wishing everyone speedy healing and good sleeps at night.",
      "MessageIndex": 285,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 11, 2013 12:13AM adagio wrote: Cynthie - how scary is that about our protection?  Some things are best left unknown, I guess. But I always ask a lot of questions too. What a good idea about the old t-shirt squares. I tried putting a handkerchief under the breast yesterday, but it didn's stay there - perhaps I will have to start wearing a bra to hold it in place. I am trying to avoid the skin on skin contact which I have heard can be an aggravation.  You are halfway tomorrow - congrats - and hang in there. Love the \"shades of Gray\" - made me chuckle!!",
      "MessageIndex": 293,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 1, 2013 08:51AM adagio wrote: I use a sock filled with cornstarch and put it in my armpit during sleep. Got this idea from an internet site - have only had 4 treatments so don't know if it works yet or not. I like the idea of the heartshaped pillow - perhaps I will look for one of those.  Sorry to hear about burned skin and peeling - my sympathies are with you. I am dreading this leg of the journey!!",
      "MessageIndex": 266,
      "PostDate": "01/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 18, 2013 09:45AM adagio wrote: Great question on the white cell count. I had a blood test done about 2 months after my rads ended and they were within the normal range - however - a bit on the low side of normal which I wasn't happy about, but the MO seemed just fine with it. ",
      "MessageIndex": 361,
      "PostDate": "18/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/783321",
      "Title": "A rad onc weighs in on radiation \"burns\" Spinnerpom 53nancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 15, 2013 07:19PM adagio wrote: lago - beautiful photos of you and your hair transitions. You look lovely in everyone of them. I would have to say by looking at the dates on the photos that I think your hair came in very fast!!",
      "MessageIndex": 19154,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 15, 2013 01:09AM adagio wrote: Hi everyone - on a different topic - did anyone experience dents in the finger nails during chemo? I have dents and the nails are discoloured and I can see the nailbeds - none of the nails are loose yet. What is everyone else's experience regarding the nails?",
      "MessageIndex": 19146,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 5, 2013 01:20AM adagio wrote: Goldie - I am 5 months PFC and my hair is about one inch long and it is totally white all over!!! I keep waiting to see darker hair appear, but nothing yet. This is a shock for me - but it is lovely and soft and tight little curls. Each morning I am still taken aback when I look in the mirror! LOL",
      "MessageIndex": 19426,
      "PostDate": "05/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 15, 2013 01:06AM adagio wrote: Can anyone give input regarding eyelashes and eyebrows? I am 6 weeks post chemotherapy and just lost my eyebrows and eyelashes this past week - naively thought I would keep them!!! Now I am curious as to when to expect them to grow back in. I have no hair yet on my head - can't wait - getting so tired of the bald head!!",
      "MessageIndex": 19145,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 22, 2013 01:10AM adagio wrote: Dianarose - your hair came back very fast. I am going to check out if Nioxin products are  available in Canada. I can't wait until my hair comes back!!! Did you lose your lashes and brows? Have they come back yet? I agree with the other poster - you look great in the picture with your grandaughter - very cute!!",
      "MessageIndex": 19186,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 26, 2013 12:00AM adagio wrote: starynights - I had my last chemo on March 1st  so that's about 5 months ago and I have about three quarters of an inch on the sides and about 1 inch at the back. It is quite slow, but I don't feel hairless any more. Once my hair was a quarter to half an inch, I used some hair product in it which made it seem longer and I just made the decision to not wear any more headcovers - it was so liberating!! The biggest shock for me is that my hair has come in snow white - that is taking some time to get used to. Be brave and just do it - it will seem really weird at first but you will quickly get used to it. And my daughter helped me put it in perspective - she said \"Mom, don't worry about your hair - everyone is so caught up in how their own hair looks, that they won't even notice yours!\"",
      "MessageIndex": 19396,
      "PostDate": "26/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 29, 2013 08:59PM adagio wrote: My hair is coming in snow white - what a shock!! Will this change? Who knows. And yes there are lots of curls, but I did have curly/wavy hair before so not such a surprize.",
      "MessageIndex": 19349,
      "PostDate": "29/06/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 9, 2013 01:08AM adagio wrote: I am 4 months post final chemo, and just saw my MO who said that putting colour in my hair would be just fine. My hair has come in snow white and it is still a shock every time I look in the mirror. I most likely will colour it but will wait for it to grow a bit more. Everyone tells me how nice it is, but I think they are just trying to make me feel better!! On a similar note - my friend who was quite white/grey (had been since she was 35 years old) - after chemo her hair came in dark and straight. So go figure!!",
      "MessageIndex": 19359,
      "PostDate": "09/07/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/707348",
      "Title": "Hair Hair Hair - Another question Deen Krose53"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 14, 2012 10:36PM adagio wrote: Dakota - have you had any chemo yet? I am glad to know that I am not totally alone without a port!! My oncologist didn't even look at my veins - but she said that having a port is like having a foreign object in the body and sometimes the body tries to reject it. I feel that way about the chemo drugs - they are a foreign substance to our body and that is why we get so sick because our body is trying to reject them.  I am so glad I found this site and the wealth of information from women who have travelled the road that I am just about to embark on.  txjunebug - wow, a christmas tree decorated already!! I haven't even thought about christmas yet, but I definitely should. Good luck for the first chemo - let us know how it goes!! TriciaM - do you know why they don't use the arm on the side of the surgery?  Maryah - the port definitely would be convenient for you with travelling - am impressed that you can still travel while having chemo!!",
      "MessageIndex": 305,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 16, 2012 12:44AM adagio wrote: Tricia - I think you are having chemo because you are a stage 3 which is the most aggressive kind of cancer cells. I am surprized that you have a port considering you are only having 4 treatments though. I am having a total of 8 treatments and have no port!! I have osteoporosis and the oncologist didn't think this was a factor in getting the chemotherapy - although I have read that the corticosteroids are hard on the bones.  I have considered refusing the chemo, but because of the aggressive nature of the cancer, I think it is the best option. I will also have all of the radiation.  Hang in there - lots of women have done it before and we can do it too!!",
      "MessageIndex": 337,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 16, 2012 12:48AM adagio wrote: marian - good to know that you have minimal side effects from the neupogen. Congratulations on making it to round #3 already. How is your appetite?  I always enjoy reading your posts - you have such good things to say!",
      "MessageIndex": 338,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 25, 2012 11:38PM adagio wrote: To prevent mouth sores, I rinse with baking soda after eating, then I swish a mixture of glutamine in water and swallow it. Apparently glutamine is effective in children receiving chemo to prevent stomach issues and mouth ulcers. So far I have had no issues.",
      "MessageIndex": 639,
      "PostDate": "25/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 30, 2012 12:29AM adagio wrote: Hoping someone can help me. I had my first chemo last week and took 5 neupogen shots. Went for blood work today in prep for my next round, but my white cell count (neutrophils) are 0.3 - so the oncologist said they are dangerously low to even consider giving the next chemo. So I am now hold for over a week until I get them checked to see if they have come up. Any feedback as to what the protocol is regarding chemo and low blood counts. All my counts are very low. I am mystified!! Look forward to hearing others experiences.",
      "MessageIndex": 776,
      "PostDate": "30/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 5, 2012 12:16AM adagio wrote: Oat bran works wonders for bowel movements and it tastes delicious!! Just cook about one third of a cup and double the amount of water in a small pot on top of the stove - takes only a few minutes. Add a dollop of honey and a little bit of cream and enjoy. Makes a great snack and definitely does the job. I wanted to avoid the constipation at all costs, so this and drinking ginger/lemon tea with honey in it worked well for me.  I saved the remainder of the oatbran in the fridge and then just heated it up in the microwave when I next used it. It is definitely worth a try. ",
      "MessageIndex": 914,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 15, 2012 03:38PM adagio wrote: Good morning everyone! I took my 7th Neupogen shot yesterday and last night I was hit with the most excruciating bone pain in my lower back and central chest. I could barely breathe!! I tried to relax and tell myself it would pass, but it didn't and I ended having to phone the help line. The nurse got a doctor to call me and she told me to take 2 Tylenol 3's, and one extra strength Ibuprofen. They worked in about 35 minutes and I was able to go to sleep. I had to take the same again at 3:15am and then again this morning at 10:15am.  I have never experienced such bone crushing pain in my whole life - sure don't want that to happen again. And it seemingly came out of nowhere - last time I had absolutely no side effects from the Neupogen. Go figure - so what I am learning is that the only thing predictable about this Breast Cancer treatment plan is it's unpredictabilty!!!",
      "MessageIndex": 1160,
      "PostDate": "15/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 22, 2012 08:21PM adagio wrote: HI Ladies, I am new to this forum. I saw my RO today and she explained to me about the Deep Breath technique for moving the heart and lung out of harm's way. I do worry about the effect on the heart and lung and the ribs. Would love to hear more on this discussion about L sided breast radiation. I guess it is a bit like chemotherapy - we just don't know what side effects we are going to have to deal with? Everyone is so different. Has anyone ever refused radiation? I am triple negative, currently on chemo DD AC/T, then I will do radiation for 20 times. This whole thing scares me a great deal. It is all a risk no matter what decision we make!!",
      "MessageIndex": 18,
      "PostDate": "22/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/794806",
      "Title": "External Full Breast Rad Side Effects/Risks (During & After) NSJ2 SelenaWolf"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 23, 2012 01:13PM adagio wrote: Great feedback!! Good to hear that others have gone through it without the horrid effects that sometimes get portrayed as being unavoidable. I believe the techniques today are quite different to years ago and there is less chance of permanent damage to other organs.  I have come to the conclusion that everything is a risk. Even leaving the chance of a few stray cancer cells roaming around our bodies is a big risk because we all know that they do grow and sometimes very fast!!",
      "MessageIndex": 23,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/794806",
      "Title": "External Full Breast Rad Side Effects/Risks (During & After) NSJ2 SelenaWolf"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 11, 2012 07:31PM adagio wrote: Sassa - I wouldn't know if I was allergic to yew trees!! Lucky for you that you did. I have read that Taxol is particularly effective for triple negative, but somehow, the thought of it gives me the creeps - possible neuropathy, anaphylactic shock, serious allergy to the solvent in which it is given. I have time to make the decision whether to pursue it or not. I have had only 2 A/C so far and actually, I have had a bit of tingling in my fingers even with that.",
      "MessageIndex": 2,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797491",
      "Title": "A/C chemotherapy adagio Sassa"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 11, 2013 10:45PM adagio wrote: Cindy - thanks so much for all the words of comfort and cheer - you're the best!!! Wishing you speedy healing also and a nice break on Saturday and Sunday. Let me guess you have done around 22 treatments -yes?  Lemon - ouch, ouch, ouch!!! My heart goes out to you - sounds awful. Continuing to send healing and cooling thoughts your way. Just breathe deeply and get through one day at a time!! Sallyann - what horrific memories for you from your childhood - wishing you healing for that also. Mothers are so precious. Allow the tears to flow - there is healing in tears. Whatshesaid - please keep us updated on your progress and what your plan is regarding your last two treatments.",
      "MessageIndex": 200,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 15, 2013 01:32PM adagio wrote: duckiedee- welcome to the forum - you will learn lots from the ladies here!! I cannot speak about the seroma - never experienced that - but hopefully someone will come along who can help you. Congrats on finishing chemo - it is truly a milestone and an achievement - well done! Now relax and enjoy the break in between chemo and radiation. Good that you are taking time away at the beach to rest.",
      "MessageIndex": 232,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 23, 2013 12:52PM adagio wrote: I am finished ALL radiation treatments - my dancing shoes are red just like Cindy's, and the colour of my breast!!! I am so relieved to be done. Now I have to reinvent my life. Since I am triple negative, I don't have to deal with hormone treatments, so one less thing for me to think about. Thoughts are with all of you still going through treatments and those who have still to start. You will be fine - the time goes very fast.",
      "MessageIndex": 299,
      "PostDate": "23/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 26, 2013 12:15AM adagio wrote: queenkong - that sucks getting shingles on top of radiation burns. You poor thing - what a horrible thing to have happen. I am sending healing thoughts your way and hope for freedom from pain and itch. lemon - so glad that you are finally healing - it has been such a tough journey for you also. I agree with you that we are all changed women now - our bodies and our minds. My outlook on life is so different now - life is to be embraced - there are no guarantees. Enjoy each day to the best of our ability - of course - some days it will be easier to do that than others.",
      "MessageIndex": 325,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 9, 2013 12:10PM adagio wrote: My skin never actually broke down - it simply peeled off and exposed bright red new skin underneath. The new skin was very tender for a couple of days, but now it is just fine - thank God. I am remaining diligent with the mositurizing - never did feel the need to go topless - just made sure to avoid skin to skin contact. Sneaky - how is your radiation treatment going? Are you feeling any more at peace with it?",
      "MessageIndex": 422,
      "PostDate": "09/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 8, 2012 07:24PM adagio wrote: It seems like almost all of you ladies have a port  - I am starting to wonder if that is something I should have although the oncologist didn't mention it to me at all. I asked her about it and she said if I wanted one I could get one - so not sure what to think. I am getting 4AC and then 4 taxol and then there's the blood work as well. That's a lot of poking around isn't it? Are there alternatives to the port - other than the nurse looking for a vein each time?",
      "MessageIndex": 150,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 14, 2012 10:44PM adagio wrote: TriciaM - I asked my oncologist this morning why I needed to follow my chemo with radiation and she said that the chemo attacked the systemic cancer cells and the radiation is specifically for the breast area where the cancer originated. I am going to be having 35 rounds of radiation after my chemo - yikes!! This is going to be a long arduous journey.",
      "MessageIndex": 306,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 29, 2012 10:57PM adagio wrote: megan - I have had 3 rounds of A/C and after each one I have had a rash - each subsequent rash is bigger, redder, more painful and exceedingly itchy - I have it on my forearms, back of neck/shoulders, chest, and backs of hands and a tiny bit on front of legs. It is so ugly looking - bright red and blotchy and angry. I showed it to my onc and she she simply shrugged and said drug rash - but I am thinking if this is what the drugs do to the outside of my body - what is the inside like? ",
      "MessageIndex": 1409,
      "PostDate": "29/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 17, 2013 12:42AM adagio wrote: Sneaky - I too have had my fair share of different side effects from A/C - rather than not have a treatment my oncologist reduced the dose to 75% and it made quite a difference. We came to the conclusion that my body is very sensitive to chemo - and I had considered quitting and not going through with the taxol, but after the MO explained the added benefits of taxol, I decided to go ahead but  I am starting the taxol at 80%, and then she will reduce it accordingly depending on the  side effects that I get. She even suggested that doing only 2 of the taxol would give me an added benefit.  So if you do decide not to do #4 of A/C - I think that you will have had considerable benefit from the 3 rounds that you did. Hopefully taxol will be much easier on you and even if you only do a couple of rounds of it - it attacks the cancer cells in a different way. Just my two cents worth!! Good luck with your decision - it is challenging - I always come away from my chemo and say that's it - no more - but some little voice keeps saying - you can do it!!",
      "MessageIndex": 1634,
      "PostDate": "17/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 17, 2013 01:21PM adagio wrote: soteria - I also have a son with type 1 diabetes - so know all about the shots. My son was diagnosed when he was 19 years old - so he was able to do his own shots right from the start - but believe me - I would have taken every shot for him if I could. It is tough to watch the young ones with a lifelong disease - but I am amazed at my son's cheerful outlook on life - it doesn't seem to hold him back - he is a true inspiration to me. Hope your leg is feeling much better.",
      "MessageIndex": 1849,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 5, 2012 08:40PM adagio wrote: FriendGwen - nice to know that someone else does not have a port. The chemo nurse used a vein on the back of my hand and there wasn't even a bruise!! I am having my 2nd round tomorrow, so we will see how that one goes. How many treatments are you having in total. I am scheduled for 8 rounds - 4 of A/C and then 4 of Taxol. My MO is of the opinion that a port is a foreign object in the body and that our body often tries to reject it. If I can get away without the port, I will be happy since I don't exactly like the idea of a further procedure!! Good luck with your first chemo and keep up the walking - it helps a lot.",
      "MessageIndex": 175,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 13, 2012 04:56AM adagio wrote: Erin - be sure to take your anti-nausea meds exactly as prescribed. This will make a big difference in terms of the nausea. I felt quite bad for the first 3 days during round #1, but round #2 - I felt nausea for 5 full days. Each treatment will be different, but it is a good idea to talk to your onc and they will give what they think is best. I take Zofran every 8 hours and it works for me although it can be constipating. I also use gravol suppositories and they are helpful. Losing the hair is very emotional - I just got mine shaved off today and it was tough!!! It really hits home that I have cancer when before it seemed like a bad dream. But I have to remind myself that the hair will grow back and in the grand scale of things it is a minor issue, really. I am also on dose dense and have to give myself shots of Neupogen to keep the white blood cells up - doing chemo is one of the hardest things I have ever had to accept - but taking one step at a time is beneficial. I wish you well on your new journey and once treatments start - somehow it just doesn't seem as bad. The thought of it is always a lot worse. Do you have a port for your infusions? I don't but most women do get one. I have mixed feelings about it, but so far so good without it for me. Let's hope my veins hold up. Enjoy the next few weeks!!",
      "MessageIndex": 308,
      "PostDate": "13/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 3, 2013 02:51PM adagio wrote: Just got back from MO appointment - she felt both breasts and lymph nodes in armpits and collarbone area for lumps - all feels fine! She also checked my spine for pain because she said that is a favourite area for breast cancer to settle - she said that there would be a gnawing pain if there was cancer there and no medication would ease the pain - that would be awful! No bloodworm, scans or anything else so I guess it is good. Liefie - I too love relaxing breakfasts! I am guessing that S.Africa will be quite lovely in December - a great time for a wedding. I got married December 18th! Edi - my surgeon discharged me a long time ago - in fact I only saw her once after the lumpectomy and that was it! Do you get any bloodwork or scans done? Tonight I am going to a choral workshop - it is focusing on breathing technique and evidently will incorporate some yoga moves - should be interesting. Liefie and Morwenna - thanks for reminding me about the step counting - I should get mine out especially since I did put on about 7 pounds while I was away! Nihahi - how lovely that you can attend the funeral of Websister's Mom.",
      "MessageIndex": 5051,
      "PostDate": "03/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 8, 2013 11:50PM adagio wrote: websister - did you go to your usual hairdresser? I wonder if they cut the hair any differently when it has a chemo curl in there? I have heard someone say that if the hair is correctly cut (cutting into the curl, whatever that means) the curls will stay longer. Mine is getting a bit unruly, but dreading the first cut!",
      "MessageIndex": 5119,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 16, 2013 06:32PM adagio wrote: benny - so sorry to hear about your mammo result - big hug to you. I totally appreciate and understand every sentiment you wrote in your post. This is so awful and very discouraging. We are all here for you - so rant as much as you like. Warm thoughts and prayers coming your way. Please accept Nihahi's offer of help - don't go it alone. Everyone needs somebody. Hugs!!!",
      "MessageIndex": 5216,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 19, 2013 07:57PM adagio wrote: Morwenna - the pics of Canmore are stunning. We camped there many years ago and I do recall how beautiful it is. Benny - good news about the mammogram - it is sounding positive for you. However , it must be a downer having to have the biopsy done. I am going for my very 1st post treatment mammogram this coming Monday and I am absolutely dreading it!! Mom of 2 - Thanks for letting me know what overlays are - they say we learn something new every day - good luck with those !! Sounds like fun. Edi - nice pictures of beautiful sunsets. Glad you had fun dancing and good for you to do it. how is the hip? Liefie - you are getting to meet so many new people from the web site - that's great. Enjoy the rest of your weekend, ladies.",
      "MessageIndex": 5280,
      "PostDate": "19/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 20, 2013 07:44PM adagio wrote: Hi all - to those who had a lumpectomy - did the first mammogram post treatments hurt? I am going for mine tomorrow and just pondering whether to take some pain meds before hand or just hope for the best! Any insight would be appreciated. Mom of 2 - the waiting for surgery is very anxiety producing - will be in your pocket for sur this coming Wednesday - until then, try to keep your mind as occupied as possible so that it doesn't imagine the worst. Edi - I am with you on your feelings about the TN thread - it has been very depressing of late! Morwenna - beautiful story about the lake - your trip is bringing back all kinds of memories for me when we lived in Alberta - we did a fair amount of camping around Banff and Jasper - amazingly beautiful part of our great country!",
      "MessageIndex": 5317,
      "PostDate": "20/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 22, 2013 10:22PM adagio wrote: momof2 - in your pocket tomorrow! Think of the raft and the loving circle around you.",
      "MessageIndex": 5361,
      "PostDate": "22/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 23, 2013 11:00PM adagio wrote: momof2 - good to hear from you. Take as much meds as you need to make you comfortable. Hope you get to pee soon - think running water and breathe deeply enough to relax the sphincter around the bladder. Prayers continue to be with you!",
      "MessageIndex": 5390,
      "PostDate": "23/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 15, 2013 04:01PM adagio wrote: Oh my goodness - I just arrived back home, and catching up with news and learned about Carla - this is so shocking and so depressing!! How can this be? I need some time to process this kind of \"news\"!! May Carla rest in peace free from pain - my thoughts and prayers are with her family during this very difficult time.",
      "MessageIndex": 5670,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 19, 2013 07:45PM adagio wrote: liefie - have a safe and wonderful trip to Stellenbosch. It should have warmed up quite a bit by now. Hope the wedding goes smoothly and that you have a fabulous time. Relax and enjoy - you deserve it!! Edi - sounds like you are a natural chorister - conductors love it when we are out of our music!! Hope then specs get fixed soon. Mom of 2 - glad to hear that things at moving along - will be in your pocket tomorrow for your MO visit. Websister - sorry to hear about the fatigue - let us know what your doc has to say about it. Rest when you need to - you have been through a lot! To everyone else - hope your week is going well.",
      "MessageIndex": 5723,
      "PostDate": "19/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 20, 2013 02:05PM adagio wrote: Momof2 - so sorry you have to go the chemo route - triple negative is a beast and the worst part is not even the experts know how to treat it, so you are so right in saying that it is a crap shoot. Good luck with your decision - I was not given a choice as to what chemo drugs I got! Like Dakota said it is tough, but with all the help from people here on this forum, you will get through it one treatment at a time. Life is just not fair!!",
      "MessageIndex": 5733,
      "PostDate": "20/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 29, 2013 12:23AM adagio wrote: So sorry to hear about Benny's loss - that is a very difficult thing to process and no doubt she will need lots of time - we become so attached to our animals, and losing them just tears us apart. Hugs to you Benny if you are reading. Thanks to Morwenna and Websister for taking care of Benny. Have a great weekend everyone. Mom of 2 - hope you are OK! Edi - how was the singing at choir the other night? I have been going shopping with my daughter looking at wedding dresses for her big day which is next August - that's how I will be spending my Saturday - lots of fun!",
      "MessageIndex": 5825,
      "PostDate": "29/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 1, 2013 09:55PM adagio wrote: Morwenna - try not to think the worst! I know it is very hard - but it is something which we have to keep working on continuously. I find I have to keep myself really busy in order for my mind not to run riot. I am sure your thyroid will be just fine. Do you feel more tired than usual? Your dream from the other night sounds more like a nightmare!! Hugs to you! What Facebook page is your choir on - I would love to have a listen. Edi - since I am not on a breast cancer face book page, I didn't know it was your birthday - sounds like you had a good day. Happy birthday - you are still young! Glad to hear that your Christmas bazaar went well. Hope your Chinese dinner was good - I used to love Chinese food, but have gone off it recently. Momof2 - keep on resting up - you will be fine! Thanks for your cheerful spirit. Jackpot - welcome! Nihahi - bet you had a blast with your girl friends. Movie - will be in your pocket for your upcoming surgery on Tuesday - hope all goes well.",
      "MessageIndex": 5868,
      "PostDate": "01/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 1, 2013 10:47PM adagio wrote: Morwenna - just checked out the Facebook page and I listened to the YouTube clips. Very impressive - I think I can pick out - are you in the back row on the left hand side (looking towards the stage )? Your chorus sounds great !!!",
      "MessageIndex": 5870,
      "PostDate": "01/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 2, 2013 10:57AM adagio wrote: nihahi - how can you be so disciplined about desert? Wish I had that discipline - I love deserts of all kinds and always have them. LOL",
      "MessageIndex": 5879,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 3, 2013 01:59PM adagio wrote: Hi to everyone - it is a glorious sunny but cold (3 degrees Celsius) day here in Vancouver. This is a bonus because in the wont we generally get a lot of rain - took the dog for a nice long walk and it was wonderfully restorative! Morwenna - glad you are home safe and sound. Nihahi - your words of wisdom about going to the dark places were very helpful. Edi - enjoy your singing. How awful for your son to have to change his job - but as you say at least he has a job - still, something like that can be hard to deal with. Momof2 - prayers for you today, hope all goes well. Liefie - if you are reading - missing you on here and look forward to your return. Bet you are having a blast. Jackpot - that would be so cool if you and Edi could meet up and have coffee together. Hope you are feeling better today. Websister - so glad that you had a good time with your grandchildren. My son and his family are coming from Quebec next week so I get to see my grand kids every day for a whole week - it is exciting, but I know it will also be exhausting - 6 month old and a two and a half year old. Yikes!! Jennie - some days just seem to be very emotional for me too - it is very strange how it sometimes just hits us - you are not alone!",
      "MessageIndex": 5899,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 4, 2013 12:39AM adagio wrote: momof2 - we will miss you, but I totally hear you when you say that these boards take a lot of time. I hope all goes well for you with the remaining chemo and this upcoming Christmas season. Good idea to make out a list of questions to ask - hope you get relief from the bone pain! I did take Claritin son the day of the shot and for about 5 days after - it did help me.",
      "MessageIndex": 5910,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 3, 2014 03:29PM adagio wrote: Edi - I went for my very first haircut just 4 days ago - it was so sad to see all the beautiful white curls lying on the  floor - but it was time, because the hair was getting on my nerves and it had no shape. Now it is shaped nicely and the curls are still there - what a surprise! Your grandchildren are beautiful - lucky you! Glad you are feeling less tired. I am off to Hawaii for 6 days to rest up and relax after the Christmas madness. Say hi to Jackpot for me! Liefie - welcome back - hope you are over the jet lag - it takes a while!",
      "MessageIndex": 6101,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 3, 2014 09:23PM adagio wrote: jackpot - I think almost everyone gets curls after  chemo - some of course do not. And some people's curls last for a long time - others loe th curl pretty quickly - we are all so different. I like my curls, but I have a friend who hates hers and tries to straighten it! I wonder  what you will get. So glad that you are meeting Edi . Hope you are starting to feel much better after the taxol.",
      "MessageIndex": 6106,
      "PostDate": "03/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 20, 2014 12:03AM adagio wrote: Edi - is the survivor's thread that Jackpot told you about on this website or is it something completely different?  I go for my 3 month check up with my oncologist this coming Thursday - hoping for good news. I am glad to say that I feel well - however, we all know that is not always a good indicator of what is going on inside  of our bodies. I have definitely let the healthy eating slip over the holidays and then with being in Hawaii last week, I did indulge in wine with dinner  every  night. The good news is that I have been exercising lots. Take care of yourself. Liefie - glad you are getting back into a routine after your long trip to S.A. It takes a while to recover, doesn't it?  If ever you are in Vancouver and have some time to kill, let me know and we can have lunch together or even just a coffee. I live close to UBC. Glad the newly weds are happy - I have two daughters getting married this year so I will be BUSY!!!",
      "MessageIndex": 6172,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 20, 2014 10:02PM - edited Jan 20, 2014 10:02PM by adagio Jackpot - glad the scan is clear. Good luck with the remainder of  rads - as liefie said - keep the boob well moisturized - it works! My skin held up well during rads, but about 2 weeks later all the skin peeled off - it didn't hurt at all though which was a good thing. The end is in sight - yeah!!!",
      "MessageIndex": 6178,
      "PostDate": "20/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 28, 2013 02:56PM adagio wrote: Hi everyone - I started my radiation on Monday March 25th - I have had 4 treatments and now get 4 days off because of Easter holidays here in British Columbia. So far so good in terms of my skin - it does feel a bit tender but looks the same. I am applying lubriderm in the day and calendula at night. Is everyone as scared as I am about getting blistered and peeling skin? I keep telling myself just to take it one treatment at a time. I am getting 16 regular and 4 boosts.",
      "MessageIndex": 14,
      "PostDate": "28/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 5, 2013 05:22PM adagio wrote: RMLulu - you are more than half way there - yeah!!! Enjoy your two days off. I am more than one third of the way now with 8/20 done. So far so good!! Lemon - hope you are feeling a bit better today - let us know how you are doing? Thinking of you and sending healing vibes your way. Bookwoman - congrats on being so close to finishing your rads and for not getting burnt - it is interesting how we all react so differently.",
      "MessageIndex": 112,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 5, 2013 05:53PM adagio wrote: lemon - so glad that you are feeling a bit better today. Hang in there. I don't know about the milligray measurement - but 7.8 seems a very large dose! I get 2.65 Gray each visit. Hope your weekend is a time when you can relax and heal a bit before going back next week for the final one. I wonder if some women don't complet rads because of skin reactions?",
      "MessageIndex": 114,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 12, 2014 10:57PM adagio wrote: Edi - you didn't tell us you were having cataract surgery!! Or maybe I missed that post. Sorry you ended up having a complication . I think it is generally a straightforward procedure. Ouch!!! You poor thing - sure hope your eye feels better soon, so that you are able to work on your celebration cake! I have a cataract growing on my right eye, so I know somewhere down the road that I too will have this surgery - your experience makes me not want to hurry the process. Morwenna - hope all comes back negative for you in terms of the biopsy. Momof2 - how are things  going with you? Starting to feel better I hope. When is the wedding?",
      "MessageIndex": 6436,
      "PostDate": "12/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 9, 2013 01:29PM adagio wrote: Halfway through the radiation now - 10 down - 10 to go. No redness yet although I am itchy today!!",
      "MessageIndex": 161,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 10, 2013 12:27PM adagio wrote: Pacools - thanks for the heads up regarding the pain when the boosts start. I am imagining that this varies from person to person. You are almost done with your treatments and it seems that overall you have done really well - no blisters or broken skin - that's wonderful! I am 11/20 done and so far so good - although it is starting to get itchy! My technician recommended saline soaks for itch - haven't tried it! Lisa1637 - I don't think it would make too much difference in having the number of treatments reduced a little bit. Trust your RO - they should know!! If I was in a lot of pain - I would go for it - your heart will tell you what is right for you. You will get to make the final decision.",
      "MessageIndex": 173,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 11, 2013 01:55PM adagio wrote: lemon - how is the skin today? Tell us what you are doing to help it. Must be a relief not to have to drive there every day!!! Now your energy goes into healing - eating well and keeping well hydrated!! I drink coconut water occasionally to give me a break from the regular water - it is quite a pleasant change.",
      "MessageIndex": 191,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 11, 2013 02:01PM adagio wrote: whatshesaid - not quite sure what your nurse meant about you being two thirds done. Surely with only two treatments left you are almost completely done!! Hope your breast is feeling a bit better now - let us know how you treat the burns - we all like to learn. All breast cancer treatment is a gamble and we each do what we think is best for us. I don't think your oncologist would hold it against you for not taking the last two treatments. Good luck with your decision regarding the final two treatments. Healing thoughts coming your way.",
      "MessageIndex": 192,
      "PostDate": "11/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 29, 2014 03:39PM adagio wrote: Edi - happy Mother's Day - we don't have ours here until May. DH and I are off to Vegas for a few days - he needs a break from work, and I am always willing to tag along these days - anything to take my mind of myself and the pain.  Sorry to hear about your customer's sister. I just found out last week that my sister in England has just been diagnosed with advanced cancer of colon, liver, lungs and ovaries - they have given her only a short time to live - she is already in palliative care - am hoping to get to see her after my little trip to Vegas and after my oncologist appointment on April 17th.  Just finished making my daughter's wedding invitations - it was truly a labour of love on  my part  - but they look great and she is happy with them. Have a great weekend everyone and remember to take great care of yourself.",
      "MessageIndex": 6508,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 12, 2013 11:54AM adagio wrote: TGIF - another week has gone by. Two days off from driving to rads - yeah!! I am 13/20 done - skin is getting slightly pinkish/red and the armpit is a bit tender. Planning on lots of moisturizer over the weekend and some pampering of the breast.  Healing thoughts and prayers to all of us going through the radiation - one treatment at a time - is my new motto!!! Enjoy your 2 days off .",
      "MessageIndex": 208,
      "PostDate": "12/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 23, 2014 11:16PM adagio wrote: Morwenna - so very sorry to here  of your Mom's passing - it is always hard even when it is expected. How fortunate that you were all able to be with her during the actual moment of her death - that must have been a very intimate and emotional time!  You must b so relieved that you went to spend the time with her - how special is that? Take great care and I will pray  for you and your Dad during the grieving  process, that you will both be given strength and courage.",
      "MessageIndex": 6562,
      "PostDate": "23/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 1, 2014 05:52AM adagio wrote: momof2 - my heart goes out to you - what a blow to receive such news. If that were me, I would just want to run away from everything and would find it devastating. But, hang in there - the waiting will be hard, and like Edi  said - we all immediately go to the worst case scenario which is a very dark and lonely place - so you are not alone in that regard.  You are very much in my thoughts and prayers. You will make it to Keiko cottage - believe it.",
      "MessageIndex": 6595,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 7, 2014 08:20AM adagio wrote: momof2 - in your pocket while you wait for your results - must be challenging for you especially with the upcoming wedding, and having to be upbeat for that!!! Not long now until the big day that you have put so much energy and time into - bet it will be awesome. Edi - good job on pedalling the bike and getting out for walks. Websister - have an awesome trip to Mexico - relax and enjoy! Liefie - glad you are doing well. Nihahi -  you are an inspiration! My arm is slowly feeling better - lots of new exercises which are very painful to do, but hopefully they will help my range of motion.   Love and hugs to all of you!",
      "MessageIndex": 6617,
      "PostDate": "07/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 21, 2014 10:38PM adagio wrote: momof2 - stunning bride and the venue looks amazing. Bracelet is fabulous and the runner is great. Wish you could come and help me out with my 2 daughters - they are getting married 6 weeks apart!!! How will I survive that. LOL",
      "MessageIndex": 6676,
      "PostDate": "21/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 4, 2013 11:55AM adagio wrote: The skin does indeed continue to get redder after treatments end. So be prepared for it. Continue to moisturize the skin and use cooling creams to keep the skin comfortable.  Happy for all of you who have finished - isn't it a wonderful feeling? ",
      "MessageIndex": 389,
      "PostDate": "04/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 28, 2014 01:58PM adagio wrote: liefie - isn't coming home such a wonderful feeling. Hope you recover from jet lag soon and that your cold gets better completely. Welcome back.",
      "MessageIndex": 6704,
      "PostDate": "28/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 3, 2014 06:59AM adagio wrote: nihahi - I will also be there! We all need each other to survive the ups and downs that come with cancer. Momof2 - 2 bolts of tulle would sure come in handy - wish we lived closer, and I could drive over and take them off your hands! Your bedroom looks so relaxing and serene - looking at it just makes me want to lie down! Liefie - I hear you about Vegas! Fortunately for us we were in a non- smoking, no casino hotel and it was very calm and peaceful and had a lovely poolside. Your grief is raw and grieving takes its time - allow yourself to cry and do whatever makes you feel better. I too am grieving the loss of my sister, but am so grateful that I had several long and meaningful conversations with her right up until a few days before her death. She was at peace and was ready to die - however her family weren't ready since she had 2 short months from diagnosis to death. Hugs to you during this difficult time. Edi - your cakes just blow me away - if you were here, you would be hired immediately to make 2 wedding cakes for my two daughters. I just don't have the patience for all the icing and decorating, but I can certainly appreciate the work and detail that goes into each and every cake. Sorry to hear that you are feeling low - I think it comes with the package of cancer, and we all must resist the temptation to let ourselves go to the depths of despondency. (I speak for myself here).  It is now 4:55am - so heading back to bed to catch a few hours before getting up to start the day by sitting with open hands and heart to connect with all of you ladies - it is also my birthday today - so guess there will be a little celebration!  Hugs to everyone!!!",
      "MessageIndex": 6726,
      "PostDate": "03/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 30, 2014 11:43AM adagio wrote: Morwenna - congratulations on competing in the dragonboat festival - the roses on the water must have been a very moving experience! Lovely photo - are you on that boat?",
      "MessageIndex": 6845,
      "PostDate": "30/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 4, 2014 12:39AM adagio wrote: websister - wishing you a speedy recovery from your torn ligaments - sounds painful! Your family life sounds super busy - you will be glad for quieter days. How do you manage to work and do all that - no wonder you get so tired! My busy days are all ahead of me with #1 daughter's wedding just 4 weeks away now - just doing final things but mostly it is all organized - thanks to my super efficient daughter. Now I have to start shopping for a dress! We also have lots of out of country family coming from the U.K. and  Mexico. So it will be crazy busy - unlike Liefie, I am not planning food ahead of time - hoping that everyone will pitch in.  Liefie - I am impressed at how organized you are with all your preparation for visitors coming. It will be a super busy, but fun time for you, and how lovely that everyone will be here to celebrate your 60th birthday! So glad that you are healthy and well to enjoy it. Edi - do let us know as soon as you hear your results from the scan. You certainly deserve a nice long break, and I hope you go somewhere really nice! Happy 4th July to all our American ladies - enjoy the celebrations!",
      "MessageIndex": 6857,
      "PostDate": "04/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 21, 2014 07:22PM adagio wrote: websister - you sound so calm - I would be freaking out a bit not knowing what they see on those scans! Keep us posted - hopefully they will get to the root cause of your pain and that you find  relief soon. Thinking of you and sending you warm calming vibes.",
      "MessageIndex": 6953,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 7, 2014 02:47PM adagio wrote: nihahi - you are a great inspiration to all of us. Celebrate with gratitude and joy. Thanks for sharing with us. ",
      "MessageIndex": 7137,
      "PostDate": "07/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 8, 2012 11:56PM - edited Nov 8, 2012 11:57PM by adagio marian - good question about the taxol - however, I would rather just have 4 than 12. Perhaps we are getting the same amount of the drug, but faster - at least that is my understanding. Especially if you have been told that your cancer is aggressive - which is what my oncologist said about mine (Triple negative). However, who knows?  I didn't know that AC isn't done by a drip - I guess I will learn all that next week when I go for the chemo teach. It is getting closer to November 20th and I am still quite scared even though lots of women on here have been very reassuring that it won't be as bad as I think it will.  Do you feel any fear at going for your chemo? Any fatigue yet? How about the shots - are you able to give them to yourself? Would love to know either here or in a Personal e-mail. I am off to Tofino for the long weekend so I am planning on being away from my computer - I need a break - my head is bursting with information. Just going to go and embrace the wind and the rain of Long Beach and try to forget about breast cancer for a few days.",
      "MessageIndex": 162,
      "PostDate": "08/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 14, 2012 07:36PM adagio wrote: It seems that almost everyone on here doing chemo has a port! I am starting chemo on November 20th. and I talked to my oncologist this morning about having the AC/T every 2 weeks without a port, and she said that it should be fine. I am a bit concerned about using one single vein on my good arm for everything from chemo, scans, lab work. Anybody else out there who is not having a port for their chemo. I am feeling like the odd one out here!!",
      "MessageIndex": 299,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 16, 2012 12:48AM adagio wrote: txjunebug - good luck tomorrow. Be sure to tell us all about it.",
      "MessageIndex": 339,
      "PostDate": "16/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 23, 2012 12:39AM adagio wrote: txjunebug - thanks for the hugs. I feel so much better now - change of med and a good night's sleep. No more nausea or vomiting - yeah!! Hope your sinus infection clears up soon.",
      "MessageIndex": 553,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 26, 2012 12:38PM adagio wrote: marian - hopefully I am like you and my S/Es don't intensify with each treatment - it is interesting how we are all so different, isn't it?  My thoughts are with you for your 4th treatment tomorrow - how are you feeling about it?  You will be halfway through - yeah!!! Just got back from a nice long walk in the cold but sunny morning - now off to acupuncture at Inspire Health. I will take #5 neupogen shot today, then a week off from giving shots. Hopefully the blood counts will be good. You haven't had an issue with your white cells dropping - have you?",
      "MessageIndex": 648,
      "PostDate": "26/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 4, 2012 12:00AM adagio wrote: I am day 13 after my first chemo of A/C - yesterday my skin starting itching in random spots e.g. back of neck, forearms, back of hands, knees - there are tiny little bumps but no redness. Anybody else experience this?",
      "MessageIndex": 893,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 12, 2012 09:41PM adagio wrote: Has anyone had pins and needles in feet and hands during treatment with A/C - I am hoping this is not neuropathy! It is not pleasant - it didn't happen after treatment #1 only having #2. Any thoughts/ input would be greatly appreciated. I will certainly mention it to my onc next Tuesday when I see her.",
      "MessageIndex": 1113,
      "PostDate": "12/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 5, 2012 06:00AM adagio wrote: I have heard of the picc line - but I gather both the port and the picc are quite invasive. The difference is that with the port - you can swim, shower etc because it is inside. The picc line is outside of the body and needs to be covered up to have a shower and you can't swim with it. Please correct me if this is the wrong information. I don't have either of these, so I am relying on my tiny little vein in one hand to get me through 8 rounds of chemo - not sure I will manage it, but my MO is quite opposed to the port.",
      "MessageIndex": 161,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 6, 2012 02:16AM adagio wrote: mfml - welcome to the site. You will learn lots from the women here. You are on the same regime as me - and I am due to have my 2nd A/C tomorrow providing that my white cell count is up. It dropped to 0.3 after the last chemo!!   Hope you have a good night with minimal side effects.",
      "MessageIndex": 178,
      "PostDate": "06/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 7, 2012 05:39PM adagio wrote: Hi All - What I am learning is that each treatment is not necessarily the same. My first round of chemo - I had terrible vomiting the first night (not the right meds for my body). The MO gave me a different regime for 2nd round which was yesterday, and true enough no vomiting (yeah!!). I even slept quite well. I am on Zofran every 8 hours for 3 days and I have Stemetil which I can take in between if I feel any slight nausea - so far so good. I just ate oat bran and apple sauce for breakfast - tasted yummy!  Wishing all of you minimal side effects. My hair is now starting to come out (16 days after 1st treatment) - not quite prepared emotionally for this shock - but I then read about all you amazing women and I am inspired to go with it - only a year without hair. It will grow back.",
      "MessageIndex": 197,
      "PostDate": "07/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 8, 2012 07:13PM adagio wrote: N8ture - my hair is at exactly that stage where it comes out in handfuls in the shower and every time I look in a mirror there hairs on my shoulders!!! I just had my 2nd A/C two days ago - so it looks like the shaver will have to come out today. Yikes!! Physically ready - but not emotionally ready for the complete loss of hair on my head. I ordered some hats from headcovers.com, but they have not arrived yet - so will look around my collection of hats here and hopefully find one that will do the job until I get the cute ones. I will not have my wig for another 12 days - sigh!! I just couldn't get motivated to get out there and go for the consult any sooner.",
      "MessageIndex": 210,
      "PostDate": "08/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 14, 2012 07:37PM - edited Nov 14, 2012 07:38PM by adagio",
      "MessageIndex": 300,
      "PostDate": "14/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 20, 2012 11:33PM adagio wrote: Ladies - I had my first chemo today and so far, so good. Just a little bit queasy every once in a while, but I just take a sip of water and it seems to pass. Praying for a good night's sleep in spite of the dexamethosone. What a journey into the unknown this is!!",
      "MessageIndex": 478,
      "PostDate": "20/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 27, 2012 12:47AM adagio wrote: marian - so sorry to hear about the sliding hemoglobin. What number did you start with? 92 seems kind of low to me. Yikes!! Have you ever tried molasses - I got some because I heard they were good for low blood counts, but don't really know how to take it - I guess I could just take it on a spoon. Does the Taxol have the same effect on the blood counts I wonder? Or is the AC the hardest? Also sorry to hear about your father - that must have been a tough time.  My thoughts and prayers are with you already for tomorrow. Hope it goes well.",
      "MessageIndex": 664,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 30, 2012 04:39PM adagio wrote: Thanks for all the responses. The MO did consider giving more neupogen, but for some reason decided against it - I guess she wants to see if my body can do the work itself!! I am fine with that. I can wait for the next time in the chair - next time she has me giving 7 shots of neupogen daily starting on day 3 after chemo. So it will be very interesting to see what happens. In the meantime, I have to look after myself and stay away from anyone who is sick. She said I can still go out and about - no restrictions - except if there are colds and flus!! I will probaby stick close to home - although - I just went for a massage and then a haircut - since the hair is going to be sticking around a while longer now!!",
      "MessageIndex": 798,
      "PostDate": "30/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 4, 2012 07:16PM adagio wrote: Jennie 93 - thanks for sharing about your red itchy bumps on the back of the neck. I was going to phone my MO today if they kept me awake last night - but I slept well and today it is not quite so itchy - so who knows? Congrats on getting to chemo #3 - my 2nd round has been postponed due to low white cell count - we are hoping for Thursday if blood levels are OK.",
      "MessageIndex": 912,
      "PostDate": "04/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 5, 2013 04:27PM adagio wrote: Loafer - I started off on Neupogen and got a lot of bone pain - now I take Neulasta (only one so far) and had no bone pain whatsoever. I am about to inject the next one as soon as I finish this and hopefully I will not have the pain - I gather it is different each time. Also, Neulasta brought my white count up substantially more than the Neupogen.",
      "MessageIndex": 1486,
      "PostDate": "05/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 17, 2013 12:18AM - edited Feb 17, 2013 02:41PM by Moderators soteria -Glad that you are getting attention and I sure hope your blood clot gets better soon. What are the injections that you are getting? This chemo is not for the faint of heart!  I got my taxol #3 today and praise God it went smoothly and I did not have another allergic reaction. They slowed down the rate of the infusion - I was there for over 6 hours - but better that than another bad experience. Now I have to wait and see what the side effects will be this time - not looking forward to all that joint and muscle pain. You may have said it before on a previous post - but are you getting your treatments every 2 weeks or 3 weeks? I get mine every 2 weeks, so I have to take Neulasta to bring up my white cell counts - so far they have come up nicely each time and thank God I have never been sick even though I carry on with all of my usual activities e.g. going to choir, church, fitness etc. Hope the pain eases for you - will pray that the meds do their job.",
      "MessageIndex": 1845,
      "PostDate": "17/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 28, 2013 02:47PM adagio wrote: tuxtails - I see you live in Savannah - going to Savannah is high on my to do list - I have read a lot about the history of that are and I find it fascinating - what month of the year would you recommend a visit to Georgia? Congratulations on getting close to the finish line for your radiation!!! Thanks for advice on drinking lots of water during radiation. I have had only 4 treatments and now get 4 days off because of the Easter weekend. I am not disappointed that my skin is getting a break.",
      "MessageIndex": 13,
      "PostDate": "28/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 2, 2013 11:31PM adagio wrote: april485 - do you know how many Gray you are getting each day? I get 2.65 Gray every day for 16 treatments, and then I will get 2.5 Gray for 4 boosts on the tumour bed. I see that your radiation is on the left side - so is mine - I do the special breathing to move my heart out of the beam of the radiation. I saw my RO today and she told me that my heart was completely out of the way - so that was good news. They took pictures for the first 3 days of treatment to be certain. My skin is a little bit itchy, but nothing much yet. I will be there again at 8 am tomorrow morning. One treatment at a time. Good luck and keep us up to date with your progress.",
      "MessageIndex": 71,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 7, 2013 10:48PM adagio wrote: lemon68 - is it possible that if you don't get your last treatment that you will have had enough radiation to do the job intended? You sound really sore and it terrifies me because I am just approaching halfway mark of 20 treatments. I hope you get healed up fast. Let us know what happens tomorrow when you see your RO.",
      "MessageIndex": 138,
      "PostDate": "07/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 16, 2013 12:21PM adagio wrote: lemon - nice to hear from you. Don't worry about thinking that you are whining - I am so interested to hear how each of us react so differently to this radiation treatment. I have never heard about the radiation exiting the back - that is scary! I pray that your skin will heal very soon!! I just did treatment #15 today and my breast is itchy and red, but no broken skin yet. After #16 I start getting boosts to the incision area - don't know what to expect there - hoping it is not painful! Maybe I asked you this before, but do you know the amount of Gray that you got during your treatment? I am wondering if it is the dose that causes the different reactions? Thoughs are with you in the days ahead - hope all the pain is worth it in that your cancer NEVER comes back!!!",
      "MessageIndex": 246,
      "PostDate": "16/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 13, 2013 11:56AM adagio wrote: Dakota - congrats on the final taxol coming up - hope all goes well. Have you had much neuropathy? Just wondering if you take the neulasta shot in between taxol treatments? I am getting taxol#3 this Saturday and I am scared because last time I got an allergic reaction to it which was petrifying. I cannot wait until this journey is over - getting sick and tired of it.",
      "MessageIndex": 2228,
      "PostDate": "13/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 16, 2013 10:56AM adagio wrote: Thanks for the well wishes everyone - just setting off for my day at chemo - will let you all know how it goes.",
      "MessageIndex": 2273,
      "PostDate": "16/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 14, 2013 12:24AM adagio wrote: Liefie - which part of South Africa are you from? I am going to Cape Town in September and am thoroughly looking forward to it - have heard it is a beautiful city. Edi - what a worry feeling another lump - just the thought of it alone sends shivers through me.  Jennie - your one year anniversary is around the same time as mine - what a year it has been!! Certainly not one I would want to repeat any time soon. Hope you start feeling better soon.",
      "MessageIndex": 4586,
      "PostDate": "14/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 15, 2013 07:13PM adagio wrote: liefie - that young man dying sends shivers through me and in such a horrible way. I agree - how do you come to terms with something like that? My husband will be working at the university in Stellenbosch so I suspect that I will get to know that town quite well!!! We do plan on going on a wine tour and I have heard that there are some great restaurants. We will then spend a full week in Cape Town and plan to do the \"touristy\" stuff. I have heard that it is amazing.",
      "MessageIndex": 4617,
      "PostDate": "15/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 23, 2013 11:41PM adagio wrote: liefie - I just can't imagine seeing a bear so close to home - yikes. Hope your dog is OK - what kind of dog do you have?   I have heard that Stellenbosch is beautiful and I am looking forward to it - we are planning on doing a wine tour which I have heard is definitely worth while.  Edi - sorry to hear about your depression - that has to be the absolute worst thing to deal with on top of everything else. I was depressed quite badly during peri-menopause/ early menopause for quite a long time - it was like a big black hole that I was in - my GP wanted me take anti-depressants, but I didn't feel good about that, so I persevered and used alternates like St John's wort and Holy Basil - they did help but not fast. The depression just seemed to take its course - I could still function. I have many friends who have been on and are still on anti-depressants and they do find them helpful - although they are all wary about coming off them! I have heard that you have to wean yourself off them very gradually. I also have Reiki every Monday and find it very beneficial - it is combined with a relaxation class that I take and love.  Hope you are feeling better soon.  ",
      "MessageIndex": 4673,
      "PostDate": "23/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 24, 2013 06:36PM adagio wrote: Nihahi - what fantastic scenery! Liefie - what a great dog you have and he sure knew how to protect your husband\"! I have a golden who is also 11 years old - aren't they amazing animals - so, so clever!",
      "MessageIndex": 4682,
      "PostDate": "24/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Sep 30, 2013 01:57PM adagio wrote: Well said Nihahi - lovely words for websister who definitely needs all of our thoughts, prayers and hugs.",
      "MessageIndex": 5008,
      "PostDate": "30/09/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 2, 2013 01:20PM adagio wrote: liefie - I just got back yesterday from my trip. One week in beautiful Stellenbosch (my husband was working at the University) and a week in Cape Town. Did all the touristy stuff and tons of walking. We stayed in an apartment right on Beach Road in Sea Point - it was a fabulous view from the apartment and the waves were spectacular. Unfortunately the weather did not co-operate - it was very cold and wet - but coming from Vancouver - no big deal really. I thoroughly enjoyed the history of S.A. - fascinating! I think I have gained about 10 pounds - so much wonderful food and I did indulge in the lovely South African red wines. Oh well - back to the healthy diet and not so much red wine.  edi - glad you have found a choir. I sing in 2 choirs - although I did drop one of them while going through treatments - looking forward to getting back to singing - it is good for the soul and it is quite liberating. lizylu - welcome to the forum. I am also triple negative. I go to see my MO tomorrow for a 3 month check up - hoping all will be well. Glad you only have one more chemo to go - that is quite a milestone!",
      "MessageIndex": 5037,
      "PostDate": "02/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 8, 2013 11:48PM adagio wrote: liefie - good for you doing a nice long walk - take advantage of the dry weather as we will be entering our rainy season soon! May I ask what kind of pedometer you have and where did you get it? I have had one in the past, but never found it worked so well and I just found it and it is broken, so I definitely want to get another one. 10,000 steps is a lot further than one would think if I recall correctly. However, considering the research says that getting out and walking every day reduces our rate of recurrence by 55% - it's a no brainer (providing we are able, of course).",
      "MessageIndex": 5118,
      "PostDate": "08/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 9, 2013 07:13PM adagio wrote: Edi - I didn't know that about the avoidance of alcohol helping by 80% - that 's huge. Wow, I am in trouble, since I really do love my glass of a nice red wine!!! I had tons of it while in South Africa because it was so good and very cheap.. - oh well , the damage has been done. I really do hate feeling deprived. Surely everything is OK in moderation! LOL",
      "MessageIndex": 5126,
      "PostDate": "09/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 9, 2013 10:45PM adagio wrote: nihahi - my oncologist also told me to count from the day the tumour was removed from my body. Morwenna - that healing must have been a very special time for you - how cool that you have healers at your drumming circle. I go to a relaxation class and we have 2 reiki healers who go around the room just simply touching us while the facilitator does a guided imagery with us - it is very special indeed. We need all the help we can get!",
      "MessageIndex": 5132,
      "PostDate": "09/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 16, 2013 06:51PM adagio wrote: morwenna - those little pineapple cards are awesome! Where in Hawaii is your competition? edi - do look after that hip of yours. Sure hope it feels better real soon. So sad about Naan, and now with Benny's mammo news - it is all a bit discouraging, isn't it? liefie - so glad that you are coming to Marian's - it will be so nice to meet many new friends - I am looking forward to it a lot. websister - I too am intrigued by the quiet book for kids - did you get the idea from the internet or do you have a pattern of some kind? Sounds like fun and would make a great gift especially if it is made from something as special as great grandma's clothes. nihahi - wondeful photos and good for you with all that hiking! mom of 2 - congrats on the negative BRCA - what a relief.",
      "MessageIndex": 5218,
      "PostDate": "16/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 23, 2013 06:46PM adagio wrote: Edi - congratulations to you and your daughter ! Good looking girl . Morwenna - agree with the others - you look fantastic and full of life! Have you had your hair cut since chemo? Momof2 - prayers with you today as promised. My mammogram went OK at the time, but I have been so sore on the surgery side since it - they must have stretched the scar tissue - ouch!",
      "MessageIndex": 5383,
      "PostDate": "23/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 8, 2013 10:58PM adagio wrote: movie - I am heading to the Baja Peninsula - San Jose del Cabo - the temperatures are hovering around 32 degrees Celsius - nice and warm, but not too hot - just perfect!!",
      "MessageIndex": 5581,
      "PostDate": "08/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 22, 2013 12:30AM adagio wrote: nihahi - stunning photos!! But it looks really cold. I would love to try snow shoeing - is it hard? Momof2 - I found chemo education really boring, hopefully yours will be more interesting. I think it was boring for me because I had done so much research myself before I went, but at least it was good to meet one of the chemo nurses. Edi - we musketeers will indeed keep fighting!!! I hope your friends CT scan results turns out to be nothing to worry about. Movie - that sounds like a very long trip! Hope it goes smoothly for you.",
      "MessageIndex": 5753,
      "PostDate": "22/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 3, 2013 05:18PM adagio wrote: nihahi - that's a lot of snow. Momof2 - so sorry you are not feeling well. Neulasta pain is crippling - I cringe when I think of the pain from it. I didn't get any of the redness around the IV site, but it does sound worrisome to me - hopefully you can hang in with it until tomorrow, but if the redness and pain get any worse at all, I suggest not waiting until tomorrow. I have never shopped online, but you are definitely making me curious about it.",
      "MessageIndex": 5903,
      "PostDate": "03/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 7, 2014 03:16AM adagio wrote: liefie - just googled the wedding pics - gorgeous bride  and stunning wedding indeed. What a handsome son you have. I recognize the church  - I was in it in September - I found the arrangement of the seats very interesting! So glad you are feeling better. I am having a blast here in Hawaii - the weather is so amazing and the ocean was so warm today - I plan on swimming every day while here. Thinking of you all while going through procedures - in your pockets, for sure.",
      "MessageIndex": 6120,
      "PostDate": "07/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 4, 2014 11:17PM adagio wrote: momof2 - so glad to hear you ar feeling much better - you sound so cheerful and upbeat .",
      "MessageIndex": 6234,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 20, 2014 11:12PM adagio wrote: Morwenna - I finally went to a physio today, and she told me exactly what you said  - to move within my pain threshold! She also gave me 2 very gentle stretches to do and she did hands on massage of all the muscles surrounding the armpit to help release the tight muscles. And yes she did say to ice after the stretches. I did have x-rays done and there is nothing broken just a lot of bruising of the periosteum which the doctor said is more painful than a break.  momof2. - thinking of you and hope surgery went well. Liefie - wow - you had snow on the island - we had new snow on the mountains but nothing down here thank goodness.  Jenn - sorry to hear  about the tamoxifen side effects - I am triple negative, so I don't have to take it, but I have heard it can be nasty. ",
      "MessageIndex": 6309,
      "PostDate": "20/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 20, 2014 12:01PM adagio wrote: Morwenna - what a relief. Thank God. Now you can get on with living!",
      "MessageIndex": 6459,
      "PostDate": "20/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 23, 2014 04:43PM adagio wrote: Edi - I had my last radiation on April 23rd, 2013 - and I ask myself the same question - where did that year go? I guess if it went by quickly, that is a good thing!! I am going for my 2nd haircut next week - thinking this may be the end of the chemo curl when they cut all the curls off! I have actually loved having the curls and I will miss them greatly.  I just need to get this arm and shoulder working again after my fall - so I am going to do physio again, and hopefully it will work better this time. I got my eye measured in preparation for the cataract removal, but unfortunately it won't happen until the end of the year, so I can forget about that for a while - unless there is a cancellation! Glad your energy levels are good - too bad about the nails - have you tried taking extra calcium or silica to help with them?",
      "MessageIndex": 6557,
      "PostDate": "23/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 14, 2014 12:20AM adagio wrote: liefie - just read your very sad news! My warmest thoughts and prayers are with you and your family - this must be a very difficult time for you. Even when death is expected, it always comes as a shock and is truly a painful process to walk through. May god give you strength and courage in the days ahead. Cherish the many memories of your Mom and hold them in your heart! Hugs!!",
      "MessageIndex": 6651,
      "PostDate": "14/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 19, 2014 11:36PM adagio wrote: movie  - warm thoughts coming your way as you tend to your ill mother. It is truly an emotionally draining experience. I wasn't with my sister when she died just two days ago, but I did talk to her up until the last few days - it was very emotional!  She had her 2 daughters and her husband with her when she passed which is exactly what she wanted - she suffered a lot, so I think it was a blessed relief in the end. She lived only a short 2 months after her diagnosis of colon cancer which had spread to the liver and lungs. Hugs to you!!",
      "MessageIndex": 6670,
      "PostDate": "19/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 9, 2014 05:14PM adagio wrote: Edi - I love peonies - they are such big flowers, but oh so fragile and they don't last long at all! Glad you are getting things checked out with your doctor.  Good luck with the fondant stiletto!!! Websister - how awful for you to have those yucky feelings from 2 years ago flood over you today when you had the ultrasound. Sure hope all turns out well for you - it is so difficult not to worry, isn't it? Morwenna - sounds like you are really enjoying life right now - so happy for you. Liefie - glad you are starting to move a bit - take it real easy. Nihahi - you must be enjoying some good hikes these days - great weather for it too. To everyone else - have a good week and hopefully the sun is shining for you all - the colours are just so beautiful right now that I have a hard time being inside , I just want to be outside all the time. Lots of gardening getting done - yeah!!",
      "MessageIndex": 6754,
      "PostDate": "09/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 20, 2014 05:02PM adagio wrote: So nice to catch up on everyone's news, and like someone else said you all sound so happy! Liefie and Morwenna - I too am thinking of getting my hair cropped short - it is one big mop of white curls which just drive me crazy - I just need to pluck up the courage and go. I have had it cut 3 times already and it is growing so very fast. Edi - the tea shop sounds wonderful and a great place for a get together. Momof2 - hope the sun is shining soon again in Oregon - sounds like true West Coast weather. You may grow to love it like I do. Is this a summer home for you, or is this a permanent move? Liefie - glad you got to see Emily again. My shoulder and arm are finally  better and I am getting sleep again which is heavenly. I had cataract surgery yesterday and it went very well - now my job is to put drops in several times a day for a few weeks. I am enjoying abundant produce from my vegetable garden which is fabulous. Sunshine and rain - a great combination for beautiful gardens. Have a wonderful weekend everyone.",
      "MessageIndex": 6805,
      "PostDate": "20/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 26, 2014 12:14AM adagio wrote: Morwenna - opening and enjoying a nice bottle of wine is a fine way to celebrate being drug-free. Wishing you all the best. Do you take a baby aspirin every day -  I have heard that helps thin the blood and apparently helps in the prevention of recurrence of cancer - cannot remember the source of this wisdom - however, perhaps you should just enjoy not taking anything for a while! Enjoy the rest of your week!",
      "MessageIndex": 6828,
      "PostDate": "26/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 27, 2014 12:44PM adagio wrote: Edi - in your pocket, for sure. Let us know how it goes! Is this a routine check up for you? I have never had a ct scan - so, feeling envious. LOL",
      "MessageIndex": 6835,
      "PostDate": "27/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Sep 26, 2014 09:59PM adagio wrote: momof2 - just read your  stats, and you have been through so much in the last  2 years!!! Well done for hanging in there and maintaining your sense of humour ! Of course you will get through a birthday this year without a cancer surprise! October has not been a kind month to you in the past couple years - I am guessing this is your birthday month !  Hopefully the surgery on your shoulder will make a huge difference in your pain level - I haven't heard of that surgery before, but then I don't know much about rotator cuff injuries. All I know is that shoulders can hurt a lot!!!! Right now, I am untying the knots from the chair sashes and folding them - hoping to sell them. Glad that you were able to sell some of DD's wedding stuff - to recoup a little bit of money!  Next I will fold all the table runners. I vacuumed and cleaned up the living and dining rooms today, so at least those two rooms are in good shape now - I can actually see my dining room table - yeah!! Take great care of yourselves, everyone!",
      "MessageIndex": 7047,
      "PostDate": "26/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 6, 2014 03:35PM adagio wrote: momof2 - you are very much in my thoughts and prayers today - let us know how you are doing?",
      "MessageIndex": 7079,
      "PostDate": "06/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 3, 2014 10:10PM adagio wrote: websister - 5 more weeks is a long time. Is the ankle feeling any less painful? Edi - I got my 2nd cataract surgery today - decided to just get it done! It went well. 2014 has been such a crazy year for me - 2 bad falls, 2 daughters getting married, and 2 eye surgeries - I need a break!!! Did you ever go back for your blood test? Hope everyone else is doing Ok - this thread is pretty quiet these days. Take care everyone.",
      "MessageIndex": 7127,
      "PostDate": "03/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 9, 2015 12:50AM adagio wrote: jackpot - I didn't know about the connection between blood transfusions and cancer - how interesting! So sorry to hear about your horrendous experience - that must have been a nightmare for you. Sure hope your hemoglobin rebounds quickly and that you are getting adequate pain meds for such a big incision. Thoughts and prayers are with you. Take care",
      "MessageIndex": 7185,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "adagio wrote: Just wondering if any women on this site have only ever had A/C as chemo treatment. Or is it always followed by Taxol? Just wondering what the benefits of adding the Taxol is? Any input would be greatly appreciated!! Dx 8/21/2012, IDC, 2cm, Stage II, Grade 3, 2/3 nodes, ER-/PR-, HER2- Surgery 9/24/2012 Lumpectomy: Left; Lymph node removal: Left, Sentinel Chemotherapy 11/19/2012 AC + T (Taxol) Radiation Therapy 3/24/2013 Breast Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797491",
      "Title": "A/C chemotherapy adagio Sassa"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 2, 2013 01:44AM adagio wrote: I am going for radiation #5 tomorrow and I am already dreading it. I have had 4 days off due to holidays here in British Columbia. My skin is not red although it is a bit itchy. I stand in awe of all you ladies battling through this horror of radiation. Did someone say that  this was easier than chemo? ",
      "MessageIndex": 52,
      "PostDate": "02/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 4, 2013 06:09PM adagio wrote: I had rad#7 today - Cindy is right - there is absolutely no pain involved during the treatment. I am one third of the way thru my treatments. I bought a new cream yesterday called \"7\" - has anyone heard of it? It is all natural - a mix of aloe, calendula and manuka honey - it smells good and has a wonderful texture - it is supposed to help itch.  Hope everyone is doing well with their treatments. One day at a time. We can do this!",
      "MessageIndex": 100,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 4, 2013 08:44PM adagio wrote: lemon - I am so sorry to hear that you are so raw and sore - it must be awful for you. May I ask if you know how many Gray (radiation measurement) you are getting daily?  I hope you can get some relief - have you tried saline soaks? Healing prayers coming your way. Your body sounds like it needs a break. ",
      "MessageIndex": 104,
      "PostDate": "04/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 5, 2013 07:00PM adagio wrote: lemon- that is a really interesting article. My daily dose of 2.65 is for 16 treatments then I get 4 boosts each at 2.5 giving a total of 52.4 Gray - which I personally think is a lot. However, I do know that they may be giving me more because I have very small margins on the posterior edge of the breast. I will ask my RO more questions when I see her on Monday. It is all so confusing with so many different protocols.",
      "MessageIndex": 119,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 10, 2013 12:37PM adagio wrote: CTLMom - can you ask the technicians for some kind of support for your shoulders? They made a mould for me so that my shoulders could rest on the mould as opposed to me having to hold them there - it has been very helpful?",
      "MessageIndex": 174,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 15, 2013 02:04PM adagio wrote: Just got back from rad#14 - only six treatments left - two of the whole breast and then four boosts - not sure what to expect from the boosts!!  I was gardening over the weekend which meant using my arms a lot - and I noticed the friction of skin on skin in the armpit was getting quite irritated so I made a \"roll\" to put under my armpit. I filled an ankle sock with cornstarch, tied it tight at the top (I actually used an elastic wrapped several times around until tight), then I put the sock inside the leg of pantyhose, I put the roll under my arm, and tied the pantyhose around my shoulder - it worked wonders at creating a space between the upper arm and the armpit. Today I wakened up and it isn't even red - yeah!! ",
      "MessageIndex": 233,
      "PostDate": "15/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 22, 2013 05:08PM adagio wrote: RMLulu - congrats on your final full breast rad. The boosts are so much easier! Tomorrow is my final one. Saw my RO this morning and she is pleased at how my breast looks - it is quite red - but no broken skin. She has given me the go ahead to travel this coming weekend - so I am heading off to San Francisco for a few days - a much needed break. April - let us know how it went for you on your first day - you will be done before you know it.  Everyone else in treatments - hang in there - it does come to an end!",
      "MessageIndex": 289,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 25, 2013 01:23PM adagio wrote: april - wow - that was fast!!! One more day to go and then as you say - see what happens!! Congratulations. Perhaps \"speed-zapping\" will become the wave of the future treatment protocol. My breast has definitely become more itchy since finishing treatments - but not more red yet - so keeping my fingers crossed.",
      "MessageIndex": 316,
      "PostDate": "25/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 26, 2013 12:54PM adagio wrote: I never got my blood pressure checked at any time during radiation? Is this usual protocol in the US?",
      "MessageIndex": 331,
      "PostDate": "26/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 7, 2013 09:36PM adagio wrote: I am 2 weeks post final rad treatment. My skin got very red and hot just in the last few days - I put on aloe vera and covered it with a piece of an old t-shirt inside my tank top. Well, when I went to reapply cream, I took the piece of t-shirt off and lo and behold my skin came off with it - ouch!! It was kind of weird seeing all the skin coming off - and underneath that skin more bright red skin and quite tender. So I now see what they mean when they tell us that the effects do indeed keep on for at least 2 weeks afterwards. So be diligent with the creams and moisturizing all the time even when things feel OK. I think I got a bit lazy because everything felt so good. Oh the joys of cancer treatments!!",
      "MessageIndex": 412,
      "PostDate": "07/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 23, 2012 01:14PM adagio wrote: Ruthbru - did you have chemotherapy? Just wondering since you have a grade 3?",
      "MessageIndex": 24,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/794806",
      "Title": "External Full Breast Rad Side Effects/Risks (During & After) NSJ2 SelenaWolf"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 28, 2013 10:49PM adagio wrote: RMlulu - I asked my radiation technicians today how much Gray I was getting - this is what I was told - I am getting 2.65 Gray daily for 16 times and then I will get 2.5 Gray for 4 boosters. So that adds up to 52.4 in total. That seems like a lot!! Ouch!!",
      "MessageIndex": 17,
      "PostDate": "28/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 5, 2013 05:17PM adagio wrote: April - thanks for the info - that is a high daily dose for sure. It will be interesting to see how it goes - I am sure you will be just fine.  I was just curious to compare the total radiation dose you were going to receive  compared to what I am going to get. My total Gray will be 52.4 - which seems a lot - I just don't get how they calculate what each of us get! I guess I will have to trust that they know what they are doing. ",
      "MessageIndex": 111,
      "PostDate": "05/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 9, 2013 11:42AM adagio wrote: sneaky - I personally feel that with all cancer treatments we are gambling with the odds. Even our \"experts\" do not know for certain that the treatments are going to work whether it is chemotherapy or radiation. If your pathology shows a Grade 3 with LVI then that would suggest that it is a fairly aggressive cancer - that should help you with your decision. I was petrified of chemo and I am equally petrified of radiation, but also didn't feel comfortable not doing anything - so I decided to do both since that is what was recommended by my oncologists. Only time will tell if it is the right choice and even then if the cancer doesn't come back, it still may not have come back even without any treatment other than the surgery. Not to sound discouraging, but it is all a gamble - it just depends on what we can live with.",
      "MessageIndex": 160,
      "PostDate": "09/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 10, 2013 06:01PM adagio wrote: AmyinMI - I wouldn't worry about taking the supplements at all. There is a lot of controversy about taking supplements, antioxidants, vitamins etc during chemotherapy and radiation. Some people carry on taking them and some people stop them altogether. If you feel more comfortable stopping them - then that's what you do. As for myself - I continue to take my vitamin D, fish oil, calcium, B vitamins, and some other aminoacids. I did my research on supplements during radiation and feel comfortable with what I am taking and I have discussed it with my physician at my integrative health care centre.  From what I have read, it is best to stay away from the powerful antioxidants.  A daily vitamin should be just fine. However, do talk it over with your oncologist and see what he/she says. ",
      "MessageIndex": 179,
      "PostDate": "10/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 17, 2013 03:18PM adagio wrote: SunnyD - congrats on finishing up your 25 treatments - you are most definitely on the countdown!!! Do the boosts hurt?  I have had 16 treatments and just in the last day I have noticed a big change in the breast - before it was pinkish/red - now it is definitely red!! I start my boosts tomorrow. Our waiting room is also co-ed - I wear my jacket over my gown because I didn't feel comfortable sitting there in a flimsy gown - plus it is a cold room. If I were a guy, I think I'd keep my pants on, and then just slip them off when I got inside the treatment room (LOL). We definitely can lose our sense of dignity going through all these treatments! ",
      "MessageIndex": 257,
      "PostDate": "17/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 19, 2013 01:14PM adagio wrote: april - I am sure you will be just fine - the fear of the unknown is always hard to deal with. Once you are in there and know exactly what's going to happen on a daily basis - the anxiety is much less. I understand about worrying about burns - but we are all so different!! There is no way of knowing how our skin is going to react. I get a total of 52.5 Gray over 20 treatments, so that is considerably more than your total treatment - in fact I think it is a lot - so you are better off with just 38.5 Gray especially if it does the job just as good as the research suggests it does. I have had 2 of my boosts which are just around the lumpectomy incision. They put a special gel pad over the incision, so that the radiation is superficial. It does not hurt at all. So after 18 treatments my breast is red and itchy - nothing unbearable - I feel so grateful!! However, I am still holding my breath since radiation can still present itself in the form of burns for up to 2 weeks after treatment ends. Yikes!! Good luck today and on Monday - do keep us informed since we are all keen to know how you do!",
      "MessageIndex": 273,
      "PostDate": "19/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 22, 2013 01:04AM adagio wrote: RMLulu - the gel pad has been custom made for me so that it lays flush against my incision. According to the technicians it acts like several layers of skin , so that when they give the boost, it is more superficial and the radiation works on the tumour bed. Apparently the tumour bed is a common place for reoccurence! My tumour is in the 3:30 position on the breast. The good thing about the boosts is that there is no need to worry about the heart and lung - so they said! You have only 6 treatments left - wow!! You must be getting so ready to be finished. I have my \"dancing shoes\" ready for Tuesday when I have my very last treatment. The breast has done great - only slightly red now and a bit itchy. Calendula has worked wonders for the itchy parts! April - your big day is fast approaching - let us know how it goes! Lemon - how is the healing process? Cooling thoughts for all you rads girls!! Keep posting and let us know how you are doing!",
      "MessageIndex": 282,
      "PostDate": "22/04/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 2, 2013 05:00PM adagio wrote: RMLulu - CONGRATULATIONS!!!!! You are one great warrior and you are all done! Yeah!! In a couple more weeks you will be ready to move on to something else other than cancer treatments. I am now 9 days post last radiation, and I would have to say that the redness did get worse for about 1 week - fortunately, no blisters or broken skin - but definitely bright red like a very bad sunburn. Now it is almost better but I continue with the moisturizers and drink lots of water etc. I had an awesome visit to San Fran - great weather, great food and it was wonderful to simply \"forget\" about cancer for a few days. I did a lot of walking and really did feel well enough to do the hills.  To all of you still in treatment - hang in - it goes by fast, and as Cindy would say - drink lots of water, keep your sense of humour!! Who knows you may not even get any side effects - not everyone does.",
      "MessageIndex": 375,
      "PostDate": "02/05/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/802300",
      "Title": "Spring 2013 Rads RMlulu RMlulu"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 5, 2012 01:25AM adagio wrote: Runnergirl - take the meds proactively!! I took mine as prescribed and I still threw up and once I started vomiting - I just couldn't stop - threw up 10 times and had to phone my oncologist to get help by switching to a different med and getting suppositories since I couldn't keep anything down. Good luck!!",
      "MessageIndex": 159,
      "PostDate": "05/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 11, 2012 06:22PM adagio wrote: I am also on dose dense A/C for 4 rounds, then Taxol for 4 times each of them every 2 weeks, providing my blood counts keep up. I had a delay the last round due to dangerously low neutrophils, but hopefully this time they will come back up with the help of the neupogen shots which I give myself daily. I rinse with baking soda and water each time I eat just as a prevention - so far, so good. Hope everyone has a good day - I started my chemo November 20th, so I go between the November and December threads!!",
      "MessageIndex": 274,
      "PostDate": "11/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/796653",
      "Title": "December 2012 chemo group beckstar18 Bren58"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 21, 2012 04:25PM adagio wrote: Traii - I am getting AC/T dose dense which means I have them every two weeks. I do not have a port, so I was worried about that, but no problems there. Unfortunately my first night was awful - threw up 10times and had to call the nurse and my oncologist. Hoping for a better night tonight! Dakota - hope #2 goes well for you and that you have a decent night. It will be interesting to compare the different side effects. I sure hope my 2nd round is easier in that regard. MeganB - regarding low white cells - I just heard about a study done in Israel on 100 women on chemotherapy. Half took 2ounces of wheatgrass juice daily and the other half didn't. The half that did had significantly higher blood levels during chemo - now to find some wheatgrass juice! txjunebug - in theory the water drinking is a good idea. I drank gallons, but because I had vomiting it backfired on me because there was such a voluminous amount of throw up for my poor husband to clean up because it came on so suddenly that I didn't make it to the bathroom on time and it was projectile - not a pretty picture in the middle of the night. I don't believe this guy has ever cleaned up throw up before!! I had to show him how in spite of my state - but he did it all willingly so that was a plus. Grateful for a loving husband.",
      "MessageIndex": 515,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 21, 2012 10:34PM adagio wrote: marian - I did phone the MO and she prescribed another drug for me and stemitil suppositories instead of tablets which will be beneficial. She was very helpful I took the med at 9am this morning and have felt no nausea since. She wanted me to come for IV fluids, and iv drugs, but I said I would like to wait and see what happens - we will see how tonight goes!! I have drunk 3 mugs of lemon ginger tea (not all at the same time) with a big spoonful of honey it it and they have stayed down. I didn't feel at all hungry all day, but just ate half a veggies sandwich, small bowl of soup and very small amount of salad. Keeping my fingers crossed. I forgot to ask about the Ativan - next time. I took a 2hour nap this afternoon, got up and had a shower, and now I came back from walking a couple of blocks. Got to get the legs moving. How long did your nausea last?",
      "MessageIndex": 525,
      "PostDate": "21/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 27, 2012 11:29PM adagio wrote: marian - yeah!!! You are finished with A/C - good for you. I got a bit of a panic yesterday when I read your post about the falling hemoglobin - I am going to get that red meat going just for that purpose alone. I would do all I could to prevent a blood transfusion.  My next chemo is at 4:30pm - not sure if that is a blessing or not. You certainly made good use of your time beforehand.  Here's hoping for a relatively good night for you Marian.",
      "MessageIndex": 706,
      "PostDate": "27/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 14, 2013 01:24AM adagio wrote: Maychen - did you lose your eyebrows and lashes? I am wondering how you managed to keep your hair? Did you only get Taxol as your chemo - no A/C?",
      "MessageIndex": 1823,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 25, 2013 03:02PM adagio wrote: sick of pink - I just started my radiation today - just wondering what cream are you using? Any visible signs on your skin yet? I haven't bought a cream yet but am guessing I should since they said that moisturized skin heals faster.  I am also curious about travelling after radiation and when it is considered OK. I really can't see why it wouldn't be OK for you to travel in May providing you feel well enough - I have heard that the fatigue with rads is cumulative.",
      "MessageIndex": 1965,
      "PostDate": "25/03/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/795470",
      "Title": "Starting chemo November 2012 michellej1980 IamNancy"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 16, 2013 09:00PM adagio wrote: nihahi - what beautiful photos - and a great analogy about the hot air balloon being a new amazing view of life for all of us after we get through this journey. As you said - my treatment went smoothly - they put it in extra slow for the first 35 minutes - turned out to be over 6 hours at the cancer agency - but totally worth it to prevent another reaction. I have so many steroids in me that I hope I will get a bit of sleep tonight. But right now I don't feel tired at all. Dakota - my heart is with you going through family issues in addition to breast cancer - that sucks. Thanks again to all for your warm thoughts and wishes.",
      "MessageIndex": 2287,
      "PostDate": "16/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 19, 2013 02:22PM adagio wrote: Hi all, I had a bad day yesterday - achey all over and felt crappy. Last night I slept OK and today I actually got dressed and am planning a nice walk in the sunshine today - so hopefully that will help. Just another day or two of feeling yucky and then hopefully I will pick up a bit. You ladies make me smile!! I love reading all your posts. ",
      "MessageIndex": 2360,
      "PostDate": "19/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 7, 2013 05:37PM adagio wrote: Edi - such great news that all is well. I know what you mean about the TN thing, but think positively - no meds to take which means no side effects. That's how I keep myself going plus do the best we can In terms of diet and exercise and then hope for the best. Thanks for the tip about the hair colour from the health store. One question for all you ladies who are post chemo \"have any of you had your hair cut at all since it grew back in? Just curious as to how that would affect the curls? Liefie - is the wedding in Stellenbosh?",
      "MessageIndex": 5106,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 4, 2013 12:45AM adagio wrote: liefie - thinking of you tomorrow at your mammogram - praying that all will be well for you. Two weeks have gone by now since my mammogram and I haven't heard a thing - trusting that no news is good news! Maria - thoughts and prayers with you also for your mammogram! Edi - Just learned that another triple negative sister passed away this afternoon - this cancer road is a tough road to travel - we need to support and encourage each other. Hope your weekend was a good one! Morwenna - enjoy singing in Hawaii - and enjoy the warmth of the sunshine when you get the chance. Dakota - your hair looks great - have you had it cut yet since it grew back in? Everyone else - hope you enjoyed your weekend!",
      "MessageIndex": 5510,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 6, 2013 09:59PM adagio wrote: Morwenna - big congratulations - well done - now your chorus can relax and celebrate - you must be so happy! Liefie - good for you writing those letters to the big guns - looks like some positive action could be about rotate place. Praying for you and this situation. Momof2 - I also love coffee - so I understand the pleasure of the experience of a good cup of coffee. Glad the drains are all out and that you are more mobile. Benny - how amazing for you to hear benign - now you can relax and forget about mammograms for a while. Hope everyone else has a great week - I am off to Mexico for 5 days - looking forward to the warmth of the sun!",
      "MessageIndex": 5557,
      "PostDate": "06/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 8, 2013 10:30AM adagio wrote: liefie - about the mammogram - my oncologist told me that if I didn't hear from them that it was good news - so since it has been almost 3 weeks, I think that is good news!!! Just off to walk the dog, then pack my case for a very early flight tomorrow morning! Looking forward to 5 full days of relaxing by the beach and the pool in the warmth of the sun - aahhhhh!!!! Edi - congrats on the new stove - is it gas? Websister - hope port comes out smoothly and that it doesn't't hurt too much! To everyone else - have a great weekend. Keep warm and comfortable.",
      "MessageIndex": 5574,
      "PostDate": "08/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 25, 2013 06:28PM adagio wrote: momof2 - how considerate to think of others on the day of your chemo - that is so very touching!!! Glad things went OK for you - take it easy the next few days. I gave my own Neulasta shots - they are not so bad - just be aware of any bone pain and take Claritin - it worked for me!",
      "MessageIndex": 5790,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 25, 2013 11:36PM adagio wrote: Marian - welcome and glad you had a great time in Calgary. Your big surgery day is getting closer all the time. Lovely photo of you and websister. Websister - how great that you could meet with Marian - I just think it is so neat how we can connect with each other - modern technology does have many pluses - you and Marian look so great in the photo and even though you may not feel 100% - you both actually look healthy. Morwenna - so happy that gecko is feeling much better! What a relief. Maria - your RO should be able to write a prescription for some cortisone cream to help with the itch. I got some, but never used it - I used aloe Vera instead - the all natural stuff - no additives or colouring - got it from a health store. Hang in there - it is almost over! Momof2 - hope your neulasta shot went well for you.",
      "MessageIndex": 5796,
      "PostDate": "25/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 29, 2013 12:42PM adagio wrote: momof2 - I also lost my taste for coffee and wine - both things which I love to drink. My taste for coffee didn't return until during radiation - so hang in there - it will return. I drank a lot of ginger and lemon tea with honey during my chemo - I enjoyed it then, but can't tolerate it now. Side effects are miserable and you have to do whatever makes you feel better - it is temporary. Hugs to you!",
      "MessageIndex": 5831,
      "PostDate": "29/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 29, 2013 04:16PM adagio wrote: Edi - that is one impressive looking cake! I don't think I could make that - looks like a lot of work!",
      "MessageIndex": 5835,
      "PostDate": "29/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 2, 2013 05:34PM adagio wrote: Morwenna - sure hope you are OK driving in those conditions - thinking of you! May I ask what AHS is - I am guessing Albera Health System or something like that?",
      "MessageIndex": 5885,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 4, 2013 07:53PM adagio wrote: Edi - your view over the fence is amazing - I love cows and the countryside. I need to learn how to post photos on here - your little kids are cute and you look fab on your cruise photo. You know something I never had a photo taken when I had no hair - couldn't handle it! Now I wish I had one just for the records and memories.",
      "MessageIndex": 5923,
      "PostDate": "04/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 6, 2013 01:14AM adagio wrote: Edi - what a storm you have been enduring over there. I like the picture with the rat perched on the post - it tells a story! Hope it is settling down a bit - weather patterns are changing all around the world these days. It is frightening. Nihahi - we got our tree (a real one) last night, and I am hoping to get it decorated over the weekend before the house guests arrive. I can't remember if two and a half year olds like decorating trees or not - if so, perhaps I will wait until my little grandson arrives and let him \"help\" me! LOL",
      "MessageIndex": 5947,
      "PostDate": "06/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 23, 2014 05:27PM adagio wrote: liefie - in your pocket for next Tuesday - is it routine to get the ultrasound of the diep breast (sorry, not up on the breast procedures).  Hope all goes well. I just returned from my oncologist and she said all is well - lymph nodes are all normal and no lumps or bumps on the breasts. I don't get any scans or anything done, so it's not a lot to report really - but she told me to keep on doing what I am doing, so I guess that is good news. Will see her again in 3 months.",
      "MessageIndex": 6189,
      "PostDate": "23/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 29, 2014 03:16PM adagio wrote: liefie - great news on getting the all clear on your ultrasound !  Hope your cold gets better soon. I am recovering from a nasty fall on black ice while I was out walking the dog a few days ago - no broken bones but my left arm and shoulder are black with bruising - I am in a lot of pain and am on painkillers every 3-4 hours. I feel so helpless and mad at myself for falling - not what I need at this time! ",
      "MessageIndex": 6209,
      "PostDate": "29/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 19, 2014 11:57AM adagio wrote: Edi - let's hope that no news is good news in terms of your bone scan results. I have been consumed with a severe injury to my left arm (fell on black ice) no bones broken, but the doctor said there is bone bruising which he said is  much more painful than a break. I am trying to pluck up the courage to go to physio and get some exercises for it, but the thought of additional pain does not appeal to me!   I hope it  has stopped raining in England - I talked to my sister (she lives in Shropshire) a week or so ago and she said it has barely stopped raining since December - sounds dreadful. Liefie - are you back home or are you staying in Calgary until the baby is born? Momof - glad your energy is coming back - you sound like you are definitely ready for your surgery. I just can't imagine planning a wedding and going through treatments - if I recall correctly, Liefie did the same thing. Have a wonderful  day ladies - saw my first daffodils this morning and crocuses and forsythia almost ready to bloom - Spring is around the corner - yeah!!",
      "MessageIndex": 6301,
      "PostDate": "19/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 29, 2014 12:56AM adagio wrote: Morwenna - you look gret with your new haircut - is that still some chemo curl I see or is that natural for your hair?  I am sure you will have a good time at the additional wedding ceremony tomorrow  - I have a neighbour whose daughter in law had to do the exact same thing. I am sure you will be happy with your decision to go and see your Mom - praying that she will be comfortable and free of pain. So is the baby  that your Mom is holding? Enjoy your weekend",
      "MessageIndex": 6503,
      "PostDate": "29/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 11, 2014 12:15PM adagio wrote: Jennie - so sorry you feel so bad. My thoughts and prayers are with you! ",
      "MessageIndex": 6532,
      "PostDate": "11/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 1, 2014 06:07AM adagio wrote: Edie - yeah for getting out and puffing. I love walking around my neighbourhood especially at this time of the year looking at people's gardens and getting ideas for my own, and it is amazing how fast 30 minutes goes by, and presto - before we know it we have moved our bodies for all that time. Liefie - glad you are enjoying this amazing weather  - my lettuce, kale and arugula are all sprouting already and I only planted them 10 days ago - I just love this time of the year. I am getting my chemo curls cut off tomorrow - it is time - my hair is one big afro and it is getting out of control. I want to get it cut now, so that by the time the weddings come along, it will look half decent. Movie - the exhaustion of caring for your Mom must seem overwhelming at times - she is so fortunate to have you!!!! Try and rest when you can and remember to take some time for yourself - it is important! Morwenna - how great that you have raised so much money already for the Run for the Cure. Are you going to do some training for the run? Is it 10K? I so wanted to do the Vancouver Sun Run this year, but alas, my arm/shoulder injury prevented me - perhaps next year! Are you back in Calgary now? Nihahi - thanks for all your words of encouragement!!!",
      "MessageIndex": 6596,
      "PostDate": "01/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 24, 2014 05:27PM adagio wrote: nihahi - what are the black things? You are so active and must be in excellent shape - good for you. Liefie - good to hear from you - wishing you a safe journey back home. Edi - glad the pedalling is going well. Headstrong sounds like a fun venture to get involved in. Momof2 - I love the Oregon coast and have not been that way in many years - are you serious about a get together? You might get a few takers. Websister - sounds like your trip to Mexico was just what you needed and deserved. The worst part is that after a few days back home, it all seems like a dream! Morwenna - dragon boating sounds like a lot of fun - there are many teams here in vancouver, but I have just never been a water person - I love walking and pedalling though.  Nice you have Las Vegas to look forward to next year - yeah!!! Movie - warm and loving thoughts coming your way. Your Mom is lucky to have you. But you must also take care of yourself. I am still struggling with arm and shoulder issues - my doctor thinks that I now have frozen shoulder - she said this can occur following an injury - this can take up to a year to get better - yikes!!!  I went to see a new physio who was fairly aggressive and did dry needling, so I will see if this helps it any. At least I can now drive again, and I am back at my fitness classes - I am not good at staying at home!!! I like to be out and about. To all new people - ask the ladies on this thread any questions you have - they have a wealth of experience and we have all travelled the road you are just embarking on.",
      "MessageIndex": 6695,
      "PostDate": "24/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 23, 2014 01:26AM adagio wrote: Morwenna - I too will be in your pocket. I am sure you will be just fine!!! Lovely photo. Momof2 - You must have been to Savannah, Georgia - that is one place on my list that I so want to visit - the history of the civil war fascinates me. Perhaps next year we will get to go. Which faculty is your DH in? Mine is in the education faculty at University of British Columbia. Happy Anniversary to you - 33 years is a long time to be together - how wonderful! Edi - the eye is doing very well, although it is a bit challenging now with one really good eye and the other not so good, even though before surgery, the other eye seemed just fine. The surgeon wants to do the other eye in the fall. How are you managing with the imbalance in your eyes? Right now, I am wearing no glasses at  all , but will visit my optometrist next week to see what I should be wearing.  I received a \"fitbit\" for my birthday, and am trying to figure out how to track steps, stairs, sleep etc. amazing technology!  Anybody else got one of these little gadgets? Wishing everyone a good night's rest!",
      "MessageIndex": 6816,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 27, 2014 07:26PM adagio wrote: Edi - so glad the scan is over! Now you can completely relax and have  a nice long sleep in preparation for your choir concert tomorrow. Have a great weekend. Mimosa Tea Garden sounds delightful!!",
      "MessageIndex": 6840,
      "PostDate": "27/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 11, 2014 10:21PM adagio wrote: liefie - your time planned with family sounds tremendous - and you will spoil them rotten, and I am so glad that they will get to see some of our beautiful BC weather! Today I finally started cleaning and organizing rooms for our out of town guests - lots of work, but like you say, it will be so worth it just to see people that I don't see very often at all. The week after the wedding we are all going to the Sunshine Coast -  we have rented a place there right on the beach so it should be very relaxing and a much needed down time for me. The little grandchildren will be here and I am certainly looking forward to seeing them.  Next week I have my oncologist appointment, so hoping that all will be well in that regard. I am so grateful that I feel as well as I do, and my eye is healing very wonderfully after the surgery. Life is good!!! Enjoy your company and a very happy birthday to you!!",
      "MessageIndex": 6862,
      "PostDate": "11/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 16, 2014 04:54PM adagio wrote: Edi - looks lovely in Anglesey and you are looking good too in the photo. Good job on the curtains -  I like the colour. Do take more mini vacations - they are so restorative. I am super busy with wedding stuff that we haven't been able to get away as often as usual - but once the end of September comes, I will be more than ready for a break.  Thanks everyone for your thoughts for tomorrow - will let you all know how it goes. Websister - patience is the keyword for ankle injuries - it takes time!!! Hope the results of your endoscopy are good - did you need a general anaesthetic for that?  My son is in town from Quebec, so having a family dinner - there will be 10 of us. I am doing baked fresh wild sockeye salmon with roasted veggies and a quinoa salad - yum! Would be even more yummy if I didn't have to do the cooking!!  Have a good day everyone!",
      "MessageIndex": 6875,
      "PostDate": "16/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 23, 2014 06:45PM adagio wrote: jackpot - good news about the surgery - hope you don't have to wait for too long. Mom of 2 - you look great - your hair has come in really quickly! I love the whale Keiko! Hopefully your pains settle down soon! My daughter had to have surgery this morning on her shoulder because it was not just a break it was also displaced so she had to have a plate and screws put in her collar bone. Can you imagine just two and a half weeks before her big day - who could ever have guessed? I don't know if I will survive this, so I am practicing my deep breathing and drinking a lot of coffee! Next year you could visit Vancouver - it would be lovely to meet you in person. Caitlin- I need a root canal done also, but I keep putting it off !",
      "MessageIndex": 6894,
      "PostDate": "23/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 6, 2014 12:01AM adagio wrote: Mom of 2 - what great pictures! You look fantastic - very British looking with the hat and all, and I love the colour of your outfit - stunning! The bride is beautiful and her new husband is a and handsome young man - I wish them every happiness. Things are getting very busy here with lots of out of country relatives and still lots of running around to do especially now that DD cannot drive because of her injury! I just finished the wedding programs, now the rehearsal dinner on Thursday with about 28 people at my house - yikes!! It is all go! Hope the remainder of your journey is uneventful  and that you arrive in Georgia safely! Liefie - enjoy your down time and savour all the wonderful memories of the great time you have had with your family. Glad you have lots of photos!",
      "MessageIndex": 6903,
      "PostDate": "06/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 21, 2014 11:37PM adagio wrote: momof2 - that's not good news about your shoulder!  Hopefully you will not need to have surgery! Shoulder pain is just awful and I do have a very good idea of what you are going through.  Your time on the Oregon coast must appear to have been a blissful time compared to what your life is like currently!  Wishing you relief from the pain and courage to face the anxiety of the unknown. One wedding is over and it was beautiful in spite of the bride just having had surgery 12 days prior - she was in considerable pain, but she managed to enjoy the day as best she could - everything went off without a hitch and she did look beautiful and I did survive!!!  Now the focus is on DD#2 . Keep us posted and will definitely be in your pocket!!!",
      "MessageIndex": 6958,
      "PostDate": "21/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Sep 3, 2014 06:26PM adagio wrote: momof2 - how awful that your friend took you for a ride! That is just the worst feeling in the world and can make one feel pretty dejected. She is one lucky person to have had you to help her through tough times - you can hold your head high that you did your best to help her, but I think it is time for her to be on her own!! Hope you are feeling better soon. Keep busy! Glad your should is starting to feel a bit better. Take care.",
      "MessageIndex": 7009,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Sep 25, 2014 10:53AM adagio wrote: The wedding is over and I am so happy! It was a very emotional day as I watched my baby commit herself to her handsome prince. I survived, and I am exhausted, but so grateful that I was well enough to  be present at the wedding. Now all of the kids are married - phew!! My goal now is to simply relax, although my house looks like a bomb has hit it with all the post wedding mess. Oh well, it will have to wait while I catch up on my sleep. Edi - congrats on getting the all clear. Exactly 2 years ago today, I had my surgery to remove the tumour  - I am still on a 3 month schedule  - interesting how they are all just a bit different!  Websister - wishing you healing for that ankle of yours. Momof2 -  how did the haircut turn out ? Mine is growing so fast these days - needing it cut every 6 weeks now. The curls are still there, but they are a relaxed curl now, not the tight ones like in the beginning when it came back.  Good for you purging 'stuff ' - that is exactly what I need to do! Liefie - your cruise sounds amazing! And your photos are wonderful. Enjoy the rest of your week, ladies!",
      "MessageIndex": 7043,
      "PostDate": "25/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 21, 2013 02:17PM adagio wrote: Dakota - wig looks great - very chic! Carlads - lucky you doing last chemo - hope you celebrate afterwards. Caitlin - good luck with your chemo today. Keemo - what symptoms did you get during your taxol reaction? Everyone else - hard to keep up with all of your busy-ness. I am beginning to feel a big better - although the legs feel like lead and I got some pins and needles last night! DH and I are going away for a few days next week to Bowen Island - just to relax, read, watch movies and enjoy the ocean view. It will be my first time away from home since my diagnosis in August 2012. I am looking forward to the break. Have a wonderful day everyone.",
      "MessageIndex": 2395,
      "PostDate": "21/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 13, 2013 10:24PM adagio wrote: Morwenna - looks beautiful - and it says abundance! Happy thanksgiving to you and your family.",
      "MessageIndex": 5180,
      "PostDate": "13/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 22, 2013 12:51PM adagio wrote: Had my first mammogram since surgery - it wasn't too bad at the time, but it sure did hurt afterwards and today - I guess it is the scar tissue being manipulated - ouch!!! Will hear in a week if all is well. Morwenna - I am also grateful that I don't have to take the tamoxifem or any thing like that, since I am also triple negative! I think it is great that all you Calgary ladies can meet up today - have fun. The BC girls are getting together this coming Saturday, and I am so looking forward to meeting my online friends in person!",
      "MessageIndex": 5350,
      "PostDate": "22/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 29, 2013 10:25PM adagio wrote: Edi - how great that you can type a post on your new phone - I am still using my original flip phone - but my husband has an iPhone so I am well aware of the benefits. That is so discouraging for your ED with that shoddy workmanship - sounds like it could be quite a big job! I had a friend who had cataracts done recently and she said it was no biggie - took only a few minutes with the laser - however, it sounds like a big thing to me. When is that going to happen. Benny - glad you got through the biopsy - now the waiting begins - positive vibes are coming your way. Liefie - isn't this glorious weather we are having - I am trying to be outside as much as possible since I heard that the rain is coming in a day or so! Glad you got back safely on the little plane - it was so great to meet you here in Vancouver. Momof2 - hope things continue to go well for you and that the pain continues to be manageable.",
      "MessageIndex": 5458,
      "PostDate": "29/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 4, 2013 11:03AM adagio wrote: Morwenna - is that Waikiki beach? Beautiful rainbow. Good luck with your competition - what is the name of your chorus?",
      "MessageIndex": 5516,
      "PostDate": "04/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 6, 2013 01:28AM adagio wrote: liefie - sorry to hear that your son is having such a challenging time with the passport office - what a stress for him and you! Is this the son who is getting married there next month? So much red tape!!! Good luck to your son and I hope he is successful in keeping his S.A. Citizenship.",
      "MessageIndex": 5540,
      "PostDate": "06/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 15, 2013 10:21PM adagio wrote: You ladies on here have made me laugh so much with the last few posts!!! Liefie - I am not too surprized that you are not into the shackle thing. I haven't read 50 shades, so you are not alone there. So glad to hear that all is well for the South Africa trip - things seem to have fallen into place for you after a lot of hard work and emotional energy. It truly is amazing that after only one year you feel well enough to travel such a long way - you will be just fine. Yes, there is life after the treatments for breast cancer!!! Edi - you are so hilarious - I just can't imagine you being depressed! Sure hope that you will be feeling better soon. You mentioned that you had healing prayer at church at one time - I go for that regularly at my church and I must say that I find it most beneficial. We need all the help we can get in whatever form it takes. So glad that you have a nice new oven or stove as we call it here in Canada - I need one, but just don't want to take the time to go out and shop for one. I had a wonderful time in Mexico - the weather was glorious - I went into the ocean every day - lovely warm weather. Many walks on the beach, a sunset cruise around the Sea of Cortez, lots of food, and I even had Pina Colada three times. The greatest thing was not having to prepare food. I read 3 books and simply relaxed. Tomorrow I am on a full day silent retreat with my mindfulness based meditation group, so that should be interesting - I have never done anything like this before!! To everyone else - enjoy your weekend. Embrace each day and live it to the best of your ability. Each day is indeed a gift.",
      "MessageIndex": 5692,
      "PostDate": "15/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 26, 2013 01:41PM adagio wrote: Benny - sure hope you are feeling better soon! Rest up and drink lots of fluids. Healing thouts coming your way. Hugs!",
      "MessageIndex": 5807,
      "PostDate": "26/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 27, 2013 11:15PM adagio wrote: nihahi - very well said! Yum - turkey!!",
      "MessageIndex": 5818,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 18, 2013 06:20PM adagio wrote: jackpot - they tend to be overly cautious just to cover their rear end - they don't want you suing them if anything goes wrong. If It were me, I would probably drive, but with the understanding that if anything happened that it would be my entire responsibility. Yeah  for finishing chemo - it is a milestone!",
      "MessageIndex": 6034,
      "PostDate": "18/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 9, 2014 01:08PM adagio wrote: Ethan - can certainly identify with wanting to run away! Have felt like it many many times myself. Do you know which chemo drugs you are going to get?  Are you triple negative? Perhaps you can post your stats from your lab report so that we can be of more help. Good luck with chemo - all the ladies her will be helpful since we have all been there - it is not pleasant, but it is manageable most of the time. Look after yourself and rest when you need to - take short walks outside every day and drink lots of fluids. I drank a lot of lemon ginger tea with honey in it.",
      "MessageIndex": 6137,
      "PostDate": "09/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 25, 2014 12:57AM adagio wrote: Edi - hugs coming your way - your honesty is so refreshing. I saw a counsellor many years ago long before breast cancer appeared on the scene, and honestly, it was very beneficial. The counsellors are there to listen to us and help us work through our 'stuff'. The only down side was that the hour went by so darned quickly. Keeping busy is a good thing as long as we don't allow ourselves  to get too tired. Have a wonderful weekend ladies - I am out shopping for wedding invitations tomorrow - one DD has chosen her dress, so now on to the other details. It is kind of fun, but there is just too much choice these days compared to when I got  married, so it makes it more difficult. I am trying to relax into the experience and enjoy!",
      "MessageIndex": 6201,
      "PostDate": "25/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 4, 2014 12:03AM adagio wrote: Edi - just curious as to why you are getting the bone scan done? Routine - or did you request it?  Had a bone scan done prior to treatment, but not after treatment. I also had a bone density scan done, but that is something I have done periodically because of osteoporosis. Good luck tomorrow - let us know how it goes.",
      "MessageIndex": 6228,
      "PostDate": "04/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 5, 2014 05:49PM adagio wrote: liefie - how exciting to be visiting your daughter so soon to her due date - this is such a special time in her life and in yours. It is so great that you can combine a family trip with seeing bco friends as well - have an awesome trip. I am just about to go out for my daily walk and I agree it is darned cold it hasn't gone above zero degrees all day - brrrr!!! At least it is sunny and the mountains are spectacular. Have a safe and wonderful trip!",
      "MessageIndex": 6239,
      "PostDate": "05/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 23, 2014 01:32PM - edited Feb 23, 2014 01:32PM by adagio liefie -- sorry you are not feeling so great these days. Have you ever tried taking a vitamin b complex - I find it  very beneficial when I have mouth ulcers - just within a day or two the ulcers seem to clear up. I think it is a sign that you are a little but run down, so take it easy and look after yourself well. Hugs!!",
      "MessageIndex": 6322,
      "PostDate": "23/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 26, 2014 03:49PM adagio wrote: liefie - how very exciting - praying that all will go well with the labour and delivery - waiting for the baby's arrival requires a lot of patience.  Momof2 - relieved that all went fine for you - now to move on to a new normal! Morwenna - do keep us up to date - thinking of you!",
      "MessageIndex": 6363,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 1, 2014 02:02AM adagio wrote: liefie - good that the surgery is now behind you - hoping for a speedy recovery for you and a satisfactory outcome. Take care of yourself. ",
      "MessageIndex": 6513,
      "PostDate": "01/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 11, 2014 10:59AM adagio wrote: momof2 - I am so impressed at how much you are doing for your daughter's wedding!!! I have two daughters getting married a month apart, and while I am plenty involved, I just can't see myself doing the centrepieces so close to the actual day - I would find it way too stressful, and that is something I definitely try to avoid these days. When is the wedding? It must be very soon! I am sure it will turn out to be a wonderful day. I honestly think getting married these days is a lot more complicated than it used to be!!!!  Edi - good news that you don't need the other eye done, and glad to hear that the surgery eyeis doing better! An Easter egg hunt sounds great for the little ones - hopefully the weather will be nice! DH walking 5 miles a day is very impressive. Liefie - hope you are continuing to do well after the surgery. Websister - take it easy - part time work sounds ideal considering your fatigue. Movie and Morwenna - both your Moms are so fortunate  to have you in their very senior years. My Mom died when she was only 54 years old due to a brain hemorrhage! Nihahi -  glad spring has arrived in Alberta - enjoy! The news about my sister is that they now have her at home on a morphine patch which is controlling her pain very well - I talked to her a few days ago, and she is cheerful and comfortable. They are considering some form of chemo to shrink the tumours in her liver because it is pusing on her lung and causing her shortness of breath - not sure if she will go for that or not. Since my falls a couple of months ago, I have some residual swelling around the torso, so I went for lymphatic drainage yesterday - it was very interesting - very gentle, and it did seem to get things moving. I am getting quite discouraged about my arm which is still very painful  - had it re x-rayed and now doctor wants a bone scan to rule out 'anything else'. You know where my mind goes when that is said - so trying to not stress! Off to a funeral today of a dear friend who was diagnosed after me - will be a difficult day.",
      "MessageIndex": 6530,
      "PostDate": "11/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 20, 2014 11:04PM adagio wrote: Went to see oncologist for 3 month check up - all is well!  yeah!!!   No cancer in the bone of the arm so I am very relieved! Just need to be patient with the healing process. Morwenna - thinking of you and your Mom. Take care ladies and hope you are enjoying some special time with your families. I have eaten way more than I ordinarily do and totally different food - back to basics tomorrow!!",
      "MessageIndex": 6543,
      "PostDate": "20/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 30, 2014 08:51AM adagio wrote: Edi - warm hugs and kind thoughts are coming to you all the way from Canada! So sorry to hear that you are going through a tough time - I totally understand it. But I do believe that nihahi is right about getting out each and every day. The pain I have felt the last 3 months has really pulled me down mentally, and I have felt so emotionally fragile - and to be honest , if I didn't have my lovely dog to take for a walk every day, I know I would have felt much, much worse. I hope you start to feel much better soon - take great care of yourself - you have been through a lot recently and everything takes time!!!",
      "MessageIndex": 6587,
      "PostDate": "30/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 8, 2014 12:29AM adagio wrote: liefie - hope your back is feeling better soon. Isn't it interesting just how much our bodies need the movement and how if we miss out on our yoga/exercise/walks etc - that our bodies let us know. Take it easy for a few days and then hopefully you can get back to your yoga. Momof2 - sorry that your shoulder is bothering you - I can so identify with shoulder pain since I am just at the recovery phase after suffering from a frozen shoulder and the pain is excruciating!! Now I can so empathize with people with sore shoulders and arms - it is so debilitating, and personally I found that it got me feeling very down. In terms of energy returning after treatments  -  I have read that it takes up to 2 years after the end of treatments to get full energy back.   I am just over 1 year post treatments, and. I still take the odd nap in the afternoons, some days  I think I am all back to normal, then other days I feel I need more rest. You are still in early days and maybe you need to allow your  body more time to recuperate - particularly after the stress of a wedding and all. Good luck with the renovations at your cottage, and enjoy that wonderful ocean!",
      "MessageIndex": 6742,
      "PostDate": "08/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 19, 2014 12:52PM adagio wrote: Edi - was getting excited about wedding, but the bride had a bad accident last weekend and fractured her collarbone quite badly - she is in so much pain -  just don't know how she is going to manage to get the dress on because she can't move her arm at all! Very bad timing, and absolutely devastating. She goes to see an orthopaedic surgeon this Monday and they will decide whether to do surgery or not - will depend on how the bone is uniting! Praying for the best for her. Good news for me at my MO - she said I am doing very well and she is happy - so that is good - still wants to see me every 3 months. Jackpot - good luck with the decision making process - if it hurts, I think it is best to have something done, since pain is no fun to live with. Momof2 - how the time at your cottage has flown by - I hope you have found it a restorative time - I am so looking forward to a break after the weddings are all over - just off to shop today for a dress! You should definitely get your shoulder looked at - that is just one of the worst types of pain because we use the shoulder joint for almost everything. I certainly would have the same concern as you  being on painkillers for so long, but sometimes the need to take them is unavoidable!!! I am so glad that mine is finally feeling better, but will still need to do more more physio to improve the range of motion.",
      "MessageIndex": 6885,
      "PostDate": "19/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Sep 3, 2014 06:23PM adagio wrote: liefie - I must say that I share your husband's feelings about cruises and the notion of feeling like a caged lion rings very true with me. I have never been on a cruise simply because I like to be on the go all the time, but one day I will take a cruise - please let me know how y like it! Hope you have a fabulous time! Morwenna - that totally sucks being left dangling like that in regards to your surgery! First you had your hopes up and now you have been totally let down. Perhaps October is just not the right time for you - keep busy, and before you know it, January will be here.  Websister - how awful to have to wait so long to get action on your ankle  - that is total frustration! You must have the patience of a saint to live with that. Have you considered trying to go privately? It may not be as expensive as you think, and if you can afford it, it might be worth checking out. Just my 2 cents worth! Bridal shower for DD#2 is this coming weekend, and the wedding is a mere 2 weeks away after that - this girl is so disorganized and has left so much stuff to the very last minute!!! Hoping I will survive. I do not even have a dress to wear yet - help!!! My out of town company have all left now, so at least I have a bit of emotional space and some peace and quiet to collect my thoughts. I will be ready for a nice holiday of simply relaxing and doing nothing after all the excitement of 2 weddings. I am hanging in there.",
      "MessageIndex": 7008,
      "PostDate": "03/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Sep 30, 2014 09:05PM adagio wrote: congratulations mom of 2  - hope you now get the blood pressure sorted out.  Tomorrow is October and I cannot believe how fast the time is going by - getting the house cleaner each day after a deluge of visitors over the summer. Now that all the kids have left the nest, I am loving the quietness and cooking for only DH and myself - bliss!!",
      "MessageIndex": 7065,
      "PostDate": "30/09/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 6, 2014 10:54PM adagio wrote: momof2 - look after yourself - hope the pain is not too bad for you. A brace will certainly slow y down for sure - is it your dominant side? ",
      "MessageIndex": 7084,
      "PostDate": "06/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 27, 2014 12:32AM adagio wrote: It has been a long time since I have posted and it is good to catch up on everyone's new! Morwenna - look forward to hearing about your MRI especially since it is for the chest wall - my tumour was a mere 3 mm from the chest wall so not much of a margin there at all for me. Let us know the outcome. Websister - so glad you got some movement on your MRI for your ankle - what is the plan in terms of treatment? Momof2 - you have had so much to deal with - your shoulder, your husband's thrombosis - hope you are hanging in there. Do you have the stitches out yet? Lots of love and prayers coming your way. Nihahi - love the pictures. Edi - hope your B12 results help explain your fatigue.  I have been having computer issues, but hopefully I will get them sorted out real soon. Both daughters' weddings are all behind me now and it just seems like a dream in many ways. No photos yet to show. Still clambering out of the post-wedding mess. Good news for me from my MO - I went to see her just a few days ago, and I have now graduated from 3 month appointments to 6 months - she said this is reason to celebrate - it is 2 years since my surgery - so it all sounds good, and I am relieved and grateful. Look forward to reading the posts more regularly now. Take care everyone.",
      "MessageIndex": 7113,
      "PostDate": "27/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 10, 2014 11:14AM adagio wrote: momof2 - sending big hugs your way!!!!",
      "MessageIndex": 7142,
      "PostDate": "10/11/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 23, 2012 10:18PM adagio wrote: Zohra - do you know what your neutrophil count was after your 8 neupogen shots. If your onc feels you need more, it is usually because of low counts - you should find out what they are. After my 1st chemo I had neupogen for 5 days and my white cell count dropped dramatically - the neutrophils were dangerously low at 0.3. After my second treatment I took 7 neupogen shots and they didn't drop as much - they were at 3.5 which is a decent number. I didn't like giving the shots so after the 3rd treatment I asked for Neulasta because it is a one shot deal - so we will see what the neutrophil count is after this time.",
      "MessageIndex": 1,
      "PostDate": "23/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/69/topics/797943",
      "Title": "Nupogen shots after each chemo zohra adagio"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 14, 2013 12:51PM adagio wrote: Dakota - I am so happy for you! Congratulations and well done. Hope all goes well.",
      "MessageIndex": 2244,
      "PostDate": "14/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 15, 2013 10:58PM adagio wrote: Dakota - you must be so relieved to have the taxol completed now. Lucky you. I got for #3 tomorrow and I am so scared of having another allergic reaction - if I get one this time, I think I will call it quits!! The oncologist has given me extra steroids to take this evening to help counter the reaction which probably means I will not get much sleep tonight - not ideal the day before chemo, but I have no choice. Hopefully I can rest and snooze after the Benadryl goes in there.  Enjoy your weekend! Sorry - don't know much about tamoxifem so can't help you there!",
      "MessageIndex": 2260,
      "PostDate": "15/02/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 30, 2013 11:47PM adagio wrote: Carla - I don't have tumor markers done either. I had triple negative breast cancer and there are no reliable markers for this kind of cancer. My oncologist doesn't like to do scans etc. unless there is good reason. I am fine with that!! Good for you switching teams - it is so important to have faith in your medical team!",
      "MessageIndex": 4722,
      "PostDate": "30/08/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 7, 2013 10:50AM adagio wrote: Edi - thinking of you while you go to the doctor for check up. Let us know how it goes. Good for you putting colour in your hair - it is something I think about since my hair came back pure white! Perhaps one day I will pluck up the courage to colour it - having said that -I am enjoying the chemo curls and most of my friends say they like my colour, but I think they are just trying to be nice LOL",
      "MessageIndex": 5103,
      "PostDate": "07/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 18, 2013 01:13AM adagio wrote: So glad that I am not the only one who doesn't know what an overlay is in relation to a wedding! Can't wait to hear!!",
      "MessageIndex": 5256,
      "PostDate": "18/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 18, 2013 04:25PM adagio wrote: liefie - what beautiful imagery for Benny in the tight circle of people who care for her! Love it.",
      "MessageIndex": 5263,
      "PostDate": "18/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 27, 2013 12:36AM adagio wrote: liefie - It was wonderful meeting you today at the B.C. get together - it was such a great time chatting to lots of new friends. How lovely it is to put faces to names! Hope your flight back went smoothly. Enjoy the rest of your weekend.",
      "MessageIndex": 5415,
      "PostDate": "27/10/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 21, 2013 12:00PM adagio wrote: momof2 - my MO didn't offer me the option of a port, and I was a bit upset because everyone else I knew had a port. However, I did just fine for 8 treatments, and they used the same tiny little vein on the back of my hand for all of them - it was incredible! The nurses are very skilled at finding the veins. What is MDS?",
      "MessageIndex": 5747,
      "PostDate": "21/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 27, 2013 02:02PM adagio wrote: momof2 - I agree with Nihahi - let your body rest - that was a very difficult thing for me to do because I am a do-er - always want to be on the move. But we just have to submit and take it easy - however, I did find that having a walk every day really helped me - I just imagined the walking moving those chemicals out of my body faster. I have Georgia on my bucket list as a place to visit especially Savannah - have you ever been there?",
      "MessageIndex": 5815,
      "PostDate": "27/11/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 2, 2013 10:37AM adagio wrote: Edi - may I please come for dinner? Sounds delicious! Morwenna - just cannot imagine driving in that weather - here in Vancouver, everything stands still if there is any white stuff! Be safe !",
      "MessageIndex": 5877,
      "PostDate": "02/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Dec 9, 2013 12:18AM adagio wrote: Edi - all the best for visit to the oncologist tomorrow. We are all in this together - some days I just can't be bothered with anything and it is usually because I am fatigued. This is where self-talk is useful - I remind myself not to beat myself up, but to remember what my body and mind have been through this past year and have compassion for myself (I learned this in my mindfulness course). It is challenging to have compassion for oneself, but it is something I am learning to do very slowly. Big hug to you and hoping that you will be feeling better soon. Do renew your passport and start travelling more if you can especially now that DH is retired - life is short. I think we all should plan for future trips and then if things in our lives change health wise, so our travel plans will also change. I am planning more travel now than I have ever done - it is a great distraction! Morwenna - I just finished decorating the Christmas tree and it was tiring, but it looks really nice and the house smells so good with the freshly cut tree. I like what you said about pacing ourselves and just doing small amounts of things - lowering our expectations, realizing that things will be different now.",
      "MessageIndex": 5986,
      "PostDate": "09/12/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 1, 2014 12:26PM - edited Jan 1, 2014 07:42PM by adagio nihahi - thanks for sharing yourself with us this past year. I understand about wanting to move on and shrinking our thoughts about cancer to the size of a dust mite - that is my intention for 2014. I wish you continued healing and strength . We will miss your contributions. Look after yourself!",
      "MessageIndex": 6093,
      "PostDate": "01/01/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 10, 2014 11:01PM adagio wrote: Ladies - you look FANTASTIC!!!  What a nice boost getting together must have been for you all and I am sure  that  good memories have been created.",
      "MessageIndex": 6265,
      "PostDate": "10/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 25, 2014 10:46PM adagio wrote: Morwenna - just can't imagine what you are going through right now - Thoughts and prayers are with you and like everyone else suggests -  I would definitely share with your husband - you shouldn't have to go through the anxiety alone. In your pocket tomorrow! Edi - great news on the bone scan results, must be a big relief for you.",
      "MessageIndex": 6346,
      "PostDate": "25/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 26, 2014 09:50PM adagio wrote: Morwenna - so relieved - thank God! You must be exhausted from all the worry. Sleep well. Liefie - thank God for the safe arrival of the little bundle of JOY. Enjoy being a grandma -it is so wonderful - congratulations! Lots to be grateful for today!",
      "MessageIndex": 6375,
      "PostDate": "26/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Feb 28, 2014 01:43PM adagio wrote: liefie - such a precious little bundle - bet you can't wait to hold her!! So perfectly beautiful.",
      "MessageIndex": 6392,
      "PostDate": "28/02/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 10, 2014 12:12PM adagio wrote: Edi - I am impressed that you can hang your washing out in March - that's great. I love hanging my laundry outside, but haven't done it this spring yet - although yesterday it was 14 degrees, so the weather looks like it is picking up.  I am still having a lot of pain in my arm and shoulder from my fall - it is impacting on my sleep at nights, having to get up and ice it, and walk around - not much fun, then I go back to bed around 5am, and sleep until 9:30, crazy sleeping schedule!  Today I have physio, so hopefully that will help. Liefie - welcome back to beautiful British Columbia. It must have been hard to leave little Em!! But at least she doesn't live in South Africa, so you will get to see her fairly often. Do you have a Facebook page with some photos on it - would love to see them if you don't mind sharing your Facebook with me. My little grandkids live in Quebec and I only get to see them about 4 times a year and on Skype, but that just isn't the same. Nihahi - tho photos are incredible - such untouched beauty. Morwenna - thinking of you, and will be in your pocket for Wednesday. Websister - glad your cold is finally better. Have a good day everyone!",
      "MessageIndex": 6424,
      "PostDate": "10/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Mar 25, 2014 10:29AM adagio wrote: Morwenna - praying that your Mom will be kept comfortable, and that you too will be comforted. Edi - glad the eye is a bit better now - I went for an eye exam, and the doc told me that there is a cataract growing on my right eye - now I am scared to have the surgery done after your experience!!  Mom of 2 - in your pocket today - hope surgery goes as planned!",
      "MessageIndex": 6493,
      "PostDate": "25/03/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Apr 17, 2014 02:02PM adagio wrote: I have my 3 month appointment today with the oncologist - hoping for good news! Liefie - have a great time in Edmonton visiting with the baby and your sons. So glad that you are happy with the results of  your reconstruction. To everyone else - have a Happy and blessed Easter and may the sun shine on all of us literally and metaphorically!!",
      "MessageIndex": 6537,
      "PostDate": "17/04/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "May 8, 2014 04:49PM adagio wrote: momof2 - just opened the thread and joy of joys - your news is fantastic!! So very happy for you. You will make it to Keiko cottage  - I love the Oregon Coast - have many fond memories of time spent in Arch Cape and Cannon Beach and Seaside, and of course the amazing Haystack Rock.  You must feel so energized by the news!!!",
      "MessageIndex": 6628,
      "PostDate": "08/05/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 23, 2014 01:26PM adagio wrote: Great news Morwenna - at least it is over and now you can breathe a little easier again. Have a great day.",
      "MessageIndex": 6822,
      "PostDate": "23/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jun 29, 2014 05:13PM adagio wrote: Edi - my weekend is a busy one with helping a daughter move out of her studio and creating space in my house for a lot of her stuff! It is a great opportunity to go through stuff and chuck a bit! Glad your concert went well - is choir all finished for the summer now? Prior to breast cancer, I sang in two choirs, the church choir and a community choir. I have taken a leave from the community one and currently just sing in the church choir - will decide what to do next year. After the weddings here, I would like to travel, so may not be able to commit to twice a week rehearsals. My eye is healing very well - now just dealing with the imbalance of vision  - seeing my optometrist next week to get fitted for a temporary contact on the unoperated eye - although I do miss my glasses a lot!",
      "MessageIndex": 6843,
      "PostDate": "29/06/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jul 15, 2014 07:00PM adagio wrote: Edi - I was just thinking about you and wondering about your scan - that is such wonderful news! Just try and get on with living now that you have the all clear - hope you had a good little break. I see my oncologist this Thursday, so hoping all will be well in my case too.",
      "MessageIndex": 6865,
      "PostDate": "15/07/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Aug 14, 2014 11:54AM adagio wrote: hi all - the wedding went great - I am still surrounded by tons of family, so lots of work. However, we are all on the Sunshine Coast for a week in a great place right on the beach and I have told them all that I am not cooking, so everyone is pitching in! There are 16 adults and our 2 little grandchildren - a full house. Still reading the posts when I get the chance! Take care everyone.",
      "MessageIndex": 6925,
      "PostDate": "14/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Oct 28, 2014 11:33AM adagio wrote: wambles - I think it's pretty normal for us all to be somewhat depressed at times, particularly if we dwell too much on our situations. Life is messy and sometimes we just have to plough through it and do the best we can. My suggestion would be to keep yourself as busy as possible so that your mind has less time to ponder. Big hugs to you!",
      "MessageIndex": 7124,
      "PostDate": "28/10/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 9, 2015 04:04PM adagio wrote: Edi - you look fabulous. Good for you going on a cruise - that is on my to do list, for sure. Glad that you are keeping well. I am looking forward to a less stressful year in 2015 . The year that has just passed was a challenging one",
      "MessageIndex": 7187,
      "PostDate": "09/01/2015",
      "ThreadURL": "https://community.breastcancer.org/forum/5/topics/792706",
      "Title": "In shock bennymuffins websister"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Nov 23, 2012 05:08PM adagio wrote: Lully - I struggled with doing chemotherapy, and I read so much that I thought my brain would explode from all the information. The conclusion that I came to is that it is a risk either way. I had such a bad headache up until the day I made the decision to have chemo - once I made the decision, the headache left. I have only had one treatment and it was not pleasant, but I have made the choice and I will forward with it. I am just as undecided about radiation - in fact - I may consider not doing that because my cancer is left sided and I worry about the lung and heart being in the line of the radiation beam. These are very tough decisions and are very consequential. Good luck with your decision. I am triple negative which is a fairly aggressive cancer, so I think that helped me with my decision.",
      "MessageIndex": 7,
      "PostDate": "23/11/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/70/topics/796591",
      "Title": "Has anyone decided not to do chemo? Lully adagio"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 16, 2013 04:49PM adagio wrote: marian - who did you ask about the counselling session? Is there a charge for that or is it all part of the service. I'd like to do that. Also, did you take Emend after your taxol or any anti-nausea meds? My MO didn't seem to think I would need them. ",
      "MessageIndex": 521,
      "PostDate": "16/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    },
    {
      "AuthorID": "adagio",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/162844/profile",
      "Content": "Jan 15, 2013 11:12PM adagio wrote: marian - so happy that you have made it past taxol #3 - you are most definitely on the countdown now!!  Yeah! Did you experience any of the bone or joint pain that so many women experience?  I am having taxol #1 on Friday morning - hoping it goes OK - I always have the initial apprehension of a new drug and different side effects.  Also, I am freaked by the possible neuropathy - but I guess I will wait and see how my body reacts to it.",
      "MessageIndex": 501,
      "PostDate": "15/01/2013",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/797616",
      "Title": "January 2013 surgery JRMH Lbwagner69"
    }
  ]
}