{
  "AuthorID": "adangel",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126489/profile",
  "Posts": [
    {
      "AuthorID": "adangel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126489/profile",
      "Content": "Mar 23, 2011 04:54AM adangel wrote: Hi Tinaj, Your situation seems so similar to mine.  I also had a non-palpable tumour that was found using a digital mammogram - like your story, no one could feel it, even knowing were it was.  I also needed the needle localisation technique before the lumpectomy, along with a wire insert.  Apparently, my left breast is extremely dense (personally, I find that a bit unfair).  The doc even had trouble getting the wire in - I think his exact comment was \"your breast is too strong for my needle\" - ha - that will teach you to call it dense! Like you, surgery produced a surprise DCIS of 1.3 cm to complement the 1.1 cm IDC - all hormone positive and her2 negative.  Thankfully all nodes were clear.  At that point, I thought I'd get away with rads and hormone.  But, had the oncotype test and scored 29 so now I'm doing chemo as well.  Started yesterday. How are you doing?  ",
      "MessageIndex": 7014,
      "PostDate": "23/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    },
    {
      "AuthorID": "adangel",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/126489/profile",
      "Content": "Mar 27, 2011 02:13PM adangel wrote: Are there any other stage 1 sisters going through chemo?  Highish oncotype cx score put a kink in the plan.  Just finished first round of FEC chemo.  2 more to go and then 3 rounds of \"T\".  Feeling pretty ok - considering...",
      "MessageIndex": 7091,
      "PostDate": "27/03/2011",
      "ThreadURL": "https://community.breastcancer.org/forum/108/topics/743394",
      "Title": "CALLING ALL STAGE I SISTERS sheila888 MCBaker"
    }
  ]
}