{
  "AuthorID": "ADDK",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
  "Posts": [
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "Jun 23, 2018 03:21AM ADDK wrote: Stage IIB Feb. 2017, poor response to neoadjuvant treatment, Stage IV June 2018 two months after finishing herceptin treatment. Skin mets irradiated area. CT-scan results pending.",
      "MessageIndex": 565,
      "PostDate": "23/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/845638",
      "Title": "How Many Are We? zarovka SimonH"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "Jan 6, 2019 12:18AM ADDK wrote: I have opted out of scans, which are offered every 9 weeks for MBC in Denmark (public healthcare). I have this \"body phobia\" meaning that even listening to people talking about body stuff makes me either faint or cry. During visits to the hospital, I instruct the staff not to chat to me about what they are doing or seeing. During blood work etc. I place paper tissues over my eyes – yep like a five-year-old: What I can´t see isn´t there :-)",
      "MessageIndex": 9,
      "PostDate": "06/01/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/869169",
      "Title": "An Interesting Perspective on MBC Progression Monitoring Bestbird Heidihill"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "Mar 18, 2019 09:47AM ADDK wrote: ERkipper, I don’t have brain mets than I know of but am in the HER2Climb trial. I’m taking Xeloda+Herceptin+tucatinib/placebo. It is a phase II trial also admitting brain metsters. I think enrollment ends in May this year",
      "MessageIndex": 1322,
      "PostDate": "18/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "Mar 6, 2019 07:15AM ADDK wrote: Erkipper, I only had a short run on Kadcyla - five cycles or so. I was told to take 50 mg prednisolone (pill) one hour prior to treatment to prevent nausea, so I never had nausea. When you see you onc you could perhaps ask him about pre-meds to prevent nausea. I found Kadcyla very doable - brittle nails and runny dose from the Herceptin, only. Hoping for good results of your scan and wishing you all the best.",
      "MessageIndex": 1313,
      "PostDate": "06/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "ADDK wrote: Hello everybody, Recently diagnosed stage IV/metastatic shortly after finishing treatment. My cancer is either extremely aggressive and/or I´m resistant to Herceptin. I´m single, 56 years old, live alone and have a full time job that I love (worked through treatment), and (still) fit. I would really appreciate if other HER2+ girls would share their insight on what´s ahead of me. Did you have to quit your job or work part time? If so – at what point of time? How do you cope with day-to-day-matters? I have a large house and garden, and wonder when I will either need help or have to move. I know that we are all different and respond differently to treatment. Still, I would be grateful if you would share your experience with me. Thanks a lot! Dx 2/10/2017, Left, 4cm, Stage IIB, Grade 2, 3/16 nodes, ER-/PR-, HER2+ (FISH) Chemotherapy 2/23/2017 AC Surgery 8/8/2017 Mastectomy: Left; Reconstruction (left): Tissue expander placement Dx 6/10/2018, IDC, Left, Stage IV, metastasized to other, HER2+ (FISH) Targeted Therapy 10/25/2018 Kadcyla (T-DM1, ado-trastuzumab) Targeted Therapy 2/5/2019 Herceptin (trastuzumab) Chemotherapy 2/5/2019 Xeloda (capecitabine) Targeted Therapy Herceptin (trastuzumab) Chemotherapy Taxol (paclitaxel) Radiation Therapy Whole-breast: Breast, Lymph nodes, Chest wall Targeted Therapy Perjeta (pertuzumab) Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "24/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/865419",
      "Title": "Her2+ stage IV: What´s ahead? ADDK Jacque1102"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "Jun 24, 2018 11:45PM ADDK wrote: Illimae, grateful for your reply. Thanks a lot!",
      "MessageIndex": 2,
      "PostDate": "24/06/2018",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/865419",
      "Title": "Her2+ stage IV: What´s ahead? ADDK Jacque1102"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "Mar 15, 2019 07:27PM ADDK wrote: Lisbet, I`m sorry for what your going through. I don`t have liver mets.that I know of (resultat of latest scan pending), but I`m also in DK, and know our rigid system. I go to Herlev and have learned from experience that if you are really persistent it is possible to get the MOs to think a little outside the box and also speed up things - including scans. If you feel that you have the strength you could try to challenge “the system” by being annoyingly persistent",
      "MessageIndex": 10836,
      "PostDate": "15/03/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/809420",
      "Title": "How are people with liver mets doing? blondie1 JFL"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "Apr 1, 2019 11:48AM ADDK wrote: Erkipper, I had a short run on TDM-1 (5 cycles) and did indeed have a runny nose. It is due to the Herceptin. I´ve been on Herceptin on and off, and each time I start all over I get a runny nose, which lasts for about 5 months. After my second cycle of TDM-1 I started to have a little bloody nose, too (aka rupture of small blood vessels). I started Herceptin again about two months ago (every three weeks), and apart from the runny nose I have a bloody nose the first week after infusion. I hope you get a very long run on TDM-1 - it is a really doable drug compared to so many of the other treatments that we expose ourselves to.",
      "MessageIndex": 1336,
      "PostDate": "01/04/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/817731",
      "Title": "Who's on Kadcyla/TDM1? Trish03 Denny123"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "May 15, 2019 08:20AM ADDK wrote: Elderberry, as Illimae said HER2 pos. cancer is more likely to spread to the brain. I recurred with IBC, and have had extensive skin mets for over a year, spread to lymph nodes and the opposite breast. I´ve just had my last brain MRI as part of a clinical trial that I signed up for. All clear. Yes, your cancer may spread to your brain, but not right now :-) I´m so sorry about your anxiety. Could you work on becoming a weirdo like me? I really never worry about scan results. What´s there is there, and my worries won´t change that, just make me miserable. Sending you gentle hugs.",
      "MessageIndex": 4,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/871541",
      "Title": "HER2+ and MRI Scanxiety Elderberry Elderberry"
    },
    {
      "AuthorID": "ADDK",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/275911/profile",
      "Content": "May 15, 2019 03:39PM ADDK wrote: Elddrberry, I’m in the Copenhagen area. I just remembered the talk I had with my MO as I recurred. I said well, it’s going to spread to my brain soon (cf. the stats), so I guess it’s going rapidly down hill with me. She replied: Oh, no, no. This is no longer the case for brain metsters, they can go on for years.",
      "MessageIndex": 8,
      "PostDate": "15/05/2019",
      "ThreadURL": "https://community.breastcancer.org/forum/8/topics/871541",
      "Title": "HER2+ and MRI Scanxiety Elderberry Elderberry"
    }
  ]
}