{
  "AuthorID": "adowd12",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204230/profile",
  "Posts": [
    {
      "AuthorID": "adowd12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204230/profile",
      "Content": "adowd12 wrote: My mom is 6 weeks out of a double mastectomy with reconstruction (TE). Everything seemed to be moving along (JP drains were removed by PS when they drained 15ml or less). This past week I noticed the incision on her right side was losing its scab. The left was already smooth and seemed to be healing accordingly. Once the scab on the right side had worn away I noticed what seems to be an opening or hole for lack of a better term about a half inch wide in diameter. It seemed to be producing a small amount of white puss. I was so concerned I immediately rushed her to her BS (PS is on vacation) he prescribed my mom ointment and told her to shower and apply the ointment 2x a day and cover with sterile gauze. She's was also prescribed antibiotics. Over the past few days I can't say this incision is looking any better, it seems to still be producing puss and not scabbing over or healing in any way. My mom is so worried and I hate seeing her like this her bravery is beginning to wear out. I was wondering has anyone out there experienced their wound opening a bit and revealing a white substance? What should we do? We have a follow up appointment after the weekend, but I would love to be able to make her feel better. Thank you so much, well wishes and hugs to all!!! Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "22/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/823854",
      "Title": "Incision beginning to open 6 weeks post op?? adowd12 terimccollum"
    },
    {
      "AuthorID": "adowd12",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/204230/profile",
      "Content": "Aug 25, 2014 07:25PM adowd12 wrote: hello all,  I am currently writing this from the hospital. I brought my mom in because she began a fever. Unfortunately she is going to need both tissue expanders out. Her wounds we're not responding to antibiotics. I thank you all for your advice and kind words. We're just beginning this long journey and finding it difficult to navigate at the moment, but I know she will persevere. Thanks again! ",
      "MessageIndex": 4,
      "PostDate": "25/08/2014",
      "ThreadURL": "https://community.breastcancer.org/forum/91/topics/823854",
      "Title": "Incision beginning to open 6 weeks post op?? adowd12 terimccollum"
    }
  ]
}