{
  "AuthorID": "adydasco",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161968/profile",
  "Posts": [
    {
      "AuthorID": "adydasco",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161968/profile",
      "Content": "Oct 6, 2012 01:14PM adydasco wrote: Hi, I just experienced the same thing. I have implants too. I am 45 and hadn't had a mamo since the implants 2 and a half years ago. I recently starting having tenderness in my right armpit and an occasional pain in my right breast. I went to the gyno last Tues. He said he didn't feel anything but sent me to have a digital mamo and ultrasound if necessary the same day. Tech doing the digital mamo said these look great. I go back to the waiting room, another tech comes in and says they need more pics because of implants. We do that and I go back to waiting room; another tech comes and says the radiologist wants un ultrasound. The tech focuses on my right breast below the nipple. We get that done and I finally get to talk to the radiologist. He says there was a tiny spec( almost couldn't see it) on the digital mamo and a 3-4mm oval shaped nodule with smooth borders came up on the ultrasound. He ordered a breast MRI that Friday. I am waiting for the results. I have a really bad feeling. My heart goes out to you. I have been a crying mess. I just can't believe this is happening. Sending prayers and love ; you are not alone.",
      "MessageIndex": 8,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/794066",
      "Title": "Mammo clear, mass found on ultrasound morningperson morningperson"
    },
    {
      "AuthorID": "adydasco",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/161968/profile",
      "Content": "Oct 6, 2012 01:55PM adydasco wrote: Hello, I couldn't figure out why the dr wanted to do an MRI and not a biopsy. Either way I am a nervous wreck. I think you should have the biopsy. I am just not mentally strong enough to wait 3 months. I am totally expecting for the Dr to call Monday and say that I need one. All this is new to me but if I have been understanding all this information; a biopsy is the only way to be sure if a mass is benign or cancer. I have learned one thing through this the earlier you know for sure the better. I do think that if the surgeon thought there was a chance your mass was cancer I think he wouldn't have given you a 3 month waiting peroid. I don't think any woman with any unknown mass in her breast should wait a month , 3 months  or 6 months. There is just too much at stake. I have been thinking worst case for the past week and I have never been so scared in my life. I wish he had given me a biopsy instead of an MRI. I just need an answer whether its bad or good. I am going crazy.",
      "MessageIndex": 10,
      "PostDate": "06/10/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/62/topics/794066",
      "Title": "Mammo clear, mass found on ultrasound morningperson morningperson"
    }
  ]
}