{
  "AuthorID": "Aesong",
  "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166208/profile",
  "Posts": [
    {
      "AuthorID": "Aesong",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166208/profile",
      "Content": "Aesong wrote: Hello, I'm 25 and gave birth to a little boy in May who I'm currently breastfeeding. Around November 17th I started developing chest pains on the left side, with occasional sharp shooting pains. An area of my breast was also sore/tender to the touch. Initially I thought that it was a clogged duct causing the soreness, but saw a GP about the chest pain in early December. I was given an EKG, a stress test, and a blood test that checked my cholesterol and thyroid. From that they found that I had subclinical hypothryoidism. The soreness and tenderness has continued in my breast, and I still occasionally have sharp shooting pains, but the chest pain overall is less severe. I decided to see my OB/GYN a few days ago, and was able to see him today. He told me that he believes it's a cystic area, and I'm now scheduled to get an ultrasound on Friday. He told me that if the problem persisted that in 2 weeks he would refer me to a general surgeon. I'm really concerned. I know that my chances of having breast cancer are very slim, considering my age and I have no family history of breast cancer. The pain I'm feeling is pretty frightening though, and it's hard for me to believe that a cyst could be causing most of the problems I'm having with chest pains, etc. I'm probably over-reacting. What should I expect from this ultrasound? Are there things I should question or watch out for? He decided not to do a mammogram because he feels that it would be ineffective due to me being so young as well as breastfeeding. Thank you in advance!  Log in to post a reply",
      "MessageIndex": 0,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797819",
      "Title": "25, having tests and worried Aesong beacon800"
    },
    {
      "AuthorID": "Aesong",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166208/profile",
      "Content": "Dec 19, 2012 05:05PM Aesong wrote: Thank you for your reponse. :) You made me feel better. My obgyn did tell me that it was possibly a clogged duct that was just persistent, but told me they would find out with the ultrasound. He doesn't think that it's mastitis because it's been almost a month and I've had no fever. The area is very sore and tender to the touch, with the chest pains and occasional sharp shooting pain. My mom had a benign lump removed after she was finished with nursing my sister, and told me that it was never painful. I haven't had any odd discharge, no swelling or inflammation, nothing that would alert me to something more serious. I'll definitely follow through and get whatever they ask done. I've gone from someone petrified of medical procedures/needles to being poked at all of the time! My fear is probably a big reason why I'm overreacting.",
      "MessageIndex": 2,
      "PostDate": "19/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797819",
      "Title": "25, having tests and worried Aesong beacon800"
    },
    {
      "AuthorID": "Aesong",
      "AuthorURL": "https://community.breastcancer.orghttps://community.breastcancer.org/member/166208/profile",
      "Content": "Dec 22, 2012 05:39PM - edited Dec 22, 2012 05:48PM by Aesong I have an update: I went to get the ultrasound yesterday morning. The ultrasound showed normal breast tissue, but she only looked at the area that was tender/sore. When I got home my husband discovered a lump (presumably what the OBGYN had found) in a completely different area from what they scanned. The lump feels maybe a little smaller than a marble, it's smooth, and I can't really tell if it moves or not. If it moves, it barely moves at all. I'm going to call and let my obgyn know, and they gave me a list of breast surgeons that I could be referred to. Should I request another ultrasound? Because it's the holiday weekend I can't get ahold of anyone, and the office closed at noon yesterday. Can I request a biopsy when I see the breast surgeon or do I need to request that from the obgyn?",
      "MessageIndex": 4,
      "PostDate": "22/12/2012",
      "ThreadURL": "https://community.breastcancer.org/forum/83/topics/797819",
      "Title": "25, having tests and worried Aesong beacon800"
    }
  ]
}